[
    {
        "Title": "U.S. Treasury Lifts Tornado Cash Sanctions Amid North Korea Money Laundering Probe",
        "Link": "https://thehackernews.com/2025/03/us-treasury-lifts-tornado-cash.html",
        "Summary": "The U.S. Treasury Department has announced that it's removing sanctions against Tornado Cash, a cryptocurrency mixer service that has been accused of aiding the North Korea-linked Lazarus Group to launder their ill-gotten proceeds.\n\"Based on the Administration's review of the novel legal and policy issues raised by use of financial sanctions against financial and commercial activity occurring",
        "Date": "2025-03-22",
        "Content": "The U.S. Treasury Department has announced that it's removing sanctions against Tornado Cash, a cryptocurrency mixer service that has been accused of aiding the North Korea-linked Lazarus Group to launder their ill-gotten proceeds.\n\"Based on the Administration's review of the novel legal and policy issues raised by use of financial sanctions against financial and commercial activity occurring within evolving technology and legal environments, we have exercised our discretion to remove the economic sanctions against Tornado Cash,\" the Treasury\nsaid\nin a statement.\nIn conjunction with the move, over\n100 Ethereum (ETH) wallet addresses\nare also being removed from the Specially Designated Nationals (SDN) list.\nThe department's Office of Foreign Assets Control (OFAC)\nadded\nTornado Cash to its sanctions list in August 2022. It was estimated to have been used to launder more than $7.6 billion worth of virtual assets since its creation in 2019, the Treasury said at the time.\nHowever, a U.S. Fifth Circuit court issued a decision in November 2024, reversing a decision about the mixer, ruling that OFAC \"overstepped its congressionally defined authority\" when it sanctioned the cryptocurrency mixer.\nThis stemmed from the court's view that OFAC's ability to sanction entities does not extend to Tornado Cash because its immutable smart contracts cannot be deemed as \"property\" under the International Emergency Economic Powers Act (IEEPA).\n\"With respect to immutable smart contracts, the court reasoned, there is no person in control and therefore 'no party with which to contract,'\" according to\ndocuments\nfiled by the Treasury Department as part of the case.\nIt further said it remains committed to using its powers to combat and disrupt malicious cyber actors from exploiting the digital assets ecosystem, and it will do everything in its capacity to restrict the ability of North Korea to fund its weapons of mass destruction and ballistic missile programs.\n\"Digital assets present enormous opportunities for innovation and value creation for the American people,\" said Secretary of the Treasury Scott Bessent.\n\"Securing the digital asset industry from abuse by North Korea and other illicit actors is essential to establishing U.S. leadership and ensuring that the American people can benefit from financial innovation and inclusion.\"\nLast May, a Dutch court on Tuesday\nsentenced\nAlexey Pertsev, one of the co-founders of Tornado Cash, to 5 years and 4 months in prison. Two of its other founders Roman Storm and Roman Semenov were indicted by the U.S. Department of Justice in August 2023.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft Trust Signing service abused to code-sign malware",
        "Link": "https://www.bleepingcomputer.com/news/security/microsoft-trust-signing-service-abused-to-code-sign-malware/",
        "Summary": "Cybercriminals are abusing Microsoft's Trusted Signing platform to code-sign malware executables with short-lived three-day certificates. [...]",
        "Date": "2025-03-22",
        "Content": "Cybercriminals are abusing Microsoft's Trusted Signing platform to code-sign malware executables with short-lived three-day certificates.\nThreat actors have long sought after code-signing certificates as they can be used to sign malware to appear like they are from a legitimate company.\nSigned malware also has the advantage of potentially bypassing security filters that would normally block unsigned executables, or at least treat them with less suspicion.\nThe holy grail for threat actors is to obtain Extended Validation (EV)  code-signing certificates, as they automatically gain increased trust from many cybersecurity programs due to the more rigorous verification process. Even more important, EV certificates are believed to gain a reputation boost in SmartScreen, helping to bypass alerts that would normally be displayed for unknown files.\nHowever, EV code-singing certificates can be difficult to obtain, requiring them to be stolen from other companies or for threat actors to set up fake businesses and spend thousands of dollars to purchase one. Furthermore, once the certificate is used in a malware campaign, it is usually revoked, making it unusable for future attacks.\nAbusing Microsoft Trusted Signing service\nRecently, cybersecurity researchers have seen threat actors utilizing the\nMicrosoft Trusted Signing service\nto sign their malware with short-lived, three-day code-signing certificates.\nThese malware samples are signed by \"Microsoft ID Verified CS EOC CA 01\" and the certificate is only valid for three days. While the certificate expires three days after being issued, it is important to note that executables signed with it will still be considered valid until the issuer revokes the certificate.\nSince then other researchers and BleepingComputer have found numerous other samples used in ongoing malware campaigns, including those used in a\nCrazy Evil Traffers\ncrypto-theft campaign [\nVirusTotal\n] and Lumma Stealer [\nVirusTotal\n] campaigns.\nSigned DLL from Crazy Evil traffers campaign\nSource: BleepingComputer\nThe\nMicrosoft Trusted Signing service\nlaunched in 2024 and is a cloud-based service that allows developers to easily have their programs signed by Microsoft.\n\"Trusted Signing is a complete code signing service with an intuitive experience for developers and IT professionals, backed by a Microsoft managed certification authority,\" reads a\nMicrosoft announcement\nfor the service.\n\"The service supports both public and private trust signing scenarios and includes a timestamping service.\"\nThe platform has a $9.99 monthly subscription service designed to make it easy for developers to sign their executables, while also offering additional security.\nThis increased security is accomplished by using short-lived certificates that can easily be revoked in the event of abuse and by never issuing the certificates directly to the developers, preventing them from being stolen in the event of a breach.\nMicrosoft also says certificates issued through the Trusted Signing service provide a similar SmartScreen reputation boost to executables signed by its service.\n\"A Trusted Signing signature ensures that your application is trusted by providing base reputation on smart screen, user mode trust on Windows, and integrity check signature validation compliant,\" reads an FAQ on the Trusted Signing site.\nTo protect against abuse, Microsoft is\ncurrently only allowing\ncertificates to be issued under a company name if they have been in business for three years.\nHowever, individuals can sign up and get approved more easily if they are okay with the certificates being issued under their name.\nA simpler path\nA cybersecurity researcher and developer known as 'Squiblydoo,' who has been tracking malware campaigns abusing certificates for years, told BleepingComputer that they believe threat actors are switching to Microsoft's service out of convenience.\n\"I think there are a few reasons for the change. For a long time, using EV certificates has been the standard, but Microsoft has announced changes to EV certificates,\" Squiblydoo told BleepingComputer.\n\"However, the changes to EV certificates really aren't clear to anyone: not certificate providers, not attackers. However, due to these potential changes and lack of clarity, just having a code-signing certificate may be adequate for attacker needs.\"\n\"In this regard, the verification process for Microsoft's certificates is substantially easier than the verification process for EV certificates: due to the ambiguity over EV certificates, it makes sense to use the Microsoft certificates.\"\nBleepingComputer contacted Microsoft about the abuse and was told that the company uses threat intelligence monitoring to find and revoke certificates as they are found.\n\"We use active threat intelligence monitoring to constantly look for any misuse or abuse of our signing service,\" Microsoft told BleepingComputer.\n\"When we detect threats we immediately mitigate with actions such as broad certificate revocation and account suspension. The malware samples you shared are detected by our antimalware products and we have already taken action to revoke the certificates and prevent further account abuse.\"\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft: New RAT malware used for crypto theft, reconnaissance\nMicrosoft says malvertising campaign impacted 1 million PCs\nMicrosoft: Exchange Online bug mistakenly quarantines user emails\nSteam pulls game demo infecting Windows with info-stealing malware\nVSCode extensions found downloading early-stage ransomware"
    }
]