[
    {
        "Title": "New Android Trojan Crocodilus Abuses Accessibility to Steal Banking and Crypto Credentials",
        "Link": "https://thehackernews.com/2025/03/new-android-trojan-crocodilus-abuses.html",
        "Summary": "Cybersecurity researchers have discovered a new Android banking malware called Crocodilus that's primarily designed to target users in Spain and Turkey.\n\"Crocodilus enters the scene not as a simple clone, but as a fully-fledged threat from the outset, equipped with modern techniques such as remote control, black screen overlays, and advanced data harvesting via accessibility logging,\"",
        "Date": "2025-03-29",
        "Content": "Cybersecurity researchers have discovered a new Android banking malware called\nCrocodilus\nthat's primarily designed to target users in Spain and Turkey.\n\"Crocodilus enters the scene not as a simple clone, but as a fully-fledged threat from the outset, equipped with modern techniques such as remote control, black screen overlays, and advanced data harvesting via accessibility logging,\" ThreatFabric\nsaid\n.\nAs with\nother\nbanking trojans\nof its kind, the malware is designed to facilitate device takeover (\nDTO\n) and ultimately conduct fraudulent transactions. An analysis of the source code and the debug messages reveals that the malware author is Turkish-speaking.\nThe Crocodilus artifacts analyzed by the Dutch mobile security company masquerade as Google Chrome (package name: \"quizzical.washbowl.calamity\"), which acts as a dropper capable of\nbypassing Android 13+ restrictions\n.\nOnce installed and launched, the app requests permission to Android's accessibility services, after which contact is established with a remote server to receive further instructions, the list of financial applications to be targeted, and the HTML overlays to be used to steal credentials.\nCrocodilus is also capable of targeting cryptocurrency wallets with an overlay that, instead of serving a fake login page to capture login information, shows an alert message urging victims to backup their seed phrases within 12, or else risk losing access to their wallets.\nThis social engineering trick is nothing but a ploy on the part of the threat actors to guide the victims to navigate to their seed phrases, which are then harvested through the abuse of the accessibility services, thereby allowing them to gain full control of the wallets and drain the assets.\n\"It runs continuously, monitoring app launches and displaying overlays to intercept credentials,\" ThreatFabric said. \"The malware monitors all accessibility events and captures all the elements displayed on the screen.\"\nThis allows the malware to log all activities performed by the victims on the screen, as well as trigger a screen capture of the contents of the Google Authenticator application.\nAnother feature of Crocodilus is its ability to conceal the malicious actions on the device by displaying a black screen overlay, as well as muting sounds, thereby ensuring that they remain unnoticed by the victims.\nSome of the important features supported by the malware are listed below -\nLaunch specified application\nSelf-remove from the device\nPost a push notification\nSend SMS messages to all/select contacts\nRetrieve contact lists\nGet a list of installed applications\nGet SMS messages\nRequest Device Admin privileges\nEnable black overlay\nUpdate C2 server settings\nEnable/disable sound\nEnable/disable keylogging\nMake itself a default SMS manager\n\"The emergence of the Crocodilus mobile banking Trojan marks a significant escalation in the sophistication and threat level posed by modern malware,\" ThreatFabric said.\n\"With its advanced Device-Takeover capabilities, remote control features, and the deployment of black overlay attacks from its earliest iterations, Crocodilus demonstrates a level of maturity uncommon in newly discovered threats.\"\nThe development comes as Forcepoint\ndisclosed\ndetails of a phishing campaign that has been found employing tax-themed lures to distribute the\nGrandoreiro\nbanking trojan targeting Windows users in Mexico, Argentina, and Spain by means of an obfuscated Visual Basic script.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "BlackLock Ransomware Exposed After Researchers Exploit Leak Site Vulnerability",
        "Link": "https://thehackernews.com/2025/03/blacklock-ransomware-exposed-after.html",
        "Summary": "In what's an instance of hacking the hackers, threat hunters have managed to infiltrate the online infrastructure associated with a ransomware group called BlackLock, uncovering crucial information about their modus operandi in the process. \nResecurity said it identified a security vulnerability in the data leak site (DLS) operated by the e-crime group that made it possible to extract",
        "Date": "2025-03-29",
        "Content": "In what's an instance of hacking the hackers, threat hunters have managed to infiltrate the online infrastructure associated with a ransomware group called BlackLock, uncovering crucial information about their modus operandi in the process.\nResecurity said it identified a security vulnerability in the data leak site (DLS) operated by the e-crime group that made it possible to extract configuration files, credentials, as well as the history of commands executed on the server.\nThe flaw concerns a \"certain misconfiguration in the Data Leak Site (DLS) of BlackLock Ransomware, leading to clearnet IP addresses disclosure related to their network infrastructure behind TOR hidden services (hosting them) and additional service information,\" the company\nsaid\n.\nIt described the acquired history of commands as one of the biggest operational security (OPSEC) failures of BlackLock ransomware.\nBlackLock is a\nrebranded\nversion of another ransomware group known as\nEldorado\n. It has since become one of the most active extortion syndicates in 2025, heavily targeting technology, manufacturing, construction, finance, and retail sectors. As of last month, it has listed 46 victims on its site.\nThe impacted organizations are located in Argentina, Aruba, Brazil, Canada, Congo, Croatia, Peru, France, Italy, the Netherlands, Spain, the United Arab Emirates, the United Kingdom, and the United States.\nThe group, which announced the launch of an underground affiliate network in mid-January 2025, has also been observed actively recruiting traffers to facilitate early stages of the attacks by directing victims to malicious pages that deploy malware capable of establishing initial access to compromised systems.\nThe vulnerability identified by Resecurity is a local file inclusion (\nLFI\n) bug, essentially tricking the web server into leaking sensitive information by performing a path traversal attack, including the history of commands executed by the operators on the leak site.\nSome of notable findings are listed below -\nThe use of Rclone to exfiltrate data to the MEGA cloud storage service, in some cases even installing the MEGA client directly on victim systems\nThe threat actors have created at least eight accounts on MEGA using disposable email addresses created via YOPmail (e.g., \"zubinnecrouzo-6860@yopmail.com\") to store the victim data\nA reverse engineering of the ransomware has uncovered source code and ransom note similarities with another ransomware strain codenamed\nDragonForce\n, which has\ntargeted\norganizations in Saudi Arabia (While DragonForce is written in Visual C++, BlackLock uses Go)\n\"$$$,\" one of the main operators of BlackLock, launched a short-lived ransomware project called Mamona on March 11, 2025\nIn an intriguing twist, BlackLock's DLS was defaced by DragonForce on March 20 – likely by exploiting the same LFI vulnerability (or something similar) – with configuration files and internal chats leaked on its landing page. A day prior, the DLS of Mamona ransomware was also defaced.\n\"It is unclear if BlackLock Ransomware (as a group) started cooperating with DragonForce Ransomware or silently transitioned under the new ownership,\" Resecurity said. \"The new masters likely took over the project and their affiliate base because of ransomware market consolidation, understanding their previous successors could be compromised.\"\n\"The key actor '$$$' did not share any surprise after incidents with BlackLock and Mamona Ransomware. It is possible the actor was fully aware that his operations could be already compromised, so the silent 'exit' from the previous project could be the most rational option.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "U.S. seized $8.2 million in crypto linked to 'Romance Baiting' scams",
        "Link": "https://www.bleepingcomputer.com/news/cryptocurrency/us-seized-82-million-in-crypto-linked-to-romance-baiting-scams/",
        "Summary": "The U.S. Department of Justice (DOJ) has seized over $8.2 million worth of USDT (Tether) cryptocurrency that was stolen via 'romance baiting' scams. [...]",
        "Date": "2025-03-29",
        "Content": "The U.S. Department of Justice (DOJ) has seized over $8.2 million worth of USDT (Tether) cryptocurrency that was stolen via 'romance baiting' scams.\nPreviously referred to as '\npig butchering\n,' in this type of financial fraud victims are manipulated into making investments on fraudulent websites/apps that showcase massive returns.\nConvinced they're making a profit, the victims invest increasing amounts, but when they attempt to make any significant withdrawals, they hit various problems that prevent them from completing the action.\nUltimately, they realize they invested in a fake platform and all their money went straight into the threat actors' pockets.\nBlockchain intelligence platform TRM Labs\nreports\nthat U.S. state investigators, primarily the FBI, uncovered laundering patterns of amounts linked to 'romance baiting' operators, enabling them to file a dual legal forfeiture:\nWire fraud (18 U.S.C. 981(a)(1)(C)) for directly traceable funds.\nMoney laundering (18 U.S.C. § 981(a)(1)(A)) for commingled or untraceable funds.\nThis allowed the full seizure of the assets. As explained in\nthe complaint\n, Tether Limited froze the funds in June 2024, burned the original USDT tokens, and reissued them into law enforcement-controlled wallets in November 2024.\nThe seizure opens the pathway for restitution to known victims, as well as others whom the FBI is attempting to locate by backward tracing the seized wallets.\nBackward victim tracing\nSource: TRM Labs\nThe complaint names five victims from Ohio, Michigan, California, Utah, and North Carolina, who collectively lost over $1.6 million. A total of 38 victimized cryptocurrency accounts with losses exceeding $5.2 million were confirmed.\nThe threat group behind the particular 'romance baiting' operation is believed to be tied to\nhuman trafficking syndicates\nin Cambodia and Myanmar.\nThe scam operation relied on typical tactics such as allowing initial small profit withdrawals to build trust, claiming \"taxation\" and \"credit score\" fees as pretexts for requesting more money, and then resorting to threats and intimidation once victims ran out of money.\nThe worst-case individual loss described in the complaint was that of a victim from Mentor, Ohio, who lost approximately $663,352 in total ($250,000 in initial investment, $174,400 in \"release fees,\" $238,946 in \"handling fees\").\nThe threat actors demanded another $300,000 to \"improve her credit score,\" but after having already liquidated her entire Roth IRA and life savings, she couldn't pay that amount. In response, the scammer threatened to harm her friends and family.\n'Romance baiting' scams can be devastating for victims, so looking for red flags and taking your time to confirm investment platform legitimacy is crucial.\nNever trust \"guaranteed returns\" investment opportunities and never invest more than you can afford to lose.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nU.S. recovers $31 million stolen in 2021 Uranium Finance hack\nBlockchain gaming platform WEMIX hacked to steal $6.1 million\nUS seizes $23 million in crypto linked to LastPass breaches\nUS seizes domain of Garantex crypto exchange used by ransomware gangs\nGrassCall malware campaign drains crypto wallets via fake job interviews"
    }
]