[
    {
        "Title": "Elastic Releases Urgent Fix for Critical Kibana Vulnerability Enabling Remote Code Execution",
        "Link": "https://thehackernews.com/2025/03/elastic-releases-urgent-fix-for.html",
        "Summary": "Elastic has rolled out security updates to address a critical security flaw impacting the Kibana data visualization dashboard software for Elasticsearch that could result in arbitrary code execution.\nThe vulnerability, tracked as CVE-2025-25012, carries a CVSS score of 9.9 out of a maximum of 10.0. It has been described as a case of prototype pollution.\n\"Prototype pollution in Kibana leads to",
        "Date": "2025-03-06",
        "Content": "Elastic\nhas rolled out security updates to address a critical security flaw impacting the\nKibana\ndata visualization dashboard software for\nElasticsearch\nthat could result in arbitrary code execution.\nThe vulnerability, tracked as\nCVE-2025-25012\n, carries a CVSS score of 9.9 out of a maximum of 10.0. It has been described as a case of prototype pollution.\n\"Prototype pollution in Kibana leads to arbitrary code execution via a crafted file upload and specifically crafted HTTP requests,\" the company\nsaid\nin an advisory released Wednesday.\nPrototype pollution vulnerability\nis a\nsecurity flaw\nthat allows attackers to manipulate an application's JavaScript objects and properties, potentially leading to unauthorized data access, privilege escalation, denial-of-service, or remote code execution.\nThe vulnerability affects all versions of Kibana between 8.15.0 and 8.17.3. It has been addressed in version 8.17.3.\nThat said, in Kibana versions from 8.15.0 and prior to 8.17.1, the vulnerability is exploitable only by users with the Viewer role. In Kibana versions 8.17.1 and 8.17.2, it can only be exploited by users that have all the below-mentioned privileges -\nfleet-all\nintegrations-all\nactions:execute-advanced-connectors\nUsers are advised to take steps to apply the latest fixes to safeguard against potential threats. In the event immediate patching is not an option, users are recommended to set the Integration Assistant feature flag to false (\"xpack.integration_assistant.enabled: false\") in\nKibana's configuration\n(\"kibana.yml\").\nIn August 2024, Elastic addressed another critical prototype pollution flaw in Kibana (\nCVE-2024-37287\n, CVSS score: 9.9) that could lead to code execution. A month later, it resolved\ntwo severe deserialization bugs\n(CVE-2024-37288, CVSS score: 9.9 and CVE-2024-37285, CVSS score: 9.1) that could also permit arbitrary code execution.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "EncryptHub Deploys Ransomware and Stealer via Trojanized Apps, PPI Services, and Phishing",
        "Link": "https://thehackernews.com/2025/03/encrypthub-deploys-ransomware-and.html",
        "Summary": "The financially motivated threat actor known as EncryptHub has been observed orchestrating sophisticated phishing campaigns to deploy information stealers and ransomware, while also working on a new product called EncryptRAT.\n\"EncryptHub has been observed targeting users of popular applications, by distributing trojanized versions,\" Outpost24 KrakenLabs said in a new report shared with The",
        "Date": "2025-03-06",
        "Content": "The financially motivated threat actor known as\nEncryptHub\nhas been observed orchestrating sophisticated phishing campaigns to deploy information stealers and ransomware, while also working on a new product called\nEncryptRAT\n.\n\"EncryptHub has been observed targeting users of popular applications, by distributing trojanized versions,\" Outpost24 KrakenLabs\nsaid\nin a new report shared with The Hacker News. \"Furthermore, the threat actor has also made use of third-party Pay-Per-Install (PPI) distribution services.\"\nThe cybersecurity company described the threat actor as a hacking group that makes operational security errors and as someone who incorporates exploits for popular security flaws into their attack campaigns.\nEncryptHub, also tracked by Swiss cybersecurity company PRODAFT as LARVA-208, is assessed to have become active towards the end of June 2024, relying on a variety of approaches ranging from SMS phishing (smishing) to voice phishing (vishing) in an attempt to trick prospective targets into installing remote monitoring and management (RMM) software.\nThe company told The Hacker News that the spear-phishing group is affiliated with RansomHub and Blacksuit ransomware groups and has been using advanced social engineering tactics to compromise high-value targets across multiple industries.\n\"The actor usually creates a phishing site that targets the organization to obtain the victim's VPN credentials,\" PRODAFT\nsaid\n. \"The victim is then called and asked to enter the victim's details into the phishing site for technical issues, posing as an IT team or helpdesk. If the attack targeting the victim is not a call but a direct SMS text message, a fake Microsoft Teams link is used to convince the victim.\"\nThe phishing sites are hosted on bulletproof hosting providers like Yalishand. Once access is obtained, EncryptHub proceeds to run PowerShell scripts that lead to the deployment of stealer malware like\nFickle\n,\nStealC\n, and\nRhadamanthys\n. The end goal of the attacks in most instances is to deliver ransomware and demand a ransom.\nOne of the other common methods adopted by threat actors concerns the use of trojanized applications disguised as legitimate software for initial access. These include counterfeit versions of QQ Talk, QQ Installer, WeChat, DingTalk, VooV Meeting, Google Meet, Microsoft Visual Studio 2022, and Palo Alto Global Protect.\nThese booby-trapped applications, once installed, trigger a multi-stage process that acts as a delivery vehicle for next-stage payloads such as\nKematian Stealer\nto facilitate cookie theft.\nAt least since January 2, 2025, a crucial component of EncryptHub's distribution chain has been the use of a third-party\nPPI\nservice\ndubbed LabInstalls, which facilitates bulk malware installs for paying customers starting from $10 (100 loads) to $450 (10,000 loads).\n\"EncryptHub indeed confirmed being their client by leaving positive feedback in LabInstalls selling thread on the top-tier Russian-speaking underground forum XSS, even including a screenshot that evidences the use of the service,\" Outpost24 said.\n\"The threat actor most likely hired this service to ease the burden of distribution and expand the number of targets that his malware could reach.\"\nThese changes underscore active tweaks to EncryptHub's kill chain, with the threat actor also developing new components like EncryptRAT, a command-and-control (C2) panel to manage active infections, issue remote commands, and access stolen data. There is some evidence to suggest that the adversary may be looking to commercialize the tool.\n\"EncryptHub continues to evolve its tactics, underlining the critical need for continuous monitoring and proactive defense measures,\" the company said. \"Organizations must remain vigilant and adopt multi-layered security strategies to mitigate the risks posed by such adversaries.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Outsmarting Cyber Threats with Attack Graphs",
        "Link": "https://thehackernews.com/2025/03/outsmarting-cyber-threats-with-attack.html",
        "Summary": "Cyber threats are growing more sophisticated, and traditional security approaches struggle to keep up. Organizations can no longer rely on periodic assessments or static vulnerability lists to stay secure. Instead, they need a dynamic approach that provides real-time insights into how attackers move through their environment.\nThis is where attack graphs come in. By mapping potential attack paths",
        "Date": "2025-03-06",
        "Content": "Cyber threats are growing more sophisticated, and traditional security approaches struggle to keep up. Organizations can no longer rely on periodic assessments or static vulnerability lists to stay secure. Instead, they need a dynamic approach that provides real-time insights into how attackers move through their environment.\nThis is where attack graphs come in. By mapping potential attack paths, they offer a more strategic way to identify and mitigate risk. In this article, we'll explore the benefits, types, and practical applications of attack graphs.\nUnderstanding Attack Graphs\nAn attack graph\nis a visual representation of potential attack paths within a system or network. It maps how an attacker could move through different security weaknesses - misconfigurations, vulnerabilities, and credential exposures, etc. - to reach critical assets. Attack graphs can incorporate data from various sources, continuously update as environments change, and model real-world attack scenarios.\nInstead of focusing solely on individual vulnerabilities, attack graphs provide the bigger picture - how different security gaps, like misconfigurations, credential issues, and network exposures, could be used together to pose serious risk.\nUnlike traditional security models that prioritize vulnerabilities based on severity scores alone, attack graphs loop in exploitability and business impact. The reason? Just because a vulnerability has a high CVSS score doesn't mean it's an actual threat to a given environment. Attack graphs add critical context, showing whether a vulnerability can actually be used in combination with other weaknesses to reach critical assets.\nAttack graphs are also able to provide continuous visibility. This, in contrast to one-time assessments like red teaming or penetration tests, which can quickly become outdated. By analyzing all possible paths an attacker could take, organizations can leverage attack graphs to identify and address \"choke points\" - key weaknesses that, if fixed, significantly reduce overall risk.\nTypes of Attack Graphs Explained\nAll attack graphs are not equal. They come in different forms, each with its strengths and limitations. Understanding these types helps security teams choose the right approach for identifying and mitigating risks.\nSecurity Graphs\nSecurity graphs map relationships between different system elements, such as user permissions, network configurations, and vulnerabilities. They provide visibility into how various components connect. However, they don't show how an attacker could exploit them.\nPros\n- Security graphs are relatively easy to implement and provide valuable insights into an organization's infrastructure. They can help security teams identify potential security gaps.\nCons\n- They require manual queries to analyze risks, meaning security teams must know what to look for in advance. This can lead to missed attack paths, especially when multiple weaknesses combine in unexpected ways.\nAggregated Graphs\nAggregated graphs combine data from multiple security tools like vulnerability scanners, identity management systems, and cloud security solutions into a unified model.\nPros\n- They leverage existing security tools, providing a more holistic view of risk across different environments.\nCons\n- Integration can be challenging, with potential data mismatches and visibility gaps. Since these graphs rely on separate tools with their own limitations, the overall picture may still be incomplete.\nHolistic Attack Graphs\nAdvanced and holistic attack graphs\ntake a different direction. These are purpose-built to model real-world attacker behavior, with special focus on how threats evolve across systems. They map out all possible attack paths and continuously update themselves as environments change. Unlike other graphs, they don't rely on manual queries or predefined assumptions. They also provide continuous monitoring, real exploitability context, and effective prioritization – which helps security teams focus on the most critical risks first.\nPractical Benefits of Attack Graphs\nAttack graphs provide continuous visibility into attack paths, which offers security teams a dynamic, real-time view instead of outdated snapshots from periodic assessments. By mapping how attackers could potentially navigate an environment, organizations gain a clearer understanding of evolving threats.\nThey also improve prioritization and risk management by contextualizing vulnerabilities. Rather than blindly patching high-CVSS flaws, security teams can identify critical choke points – the key weaknesses that, if fixed, significantly reduce risk across multiple attack paths.\nAnother major advantage is cross-team communication. Attack graphs simplify complex security issues, crucially helping CISOs overcome the challenge of explaining risk to executives and boards through clear visual representations.\nFinally, attach graphs enhance the efficiency of remediation efforts by ensuring that security teams focus on securing business-critical assets first. By prioritizing fixes based on both actual exploitability and business impact, organizations can allocate security resources effectively.\nLeveraging Attack Graphs for Proactive Security\nAttack graphs are shifting cybersecurity from a reactive stance to a proactive strategy. Instead of waiting for attacks to happen or relying on quickly-outdated assessments, security teams can use attack graphs to anticipate threats before they're exploited.\nA key element of this shift from reactive to proactive security is the ability of attack graphs to integrate threat intelligence. By continuously incorporating data on emerging vulnerabilities, exploit techniques, and attacker behaviors, organizations can stay ahead of threats rather than reacting after damage occurs.\nContinuous assessment is also critical in modern IT environments, where change is the norm. Attack graphs provide real-time updates. This helps security teams adapt as networks, identities, and cloud environments shift. Unlike static models, attack graphs offer ongoing visibility into attack paths, enabling smarter, more informed decision-making.\nBy leveraging attack graphs, organizations can move beyond traditional vulnerability management to focus on real exploitability and business impact. This shift from reactive patching to strategic risk reduction makes security operations more efficient and effective. Ultimately, attack graphs empower teams to close critical security gaps, strengthen defenses, and stay ahead of adversaries.\nNote:\nThis article is expertly written by Menachem Shafran, SVP of Strategy and Innovation, and Tobias Traebing, VP of Global Sales Engineering, at XM Cyber.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Medusa Ransomware Hits 40+ Victims in 2025, Demands $100K–$15M Ransom",
        "Link": "https://thehackernews.com/2025/03/medusa-ransomware-hits-40-victims-in.html",
        "Summary": "The threat actors behind the Medusa ransomware have claimed nearly 400 victims since it first emerged in January 2023, with the financially motivated attacks witnessing a 42% increase between 2023 and 2024.\nIn the first two months of 2025 alone, the group has claimed over 40 attacks, according to data from the Symantec Threat Hunter Team said in a report shared with The Hacker News. The",
        "Date": "2025-03-06",
        "Content": "The threat actors behind the\nMedusa ransomware\nhave claimed nearly 400 victims since it first emerged in January 2023, with the financially motivated attacks witnessing a 42% increase between 2023 and 2024.\nIn the first two months of 2025 alone, the group has claimed over 40 attacks, according to data from the Symantec Threat Hunter Team said in a report shared with The Hacker News. The cybersecurity company is tracking the cluster under the name Spearwing.\n\"Like the majority of ransomware operators, Spearwing and its affiliates carry out double extortion attacks, stealing victims' data before encrypting networks in order to increase the pressure on victims to pay a ransom,\" Symantec\nnoted\n.\n\"If victims refuse to pay, the group threatens to publish the stolen data on their data leaks site.\"\nWhile other ransomware-as-a-service (RaaS) players like RansomHub (aka Greenbottle and Cyclops), Play (aka Balloonfly), and Qilin (aka Agenda, Stinkbug, and Water Galura) have\nbenefited\nfrom the disruptions of LockBit and BlackCat, the spike in Medusa infections raises the possibility that the threat actor could also be rushing in to fill the gap left by the two prolific extortionists.\nThe development comes as the ransomware landscape continues to be in a\nstate of flux\n, with a steady stream of new RaaS operations, such as\nAnubis\n,\nCipherLocker\n,\nCore\n,\nDange\n,\nLCRYX\n,\nLoches\n,\nVgod\n, and\nXelera\n, emerging in the wild in recent months.\nMedusa has a track record of demanding ransoms anywhere between $100,000 up to $15 million from healthcare providers and non-profits, as well as targeting financial and government organizations.\nAttack chains mounted by the ransomware syndicate involve the exploitation of known security flaws in public-facing applications, mainly Microsoft Exchange Server, to obtain initial access. It's also suspected that the threat actors are likely using initial access brokers for breaching networks of interest.\nOnce gaining a successful foothold, the hackers drop use remote management and monitoring (RMM) software such as SimpleHelp, AnyDesk, or MeshAgent for persistent access, and employ the tried-and-tested Bring Your Own Vulnerable Driver (BYOVD) technique to terminate antivirus processes using\nKillAV\n. It's worth pointing out that KillAV has been previously put to use in BlackCat ransomware attacks.\n\"The use of the legitimate RMM software PDQ Deploy is another hallmark of Medusa ransomware attacks,\" Symantec said. \"It is typically used by the attackers to drop other tools and files and to move laterally across the victim network.\"\nSome of the other tools deployed over the course of a Medusa ransomware attack include Navicat to access and run database queries, RoboCopy, and Rclone for data exfiltration.\n\"Like most targeted ransomware groups, Spearwing tends to attack large organizations across a range of sectors,\" Symantec said. \"Ransomware groups tend to be driven purely by profit, and not by any ideological or moral considerations.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Over 1,000 WordPress Sites Infected with JavaScript Backdoors Enabling Persistent Attacker Access",
        "Link": "https://thehackernews.com/2025/03/over-1000-wordpress-sites-infected-with.html",
        "Summary": "Over 1,000 websites powered by WordPress have been infected with a third-party JavaScript code that injects four separate backdoors.\n\"Creating four backdoors facilitates the attackers having multiple points of re-entry should one be detected and removed,\" c/side researcher Himanshu Anand said in a Wednesday analysis.\nThe malicious JavaScript code has been found to be served via cdn.csyndication[",
        "Date": "2025-03-06",
        "Content": "Over 1,000 websites powered by WordPress have been infected with a third-party JavaScript code that injects four separate backdoors.\n\"Creating four backdoors facilitates the attackers having multiple points of re-entry should one be detected and removed,\" c/side researcher Himanshu Anand\nsaid\nin a Wednesday analysis.\nThe malicious JavaScript code has been found to be served via cdn.csyndication[.]com. As of writing, as many as\n908 websites\ncontain references to the domain in question.\nThe functions of the four backdoors are explained below -\nBackdoor 1, which uploads and installs a fake plugin named \"Ultra SEO Processor,\" which is then used to execute attacker-issued commands\nBackdoor 2, which injects malicious JavaScript into wp-config.php\nBackdoor 3, which adds an attacker-controlled SSH key to the ~/.ssh/authorized_keys file so as to allow persistent remote access to the machine\nBackdoor 4, which is designed to execute remote commands and fetches another payload from\ngsocket[.]io\nto likely open a reverse shell\nTo mitigate the risk posed by the attacks, it's advised that users delete unauthorized SSH keys, rotate WordPress admin credentials, and monitor system logs for suspicious activity.\nThe development comes as the cybersecurity company\ndetailed\nanother malware campaign has compromised more than 35,000 websites with malicious JavaScript that \"fully hijacks the user's browser window\" to redirect site visitors to Chinese-language gambling platforms.\n\"The attack appears to be targeting or originating from regions where Mandarin is common, and the final landing pages present gambling content under the 'Kaiyun' brand.\nThe redirections occur through JavaScript hosted on five different domains, which serves as a loader for the main payload responsible for performing the redirects -\nmlbetjs[.]com\nptfafajs[.]com\nzuizhongjs[.]com\njbwzzzjs[.]com\njpbkte[.]com\nThe findings also follow a new report from Group-IB about a threat actor dubbed\nScreamedJungle\nthat injects a JavaScript code-named Bablosoft JS into compromised Magento websites to collect fingerprints of visiting users. More than 115 e-commerce sites are believed to be impacted to date.\nThe injected script is \"part of the\nBablosoft BrowserAutomationStudio\n(BAS) suite,\" the Singaporean company\nsaid\n, adding it \"contains several other functions to collect information about the system and browser of users visiting the compromised website.\"\nIt's said that the attackers are exploiting known vulnerabilities affecting vulnerable Magento versions (e.g.,\nCVE-2024-34102\naka CosmicSting and CVE-2024-20720) to breach the websites. The financially motivated threat actor was first discovered in the wild in late May 2024.\n\"Browser fingerprinting is a powerful technique commonly used by websites to track user activities and tailor marketing strategies,\" Group-IB said. \"However, this information is also exploited by cybercriminals to mimic legitimate user behavior, evade security measures, and conduct fraudulent activities.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "U.S. Charges 12 Chinese Nationals in State-Backed Hacking Operations",
        "Link": "https://thehackernews.com/2025/03/us-charges-12-chinese-nationals-in.html",
        "Summary": "The U.S. Department of Justice (DoJ) has announced charges against 12 Chinese nationals for their alleged participation in a wide-ranging scheme designed to steal data and suppress free speech and dissent globally.\nThe individuals include two officers of the People's Republic of China's (PRC) Ministry of Public Security (MPS), eight employees of an ostensibly private PRC company, Anxun",
        "Date": "2025-03-06",
        "Content": "The U.S. Department of Justice (DoJ) has announced charges against 12 Chinese nationals for their alleged participation in a wide-ranging scheme designed to steal data and suppress free speech and dissent globally.\nThe\nindividuals\ninclude two officers of the People's Republic of China's (PRC) Ministry of Public Security (MPS), eight employees of an ostensibly private PRC company, Anxun Information Technology Co. Ltd. (安洵信息技术有限公司) also known as\ni-Soon\n, and members of Advanced Persistent Threat 27 (\nAPT27\n, aka Budworm, Bronze Union, Emissary Panda, Lucky Mouse, and Iron Tiger) -\nWu Haibo (吴海波), Chief Executive Officer\nChen Cheng (陈诚), Chief Operating Officer\nWang Zhe (王哲), Sales Director\nLiang Guodong (梁国栋), Technical Staff\nMa Li (马丽), Technical Staff\nWang Yan (王堰), Technical Staff\nXu Liang (徐梁), Technical Staff\nZhou Weiwei (周伟伟), Technical Staff\nWang Liyu (王立宇), MPS Officer\nSheng Jing (盛晶), MPS Officer\nYin Kecheng\n(尹可成), APT27 actor aka \"YKC\"\nZhou Shuai (周帅), APT27 actor aka \"Coldface\"\n\"These malicious cyber actors, acting as freelancers or as employees of i-Soon, conducted computer intrusions at the direction of the PRC's MPS and Ministry of State Security (MSS) and on their own initiative,\" the DoJ\nsaid\n. \"The MPS and MSS paid handsomely for stolen data.\"\nCourt documents reveal that the MPS and MSS employed a network of private companies and contractors in China to indiscriminately infiltrate companies and steal data, while also obscuring the involvement of the government.\nThe eight i-Soon employees, alongside two MPS officers, have been\naccused\nof breaking into email accounts, cell phones, servers, and websites from at least in or around 2016 through in or around 2023.\nThe U.S. Federal Bureau of Investigation (FBI), in a court filing, said the activities associated with i-Soon are tracked by the cybersecurity community under the monikers\nAquatic Panda\n(aka RedHotel), while APT27 overlaps with that of\nSilk Typhoon\n,\nUNC5221\n, and\nUTA0178\n.\nThe agency further\npointed out\nthat the Chinese government is using formal and informal connections with freelance hackers and information security companies to compromise computer networks worldwide.\nSeparately, the U.S. Department of State's Rewards for Justice (RFJ) program has\nannounced\na reward of up to $10 million for information leading to the identification or location of any person who engages in malicious cyber activities against U.S. critical infrastructure while acting under the direction of a foreign government.\nThe DoJ further noted that i-Soon and its employees generated tens of millions of dollars in revenue, making the company a key player in the PRC hacker-for-hire ecosystem. It's estimated to have charged anywhere between $10,000 and $75,000 for each email inbox it successfully exploited.\n\"In some instances, i-Soon conducted computer intrusions at the request of the MSS or MPS, including cyber-enabled transnational repression at the direction of the MPS officer defendants,\" the department said.\n\"In other instances, i-Soon conducted computer intrusions on its own initiative and then sold, or attempted to sell, the stolen data to at least 43 different bureaus of the MSS or MPS in at least 31 separate provinces and municipalities in China.\"\nTargets of i-Soon's attacks included a large religious organization in the United States, critics and dissidents of the PRC government, a state legislative body, United States government agencies, the ministries of foreign affairs of multiple governments in Asia, and news organizations.\nAn additional monetary reward of up to $2 million each has been\nannounced\nfor information leading to the arrests and/or convictions of\nShuai and Kecheng\n, who are accused of participating in a years-long, sophisticated computer hacking conspiracy to breach U.S. victim companies, municipalities, and organizations for profit from 2011, and steal data after establishing persistent access via the\nPlugX\nmalware.\nShuai has been alleged to operate as a data broker, selling the plundered information to various customers, some of whom had connections to the PRC government and military, for a financial profit.\nConcurrent to the charges, the DoJ has also announced the seizure of four domains linked to i-Soon and the APT27 actors -\necoatmosphere.org\nnewyorker.cloud\nheidrickjobs.com, and\nmaddmail.site\n\"i-Soon's victims were of interest to the PRC government because, among other reasons, they were prominent overseas critics of the PRC government or because the PRC government considered them threatening to the rule of the Chinese Communist Party,\" the DoJ\nsaid\n.\nThe company is also said to have trained MPS employees how to hack independently of i-Soon and provided for sale various hacking methods that it described as an \"industry-leading offensive and defensive technology\" and a \"zero-day vulnerability arsenal.\"\nAdvertised among the tools was a software called the \"Automated Penetration Testing Platform\" that's capable of sending phishing emails, creating files with malware that provide remote access to victims' computers upon opening, and cloning websites of victims in an attempt to trick them into providing sensitive information.\nAnother of i-Soon's offerings is a password-cracking utility known as the \"Divine Mathematician Password Cracking Platform\" and a program engineered to hack into various online services like Microsoft Outlook, Gmail, and X (formerly Twitter), among others.\n\"With respect to Twitter, i-Soon sold software with the capability to send a victim a spear phishing link and then to obtain access to and control over the victim's Twitter account,\" the DoJ explained.\n\"The software had the ability to access Twitter even without the victim's password and to bypass multi-factor authentication. After a victim's Twitter was compromised, the software could send tweets, delete tweets, forward tweets, make comments, and like tweets.\"\nThe purpose of the tool, referred to as \"Public Opinion Guidance and Control Platform (Overseas),\" was to let the company's customers leverage the network of hacked X accounts to understand public opinion outside of China.\n\"The charges announced today expose the PRC's continued attempts to spy on and silence anyone it deems threatening to the Chinese Communist Party,\" Acting Assistant Director in Charge Leslie R. Backschies said in a statement.\n\"The Chinese government tried to conceal its efforts by working through a private company, but their actions amount to years of state-sponsored hacking of religious and media organizations, numerous government agencies in multiple countries, and dissidents around the world who dared criticize the regime.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft says malvertising campaign impacted 1 million PCs",
        "Link": "https://www.bleepingcomputer.com/news/security/microsoft-says-malvertising-campaign-impacted-1-million-pcs/",
        "Summary": "​Microsoft has taken down an undisclosed number of GitHub repositories used in a massive malvertising campaign that impacted almost one million devices worldwide. [...]",
        "Date": "2025-03-06",
        "Content": "​Microsoft has taken down an undisclosed number of GitHub repositories used in a massive malvertising campaign that impacted almost one million devices worldwide.\nThe company's threat analysts detected these attacks in early December 2024 after observing multiple devices downloading malware from GitHub repos, malware that was later used to deploy a string of various other payloads on compromised systems.\nAfter analyzing the campaign, they discovered that the attackers injected ads into videos on illegal pirated streaming websites that redirect potential victims to malicious GitHub repositories under their control.\n\"The streaming websites embedded malvertising redirectors within movie frames to generate pay-per-view or pay-per-click revenue from malvertising platforms,\"\nMicrosoft explained\ntoday. \"These redirectors subsequently routed traffic through one or two additional malicious redirectors, ultimately leading to another website, such as a malware or tech support scam website, which then redirected to GitHub.\"\nThe malvertising videos redirected users to the GitHub repos that infected them with malware designed to perform system discovery, collect detailed system info (e.g., memory size, graphic details, screen resolution, operating system (OS), and user paths), and exfiltrate the harvested data while deploying additional stage-two payloads.\nA third-stage PowerShell script payload then downloads the NetSupport remote access trojan (RAT) from a command-and-control server and establishes persistence in the registry for the RAT. Once executed, the malware can also deploy the Lumma information stealer malware and the open-source\nDoenerium\ninfostealer to exfiltrate user data and browser credentials.\nAttack stages (Microsoft)\n​On the other hand, if the third-stage payload is an executable file, it creates and runs a CMD file while dropping a renamed AutoIt interpreter with a .com extension. This AutoIt component then launches the binary and may drop another version of the AutoIt interpreter with a .scr extension. A JavaScript file is also deployed to help execute and gain persistence for .scr files.\nIn the last stage of the attack, the AutoIt payloads use RegAsm or PowerShell to open files, enable remote browser debugging, and exfiltrate additional information. In some cases, PowerShell is also used to configure exclusion paths for Windows Defender or to drop more NetSupport payloads.\nWhile GitHub was the primary platform to host payloads delivered during the campaign's first stage, Microsoft Threat Intelligence also observed payloads hosted on Dropbox and Discord.\n\"This activity is tracked under the umbrella name Storm-0408 that we use to track numerous threat actors associated with remote access or information-stealing malware and who use phishing, search engine optimization (SEO), or malvertising campaigns to distribute malicious payloads,\" Microsoft said.\n\"The campaign impacted a wide range of organizations and industries, including both consumer and enterprise devices, highlighting the indiscriminate nature of the attack.\"\nMicrosoft's report\nprovides additional and more detailed information\nregarding the various stages of the attacks and the payloads used across the multi-stage attack chain of this complex malvertising campaign.\nRelated Articles:\nHundreds of fake Reddit sites push Lumma Stealer malware\nFake Homebrew Google ads target Mac users with malware\nHave I Been Pwned adds 284M accounts stolen by infostealer malware\nGitVenom attacks abuse hundreds of GitHub repos to steal crypto\nNew FrigidStealer infostealer infects Macs via fake browser updates"
    },
    {
        "Title": "Ransomware gang encrypted network from a webcam to bypass EDR",
        "Link": "https://www.bleepingcomputer.com/news/security/akira-ransomware-encrypted-network-from-a-webcam-to-bypass-edr/",
        "Summary": "The Akira ransomware gang was spotted using an unsecured webcam to launch encryption attacks on a victim's network, effectively circumventing Endpoint Detection and Response (EDR), which was blocking the encryptor in Windows. [...]",
        "Date": "2025-03-06",
        "Content": "The Akira ransomware gang was spotted using an unsecured webcam to launch encryption attacks on a victim's network, effectively circumventing Endpoint Detection and Response (EDR), which was blocking the encryptor in Windows.\nCybersecurity firm S-RM team discovered the unusual attack method during a recent incident response at one of their clients.\nNotably,\nAkira\nonly pivoted to the webcam after attempting to deploy encryptors on Windows, which were blocked by the victim's EDR solution.\nAkira's unorthodox attack chain\nThe threat actors initially gained access to the corporate network via an exposed remote access solution at the targeted company, likely by leveraging stolen credentials or brute-forcing the password.\nAfter gaining access, they deployed AnyDesk, a legitimate remote access tool, and stole the company's data for use as part of the double extortion attack.\nNext, Akira used Remote Desktop Protocol (RDP) to move laterally and expand their presence to as many systems as possible before deploying the ransomware payload.\nEventually, the threat actors dropped a password-protected ZIP file (win.zip) containing the ransomware payload (win.exe), but the victim's EDR tool detected and quarantined it, essentially blocking the attack.\nAfter this failure, Akira explored alternative attack pathways, scanning the network for other devices that could be used to encrypt the files and finding a webcam and fingerprint scanner.\nS-RM explains that the attackers opted for the webcam because it was vulnerable to remote shell access and unauthorized video feed viewing.\nFurthermore, it ran on a Linux-based operating system compatible with Akira's Linux encryptor. It also did not have an EDR agent, making it an optimal device to remotely encrypt files on network shares.\nOverview of Akira's attack steps\nSource: S-RM\nS-RM confirmed to BleepingComputer that the threat actors utilized the webcam's Linux operating system to mount Windows SMB network shares of the company's other devices. They then launched the Linux encryptor on the webcam and used it to encrypt the network shares over SMB, effectively circumventing the EDR software on the network.\n\"As the device was not being monitored, the victim organisation's security team were unaware of the increase in malicious Server Message Block (SMB) traffic from the webcam to the impacted server, which otherwise may have alerted them,\"\nexplains S-RM\n.\n\"Akira was subsequently able to encrypt files across the victim's network.\"\nS-RM told BleepingComputer that there were patches available for the webcam flaws, meaning that the attack, or at least this vector, was avoidable.\nThe case shows that EDR protection isn't an all-encompassing security solution, and organizations shouldn't rely on it alone to protect against attacks.\nFurthermore, IoT devices are not as closely monitored and maintained as computers but still pose a significant risk.\nDue to this, these types of devices should be isolated from the more sensitive networks, like production servers and workstations.\nOf equal importance, all devices, even IoT devices, should have their firmware updated regularly to patch known flaws that could be exploited in attacks.\nRelated Articles:\nToronto Zoo shares update on last year's ransomware attack\nFake BianLian ransom notes mailed to US CEOs in postal mail scam\nMicrosoft Teams tactics, malware connect Black Basta, Cactus ransomware\nNew Cactus ransomware encrypts itself to evade antivirus\nNew Eleven11bot botnet infects 86,000 devices for DDoS attacks"
    },
    {
        "Title": "US seizes domain of Garantex crypto exchange used by ransomware gangs",
        "Link": "https://www.bleepingcomputer.com/news/security/us-seizes-domain-of-garantex-crypto-exchange-used-by-ransomware-gangs/",
        "Summary": "The U.S. Secret Service has seized the domain of the sanctioned Russian cryptocurrency exchange Garantex in collaboration with the Department of Justice's Criminal Division, the FBI, and Europol. [...]",
        "Date": "2025-03-06",
        "Content": "The U.S. Secret Service has seized the domain of the sanctioned Russian cryptocurrency exchange Garantex in collaboration with the Department of Justice's Criminal Division, the FBI, and Europol.\nOther law enforcement authorities involved in this action include the Dutch National Police, the German Federal Criminal Police Office, the Frankfurt General Prosecutor's Office, the Estonian National Criminal Police, and the Finnish National Bureau of Investigation.\nEarlier today, Garantex was also forced to suspend services due to Tether blocking its digital wallets after the\nEuropean Union sanctioned the crypto exchange\nas part of its 16th package of sanctions against Russia, which\ntargets 542 individuals and entities\n.\n\"We have bad news. Tether entered the war against the Russian cryptographic market and blocked our wallets in the amount of more than 2.5 billion rubles,\" the Garantex team\nsaid\nin a Telegram post on Thursday.\n\"We temporarily suspend the provision of all services, including the findings of cryptocurrency, for a while, while the whole team is solving this problem. We're fighting and we're not giving up! We draw your attention to the fact that all USDT on Russian wallets is now at risk.\"\nAfter seizing Garantex's domain garantex[.]org, the Secret Service also changed the name servers to\nns1.usssdomainseizure.com\nand\nns2.usssdomainseizure.com\n.\nGarantex seizure banner (BleepingComputer)\n​The Russian exchange was previously\nsanctioned by the Treasury Department's Office of Foreign Assets Control (OFAC)\nin April 2022 after over $100 million in Garantex transactions were linked to darknet markets and cybercrime actors, including the notorious Conti Ransomware-as-a-service (RaaS) operation and the Hydra dark web market.\n\"The majority of Garantex's operations are carried out in Moscow, including at Federation Tower, and St. Petersburg, Russia, where other sanctioned virtual currency exchanges have also operated,\"\nOFAC said\nat the time.\nGarantex lost its license to provide virtual currency services in February 2022 after Estonia's Financial Intelligence Unit found links between Garantex and wallets used for criminal activity and critical compliance issues with Anti-Money Laundering and Countering the Financing of Terrorism (AML/CFT) policies.\n\"Despite losing its Estonian license to provide virtual currency services following the Estonian Financial Intelligence Unit's investigation, Garantex continues to provide services to customers through unscrupulous means,\" OFAC added.\nTwo years later, OFAC\nsanctioned the Cryptex and PM2BTC crypto exchanges\nfor laundering funds for Russian ransomware gangs and other cybercrime groups.\nIt also targeted the\nBitpapa, TOEP, and Crypto Explorer crypto exchanges\nin March 2024 and designated the\nSinbad\n,\nTornado Cash\n, and\nBlender.io\ncrypto-mixing services for laundering money for the North Korean Lazarus hacking group.\nRelated Articles:\nNorth Korean hackers linked to $1.5 billion ByBit crypto heist\nHacker steals record $1.46 billion from Bybit ETH cold wallet\nKuCoin to pay nearly $300 million in penalties after guilty plea\nHackers steal $85 million worth of cryptocurrency from Phemex\nDHS says CISA will not stop monitoring Russian cyber threats"
    },
    {
        "Title": "Cybercrime 'crew' stole $635,000 in Taylor Swift concert tickets",
        "Link": "https://www.bleepingcomputer.com/news/security/cybercrime-crew-stole-635-000-in-taylor-swift-concert-tickets/",
        "Summary": "New York prosecutors say that two people working at a third-party contractor for the StubHub online ticket marketplace made $635,000 after almost 1,000 concert tickets and reselling them online. [...]",
        "Date": "2025-03-06",
        "Content": "New York prosecutors say that two people working at a third-party contractor for the StubHub online ticket marketplace made $635,000 after almost 1,000 concert tickets and reselling them online.\nAs the prosecutors explain, the vast majority of stolen tickets were for Taylor Swift's Eras Tour. However, the criminals also targeted other high-value and high-profile events, including Ed Sheeran concerts, Adele concerts, NBA games, and the US Open Tennis Championships.\nThe two defendants, 20-year-old Tyrone Rose and 31-year-old Shamara Simmons, worked for Sutherland Global Services in Jamaica and stole the tickets by allegedly intercepting approximately 350 StubHub orders by exploiting a loophole in the platform of an offshore ticket vendor.\n'The Sutherland employees, defendant Tyrone Rose and an unapprehended accomplice, allegedly used their access to StubHub's computer system to find a backdoor into a secure area of the network where already sold tickets were given a URL and queued to be emailed to the purchaser to download,\"\nsaid\nQueens County District Attorney Melinda Katz.\n\"Rose and his co-conspirator re-directed the URLs to the emails of co-conspirators Shamara Simmons in Queens and a now deceased accomplice who lived in Queens.\"\nThe investigation is still ongoing, with prosecutors trying to determine the extent of this operation, including other potential co-conspirators yet to be discovered.\nThe Sutherland employees were arrested in New York City and arraigned on Thursday on a criminal complaint charging them with grand larceny in the second-degree, first-degree computer tampering, fourth-degree conspiracy, and fourth-degree computer tampering.\nIf they're found guilty, they each face a potential maximum sentence of three to 15 years in prison if convicted of the top count.\n\"According to the charges, these defendants tried to use the popularity of Taylor Swift's concert tour and other high-profile events to profit at the expensive of others,\"\nDistrict Attorney Katz added\n.\n\"This takedown highlights the vigilance of my office's Cybercrime and Cryptocurrency Unit as well as the importance of working with our industry partners to combat fraudulent activities and ensure the protection of consumers.\"\nRelated Articles:\nSuspected Desorden hacker arrested for breaching 90 organizations\nPolice arrests suspects tied to AI-generated CSAM distribution ring\nMicrosoft names cybercriminals behind AI deepfake network\nNew NailaoLocker ransomware used against EU healthcare orgs\nDarcula PhaaS can now auto-generate phishing kits for any brand"
    },
    {
        "Title": "Ethereum private key stealer on PyPI downloaded over 1,000 times",
        "Link": "https://www.bleepingcomputer.com/news/security/ethereum-private-key-stealer-on-pypi-downloaded-over-1-000-times/",
        "Summary": "A malicious Python Package Index (PyPI)  package named \"set-utils\" has been stealing Ethereum private keys through intercepted wallet creation functions and exfiltrating them via the Polygon blockchain. [...]",
        "Date": "2025-03-06",
        "Content": "A malicious Python Package Index (PyPI)  package named \"set-utils\" has been stealing Ethereum private keys through intercepted wallet creation functions and exfiltrating them via the Polygon blockchain.\nThe package disguises itself as a utility for Python, mimicking the popular \"python-utils,\" which has over 712 million downloads, and \"utils,\" which counts over 23.5 million installs.\nResearchers from the developer cybersecurity platform Socket\ndiscovered\nthe malicious package and reported that set-utils had been downloaded over a thousand times since its submission on PyPI on January 29, 2025.\nThe open-source supply chain security firm reports that the attacks primarily target blockchain developers utilizing 'eth-account' for wallet creation and management, Python-based DeFi projects, Web3 apps with Ethereum support, and personal wallets using Python automation.\nThe malicious package on PyPI\nSource: Socket\nAs the malicious package is targeting cryptocurrency projects, even though there were only a thousand downloads, it could impact a far larger number of people who used the applications to generate wallets.\nStealthy Ethereum keys theft\nThe malicious set-utils package embeds the attacker's RSA public key to be used for encrypting stolen data and an Ethereum sender account controlled by the attacker.\nThe package hooks into standard Ethereum wallet creation functions like 'from_key()' and 'from_mnewmonic()' to intercept private keys as they are generated on the compromised machine.\nIt then encrypts the stolen private key and embeds it in the data field of an Ethereum transaction before it's sent to the attacker's account via the Polygon RPC endpoint \"rpc-amoy.polygon.technology/.\"\nExfiltrating stolen private keys\nSource: Socket\nCompared to traditional network exfiltration methods, embedding stolen data in Ethereum transactions is far stealthier and more challenging to distinguish from legitimate activity.\nFirewalls and antivirus tools typically monitor HTTP requests but not blockchain transactions, so this method is unlikely to raise any flags or get blocked.\nAlso, Polygon transactions have very low processing fees, no rate limiting applies to small transactions, and offer free public RPC endpoints, so the threat actors do not need to set up their own infrastructure.\nOnce the exfiltration process is done, the attacker can retrieve the stolen data at any time, as the stolen information is permanently stored on the blockchain.\nThe set-utils package was removed from PyPI following its discovery. However, users and software developers who incorporated it into their projects should uninstall it immediately and assume that any Ethereum wallets created are compromised.\nIf the said wallets contain funds, it is recommended to move them to another wallet as soon as possible, as they are at risk of getting stolen at any moment.\nRelated Articles:\nPyPi package with 100K installs pirated music from Deezer for years\nHacker steals record $1.46 billion from Bybit ETH cold wallet\nCrypto-stealing apps found in Apple App Store for the first time\nDeepSeek AI tools impersonated by infostealer malware on PyPI\nMalicious PyPi package steals Discord auth tokens from devs"
    },
    {
        "Title": "Microsoft 365 apps will prompt users to back up files in OneDrive",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-365-apps-will-prompt-users-to-back-up-files-in-onedrive/",
        "Summary": "Starting mid-March 2025, Microsoft will start prompting users of its Microsoft 365 apps for Windows to back up their files to OneDrive. [...]",
        "Date": "2025-03-06",
        "Content": "Starting mid-March 2025, Microsoft will start prompting users of its Microsoft 365 apps for Windows to back up their files to OneDrive.\nThese prompts will be displayed in Word, Excel, and PowerPoint, encouraging users to enroll in\nOneDrive Known Folder Move (KFM)\n.\nAs the company\nexplains\nin a new Microsoft 365 Message Center entry, they'll first roll out in public preview until early April 2025 and will be made generally available worldwide by early May 2025.\n\"If your organization still has users who are not enrolled in KFM, the message (\"BACK UP THIS DOCUMENT: Share and work with others in this and other files using OneDrive\") will encourage them to do it while using familiar desktop apps,\" Microsoft said.\n\"After users select the Open OneDrive button, they can select the folders they want to back up in OneDrive.\"\nOneDrive backup prompts in Microsoft 365 (Microsoft)\n​Microsoft says these OneDrive backup prompts will not be displayed for users whose organizations have blocked OneDrive KFM.\nThe company added that the rollout will start automatically and advises admins to notify users of this change. Those who don't want their users to see these alerts can block KFM to ensure the rollout doesn't reach their endpoints.\nThis is part of a broader effort to increase the number of Microsoft customers using the company's OneDrive personal cloud storage service.\nFor instance, last week, Microsoft also started\ntesting ad-supported versions of its Office desktop apps\nthat allow Windows users to create and edit documents.\nHowever, these ad-supported Word, Excel, and PowerPoint apps also have limited features, including only allowing users to save their documents to OneDrive.\nWhen asked to provide more details, a Microsoft spokesperson told BleepingComputer that the company \"has been conducting some limited testing,\" and, currently, has no plans to launch an ad-supported version of Microsoft Office.\nRelated Articles:\nMicrosoft Teams phishing attack alerts coming to everyone next month\nCISA tags Windows, Cisco vulnerabilities as actively exploited\nNew Microsoft 365 outage impacts Teams, causes call failures\nMicrosoft links recent Microsoft 365 outage to buggy update\nMicrosoft fixes Outlook drag-and-drop broken by Windows updates"
    },
    {
        "Title": "Over 37,000 VMware ESXi servers vulnerable to ongoing attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/over-37-000-vmware-esxi-servers-vulnerable-to-ongoing-attacks/",
        "Summary": "Over 37,000 internet-exposed VMware ESXi instances are vulnerable to CVE-2025-22224, a critical out-of-bounds write flaw that is actively exploited in the wild. [...]",
        "Date": "2025-03-06",
        "Content": "Over 37,000 internet-exposed VMware ESXi instances are vulnerable to CVE-2025-22224, a critical out-of-bounds write flaw that is actively exploited in the wild.\nThis massive exposure is being reported by threat monitoring platform The Shadowserver Foundation, which reported a figure of around 41,500 yesterday.\nToday, ShadowServer\nnow reports\nthat 37,000 are still vulnerable, indicating that 4,500 devices were patched yesterday.\nCVE-2025-22224 is a critical-severity VCMI heap overflow vulnerability that enables local attackers with administrative privileges on the VM guest to escape the sandbox and execute code on the host as the VMX process.\nBroadcom warned customers about it along with two other flaws, CVE-2025-22225 and CVE-2025-22226, on Tuesday, March 4, 2025, informing that all three were being\nexploited in attacks\nas zero-days.\nThe flaws were discovered by Microsoft Threat Intelligence Center, which observed their exploitation as zero days for an undisclosed period. Also, no information about the origin of the attacks and the targets has been shared yet.\nThe U.S. Cybersecurity & Infrastructure Security Agency (CISA)\nhas given\nfederal agencies and state organizations until March 25, 2025, to apply the available updates and mitigations or stop using the product.\nThe Shadowserver Foundation reports that most of the vulnerable instances are in China (4,400), followed by France (4,100), the United States (3,800), Germany (2,800), Iran (2,800), and Brazil (2,200).\nHowever, due to the widespread use of VMware ESXi, a popular hypervisor used for virtualization in enterprise IT environments for virtual machine management, the impact is global.\nFor more information on the ESXi versions that fix CVE-2025-22224, users are recommended to check\nBroadcom’s bulletin\n. Currently, there are no workarounds for this problem.\nThe vendor has also published a\nFAQ page\nfor users to share additional action recommendations and impact details.\nRelated Articles:\nBroadcom fixes three VMware zero-days exploited in attacks\nCISA flags Craft CMS code injection flaw as exploited in attacks\nMicrosoft fixes Power Pages zero-day bug exploited in attacks\nPalo Alto Networks tags new firewall bug as exploited in attacks\nHackers exploit authentication bypass in Palo Alto Networks PAN-OS"
    },
    {
        "Title": "Free vCISO Course: Turning MSPs and MSSPs into Cybersecurity Powerhouses",
        "Link": "https://www.bleepingcomputer.com/news/security/free-vciso-course-turning-msps-and-mssps-into-cybersecurity-powerhouses/",
        "Summary": "The vCISO Academy is a free learning platform to equip service providers with training needed to build and expand their vCISO offerings. Learn more from Cynomi on how the Academy helps you launch or expand your vCISO services. [...]",
        "Date": "2025-03-06",
        "Content": "We’ve all heard a million times: growing demand for robust cybersecurity in the face of rising cyber threats is undeniable. Globally small and medium-sized businesses (SMBs) are increasingly targeted by cyberattacks but often lack the resources for full-time Chief Information Security Officers (CISOs).\nThis gap is driving the rise of the virtual CISO (vCISO) model, offering a cost-effective solution, and giving SMBs access to strategic security leadership.\nFor MSPs and MSSPs this shift represents both a challenge and an opportunity. Over 94% of service providers recognize the increasing need for vCISO services, yet, over 25% of providers report lacking the cybersecurity and compliance expertise needed to offer vCISO services.\nThis gap is exactly why the\nvCISO Academy\nwas created —to empower service providers with the knowledge and skills they need to thrive in this evolving landscape.\nThe vCISO Academy is a free, professional learning platform designed to equip service providers with the knowledge and training needed to build and expand their vCISO offerings, helping them better serve their clients and bolster cybersecurity resilience.\nThe Growing Demand for vCISO Services\nThe demand for vCISO services has exploded in recent years, driven by the increasing frequency and sophistication of cyberattacks on SMBs. The latest\nState of the vCISO Survey\n(2024) which interviewed 200 senior security leaders, revealed that 94% of service providers see demand for vCISO services and 98% of service providers who don’t currently offer vCISO services plan to introduce them in the foreseeable future.\nThis underscores the critical importance of vCISO services for MSPs and MSSPs, not just as a way to meet rising demand but also to stay competitive in a market where cybersecurity has become a business imperative.\nMSPs, MSSPs: What does it really take to be a full-fledged virtual CISO?\nVirtual Chief Information Security Officer (vCISO) services are in high demand in today's constantly shifting cybersecurity landscape.\nWhat is really needed in order to provide vCISO service? Download to get a better understanding of the vCISO’s main duties, roles and responsibilities\nDownload for free\nThe Expertise Gap in Delivering vCISO Services\nWhile the market for vCISO services is rapidly expanding, many MPSs and MSSPs struggle to offer these services due to lack of in-house expertise and resources. In fact, over 25% of service providers report lacking the necessary expertise to offer comprehensive vCISO services.\nService providers often hesitate to offer vCISO services due to the complexity of the role, which requires a combination of technical expertise, regulatory knowledge, and business strategy alignment. Additionally, they face challenges like resource constraints, uncertainty about having the necessary staff or budget, and concerns about scaling the services without overextending themselves.\nThe vCISO Academy was created to help MSPs and MSSPs address these concerns. It provides a clear, step-by-step roadmap that simplifies the process, enabling service providers to confidently start and grow their vCISO offerings.\nHow the vCISO Academy Fills This Critical Gap\nThe vCISO Academy provides self-paced, hands-on learning designed to equip service providers with the training and knowledge needed to develop and scale their vCISO offerings.\nKey features of the academy include:\nExpert guidance from industry experts who share their practical knowledge and experience on a wide range of essential vCISO functions, including risk and compliance assessments, cybersecurity strategy development, and effective communication of risks to executive teams.\nSelf-paced learning allows access to videos, tools, and resources anytime and anywhere.\nAn interactive platform that provides exercises and real-world examples to reinforce understanding.\nThe Academy empowers MSPs and MSSPs to not only offer vCISO services confidently but also, build new revenue streams, enhance client relationships, and ensure their clients’ cybersecurity resilience.\nEmpowering MSPs and MSSPs to Accelerate Their vCISO Journey\nBy addressing the knowledge shortage and providing structured, accessible learning, the vCISO academy allows service providers to:\nBroaden your perspective:\nThe vCISO Academy provides a deeper understanding of what it means to be a vCISO with specialized training to address the cybersecurity shortage. By helping to equip professionals with vCISO expertise, the Academy is helping fill a critical gap in the industry, ensuring businesses have access to the security leadership they need.\nEmpower professional growth:\nThe vCISO Academy is designed to advance professionals' careers by developing their vCISO skills, positioning them as trusted advisors, and making them invaluable to their clients. Courses are created by industry experts who share practical knowledge and real-world experience.\nScale services profitably and strengthen client relationships:\nFor MSPs and MSSPs, adding vCISO services is a strategic move that opens up new revenue streams and strengthens client relationships.\nWith the vCISO Academy, MSPs and MSSPs are better positioned to capitalize on emerging opportunities in the vCISO market while meeting the critical security needs of SMBs.\nStart Your vCISO Journey with the vCISO Academy\nAs the cybersecurity landscape continues to evolve, the role of the vCISO is becoming a cornerstone of success for MSPs and MSSPs. The vCISO academy offers and invaluable resource to help service providers gain the expertise needed to thrive in this competitive landscape.\nWhether you are just establishing your vCISO services or looking to expand, the vCISO Academy provides the tools, knowledge, and support you need to grow your business and serve your clients more effectively.\nStart your journey by visiting the\nvCISO Academy\ntoday and take the first step toward scaling your cybersecurity services and driving business growth. Together, we can ensure that businesses of all sizes have access to the cybersecurity leadership they need to stay secure​​.\nGet started on\nvCISO\njourney today!\nSponsored and written by\nCynomi\n."
    },
    {
        "Title": "Malicious Chrome extensions can spoof password managers in new attack",
        "Link": "https://www.bleepingcomputer.com/news/security/malicious-chrome-extensions-can-spoof-password-managers-in-new-attack/",
        "Summary": "A newly devised \"polymorphic\" attack allows malicious Chrome extensions to morph into other browser extensions, including password managers, crypto wallets, and banking apps, to steal sensitive information. [...]",
        "Date": "2025-03-06",
        "Content": "A newly devised \"polymorphic\" attack allows malicious Chrome extensions to morph into other browser extensions, including password managers, crypto wallets, and banking apps, to steal sensitive information.\nThe attack was\ndevised by SquareX Labs\n, which warns of its practicality and feasibility on the latest version of Chrome. The researchers have responsibly disclosed the attack to Google.\nShape-shifting Chrome extensions\nThe attack begins with the submission of the malicious polymorphic extension on Chrome's Web Store.\nSquareX uses an AI marketing tool as an example, which offers the promised functionality, tricking victims into installing and pinning the extension on their browser.\nTo get a list of other installed extension, the malicious extension abuses the the 'chrome.management' API, which it was given access to during installation.\nIf the malicious extension doesn't have this permission, SquareX says there's a second, stealthier way to achieve the same, involving resource injection onto web pages the victim visits.\nThe malicious script attempts to load a specific file or URL unique to targetted extensions, and if it loads, it can be concluded that the extension is installed.\nThe list of installed extensions is sent back to an attacker-controlled server, and if a targeted one is found, the attackers command the malicious extension to morph into the targeted one.\nIn SquareX's demonstration, the attackers impersonate the 1Password password manager extension by first disabling the legitimate one using the 'chrome.management' API, or if the permissions aren't available, user interface manipulation tactics to hide it from the user.\nSimultaneously, the malicious extension switches its icon to mimic that of 1Password, changes its name accordingly, and displays a fake login popup that matches the appearance of the real one.\nTo force the user into entering their credentials, when attempting to log in to a site, a fake \"Session Expired\" prompt is served, making the victim think they were logged out.\nThis will prompt the user to log back into 1Password through a phishing form that sends inputted credentials back to the attackers.\nFake prompt (left) and phishing popup (right)\nSource: SquareX\nOnce the sensitive information is sent to the attackers, the malicious extension reverts to its original appearance, and the real extension is re-enabled, so everything appears normal again.\nA demonstration of this attack can be seen below, where the malicious extension impersonates 1Password.\nMitigation measures\nSquareX recommends that Google implement specific defenses against this attack, such as blocking abrupt extension icons and HTML changes on installed extensions or at least notifying users when this happens.\nHowever, at the time of writing, there are no measures to prevent this kind of deceptive impersonation.\nSquareX researchers also noted that Google wrongfully classifies the 'chrome.management' API as \"medium risk,\" and it is extensively accessed by popular extensions such as page stylers, ad blockers, and password managers.\nBleepingComputer has contacted Google to request a comment on the topic, and we will update this post as soon as we hear back.\nRelated Articles:\nMicrosoft Teams phishing attack alerts coming to everyone next month\nGoogle launches customizable Web Store for Enterprise extensions\nNew details reveal how hackers hijacked 35 Google Chrome extensions\nYouTube warns of AI-generated video of its CEO used in phishing attacks\nNew ClickFix attack deploys Havoc C2 via Microsoft Sharepoint"
    },
    {
        "Title": "Under Pressure: US Charges China's APT-for-Hire Hackers",
        "Link": "https://www.darkreading.com/threat-intelligence/us-charges-china-apt-for-hire-hackers",
        "Summary": "The US Justice Department on Wednesday announced charges against members of the Chinese-backed i-Soon &quot;secret&quot; APT and APT27, the latter implicated in January's Treasury breach.",
        "Date": "2025-03-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/us-charges-china-apt-for-hire-hackers"
    },
    {
        "Title": "Women Faced the Brunt of Cybersecurity Cutbacks in 2024",
        "Link": "https://www.darkreading.com/remote-workforce/women-cyber-cutbacks-2024",
        "Summary": "Many women are finding that they are unhappy in their cybersecurity roles, largely due to the layoffs their companies are experiencing, cutbacks, and return to in-office work policies.",
        "Date": "2025-03-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/women-cyber-cutbacks-2024"
    },
    {
        "Title": "Enterprise AI Through a Data Security Lens: Balancing Productivity With Safety",
        "Link": "https://www.darkreading.com/cyber-risk/enterprise-ai-through-data-security-lens-balancing-productivity-safety",
        "Summary": "Recently, 57 countries signed an agreement pledging an &quot;open&quot; and &quot;inclusive&quot; approach to AI's development. The US and UK were not among them, with the US vice president implying productivity should be the priority over safety. Should the opportunity for AI to drive innovation and productivity be prioritized over safety and security?",
        "Date": "2025-03-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/enterprise-ai-through-data-security-lens-balancing-productivity-safety"
    },
    {
        "Title": "CISA Cuts: A Dangerous Gamble in a Dangerous World",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/cisa-cuts-dangerous-gamble-dangerous-world",
        "Summary": "The Cybersecurity and Infrastructure Security Agency's role in risk management needs to expand, not shrink.",
        "Date": "2025-03-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/cisa-cuts-dangerous-gamble-dangerous-world"
    },
    {
        "Title": "Deepfake Videos of YouTube CEO Phish Creators",
        "Link": "https://www.darkreading.com/remote-workforce/deepfake-videos-youtube-phish-creators",
        "Summary": "YouTube creators are being targeted by scammers seeking out their credentials, using deepfake tactics to lure them in with a false sense of legitimacy.",
        "Date": "2025-03-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/deepfake-videos-youtube-phish-creators"
    },
    {
        "Title": "Ransomware Attacks Build Against Saudi Construction Firms",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/ransomware-attacks-saudi-construction-firms",
        "Summary": "Cybercriminals are ramping up their efforts in the Kingdom and targeting more than just petroleum firms; now, they're aiming for Middle East organizations in the IT, government, construction, and real estate sectors too.",
        "Date": "2025-03-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/ransomware-attacks-saudi-construction-firms"
    },
    {
        "Title": "Cybersecurity's Future Is All About Governance, Not More Tools",
        "Link": "https://www.darkreading.com/cyber-risk/cybersecurity-future-governance-not-more-tools",
        "Summary": "As CISOs take a seat at the boardroom table, the focus shifts from stacking security tools to driving accountability, efficiency, and strategic risk management.",
        "Date": "2025-03-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/cybersecurity-future-governance-not-more-tools"
    },
    {
        "Title": "Espionage Actor 'Lotus Blossom' Targets Southeast Asia",
        "Link": "https://www.darkreading.com/threat-intelligence/espionage-lotus-blossom-south-east-asia",
        "Summary": "The threat actor, of unknown origin, is deploying a proprietary backdoor malware known as &quot;Sagerunex&quot; against critical infrastructure in Hong Kong, Philippines, Taiwan, and Vietnam.",
        "Date": "2025-03-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/espionage-lotus-blossom-south-east-asia"
    },
    {
        "Title": "House Passes Bill Requiring Federal Contractors to Implement Vulnerability Disclosure Policies",
        "Link": "https://www.securityweek.com/federal-contractor-cybersecurity-bill-passes-house/",
        "Summary": "<p>The House of Representatives has passed a bill aimed at requiring federal contractors to have a Vulnerability Disclosure Policy (VDP).</p>\n<p>The post <a href=\"https://www.securityweek.com/federal-contractor-cybersecurity-bill-passes-house/\">House Passes Bill Requiring Federal Contractors to Implement Vulnerability Disclosure Policies</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-03-06",
        "Content": "Hi, what are you looking for?\nThe House of Representatives has passed a bill aimed at requiring federal contractors to have a Vulnerability Disclosure Policy (VDP).\nBy\nFlipboard\nReddit\nWhatsapp\nWhatsapp\nEmail\nThe House of Representatives has passed a bill aimed at requiring federal contractors to have a vulnerability disclosure policy (VDP).\nThe Federal Contractor Cybersecurity Vulnerability Reduction Act of 2025 instructs the Office of Management and Budget (OMB) to consult with CISA, the Office of the National Cyber Director, NIST, and other relevant departments, and require federal contractors to have a VDP that is consistent with NIST guidelines. \n\n\n\nThe bill also instructs the Defense Department to require defense contractors to adopt similar policies. \n\n\n\nThe goal is to make it easier for individuals and companies who find vulnerabilities in contractors’ systems to responsibly disclose them. \n\n\n\nJust days before the bill passed the House, several major cybersecurity and tech companies signed a letter urging the House and Senate to approve the legislation. \n\n\n\n“Contractors, given the vast amount of sensitive data they handle, are prime targets for cyber threats. As a result, the bill ensures all companies contracting with the federal government adhere to security best practices,” reads the letter signed by HackerOne, Bugcrowd, Microsoft, Infoblox, Rapid7, Trend Micro, Tenable and Schneider Electric.\n\n\n\n“The bill builds upon existing policies that have encouraged the adoption of VDPs, promoting a proactive approach to cybersecurity and helping protect critical systems before they can be exploited,” it continues. \n\n\n\nLawmakers have been trying to pass this bill for the past two years. It was first introduced by Representative Nancy Mace (R-SC) in 2023, with a companion version introduced in 2024 by senators Mark R. Warner (D-VA) and James Lankford (R-OK).Advertisement. Scroll to continue reading.\n\n\nThe bill received approval from the House Committee on Oversight and Accountability in May 2024 and was later incorporated into the National Defense Authorization Act (NDAA). \n\n\n\nThe legislation is now in the Senate, where it has been referred to the Committee on Homeland Security and Governmental Affairs.\n\n\n\nRelated: Senate Passes Bill to Protect Kids Online and Make Tech Companies Accountable for Harmful Content\nRelated: House Passes Bill Barring Sale of Personal Information to Foreign Adversaries\nRelated: California Governor Vetoes Bill to Create First-in-Nation AI Safety Measures\n\nThe Federal Contractor Cybersecurity Vulnerability Reduction Act of 2025 instructs the Office of Management and Budget (OMB) to consult with CISA, the Office of the National Cyber Director, NIST, and other relevant departments, and require federal contractors to have a VDP that is consistent with NIST guidelines. \n\n\n\nThe bill also instructs the Defense Department to require defense contractors to adopt similar policies. \n\n\n\nThe goal is to make it easier for individuals and companies who find vulnerabilities in contractors’ systems to responsibly disclose them. \n\n\n\nJust days before the bill passed the House, several major cybersecurity and tech companies signed a letter urging the House and Senate to approve the legislation. \n\n\n\n“Contractors, given the vast amount of sensitive data they handle, are prime targets for cyber threats. As a result, the bill ensures all companies contracting with the federal government adhere to security best practices,” reads the letter signed by HackerOne, Bugcrowd, Microsoft, Infoblox, Rapid7, Trend Micro, Tenable and Schneider Electric.\n\n\n\n“The bill builds upon existing policies that have encouraged the adoption of VDPs, promoting a proactive approach to cybersecurity and helping protect critical systems before they can be exploited,” it continues. \n\n\n\nLawmakers have been trying to pass this bill for the past two years. It was first introduced by Representative Nancy Mace (R-SC) in 2023, with a companion version introduced in 2024 by senators Mark R. Warner (D-VA) and James Lankford (R-OK).Advertisement. Scroll to continue reading.\n\n\nThe bill received approval from the House Committee on Oversight and Accountability in May 2024 and was later incorporated into the National Defense Authorization Act (NDAA). \n\n\n\nThe legislation is now in the Senate, where it has been referred to the Committee on Homeland Security and Governmental Affairs.\n\n\n\nRelated: Senate Passes Bill to Protect Kids Online and Make Tech Companies Accountable for Harmful Content\nRelated: House Passes Bill Barring Sale of Personal Information to Foreign Adversaries\nRelated: California Governor Vetoes Bill to Create First-in-Nation AI Safety Measures\n\nThe bill also instructs the Defense Department to require defense contractors to adopt similar policies. \n\n\n\nThe goal is to make it easier for individuals and companies who find vulnerabilities in contractors’ systems to responsibly disclose them. \n\n\n\nJust days before the bill passed the House, several major cybersecurity and tech companies signed a letter urging the House and Senate to approve the legislation. \n\n\n\n“Contractors, given the vast amount of sensitive data they handle, are prime targets for cyber threats. As a result, the bill ensures all companies contracting with the federal government adhere to security best practices,” reads the letter signed by HackerOne, Bugcrowd, Microsoft, Infoblox, Rapid7, Trend Micro, Tenable and Schneider Electric.\n\n\n\n“The bill builds upon existing policies that have encouraged the adoption of VDPs, promoting a proactive approach to cybersecurity and helping protect critical systems before they can be exploited,” it continues. \n\n\n\nLawmakers have been trying to pass this bill for the past two years. It was first introduced by Representative Nancy Mace (R-SC) in 2023, with a companion version introduced in 2024 by senators Mark R. Warner (D-VA) and James Lankford (R-OK).Advertisement. Scroll to continue reading.\n\n\nThe bill received approval from the House Committee on Oversight and Accountability in May 2024 and was later incorporated into the National Defense Authorization Act (NDAA). \n\n\n\nThe legislation is now in the Senate, where it has been referred to the Committee on Homeland Security and Governmental Affairs.\n\n\n\nRelated: Senate Passes Bill to Protect Kids Online and Make Tech Companies Accountable for Harmful Content\nRelated: House Passes Bill Barring Sale of Personal Information to Foreign Adversaries\nRelated: California Governor Vetoes Bill to Create First-in-Nation AI Safety Measures\n\nThe goal is to make it easier for individuals and companies who find vulnerabilities in contractors’ systems to responsibly disclose them. \n\n\n\nJust days before the bill passed the House, several major cybersecurity and tech companies signed a letter urging the House and Senate to approve the legislation. \n\n\n\n“Contractors, given the vast amount of sensitive data they handle, are prime targets for cyber threats. As a result, the bill ensures all companies contracting with the federal government adhere to security best practices,” reads the letter signed by HackerOne, Bugcrowd, Microsoft, Infoblox, Rapid7, Trend Micro, Tenable and Schneider Electric.\n\n\n\n“The bill builds upon existing policies that have encouraged the adoption of VDPs, promoting a proactive approach to cybersecurity and helping protect critical systems before they can be exploited,” it continues. \n\n\n\nLawmakers have been trying to pass this bill for the past two years. It was first introduced by Representative Nancy Mace (R-SC) in 2023, with a companion version introduced in 2024 by senators Mark R. Warner (D-VA) and James Lankford (R-OK).Advertisement. Scroll to continue reading.\n\n\nThe bill received approval from the House Committee on Oversight and Accountability in May 2024 and was later incorporated into the National Defense Authorization Act (NDAA). \n\n\n\nThe legislation is now in the Senate, where it has been referred to the Committee on Homeland Security and Governmental Affairs.\n\n\n\nRelated: Senate Passes Bill to Protect Kids Online and Make Tech Companies Accountable for Harmful Content\nRelated: House Passes Bill Barring Sale of Personal Information to Foreign Adversaries\nRelated: California Governor Vetoes Bill to Create First-in-Nation AI Safety Measures\n\nJust days before the bill passed the House, several major cybersecurity and tech companies signed a letter urging the House and Senate to approve the legislation. \n\n\n\n“Contractors, given the vast amount of sensitive data they handle, are prime targets for cyber threats. As a result, the bill ensures all companies contracting with the federal government adhere to security best practices,” reads the letter signed by HackerOne, Bugcrowd, Microsoft, Infoblox, Rapid7, Trend Micro, Tenable and Schneider Electric.\n\n\n\n“The bill builds upon existing policies that have encouraged the adoption of VDPs, promoting a proactive approach to cybersecurity and helping protect critical systems before they can be exploited,” it continues. \n\n\n\nLawmakers have been trying to pass this bill for the past two years. It was first introduced by Representative Nancy Mace (R-SC) in 2023, with a companion version introduced in 2024 by senators Mark R. Warner (D-VA) and James Lankford (R-OK).Advertisement. Scroll to continue reading.\n\n\nThe bill received approval from the House Committee on Oversight and Accountability in May 2024 and was later incorporated into the National Defense Authorization Act (NDAA). \n\n\n\nThe legislation is now in the Senate, where it has been referred to the Committee on Homeland Security and Governmental Affairs.\n\n\n\nRelated: Senate Passes Bill to Protect Kids Online and Make Tech Companies Accountable for Harmful Content\nRelated: House Passes Bill Barring Sale of Personal Information to Foreign Adversaries\nRelated: California Governor Vetoes Bill to Create First-in-Nation AI Safety Measures\n\n“Contractors, given the vast amount of sensitive data they handle, are prime targets for cyber threats. As a result, the bill ensures all companies contracting with the federal government adhere to security best practices,” reads the letter signed by HackerOne, Bugcrowd, Microsoft, Infoblox, Rapid7, Trend Micro, Tenable and Schneider Electric.\n\n\n\n“The bill builds upon existing policies that have encouraged the adoption of VDPs, promoting a proactive approach to cybersecurity and helping protect critical systems before they can be exploited,” it continues. \n\n\n\nLawmakers have been trying to pass this bill for the past two years. It was first introduced by Representative Nancy Mace (R-SC) in 2023, with a companion version introduced in 2024 by senators Mark R. Warner (D-VA) and James Lankford (R-OK).Advertisement. Scroll to continue reading.\n\n\nThe bill received approval from the House Committee on Oversight and Accountability in May 2024 and was later incorporated into the National Defense Authorization Act (NDAA). \n\n\n\nThe legislation is now in the Senate, where it has been referred to the Committee on Homeland Security and Governmental Affairs.\n\n\n\nRelated: Senate Passes Bill to Protect Kids Online and Make Tech Companies Accountable for Harmful Content\nRelated: House Passes Bill Barring Sale of Personal Information to Foreign Adversaries\nRelated: California Governor Vetoes Bill to Create First-in-Nation AI Safety Measures\n\n“The bill builds upon existing policies that have encouraged the adoption of VDPs, promoting a proactive approach to cybersecurity and helping protect critical systems before they can be exploited,” it continues. \n\n\n\nLawmakers have been trying to pass this bill for the past two years. It was first introduced by Representative Nancy Mace (R-SC) in 2023, with a companion version introduced in 2024 by senators Mark R. Warner (D-VA) and James Lankford (R-OK).Advertisement. Scroll to continue reading.\n\n\nThe bill received approval from the House Committee on Oversight and Accountability in May 2024 and was later incorporated into the National Defense Authorization Act (NDAA). \n\n\n\nThe legislation is now in the Senate, where it has been referred to the Committee on Homeland Security and Governmental Affairs.\n\n\n\nRelated: Senate Passes Bill to Protect Kids Online and Make Tech Companies Accountable for Harmful Content\nRelated: House Passes Bill Barring Sale of Personal Information to Foreign Adversaries\nRelated: California Governor Vetoes Bill to Create First-in-Nation AI Safety Measures\n\nLawmakers have been trying to pass this bill for the past two years. It was first introduced by Representative Nancy Mace (R-SC) in 2023, with a companion version introduced in 2024 by senators Mark R. Warner (D-VA) and James Lankford (R-OK).Advertisement. Scroll to continue reading.\n\n\nThe bill received approval from the House Committee on Oversight and Accountability in May 2024 and was later incorporated into the National Defense Authorization Act (NDAA). \n\n\n\nThe legislation is now in the Senate, where it has been referred to the Committee on Homeland Security and Governmental Affairs.\n\n\n\nRelated: Senate Passes Bill to Protect Kids Online and Make Tech Companies Accountable for Harmful Content\nRelated: House Passes Bill Barring Sale of Personal Information to Foreign Adversaries\nRelated: California Governor Vetoes Bill to Create First-in-Nation AI Safety Measures\n\nThe bill received approval from the House Committee on Oversight and Accountability in May 2024 and was later incorporated into the National Defense Authorization Act (NDAA). \n\n\n\nThe legislation is now in the Senate, where it has been referred to the Committee on Homeland Security and Governmental Affairs.\n\n\n\nRelated: Senate Passes Bill to Protect Kids Online and Make Tech Companies Accountable for Harmful Content\nRelated: House Passes Bill Barring Sale of Personal Information to Foreign Adversaries\nRelated: California Governor Vetoes Bill to Create First-in-Nation AI Safety Measures\n\nThe legislation is now in the Senate, where it has been referred to the Committee on Homeland Security and Governmental Affairs.\n\n\n\nRelated: Senate Passes Bill to Protect Kids Online and Make Tech Companies Accountable for Harmful Content\nRelated: House Passes Bill Barring Sale of Personal Information to Foreign Adversaries\nRelated: California Governor Vetoes Bill to Create First-in-Nation AI Safety Measures\n\nRelated: Senate Passes Bill to Protect Kids Online and Make Tech Companies Accountable for Harmful Content\nRelated: House Passes Bill Barring Sale of Personal Information to Foreign Adversaries\nRelated: California Governor Vetoes Bill to Create First-in-Nation AI Safety Measures\n\nRelated: House Passes Bill Barring Sale of Personal Information to Foreign Adversaries\nRelated: California Governor Vetoes Bill to Create First-in-Nation AI Safety Measures\n\nRelated: California Governor Vetoes Bill to Create First-in-Nation AI Safety Measures\n\nEduard Kovacs (@EduardKovacs) is a managing editor at SecurityWeek. He worked as a high school IT teacher for two years before starting a career in journalism as Softpedia’s security news reporter. Eduard holds a bachelor’s degree in industrial informatics and a master’s degree in computer techniques applied in electrical engineering.\nSubscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.\nJoin this in-depth briefing on how to protect executives and the enterprises they lead from the growing convergence of digital, narrative, and physical attacks.\nLearn how integrating BAS and Automated Penetration Testing empowers security teams to quickly identify and validate threats, enabling prompt response and remediation.\nSasha Pailet Koff has been named Managing Director of the Cyber Readiness Institute.\nKen Naumann has been appointed CEO of security data analytics company Devo Technology.\nMobile EDR firm iVerify has appointed Mike Rosen as Chief Information Security Officer.\n\n\nUnauthorized AI usage is a ticking time bomb. A tool that wasn’t considered a risk yesterday may introduce new AI-powered features overnight.\n(Alastair Paterson)\n\n\n\nThe current state of regulation and the overwhelming burden it brings to most enterprises is a discussion worth having\n(Joshua Goldfarb)\n\n\n\nLet’s examine, through the lens of some historic breaches, the five most common mistakes that still serve as a catalyst to compromise.\n(Trevin Edgeworth)\n\n\n\nAI systems can sometimes struggle with complex or nuanced situations, so human intervention can help identify and address potential issues that algorithms might not.\n(Marc Solomon)\n\n\n\nOrganizations adopting the transformative nature of agentic AI are urged to take heed of prompt engineering tactics being practiced by threat actors.\n(Etay Maor)\n\nFlipboard\nReddit\nWhatsapp\nWhatsapp\nEmail\nGot a confidential news tip? We want to hear from you.\nReach a large audience of enterprise cybersecurity professionals \nSubscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.\nCopyright © 2025 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\r\n\t\t\t\t\tSubscribe to the SecurityWeek Email Briefing to stay informed on the latest cybersecurity\r\n\t\t\t\t\tnews, threats, and expert insights. Unsubscribe at any time.\r\n\t\t\t\t\t\n\n\n"
    },
    {
        "Title": "Nigerian Accused of Hacking Tax Preparation Firms Extradited to US",
        "Link": "https://www.securityweek.com/nigerian-accused-of-hacking-tax-preparation-firms-extradited-to-us/",
        "Summary": "<p>Matthew Akande was extradited to the US to face charges for his role in hacking into Massachusetts tax preparation firms’ networks.</p>\n<p>The post <a href=\"https://www.securityweek.com/nigerian-accused-of-hacking-tax-preparation-firms-extradited-to-us/\">Nigerian Accused of Hacking Tax Preparation Firms Extradited to US</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-03-06",
        "Content": "Hi, what are you looking for?\nMatthew Akande was extradited to the US to face charges for his role in hacking into Massachusetts tax preparation firms’ networks.\nBy\nFlipboard\nReddit\nWhatsapp\nWhatsapp\nEmail\nA Nigerian national appeared in a US court on Wednesday facing computer intrusion, wire fraud, government money theft, identity theft, and money laundering charges related to the hacking into the networks of US tax preparation companies.\nThe man, Matthew Akande, 36, a resident of Mexico, was arrested in the UK in October 2024, and extradited to the US on March 5, 2025. He was charged in 2022, but the indictment was unsealed only after his arrest.\n\n\n\nTogether with Kehinde H. Oyetunji, 33, a Nigerian national living in North Dakota, and other co-conspirators, Akande allegedly filed fraudulent tax returns for roughly five years, using US taxpayers’ personally identifiable information (PII).\n\n\n\nIn February 2020, the co-conspirators allegedly engaged in a phishing and computer hacking scheme to steal PII from Massachusetts tax preparation firms’ systems.\n\n\n\nAccording to court documents, the perpetrators sent phishing emails to five Massachusetts tax preparation firms, tricking their employees into downloading remote access trojans such as the Warzone RAT.\n\n\n\nAkande allegedly used the malware to steal PII and prior year tax information, and then used the information to file fraudulent tax returns that directed tax refunds to bank accounts opened by Oyetunji and others.\n\n\n\nThe perpetrators then withdrew the funds in the US, kept a portion to themselves, and transferred the rest to third parties in Mexico.\n\n\n\nBetween June 2016 and June 2021, Akande and his co-conspirators allegedly filed over 1,000 fraudulent tax returns, aiming to obtain over $8.1 million in tax refunds, and receiving over $1.3 million.Advertisement. Scroll to continue reading.\n\n\nOyetunji pleaded guilty in December 2022 to computer hacking, government money theft, and money laundering, but has not been sentenced yet.\n\n\n\nRelated: US Charges Genesis Market User\nRelated: Russian Phobos Ransomware Operator Extradited to US\nRelated: US Charges Three Eastern Europeans Over Ransomware and Malvertising, Leader Extradited\nRelated: Ukrainian Raccoon Infostealer Operator Extradited to US\n\nThe man, Matthew Akande, 36, a resident of Mexico, was arrested in the UK in October 2024, and extradited to the US on March 5, 2025. He was charged in 2022, but the indictment was unsealed only after his arrest.\n\n\n\nTogether with Kehinde H. Oyetunji, 33, a Nigerian national living in North Dakota, and other co-conspirators, Akande allegedly filed fraudulent tax returns for roughly five years, using US taxpayers’ personally identifiable information (PII).\n\n\n\nIn February 2020, the co-conspirators allegedly engaged in a phishing and computer hacking scheme to steal PII from Massachusetts tax preparation firms’ systems.\n\n\n\nAccording to court documents, the perpetrators sent phishing emails to five Massachusetts tax preparation firms, tricking their employees into downloading remote access trojans such as the Warzone RAT.\n\n\n\nAkande allegedly used the malware to steal PII and prior year tax information, and then used the information to file fraudulent tax returns that directed tax refunds to bank accounts opened by Oyetunji and others.\n\n\n\nThe perpetrators then withdrew the funds in the US, kept a portion to themselves, and transferred the rest to third parties in Mexico.\n\n\n\nBetween June 2016 and June 2021, Akande and his co-conspirators allegedly filed over 1,000 fraudulent tax returns, aiming to obtain over $8.1 million in tax refunds, and receiving over $1.3 million.Advertisement. Scroll to continue reading.\n\n\nOyetunji pleaded guilty in December 2022 to computer hacking, government money theft, and money laundering, but has not been sentenced yet.\n\n\n\nRelated: US Charges Genesis Market User\nRelated: Russian Phobos Ransomware Operator Extradited to US\nRelated: US Charges Three Eastern Europeans Over Ransomware and Malvertising, Leader Extradited\nRelated: Ukrainian Raccoon Infostealer Operator Extradited to US\n\nTogether with Kehinde H. Oyetunji, 33, a Nigerian national living in North Dakota, and other co-conspirators, Akande allegedly filed fraudulent tax returns for roughly five years, using US taxpayers’ personally identifiable information (PII).\n\n\n\nIn February 2020, the co-conspirators allegedly engaged in a phishing and computer hacking scheme to steal PII from Massachusetts tax preparation firms’ systems.\n\n\n\nAccording to court documents, the perpetrators sent phishing emails to five Massachusetts tax preparation firms, tricking their employees into downloading remote access trojans such as the Warzone RAT.\n\n\n\nAkande allegedly used the malware to steal PII and prior year tax information, and then used the information to file fraudulent tax returns that directed tax refunds to bank accounts opened by Oyetunji and others.\n\n\n\nThe perpetrators then withdrew the funds in the US, kept a portion to themselves, and transferred the rest to third parties in Mexico.\n\n\n\nBetween June 2016 and June 2021, Akande and his co-conspirators allegedly filed over 1,000 fraudulent tax returns, aiming to obtain over $8.1 million in tax refunds, and receiving over $1.3 million.Advertisement. Scroll to continue reading.\n\n\nOyetunji pleaded guilty in December 2022 to computer hacking, government money theft, and money laundering, but has not been sentenced yet.\n\n\n\nRelated: US Charges Genesis Market User\nRelated: Russian Phobos Ransomware Operator Extradited to US\nRelated: US Charges Three Eastern Europeans Over Ransomware and Malvertising, Leader Extradited\nRelated: Ukrainian Raccoon Infostealer Operator Extradited to US\n\nIn February 2020, the co-conspirators allegedly engaged in a phishing and computer hacking scheme to steal PII from Massachusetts tax preparation firms’ systems.\n\n\n\nAccording to court documents, the perpetrators sent phishing emails to five Massachusetts tax preparation firms, tricking their employees into downloading remote access trojans such as the Warzone RAT.\n\n\n\nAkande allegedly used the malware to steal PII and prior year tax information, and then used the information to file fraudulent tax returns that directed tax refunds to bank accounts opened by Oyetunji and others.\n\n\n\nThe perpetrators then withdrew the funds in the US, kept a portion to themselves, and transferred the rest to third parties in Mexico.\n\n\n\nBetween June 2016 and June 2021, Akande and his co-conspirators allegedly filed over 1,000 fraudulent tax returns, aiming to obtain over $8.1 million in tax refunds, and receiving over $1.3 million.Advertisement. Scroll to continue reading.\n\n\nOyetunji pleaded guilty in December 2022 to computer hacking, government money theft, and money laundering, but has not been sentenced yet.\n\n\n\nRelated: US Charges Genesis Market User\nRelated: Russian Phobos Ransomware Operator Extradited to US\nRelated: US Charges Three Eastern Europeans Over Ransomware and Malvertising, Leader Extradited\nRelated: Ukrainian Raccoon Infostealer Operator Extradited to US\n\nAccording to court documents, the perpetrators sent phishing emails to five Massachusetts tax preparation firms, tricking their employees into downloading remote access trojans such as the Warzone RAT.\n\n\n\nAkande allegedly used the malware to steal PII and prior year tax information, and then used the information to file fraudulent tax returns that directed tax refunds to bank accounts opened by Oyetunji and others.\n\n\n\nThe perpetrators then withdrew the funds in the US, kept a portion to themselves, and transferred the rest to third parties in Mexico.\n\n\n\nBetween June 2016 and June 2021, Akande and his co-conspirators allegedly filed over 1,000 fraudulent tax returns, aiming to obtain over $8.1 million in tax refunds, and receiving over $1.3 million.Advertisement. Scroll to continue reading.\n\n\nOyetunji pleaded guilty in December 2022 to computer hacking, government money theft, and money laundering, but has not been sentenced yet.\n\n\n\nRelated: US Charges Genesis Market User\nRelated: Russian Phobos Ransomware Operator Extradited to US\nRelated: US Charges Three Eastern Europeans Over Ransomware and Malvertising, Leader Extradited\nRelated: Ukrainian Raccoon Infostealer Operator Extradited to US\n\nAkande allegedly used the malware to steal PII and prior year tax information, and then used the information to file fraudulent tax returns that directed tax refunds to bank accounts opened by Oyetunji and others.\n\n\n\nThe perpetrators then withdrew the funds in the US, kept a portion to themselves, and transferred the rest to third parties in Mexico.\n\n\n\nBetween June 2016 and June 2021, Akande and his co-conspirators allegedly filed over 1,000 fraudulent tax returns, aiming to obtain over $8.1 million in tax refunds, and receiving over $1.3 million.Advertisement. Scroll to continue reading.\n\n\nOyetunji pleaded guilty in December 2022 to computer hacking, government money theft, and money laundering, but has not been sentenced yet.\n\n\n\nRelated: US Charges Genesis Market User\nRelated: Russian Phobos Ransomware Operator Extradited to US\nRelated: US Charges Three Eastern Europeans Over Ransomware and Malvertising, Leader Extradited\nRelated: Ukrainian Raccoon Infostealer Operator Extradited to US\n\nThe perpetrators then withdrew the funds in the US, kept a portion to themselves, and transferred the rest to third parties in Mexico.\n\n\n\nBetween June 2016 and June 2021, Akande and his co-conspirators allegedly filed over 1,000 fraudulent tax returns, aiming to obtain over $8.1 million in tax refunds, and receiving over $1.3 million.Advertisement. Scroll to continue reading.\n\n\nOyetunji pleaded guilty in December 2022 to computer hacking, government money theft, and money laundering, but has not been sentenced yet.\n\n\n\nRelated: US Charges Genesis Market User\nRelated: Russian Phobos Ransomware Operator Extradited to US\nRelated: US Charges Three Eastern Europeans Over Ransomware and Malvertising, Leader Extradited\nRelated: Ukrainian Raccoon Infostealer Operator Extradited to US\n\nBetween June 2016 and June 2021, Akande and his co-conspirators allegedly filed over 1,000 fraudulent tax returns, aiming to obtain over $8.1 million in tax refunds, and receiving over $1.3 million.Advertisement. Scroll to continue reading.\n\n\nOyetunji pleaded guilty in December 2022 to computer hacking, government money theft, and money laundering, but has not been sentenced yet.\n\n\n\nRelated: US Charges Genesis Market User\nRelated: Russian Phobos Ransomware Operator Extradited to US\nRelated: US Charges Three Eastern Europeans Over Ransomware and Malvertising, Leader Extradited\nRelated: Ukrainian Raccoon Infostealer Operator Extradited to US\n\nOyetunji pleaded guilty in December 2022 to computer hacking, government money theft, and money laundering, but has not been sentenced yet.\n\n\n\nRelated: US Charges Genesis Market User\nRelated: Russian Phobos Ransomware Operator Extradited to US\nRelated: US Charges Three Eastern Europeans Over Ransomware and Malvertising, Leader Extradited\nRelated: Ukrainian Raccoon Infostealer Operator Extradited to US\n\nRelated: US Charges Genesis Market User\nRelated: Russian Phobos Ransomware Operator Extradited to US\nRelated: US Charges Three Eastern Europeans Over Ransomware and Malvertising, Leader Extradited\nRelated: Ukrainian Raccoon Infostealer Operator Extradited to US\n\nRelated: Russian Phobos Ransomware Operator Extradited to US\nRelated: US Charges Three Eastern Europeans Over Ransomware and Malvertising, Leader Extradited\nRelated: Ukrainian Raccoon Infostealer Operator Extradited to US\n\nRelated: US Charges Three Eastern Europeans Over Ransomware and Malvertising, Leader Extradited\nRelated: Ukrainian Raccoon Infostealer Operator Extradited to US\n\nRelated: Ukrainian Raccoon Infostealer Operator Extradited to US\n\nIonut Arghire is an international correspondent for SecurityWeek.\nSubscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.\nJoin this in-depth briefing on how to protect executives and the enterprises they lead from the growing convergence of digital, narrative, and physical attacks.\nLearn how integrating BAS and Automated Penetration Testing empowers security teams to quickly identify and validate threats, enabling prompt response and remediation.\nSasha Pailet Koff has been named Managing Director of the Cyber Readiness Institute.\nKen Naumann has been appointed CEO of security data analytics company Devo Technology.\nMobile EDR firm iVerify has appointed Mike Rosen as Chief Information Security Officer.\n\n\nUnauthorized AI usage is a ticking time bomb. A tool that wasn’t considered a risk yesterday may introduce new AI-powered features overnight.\n(Alastair Paterson)\n\n\n\nThe current state of regulation and the overwhelming burden it brings to most enterprises is a discussion worth having\n(Joshua Goldfarb)\n\n\n\nLet’s examine, through the lens of some historic breaches, the five most common mistakes that still serve as a catalyst to compromise.\n(Trevin Edgeworth)\n\n\n\nAI systems can sometimes struggle with complex or nuanced situations, so human intervention can help identify and address potential issues that algorithms might not.\n(Marc Solomon)\n\n\n\nOrganizations adopting the transformative nature of agentic AI are urged to take heed of prompt engineering tactics being practiced by threat actors.\n(Etay Maor)\n\nFlipboard\nReddit\nWhatsapp\nWhatsapp\nEmail\nGot a confidential news tip? We want to hear from you.\nReach a large audience of enterprise cybersecurity professionals \nSubscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.\nCopyright © 2025 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\r\n\t\t\t\t\tSubscribe to the SecurityWeek Email Briefing to stay informed on the latest cybersecurity\r\n\t\t\t\t\tnews, threats, and expert insights. Unsubscribe at any time.\r\n\t\t\t\t\t\n\n\n"
    },
    {
        "Title": "Financial Organizations Urge CISA to Revise Proposed CIRCIA Implementation",
        "Link": "https://www.securityweek.com/financial-organizations-urge-cisa-to-revise-proposed-circia-implementation/",
        "Summary": "<p>A group of financial organizations is asking CISA to rescind and reissue its proposed implementation of CIRCIA.</p>\n<p>The post <a href=\"https://www.securityweek.com/financial-organizations-urge-cisa-to-revise-proposed-circia-implementation/\">Financial Organizations Urge CISA to Revise Proposed CIRCIA Implementation</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-03-06",
        "Content": "Hi, what are you looking for?\nA group of financial organizations is asking CISA to rescind and reissue its proposed implementation of CIRCIA.\nBy\nFlipboard\nReddit\nWhatsapp\nWhatsapp\nEmail\nA group of financial organizations sent an open letter to the US cybersecurity agency CISA, urging it to rescind and reissue the proposed implementation of the Cyber Incident Reporting for Critical Infrastructure Act of 2022 (CIRCIA).\nCIRCIA, which was signed into law in March 2022, requires covered entities to report any major cybersecurity incident within 72 hours, and to report ransomware payments within 24 hours of making the payment.\n\n\n\nLast year, CISA asked for public comment on a proposed rulemaking, saying that CIRCIA would lead to better understanding of cyber threats and that the cyber incident reporting rule would likely impact roughly 316,000 entities.\n\n\n\nCISA’s proposed rules to implement CIRCIA are set to enter effect in October 2025, but the American Bankers Association, Bank Policy Institute, Institute of International Bankers, and the Securities Industry and Financial Markets Association believe that it would have detrimental repercussions in its current form.\n\n\n\nAccording to the advocacy group, while CIRCIA is expected “to establish a uniform incident reporting standard across all critical infrastructure sectors,” CISA’s notice of proposed rulemaking (NPRM) departs from the initial intent and requires organizations to divert resources from response and recovery.\n\n\n\n“We ask that you work with industry to craft a new rule that allows a victim company to focus its resources on responding to an attack rather than filing government reports,” reads the open letter (PDF) from the financial organizations.\n\n\n\nCiting public figures voicing concerns over CISA’s NPRM missing the mark and adding additional burden on the covered entities, the group requests that CISA adjusts the proposed rulemaking ahead of CIRCIA’s October 2025 statutory deadline for issuing a final rule.\n\n\n\n“We would welcome an ongoing dialogue with you to strike the balance Congress intended ‘between getting information quickly and letting victims respond to an attack without imposing burdensome requirements’” the open letter reads.Advertisement. Scroll to continue reading.\n\n\nAs Reuven Aronashvili, founder and CEO at CYE, recently told SecurityWeek, this is exactly the type of challenges that regulations could face in 2025, when “introducing uncertainty for organizations working to meet cybersecurity compliance standards”.\n\n\n\n“For example, laws such as CIRCIA, which requires prompt reporting of cyber incidents, could come under increased scrutiny and legal disputes. This may disrupt the consistency and dependability of reporting obligations, posing challenges for CISOs in developing effective response strategies,” Aronashvili said.\n\n\n\nRelated: Bipartisan Bill to Tighten Vulnerability Disclosure Rules for Federal Contractors\nRelated: Supreme Court Ruling Threatens the Framework of Cybersecurity Regulation\nRelated: US Issues Final Rule for Protecting Personal Data Against Foreign Adversaries\nRelated: New Rules for US National Security Agencies Balance AI’s Promise With Need to Protect Against Risks\n\nCIRCIA, which was signed into law in March 2022, requires covered entities to report any major cybersecurity incident within 72 hours, and to report ransomware payments within 24 hours of making the payment.\n\n\n\nLast year, CISA asked for public comment on a proposed rulemaking, saying that CIRCIA would lead to better understanding of cyber threats and that the cyber incident reporting rule would likely impact roughly 316,000 entities.\n\n\n\nCISA’s proposed rules to implement CIRCIA are set to enter effect in October 2025, but the American Bankers Association, Bank Policy Institute, Institute of International Bankers, and the Securities Industry and Financial Markets Association believe that it would have detrimental repercussions in its current form.\n\n\n\nAccording to the advocacy group, while CIRCIA is expected “to establish a uniform incident reporting standard across all critical infrastructure sectors,” CISA’s notice of proposed rulemaking (NPRM) departs from the initial intent and requires organizations to divert resources from response and recovery.\n\n\n\n“We ask that you work with industry to craft a new rule that allows a victim company to focus its resources on responding to an attack rather than filing government reports,” reads the open letter (PDF) from the financial organizations.\n\n\n\nCiting public figures voicing concerns over CISA’s NPRM missing the mark and adding additional burden on the covered entities, the group requests that CISA adjusts the proposed rulemaking ahead of CIRCIA’s October 2025 statutory deadline for issuing a final rule.\n\n\n\n“We would welcome an ongoing dialogue with you to strike the balance Congress intended ‘between getting information quickly and letting victims respond to an attack without imposing burdensome requirements’” the open letter reads.Advertisement. Scroll to continue reading.\n\n\nAs Reuven Aronashvili, founder and CEO at CYE, recently told SecurityWeek, this is exactly the type of challenges that regulations could face in 2025, when “introducing uncertainty for organizations working to meet cybersecurity compliance standards”.\n\n\n\n“For example, laws such as CIRCIA, which requires prompt reporting of cyber incidents, could come under increased scrutiny and legal disputes. This may disrupt the consistency and dependability of reporting obligations, posing challenges for CISOs in developing effective response strategies,” Aronashvili said.\n\n\n\nRelated: Bipartisan Bill to Tighten Vulnerability Disclosure Rules for Federal Contractors\nRelated: Supreme Court Ruling Threatens the Framework of Cybersecurity Regulation\nRelated: US Issues Final Rule for Protecting Personal Data Against Foreign Adversaries\nRelated: New Rules for US National Security Agencies Balance AI’s Promise With Need to Protect Against Risks\n\nLast year, CISA asked for public comment on a proposed rulemaking, saying that CIRCIA would lead to better understanding of cyber threats and that the cyber incident reporting rule would likely impact roughly 316,000 entities.\n\n\n\nCISA’s proposed rules to implement CIRCIA are set to enter effect in October 2025, but the American Bankers Association, Bank Policy Institute, Institute of International Bankers, and the Securities Industry and Financial Markets Association believe that it would have detrimental repercussions in its current form.\n\n\n\nAccording to the advocacy group, while CIRCIA is expected “to establish a uniform incident reporting standard across all critical infrastructure sectors,” CISA’s notice of proposed rulemaking (NPRM) departs from the initial intent and requires organizations to divert resources from response and recovery.\n\n\n\n“We ask that you work with industry to craft a new rule that allows a victim company to focus its resources on responding to an attack rather than filing government reports,” reads the open letter (PDF) from the financial organizations.\n\n\n\nCiting public figures voicing concerns over CISA’s NPRM missing the mark and adding additional burden on the covered entities, the group requests that CISA adjusts the proposed rulemaking ahead of CIRCIA’s October 2025 statutory deadline for issuing a final rule.\n\n\n\n“We would welcome an ongoing dialogue with you to strike the balance Congress intended ‘between getting information quickly and letting victims respond to an attack without imposing burdensome requirements’” the open letter reads.Advertisement. Scroll to continue reading.\n\n\nAs Reuven Aronashvili, founder and CEO at CYE, recently told SecurityWeek, this is exactly the type of challenges that regulations could face in 2025, when “introducing uncertainty for organizations working to meet cybersecurity compliance standards”.\n\n\n\n“For example, laws such as CIRCIA, which requires prompt reporting of cyber incidents, could come under increased scrutiny and legal disputes. This may disrupt the consistency and dependability of reporting obligations, posing challenges for CISOs in developing effective response strategies,” Aronashvili said.\n\n\n\nRelated: Bipartisan Bill to Tighten Vulnerability Disclosure Rules for Federal Contractors\nRelated: Supreme Court Ruling Threatens the Framework of Cybersecurity Regulation\nRelated: US Issues Final Rule for Protecting Personal Data Against Foreign Adversaries\nRelated: New Rules for US National Security Agencies Balance AI’s Promise With Need to Protect Against Risks\n\nCISA’s proposed rules to implement CIRCIA are set to enter effect in October 2025, but the American Bankers Association, Bank Policy Institute, Institute of International Bankers, and the Securities Industry and Financial Markets Association believe that it would have detrimental repercussions in its current form.\n\n\n\nAccording to the advocacy group, while CIRCIA is expected “to establish a uniform incident reporting standard across all critical infrastructure sectors,” CISA’s notice of proposed rulemaking (NPRM) departs from the initial intent and requires organizations to divert resources from response and recovery.\n\n\n\n“We ask that you work with industry to craft a new rule that allows a victim company to focus its resources on responding to an attack rather than filing government reports,” reads the open letter (PDF) from the financial organizations.\n\n\n\nCiting public figures voicing concerns over CISA’s NPRM missing the mark and adding additional burden on the covered entities, the group requests that CISA adjusts the proposed rulemaking ahead of CIRCIA’s October 2025 statutory deadline for issuing a final rule.\n\n\n\n“We would welcome an ongoing dialogue with you to strike the balance Congress intended ‘between getting information quickly and letting victims respond to an attack without imposing burdensome requirements’” the open letter reads.Advertisement. Scroll to continue reading.\n\n\nAs Reuven Aronashvili, founder and CEO at CYE, recently told SecurityWeek, this is exactly the type of challenges that regulations could face in 2025, when “introducing uncertainty for organizations working to meet cybersecurity compliance standards”.\n\n\n\n“For example, laws such as CIRCIA, which requires prompt reporting of cyber incidents, could come under increased scrutiny and legal disputes. This may disrupt the consistency and dependability of reporting obligations, posing challenges for CISOs in developing effective response strategies,” Aronashvili said.\n\n\n\nRelated: Bipartisan Bill to Tighten Vulnerability Disclosure Rules for Federal Contractors\nRelated: Supreme Court Ruling Threatens the Framework of Cybersecurity Regulation\nRelated: US Issues Final Rule for Protecting Personal Data Against Foreign Adversaries\nRelated: New Rules for US National Security Agencies Balance AI’s Promise With Need to Protect Against Risks\n\nAccording to the advocacy group, while CIRCIA is expected “to establish a uniform incident reporting standard across all critical infrastructure sectors,” CISA’s notice of proposed rulemaking (NPRM) departs from the initial intent and requires organizations to divert resources from response and recovery.\n\n\n\n“We ask that you work with industry to craft a new rule that allows a victim company to focus its resources on responding to an attack rather than filing government reports,” reads the open letter (PDF) from the financial organizations.\n\n\n\nCiting public figures voicing concerns over CISA’s NPRM missing the mark and adding additional burden on the covered entities, the group requests that CISA adjusts the proposed rulemaking ahead of CIRCIA’s October 2025 statutory deadline for issuing a final rule.\n\n\n\n“We would welcome an ongoing dialogue with you to strike the balance Congress intended ‘between getting information quickly and letting victims respond to an attack without imposing burdensome requirements’” the open letter reads.Advertisement. Scroll to continue reading.\n\n\nAs Reuven Aronashvili, founder and CEO at CYE, recently told SecurityWeek, this is exactly the type of challenges that regulations could face in 2025, when “introducing uncertainty for organizations working to meet cybersecurity compliance standards”.\n\n\n\n“For example, laws such as CIRCIA, which requires prompt reporting of cyber incidents, could come under increased scrutiny and legal disputes. This may disrupt the consistency and dependability of reporting obligations, posing challenges for CISOs in developing effective response strategies,” Aronashvili said.\n\n\n\nRelated: Bipartisan Bill to Tighten Vulnerability Disclosure Rules for Federal Contractors\nRelated: Supreme Court Ruling Threatens the Framework of Cybersecurity Regulation\nRelated: US Issues Final Rule for Protecting Personal Data Against Foreign Adversaries\nRelated: New Rules for US National Security Agencies Balance AI’s Promise With Need to Protect Against Risks\n\n“We ask that you work with industry to craft a new rule that allows a victim company to focus its resources on responding to an attack rather than filing government reports,” reads the open letter (PDF) from the financial organizations.\n\n\n\nCiting public figures voicing concerns over CISA’s NPRM missing the mark and adding additional burden on the covered entities, the group requests that CISA adjusts the proposed rulemaking ahead of CIRCIA’s October 2025 statutory deadline for issuing a final rule.\n\n\n\n“We would welcome an ongoing dialogue with you to strike the balance Congress intended ‘between getting information quickly and letting victims respond to an attack without imposing burdensome requirements’” the open letter reads.Advertisement. Scroll to continue reading.\n\n\nAs Reuven Aronashvili, founder and CEO at CYE, recently told SecurityWeek, this is exactly the type of challenges that regulations could face in 2025, when “introducing uncertainty for organizations working to meet cybersecurity compliance standards”.\n\n\n\n“For example, laws such as CIRCIA, which requires prompt reporting of cyber incidents, could come under increased scrutiny and legal disputes. This may disrupt the consistency and dependability of reporting obligations, posing challenges for CISOs in developing effective response strategies,” Aronashvili said.\n\n\n\nRelated: Bipartisan Bill to Tighten Vulnerability Disclosure Rules for Federal Contractors\nRelated: Supreme Court Ruling Threatens the Framework of Cybersecurity Regulation\nRelated: US Issues Final Rule for Protecting Personal Data Against Foreign Adversaries\nRelated: New Rules for US National Security Agencies Balance AI’s Promise With Need to Protect Against Risks\n\nCiting public figures voicing concerns over CISA’s NPRM missing the mark and adding additional burden on the covered entities, the group requests that CISA adjusts the proposed rulemaking ahead of CIRCIA’s October 2025 statutory deadline for issuing a final rule.\n\n\n\n“We would welcome an ongoing dialogue with you to strike the balance Congress intended ‘between getting information quickly and letting victims respond to an attack without imposing burdensome requirements’” the open letter reads.Advertisement. Scroll to continue reading.\n\n\nAs Reuven Aronashvili, founder and CEO at CYE, recently told SecurityWeek, this is exactly the type of challenges that regulations could face in 2025, when “introducing uncertainty for organizations working to meet cybersecurity compliance standards”.\n\n\n\n“For example, laws such as CIRCIA, which requires prompt reporting of cyber incidents, could come under increased scrutiny and legal disputes. This may disrupt the consistency and dependability of reporting obligations, posing challenges for CISOs in developing effective response strategies,” Aronashvili said.\n\n\n\nRelated: Bipartisan Bill to Tighten Vulnerability Disclosure Rules for Federal Contractors\nRelated: Supreme Court Ruling Threatens the Framework of Cybersecurity Regulation\nRelated: US Issues Final Rule for Protecting Personal Data Against Foreign Adversaries\nRelated: New Rules for US National Security Agencies Balance AI’s Promise With Need to Protect Against Risks\n\n“We would welcome an ongoing dialogue with you to strike the balance Congress intended ‘between getting information quickly and letting victims respond to an attack without imposing burdensome requirements’” the open letter reads.Advertisement. Scroll to continue reading.\n\n\nAs Reuven Aronashvili, founder and CEO at CYE, recently told SecurityWeek, this is exactly the type of challenges that regulations could face in 2025, when “introducing uncertainty for organizations working to meet cybersecurity compliance standards”.\n\n\n\n“For example, laws such as CIRCIA, which requires prompt reporting of cyber incidents, could come under increased scrutiny and legal disputes. This may disrupt the consistency and dependability of reporting obligations, posing challenges for CISOs in developing effective response strategies,” Aronashvili said.\n\n\n\nRelated: Bipartisan Bill to Tighten Vulnerability Disclosure Rules for Federal Contractors\nRelated: Supreme Court Ruling Threatens the Framework of Cybersecurity Regulation\nRelated: US Issues Final Rule for Protecting Personal Data Against Foreign Adversaries\nRelated: New Rules for US National Security Agencies Balance AI’s Promise With Need to Protect Against Risks\n\nAs Reuven Aronashvili, founder and CEO at CYE, recently told SecurityWeek, this is exactly the type of challenges that regulations could face in 2025, when “introducing uncertainty for organizations working to meet cybersecurity compliance standards”.\n\n\n\n“For example, laws such as CIRCIA, which requires prompt reporting of cyber incidents, could come under increased scrutiny and legal disputes. This may disrupt the consistency and dependability of reporting obligations, posing challenges for CISOs in developing effective response strategies,” Aronashvili said.\n\n\n\nRelated: Bipartisan Bill to Tighten Vulnerability Disclosure Rules for Federal Contractors\nRelated: Supreme Court Ruling Threatens the Framework of Cybersecurity Regulation\nRelated: US Issues Final Rule for Protecting Personal Data Against Foreign Adversaries\nRelated: New Rules for US National Security Agencies Balance AI’s Promise With Need to Protect Against Risks\n\n“For example, laws such as CIRCIA, which requires prompt reporting of cyber incidents, could come under increased scrutiny and legal disputes. This may disrupt the consistency and dependability of reporting obligations, posing challenges for CISOs in developing effective response strategies,” Aronashvili said.\n\n\n\nRelated: Bipartisan Bill to Tighten Vulnerability Disclosure Rules for Federal Contractors\nRelated: Supreme Court Ruling Threatens the Framework of Cybersecurity Regulation\nRelated: US Issues Final Rule for Protecting Personal Data Against Foreign Adversaries\nRelated: New Rules for US National Security Agencies Balance AI’s Promise With Need to Protect Against Risks\n\nRelated: Bipartisan Bill to Tighten Vulnerability Disclosure Rules for Federal Contractors\nRelated: Supreme Court Ruling Threatens the Framework of Cybersecurity Regulation\nRelated: US Issues Final Rule for Protecting Personal Data Against Foreign Adversaries\nRelated: New Rules for US National Security Agencies Balance AI’s Promise With Need to Protect Against Risks\n\nRelated: Supreme Court Ruling Threatens the Framework of Cybersecurity Regulation\nRelated: US Issues Final Rule for Protecting Personal Data Against Foreign Adversaries\nRelated: New Rules for US National Security Agencies Balance AI’s Promise With Need to Protect Against Risks\n\nRelated: US Issues Final Rule for Protecting Personal Data Against Foreign Adversaries\nRelated: New Rules for US National Security Agencies Balance AI’s Promise With Need to Protect Against Risks\n\nRelated: New Rules for US National Security Agencies Balance AI’s Promise With Need to Protect Against Risks\n\nIonut Arghire is an international correspondent for SecurityWeek.\nSubscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.\nJoin this in-depth briefing on how to protect executives and the enterprises they lead from the growing convergence of digital, narrative, and physical attacks.\nLearn how integrating BAS and Automated Penetration Testing empowers security teams to quickly identify and validate threats, enabling prompt response and remediation.\nSasha Pailet Koff has been named Managing Director of the Cyber Readiness Institute.\nKen Naumann has been appointed CEO of security data analytics company Devo Technology.\nMobile EDR firm iVerify has appointed Mike Rosen as Chief Information Security Officer.\n\n\nUnauthorized AI usage is a ticking time bomb. A tool that wasn’t considered a risk yesterday may introduce new AI-powered features overnight.\n(Alastair Paterson)\n\n\n\nThe current state of regulation and the overwhelming burden it brings to most enterprises is a discussion worth having\n(Joshua Goldfarb)\n\n\n\nLet’s examine, through the lens of some historic breaches, the five most common mistakes that still serve as a catalyst to compromise.\n(Trevin Edgeworth)\n\n\n\nAI systems can sometimes struggle with complex or nuanced situations, so human intervention can help identify and address potential issues that algorithms might not.\n(Marc Solomon)\n\n\n\nOrganizations adopting the transformative nature of agentic AI are urged to take heed of prompt engineering tactics being practiced by threat actors.\n(Etay Maor)\n\nFlipboard\nReddit\nWhatsapp\nWhatsapp\nEmail\nGot a confidential news tip? We want to hear from you.\nReach a large audience of enterprise cybersecurity professionals \nSubscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.\nCopyright © 2025 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\r\n\t\t\t\t\tSubscribe to the SecurityWeek Email Briefing to stay informed on the latest cybersecurity\r\n\t\t\t\t\tnews, threats, and expert insights. Unsubscribe at any time.\r\n\t\t\t\t\t\n\n\n"
    },
    {
        "Title": "BadBox Botnet Powered by 1 Million Android Devices Disrupted",
        "Link": "https://www.securityweek.com/badbox-botnet-powered-by-1-million-android-devices-disrupted/",
        "Summary": "<p>A second iteration of the BadBox botnet that affected over one million Android devices has been partially disrupted.</p>\n<p>The post <a href=\"https://www.securityweek.com/badbox-botnet-powered-by-1-million-android-devices-disrupted/\">BadBox Botnet Powered by 1 Million Android Devices Disrupted</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-03-06",
        "Content": "Hi, what are you looking for?\nA second iteration of the BadBox botnet that affected over one million Android devices has been partially disrupted.\nBy\nFlipboard\nReddit\nWhatsapp\nWhatsapp\nEmail\nA second iteration of the BadBox botnet has been partially disrupted after impacting over one million Android devices worldwide, bot and fraud protection firm Human Security reports.\nFirst discovered in 2023, the BadBox botnet consisted of low-cost Android devices that came to the shelves with backdoored firmware. These devices, including smartphones, CTV boxes, and tablets, were made by at least one Chinese manufacturer, and some of them were used in public schools in the US.\n\n\n\nIn December 2024, Germany sinkholed the communication between over 30,000 BadBox-infected media devices and their command-and-control (C&C) servers, but a larger BadBox botnet consisting of over 190,000 devices was discovered shortly after.\n\n\n\nNow, Human Security warns that the botnet’s impact has been much larger than initially believed, and that a second iteration, dubbed BadBox 2.0, has infected over one million devices in more than 220 countries.\n\n\n\nBadBox 2.0 follows a similar pattern as its predecessor: backdoored Android Open Source Project devices from multiple Chinese manufacturers, including as off-brand tablets, CTV boxes, projectors, and other types of products, are abused by multiple threat actors to commit different types of fraud.\n\n\n\nThe backdoor is implanted in these products somewhere in the supply chain, fetched from a C&C server upon first boot, or downloaded from a third-party marketplace by the unsuspecting user.\n\n\n\n“The BadBox and BadBox 2.0 threat actors exploit software or hardware supply chains or distribute seemingly benign applications that contain ‘loader’ functionality in order to infect these devices and applications with the backdoor,” Human Security notes.\n\n\n\nThe good news is that the BadBox 2.0 botnet has been partially disrupted through collaboration with Google, Trend Micro, Shadowserver, and other partners. The bad news is that a complete disruption is not yet possible, given that the infection occurs within the supply chain.Advertisement. Scroll to continue reading.\n\n\nThe infected devices have been abused for programmatic ad fraud, click fraud, or as residential proxies, enabling malicious activities such as account takeover, account creation, distributed denial-of-service (DDoS) attacks, malware distribution, and one-time password (OTP) theft.\n\n\n\nHowever, the botnet could be abused for other types of malicious activities, given that its operators can load and execute code on the infected devices, thus enabling any functionality they want.\n\n\n\n“With the backdoor in place, infected devices could be instructed to carry out any cyberattack a threat actor developed,” Human Security notes.\n\n\n\nFour threat actors involved in operating the BadBox 2.0 botnet have been identified, namely SalesTracker Group (likely responsible for the first BadBox botnet), MoYu Group (developed the backdoor), Lemon Group (previously linked to the Guerrilla malware), and LongTV (a Malaysian internet and media company’s brand).\n\n\n\n“This wasn’t an attack by a single threat actor, this was a collection of threat actors sharing resources; and not only were they sharing infrastructure from which to support the attack, they shared targets. It was an all-for-one, one-for-all sort of attack,” Human Security notes.\n\n\n\nTo disrupt the botnet’s activities, ad fraud monetization mitigations were put in place, detection of BadBox-associated behavior was added to Google Play Protect, and publisher accounts associated with the fraud schemes were terminated.\n\n\n\n“The fraudsters in this operation attacked the digital advertising ecosystem, compromised the journey from an ad to a website, abused login portals through residential proxy capabilities, and exploited the backdoored devices as a botnet,” the cybersecurity firm notes.\n\n\n\nRelated: Vo1d Botnet Evolves as It Ensnares 1.6 Million Android TV Boxes\nRelated: 1,000 Apps Used in Malicious Campaign Targeting Android Users in India\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: ‘DroidBot’ Android Trojan Targets Banking, Cryptocurrency Applications\n\nFirst discovered in 2023, the BadBox botnet consisted of low-cost Android devices that came to the shelves with backdoored firmware. These devices, including smartphones, CTV boxes, and tablets, were made by at least one Chinese manufacturer, and some of them were used in public schools in the US.\n\n\n\nIn December 2024, Germany sinkholed the communication between over 30,000 BadBox-infected media devices and their command-and-control (C&C) servers, but a larger BadBox botnet consisting of over 190,000 devices was discovered shortly after.\n\n\n\nNow, Human Security warns that the botnet’s impact has been much larger than initially believed, and that a second iteration, dubbed BadBox 2.0, has infected over one million devices in more than 220 countries.\n\n\n\nBadBox 2.0 follows a similar pattern as its predecessor: backdoored Android Open Source Project devices from multiple Chinese manufacturers, including as off-brand tablets, CTV boxes, projectors, and other types of products, are abused by multiple threat actors to commit different types of fraud.\n\n\n\nThe backdoor is implanted in these products somewhere in the supply chain, fetched from a C&C server upon first boot, or downloaded from a third-party marketplace by the unsuspecting user.\n\n\n\n“The BadBox and BadBox 2.0 threat actors exploit software or hardware supply chains or distribute seemingly benign applications that contain ‘loader’ functionality in order to infect these devices and applications with the backdoor,” Human Security notes.\n\n\n\nThe good news is that the BadBox 2.0 botnet has been partially disrupted through collaboration with Google, Trend Micro, Shadowserver, and other partners. The bad news is that a complete disruption is not yet possible, given that the infection occurs within the supply chain.Advertisement. Scroll to continue reading.\n\n\nThe infected devices have been abused for programmatic ad fraud, click fraud, or as residential proxies, enabling malicious activities such as account takeover, account creation, distributed denial-of-service (DDoS) attacks, malware distribution, and one-time password (OTP) theft.\n\n\n\nHowever, the botnet could be abused for other types of malicious activities, given that its operators can load and execute code on the infected devices, thus enabling any functionality they want.\n\n\n\n“With the backdoor in place, infected devices could be instructed to carry out any cyberattack a threat actor developed,” Human Security notes.\n\n\n\nFour threat actors involved in operating the BadBox 2.0 botnet have been identified, namely SalesTracker Group (likely responsible for the first BadBox botnet), MoYu Group (developed the backdoor), Lemon Group (previously linked to the Guerrilla malware), and LongTV (a Malaysian internet and media company’s brand).\n\n\n\n“This wasn’t an attack by a single threat actor, this was a collection of threat actors sharing resources; and not only were they sharing infrastructure from which to support the attack, they shared targets. It was an all-for-one, one-for-all sort of attack,” Human Security notes.\n\n\n\nTo disrupt the botnet’s activities, ad fraud monetization mitigations were put in place, detection of BadBox-associated behavior was added to Google Play Protect, and publisher accounts associated with the fraud schemes were terminated.\n\n\n\n“The fraudsters in this operation attacked the digital advertising ecosystem, compromised the journey from an ad to a website, abused login portals through residential proxy capabilities, and exploited the backdoored devices as a botnet,” the cybersecurity firm notes.\n\n\n\nRelated: Vo1d Botnet Evolves as It Ensnares 1.6 Million Android TV Boxes\nRelated: 1,000 Apps Used in Malicious Campaign Targeting Android Users in India\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: ‘DroidBot’ Android Trojan Targets Banking, Cryptocurrency Applications\n\nIn December 2024, Germany sinkholed the communication between over 30,000 BadBox-infected media devices and their command-and-control (C&C) servers, but a larger BadBox botnet consisting of over 190,000 devices was discovered shortly after.\n\n\n\nNow, Human Security warns that the botnet’s impact has been much larger than initially believed, and that a second iteration, dubbed BadBox 2.0, has infected over one million devices in more than 220 countries.\n\n\n\nBadBox 2.0 follows a similar pattern as its predecessor: backdoored Android Open Source Project devices from multiple Chinese manufacturers, including as off-brand tablets, CTV boxes, projectors, and other types of products, are abused by multiple threat actors to commit different types of fraud.\n\n\n\nThe backdoor is implanted in these products somewhere in the supply chain, fetched from a C&C server upon first boot, or downloaded from a third-party marketplace by the unsuspecting user.\n\n\n\n“The BadBox and BadBox 2.0 threat actors exploit software or hardware supply chains or distribute seemingly benign applications that contain ‘loader’ functionality in order to infect these devices and applications with the backdoor,” Human Security notes.\n\n\n\nThe good news is that the BadBox 2.0 botnet has been partially disrupted through collaboration with Google, Trend Micro, Shadowserver, and other partners. The bad news is that a complete disruption is not yet possible, given that the infection occurs within the supply chain.Advertisement. Scroll to continue reading.\n\n\nThe infected devices have been abused for programmatic ad fraud, click fraud, or as residential proxies, enabling malicious activities such as account takeover, account creation, distributed denial-of-service (DDoS) attacks, malware distribution, and one-time password (OTP) theft.\n\n\n\nHowever, the botnet could be abused for other types of malicious activities, given that its operators can load and execute code on the infected devices, thus enabling any functionality they want.\n\n\n\n“With the backdoor in place, infected devices could be instructed to carry out any cyberattack a threat actor developed,” Human Security notes.\n\n\n\nFour threat actors involved in operating the BadBox 2.0 botnet have been identified, namely SalesTracker Group (likely responsible for the first BadBox botnet), MoYu Group (developed the backdoor), Lemon Group (previously linked to the Guerrilla malware), and LongTV (a Malaysian internet and media company’s brand).\n\n\n\n“This wasn’t an attack by a single threat actor, this was a collection of threat actors sharing resources; and not only were they sharing infrastructure from which to support the attack, they shared targets. It was an all-for-one, one-for-all sort of attack,” Human Security notes.\n\n\n\nTo disrupt the botnet’s activities, ad fraud monetization mitigations were put in place, detection of BadBox-associated behavior was added to Google Play Protect, and publisher accounts associated with the fraud schemes were terminated.\n\n\n\n“The fraudsters in this operation attacked the digital advertising ecosystem, compromised the journey from an ad to a website, abused login portals through residential proxy capabilities, and exploited the backdoored devices as a botnet,” the cybersecurity firm notes.\n\n\n\nRelated: Vo1d Botnet Evolves as It Ensnares 1.6 Million Android TV Boxes\nRelated: 1,000 Apps Used in Malicious Campaign Targeting Android Users in India\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: ‘DroidBot’ Android Trojan Targets Banking, Cryptocurrency Applications\n\nNow, Human Security warns that the botnet’s impact has been much larger than initially believed, and that a second iteration, dubbed BadBox 2.0, has infected over one million devices in more than 220 countries.\n\n\n\nBadBox 2.0 follows a similar pattern as its predecessor: backdoored Android Open Source Project devices from multiple Chinese manufacturers, including as off-brand tablets, CTV boxes, projectors, and other types of products, are abused by multiple threat actors to commit different types of fraud.\n\n\n\nThe backdoor is implanted in these products somewhere in the supply chain, fetched from a C&C server upon first boot, or downloaded from a third-party marketplace by the unsuspecting user.\n\n\n\n“The BadBox and BadBox 2.0 threat actors exploit software or hardware supply chains or distribute seemingly benign applications that contain ‘loader’ functionality in order to infect these devices and applications with the backdoor,” Human Security notes.\n\n\n\nThe good news is that the BadBox 2.0 botnet has been partially disrupted through collaboration with Google, Trend Micro, Shadowserver, and other partners. The bad news is that a complete disruption is not yet possible, given that the infection occurs within the supply chain.Advertisement. Scroll to continue reading.\n\n\nThe infected devices have been abused for programmatic ad fraud, click fraud, or as residential proxies, enabling malicious activities such as account takeover, account creation, distributed denial-of-service (DDoS) attacks, malware distribution, and one-time password (OTP) theft.\n\n\n\nHowever, the botnet could be abused for other types of malicious activities, given that its operators can load and execute code on the infected devices, thus enabling any functionality they want.\n\n\n\n“With the backdoor in place, infected devices could be instructed to carry out any cyberattack a threat actor developed,” Human Security notes.\n\n\n\nFour threat actors involved in operating the BadBox 2.0 botnet have been identified, namely SalesTracker Group (likely responsible for the first BadBox botnet), MoYu Group (developed the backdoor), Lemon Group (previously linked to the Guerrilla malware), and LongTV (a Malaysian internet and media company’s brand).\n\n\n\n“This wasn’t an attack by a single threat actor, this was a collection of threat actors sharing resources; and not only were they sharing infrastructure from which to support the attack, they shared targets. It was an all-for-one, one-for-all sort of attack,” Human Security notes.\n\n\n\nTo disrupt the botnet’s activities, ad fraud monetization mitigations were put in place, detection of BadBox-associated behavior was added to Google Play Protect, and publisher accounts associated with the fraud schemes were terminated.\n\n\n\n“The fraudsters in this operation attacked the digital advertising ecosystem, compromised the journey from an ad to a website, abused login portals through residential proxy capabilities, and exploited the backdoored devices as a botnet,” the cybersecurity firm notes.\n\n\n\nRelated: Vo1d Botnet Evolves as It Ensnares 1.6 Million Android TV Boxes\nRelated: 1,000 Apps Used in Malicious Campaign Targeting Android Users in India\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: ‘DroidBot’ Android Trojan Targets Banking, Cryptocurrency Applications\n\nBadBox 2.0 follows a similar pattern as its predecessor: backdoored Android Open Source Project devices from multiple Chinese manufacturers, including as off-brand tablets, CTV boxes, projectors, and other types of products, are abused by multiple threat actors to commit different types of fraud.\n\n\n\nThe backdoor is implanted in these products somewhere in the supply chain, fetched from a C&C server upon first boot, or downloaded from a third-party marketplace by the unsuspecting user.\n\n\n\n“The BadBox and BadBox 2.0 threat actors exploit software or hardware supply chains or distribute seemingly benign applications that contain ‘loader’ functionality in order to infect these devices and applications with the backdoor,” Human Security notes.\n\n\n\nThe good news is that the BadBox 2.0 botnet has been partially disrupted through collaboration with Google, Trend Micro, Shadowserver, and other partners. The bad news is that a complete disruption is not yet possible, given that the infection occurs within the supply chain.Advertisement. Scroll to continue reading.\n\n\nThe infected devices have been abused for programmatic ad fraud, click fraud, or as residential proxies, enabling malicious activities such as account takeover, account creation, distributed denial-of-service (DDoS) attacks, malware distribution, and one-time password (OTP) theft.\n\n\n\nHowever, the botnet could be abused for other types of malicious activities, given that its operators can load and execute code on the infected devices, thus enabling any functionality they want.\n\n\n\n“With the backdoor in place, infected devices could be instructed to carry out any cyberattack a threat actor developed,” Human Security notes.\n\n\n\nFour threat actors involved in operating the BadBox 2.0 botnet have been identified, namely SalesTracker Group (likely responsible for the first BadBox botnet), MoYu Group (developed the backdoor), Lemon Group (previously linked to the Guerrilla malware), and LongTV (a Malaysian internet and media company’s brand).\n\n\n\n“This wasn’t an attack by a single threat actor, this was a collection of threat actors sharing resources; and not only were they sharing infrastructure from which to support the attack, they shared targets. It was an all-for-one, one-for-all sort of attack,” Human Security notes.\n\n\n\nTo disrupt the botnet’s activities, ad fraud monetization mitigations were put in place, detection of BadBox-associated behavior was added to Google Play Protect, and publisher accounts associated with the fraud schemes were terminated.\n\n\n\n“The fraudsters in this operation attacked the digital advertising ecosystem, compromised the journey from an ad to a website, abused login portals through residential proxy capabilities, and exploited the backdoored devices as a botnet,” the cybersecurity firm notes.\n\n\n\nRelated: Vo1d Botnet Evolves as It Ensnares 1.6 Million Android TV Boxes\nRelated: 1,000 Apps Used in Malicious Campaign Targeting Android Users in India\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: ‘DroidBot’ Android Trojan Targets Banking, Cryptocurrency Applications\n\nThe backdoor is implanted in these products somewhere in the supply chain, fetched from a C&C server upon first boot, or downloaded from a third-party marketplace by the unsuspecting user.\n\n\n\n“The BadBox and BadBox 2.0 threat actors exploit software or hardware supply chains or distribute seemingly benign applications that contain ‘loader’ functionality in order to infect these devices and applications with the backdoor,” Human Security notes.\n\n\n\nThe good news is that the BadBox 2.0 botnet has been partially disrupted through collaboration with Google, Trend Micro, Shadowserver, and other partners. The bad news is that a complete disruption is not yet possible, given that the infection occurs within the supply chain.Advertisement. Scroll to continue reading.\n\n\nThe infected devices have been abused for programmatic ad fraud, click fraud, or as residential proxies, enabling malicious activities such as account takeover, account creation, distributed denial-of-service (DDoS) attacks, malware distribution, and one-time password (OTP) theft.\n\n\n\nHowever, the botnet could be abused for other types of malicious activities, given that its operators can load and execute code on the infected devices, thus enabling any functionality they want.\n\n\n\n“With the backdoor in place, infected devices could be instructed to carry out any cyberattack a threat actor developed,” Human Security notes.\n\n\n\nFour threat actors involved in operating the BadBox 2.0 botnet have been identified, namely SalesTracker Group (likely responsible for the first BadBox botnet), MoYu Group (developed the backdoor), Lemon Group (previously linked to the Guerrilla malware), and LongTV (a Malaysian internet and media company’s brand).\n\n\n\n“This wasn’t an attack by a single threat actor, this was a collection of threat actors sharing resources; and not only were they sharing infrastructure from which to support the attack, they shared targets. It was an all-for-one, one-for-all sort of attack,” Human Security notes.\n\n\n\nTo disrupt the botnet’s activities, ad fraud monetization mitigations were put in place, detection of BadBox-associated behavior was added to Google Play Protect, and publisher accounts associated with the fraud schemes were terminated.\n\n\n\n“The fraudsters in this operation attacked the digital advertising ecosystem, compromised the journey from an ad to a website, abused login portals through residential proxy capabilities, and exploited the backdoored devices as a botnet,” the cybersecurity firm notes.\n\n\n\nRelated: Vo1d Botnet Evolves as It Ensnares 1.6 Million Android TV Boxes\nRelated: 1,000 Apps Used in Malicious Campaign Targeting Android Users in India\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: ‘DroidBot’ Android Trojan Targets Banking, Cryptocurrency Applications\n\n“The BadBox and BadBox 2.0 threat actors exploit software or hardware supply chains or distribute seemingly benign applications that contain ‘loader’ functionality in order to infect these devices and applications with the backdoor,” Human Security notes.\n\n\n\nThe good news is that the BadBox 2.0 botnet has been partially disrupted through collaboration with Google, Trend Micro, Shadowserver, and other partners. The bad news is that a complete disruption is not yet possible, given that the infection occurs within the supply chain.Advertisement. Scroll to continue reading.\n\n\nThe infected devices have been abused for programmatic ad fraud, click fraud, or as residential proxies, enabling malicious activities such as account takeover, account creation, distributed denial-of-service (DDoS) attacks, malware distribution, and one-time password (OTP) theft.\n\n\n\nHowever, the botnet could be abused for other types of malicious activities, given that its operators can load and execute code on the infected devices, thus enabling any functionality they want.\n\n\n\n“With the backdoor in place, infected devices could be instructed to carry out any cyberattack a threat actor developed,” Human Security notes.\n\n\n\nFour threat actors involved in operating the BadBox 2.0 botnet have been identified, namely SalesTracker Group (likely responsible for the first BadBox botnet), MoYu Group (developed the backdoor), Lemon Group (previously linked to the Guerrilla malware), and LongTV (a Malaysian internet and media company’s brand).\n\n\n\n“This wasn’t an attack by a single threat actor, this was a collection of threat actors sharing resources; and not only were they sharing infrastructure from which to support the attack, they shared targets. It was an all-for-one, one-for-all sort of attack,” Human Security notes.\n\n\n\nTo disrupt the botnet’s activities, ad fraud monetization mitigations were put in place, detection of BadBox-associated behavior was added to Google Play Protect, and publisher accounts associated with the fraud schemes were terminated.\n\n\n\n“The fraudsters in this operation attacked the digital advertising ecosystem, compromised the journey from an ad to a website, abused login portals through residential proxy capabilities, and exploited the backdoored devices as a botnet,” the cybersecurity firm notes.\n\n\n\nRelated: Vo1d Botnet Evolves as It Ensnares 1.6 Million Android TV Boxes\nRelated: 1,000 Apps Used in Malicious Campaign Targeting Android Users in India\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: ‘DroidBot’ Android Trojan Targets Banking, Cryptocurrency Applications\n\nThe good news is that the BadBox 2.0 botnet has been partially disrupted through collaboration with Google, Trend Micro, Shadowserver, and other partners. The bad news is that a complete disruption is not yet possible, given that the infection occurs within the supply chain.Advertisement. Scroll to continue reading.\n\n\nThe infected devices have been abused for programmatic ad fraud, click fraud, or as residential proxies, enabling malicious activities such as account takeover, account creation, distributed denial-of-service (DDoS) attacks, malware distribution, and one-time password (OTP) theft.\n\n\n\nHowever, the botnet could be abused for other types of malicious activities, given that its operators can load and execute code on the infected devices, thus enabling any functionality they want.\n\n\n\n“With the backdoor in place, infected devices could be instructed to carry out any cyberattack a threat actor developed,” Human Security notes.\n\n\n\nFour threat actors involved in operating the BadBox 2.0 botnet have been identified, namely SalesTracker Group (likely responsible for the first BadBox botnet), MoYu Group (developed the backdoor), Lemon Group (previously linked to the Guerrilla malware), and LongTV (a Malaysian internet and media company’s brand).\n\n\n\n“This wasn’t an attack by a single threat actor, this was a collection of threat actors sharing resources; and not only were they sharing infrastructure from which to support the attack, they shared targets. It was an all-for-one, one-for-all sort of attack,” Human Security notes.\n\n\n\nTo disrupt the botnet’s activities, ad fraud monetization mitigations were put in place, detection of BadBox-associated behavior was added to Google Play Protect, and publisher accounts associated with the fraud schemes were terminated.\n\n\n\n“The fraudsters in this operation attacked the digital advertising ecosystem, compromised the journey from an ad to a website, abused login portals through residential proxy capabilities, and exploited the backdoored devices as a botnet,” the cybersecurity firm notes.\n\n\n\nRelated: Vo1d Botnet Evolves as It Ensnares 1.6 Million Android TV Boxes\nRelated: 1,000 Apps Used in Malicious Campaign Targeting Android Users in India\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: ‘DroidBot’ Android Trojan Targets Banking, Cryptocurrency Applications\n\nThe infected devices have been abused for programmatic ad fraud, click fraud, or as residential proxies, enabling malicious activities such as account takeover, account creation, distributed denial-of-service (DDoS) attacks, malware distribution, and one-time password (OTP) theft.\n\n\n\nHowever, the botnet could be abused for other types of malicious activities, given that its operators can load and execute code on the infected devices, thus enabling any functionality they want.\n\n\n\n“With the backdoor in place, infected devices could be instructed to carry out any cyberattack a threat actor developed,” Human Security notes.\n\n\n\nFour threat actors involved in operating the BadBox 2.0 botnet have been identified, namely SalesTracker Group (likely responsible for the first BadBox botnet), MoYu Group (developed the backdoor), Lemon Group (previously linked to the Guerrilla malware), and LongTV (a Malaysian internet and media company’s brand).\n\n\n\n“This wasn’t an attack by a single threat actor, this was a collection of threat actors sharing resources; and not only were they sharing infrastructure from which to support the attack, they shared targets. It was an all-for-one, one-for-all sort of attack,” Human Security notes.\n\n\n\nTo disrupt the botnet’s activities, ad fraud monetization mitigations were put in place, detection of BadBox-associated behavior was added to Google Play Protect, and publisher accounts associated with the fraud schemes were terminated.\n\n\n\n“The fraudsters in this operation attacked the digital advertising ecosystem, compromised the journey from an ad to a website, abused login portals through residential proxy capabilities, and exploited the backdoored devices as a botnet,” the cybersecurity firm notes.\n\n\n\nRelated: Vo1d Botnet Evolves as It Ensnares 1.6 Million Android TV Boxes\nRelated: 1,000 Apps Used in Malicious Campaign Targeting Android Users in India\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: ‘DroidBot’ Android Trojan Targets Banking, Cryptocurrency Applications\n\nHowever, the botnet could be abused for other types of malicious activities, given that its operators can load and execute code on the infected devices, thus enabling any functionality they want.\n\n\n\n“With the backdoor in place, infected devices could be instructed to carry out any cyberattack a threat actor developed,” Human Security notes.\n\n\n\nFour threat actors involved in operating the BadBox 2.0 botnet have been identified, namely SalesTracker Group (likely responsible for the first BadBox botnet), MoYu Group (developed the backdoor), Lemon Group (previously linked to the Guerrilla malware), and LongTV (a Malaysian internet and media company’s brand).\n\n\n\n“This wasn’t an attack by a single threat actor, this was a collection of threat actors sharing resources; and not only were they sharing infrastructure from which to support the attack, they shared targets. It was an all-for-one, one-for-all sort of attack,” Human Security notes.\n\n\n\nTo disrupt the botnet’s activities, ad fraud monetization mitigations were put in place, detection of BadBox-associated behavior was added to Google Play Protect, and publisher accounts associated with the fraud schemes were terminated.\n\n\n\n“The fraudsters in this operation attacked the digital advertising ecosystem, compromised the journey from an ad to a website, abused login portals through residential proxy capabilities, and exploited the backdoored devices as a botnet,” the cybersecurity firm notes.\n\n\n\nRelated: Vo1d Botnet Evolves as It Ensnares 1.6 Million Android TV Boxes\nRelated: 1,000 Apps Used in Malicious Campaign Targeting Android Users in India\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: ‘DroidBot’ Android Trojan Targets Banking, Cryptocurrency Applications\n\n“With the backdoor in place, infected devices could be instructed to carry out any cyberattack a threat actor developed,” Human Security notes.\n\n\n\nFour threat actors involved in operating the BadBox 2.0 botnet have been identified, namely SalesTracker Group (likely responsible for the first BadBox botnet), MoYu Group (developed the backdoor), Lemon Group (previously linked to the Guerrilla malware), and LongTV (a Malaysian internet and media company’s brand).\n\n\n\n“This wasn’t an attack by a single threat actor, this was a collection of threat actors sharing resources; and not only were they sharing infrastructure from which to support the attack, they shared targets. It was an all-for-one, one-for-all sort of attack,” Human Security notes.\n\n\n\nTo disrupt the botnet’s activities, ad fraud monetization mitigations were put in place, detection of BadBox-associated behavior was added to Google Play Protect, and publisher accounts associated with the fraud schemes were terminated.\n\n\n\n“The fraudsters in this operation attacked the digital advertising ecosystem, compromised the journey from an ad to a website, abused login portals through residential proxy capabilities, and exploited the backdoored devices as a botnet,” the cybersecurity firm notes.\n\n\n\nRelated: Vo1d Botnet Evolves as It Ensnares 1.6 Million Android TV Boxes\nRelated: 1,000 Apps Used in Malicious Campaign Targeting Android Users in India\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: ‘DroidBot’ Android Trojan Targets Banking, Cryptocurrency Applications\n\nFour threat actors involved in operating the BadBox 2.0 botnet have been identified, namely SalesTracker Group (likely responsible for the first BadBox botnet), MoYu Group (developed the backdoor), Lemon Group (previously linked to the Guerrilla malware), and LongTV (a Malaysian internet and media company’s brand).\n\n\n\n“This wasn’t an attack by a single threat actor, this was a collection of threat actors sharing resources; and not only were they sharing infrastructure from which to support the attack, they shared targets. It was an all-for-one, one-for-all sort of attack,” Human Security notes.\n\n\n\nTo disrupt the botnet’s activities, ad fraud monetization mitigations were put in place, detection of BadBox-associated behavior was added to Google Play Protect, and publisher accounts associated with the fraud schemes were terminated.\n\n\n\n“The fraudsters in this operation attacked the digital advertising ecosystem, compromised the journey from an ad to a website, abused login portals through residential proxy capabilities, and exploited the backdoored devices as a botnet,” the cybersecurity firm notes.\n\n\n\nRelated: Vo1d Botnet Evolves as It Ensnares 1.6 Million Android TV Boxes\nRelated: 1,000 Apps Used in Malicious Campaign Targeting Android Users in India\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: ‘DroidBot’ Android Trojan Targets Banking, Cryptocurrency Applications\n\n“This wasn’t an attack by a single threat actor, this was a collection of threat actors sharing resources; and not only were they sharing infrastructure from which to support the attack, they shared targets. It was an all-for-one, one-for-all sort of attack,” Human Security notes.\n\n\n\nTo disrupt the botnet’s activities, ad fraud monetization mitigations were put in place, detection of BadBox-associated behavior was added to Google Play Protect, and publisher accounts associated with the fraud schemes were terminated.\n\n\n\n“The fraudsters in this operation attacked the digital advertising ecosystem, compromised the journey from an ad to a website, abused login portals through residential proxy capabilities, and exploited the backdoored devices as a botnet,” the cybersecurity firm notes.\n\n\n\nRelated: Vo1d Botnet Evolves as It Ensnares 1.6 Million Android TV Boxes\nRelated: 1,000 Apps Used in Malicious Campaign Targeting Android Users in India\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: ‘DroidBot’ Android Trojan Targets Banking, Cryptocurrency Applications\n\nTo disrupt the botnet’s activities, ad fraud monetization mitigations were put in place, detection of BadBox-associated behavior was added to Google Play Protect, and publisher accounts associated with the fraud schemes were terminated.\n\n\n\n“The fraudsters in this operation attacked the digital advertising ecosystem, compromised the journey from an ad to a website, abused login portals through residential proxy capabilities, and exploited the backdoored devices as a botnet,” the cybersecurity firm notes.\n\n\n\nRelated: Vo1d Botnet Evolves as It Ensnares 1.6 Million Android TV Boxes\nRelated: 1,000 Apps Used in Malicious Campaign Targeting Android Users in India\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: ‘DroidBot’ Android Trojan Targets Banking, Cryptocurrency Applications\n\n“The fraudsters in this operation attacked the digital advertising ecosystem, compromised the journey from an ad to a website, abused login portals through residential proxy capabilities, and exploited the backdoored devices as a botnet,” the cybersecurity firm notes.\n\n\n\nRelated: Vo1d Botnet Evolves as It Ensnares 1.6 Million Android TV Boxes\nRelated: 1,000 Apps Used in Malicious Campaign Targeting Android Users in India\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: ‘DroidBot’ Android Trojan Targets Banking, Cryptocurrency Applications\n\nRelated: Vo1d Botnet Evolves as It Ensnares 1.6 Million Android TV Boxes\nRelated: 1,000 Apps Used in Malicious Campaign Targeting Android Users in India\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: ‘DroidBot’ Android Trojan Targets Banking, Cryptocurrency Applications\n\nRelated: 1,000 Apps Used in Malicious Campaign Targeting Android Users in India\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: ‘DroidBot’ Android Trojan Targets Banking, Cryptocurrency Applications\n\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: ‘DroidBot’ Android Trojan Targets Banking, Cryptocurrency Applications\n\nRelated: ‘DroidBot’ Android Trojan Targets Banking, Cryptocurrency Applications\n\nIonut Arghire is an international correspondent for SecurityWeek.\nSubscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.\nJoin this in-depth briefing on how to protect executives and the enterprises they lead from the growing convergence of digital, narrative, and physical attacks.\nLearn how integrating BAS and Automated Penetration Testing empowers security teams to quickly identify and validate threats, enabling prompt response and remediation.\nSasha Pailet Koff has been named Managing Director of the Cyber Readiness Institute.\nKen Naumann has been appointed CEO of security data analytics company Devo Technology.\nMobile EDR firm iVerify has appointed Mike Rosen as Chief Information Security Officer.\n\n\nUnauthorized AI usage is a ticking time bomb. A tool that wasn’t considered a risk yesterday may introduce new AI-powered features overnight.\n(Alastair Paterson)\n\n\n\nThe current state of regulation and the overwhelming burden it brings to most enterprises is a discussion worth having\n(Joshua Goldfarb)\n\n\n\nLet’s examine, through the lens of some historic breaches, the five most common mistakes that still serve as a catalyst to compromise.\n(Trevin Edgeworth)\n\n\n\nAI systems can sometimes struggle with complex or nuanced situations, so human intervention can help identify and address potential issues that algorithms might not.\n(Marc Solomon)\n\n\n\nOrganizations adopting the transformative nature of agentic AI are urged to take heed of prompt engineering tactics being practiced by threat actors.\n(Etay Maor)\n\nFlipboard\nReddit\nWhatsapp\nWhatsapp\nEmail\nGot a confidential news tip? We want to hear from you.\nReach a large audience of enterprise cybersecurity professionals \nSubscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.\nCopyright © 2025 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\r\n\t\t\t\t\tSubscribe to the SecurityWeek Email Briefing to stay informed on the latest cybersecurity\r\n\t\t\t\t\tnews, threats, and expert insights. Unsubscribe at any time.\r\n\t\t\t\t\t\n\n\n"
    },
    {
        "Title": "AIceberg Gets $10 Million in Seed Funding for AI Security Platform",
        "Link": "https://www.securityweek.com/aiceberg-gets-10-million-in-seed-funding-for-ai-security-platform/",
        "Summary": "<p>AIceberg has launched a solution that helps governments and enterprises with the safe, secure and compliant adoption of AI. </p>\n<p>The post <a href=\"https://www.securityweek.com/aiceberg-gets-10-million-in-seed-funding-for-ai-security-platform/\">AIceberg Gets $10 Million in Seed Funding for AI Security Platform</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-03-06",
        "Content": "Hi, what are you looking for?\nAIceberg has launched a solution that helps governments and enterprises with the safe, secure and compliant adoption of AI. \nBy\nFlipboard\nReddit\nWhatsapp\nWhatsapp\nEmail\nAIceberg announced on Thursday the launch of its AI trust platform, for which it raised $10 million in seed funding from SYN Ventures and Sprout & Oak.\nFounded in 2022, the New York-based company has developed a platform designed to help governments and enterprises with the safe, secure and compliant adoption of AI, specifically generative AI and agentic AI. \n\n\n\nAIceberg says its platform acts as a firewall and gateway that monitors AI usage for potential risks and enables the enforcement of security and other policies.\n\n\n\nThe platform is designed to prevent unsanctioned, unsuitable or illegal content, and automatically redacts personal and other sensitive information. It can detect common cyberattack vectors such as prompt injection, prompt leaking, and jailbreaking, and is capable of performing a security analysis of agentic workflows. \n\n\n\nThe AIceberg platform also provides compliance, transparency, auditability, and observability capabilities. \n\n\n\n“Organizations adopting generative and agentic AI face critical challenges in ensuring safety, security, and compliance,” said Alex Schlager, CEO at AIceberg. “Additionally, many are operating with a false sense of security because while AI TRiSM solutions powered by LLMs seem convenient, using LLMs to safeguard LLMs introduces systemic risks and architectural limitations that undermine their effectiveness.”\n\n\n\n“We are closing the security gap with AIceberg. Purpose-built, non-generative models to detect risk signals and support safe AI adoption, AIceberg works independently of AI applications, using the content of input and output to detect and eliminate risks and power safe, secure, compliant use of generative models and agentic workflows across the enterprise,” Schlager added.\n\n\n\nRelated: Blockaid Raises $50 Million to Secure Blockchain ApplicationsAdvertisement. Scroll to continue reading.\n\n\nRelated: Singulr Launches With $10M in Funding for AI Security and Governance Platform\nRelated: Ex-NSO Group CEO’s Security Firm Dream Raises $100M at $1.1B Valuation\nRelated: Astra, Invary Raise Millions for AI-Powered Pentesting, Runtime Security\n\nFounded in 2022, the New York-based company has developed a platform designed to help governments and enterprises with the safe, secure and compliant adoption of AI, specifically generative AI and agentic AI. \n\n\n\nAIceberg says its platform acts as a firewall and gateway that monitors AI usage for potential risks and enables the enforcement of security and other policies.\n\n\n\nThe platform is designed to prevent unsanctioned, unsuitable or illegal content, and automatically redacts personal and other sensitive information. It can detect common cyberattack vectors such as prompt injection, prompt leaking, and jailbreaking, and is capable of performing a security analysis of agentic workflows. \n\n\n\nThe AIceberg platform also provides compliance, transparency, auditability, and observability capabilities. \n\n\n\n“Organizations adopting generative and agentic AI face critical challenges in ensuring safety, security, and compliance,” said Alex Schlager, CEO at AIceberg. “Additionally, many are operating with a false sense of security because while AI TRiSM solutions powered by LLMs seem convenient, using LLMs to safeguard LLMs introduces systemic risks and architectural limitations that undermine their effectiveness.”\n\n\n\n“We are closing the security gap with AIceberg. Purpose-built, non-generative models to detect risk signals and support safe AI adoption, AIceberg works independently of AI applications, using the content of input and output to detect and eliminate risks and power safe, secure, compliant use of generative models and agentic workflows across the enterprise,” Schlager added.\n\n\n\nRelated: Blockaid Raises $50 Million to Secure Blockchain ApplicationsAdvertisement. Scroll to continue reading.\n\n\nRelated: Singulr Launches With $10M in Funding for AI Security and Governance Platform\nRelated: Ex-NSO Group CEO’s Security Firm Dream Raises $100M at $1.1B Valuation\nRelated: Astra, Invary Raise Millions for AI-Powered Pentesting, Runtime Security\n\nAIceberg says its platform acts as a firewall and gateway that monitors AI usage for potential risks and enables the enforcement of security and other policies.\n\n\n\nThe platform is designed to prevent unsanctioned, unsuitable or illegal content, and automatically redacts personal and other sensitive information. It can detect common cyberattack vectors such as prompt injection, prompt leaking, and jailbreaking, and is capable of performing a security analysis of agentic workflows. \n\n\n\nThe AIceberg platform also provides compliance, transparency, auditability, and observability capabilities. \n\n\n\n“Organizations adopting generative and agentic AI face critical challenges in ensuring safety, security, and compliance,” said Alex Schlager, CEO at AIceberg. “Additionally, many are operating with a false sense of security because while AI TRiSM solutions powered by LLMs seem convenient, using LLMs to safeguard LLMs introduces systemic risks and architectural limitations that undermine their effectiveness.”\n\n\n\n“We are closing the security gap with AIceberg. Purpose-built, non-generative models to detect risk signals and support safe AI adoption, AIceberg works independently of AI applications, using the content of input and output to detect and eliminate risks and power safe, secure, compliant use of generative models and agentic workflows across the enterprise,” Schlager added.\n\n\n\nRelated: Blockaid Raises $50 Million to Secure Blockchain ApplicationsAdvertisement. Scroll to continue reading.\n\n\nRelated: Singulr Launches With $10M in Funding for AI Security and Governance Platform\nRelated: Ex-NSO Group CEO’s Security Firm Dream Raises $100M at $1.1B Valuation\nRelated: Astra, Invary Raise Millions for AI-Powered Pentesting, Runtime Security\n\nThe platform is designed to prevent unsanctioned, unsuitable or illegal content, and automatically redacts personal and other sensitive information. It can detect common cyberattack vectors such as prompt injection, prompt leaking, and jailbreaking, and is capable of performing a security analysis of agentic workflows. \n\n\n\nThe AIceberg platform also provides compliance, transparency, auditability, and observability capabilities. \n\n\n\n“Organizations adopting generative and agentic AI face critical challenges in ensuring safety, security, and compliance,” said Alex Schlager, CEO at AIceberg. “Additionally, many are operating with a false sense of security because while AI TRiSM solutions powered by LLMs seem convenient, using LLMs to safeguard LLMs introduces systemic risks and architectural limitations that undermine their effectiveness.”\n\n\n\n“We are closing the security gap with AIceberg. Purpose-built, non-generative models to detect risk signals and support safe AI adoption, AIceberg works independently of AI applications, using the content of input and output to detect and eliminate risks and power safe, secure, compliant use of generative models and agentic workflows across the enterprise,” Schlager added.\n\n\n\nRelated: Blockaid Raises $50 Million to Secure Blockchain ApplicationsAdvertisement. Scroll to continue reading.\n\n\nRelated: Singulr Launches With $10M in Funding for AI Security and Governance Platform\nRelated: Ex-NSO Group CEO’s Security Firm Dream Raises $100M at $1.1B Valuation\nRelated: Astra, Invary Raise Millions for AI-Powered Pentesting, Runtime Security\n\nThe AIceberg platform also provides compliance, transparency, auditability, and observability capabilities. \n\n\n\n“Organizations adopting generative and agentic AI face critical challenges in ensuring safety, security, and compliance,” said Alex Schlager, CEO at AIceberg. “Additionally, many are operating with a false sense of security because while AI TRiSM solutions powered by LLMs seem convenient, using LLMs to safeguard LLMs introduces systemic risks and architectural limitations that undermine their effectiveness.”\n\n\n\n“We are closing the security gap with AIceberg. Purpose-built, non-generative models to detect risk signals and support safe AI adoption, AIceberg works independently of AI applications, using the content of input and output to detect and eliminate risks and power safe, secure, compliant use of generative models and agentic workflows across the enterprise,” Schlager added.\n\n\n\nRelated: Blockaid Raises $50 Million to Secure Blockchain ApplicationsAdvertisement. Scroll to continue reading.\n\n\nRelated: Singulr Launches With $10M in Funding for AI Security and Governance Platform\nRelated: Ex-NSO Group CEO’s Security Firm Dream Raises $100M at $1.1B Valuation\nRelated: Astra, Invary Raise Millions for AI-Powered Pentesting, Runtime Security\n\n“Organizations adopting generative and agentic AI face critical challenges in ensuring safety, security, and compliance,” said Alex Schlager, CEO at AIceberg. “Additionally, many are operating with a false sense of security because while AI TRiSM solutions powered by LLMs seem convenient, using LLMs to safeguard LLMs introduces systemic risks and architectural limitations that undermine their effectiveness.”\n\n\n\n“We are closing the security gap with AIceberg. Purpose-built, non-generative models to detect risk signals and support safe AI adoption, AIceberg works independently of AI applications, using the content of input and output to detect and eliminate risks and power safe, secure, compliant use of generative models and agentic workflows across the enterprise,” Schlager added.\n\n\n\nRelated: Blockaid Raises $50 Million to Secure Blockchain ApplicationsAdvertisement. Scroll to continue reading.\n\n\nRelated: Singulr Launches With $10M in Funding for AI Security and Governance Platform\nRelated: Ex-NSO Group CEO’s Security Firm Dream Raises $100M at $1.1B Valuation\nRelated: Astra, Invary Raise Millions for AI-Powered Pentesting, Runtime Security\n\n“We are closing the security gap with AIceberg. Purpose-built, non-generative models to detect risk signals and support safe AI adoption, AIceberg works independently of AI applications, using the content of input and output to detect and eliminate risks and power safe, secure, compliant use of generative models and agentic workflows across the enterprise,” Schlager added.\n\n\n\nRelated: Blockaid Raises $50 Million to Secure Blockchain ApplicationsAdvertisement. Scroll to continue reading.\n\n\nRelated: Singulr Launches With $10M in Funding for AI Security and Governance Platform\nRelated: Ex-NSO Group CEO’s Security Firm Dream Raises $100M at $1.1B Valuation\nRelated: Astra, Invary Raise Millions for AI-Powered Pentesting, Runtime Security\n\nRelated: Blockaid Raises $50 Million to Secure Blockchain ApplicationsAdvertisement. Scroll to continue reading.\n\n\nRelated: Singulr Launches With $10M in Funding for AI Security and Governance Platform\nRelated: Ex-NSO Group CEO’s Security Firm Dream Raises $100M at $1.1B Valuation\nRelated: Astra, Invary Raise Millions for AI-Powered Pentesting, Runtime Security\n\nRelated: Singulr Launches With $10M in Funding for AI Security and Governance Platform\nRelated: Ex-NSO Group CEO’s Security Firm Dream Raises $100M at $1.1B Valuation\nRelated: Astra, Invary Raise Millions for AI-Powered Pentesting, Runtime Security\n\nRelated: Ex-NSO Group CEO’s Security Firm Dream Raises $100M at $1.1B Valuation\nRelated: Astra, Invary Raise Millions for AI-Powered Pentesting, Runtime Security\n\nRelated: Astra, Invary Raise Millions for AI-Powered Pentesting, Runtime Security\n\nEduard Kovacs (@EduardKovacs) is a managing editor at SecurityWeek. He worked as a high school IT teacher for two years before starting a career in journalism as Softpedia’s security news reporter. Eduard holds a bachelor’s degree in industrial informatics and a master’s degree in computer techniques applied in electrical engineering.\nSubscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.\nJoin this in-depth briefing on how to protect executives and the enterprises they lead from the growing convergence of digital, narrative, and physical attacks.\nLearn how integrating BAS and Automated Penetration Testing empowers security teams to quickly identify and validate threats, enabling prompt response and remediation.\nSasha Pailet Koff has been named Managing Director of the Cyber Readiness Institute.\nKen Naumann has been appointed CEO of security data analytics company Devo Technology.\nMobile EDR firm iVerify has appointed Mike Rosen as Chief Information Security Officer.\n\n\nUnauthorized AI usage is a ticking time bomb. A tool that wasn’t considered a risk yesterday may introduce new AI-powered features overnight.\n(Alastair Paterson)\n\n\n\nThe current state of regulation and the overwhelming burden it brings to most enterprises is a discussion worth having\n(Joshua Goldfarb)\n\n\n\nLet’s examine, through the lens of some historic breaches, the five most common mistakes that still serve as a catalyst to compromise.\n(Trevin Edgeworth)\n\n\n\nAI systems can sometimes struggle with complex or nuanced situations, so human intervention can help identify and address potential issues that algorithms might not.\n(Marc Solomon)\n\n\n\nOrganizations adopting the transformative nature of agentic AI are urged to take heed of prompt engineering tactics being practiced by threat actors.\n(Etay Maor)\n\nFlipboard\nReddit\nWhatsapp\nWhatsapp\nEmail\nGot a confidential news tip? We want to hear from you.\nReach a large audience of enterprise cybersecurity professionals \nSubscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.\nCopyright © 2025 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\r\n\t\t\t\t\tSubscribe to the SecurityWeek Email Briefing to stay informed on the latest cybersecurity\r\n\t\t\t\t\tnews, threats, and expert insights. Unsubscribe at any time.\r\n\t\t\t\t\t\n\n\n"
    },
    {
        "Title": "Exploited VMware ESXi Flaws Put Many at Risk of Ransomware, Other Attacks",
        "Link": "https://www.securityweek.com/exploited-vmware-esxi-flaws-put-many-at-risk-of-ransomware-other-attacks/",
        "Summary": "<p>Scans show that tens of thousands of VMware ESXi instances are affected by CVE-2025-22224 and other vulnerabilities disclosed recently as zero-days.</p>\n<p>The post <a href=\"https://www.securityweek.com/exploited-vmware-esxi-flaws-put-many-at-risk-of-ransomware-other-attacks/\">Exploited VMware ESXi Flaws Put Many at Risk of Ransomware, Other Attacks</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-03-06",
        "Content": "Hi, what are you looking for?\nScans show that tens of thousands of VMware ESXi instances are affected by CVE-2025-22224 and other vulnerabilities disclosed recently as zero-days.\nBy\nFlipboard\nReddit\nWhatsapp\nWhatsapp\nEmail\nScans show that tens of thousands of VMware ESXi instances are affected by the vulnerabilities disclosed recently as zero-days.\nOn March 4, VMware owner Broadcom informed ESXi, Workstation, and Fusion customers about the availability of patches for three zero-days exploited in the wild. Their exploitation can lead to arbitrary code execution, sandbox escapes, and memory leaks. \n\n\n\nThe flaws are tracked as CVE-2025-22224, CVE-2025-22225 and CVE-2025-22226, and they can allow attackers with elevated privileges to perform a VM escape.\n\n\n\n“This is a situation where an attacker who has already compromised a virtual machine’s guest OS and gained privileged access (administrator or root) could move into the hypervisor itself,” Broadcom explained.\n\n\n\nThe company has credited Microsoft Threat Intelligence Center for reporting the vulnerabilities — Microsoft likely also saw the attacks exploiting the zero-days — but neither Broadcom nor Microsoft have shared any information on the attacks. \n\n\n\nThe cybersecurity agency CISA has added the flaws to its Known Exploited Vulnerabilities (KEV) catalog, which now includes nearly 30 VMware product vulnerabilities. \n\n\n\nNetlas has reported seeing more than 7,000 internet-exposed VMware ESXi instances that appear to be impacted by the vulnerabilities. \n\n\n\nThe Shadowserver Foundation has reported seeing more than 41,000 vulnerable ESXi instances, a majority in China, France, the US, Germany, Iran, Brazil and South Korea. Advertisement. Scroll to continue reading.\n\n\n\n\n\nThe scans conducted by Shadowserver target CVE-2025-22224, but these instances are likely affected by the other vulnerabilities as well since they all impact the same software versions. \n\n\n\nTechnical details and a PoC exploit do not appear to be available for CVE-2025-22224, CVE-2025-22225 and CVE-2025-22226 — this would make it easier for more threat actors to exploit the vulnerabilities — giving organizations more time to install the patches before widespread exploitation commences. \n\n\n\nSecurity researcher Kevin Beaumont, who has dubbed the vulnerabilities ESXicape, explained, “Once you have ESX access, you can access everything on the ESX server — which includes things such as VM data, and crucially ESX config and mounted storage. Using ESX config and mounted network storage, you can traverse the VMware environment.”\n\n\n\nBeaumont added, “For example, orgs use vMotion to allow virtual machines to automatically move across ESX hosts, to balance load and allow for maintenance without downtime (it’s how VMware security patching works). Because of this, a threat actor has direct access to storage of VMs both on and not on that host by design — they’re basically loose on the backend.”\n\n\n\nAccording to the researcher, threat actors could use the vulnerabilities to get past security products and gain access to valuable assets such as Active Directory domain controller databases without triggering alerts. This could be useful in ransomware attacks.\n\n\n\n“This is frequently seen in ransomware incidents, where people directly exploit the ESX server or vCenter server over the VMware management network using unpatched vulnerabilities. Once they reach ESX, they reach directly into storage across the whole cluster,” Beaumont said, adding, “However, being able to reach the ESX server hypervisor directly from the Virtual Machine significantly raises the risk. For example, you don’t need to find the ESX server details, or reach a segregated network.”\n\n\n\nBeaumont pointed out that a hacker recently offered to sell an ESXi VM escape exploit for $150,000, but it’s unclear if that was a genuine exploit and whether it’s related to the zero-day attacks disclosed this week. \n\n\n\nRelated: VMware Patches High-Risk Flaws in Oft-Targeted Aria Operations Products\nRelated: VMware Struggles to Fix Flaw Exploited at Chinese Hacking Contest\nRelated: VMware Discloses Exploitation of Hard-to-Fix vCenter Server Flaw\n\nOn March 4, VMware owner Broadcom informed ESXi, Workstation, and Fusion customers about the availability of patches for three zero-days exploited in the wild. Their exploitation can lead to arbitrary code execution, sandbox escapes, and memory leaks. \n\n\n\nThe flaws are tracked as CVE-2025-22224, CVE-2025-22225 and CVE-2025-22226, and they can allow attackers with elevated privileges to perform a VM escape.\n\n\n\n“This is a situation where an attacker who has already compromised a virtual machine’s guest OS and gained privileged access (administrator or root) could move into the hypervisor itself,” Broadcom explained.\n\n\n\nThe company has credited Microsoft Threat Intelligence Center for reporting the vulnerabilities — Microsoft likely also saw the attacks exploiting the zero-days — but neither Broadcom nor Microsoft have shared any information on the attacks. \n\n\n\nThe cybersecurity agency CISA has added the flaws to its Known Exploited Vulnerabilities (KEV) catalog, which now includes nearly 30 VMware product vulnerabilities. \n\n\n\nNetlas has reported seeing more than 7,000 internet-exposed VMware ESXi instances that appear to be impacted by the vulnerabilities. \n\n\n\nThe Shadowserver Foundation has reported seeing more than 41,000 vulnerable ESXi instances, a majority in China, France, the US, Germany, Iran, Brazil and South Korea. Advertisement. Scroll to continue reading.\n\n\n\n\n\nThe scans conducted by Shadowserver target CVE-2025-22224, but these instances are likely affected by the other vulnerabilities as well since they all impact the same software versions. \n\n\n\nTechnical details and a PoC exploit do not appear to be available for CVE-2025-22224, CVE-2025-22225 and CVE-2025-22226 — this would make it easier for more threat actors to exploit the vulnerabilities — giving organizations more time to install the patches before widespread exploitation commences. \n\n\n\nSecurity researcher Kevin Beaumont, who has dubbed the vulnerabilities ESXicape, explained, “Once you have ESX access, you can access everything on the ESX server — which includes things such as VM data, and crucially ESX config and mounted storage. Using ESX config and mounted network storage, you can traverse the VMware environment.”\n\n\n\nBeaumont added, “For example, orgs use vMotion to allow virtual machines to automatically move across ESX hosts, to balance load and allow for maintenance without downtime (it’s how VMware security patching works). Because of this, a threat actor has direct access to storage of VMs both on and not on that host by design — they’re basically loose on the backend.”\n\n\n\nAccording to the researcher, threat actors could use the vulnerabilities to get past security products and gain access to valuable assets such as Active Directory domain controller databases without triggering alerts. This could be useful in ransomware attacks.\n\n\n\n“This is frequently seen in ransomware incidents, where people directly exploit the ESX server or vCenter server over the VMware management network using unpatched vulnerabilities. Once they reach ESX, they reach directly into storage across the whole cluster,” Beaumont said, adding, “However, being able to reach the ESX server hypervisor directly from the Virtual Machine significantly raises the risk. For example, you don’t need to find the ESX server details, or reach a segregated network.”\n\n\n\nBeaumont pointed out that a hacker recently offered to sell an ESXi VM escape exploit for $150,000, but it’s unclear if that was a genuine exploit and whether it’s related to the zero-day attacks disclosed this week. \n\n\n\nRelated: VMware Patches High-Risk Flaws in Oft-Targeted Aria Operations Products\nRelated: VMware Struggles to Fix Flaw Exploited at Chinese Hacking Contest\nRelated: VMware Discloses Exploitation of Hard-to-Fix vCenter Server Flaw\n\nThe flaws are tracked as CVE-2025-22224, CVE-2025-22225 and CVE-2025-22226, and they can allow attackers with elevated privileges to perform a VM escape.\n\n\n\n“This is a situation where an attacker who has already compromised a virtual machine’s guest OS and gained privileged access (administrator or root) could move into the hypervisor itself,” Broadcom explained.\n\n\n\nThe company has credited Microsoft Threat Intelligence Center for reporting the vulnerabilities — Microsoft likely also saw the attacks exploiting the zero-days — but neither Broadcom nor Microsoft have shared any information on the attacks. \n\n\n\nThe cybersecurity agency CISA has added the flaws to its Known Exploited Vulnerabilities (KEV) catalog, which now includes nearly 30 VMware product vulnerabilities. \n\n\n\nNetlas has reported seeing more than 7,000 internet-exposed VMware ESXi instances that appear to be impacted by the vulnerabilities. \n\n\n\nThe Shadowserver Foundation has reported seeing more than 41,000 vulnerable ESXi instances, a majority in China, France, the US, Germany, Iran, Brazil and South Korea. Advertisement. Scroll to continue reading.\n\n\n\n\n\nThe scans conducted by Shadowserver target CVE-2025-22224, but these instances are likely affected by the other vulnerabilities as well since they all impact the same software versions. \n\n\n\nTechnical details and a PoC exploit do not appear to be available for CVE-2025-22224, CVE-2025-22225 and CVE-2025-22226 — this would make it easier for more threat actors to exploit the vulnerabilities — giving organizations more time to install the patches before widespread exploitation commences. \n\n\n\nSecurity researcher Kevin Beaumont, who has dubbed the vulnerabilities ESXicape, explained, “Once you have ESX access, you can access everything on the ESX server — which includes things such as VM data, and crucially ESX config and mounted storage. Using ESX config and mounted network storage, you can traverse the VMware environment.”\n\n\n\nBeaumont added, “For example, orgs use vMotion to allow virtual machines to automatically move across ESX hosts, to balance load and allow for maintenance without downtime (it’s how VMware security patching works). Because of this, a threat actor has direct access to storage of VMs both on and not on that host by design — they’re basically loose on the backend.”\n\n\n\nAccording to the researcher, threat actors could use the vulnerabilities to get past security products and gain access to valuable assets such as Active Directory domain controller databases without triggering alerts. This could be useful in ransomware attacks.\n\n\n\n“This is frequently seen in ransomware incidents, where people directly exploit the ESX server or vCenter server over the VMware management network using unpatched vulnerabilities. Once they reach ESX, they reach directly into storage across the whole cluster,” Beaumont said, adding, “However, being able to reach the ESX server hypervisor directly from the Virtual Machine significantly raises the risk. For example, you don’t need to find the ESX server details, or reach a segregated network.”\n\n\n\nBeaumont pointed out that a hacker recently offered to sell an ESXi VM escape exploit for $150,000, but it’s unclear if that was a genuine exploit and whether it’s related to the zero-day attacks disclosed this week. \n\n\n\nRelated: VMware Patches High-Risk Flaws in Oft-Targeted Aria Operations Products\nRelated: VMware Struggles to Fix Flaw Exploited at Chinese Hacking Contest\nRelated: VMware Discloses Exploitation of Hard-to-Fix vCenter Server Flaw\n\n“This is a situation where an attacker who has already compromised a virtual machine’s guest OS and gained privileged access (administrator or root) could move into the hypervisor itself,” Broadcom explained.\n\n\n\nThe company has credited Microsoft Threat Intelligence Center for reporting the vulnerabilities — Microsoft likely also saw the attacks exploiting the zero-days — but neither Broadcom nor Microsoft have shared any information on the attacks. \n\n\n\nThe cybersecurity agency CISA has added the flaws to its Known Exploited Vulnerabilities (KEV) catalog, which now includes nearly 30 VMware product vulnerabilities. \n\n\n\nNetlas has reported seeing more than 7,000 internet-exposed VMware ESXi instances that appear to be impacted by the vulnerabilities. \n\n\n\nThe Shadowserver Foundation has reported seeing more than 41,000 vulnerable ESXi instances, a majority in China, France, the US, Germany, Iran, Brazil and South Korea. Advertisement. Scroll to continue reading.\n\n\n\n\n\nThe scans conducted by Shadowserver target CVE-2025-22224, but these instances are likely affected by the other vulnerabilities as well since they all impact the same software versions. \n\n\n\nTechnical details and a PoC exploit do not appear to be available for CVE-2025-22224, CVE-2025-22225 and CVE-2025-22226 — this would make it easier for more threat actors to exploit the vulnerabilities — giving organizations more time to install the patches before widespread exploitation commences. \n\n\n\nSecurity researcher Kevin Beaumont, who has dubbed the vulnerabilities ESXicape, explained, “Once you have ESX access, you can access everything on the ESX server — which includes things such as VM data, and crucially ESX config and mounted storage. Using ESX config and mounted network storage, you can traverse the VMware environment.”\n\n\n\nBeaumont added, “For example, orgs use vMotion to allow virtual machines to automatically move across ESX hosts, to balance load and allow for maintenance without downtime (it’s how VMware security patching works). Because of this, a threat actor has direct access to storage of VMs both on and not on that host by design — they’re basically loose on the backend.”\n\n\n\nAccording to the researcher, threat actors could use the vulnerabilities to get past security products and gain access to valuable assets such as Active Directory domain controller databases without triggering alerts. This could be useful in ransomware attacks.\n\n\n\n“This is frequently seen in ransomware incidents, where people directly exploit the ESX server or vCenter server over the VMware management network using unpatched vulnerabilities. Once they reach ESX, they reach directly into storage across the whole cluster,” Beaumont said, adding, “However, being able to reach the ESX server hypervisor directly from the Virtual Machine significantly raises the risk. For example, you don’t need to find the ESX server details, or reach a segregated network.”\n\n\n\nBeaumont pointed out that a hacker recently offered to sell an ESXi VM escape exploit for $150,000, but it’s unclear if that was a genuine exploit and whether it’s related to the zero-day attacks disclosed this week. \n\n\n\nRelated: VMware Patches High-Risk Flaws in Oft-Targeted Aria Operations Products\nRelated: VMware Struggles to Fix Flaw Exploited at Chinese Hacking Contest\nRelated: VMware Discloses Exploitation of Hard-to-Fix vCenter Server Flaw\n\nThe company has credited Microsoft Threat Intelligence Center for reporting the vulnerabilities — Microsoft likely also saw the attacks exploiting the zero-days — but neither Broadcom nor Microsoft have shared any information on the attacks. \n\n\n\nThe cybersecurity agency CISA has added the flaws to its Known Exploited Vulnerabilities (KEV) catalog, which now includes nearly 30 VMware product vulnerabilities. \n\n\n\nNetlas has reported seeing more than 7,000 internet-exposed VMware ESXi instances that appear to be impacted by the vulnerabilities. \n\n\n\nThe Shadowserver Foundation has reported seeing more than 41,000 vulnerable ESXi instances, a majority in China, France, the US, Germany, Iran, Brazil and South Korea. Advertisement. Scroll to continue reading.\n\n\n\n\n\nThe scans conducted by Shadowserver target CVE-2025-22224, but these instances are likely affected by the other vulnerabilities as well since they all impact the same software versions. \n\n\n\nTechnical details and a PoC exploit do not appear to be available for CVE-2025-22224, CVE-2025-22225 and CVE-2025-22226 — this would make it easier for more threat actors to exploit the vulnerabilities — giving organizations more time to install the patches before widespread exploitation commences. \n\n\n\nSecurity researcher Kevin Beaumont, who has dubbed the vulnerabilities ESXicape, explained, “Once you have ESX access, you can access everything on the ESX server — which includes things such as VM data, and crucially ESX config and mounted storage. Using ESX config and mounted network storage, you can traverse the VMware environment.”\n\n\n\nBeaumont added, “For example, orgs use vMotion to allow virtual machines to automatically move across ESX hosts, to balance load and allow for maintenance without downtime (it’s how VMware security patching works). Because of this, a threat actor has direct access to storage of VMs both on and not on that host by design — they’re basically loose on the backend.”\n\n\n\nAccording to the researcher, threat actors could use the vulnerabilities to get past security products and gain access to valuable assets such as Active Directory domain controller databases without triggering alerts. This could be useful in ransomware attacks.\n\n\n\n“This is frequently seen in ransomware incidents, where people directly exploit the ESX server or vCenter server over the VMware management network using unpatched vulnerabilities. Once they reach ESX, they reach directly into storage across the whole cluster,” Beaumont said, adding, “However, being able to reach the ESX server hypervisor directly from the Virtual Machine significantly raises the risk. For example, you don’t need to find the ESX server details, or reach a segregated network.”\n\n\n\nBeaumont pointed out that a hacker recently offered to sell an ESXi VM escape exploit for $150,000, but it’s unclear if that was a genuine exploit and whether it’s related to the zero-day attacks disclosed this week. \n\n\n\nRelated: VMware Patches High-Risk Flaws in Oft-Targeted Aria Operations Products\nRelated: VMware Struggles to Fix Flaw Exploited at Chinese Hacking Contest\nRelated: VMware Discloses Exploitation of Hard-to-Fix vCenter Server Flaw\n\nThe cybersecurity agency CISA has added the flaws to its Known Exploited Vulnerabilities (KEV) catalog, which now includes nearly 30 VMware product vulnerabilities. \n\n\n\nNetlas has reported seeing more than 7,000 internet-exposed VMware ESXi instances that appear to be impacted by the vulnerabilities. \n\n\n\nThe Shadowserver Foundation has reported seeing more than 41,000 vulnerable ESXi instances, a majority in China, France, the US, Germany, Iran, Brazil and South Korea. Advertisement. Scroll to continue reading.\n\n\n\n\n\nThe scans conducted by Shadowserver target CVE-2025-22224, but these instances are likely affected by the other vulnerabilities as well since they all impact the same software versions. \n\n\n\nTechnical details and a PoC exploit do not appear to be available for CVE-2025-22224, CVE-2025-22225 and CVE-2025-22226 — this would make it easier for more threat actors to exploit the vulnerabilities — giving organizations more time to install the patches before widespread exploitation commences. \n\n\n\nSecurity researcher Kevin Beaumont, who has dubbed the vulnerabilities ESXicape, explained, “Once you have ESX access, you can access everything on the ESX server — which includes things such as VM data, and crucially ESX config and mounted storage. Using ESX config and mounted network storage, you can traverse the VMware environment.”\n\n\n\nBeaumont added, “For example, orgs use vMotion to allow virtual machines to automatically move across ESX hosts, to balance load and allow for maintenance without downtime (it’s how VMware security patching works). Because of this, a threat actor has direct access to storage of VMs both on and not on that host by design — they’re basically loose on the backend.”\n\n\n\nAccording to the researcher, threat actors could use the vulnerabilities to get past security products and gain access to valuable assets such as Active Directory domain controller databases without triggering alerts. This could be useful in ransomware attacks.\n\n\n\n“This is frequently seen in ransomware incidents, where people directly exploit the ESX server or vCenter server over the VMware management network using unpatched vulnerabilities. Once they reach ESX, they reach directly into storage across the whole cluster,” Beaumont said, adding, “However, being able to reach the ESX server hypervisor directly from the Virtual Machine significantly raises the risk. For example, you don’t need to find the ESX server details, or reach a segregated network.”\n\n\n\nBeaumont pointed out that a hacker recently offered to sell an ESXi VM escape exploit for $150,000, but it’s unclear if that was a genuine exploit and whether it’s related to the zero-day attacks disclosed this week. \n\n\n\nRelated: VMware Patches High-Risk Flaws in Oft-Targeted Aria Operations Products\nRelated: VMware Struggles to Fix Flaw Exploited at Chinese Hacking Contest\nRelated: VMware Discloses Exploitation of Hard-to-Fix vCenter Server Flaw\n\nNetlas has reported seeing more than 7,000 internet-exposed VMware ESXi instances that appear to be impacted by the vulnerabilities. \n\n\n\nThe Shadowserver Foundation has reported seeing more than 41,000 vulnerable ESXi instances, a majority in China, France, the US, Germany, Iran, Brazil and South Korea. Advertisement. Scroll to continue reading.\n\n\n\n\n\nThe scans conducted by Shadowserver target CVE-2025-22224, but these instances are likely affected by the other vulnerabilities as well since they all impact the same software versions. \n\n\n\nTechnical details and a PoC exploit do not appear to be available for CVE-2025-22224, CVE-2025-22225 and CVE-2025-22226 — this would make it easier for more threat actors to exploit the vulnerabilities — giving organizations more time to install the patches before widespread exploitation commences. \n\n\n\nSecurity researcher Kevin Beaumont, who has dubbed the vulnerabilities ESXicape, explained, “Once you have ESX access, you can access everything on the ESX server — which includes things such as VM data, and crucially ESX config and mounted storage. Using ESX config and mounted network storage, you can traverse the VMware environment.”\n\n\n\nBeaumont added, “For example, orgs use vMotion to allow virtual machines to automatically move across ESX hosts, to balance load and allow for maintenance without downtime (it’s how VMware security patching works). Because of this, a threat actor has direct access to storage of VMs both on and not on that host by design — they’re basically loose on the backend.”\n\n\n\nAccording to the researcher, threat actors could use the vulnerabilities to get past security products and gain access to valuable assets such as Active Directory domain controller databases without triggering alerts. This could be useful in ransomware attacks.\n\n\n\n“This is frequently seen in ransomware incidents, where people directly exploit the ESX server or vCenter server over the VMware management network using unpatched vulnerabilities. Once they reach ESX, they reach directly into storage across the whole cluster,” Beaumont said, adding, “However, being able to reach the ESX server hypervisor directly from the Virtual Machine significantly raises the risk. For example, you don’t need to find the ESX server details, or reach a segregated network.”\n\n\n\nBeaumont pointed out that a hacker recently offered to sell an ESXi VM escape exploit for $150,000, but it’s unclear if that was a genuine exploit and whether it’s related to the zero-day attacks disclosed this week. \n\n\n\nRelated: VMware Patches High-Risk Flaws in Oft-Targeted Aria Operations Products\nRelated: VMware Struggles to Fix Flaw Exploited at Chinese Hacking Contest\nRelated: VMware Discloses Exploitation of Hard-to-Fix vCenter Server Flaw\n\nThe Shadowserver Foundation has reported seeing more than 41,000 vulnerable ESXi instances, a majority in China, France, the US, Germany, Iran, Brazil and South Korea. Advertisement. Scroll to continue reading.\n\n\n\n\n\nThe scans conducted by Shadowserver target CVE-2025-22224, but these instances are likely affected by the other vulnerabilities as well since they all impact the same software versions. \n\n\n\nTechnical details and a PoC exploit do not appear to be available for CVE-2025-22224, CVE-2025-22225 and CVE-2025-22226 — this would make it easier for more threat actors to exploit the vulnerabilities — giving organizations more time to install the patches before widespread exploitation commences. \n\n\n\nSecurity researcher Kevin Beaumont, who has dubbed the vulnerabilities ESXicape, explained, “Once you have ESX access, you can access everything on the ESX server — which includes things such as VM data, and crucially ESX config and mounted storage. Using ESX config and mounted network storage, you can traverse the VMware environment.”\n\n\n\nBeaumont added, “For example, orgs use vMotion to allow virtual machines to automatically move across ESX hosts, to balance load and allow for maintenance without downtime (it’s how VMware security patching works). Because of this, a threat actor has direct access to storage of VMs both on and not on that host by design — they’re basically loose on the backend.”\n\n\n\nAccording to the researcher, threat actors could use the vulnerabilities to get past security products and gain access to valuable assets such as Active Directory domain controller databases without triggering alerts. This could be useful in ransomware attacks.\n\n\n\n“This is frequently seen in ransomware incidents, where people directly exploit the ESX server or vCenter server over the VMware management network using unpatched vulnerabilities. Once they reach ESX, they reach directly into storage across the whole cluster,” Beaumont said, adding, “However, being able to reach the ESX server hypervisor directly from the Virtual Machine significantly raises the risk. For example, you don’t need to find the ESX server details, or reach a segregated network.”\n\n\n\nBeaumont pointed out that a hacker recently offered to sell an ESXi VM escape exploit for $150,000, but it’s unclear if that was a genuine exploit and whether it’s related to the zero-day attacks disclosed this week. \n\n\n\nRelated: VMware Patches High-Risk Flaws in Oft-Targeted Aria Operations Products\nRelated: VMware Struggles to Fix Flaw Exploited at Chinese Hacking Contest\nRelated: VMware Discloses Exploitation of Hard-to-Fix vCenter Server Flaw\n\n\nThe scans conducted by Shadowserver target CVE-2025-22224, but these instances are likely affected by the other vulnerabilities as well since they all impact the same software versions. \n\n\n\nTechnical details and a PoC exploit do not appear to be available for CVE-2025-22224, CVE-2025-22225 and CVE-2025-22226 — this would make it easier for more threat actors to exploit the vulnerabilities — giving organizations more time to install the patches before widespread exploitation commences. \n\n\n\nSecurity researcher Kevin Beaumont, who has dubbed the vulnerabilities ESXicape, explained, “Once you have ESX access, you can access everything on the ESX server — which includes things such as VM data, and crucially ESX config and mounted storage. Using ESX config and mounted network storage, you can traverse the VMware environment.”\n\n\n\nBeaumont added, “For example, orgs use vMotion to allow virtual machines to automatically move across ESX hosts, to balance load and allow for maintenance without downtime (it’s how VMware security patching works). Because of this, a threat actor has direct access to storage of VMs both on and not on that host by design — they’re basically loose on the backend.”\n\n\n\nAccording to the researcher, threat actors could use the vulnerabilities to get past security products and gain access to valuable assets such as Active Directory domain controller databases without triggering alerts. This could be useful in ransomware attacks.\n\n\n\n“This is frequently seen in ransomware incidents, where people directly exploit the ESX server or vCenter server over the VMware management network using unpatched vulnerabilities. Once they reach ESX, they reach directly into storage across the whole cluster,” Beaumont said, adding, “However, being able to reach the ESX server hypervisor directly from the Virtual Machine significantly raises the risk. For example, you don’t need to find the ESX server details, or reach a segregated network.”\n\n\n\nBeaumont pointed out that a hacker recently offered to sell an ESXi VM escape exploit for $150,000, but it’s unclear if that was a genuine exploit and whether it’s related to the zero-day attacks disclosed this week. \n\n\n\nRelated: VMware Patches High-Risk Flaws in Oft-Targeted Aria Operations Products\nRelated: VMware Struggles to Fix Flaw Exploited at Chinese Hacking Contest\nRelated: VMware Discloses Exploitation of Hard-to-Fix vCenter Server Flaw\n\nThe scans conducted by Shadowserver target CVE-2025-22224, but these instances are likely affected by the other vulnerabilities as well since they all impact the same software versions. \n\n\n\nTechnical details and a PoC exploit do not appear to be available for CVE-2025-22224, CVE-2025-22225 and CVE-2025-22226 — this would make it easier for more threat actors to exploit the vulnerabilities — giving organizations more time to install the patches before widespread exploitation commences. \n\n\n\nSecurity researcher Kevin Beaumont, who has dubbed the vulnerabilities ESXicape, explained, “Once you have ESX access, you can access everything on the ESX server — which includes things such as VM data, and crucially ESX config and mounted storage. Using ESX config and mounted network storage, you can traverse the VMware environment.”\n\n\n\nBeaumont added, “For example, orgs use vMotion to allow virtual machines to automatically move across ESX hosts, to balance load and allow for maintenance without downtime (it’s how VMware security patching works). Because of this, a threat actor has direct access to storage of VMs both on and not on that host by design — they’re basically loose on the backend.”\n\n\n\nAccording to the researcher, threat actors could use the vulnerabilities to get past security products and gain access to valuable assets such as Active Directory domain controller databases without triggering alerts. This could be useful in ransomware attacks.\n\n\n\n“This is frequently seen in ransomware incidents, where people directly exploit the ESX server or vCenter server over the VMware management network using unpatched vulnerabilities. Once they reach ESX, they reach directly into storage across the whole cluster,” Beaumont said, adding, “However, being able to reach the ESX server hypervisor directly from the Virtual Machine significantly raises the risk. For example, you don’t need to find the ESX server details, or reach a segregated network.”\n\n\n\nBeaumont pointed out that a hacker recently offered to sell an ESXi VM escape exploit for $150,000, but it’s unclear if that was a genuine exploit and whether it’s related to the zero-day attacks disclosed this week. \n\n\n\nRelated: VMware Patches High-Risk Flaws in Oft-Targeted Aria Operations Products\nRelated: VMware Struggles to Fix Flaw Exploited at Chinese Hacking Contest\nRelated: VMware Discloses Exploitation of Hard-to-Fix vCenter Server Flaw\n\nTechnical details and a PoC exploit do not appear to be available for CVE-2025-22224, CVE-2025-22225 and CVE-2025-22226 — this would make it easier for more threat actors to exploit the vulnerabilities — giving organizations more time to install the patches before widespread exploitation commences. \n\n\n\nSecurity researcher Kevin Beaumont, who has dubbed the vulnerabilities ESXicape, explained, “Once you have ESX access, you can access everything on the ESX server — which includes things such as VM data, and crucially ESX config and mounted storage. Using ESX config and mounted network storage, you can traverse the VMware environment.”\n\n\n\nBeaumont added, “For example, orgs use vMotion to allow virtual machines to automatically move across ESX hosts, to balance load and allow for maintenance without downtime (it’s how VMware security patching works). Because of this, a threat actor has direct access to storage of VMs both on and not on that host by design — they’re basically loose on the backend.”\n\n\n\nAccording to the researcher, threat actors could use the vulnerabilities to get past security products and gain access to valuable assets such as Active Directory domain controller databases without triggering alerts. This could be useful in ransomware attacks.\n\n\n\n“This is frequently seen in ransomware incidents, where people directly exploit the ESX server or vCenter server over the VMware management network using unpatched vulnerabilities. Once they reach ESX, they reach directly into storage across the whole cluster,” Beaumont said, adding, “However, being able to reach the ESX server hypervisor directly from the Virtual Machine significantly raises the risk. For example, you don’t need to find the ESX server details, or reach a segregated network.”\n\n\n\nBeaumont pointed out that a hacker recently offered to sell an ESXi VM escape exploit for $150,000, but it’s unclear if that was a genuine exploit and whether it’s related to the zero-day attacks disclosed this week. \n\n\n\nRelated: VMware Patches High-Risk Flaws in Oft-Targeted Aria Operations Products\nRelated: VMware Struggles to Fix Flaw Exploited at Chinese Hacking Contest\nRelated: VMware Discloses Exploitation of Hard-to-Fix vCenter Server Flaw\n\nSecurity researcher Kevin Beaumont, who has dubbed the vulnerabilities ESXicape, explained, “Once you have ESX access, you can access everything on the ESX server — which includes things such as VM data, and crucially ESX config and mounted storage. Using ESX config and mounted network storage, you can traverse the VMware environment.”\n\n\n\nBeaumont added, “For example, orgs use vMotion to allow virtual machines to automatically move across ESX hosts, to balance load and allow for maintenance without downtime (it’s how VMware security patching works). Because of this, a threat actor has direct access to storage of VMs both on and not on that host by design — they’re basically loose on the backend.”\n\n\n\nAccording to the researcher, threat actors could use the vulnerabilities to get past security products and gain access to valuable assets such as Active Directory domain controller databases without triggering alerts. This could be useful in ransomware attacks.\n\n\n\n“This is frequently seen in ransomware incidents, where people directly exploit the ESX server or vCenter server over the VMware management network using unpatched vulnerabilities. Once they reach ESX, they reach directly into storage across the whole cluster,” Beaumont said, adding, “However, being able to reach the ESX server hypervisor directly from the Virtual Machine significantly raises the risk. For example, you don’t need to find the ESX server details, or reach a segregated network.”\n\n\n\nBeaumont pointed out that a hacker recently offered to sell an ESXi VM escape exploit for $150,000, but it’s unclear if that was a genuine exploit and whether it’s related to the zero-day attacks disclosed this week. \n\n\n\nRelated: VMware Patches High-Risk Flaws in Oft-Targeted Aria Operations Products\nRelated: VMware Struggles to Fix Flaw Exploited at Chinese Hacking Contest\nRelated: VMware Discloses Exploitation of Hard-to-Fix vCenter Server Flaw\n\nBeaumont added, “For example, orgs use vMotion to allow virtual machines to automatically move across ESX hosts, to balance load and allow for maintenance without downtime (it’s how VMware security patching works). Because of this, a threat actor has direct access to storage of VMs both on and not on that host by design — they’re basically loose on the backend.”\n\n\n\nAccording to the researcher, threat actors could use the vulnerabilities to get past security products and gain access to valuable assets such as Active Directory domain controller databases without triggering alerts. This could be useful in ransomware attacks.\n\n\n\n“This is frequently seen in ransomware incidents, where people directly exploit the ESX server or vCenter server over the VMware management network using unpatched vulnerabilities. Once they reach ESX, they reach directly into storage across the whole cluster,” Beaumont said, adding, “However, being able to reach the ESX server hypervisor directly from the Virtual Machine significantly raises the risk. For example, you don’t need to find the ESX server details, or reach a segregated network.”\n\n\n\nBeaumont pointed out that a hacker recently offered to sell an ESXi VM escape exploit for $150,000, but it’s unclear if that was a genuine exploit and whether it’s related to the zero-day attacks disclosed this week. \n\n\n\nRelated: VMware Patches High-Risk Flaws in Oft-Targeted Aria Operations Products\nRelated: VMware Struggles to Fix Flaw Exploited at Chinese Hacking Contest\nRelated: VMware Discloses Exploitation of Hard-to-Fix vCenter Server Flaw\n\nAccording to the researcher, threat actors could use the vulnerabilities to get past security products and gain access to valuable assets such as Active Directory domain controller databases without triggering alerts. This could be useful in ransomware attacks.\n\n\n\n“This is frequently seen in ransomware incidents, where people directly exploit the ESX server or vCenter server over the VMware management network using unpatched vulnerabilities. Once they reach ESX, they reach directly into storage across the whole cluster,” Beaumont said, adding, “However, being able to reach the ESX server hypervisor directly from the Virtual Machine significantly raises the risk. For example, you don’t need to find the ESX server details, or reach a segregated network.”\n\n\n\nBeaumont pointed out that a hacker recently offered to sell an ESXi VM escape exploit for $150,000, but it’s unclear if that was a genuine exploit and whether it’s related to the zero-day attacks disclosed this week. \n\n\n\nRelated: VMware Patches High-Risk Flaws in Oft-Targeted Aria Operations Products\nRelated: VMware Struggles to Fix Flaw Exploited at Chinese Hacking Contest\nRelated: VMware Discloses Exploitation of Hard-to-Fix vCenter Server Flaw\n\n“This is frequently seen in ransomware incidents, where people directly exploit the ESX server or vCenter server over the VMware management network using unpatched vulnerabilities. Once they reach ESX, they reach directly into storage across the whole cluster,” Beaumont said, adding, “However, being able to reach the ESX server hypervisor directly from the Virtual Machine significantly raises the risk. For example, you don’t need to find the ESX server details, or reach a segregated network.”\n\n\n\nBeaumont pointed out that a hacker recently offered to sell an ESXi VM escape exploit for $150,000, but it’s unclear if that was a genuine exploit and whether it’s related to the zero-day attacks disclosed this week. \n\n\n\nRelated: VMware Patches High-Risk Flaws in Oft-Targeted Aria Operations Products\nRelated: VMware Struggles to Fix Flaw Exploited at Chinese Hacking Contest\nRelated: VMware Discloses Exploitation of Hard-to-Fix vCenter Server Flaw\n\nBeaumont pointed out that a hacker recently offered to sell an ESXi VM escape exploit for $150,000, but it’s unclear if that was a genuine exploit and whether it’s related to the zero-day attacks disclosed this week. \n\n\n\nRelated: VMware Patches High-Risk Flaws in Oft-Targeted Aria Operations Products\nRelated: VMware Struggles to Fix Flaw Exploited at Chinese Hacking Contest\nRelated: VMware Discloses Exploitation of Hard-to-Fix vCenter Server Flaw\n\nRelated: VMware Patches High-Risk Flaws in Oft-Targeted Aria Operations Products\nRelated: VMware Struggles to Fix Flaw Exploited at Chinese Hacking Contest\nRelated: VMware Discloses Exploitation of Hard-to-Fix vCenter Server Flaw\n\nRelated: VMware Struggles to Fix Flaw Exploited at Chinese Hacking Contest\nRelated: VMware Discloses Exploitation of Hard-to-Fix vCenter Server Flaw\n\nRelated: VMware Discloses Exploitation of Hard-to-Fix vCenter Server Flaw\n\nEduard Kovacs (@EduardKovacs) is a managing editor at SecurityWeek. He worked as a high school IT teacher for two years before starting a career in journalism as Softpedia’s security news reporter. Eduard holds a bachelor’s degree in industrial informatics and a master’s degree in computer techniques applied in electrical engineering.\nSubscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.\nJoin this in-depth briefing on how to protect executives and the enterprises they lead from the growing convergence of digital, narrative, and physical attacks.\nLearn how integrating BAS and Automated Penetration Testing empowers security teams to quickly identify and validate threats, enabling prompt response and remediation.\nSasha Pailet Koff has been named Managing Director of the Cyber Readiness Institute.\nKen Naumann has been appointed CEO of security data analytics company Devo Technology.\nMobile EDR firm iVerify has appointed Mike Rosen as Chief Information Security Officer.\n\n\nUnauthorized AI usage is a ticking time bomb. A tool that wasn’t considered a risk yesterday may introduce new AI-powered features overnight.\n(Alastair Paterson)\n\n\n\nThe current state of regulation and the overwhelming burden it brings to most enterprises is a discussion worth having\n(Joshua Goldfarb)\n\n\n\nLet’s examine, through the lens of some historic breaches, the five most common mistakes that still serve as a catalyst to compromise.\n(Trevin Edgeworth)\n\n\n\nAI systems can sometimes struggle with complex or nuanced situations, so human intervention can help identify and address potential issues that algorithms might not.\n(Marc Solomon)\n\n\n\nOrganizations adopting the transformative nature of agentic AI are urged to take heed of prompt engineering tactics being practiced by threat actors.\n(Etay Maor)\n\nFlipboard\nReddit\nWhatsapp\nWhatsapp\nEmail\nGot a confidential news tip? We want to hear from you.\nReach a large audience of enterprise cybersecurity professionals \nSubscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.\nCopyright © 2025 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\r\n\t\t\t\t\tSubscribe to the SecurityWeek Email Briefing to stay informed on the latest cybersecurity\r\n\t\t\t\t\tnews, threats, and expert insights. Unsubscribe at any time.\r\n\t\t\t\t\t\n\n\n"
    },
    {
        "Title": "Alleged TP-Link Exploit for Sale on Dark Web",
        "Link": "https://dailydarkweb.net/alleged-tp-link-exploit-for-sale-on-dark-web/",
        "Summary": "<p>A threat actor has allegedly advertised a remote code execution (RCE) exploit targeting TP-Link routers, claiming that the tool can infiltrate devices, persist undetected, and spread autonomously across networks. The post describes a highly sophisticated exploit designed to compromise routers running LuCI-based firmware. According to the alleged claims, the exploit enables attackers to gain full [&#8230;]</p>\n<p>The post <a href=\"https://dailydarkweb.net/alleged-tp-link-exploit-for-sale-on-dark-web/\">Alleged TP-Link Exploit for Sale on Dark Web</a> appeared first on <a href=\"https://dailydarkweb.net\">Daily Dark Web</a>.</p>",
        "Date": "2025-03-06",
        "Content": "A threat actor has allegedly advertised a remote code execution (RCE) exploit targeting TP-Link routers, claiming that the tool can infiltrate devices, persist undetected, and spread autonomously across networks. The post describes a highly sophisticated exploit designed to compromise routers running LuCI-based firmware.\nAccording to the alleged claims, the exploit enables attackers to gain full control over targeted TP-Link routers by injecting commands via a supposed vulnerability. The tool is said to exfiltrate sensitive data, disable security defenses, and propagate to other routers using default credentials. The seller asserts that the payload includes an AES-256 encrypted backdoor, allowing long-term access to compromised devices.\nThe post further suggests that the exploit is available for purchase, with pricing starting at $1,000 for the base script and $2,000 for a “full package” that includes support and testing. The actor behind the alleged sale emphasizes that this is a high-end hacking tool, comparing its capabilities to mass RCE kits that can fetch up to $5,000 on underground markets.\nTags:\nauto-spreading\nbackdoor\nJumboJet\npayload\nRCE\nrouter\nTP-Link"
    },
    {
        "Title": "Threat Actor Claims to Have Internal T-Mobile Contacts",
        "Link": "https://dailydarkweb.net/threat-actor-claims-to-have-internal-t-mobile-contacts/",
        "Summary": "<p>In a recent post on a dark web forum, a threat actor has claimed to have access to insiders within T-Mobile. According to the message, the individual or group is offering to facilitate SIM swaps for a price of $4,500, asserting that their contacts can provide critical authentication information. The post suggests that the alleged [&#8230;]</p>\n<p>The post <a href=\"https://dailydarkweb.net/threat-actor-claims-to-have-internal-t-mobile-contacts/\">Threat Actor Claims to Have Internal T-Mobile Contacts</a> appeared first on <a href=\"https://dailydarkweb.net\">Daily Dark Web</a>.</p>",
        "Date": "2025-03-06",
        "Content": "In a recent post on a dark web forum, a threat actor has claimed to have access to insiders within T-Mobile. According to the message, the individual or group is offering to facilitate SIM swaps for a price of $4,500, asserting that their contacts can provide critical authentication information.\nThe post suggests that the alleged insiders can help bypass two-factor authentication (2FA) protections. The threat actor also specifies that they do not require extensive details about the target, only a name, address, and phone number. They claim to accept transactions through an escrow service or a known middleman.\nTags:\n2FA\nfreakycheeks\nsim swap\nT-Mobile\nTelecom\nTelecommunication"
    },
    {
        "Title": "NoName057(16)Targets Water Supply System in Spain",
        "Link": "https://dailydarkweb.net/noname05716targets-water-supply-system-in-spain/",
        "Summary": "<p>NoName057(16) has claimed responsibility for unauthorized access to the water supply infrastructure in the Valencian Community of Spain. The threat actor published these claims on their Telegram channel and included a video related to their alleged cyber attack. The Telegram post, written in both Russian and English, contained nationalistic rhetoric and references to Russia. The [&#8230;]</p>\n<p>The post <a href=\"https://dailydarkweb.net/noname05716targets-water-supply-system-in-spain/\">NoName057(16)Targets Water Supply System in Spain</a> appeared first on <a href=\"https://dailydarkweb.net\">Daily Dark Web</a>.</p>",
        "Date": "2025-03-06",
        "Content": "NoName057(16) has claimed responsibility for unauthorized access to the water supply infrastructure in the Valencian Community of Spain. The threat actor published these claims on their Telegram channel and included a video related to their alleged cyber attack.\nThe Telegram post, written in both Russian and English, contained nationalistic rhetoric and references to Russia. The group also included #OpSpain tag, implying that the announcement was part of a broader campaign.\nThe threat actor forwarded the message from another Telegram channel called “Z-Pentest Alliance”, implying a possible cooperation among different threat actor groups.\nTags:\ncritical\ninfrastructure\nNoName057(16)\nSpain\ntelegram\nwater systems\nZ-Pentest Alliance"
    }
]