[
    {
        "Title": "Fake \"Security Alert\" issues on GitHub use OAuth app to hijack accounts",
        "Link": "https://www.bleepingcomputer.com/news/security/fake-security-alert-issues-on-github-use-oauth-app-to-hijack-accounts/",
        "Summary": "A widespread phishing campaign has targeted nearly 12,000 GitHub repositories with fake \"Security Alert\" issues, tricking developers into authorizing a malicious OAuth app that grants attackers full control over their accounts and code. [...]",
        "Date": "2025-03-16",
        "Content": "A widespread phishing campaign has targeted nearly 12,000 GitHub repositories with fake \"Security Alert\" issues, tricking developers into authorizing a malicious OAuth app that grants attackers full control over their accounts and code.\n\"Security Alert: Unusual Access Attempt We have detected a login attempt on your GitHub account that appears to be from a new location or device,\" reads the GitHub phishing issue.\nAll of the GitHub phishing issues contain the same text, warning users that their was unusual activity on their account from Reykjavik, Iceland, and the 53.253.117.8 IP address.\nFake \"Security Alert\" issue posted to GitHub repositories\nSource: BleepingComputer\nCybersecurity researcher Luc4m first spotted the fake security alert, which warned GitHub users that their account was breached and that they should update their password, review and manage active sessions, and enable two-factor authentication to secure their accounts.\nHowever, all of the links for these recommended actions lead to a GitHub authorization page for a \"gitsecurityapp\" OAuth app that requests a lot of very risky permissions (\nscopes\n) and would allow an attacker full access to a user's account and repositories.\nPermissions requested by malicious OAuth app\nSource: BleepingComputer\nThe requested permissions and the access they provide are listed below:\nrepo:\nGrants full access to public and private repositories\nuser:\nAbility to read and write to the user profile\nread:org:\nRead organization membership, organization projects, and team membership\nread: discussion\n,\nwrite:discussion\n: Read and write access to discussions\ngist:\nAccess to GitHub gists\ndelete_repo:\nPermission to delete repositories\nworkflows, workflow, write:workflow, read:workflow, update:workflow:\nControl over GitHub Actions workflows\nIf a GitHub user logs in and authorizes the malicious OAuth app, an access token will generated and sent back to the app's callback address, which in this campaign has been various web pages hosted on onrender.com (Render).\nOAuth authorization link with a callback to an onrender.com page\nSource: BleepingComputer\nThe phishing campaign started this morning at 6:52 AM ET and is ongoing, with almost 12,000 repositories targeted in the attack. However, the number fluctuates, indicating that GitHub is likely responding to the attack.\nFake security alert issues created in GitHub repositories\nSource: BleepingComputer\nIf you were impacted by this phishing attack and mistakenly gave authorization to the malicious OAuth app, you should immediately revoke its access by going into the GitHub Settings and then Applications.\nFrom the Applications screen, revoke access to any GitHub Apps or OAuth apps that are unfamiliar or suspicious. In this campaign, you should look for apps named similarly to 'gitsecurityapp.'\nYou should then look for new or unexpected GitHub Actions (Workflows) and whether private gists were created.\nFinally, rotate your credentials and authorization tokens.\nBleepingComputer contacted GitHub about the phishing campaign and will udpate this story when we get a response.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMalicious Adobe, DocuSign OAuth apps target Microsoft 365 accounts\nGitVenom attacks abuse hundreds of GitHub repos to steal crypto\nCoinbase phishing email tricks users with fake wallet migration\nClickFix attack delivers infostealers, RATs in fake Booking.com emails\nUS cities warn of wave of unpaid parking phishing texts"
    },
    {
        "Title": "Malicious Adobe, DocuSign OAuth apps target Microsoft 365 accounts",
        "Link": "https://www.bleepingcomputer.com/news/security/malicious-adobe-docusign-oauth-apps-target-microsoft-365-accounts/",
        "Summary": "Cybercriminals are promoting malicious Microsoft OAuth apps that masquerade as Adobe and DocuSign apps to deliver malware and steal Microsoft 365 accounts credentials. [...]",
        "Date": "2025-03-16",
        "Content": "Cybercriminals are promoting malicious Microsoft OAuth apps that masquerade as Adobe and DocuSign apps to deliver malware and steal Microsoft 365 accounts credentials.\nThe campaigns were discovered by Proofpoint researchers, who characterized them as \"highly targeted\" in a\nthread on X\n.\nThe malicious OAuth apps in this campaign are impersonating Adobe Drive, Adobe Drive X, Adobe Acrobat, and DocuSign.\nMalicious OAuth apps\nSource: Proofpoint\nThese apps request access to less sensitive permissions such as 'profile', 'email', and 'openid,' to avoid detection and suspicion.\nIf those permissions are granted, the attacker is given access to:\nprofile\n– Full name, User ID, Profile picture, Username\nemail\n– primary email address (no inbox access)\nopenid\n– allows confirmation of user's identity and retrieval of Microsoft account details\nProofpoint told BleepingComputer that the phishing campaigns were sent from charities or small companies using compromised email accounts, likely Office 365 accounts.\nThe emails targeted multiple US and European industries, including government, healthcare, supply chain, and retail. Some of the emails seen by the cybersecurity firm use RFPs and contract lures to trick recipients into opening the links.\nWhile the privileges from accepting the Microsoft OAuth app only provided limited data to the attackers, the information could still be used for more targeted attacks.\nFurthermore, once permission is given to the OAuth app, it redirects users to landing pages that display phishing forms to Microsoft 365 credentials or distributed malware.\n\"The victims went through multiple redirections and stages after authorizing O365 OAuth app, until presented with the malware or the phishing page behind,\" Proofpoint told BleepingComputer.\n\"In some cases, the victims were redirected to an \"O365 login\" page (hosted on malicious domain). In less than a minute after the authorization, Proofpoint detected suspicious login activity to the account.\"\nProofpoint said that they could not determine the malware being distributed, but the attackers utilized\nthe ClickFix social engineering attack\n, which has become very popular over the past year.\nClickFix landing page used in the malicious OAuth campaign\nSource: Proofpoint\nThe attacks are similar to those\nreported years ago\n, indicating that OAuth apps remain an effective way to hijack Microsoft 365 accounts without stealing credentials.\nUsers are advised to be cautious with OAuth app permission requests and always verify their source and legitimacy before approving them.\nTo check existing approvals, go to 'My Apps' (myapplications.microsoft.com) → 'Manage your apps' → and revoke any unrecognized apps on that screen.\nMicrosoft 365 administrators can also limit users' permission to consent to third-party OAuth app requests entirely through 'Enterprise Applications' → 'Consent and Permissions' → set' Users can consent to apps' to 'No.'\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nFake \"Security Alert\" issues on GitHub use OAuth app to hijack accounts\nClickFix attack delivers infostealers, RATs in fake Booking.com emails\nMicrosoft Teams phishing attack alerts coming to everyone next month\nCoinbase phishing email tricks users with fake wallet migration\nWeek-long Exchange Online outage causes email failures, delays"
    },
    {
        "Title": "Intel’s Secure Data Tunnel Moves AI Training Models to Data Sources",
        "Link": "https://www.darkreading.com/cloud-security/intel-s-secure-data-tunnel-moves-ai-training-models-to-data-sources",
        "Summary": "The chip maker's Tiber Secure Federated AI service creates a secure tunnel between AI models on remote servers and data sources on origin systems.",
        "Date": "2025-03-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/intel-s-secure-data-tunnel-moves-ai-training-models-to-data-sources"
    }
]