[
    {
        "Title": "Developer guilty of using kill switch to sabotage employer's systems",
        "Link": "https://www.bleepingcomputer.com/news/security/developer-guilty-of-using-kill-switch-to-sabotage-employers-systems/",
        "Summary": "A software developer has been found guilty of sabotaging his ex-employer's systems by running custom malware and installing a \"kill switch\" after being demoted at the company. [...]",
        "Date": "2025-03-08",
        "Content": "A software developer has been found guilty of sabotaging his ex-employer's systems by running custom malware and installing a \"kill switch\" after being demoted at the company.\nDavis Lu, 55, of Houston, was a software developer for an Ohio company,\nreportedly Eaton Corp\n, from November 2007 to October 2019.\nEaton Corporation is a global power management company that provides electrical, hydraulic, and mechanical solutions for various industries.\nFollowing a corporate restructuring in 2018, Lu lost responsibilities at his job and was found guilty of sabotaging his employer's computer systems and network with custom malware and kill switches.\nThe malicious activities included code that ran in an \"infinite loop,\" exhausting a production server's resources and eventually causing the system to crash and prevent user logins. These infinite loops were designed to exhaust Java threads by repeatedly generating new threads without proper termination.\nAccording to\nLu's indictment\n, Lu also deleted coworker's user profiles and implemented a \"kill switch\" that would lock out all users if his account in the company's Windows active directory was disabled. The \"kill switch\" code, named \"IsDLEnabledinAD,\" was an abbreviation of \"Is Davis Lu enabled in Active Directory.\"\nThis kill switch was automatically triggered when Lu was terminated on September 9, 2019, causing thousands of employees to lose access to systems.\nOn the day he was directed to return his company laptop, Lu reportedly deleted encrypted data.\nThe\nDOJ says\ninternet search queries also revealed that Lu had been researching ways to elevate privileges, hide processes, and quickly delete files.\nThe Department of Justice says that Lu's activities and system disruption cost the company hundreds of thousands of dollars.\nA jury convicted Lu of causing intentional damage to protected computers, a charge that carries a maximum penalty of 10 years in prison. A sentencing date has not been set.\nRelated Articles:\nFive best practices for securing Active Directory service accounts"
    },
    {
        "Title": "Undocumented \"backdoor\" found in Bluetooth chip used by a billion devices",
        "Link": "https://www.bleepingcomputer.com/news/security/undocumented-backdoor-found-in-bluetooth-chip-used-by-a-billion-devices/",
        "Summary": "The ubiquitous ESP32 microchip made by Chinese manufacturer Espressif and used by over 1 billion units as of 2023 contains an undocumented \"backdoor\" that could be leveraged for attacks. [...]",
        "Date": "2025-03-08",
        "Content": "The ubiquitous ESP32 microchip made by Chinese manufacturer Espressif and used by over 1 billion units as of 2023 contains an undocumented \"backdoor\" that could be leveraged for attacks.\nThe undocumented commands allow spoofing of trusted devices, unauthorized data access, pivoting to other devices on the network, and potentially establishing long-term persistence.\nThis was discovered by Spanish researchers Miguel Tarascó Acuña and Antonio Vázquez Blanco of Tarlogic Security, who\npresented\ntheir findings yesterday at\nRootedCON\nin Madrid.\n\"Tarlogic Security has detected a backdoor in the ESP32, a microcontroller that enables WiFi and Bluetooth connection and is present in millions of mass-market IoT devices,\" reads a\nTarlogic announcement\nshared with BleepingComputer.\n\"Exploitation of this backdoor would allow hostile actors to conduct impersonation attacks and permanently infect sensitive devices such as mobile phones, computers, smart locks or medical equipment by bypassing code audit controls.\"\nThe researchers warned that ESP32 is one of the world's most widely used chips for Wi-Fi + Bluetooth connectivity in IoT (Internet of Things) devices, so the risk of any backdoor in them is significant.\nSlide from the RootedCON presentation\nSource: Tarlogic\nDiscovering a backdoor in ESP32\nIn their RootedCON presentation, the Tarlogic researchers explained that interest in Bluetooth security research has waned but not because the protocol or its implementation has become more secure.\nInstead, most attacks presented last year didn't have working tools, didn't work with generic hardware, and used outdated/unmaintained tools largely incompatible with modern systems.\nTarlogic developed a new C-based USB Bluetooth driver that is hardware-independent and cross-platform, allowing direct access to the hardware without relying on OS-specific APIs.\nArmed with this new tool, which enables raw access to Bluetooth traffic, Targolic discovered hidden vendor-specific commands (Opcode 0x3F) in the ESP32 Bluetooth firmware that allow low-level control over Bluetooth functions.\nESP32 memory map\nSource: Tarlogic\nIn total, they found 29 undocumented commands, collectively characterized as a \"backdoor,\" that could be used for memory manipulation (read/write RAM and Flash), MAC address spoofing (device impersonation), and LMP/LLCP packet injection.\nEspressif has not publicly documented these commands, so either they weren't meant to be accessible, or they were left in by mistake.\nScript that issues HCI commands\nSource: Tarlogic\nThe risks arising from these commands include malicious implementations on the OEM level and supply chain attacks.\nDepending on how Bluetooth stacks handle HCI commands on the device, remote exploitation of the backdoor might be possible via malicious firmware or rogue Bluetooth connections.\nThis is especially the case if an attacker already has root access, planted malware, or pushed a malicious update on the device that opens up low-level access.\nIn general, though, physical access to the device's USB or UART interface would be far riskier and a more realistic attack scenario.\n\"In a context where you can compromise an IOT device with as ESP32 you will be able to hide an APT inside the ESP memory and perform Bluetooth (or Wi-Fi) attacks against other devices, while controlling the device over Wi-Fi/Bluetooth,\" explained the researchers to BleepingComputer.\n\"Our findings would allow to fully take control over the ESP32 chips and to gain persistence in the chip via commands that allow for RAM and Flash modification.\"\n\"Also, with persistence in the chip, it may be possible to spread to other devices because the ESP32 allows for the execution of advanced Bluetooth attacks.\"\nBleepingComputer has contacted Espressif for a statement on the researchers' findings, but a comment wasn't immediately available.\nUpdate 3/8/25: Added statement from Tarlogic.\nRelated Articles:\nPrivacy tech firms warn France’s encryption and VPN laws threaten privacy\nNew Auto-Color Linux backdoor targets North American govts, universities\nZyxel won’t patch newly exploited flaws in end-of-life routers\nBackdoor found in two healthcare patient monitors, linked to IP in China\nChinese cyberspies use new SSH backdoor in network device hacks"
    },
    {
        "Title": "YouTubers extorted via copyright strikes to spread malware",
        "Link": "https://www.bleepingcomputer.com/news/security/youtubers-extorted-via-copyright-strikes-to-spread-malware/",
        "Summary": "Cybercriminals are sending bogus copyright claims to YouTubers to coerce them into promoting malware and cryptocurrency miners on their videos. [...]",
        "Date": "2025-03-08",
        "Content": "Cybercriminals are sending bogus copyright claims to YouTubers to coerce them into promoting malware and cryptocurrency miners on their videos.\nThe threat actors take advantage of the popularity of Windows Packet Divert (WPD) tools that are increasingly used in Russia as they help users bypass internet censorship and government-imposed restrictions on websites and online services.\nYouTube creators catering to this audience publish tutorials on how to use various WPD-based tools to bypass censorship and are being targeted by threat actors posing as the copyright holders of these tools.\nIn most cases seen by Kaspersky, the threat actors claim to be the original developers of the presented restriction bypass tool, filing a copyright claim with YouTube and then contacting the creator to offer a resolution in the form of including a download link they provide.\nAt the same time, they threaten that non-compliance will result in two more \"strikes\" on YouTube, which could lead to a channel ban based on the platform's \"three strikes\" policy.\nIn other cases, the attackers contact the creator directly, impersonating the tool's developers and claiming that the original tool has a new version or new download link, asking the creator to change it on their video.\nMessage threat actors send to YouTubers\nSource: Kaspersky\nThe creators, fearing they will lose their channels, give in to the threat actors' demands, and agree to add links in their videos to GitHub repositories that host the said Windows Packet Divert (WPD) tools. However, these are trojanized versions that include a cryptominer downloader instead.\nKaspersky has seen this promotion of laced WPD tools take place on a YouTube video that generated over 400,000 views, with the malicious link reaching 40,000 downloads before it got removed.\nA Telegram channel with 340,000 subscribers has also promoted the malware under the same disguise.\n\"According to our telemetry, the malware campaign has affected more than 2,000 victims in Russia, but the overall figure could be much higher,\"\nwarns Kaspersky\n.\nTelegram channel (left) and YouTube video (right) promoting the cryptominer\nSource: Kaspersky\nSilentCryptoMiner deployment\nThe malicious archive downloaded from the GitHub repositories contains a Python-based malware loader that is launched using PowerShell via a modified start script ('general.bat').\nIf the victim's antivirus disrupts this process, the start script delivers a 'file not found' error message suggesting that the user disables their antivirus and re-download the file.\nThe executable fetches the second-stage loader only for Russian IP addresses and executes it on the device.\nThe second stage payload is another executable whose size was bloated to 690 MB to evade antivirus analysis, while it also features anti-sandbox and virtual machine checks.\nThe malware loader turns off Microsoft Defender protections by adding an exclusion and creates a Windows service named 'DrvSvc' for persistence between reboots.\nEventually, it downloads the final payload, SilentCryptoMiner, a modified version of XMRig capable of mining multiple cryptocurrencies, including ETH, ETC, XMR, and RTM.\nThe coin miner fetches remote configurations from Pastebin every 100 minutes so it can be updated dynamically.\nFor evasion, it is loaded into a system process like 'dwm.exe' using process hollowing and pauses mining activity when the user launches monitoring tools like Process Explorer and the Task Manager.\nAlthough the campaign discovered by Kaspersky primarily targets Russian users, the same tactics may be adopted for broader-scoped operations that also deliver higher-risk malware like info-stealers or ransomware.\nUsers should avoid downloading software from URLs in YouTube videos or descriptions, especially from smaller to medium-sized channels that are more susceptible to scams and blackmail.\nRelated Articles:\nGrassCall malware campaign drains crypto wallets via fake job interviews\nFake CS2 tournament streams used to steal crypto, Steam accounts\nCracked Garry’s Mod, BeamNG.drive games infect gamers with miners\nYouTube warns of AI-generated video of its CEO used in phishing attacks\nFake BianLian ransom notes mailed to US CEOs in postal mail scam"
    },
    {
        "Title": "Feds Link $150M Cyberheist to 2022 LastPass Hacks",
        "Link": "https://krebsonsecurity.com/2025/03/feds-link-150m-cyberheist-to-2022-lastpass-hacks/",
        "Summary": "In September 2023, KrebsOnSecurity published findings from security researchers who concluded that a series of six-figure cyberheists across dozens of victims resulted from thieves cracking master passwords stolen from the password manager service LastPass in 2022. In a court filing this week, U.S. federal agents investigating a spectacular $150 million cryptocurrency heist said they had reached the same conclusion.",
        "Date": "2025-03-08",
        "Content": "In September 2023, KrebsOnSecurity published findings from security researchers who concluded that a series of six-figure cyberheists across dozens of victims resulted from thieves cracking master passwords stolen from the password manager service LastPass in 2022. In a court filing this week, U.S. federal agents investigating a spectacular $150 million cryptocurrency heist said they had reached the same conclusion.\n\nOn March 6, federal prosecutors in northern California said they seized approximately $24 million worth of cryptocurrencies that were clawed back following a $150 million cyberheist on Jan. 30, 2024. The complaint refers to the person robbed only as “Victim-1,” but according to blockchain security researcher ZachXBT the theft was perpetrated against Chris Larsen, the co-founder of the cryptocurrency platform Ripple.\nZachXBT was the first to report on the heist, of which approximately $24 million was frozen by the feds before it could be withdrawn. This week’s action by the government merely allows investigators to officially seize the frozen funds.\nBut there is an important conclusion in this seizure document: It basically says the U.S. Secret Service and the FBI agree with the findings of the LastPass breach story published here in September 2023. That piece quoted security researchers who said they were witnessing six-figure crypto heists several times each month that they believed all appeared to be the result of crooks cracking master passwords for the password vaults stolen from LastPass in 2022.\n“The Federal Bureau of Investigation has been investigating these data breaches, and law enforcement agents investigating the instant case have spoken with FBI agents about their investigation,” reads the seizure complaint, which was written by a U.S. Secret Service agent. “From those conversations, law enforcement agents in this case learned that the stolen data and passwords that were stored in several victims’ online password manager accounts were used to illegally, and without authorization, access the victims’ electronic accounts and steal information, cryptocurrency, and other data.”\nThe document continues:\n“Based on this investigation, law enforcement had probable cause to believe the same attackers behind the above-described commercial online password manager attack used a stolen password held in Victim 1’s online password manager account and, without authorization, accessed his cryptocurrency wallet/account.”\nWorking with dozens of victims, security researchers Nick Bax and Taylor Monahan found that none of the six-figure cyberheist victims appeared to have suffered the sorts of attacks that typically preface a high-dollar crypto theft, such as the compromise of one’s email and/or mobile phone accounts, or SIM-swapping attacks.\nThey discovered the victims all had something else in common: Each had at one point stored their cryptocurrency seed phrase — the secret code that lets anyone gain access to your cryptocurrency holdings — in the “Secure Notes” area of their LastPass account prior to the 2022 breaches at the company.\nBax and Monahan found another common theme with these robberies: They all followed a similar pattern of cashing out, rapidly moving stolen funds to a dizzying number of drop accounts scattered across various cryptocurrency exchanges.\nAccording to the government, a similar level of complexity was present in the $150 million heist against the Ripple co-founder last year.\n“The scale of a theft and rapid dissipation of funds would have required the efforts of multiple malicious actors, and was consistent with the online password manager breaches and attack on other victims whose cryptocurrency was stolen,” the government wrote. “For these reasons, law enforcement agents believe the cryptocurrency stolen from Victim 1 was committed by the same attackers who conducted the attack on the online password manager, and cryptocurrency thefts from other similarly situated victims.”\nReached for comment, LastPass said it has seen no definitive proof — from federal investigators or others — that the cyberheists in question were linked to the LastPass breaches.\n“Since we initially disclosed this incident back in 2022, LastPass has worked in close cooperation with multiple representatives from law enforcement,” LastPass said in a written statement. “To date, our law enforcement partners have not made us aware of any conclusive evidence that connects any crypto thefts to our incident. In the meantime, we have been investing heavily in enhancing our security measures and will continue to do so.”\nOn August 25, 2022, LastPass CEO Karim Toubba told users the company had detected unusual activity in its software development environment, and that the intruders stole some source code and proprietary LastPass technical information. On Sept. 15, 2022, LastPass said an investigation into the August breach determined the attacker did not access any customer data or password vaults.\nBut on Nov. 30, 2022, LastPass notified customers about another, far more serious security incident that the company said leveraged data stolen in the August breach. LastPass disclosed that criminal hackers had compromised encrypted copies of some password vaults, as well as other personal information.\nExperts say the breach would have given thieves “offline” access to encrypted password vaults, theoretically allowing them all the time in the world to try to crack some of the weaker master passwords using powerful systems that can attempt millions of password guesses per second.\nResearchers found that many of the cyberheist victims had chosen master passwords with relatively low complexity, and were among LastPass’s oldest customers. That’s because legacy LastPass users were more likely to have master passwords that were protected with far fewer “iterations,” which refers to the number of times your password is run through the company’s encryption routines. In general, the more iterations, the longer it takes an offline attacker to crack your master password.\nOver the years, LastPass forced new users to pick longer and more complex master passwords, and they increased the number of iterations on multiple occasions by several orders of magnitude. But researchers found strong indications that LastPass never succeeded in upgrading many of its older customers to the newer password requirements and protections.\nAsked about LastPass’s continuing denials, Bax said that after the initial warning in our 2023 story, he naively hoped people would migrate their funds to new cryptocurrency wallets.\n“While some did, the continued thefts underscore how much more needs to be done,” Bax told KrebsOnSecurity. “It’s validating to see the Secret Service and FBI corroborate our findings, but I’d much rather see fewer of these hacks in the first place. ZachXBT and SEAL 911 reported yet another wave of thefts as recently as December, showing the threat is still very real.”\nMonahan said LastPass still hasn’t alerted their customers that their secrets—especially those stored in “Secure Notes”—may be at risk.\n“Its been two and a half years since LastPass was first breached [and] hundreds of millions of dollars has been stolen from individuals and companies around the globe,” Monahan said. “They could have encouraged users to rotate their credentials. They could’ve prevented millions and millions of dollars from being stolen by these threat actors. But  instead they chose to deny that their customers were are risk and blame the victims instead.”\n\r\n         This entry was posted on Friday 7th of March 2025 08:20 PM \r\n         \nThese hacks have cost LassPass nothing, $0. Hundreds of millions of dollars have been stolen from individuals and others, but nothing from LassPass. Think about that before you trust your security to a company that has no skin in your game.\nCan I ask what seems to me like an obvious question?\nSurely LastPass notified their users about the breach. Surely they advised the people whose data was leaked to change the relevant passwords. Did all of these thefts happen because those folks just … didn’t?\nOthers more experienced in dealing with these specific breaches can weigh in here if they want. But my understanding is that some people maybe didn’t think about the fact that if they wanted to be safe, they had to move everything to a new wallet with a new seed phrase. Also, probably for a lot of people that was too much hassle for little perceived risk. After all, the vaults were encrypted with LastPass’s secret sauce, right? Some people likely just forgot they had stored seed phrases there.\nMoving to a new wallet with a new seed phrase is nice, but once they cracked the master pass they could apply it to the vaults they stole too. If it were only the master pass then Lastpass could have forced new master passwords and done verification. \nThe solution is to change the credentials on your accounts.\nYou know … I might not have realized that about the “seed phrase”, because I had never read or heard that expression until just now. \nOTOH, that means LastPass (if I’m understanding you) allowed their customers to keep using the secret key that was stolen, assuming their encryption couldn’t be broken (or just not caring).\nThey did not notify corporate end-users directly. They posted stuff on their website. Amazingly, my own employer used (and still uses) LastPass, and they give every employee an account. My employer did not send out a single thing about it. They completely ignored even LastPass’ recommendations they had posted on their website. No recommendation to rotate passwords, nothing.\nI do not use my work LastPass even for work stuff, and many of my co-workers are the same. I never even log in. Someone higher up in the company told me, “Don’t worry about not using it, it’s just something we have to have for auditors.” I’m stunned even as I type this, but it’s true. I haven’t logged into my work one for years now. Nobody has ever said a word to me about my lack of use. I work at a tech company that has security offerings, too. I’m not kidding.\nThere was sort of a security breach but your info is still totally safe. But you might want to change every single password and move every bit of crypto currency you own to make sure. \nVs\nYour passwords and notes vault have been copied by hackers in an attempt to decrypt your vault and steal ALL of its contents. It is only a matter of time and effort before they are able to access your data. If you do not change every single password and move every bit of crypto you own that had secret keys in your notes you are completely and utterly screwed. Even if you do that, if you stored anything of value in there that you can’t change, you are still screwed. Good luck with that. You shouldn’t have put that stuff in your notes! Sucker.\nIt was little more complicated than that. LastPass’ communication was vague and delayed. When LastPass disclosed the breach in late 2022, they did not initially emphasise that encrypted vaults had been stolen. They framed the risk as minimal if users had strong master passwords, and many users didn’t realise that their entire vault contents were exposed to brute-force attacks.\nCracking password vaults takes a lot of time and resources. Even with strong encryption, attackers can crack weak master passwords over time and if someone had a weak master password, they may not have realised their vault was compromised until it was too late.\nNot everyone could easily change every password. Some victims had hundreds or thousands of credentials stored in LastPass and crypto wallets use private keys that, if stolen, cannot be changed like a regular password.\nSome people DID change passwords and still got hacked. Some reports suggest that even users who migrated away from LastPass and changed passwords still lost funds. This raised concerns that additional metadata (like password history or old backups) may have been leaked.\nYes, some people may have ignored the warning. But LastPass downplayed the severity, and even those who took precautions weren’t necessarily safe. It’s a mix of poor communication, technical limitations, and a slow realisation of just how bad the breach was.\nI’ve been a LastPass user for several years. I started using the free version prior to 2022, then when the company changed their policy regarding use of a free account on multiple device types (e.g a PC and a phone) I upgraded to a paid account. I started using a password manager because I was taking responsibility for my own digital security, not to put that burden on some company. When I learned about the LastPass breach, I went through all the Internet accounts in my vault, and changed my passwords, and increasing the default length from 12 to 16 characters. As I changed passwords on the Internet accounts in my vault, I enabled 2FA on each account, and if the site/service provider did not offer that security feature, I added that service type to my list of service providers to change. In my opinion, if an Internet service provider cares so little about my digital security that they don’t support two factor authentication, I don’t want to use their service. I can always go elsewhere for that service. Today, all the Internet accounts in my LastPass vault have long, strong, unique passwords, supported by two factor authentication. Twice annually, I go through all the accounts in my vault, and decide if I still need the service provided by each of those accounts, and close any accounts I no longer need/use.\nWhile LastPass probably shouldn’t put the blame for being hacked on their customers, at the same time their customers digital security is their own responsibility, not that of LastPass. LastPass is only responsible to try to keep their customers vaults as safe as possible, something they failed to do in 2022, but which they have been working to correct ever since. While I as an individual, cannot make all my assets completely secure/safe from theft, I can make the effort required to complete that theft as difficult as possible, so the thieves will go in search of easier targets. If you ask me, the people who got hacked following the LastPass breach, assuming the information stolen from LastPass was used in the hack, had the opportunity to upgrade their digital security by changing all their passwords, make sure that each password is unique, enable 2FA where it’s appropriate (do bitcoin accounts even support 2FA?), and change the credentials required for any wallets they may have,etc., prior to being hacked, didn’t they? If the people who got hacked failed to change/upgrade their passwords/security credentials following the LastPass breach, then they are ultimately responsible for being hacked, not LastPass.\nNote that while I’m a LastPass customer, I have no other affiliation with them, and I’m not an employee/agent of/for them. The content above contains my personal thoughts/opinions, and nothing I’ve stated here should be construed as fact. You may consider what I’ve said here if you want to, but you should make up your own mind for yourself about what the truth is.\nErnie\nYour comments that make it clear you have no idea what you are talking about are refreshing.\nSounds like he knows what he’s talking about to me.  You, not so much. \nScott, if your are going to debase someone for *your* perceived lack of knowledge, at least have the common decency to provide input into what you think they got wrong, so you don’t come off as an arrogant wannabe.\nLastPass is just a tool. On its own it is not a panacea for all known digital threats, but one of many utilities and standard practises that may be used to reduce ones risk or exposure online. What Eric has described above was standard best practice, advised by LastPass, post breach in 2022. LastPass’s conduct prior to the breach is not the issue here, it is what happened after the breach that is in question. If YOU weren’t proactively maintaining your security posture, like keeping updated and/or ignoring alerts to address priority issues when they arise, that is on YOU not LastPass.\nHowever, if you wish to regale us with your current understanding of the mathematical theorem of cryptography, I am all ears.\nErnie, you play such an innocent role while you completely glaze over the fact that Lastpass denied the hack in the first place, then simply told affected users to change their master password.\nCustomers had experienced identity theft with SSN, passport and bank account details in Lastpass.  Customers have had increased phishing attempts.  Paying clients lost crypto for trusting an ISO27001 and SOC2 Type II certified company passing annual audits (let us not forget they were subsidiary of a listco GoTo).  They are a large global business.  They provide data protections services and that comes with responsibility AND accountability.  Do you not realise that they failed their customers regardless of the losses?  \nThus, it is exactly the crypto losses that create the direct linkage to Lastpass.  Credit card abuse and identity theft are hard to prove but crypto losses make it clear-as-day that data placed with Lastpass was and is not secure; again a breach of their terms of service and contractual obligations.\nYou make up some story about 2FA and rotating passwords, while all that is circumstantial. How do you go about changing someones stolen identity?  How about the personal and passport details then used in fake KYC for financial services and loans?\nYoure naive and likely paid by Lastpass to post such lame-duck response. Lastpass has to-date not communicated to its clients of all the resulting risks and spillover (for all the litigation avoidance reasons).\n16 chars is not enough with today’s computing power, and you’re broadcasting the dictionary size required to crack your passwords.  \nYou should use near as many as a site supports. Take Comcast for example, they support up to 100. So why not 90-some…. You don’t have to remember it.\nAgreed. I was told by Lastpass, to change passwords on all account, to up my iterations, to change my master password. So it’s not like they didn’t try to warn people. They didn’t hide it as some have implied.\nI had moved from LastPass to another password manager about 18 months before the LastPass hack, but I still assumed LastPass had my old vault sitting around in their dev environment (I figured they were lying about everything), so I changed every single password and encryption key I had. It’s mind-blowing that people who had large amounts of crypto thought they were safe. It was all over the media, so they can’t claim ignorance.\nJust seems to me to reinforce my choice to use FOSS Password Safe, with a Yubikey required along with it’s master password, was a better choice. I control where and how the database is stored and how many additional encryption layers it has. (e.g. Inside a veracrypt vault, whether the container file is local or in the cloud, etc)\nLastpass did not encrypt those notes properly. That’s a fact. They did unforgivable business decisions and no user should ever trust them again and in fact they should be sued to oblivion.\nBr, former Lastpass user\nClawback means a disbursement reversed, not recovery of stolen money\nOn my servers, I set the number of iterations for the passwords  a few years ago to the point that it took about two and a half minutes to login. Since most of my connections are with ssh keys, this didn’t bother me much at all.\nHowever, I got to wondering whether or not having it that high might be a sort of self directed denial of service attack.  In the course of two minutes, it’s not uncommon for there to be multiple attempts going on to guess passwords.\nSo I shortened them back down to something on the order of about two or three seconds which seems much more reasonable.\nCialtroni quelli di lastpass… una cosa dovevano fare.. e l’hanno fatta male, anzi malissimo!\nCentralized systems are the attack surface itself. No matter the methods will be, the system will end up being unsecure, as long as the related files, passwords stored as one piece.\nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    }
]