[
    {
        "Title": "US cities warn of wave of unpaid parking phishing texts",
        "Link": "https://www.bleepingcomputer.com/news/security/us-cities-warn-of-wave-of-unpaid-parking-phishing-texts/",
        "Summary": "US cities are warning of an ongoing mobile phishing campaign pretending to be texts from the city's parking violation departments about unpaid parking invoices, that if unpaid, will incur an additional $35 fine per day. [...]",
        "Date": "2025-03-09",
        "Content": "US cities are warning of an ongoing mobile phishing campaign pretending to be texts from the city's parking violation departments about unpaid parking invoices, that if unpaid, will incur an additional $35 fine per day.\nWhile parking scams have been around for years, a massive wave of phishing text messages has caused numerous cities throughout the US to issue warnings, including from\nAnnapolis\n,\nBoston\n,\nGreenwich\n,\nDenver\n,\nDetroit\n,\nHouston\n,\nMilwaukee\n,\nSalt Lake City\n,\nCharlotte\n,\nSan Diego\n,\nSan Francisco\n, and many others.\nThe current wave of texts started last December and has continued since, with BleepingComputer receiving a text targeting New York residents earlier this week.\nThe text message received by BleepingComputer claims to be from the City of New York about an unpaid parking invoice, which would incur a daily $35 fine if not paid. The text then prompts you to visit an enclosed link to pay the fine.\n\"This is a final reminder from the City of New York regarding the unpaid parking invoice. A $35 daily overdue fee will be charged if payment is not made today,\" reads the phishing text.\nThis same phishing template is used in texts about unpaid parking invoices from other cities seen by BleepingComputer.\nPhishing text and landing page\nSource: BleepingComputer\nTo circumvent this, the scammers use an open redirect on Google.com to redirect users to a phishing site named after the city it is impersonating. For example, the phishing site for New York City is nycparkclient[.]com.\nOver the past year,\nApple introduced a security feature\nthat disables links in text messages from unknown senders and suspicious domains.\nAs Google.com is a trusted domain, Apple iMessage does not disable the link, so using the company's open redirect makes it easier to trick unsuspecting users into clicking on the link by mistake.\nIn the New York City phishing campaign, clicking on the link brings you to a website pretending to be \"NYC Department of Finance: Parking and Camera Violations,\" which will prompt you to enter your name and zip code.\nAt this point, you can enter any name and zip code and will be brought to a page stating, \"Your vehicle has an unpaid parking invoice in City of New York. To avoid a late fees of 35$, please settle your balance promptly.\"\nThe balance owed varies per campaign, with the one received by BleepingComputer stating that we owed $4.60.\nNew York City phishing site asking for personal information\nSource: BleepingComputer\nHowever, as you can see from the images below, there is a tell-tale sign that this is a scam, as the dollar sign is displayed after the amount, rather than before, as is customary in the US. This further indicates that the phishing scam was created by people outside of the US.\nClicking on the \"Proceed Now\" button brings you to the screen where the threat actors attempt to steal your data, including your name, address, phone number, email address, and, eventually, your credit card information.\nThis information can then be used for a wide variety of malicous activity, including further phishing attacks, identity theft, financial fraud, and the sale of your data to other threat actors.\nAs a general rule, if you receive a text from an unknown phone number or email address that is an out-of-the-blue greeting or asks you to click a link, pay a bill, or respond in some manner, you should report and block the number instead.\nRelated Articles:\nNew Darcula phishing service targets iPhone users via iMessage\nPhishing texts trick Apple iMessage users into disabling protection\nMalicious Chrome extensions can spoof password managers in new attack\nYouTube warns of AI-generated video of its CEO used in phishing attacks\nNew ClickFix attack deploys Havoc C2 via Microsoft Sharepoint"
    },
    {
        "Title": "New Chirp tool uses audio tones to transfer data between devices",
        "Link": "https://www.bleepingcomputer.com/news/software/new-chirp-tool-uses-audio-tones-to-transfer-data-between-devices/",
        "Summary": "A new open-source tool named 'Chirp' transmits data, such as text messages, between computers (and smartphones) through different audio tones. [...]",
        "Date": "2025-03-09",
        "Content": "A new open-source tool named 'Chirp' transmits data, such as text messages, between computers (and smartphones) through different audio tones.\nThe tool, developed by cybersecurity researcher\nsolst/ICE\n, maps each character into a specific sound frequency and plays it along with real-time visualization.\nOther microphone-equipped computers running Chirp may capture the sound and translate the message back into text.\nThe project allows users to \"sneak\" messages between devices in a fun way, and it's available both\nonline\nand as a standalone app available for free\nthrough GitHub\n.\nAlthough it's not overly practical for most real-world applications due to background noise interference, it could still prove helpful in short-range, offline, and low-power use cases.\nNEW TOOL: Chirp\nUses sound to transfer data between machines.\nDetails and link below.\npic.twitter.com/pAUnJqybLF\n— solst/ICE (@IceSolst)\nMarch 3, 2025\nOne practical limitation of Chirp is that it stops listening for messages when transmitting, so anything received during that time is essentially lost.\nWhen considering that a message consisting of 100 words takes roughly 70 seconds to transmit, this can be a problem in some cases.\nThe developer also told us that Chirp currently has no error correction or redundancy, so the error rate could get impractically high if the background noise is too loud or the speaker sound isn't high enough.\nExample transmission from a computer (left) captured by a smartphone (right)\nSource: BleepingComputer\nOld concept, fun new approach\nThe concept of transmitting data via a speaker-microphone configuration isn't new, with numerous similar implementations dating as far back as a decade ago.\nThe idea itself has also been demonstrated as an attack\ndubbed 'MOSQUITO\n,' developed by Israeli researchers in 2018.\nChirp.io, owned by Sonos since 2020, did something similar, facilitating seamless device-to-device communication without traditional wireless connections.\nsolst/ICE told BleepingComputer that the idea to develop an open-source Chirp tool came after watching a demo of two LLMs talking to each other using ggwave-generated audio signals.\nToday I was sent the following cool demo:\nTwo AI agents on a phone call realize they're both AI and switch to a superior audio signal ggwave\npic.twitter.com/TeewgxLEsP\n— Georgi Gerganov (@ggerganov)\nFebruary 24, 2025\nDeveloped by Georgi Gerganov,\nggwave\nis a compact data-over-sound library that facilitates the transmission and reception of short data messages through sound waves.\nsolst/ICE informed us that the next step is to experiment with hypersonic sounds to allow message exchanges using inaudible frequencies. This will make Chirp even more stealthy and more fun to play with.\nFor those wanting to play with the online Chirp application and are worried about privacy, the developer told BleepingComputer that the application is hosted on GitHub pages, and all functions happen on the client side and are never sent to a server.\nOur tests confirmed this, as the online service works as expected when offline.\nRelated Articles:\nOpen-source tool 'Rayhunter' helps users detect Stingray attacks\nApiiro unveils free scanner to detect malicious code merges\nBrave now lets you inject custom JavaScript to tweak websites\nUK watchdog probes TikTok and Reddit over child privacy concerns\nMicrosoft to remove the Location History feature in Windows"
    }
]