[
    {
        "Title": "Coinbase Initially Targeted in GitHub Actions Supply Chain Attack; 218 Repositories' CI/CD Secrets Exposed",
        "Link": "https://thehackernews.com/2025/03/github-supply-chain-breach-coinbase.html",
        "Summary": "The supply chain attack involving the GitHub Action \"tj-actions/changed-files\" started as a highly-targeted attack against one of Coinbase's open-source projects, before evolving into something more widespread in scope.\n\"The payload was focused on exploiting the public CI/CD flow of one of their open source projects – agentkit, probably with the purpose of leveraging it for further compromises,\"",
        "Date": "2025-03-23",
        "Content": "The supply chain attack involving the GitHub Action \"tj-actions/changed-files\" started as a highly-targeted attack against one of Coinbase's open-source projects, before evolving into something more widespread in scope.\n\"The payload was focused on exploiting the public CI/CD flow of one of their open source projects – agentkit, probably with the purpose of leveraging it for further compromises,\" Palo Alto Networks Unit 42\nsaid\nin a report. \"However, the attacker was not able to use Coinbase secrets or publish packages.\"\nThe\nincident\ncame to light on March 14, 2025, when it was found that \"tj-actions/changed-files\" was compromised to inject code that leaked sensitive secrets from repositories that ran the workflow. It has been assigned the CVE identifier\nCVE-2025-30066\n(CVSS score: 8.6).\nAccording to Endor Labs, 218 GitHub repositories are estimated to have exposed their secrets due to the supply chain attack, and a majority of the leaked information includes a \"few dozen\" credentials for DockerHub, npm, and Amazon Web Services (AWS), as well as GitHub install access tokens.\n\"The initial scale of the supply chain attack sounded scary, considering that tens of thousands of repositories depend on the GitHub Action,\" security researcher Henrik Plate\nsaid\n.\n\"However, drilling down into the workflows, their runs and leaked secrets shows that the actual impact is smaller than anticipated: 'Only' 218 repositories leaked secrets, and the majority of those are short-lived GITHUB_TOKENs, which expire once a workflow run is completed.\"\nSince then, it has emerged that the v1 tag of another GitHub Action called \"reviewdog/action-setup,\" which \"tj-actions/changed-files\" relies on as a dependency via \"tj-actions/eslint-changed-files,\" was also compromised in the lead up to the tj-actions incident with a similar payload. The\nbreach of \"reviewdog/action-setup\"\nis being tracked as\nCVE-2025-30154\n(CVSS score: 8.6).\nThe exploitation of CVE-2025-30154 is said to have enabled the unidentified threat actor to obtain a personal access token (PAT) associated with \"tj-actions/changed-files,\" thereby allowing them to modify the repository and push the malicious code, in turn impacting every single GitHub repository that depended on the action.\n\"When the tj-actions/eslint-changed-files action was executed, the tj-actions/changed-files CI runner's secrets were leaked, allowing the attackers to steal the credentials used in the runner, including a Personal Access Token (PAT) belonging to the tj-bot-actions GitHub user account,\" Unit 42 researchers Omer Gil, Aviad Hahami, Asi Greenholts, and Yaron Avital said.\nIt's currently suspected that the attacker managed to somehow gain access to a token with write access to the reviewdog organization in order to make the rogue alterations. That said, the manner in which this token may have been acquired remains unknown at this stage.\nFurthermore, the malicious commits to \"reviewdog/action-setup\" is said to have been carried out by first forking the corresponding repository, committing changes to it, and then creating a\nfork pull request\nto the original repository and ultimately introducing arbitrary commits – a scenario called a dangling commit.\n\"The attacker took significant measures to conceal their tracks using various techniques, such as leveraging dangling commits, creating multiple temporary GitHub user accounts, and obfuscating their activities in workflow logs (especially in the initial Coinbase attack),\" Gil, Senior Research Manager at Palo Alto Networks, told The Hacker News. \"These findings indicate that the attacker is highly skilled and has a deep understanding of CI/CD security threats and attack tactics.\"\nUnit 42 theorized that the user account behind the fork pull request \"iLrmKCu86tjwp8\" may have been hidden from public view after the attacker switched from a legitimate email address provided during registration to a disposable (or anonymous) email in violation of GitHub's policy.\nThis could have caused all the interactions and actions performed by the user to be concealed. However, when reached for comment, GitHub did not confirm or deny the hypothesis, but said it's actively reviewing the situation and taking action as necessary.\n\"There is currently no evidence to suggest a compromise of GitHub or its systems. The projects highlighted are user-maintained open-source projects,\" a GitHub spokesperson told The Hacker News.\n\"GitHub continues to review and take action on user reports related to repository contents, including malware and other malicious attacks, in accordance with\nGitHub's Acceptable Use Policies\n. Users should always review GitHub Actions or any other package that they are using in their code before they update to new versions. That remains true here as in all other instances of using third party code.\"\nA deeper search for GitHub forks of tj-actions/changed-files has led to the discovery of two other accounts \"2ft2dKo28UazTZ\" and \"mmvojwip,\" both of which have since been deleted from the platform. Both the accounts have also been found to create forks of Coinbase-related repositories such as onchainkit, agentkit, and x402.\nFurther\nexamination\nhas\nuncovered\nthat the accounts modified the \"changelog.yml\" file in the agentkit repository using a fork pull request to point to a malicious version of \"tj-actions/changed-files\" published earlier using the PAT.\nThe attacker is believed to have obtained a GitHub token with write permissions to the agentkit repository – in turn facilitated by the execution of the tj-actions/changed-files GitHub Actions – so as to make the unauthorized changes.\nAnother important aspect worth highlighting is the difference in payloads used in both the cases, indicating attempts on part of the attacker to stay under the radar.\n\"The attacker used different payloads at different stages of the attack. For example, in the widespread attack, the attacker dumped the runner's memory and printed secrets stored as environment variables to the workflow's log, regardless of which workflow was running,\" Gil said.\n\"However, when targeting Coinbase, the attacker specifically fetched the GITHUB_TOKEN and ensured that the payload would only execute if the repository belonged to Coinbase.\"\nIt's currently not known what the end goal of the campaign was, it's \"strongly\" suspected that the intent was financial gain, likely attempting to conduct cryptocurrency theft, given the hyper-specific targeting of Coinbase, Gil pointed out. As of March 19, 2025, the cryptocurrency exchange has remediated the attack.\nIt's also not clear what prompted the attacker to switch gears, turning what was an initially targeted attack turned into a large-scale and less stealthy campaign.\n\"One hypothesis is that after realizing they could not leverage their token to poison the Coinbase repository -- and upon learning that Coinbase had detected and mitigated the attack -- the attacker feared losing access to the tj-actions/changed-files action,\" Gil said.\n\"Since compromising this action could provide access to many other projects, they may have decided to act quickly. This could explain why they launched the widespread attack just 20 minutes after Coinbase mitigated the exposure on their end despite the increased risk of detection.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "FBI warnings are true—fake file converters do push malware",
        "Link": "https://www.bleepingcomputer.com/news/security/fbi-warnings-are-true-fake-file-converters-do-push-malware/",
        "Summary": "The FBI is warning that fake online document converters are being used to steal people's information and, in worst-case scenarios, lead to ransomware attacks. [...]",
        "Date": "2025-03-23",
        "Content": "The FBI is warning that fake online document converters are being used to steal peoples’ information and, in worst-case scenarios, to deploy ransomware on victims' devices.\nThe warning came last week from the FBI Denver field office, after receiving an increasing number of reports about these types of tools.\n\"The FBI Denver Field Office is warning that agents are increasingly seeing a scam involving free online document converter tools, and we want to encourage victims to report instances of this scam,\" reads\nthe warning\n.\n\"In this scenario, criminals use free online document converter tools to load malware onto victims' computers, leading to incidents such as ransomware.\"\nThe FBI says that cybercriminals are creating websites that promote free document converts, download tools, or file merging tools.\n\"To conduct this scheme, cyber criminals across the globe are using any type of free document converter or downloader tool. This might be a website claiming to convert one type of file to another, such as a .doc file to a .pdf file,\" continued the FBI\n\"It might also claim to combine files, such as joining multiple .jpg files into one .pdf file. The suspect program might claim to be an MP3 or MP4 downloading tool.\"\nWhile the online tools work as advertised, the FBI says the resulting file may also contain hidden malware that can be used to gain remote access to the infected device.\nThe FBI also says that the uploaded documents can also be scraped for sensitive information, such as names, social security numbers, cryptocurrency seeds, passphrases, wallet addresses, email addresses, passwords, and banking information.\nThe FBI Denver field office told BleepingComputer that people are reporting these scams to IC3.gov, with one public sector entity reporting the scam in metro Denver in the last three weeks.\n\"The scammers try to mimic URLs that are legit – so changing just one letter, or 'INC' instead of 'CO',\" Vikki Migoya, the Public Affairs Office for FBI Denver, told BleepingComputer.\n“Users who in the past would type ‘free online file converter’ into a search engine are vulnerable, as the algorithms used for results now often include paid results, which might be scams.”\nWhile the FBI told BleepingComputer they could not share any further technical details as it would let the scammers know what is working, threat actors have been known to utilize these tools to deploy malware.\nOnline converters lead to malware\nSome have questioned whether these free document converters can lead to malware and ransomware attacks, and the answer is yes.\nLast week, cybersecurity researcher\nWill Thomas\nshared some sites that claimed to be online document converters, such as docu-flex[.]com and pdfixers[.]com.\nDocuFlex site that was available in February 2025\nSource:\nArchive.org\nWhile these sites are no longer available, they distributed Windows executables named Pdfixers.exe [\nVirusTotal\n] and DocuFlex.exe [\nVirusTotal\n], which are both detected as malware.\nA\ncybersecurity researcher\nknown for tracking the Gootloader infection also reported in November about a Google advertising campaign that promoted fake file converter sites. These sites pretended to convert your files but instead caused you to download the Gootloader malware.\n\"Visiting this WordPress site (surprise!), I found a form for uploading a PDF to convert it to a .DOCX file inside a .zip,\"\nexplained the researcher\n.\n\"But after passing certain checks—being from an English-speaking country and not having visited in the past 24 hours on the same class C subnet—users instead receive a .JS file inside the .zip rather than a genuine .DOCX.\"\nThis JavaScript file is Gootloader, a malware loader known for downloading additional malware, such as banking trojans, infostealers, malware downloaders, and post-exploitation tools, like Cobalt Strike beacons.\nUsing these additional payloads, the threat actors breach corporate networks and spread laterally to other computers. Attacks like these have led to full-blown ransomware attacks in the past, such as those by\nREvil\nand\nBlackSuit\n.\nWhile not all file converters are malware, it’s essential to research them before using and check reviews before downloading any programs.\nIf a site is relatively unknown, it is better to avoid it altogether.\nIf you use an online file converter or downloader, be sure to analyze any resulting file from the site, as if they are an executable or JavaScript, they are most definitely malicious.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nRansomHub ransomware uses new Betruger ‘multi-function’ backdoor\nMalware campaign 'DollyWay' breached 20,000 WordPress sites\nCISA: Medusa ransomware hit over 300 critical infrastructure orgs\nFake BianLian ransom notes mailed to US CEOs in postal mail scam\nMicrosoft Teams tactics, malware connect Black Basta, Cactus ransomware"
    }
]