[
    {
        "Title": "China-Linked Silk Typhoon Expands Cyber Attacks to IT Supply Chains for Initial Access",
        "Link": "https://thehackernews.com/2025/03/china-linked-silk-typhoon-expands-cyber.html",
        "Summary": "The China-lined threat actor behind the zero-day exploitation of security flaws in Microsoft Exchange servers in January 2021 has shifted its tactics to target the information technology (IT) supply chain as a means to obtain initial access to corporate networks.\nThat's according to new findings from the Microsoft Threat Intelligence team, which said the Silk Typhoon (formerly Hafnium) hacking",
        "Date": "2025-03-05",
        "Content": "The China-lined threat actor behind the zero-day exploitation of security flaws in Microsoft Exchange servers in January 2021 has shifted its tactics to target the information technology (IT) supply chain as a means to obtain initial access to corporate networks.\nThat's according to new findings from the Microsoft Threat Intelligence team, which said the\nSilk Typhoon\n(formerly Hafnium) hacking group is now targeting IT solutions like remote management tools and cloud applications to obtain a foothold.\n\"After successfully compromising a victim, Silk Typhoon uses the stolen keys and credentials to infiltrate customer networks where they can then abuse a variety of deployed applications, including Microsoft services and others, to achieve their espionage objectives,\" the tech giant\nsaid\nin a report published today.\nThe adversarial collective is assessed to be \"well-resourced and technically efficient,\" swiftly putting to use exploits for zero-day vulnerabilities in edge devices for opportunistic attacks that allow them to scale their attacks at scale and across a wide range of sectors and regions.\nThis includes information technology (IT) services and infrastructure, remote monitoring and management (RMM) companies, managed service providers (MSPs) and affiliates, healthcare, legal services, higher education, defense, government, non-governmental organizations (NGOs), energy, and others located in the United States and throughout the world.\nSilk Typhoon has also been observed relying on various web shells to achieve command execution, persistence, and data exfiltration from victim environments. It's also said to have demonstrated a keen understanding of cloud infrastructure, further allowing it to move laterally and harvest data of interest.\nAt least since late 2024, the attackers have been linked to a new set of methods, chief among which concerns the abuse of stolen API keys and credentials associated with privilege access management (PAM), cloud app providers, and cloud data management companies to conduct supply chain compromises of downstream customers.\n\"Leveraging access obtained via the API key, the actor performed reconnaissance and data collection on targeted devices via an admin account,\" Microsoft said, adding targets of this activity mainly encompassed the state and local government, as well as the IT sector.\nSome of the other initial access routes adopted by Silk Typhoon entail the zero-day exploitation of a security flaw in Ivanti Pulse Connect VPN (\nCVE-2025-0282\n) and the use of password spray attacks using enterprise credentials surfaced from leaked passwords on public repositories hosted on GitHub and others.\nAlso exploited by the threat actor as a zero-day are -\nCVE-2024-3400\n, a command injection flaw in Palo Alto Networks firewalls\nCVE-2023-3519\n, An unauthenticated remote code execution (RCE) vulnerability affecting Citrix NetScaler Application Delivery Controller (ADC) and NetScaler Gateway\nCVE-2021-26855 (aka\nProxyLogon\n), CVE-2021-26857, CVE-2021-26858, and CVE-2021-27065, a\nset of vulnerabilities\nimpacting Microsoft Exchange Server\nA successful initial access is followed by the threat actor taking steps to move laterally from on-premises environments to cloud environments, and leverage OAuth applications with administrative permissions to perform email, OneDrive, and SharePoint data exfiltration via the MSGraph API.\nIn an attempt to obfuscate the origin of their malicious activities, Silk Typhoon relies on a \"\nCovertNetwork\n\" comprising compromised Cyberoam appliances, Zyxel routers, and QNAP devices, a hallmark of several Chinese state-sponsored actors.\n\"During recent activities and historical exploitation of these appliances, Silk Typhoon utilized a variety of web shells to maintain persistence and to allow the actors to remotely access victim environments,\" Microsoft said.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Defending against USB drive attacks with Wazuh",
        "Link": "https://thehackernews.com/2025/03/defending-against-usb-drive-attacks.html",
        "Summary": "USB drive attacks constitute a significant cybersecurity risk, taking advantage of the everyday use of USB devices to deliver malware and circumvent traditional network security measures. These attacks lead to data breaches, financial losses, and operational disruptions, with lasting impacts on an organization's reputation. An example is the Stuxnet worm discovered in 2010, a malware designed to",
        "Date": "2025-03-05",
        "Content": "USB drive attacks\nconstitute a significant cybersecurity risk, taking advantage of the everyday use of USB devices to deliver malware and circumvent traditional network security measures. These attacks lead to data breaches, financial losses, and operational disruptions, with lasting impacts on an organization's reputation. An example is the Stuxnet worm discovered in 2010, a malware designed to target industrial control systems, specifically Iran's nuclear enrichment facilities. It exploited multiple zero-day vulnerabilities and spread primarily through USB drives, making it one of the first examples of a cyberattack with real-world physical effects. Stuxnet exposed the risks of removable media and raised global awareness of cybersecurity threats to critical infrastructure.\nHow USB drive attacks propagate\nAttackers use various methods to deliver malicious payloads via USB drives, targeting individuals and organizations.\nDrop attacks\n: Infected USB drives are deliberately left in public areas, such as parking lots, to entice victims to plug them in and infect their computers.\nMail-based attacks\n: USB drives are sent to targets via mail, disguised as promotional items or legitimate devices, to trick them into plugging them into their systems.\nSocial engineering\n: Attackers use psychological tactics to persuade victims to connect infected USB drives to their computers.\nUnsolicited plugging\n: Attackers plug infected USB drives into unattended systems, spreading malware without victim interaction.\nHow USB drive attacks work\nUSB drive attacks typically follow a multi-step process to infiltrate systems and cause damage.\nReconnaissance:\nAttackers research their target to identify potential vulnerabilities. In this case, they may gather information about the organization, its employees, and its operational environment to determine the likelihood of someone using a USB drive.\nWeaponization:\nThreat actors prepare the USB drive by embedding malware. This can be achieved by directly infecting the drive or crafting a seemingly benign file, such as a document, video, or image, which contains hidden malicious code.\nDelivery:\nAttackers distribute the infected USB drive to targets by dropping it in public areas, giving it away as a promotional item, or using social engineering to deliver it.\nExploitation:\nWhen the target connects to the USB drive, the malware is activated automatically or through user interaction, exploiting system vulnerabilities.\nInstallation:\nThe malware is installed on the target system, gaining persistence. This step allows the attacker to maintain control of the infected device even if it is rebooted or disconnected.\nCommand and Control (C2):\nThe malware communicates with the attacker's server. This enables the attacker to issue commands, exfiltrate data, or deploy additional payloads.\nActions on Objectives:\nThe attackers achieve their goals, such as stealing sensitive data, deploying ransomware, or establishing persistent access for future exploitation\n.\nFigure 1:  Steps showing how USB Drive attacks work.\nEnhance your cybersecurity posture against USB drive attacks with Wazuh\nWazuh\nis an open source security platform that helps organizations detect and respond to security threats by monitoring system activities, from informational events to critical incidents. Organizations can proactively prevent breaches and safeguard sensitive data by monitoring USB activity with Wazuh.\nMonitoring USB drive activities in Windows using Wazuh\nWazuh monitors USB drive activities on Windows endpoints using the Audit PNP Activity feature. This feature logs Plug and Play (PnP) events, which helps identify when USB drives are connected. It is available on Windows 10 Pro and Windows 11 Pro, Windows Server 2016, and later versions.\nOrganizations can configure Wazuh to detect specific system events and monitor USB-related events, particularly focusing on Windows event ID 6416, which indicates when an external device is connected. Security administrators can detect USB device connections by creating Wazuh custom rules to identify potential security incidents.\nThe next step includes creating a Constant Database (CDB) of permitted devices' unique device identifiers (DeviceID). This list allows Wazuh to differentiate between authorized and unauthorized devices, generating alerts for both categories. For instance, when an authorized USB drive is plugged in, it triggers a lower-level alert, while unauthorized connections can generate high-severity alerts that indicate a potential security breach.\nFigure 2: USB drive plug-in events on a monitored Windows endpoint.\nFigure 3: Authorized USB drive event.\nFigure 4: Unauthorized USB drive event.\nThreat detection use case: Detecting the Raspberry Robin USB-Drive activities\nWazuh provides a solution to mitigate USB-related threats, such as Raspberry Robin, a Windows-based worm.\nRaspberry Robin targets industries like oil, gas, transportation, and tech, causing operational disruptions. It spreads via disguised .lnk files, gains persistence by updating the UserAssist registry, and mimics legitimate folders. The worm uses legitimate Windows processes such as msiexec.exe, rundll32.exe, odbcconf.exe, and fodhelper.exe to execute, persist, and download additional malicious components. Its reliance on TOR-based command and control (C2) servers for outbound communication adds stealth and complicates detection.\nWazuh detects Raspberry Robin by monitoring registry modifications, unusual command execution patterns, and suspicious system binaries use. Its real-time file integrity monitoring and threat detection rules identify malicious activity, enabling swift response to mitigate potential disruptions.\nWazuh detects and mitigates Raspberry Robin by monitoring and responding to suspicious activity like:\nAnomalous cmd.exe activities\n: terminating suspicious processes or isolating affected endpoints.\nFlagging msiexec.exe downloads\nfrom obscure domains, blocking connections, and alerting administrators.\nDetecting UAC bypass via fodhelper.exe\n, terminating the process, and notifying administrators.\nBlocking unusual outbound connections\nby rundll32.exe and dllhost.exe.\nBelow is a sample custom rule configuration that detects possible Raspberry Robin activities.\n<rule id=\"100100\" level=\"12\">\n    <if_sid>92004</if_sid>\n    <field name=\"win.eventdata.image\" type=\"pcre2\">(?i)cmd\\.exe$</field>\n    <field name=\"win.eventdata.commandLine\" type=\"pcre2\">(?i)cmd\\.exe.+((\\/r)|(\\/v\\.+\\/c)|(\\/c)).*cmd</field>\n    <description>Possible Raspberry Robin execution on $(win.system.computer)</description>\n    <mitre>\n        <id>T1059.003</id>\n    </mitre>\n</rule>\n\n<rule id=\"100101\" level=\"7\">\n    <if_sid>61603</if_sid>\n    <field name=\"win.eventdata.image\" type=\"pcre2\">(?i)msiexec\\.exe$</field>\n    <field name=\"win.eventdata.commandLine\" type=\"pcre2\">(?i)msiexec.*(\\/q|\\-q|\\/i|\\-i).*(\\/q|\\-q|\\/i|\\-i).*http[s]{0,1}\\:\\/\\/.+[.msi]{0,1}</field>\n    <description>msiexec.exe downloading and executing packages on $(win.system.computer)</description>\n    <mitre>\n        <id>T1218.007</id>\n    </mitre>\n</rule>\n\n<rule id=\"100103\" level=\"12\">\n    <if_sid>61603</if_sid>\n    <field name=\"win.eventdata.originalFileName\" type=\"pcre2\">(?i)(cmd|powershell|rundll32)\\.exe</field>\n    <field name=\"win.eventdata.parentImage\" type=\"pcre2\">(?i)fodhelper\\.exe</field>\n    <description>Use of fodhelper.exe to bypass UAC on $(win.system.computer)</description>\n    <mitre>\n        <id>T1548.002</id>\n    </mitre>\n</rule>\n\n<rule id=\"100105\" level=\"10\">\n    <if_sid>61603</if_sid>\n    <field name=\"win.eventdata.commandLine\" type=\"pcre2\">(regsvr32\\.exe|rundll32\\.exe|dllhost\\.exe).*\\\";document.write\\(\\);GetObject\\(\\\"script:.*\\).Exec\\(\\)</field>\n    <description>Possible Raspberry Robin execution on $(win.system.computer)</description>\n    <mitre>\n        <id>T1218.011</id>\n    </mitre>\n</rule>\nFigure 5:  Raspberry Robin IoCs and behaviors detected on a monitored Windows endpoint.\nFigure 6: An alert showing the Raspberry Robin IoCs detected on a monitored Windows endpoint.\nFor more details on detecting the Raspberry Robin worm using Wazuh, please visit this\nblog\n.\nMonitoring USB drives in Linux using Wazuh\nUSB drives can also introduce security risks to Linux endpoints as potential vectors for malware and unauthorized data access. udev is a system utility on Linux that automatically detects and manages external devices, such as USB drives, when plugged in. It creates the necessary device files in the /dev directory so that the system can interact with them. Administrators can create custom udev rules that generate detailed events, providing insights into USB activity. Wazuh has built-in rules for USB monitoring, but udev-generated events provide richer details, improving threat detection.\nWe configure udev rules on our Linux endpoints to trigger a logging script whenever a USB device is connected. The Wazuh agent must be set up to read the generated JSON log file produced from the logging script, allowing it to process and analyze USB activity.\nLike the Windows USB drive monitoring, you need a constant database (CDB) list of authorized USB device serial numbers. Wazuh will compare incoming connections against this list, triggering alerts for unauthorized devices.\nFigure 7: USB drive alerts for a monitored Linux endpoint.\nFigure 8: An unauthorized USB drive event on a monitored Linux endpoint.\nThe blog post on\nMonitoring USB drives in Linux using Wazuh\nprovides more information on monitoring USB drives plugged into Linux endpoints.\nMonitoring USB drives in macOS using Wazuh\nYou can use a custom script to log critical events related to USB devices on macOS endpoints and then configure Wazuh to monitor these events. Administrators can extract information such as connection and disconnection events, vendor IDs, product IDs, and serial numbers of USB drives plugged in. This script interacts with macOS's I/O Kit framework to gather USB device information, which is then formatted as JSON and saved to a log file. The log data generated from this custom script is sent to the Wazuh server for analysis using the Wazuh agent.\nThe blog post on\nMonitoring USB drives in macOS using Wazuh\nshows the steps to monitor USB drives on macOS endpoints.\nFigure 9: USB drive alerts on a monitored macOS endpoint.\nFigure 10: Unauthorized USB drive alert on a monitored macOS endpoint.\nConclusion\nUSB drive attacks pose a security risk across major operating systems, enabling malware propagation and unauthorized access to malicious actors.\nWazuh offers various detection mechanisms to increase the chances of detecting USB Drive attacks and mitigate the potential impact. Organizations can enhance cybersecurity by integrating these detection methods and enforcing strict USB access policies.\nReferences\nMonitoring USB drives in Windows using Wazuh\nMonitoring USB drives in Linux using Wazuh\nMonitoring USB drives in MacOS using Wazuh\nUsing Wazuh to detect raspberry robin worms\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Dark Caracal Uses Poco RAT to Target Spanish-Speaking Enterprises in Latin America",
        "Link": "https://thehackernews.com/2025/03/dark-caracal-uses-poco-rat-to-target.html",
        "Summary": "The threat actor known as Dark Caracal has been attributed to a campaign that deployed a remote access trojan called Poco RAT in attacks targeting Spanish-speaking targets in Latin America in 2024.\nThe findings come from Russian cybersecurity company Positive Technologies, which described the malware as loaded with a \"full suite of espionage features.\"\n\"It could upload files, capture screenshots",
        "Date": "2025-03-05",
        "Content": "The threat actor known as\nDark Caracal\nhas been attributed to a campaign that deployed a remote access trojan called Poco RAT in attacks targeting Spanish-speaking targets in Latin America in 2024.\nThe findings come from Russian cybersecurity company Positive Technologies, which described the malware as loaded with a \"full suite of espionage features.\"\n\"It could upload files, capture screenshots, execute commands, and manipulate system processes,\" researchers Denis Kazakov and Sergey Samokhin\nsaid\nin a technical report published last week.\nPoco RAT was\npreviously documented\nby Cofense in July 2024, detailing the phishing attacks aimed at mining, manufacturing, hospitality, and utilities sectors. The infection chains are characterized by the use of finance-themed lures that trigger a multi-step process to deploy the malware.\nWhile the campaign was not attributed to any threat at that time, Positive Technologies said it identified tradecraft overlaps with\nDark Caracal\n, an advanced persistent threat (APT) known for operating malware families like\nCrossRAT and Bandook\n. It's operational since at least 2012.\nIn 2021, the cyber mercenary group was\ntied\nto a cyber espionage campaign dubbed Bandidos that delivered an updated version of the Bandook malware against Spanish-speaking countries in South America.\nThe latest set of attacks continue their focus on Spanish-speaking users, leveraging phishing emails with invoice-related themes that bear malicious attachments written in Spanish as a starting point. An analysis of Poco RAT artifacts indicates the intrusions are mainly targeting enterprises in Venezuela, Chile, the Dominican Republic, Colombia, and Ecuador.\nThe attached decoy documents impersonate a wide range of industry verticals, including banking, manufacturing, healthcare, pharmaceuticals, and logistics, in an attempt to lend the scheme a little more believability.\nWhen opened, the files redirect victims to a link that triggers the download of a .rev archive from legitimate file-sharing services or cloud storage platforms like Google Drive and Dropbox.\n\"Files with the .rev extension are generated using WinRAR and were originally designed to reconstruct missing or corrupted volumes in multi-part archives,\" the researchers explained. \"Threat actors repurpose them as stealthy payload containers, helping malware evade security detection.\"\nPresent within the archive is a Delphi-based dropper that's responsible for launching Poco RAT, which, in turn, establishes contact with a remote server and grants attackers full control over compromised hosts. The malware gets its name from the use of POCO libraries in its C++ codebase.\nSome of the supported commands by Poco RAT are listed below -\nT-01 - Send collected system data to the command-and-control (C2) server\nT-02 - Retrieve and transmit the active window title to the C2 server\nT-03 - Download and run an executable file\nT-04 - Download a file to the compromised machine\nT-05 - Capture a screenshot and send it to the C2 server\nT-06 - Execute a command in cmd.exe and send the output to the C2 server\n\"Poco RAT does not come with a built-in persistence mechanism,\" the researchers said. \"Once initial reconnaissance is complete, the server likely issues a command to establish persistence, or attackers may use Poco RAT as a stepping stone to deploy the primary payload.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Google Rolls Out AI Scam Detection for Android to Combat Conversational Fraud",
        "Link": "https://thehackernews.com/2025/03/google-rolls-out-ai-scam-detection-for.html",
        "Summary": "Google has announced the rollout of artificial intelligence (AI)-powered scam detection features to secure Android device users and their personal information.\n\"These features specifically target conversational scams, which can often appear initially harmless before evolving into harmful situations,\" Google said. \"And more phone calling scammers are using spoofing techniques to hide their real",
        "Date": "2025-03-05",
        "Content": "Google has announced the rollout of artificial intelligence (AI)-powered scam detection features to secure Android device users and their personal information.\n\"These features specifically target conversational scams, which can often appear initially harmless before evolving into harmful situations,\" Google\nsaid\n. \"And more phone calling scammers are using spoofing techniques to hide their real numbers and pretend to be trusted companies.\"\nThe company said it has partnered with financial institutions to better understand the nature of scams customers are encountering, thereby allowing it to devise AI models that can flag suspicious patterns and deliver real-time warnings over the course of a conversation without sacrificing user privacy.\nThese\nmodels run completely on-device\n, alerting users in the event of a likely scam. Users then have an option to either dismiss or report and block the sender. The setting is enabled by default and applies only to conversations with phone numbers that are not in the device's contact list.\nThe tech giant also emphasized that users' conversations remain private and that if they choose to report a chat as spam, then the sender details and recent messages with that sender are shared with Google and carriers.\nThe feature is launching in English first in the U.S., the U.K., and Canada, with broader expansion planned for a later date.\nFurthermore, a similar scam detection for phone calls is being expanded to all English-speaking Pixel 9+ users in the U.S. The feature was\nfirst introduced\nin November 2024.\nIt's worth pointing out that while this feature is off by default to give users control, the call audio is processed ephemerally and is never used during phone calls with contacts.\n\"If enabled, Scam Detection will beep at the start and during the call to notify participants the feature is on,\" Google said. \"You can turn off Scam Detection at any time, during an individual call or for all future calls.\"\nThe development comes weeks after Google revealed that more than 1 billion Chrome users are using the Enhanced Protection mode of Safe Browsing in the web browser.\n\"If you turn on Enhanced Protection, much of the additional protection you receive comes from advanced AI and machine learning models designed to spot dangerous URLs engaging in known phishing, social engineering, and scam techniques,\" the company\nsaid\n.\n\"Safe Browsing's Enhanced Protection models can identify URLs designed to look similar to trusted domains. It also uses advanced AI and machine learning techniques to protect you from dangerous downloads.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Chinese APT Lotus Panda Targets Governments With New Sagerunex Backdoor Variants",
        "Link": "https://thehackernews.com/2025/03/chinese-apt-lotus-panda-targets.html",
        "Summary": "The threat actor known as Lotus Panda has been observed targeting government, manufacturing, telecommunications, and media sectors in the Philippines, Vietnam, Hong Kong, and Taiwan with updated versions of a known backdoor called Sagerunex.\n\"Lotus Blossom has been using the Sagerunex backdoor since at least 2016 and is increasingly employing long-term persistence command shells and developing",
        "Date": "2025-03-05",
        "Content": "The threat actor known as\nLotus Panda\nhas been observed targeting government, manufacturing, telecommunications, and media sectors in the Philippines, Vietnam, Hong Kong, and Taiwan with updated versions of a known backdoor called Sagerunex.\n\"Lotus Blossom has been using the Sagerunex backdoor since at least 2016 and is increasingly employing long-term persistence command shells and developing new variants of the Sagerunex malware suite,\" Cisco Talos researcher Joey Chen\nsaid\nin an analysis published last week.\nLotus Panda, also known as Billbug, Bronze Elgin, Lotus Blossom, Spring Dragon, and Thrip, is a suspected Chinese hacking crew that's active since at least 2009. The threat actor was\nfirst exposed\nby Symantec in June 2018.\nIn late 2022, Broadcom-owned Symantec\ndetailed\nthe threat actor's attack on a digital certificate authority as well as government and defense agencies located in different countries in Asia that involved the use of backdoors like Hannotog and Sagerunex.\nThe exact initial access vector used to breach the entities in the latest set of intrusions is not known, although it has a history of conducting spear-phishing and watering hole attacks. The unspecified attack pathway serves as a conduit for the Sagerunex implant, which is assessed to be an evolution of an older Billbug malware known as Evora.\nThe activity is noteworthy for the use of two new \"beta\" variants of the malware, which leverage legitimate services like Dropbox, X, and Zimbra as command-and-control (C2) tunnels to evade detection. They have been so-called due to the presence of debug strings in the source code.\nThe backdoor is designed to gather target host information, encrypt it, and exfiltrate the details to a remote server under the attacker's control. The Dropbox and X versions of Sagerunex are believed to have been put to use between 2018 and 2022, while the Zimbra version is said to have been around since 2019.\n\"The Zimbra webmail version of Sagerunex is not only designed to collect victim information and send it to the Zimbra mailbox but also to allow the actor to use Zimbra mail content to give orders and control the victim machine,\" Chen said.\n\"If there is a legitimate command order content in the mailbox, the backdoor will download the content and extract the command, otherwise the backdoor will delete the content and wait for a legitimate command.\"\nThe results of the command execution are subsequently packaged in the form of an RAR archive and attached to a draft email in the mailbox's draft and trash folders.\nAlso deployed in the attacks are other tools such as a cookie stealer to harvest Chrome browser credentials, an open-source proxy utility named\nVenom\n, a program to adjust privileges, and bespoke software to compress and encrypt captured data.\nFurthermore, the threat actor has been observed running commands like net, tasklist, ipconfig, and netstat to perform reconnaissance of the target environment, in addition to carrying out checks to ascertain internet access.\n\"If internet access is restricted, then the actor has two strategies: using the target's proxy settings to establish a connection or using the Venom proxy tool to link the isolated machines to internet-accessible systems,\" Talos noted.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Identity: The New Cybersecurity Battleground",
        "Link": "https://thehackernews.com/2025/03/identity-new-cybersecurity-battleground.html",
        "Summary": "The rapid adoption of cloud services, SaaS applications, and the shift to remote work have fundamentally reshaped how enterprises operate. These technological advances have created a world of opportunity but also brought about complexities that pose significant security threats. At the core of these vulnerabilities lies Identity—the gateway to enterprise security and the number one attack vector",
        "Date": "2025-03-05",
        "Content": "The rapid adoption of cloud services, SaaS applications, and the shift to remote work have fundamentally reshaped how enterprises operate. These technological advances have created a world of opportunity but also brought about complexities that pose significant security threats. At the core of these vulnerabilities lies\nIdentity\n—the gateway to enterprise security and the number one attack vector for bad actors.\nExplore the importance of modernizing Identity strategies\nand the benefits of centralizing Identity within your security ecosystem to safeguard your organization from costly breaches while enhancing operational efficiency.\nThe rise of fragmented tech stacks\nGone are the days when enterprises relied on a single solution tied to a comprehensive license agreement. Businesses today prioritize agility and performance, opting for \"best-in-breed\" solutions that patch together fragmented tech ecosystems. While these advanced tech stacks provide flexibility, they also create significant challenges for IT and security teams.\nEvery app, platform, and infrastructure component you add increases the overall complexity of your ecosystem. This fragmentation scatters resources and identities across disconnected silos, limiting visibility and making it easier for cybercriminals to identify and exploit security blind spots. For modern businesses, unmanaged Identity isn't just a weakness—it's the Achilles' heel of enterprise security.\nThe growing threat of identity-based attacks\nWhy is Identity the new prime target? The 2024 Verizon Data Breach Report found that\n80% of breaches involve compromised Identity credentials\n. With the average time to detect and contain a breach sitting at 290 days, it's clear many organizations are underprepared for these increasingly sophisticated threats. Stunned by the rapid pace of cloud and SaaS adoption, many companies still lack the unified visibility and controls needed to protect their systems and mitigate risks effectively.\nRather than acting as a passive gatekeeper, Identity must now become the foundation of a proactive, defense-first enterprise security strategy.\nCentralizing identity within a security ecosystem\nTo combat modern threats, enterprises need to rethink their approach to Identity. Centralizing Identity across all systems and applications can\nsignificantly\nreduce security gaps, create real-time insights, and enable faster responses to potential attacks. It's more than just authentication; it's about transforming how organizations utilize Identity as a robust security tool.\nModern, cloud-native Identity solutions empower businesses by delivering three essential capabilities:\n1. Comprehensive visibility\nVisibility is critical when combating blind spots in fragmented tech stacks. A centralized Identity platform provides unified, real-time insights into your entire ecosystem, helping security teams surface vulnerabilities before they can be exploited. By consolidating all Identity and access data into one platform, enterprises can identify risks faster and prioritize remediation.\nAsk yourself, can your Identity solution…\n□ Give you visibility into all threats across all systems, devices, and types, and customer accounts?\n□ Incorporate third-party signals from across your tech stack (in addition to first-party signals from your Identity provider) for comprehensive, real-time threat visibility?\n□ Run automated scans of all your tools and evaluate your setup against an aggregated set of Zero Trust frameworks?\n2. Powerful orchestration\nCentralized Identity solutions don't just expose risks—they help eliminate them. Automation enables proactive remediation during potential breaches, from flagging unusual behavior to automatically revoking access. This type of orchestration enhances incident response, making it scalable and efficient even in complex environments.\nChecklist: Can your Identity solution…\n□ Simplify the task of setting up automated remediation actions?\n□ Enable granular customization of remediation actions based on risk factors, policies, and other contextual cues?\n□ Trigger robust responses like universal logout to protect against potential breaches?\n3. Broad and deep integrations\nA modern Identity platform connects seamlessly with your existing tech stack through APIs, unlocking the full value of system-wide security features. Whether it's connecting your cloud services, SaaS applications, or legacy systems, these integrations create a consistent, secure user experience while closing security gaps.\nChecklist: Can your Identity solution…\n□ Seamlessly integrate with your key enterprise Saas applications, e.g., your CRM,\nproductivity, collaboration, ERP, and IT ops management apps?\n□ Provide deep Identity security capabilities that go beyond simple provisioning and single sign on to provide protection for those apps before, during, and after login?\n□ Integrate with core parts of your security stack to enhance risk monitoring, threat detection, and remediation?\nThe path to Identity-first security\nIdentity-first security creates an open, efficient, and secure ecosystem for managing apps and systems without siloes, custom integrations, or security gaps. The OpenID Foundation's IPSIE working group is working to make this vision a reality.\nTake the next step\nYour enterprise's success depends on its ability to adapt and thrive in an evolving security landscape. By shifting your mindset and making Identity the foundation of your cybersecurity strategy, your organization can achieve stronger protection, operational efficiencies, and a seamless user experience.\nIt's time to stop playing defense and start innovating security around Identity. Start with a modern, cloud-based Identity solution that ensures you stay ahead of the threats your systems face daily.\nExplore how centralizing Identity can transform your security ecosystem today\n.\n[\nDiscover More About Modern Identity Solutions\n]\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Seven Malicious Go Packages Found Deploying Malware on Linux and macOS Systems",
        "Link": "https://thehackernews.com/2025/03/seven-malicious-go-packages-found.html",
        "Summary": "Cybersecurity researchers are alerting of an ongoing malicious campaign targeting the Go ecosystem with typosquatted modules that are designed to deploy loader malware on Linux and Apple macOS systems.\n\"The threat actor has published at least seven packages impersonating widely used Go libraries, including one (github[.]com/shallowmulti/hypert) that appears to target financial-sector developers",
        "Date": "2025-03-05",
        "Content": "Cybersecurity researchers are alerting of an ongoing malicious campaign targeting the Go ecosystem with typosquatted modules that are designed to deploy loader malware on Linux and Apple macOS systems.\n\"The threat actor has published at least seven packages impersonating widely used Go libraries, including one (github[.]com/shallowmulti/hypert) that appears to target financial-sector developers,\" Socket researcher Kirill Boychenko\nsaid\nin a new report.\n\"These packages share repeated malicious filenames and consistent obfuscation techniques, suggesting a coordinated threat actor capable of pivoting rapidly.\"\nWhile all of them continue to be available on the official package repository, their corresponding GitHub repositories barring \"github[.]com/ornatedoctrin/layout\" are no longer accessible. The list of offending Go packages is below -\nshallowmulti/hypert (github.com/shallowmulti/hypert)\nshadowybulk/hypert (github.com/shadowybulk/hypert)\nbelatedplanet/hypert (github.com/belatedplanet/hypert)\nthankfulmai/hypert (github.com/thankfulmai/hypert)\nvainreboot/layout (github.com/vainreboot/layout)\nornatedoctrin/layout (github.com/ornatedoctrin/layout)\nutilizedsun/layout (github.com/utilizedsun/layout)\nThe counterfeit packages, Socket's analysis found, contain code to achieve remote code execution. This is achieved by running an obfuscated shell command to retrieve and run a script hosted on a remote server (\"alturastreet[.]icu\"). In a likely effort to evade detection, the remote script is not fetched until an hour has elapsed.\nThe end goal of the attack is to install and run an executable file that can potentially steal data or credentials.\nThe disclosure arrived a month after Socket\nrevealed\nanother instance of a software supply chain attack targeting the Go ecosystem via a malicious package capable of granting the adversary remote access to infected systems.\n\"The repeated use of identical filenames, array-based string obfuscation, and delayed execution tactics strongly suggests a coordinated adversary who plans to persist and adapt,\" Boychenko noted.\n\"The discovery of multiple malicious hypert and layout packages, along with multiple fallback domains, points to an infrastructure designed for longevity, enabling the threat actor to pivot whenever a domain or repository is blacklisted or removed.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Open-source tool 'Rayhunter' helps users detect Stingray attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/open-source-tool-rayhunter-helps-users-detect-stingray-attacks/",
        "Summary": "The Electronic Frontier Foundation (EFF) has released a free, open-source tool named Rayhunter that is designed to detect cell-site simulators (CSS), also known as IMSI catchers or Stingrays. [...]",
        "Date": "2025-03-05",
        "Content": "The Electronic Frontier Foundation (EFF) has released a free, open-source tool named Rayhunter that is designed to detect cell-site simulators (CSS), also known as IMSI catchers or Stingrays.\nStingray devices mimic legitimate cell towers to trick phones into connecting, allowing them to capture sensitive data, accurately geolocate users, and potentially intercept communications.\nWith the release of the Rayhunter, EFF seeks to give users the power to detect these instances, allowing them to protect themselves and also help draw a clearer picture of the exact deployment scale of Stingrays.\nHow Rayhunter works\nRayhunter is an open-source tool designed to detect Stingrays by capturing control traffic (signaling data) between the mobile hotspot and the cell tower it is connected to, but without monitoring user activity.\n\"Rayhunter works by intercepting, storing, and analyzing the control traffic (but not user traffic, such as web requests) between the mobile hotspot Rayhunter runs on and the cell tower to which it's connected,\"\nreads EFF's announcement\n.\n\"Rayhunter analyzes the traffic in real-time and looks for suspicious events, which could include unusual requests like the base station (cell tower) trying to\ndowngrade your connection to 2G\nwhich is vulnerable to further attacks, or the base station requesting your IMSI under suspicious circumstances.\"\nCompared to other Stingray detection methods that require rooted Android phones and expensive software-defined radios, Rayhunter runs on a $20 Orbic RC400L mobile hotspot device (portable 4G LTE router).\nEFF chose this hardware for its testing of Rayhunter due to its affordability, widespread availability (Amazon, eBay), and portability, but notes that their software may work well on other Linux/Qualcomm devices too.\nRayhunter running on an Orbic RC400L\nSource: EFF\nWhen Rayhunter detects suspicious network traffic, Orbic's default green/blue screen turns red, informing users of a potential Stingray attack.\nThe users may then access and download the PCAP logs kept on the device to get more information about the incident or use them to support forensic investigations.\nFor more instructions on how to install and use Rayhunter, check out\nEFF's GitHub repository\n.\nThe EFF includes a legal disclaimer noting that the software is likely not illegal to use in the United States. However, before attempting to use this project, it is advisable to check with a lawyer to determine if it's legal to use in your country.\nBleepingComputer has not tested Rayhunter and cannot guarantee its safety or effectiveness, so use it at your own risk.\nRelated Articles:\nAllstate car insurer sued for tracking drivers without permission\nMicrosoft to remove the Location History feature in Windows\nBrave now lets you inject custom JavaScript to tweak websites\nSignal will let you sync old messages when linking new devices\nCloudflare CDN flaw leaks user location data, even through secure chat apps"
    },
    {
        "Title": "Silk Typhoon hackers now target IT supply chains to breach networks",
        "Link": "https://www.bleepingcomputer.com/news/security/silk-typhoon-hackers-now-target-it-supply-chains-to-breach-networks/",
        "Summary": "Microsoft warns that Chinese cyber-espionage threat group 'Silk Typhoon' has shifted its tactics, now targeting remote management tools and cloud services in supply chain attacks that give them access to downstream customers. [...]",
        "Date": "2025-03-05",
        "Content": "Microsoft warns that Chinese cyber-espionage threat group 'Silk Typhoon' has shifted its tactics, now targeting remote management tools and cloud services in supply chain attacks that give them access to downstream customers.\nThe tech giant has confirmed breaches across multiple industries, including government, IT services, healthcare, defense, education, NGOs, and energy.\n\"They [Silk Typhoon] exploit unpatched applications that allow them to elevate their access in targeted organizations and conduct further malicious activities,\"\nreads Microsoft's report\n.\n\"After successfully compromising a victim, Silk Typhoon uses the stolen keys and credentials to infiltrate customer networks where they can then abuse a variety of deployed applications, including Microsoft services and others, to achieve their espionage objectives.\"\nSilk Typhoon storms IT supply chains\nSilk Typhoon is a Chinese state-sponsored espionage group known for\nhacking the U.S. Office of Foreign Assets Control\n(OFAC) office in early December 2024 and\nstealing data\nfrom the Committee on Foreign Investment in the United States (CFIUS).\nMicrosoft reports that Silk Typhoon switched tactics around that period, abusing stolen API keys and compromised credentials for IT providers, identity management, privileged access management, and RMM solutions, which are then used to access downstream customer networks and data.\nMicrosoft says the attackers scan GitHub repositories and other public resources to locate leaked authentication keys or credentials and then use them to breach environments. The threat actors are also known for using password spray attacks to gain access to valid credentials.\nPreviously, the threat actors were primarily leveraging zero-day and n-day flaws in public-facing edge devices to gain initial access, plant web shells, and then move laterally via compromised VPNs and RDPs.\nSwitching from organization-level breaches to MSP-level hacks allows the attackers to move within cloud environments, stealing Active Directory sync credentials (AADConnect), and abusing OAuth applications for a much stealthier attack.\nThe threat actors no longer rely on malware and web shells, with Silk Typhoon now exploiting cloud apps to steal data and then clear logs, leaving only a minimal trace behind.\nAccording to Microsoft's observations, Silk Typhoon continues to exploit vulnerabilities alongside its new tactics, sometimes as zero days, for initial access.\nMost recently, the threat group\nwas observed\nexploiting a critical Ivanti Pulse Connect VPN privilege escalation flaw (CVE-2025-0282) as a zero-day to breach corporate networks.\nEarlier, in 2024, Silk Typhoon exploited CVE-2024-3400, a command injection vulnerability in Palo Alto Networks GlobalProtect, and CVE-2023-3519, a remote code execution flaw in Citrix NetScaler ADC and NetScaler Gateway.\nMicrosoft says the threat actors have created a \"CovertNetwork\" consisting of compromised Cyberoam appliances, Zyxel routers, and QNAP devices, which are used to launch attacks and obfuscate malicious activities.\nMicrosoft has listed updated indicators of compromise and detection rules that reflect Silk Typhoon's latest shift in tactics at the bottom of its report, and defenders are recommended to add the available information to their security tools to detect and block any attacks timely.\nRelated Articles:\nChinese espionage tools deployed in RA World ransomware attack\nIPany VPN breached in supply-chain attack to push custom malware\nMirrorFace hackers targeting Japanese govt, politicians since 2019\nChinese hackers use custom malware to spy on US telecom networks\nNew NailaoLocker ransomware used against EU healthcare orgs"
    },
    {
        "Title": "US charges Chinese hackers linked to critical infrastructure breaches",
        "Link": "https://www.bleepingcomputer.com/news/security/us-charges-chinese-hackers-linked-to-critical-infrastructure-breaches/",
        "Summary": "The US Justice Department has charged Chinese state security officers along with APT27 and i-Soon hackers for network breaches and cyberattacks that have targeted victims globally since 2011. [...]",
        "Date": "2025-03-05",
        "Content": "The US Justice Department has charged Chinese state security officers along with APT27 and i-Soon hackers for network breaches and cyberattacks that have targeted victims globally since 2011.\nTheir victim list includes US federal and state government agencies, foreign ministries of multiple governments in Asia, U.S.-based dissidents, as well as a prominent religious organization in the United States.\n\"These malicious cyber actors, acting as freelancers or as employees of i-Soon, conducted computer intrusions at the direction of the PRC's MPS and Ministry of State Security (MSS) and on their own initiative. The MPS and MSS paid handsomely for stolen data,\" the Justice Department said today.\nToday, the DOJ\ncharged\ntwo MPS officers and eight employees of Anxun Information Technology (also known as i-Soon) with involvement in these attacks and\nseized the domain\nused by i-Soon to advertise its hacker-for-hire services.\nThe State Department is also offering\na reward of up to $10 million\nthrough its Rewards for Justice (RFJ) program for information that could help locate or identify the following defendants:\nWu Haibo (吴海波), Chief Executive Officer\nChen Cheng (陈诚), Chief Operating Officer\nWang Zhe (王哲), Sales Director\nLiang Guodong (梁国栋), Technical Staff\nMa Li (马丽), Technical Staff\nWang Yan (王堰), Technical Staff\nXu Liang (徐梁), Technical Staff\nZhou Weiwei (周伟伟), Technical Staff\nWang Liyu (王立宇), MPS Officer\nSheng Jing (盛晶), MPS Officer\nIndictments unsealed today reveal that i-Soon hackers conducted computer intrusions at the MSS's request. They also independently hacked targets and attempted to sell stolen data to at least 43 MSS or MPS bureaus across 31 Chinese provinces and municipalities.\ni-Soon charged the MSS and MPS between $10,000 and $75,000 for every compromised email inbox and also trained MPS employees.\nReward for information on i-Soon hackers (US State Department)\nChina-based hackers\nYin Kecheng\n(aka YKCAI) and\nZhou Shuai\n(aka Coldface), linked to the state-backed APT27 hacking group,\nwere also charged today\nfor their involvement in this global hacking campaign.\nWhile they're both still at large, the Treasury Department's Office of Foreign Assets Control (OFAC)\nsanctioned them,\nwhile the State Department\nannounced rewards\nof up to $2 million for information leading to their arrests and convictions.\n\"As alleged in court documents, between August 2013 and December 2024, Yin, Zhou, and their co-conspirators exploited vulnerabilities in victim networks, conducted reconnaissance once inside those networks, and installed malware, such as PlugX malware, that provided persistent access,\"\nthe DOJ said on Wednesday\n.\n\"The defendants and their co-conspirators then identified and stole data from the compromised networks by exfiltrating it to servers under their control. Next, they brokered stolen data for sale and provided it to various customers, only some of whom had connections to the PRC government and military.\n\"Between them, Yin and Zhou sought to profit from the hacking of numerous U.S.-based technology companies, think tanks, law firms, defense contractors, local governments, health care systems, and universities, leaving behind them a wake of millions of dollars in damages.\"\nToday's indictments and sanctions are part of a broader effort to combat cyberattacks coordinated by Chinese cybercriminals and state-sponsored hackers.\nIn December, OFAC\nsanctioned Sichuan Silence and one of its employees\nfor involvement in Ragnarok ransomware attacks targeting US critical infrastructure.\nOne month later, it also\ntargeted Chinese cybersecurity company Integrity Tech\nfor its involvement in cyberattacks linked to the Chinese state-sponsored Flax Typhoon hacking group and\nsanctioned Yin Kecheng\nfor his role in last year's breach of the Treasury Department's network.\nRelated Articles:\nUS cracks down on North Korean IT worker army with more sanctions\nTreasury hackers also breached US foreign investments review office\nUS Treasury hack linked to Silk Typhoon Chinese state hackers\nCISA says recent government hack limited to US Treasury\nUS sanctions LockBit ransomware’s bulletproof hosting provider"
    },
    {
        "Title": "BadBox malware disrupted on 500K infected Android devices",
        "Link": "https://www.bleepingcomputer.com/news/security/badbox-malware-disrupted-on-500k-infected-android-devices/",
        "Summary": "The BadBox Android malware botnet has been disrupted again by removing 24 malicious apps from Google Play and sinkholing communications for half a million infected devices. [...]",
        "Date": "2025-03-05",
        "Content": "The BadBox Android malware botnet has been disrupted again by removing 24 malicious apps from Google Play and sinkholing communications for half a million infected devices.\nThe BadBox botnet is a cyber-fraud operation targeting primarily low-cost Android-based devices like TV streaming boxes, tablets, smart TVs, and smartphones.\nThese devices either come pre-loaded with the BadBox malware from the manufacturer or are infected by malicious apps or firmware downloads.\nThe malware then turns the devices into residential proxies, generates fake ad impressions on the infected devices, redirects users to low-quality domains as part of fraudulent traffic distribution operations, and uses people's IPs to create fake accounts and perform credential stuffing attacks.\nLast December, German authorities\ndisrupted the malware\nfor infected devices in the country. However, a few days later, BitSight reported that the malware had been found in at least\n192,000 devices\n, showing resilience against law enforcement action.\nSince then, it is estimated that the botnet has grown to over 1,000,000 infections, impacting Android devices in 222 countries, with most located in Brazil (37.6%), the United States (18.2%), Mexico (6.3%), and Argentina (5.3%).\nSpread of BadBox 2.0 malware\nSource: HUMAN\nNew BadBox disruption\nHUMAN's Satori Threat Intelligence team led the latest disruption operation in collaboration with Google, Trend Micro, The Shadowserver Foundation, and other partners.\nDue to the botnet's sudden size inflation, HUMAN now calls it 'BadBox 2.0,' indicating a new era in its operation.\n\"This scheme impacted\nmore than 1 million consumer devices\n. Devices connected to the BADBOX 2.0 operation included lower-price-point, \"off brand\", uncertified tablets, connected TV (CTV) boxes, digital projectors, and more,\"\nexplains HUMAN\n.\n\"The infected devices are Android Open Source Project devices, not Android TV OS devices or\nPlay Protect certified Android devices\n. All of these devices are manufactured in mainland China and shipped globally; indeed, HUMAN observed BADBOX 2.0-associated traffic from\n222 countries and territories worldwide\n.\"\nHUMAN says it found evidence that the botnet serves and is supported by multiple threat groups with distinct roles or benefits.\nThese groups are SalesTracker (infrastructure management), MoYu (backdoor and botnet development),\nLemon\n(ad fraud campaigns), and LongTV (malicious app development).\nAndroid devices infected with the BadBox malware will routinely connect to attacker-controlled command and control servers to receive new configuration settings and commands to execute on the infected device.\nHUMAN told BleepingComputer that, in partnership with The Shadowserver Foundation, the researchers sinkholed an undisclosed number of BADBOX 2.0 domains to prevent over 500,000 infected devices from communicating with command-and-control (C2) servers set up by threat actors.\nWhen a domain is sinkholed, it is take over by the researchers, allowing them to monitor all connections made by infected devices to that domain and gather data about the botnet. As the infected devices can no longer connect with attacker-controlled domains, the malware is put into a dormant state, effectively disrupting the infection.\nHUMAN says it also discovered 24 Android apps in the official app store, Google Play, that installed the BadBox malware on Android devices. Some apps, like 'Earn Extra Income' and 'Pregnancy Ovulation Calculator' by Seekiny Studio, had over 50,000 downloads each.\nBadBox app on Google Play\nSource: HUMAN\nGoogle removed the apps from Google Play and added a Play Protect enforcement rule to warn users and block the installation of apps associated with BadBox 2.0 on certified Android devices.\nMoreover, the tech giant has terminated publisher accounts that engaged in ad fraud associated with the BadBox operation, preventing monetization through Google Ads.\nHowever, it is important to note that Google cannot disinfect non-Play Protect-certified Android devices sold globally, so while BadBox 2.0 has been disrupted, it has not been eliminated.\nUltimately, as long as consumers buy AOSP-based Android devices like off-brand TV boxes, that lack official Google Play Services support, they are at risk of using hardware pre-loaded with malware.\nA list of devices known to be impacted by the BadBox malware are listed below:\nDevice Model\nDevice Model\nDevice Model\nDevice Model\nTV98\nX96Q_Max_P\nQ96L2\nX96Q2\nX96mini\nS168\nums512_1h10_Natv\nX96_S400\nX96mini_RP\nTX3mini\nHY-001\nMX10PRO\nX96mini_Plus1\nLongTV_GN7501E\nXtv77\nNETBOX_B68\nX96Q_PR01\nAV-M9\nADT-3\nOCBN\nX96MATE_PLUS\nKM1\nX96Q_PRO\nProjector_T6P\nX96QPRO-TM\nsp7731e_1h10_native\nM8SPROW\nTV008\nX96Mini_5G\nQ96MAX\nOrbsmart_TR43\nZ6\nTVBOX\nSmart\nKM9PRO\nA15\nTranspeed\nKM7\niSinbox\nI96\nSMART_TV\nFujicom-SmartTV\nMXQ9PRO\nMBOX\nX96Q\nisinbox\nMbox\nR11\nGameBox\nKM6\nX96Max_Plus2\nTV007\nQ9 Stick\nSP7731E\nH6\nX88\nX98K\nTXCZ\nIn response to the disruption, Google shared the following statement with BleepingComputer.\n\"We appreciate collaborating with HUMAN to take action against the BADBOX operation and protect consumers from fraud. The infected devices are Android Open Source Project devices, not Android TV OS devices or Play Protect certified Android devices,\" says Shailesh Saini, Google's Director of Android Security & Privacy Engineering & Assurance.\n\"If a device isn't Play Protect certified, Google doesn't have a record of security and compatibility test results. Play Protect certified Android devices undergo extensive testing to ensure quality and user safety. Users should ensure Google Play Protect, Android's malware protection that is on by default on devices with Google Play Services, is enabled.\"\nIf you own any of the above devices, it is likely that you will not be able to get clean firmware for them.\nInstead, these devices should be replaced with those from reputable brands. If it is impossible to replace the device, they should be disconnected from the Internet.\nRelated Articles:\nVo1d malware botnet grows to 1.6 million Android TVs worldwide\nSpyLend Android malware downloaded 100,000 times from Google Play\nGoogle blocked 2.36 million risky Android apps from Play Store in 2024\nNew Eleven11bot botnet infects 86,000 devices for DDoS attacks\nGoogle expands Android AI scam detection to more Pixel devices"
    },
    {
        "Title": "YouTube warns of AI-generated video of its CEO used in phishing attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/youtube-warns-of-ai-generated-video-of-its-ceo-used-in-phishing-attacks/",
        "Summary": "YouTube warns that scammers are using an AI-generated video featuring the company's CEO in phishing attacks to steal creators' credentials. [...]",
        "Date": "2025-03-05",
        "Content": "YouTube warns that scammers are using an AI-generated video featuring the company's CEO in phishing attacks to steal creators' credentials.\nThe attackers are sharing it as a private video with targeted users via emails claiming YouTube is changing its monetization policy.\n\"We're aware that phishers have been sharing private videos to send false videos, including an AI generated video of YouTube’s CEO Neal Mohan announcing changes in monetization,\" the online video sharing platform\nwarned in a pinned post\non its official community website.\n\"YouTube and its employees will never attempt to contact you or share information through a private video. If a video is shared privately with you claiming to be from YouTube, the video is a phishing scam.\"\nIronically, the phishing emails also warn that YouTube will never share information or contact users via private videos, prompting the recipients to report the channel sending the emails if they look suspicious.\nThe description of\nthe video linked in the phishing emails\nasked those who open it to click a link that brings them to a page (studio.youtube-plus[.]com) where they're asked to \"confirm the updated YouTube Partner Program (YPP) terms to continue monetizing your content and accessing all features\" by signing into their account. However, this page is designed to steal their credentials instead.\nPhishing landing page (BleepingComputer)\nThe scammers also create a sense of urgency by threatening that their accounts will be restricted for seven days if they fail to confirm compliance with the new rules (these restrictions would allegedly include uploading new videos, editing old videos, receiving monetization, and receiving earned monetization funds).\nAfter entering their credentials, creators are told their \"channel is now pending\" and to \"open the document in the video description for all the necessary information\" (even when entering a random email and password).\nYouTube users have been receiving such emails\nsince late January\nwhile the YouTube team says it began investigating this campaign\nin mid-February\n.\nYouTube warns not to click links embedded in these emails, as they will likely redirect them to phishing sites that attempt to steal their credentials or infect them with malware.\n\"Many phishers actively target Creators by trying to find ways to impersonate YouTube by exploiting in-platform features to link to malicious content,\" the company added. \"Please always be aware and make sure not to open untrusted links or files!\"\nHowever, many creators have already fallen victim to these attacks, reporting that the\nscammers hijacked their channels\nand used them to broadcast live cryptocurrency scam streams.\nYouTube provides tips on avoiding and reporting phishing emails\nin its help center\nand more details on\nsimilar phishing campaigns\n.\nSince August 2024,\nYouTube has also provided a new support assistant\nto help users recover and secure hacked YouTube accounts after getting hacked.\nRelated Articles:\nMicrosoft Teams phishing attack alerts coming to everyone next month\nNew ClickFix attack deploys Havoc C2 via Microsoft Sharepoint\nMicrosoft names cybercriminals behind AI deepfake network\nOpenAI's GPT 4.5 spotted in Android beta, launch imminent\nEncryptHub breaches 618 orgs to deploy infostealers, ransomware"
    },
    {
        "Title": "Look up: The new frontier of cyberthreats is in the sky",
        "Link": "https://www.bleepingcomputer.com/news/security/look-up-the-new-frontier-of-cyberthreats-is-in-the-sky/",
        "Summary": "With  increased unidentified drone sightings worldwide, some are concerned they pose a cybersecurity risk. Learn more from Acronis about these risks and a real attack on a Taiwan drone manufacturer. [...]",
        "Date": "2025-03-05",
        "Content": "In November 2024, a series of unidentified\ndrones appeared over New Jersey\n. This wasn’t the stuff of UFO enthusiasts or conspiracy theorists. The drones were real, and reported by citizens, law enforcement officers and members of the U.S. military.\nWithin a few weeks, sightings spread into New England, New York and Pennsylvania. Drones started to appear in restricted military airspace. The military said it wasn’t operating the drones but that they didn’t pose a threat.\nIn late January 2025, the\nWhite House sent a similar message\n, noting that the New Jersey drones were “authorized to be flown by the Federal Aviation Administration (FAA) for research and various other reasons.”\nConcerns over unidentified drones persist\nStill, concerns over drones remain; so much so that the chief of the North American Aerospace Defense Command (NORAD) told lawmakers in February that\nthe Pentagon needed more resources to deal with drones\nflying over U.S. military installations.\n“The primary threat I see for them in the way they’ve been operating is detection and perhaps surveillance of sensitive capabilities on our installations,” NORAD chief Gen. Gregory Guillot said during a Senate Armed Services Committee hearing.\nSo, there are enough unidentified and suspicious drones that people with real power to make decisions are paying close attention to them. The issue is also global. In January, the German cabinet approved a plan to\nshoot down drones\nthat flew over their military installations.\nAttackers target drone manufacturers in Taiwan\nThere is reason to worry given the example of a\nstory out of Taiwan\n. Attackers there used malware to spy on drone manufacturers’ corporate computers and likely exfiltrate data. Taiwan is home to some of the world’s most advanced drone makers, and drone production on the island has ramped up significantly since 2022.\nThe attackers used a dynamic-link library (DLL) sideloading technique to install a persistent backdoor with complex functionality on infected systems. They brought three files to the system: a legitimate copy of Microsoft Word 2010, a signed wwlib.dll file and a file with a random name and file extension.\nThe attackers used Microsoft Word to sideload the malicious wwlib DLL. The DLL acts as a loader for the actual payload, which resides inside the encrypted file with a random name.\nExecution chain of backdoor\nSource: Acronis\nWith command and control capabilities installed as part of the breach, attackers gained access to company PCs within drone manufacturers. What’s particularly interesting is how attackers managed to enter a victim’s system: probably through enterprise resource planning (ERP) software.\nThe first appearance of the malicious files was inside the folder of a popular Taiwanese ERP software called Digiwin. The Acronis Threat Research Unit (TRU) found evidence of multiple components of Digiwin deployed in target environments. Digiwin, established in Taiwan but now based in mainland China, is the leader in Taiwan’s ERP market.\nAttackers replaced Digiwin’s original Update.exe execution file with Winword.exe. Update.exe is part of Digiwin’s auto update workflow, but attackers caused it to launch Microsoft Word 2010 instead, which loaded a backdoor that could carry out malicious actions.\nSome of Digiwin’s components contain known vulnerabilities, and it seems very likely that exploitation or a supply chain attack originated in the ERP software.\nWhy Taiwan?\nIn August 2022\n, drone manufacturing in Taiwan got a jumpstart. Taiwan’s central government opened UAV AI Innovation Application R&D Center in Chiayi County and offered a NT$50 million tender for 3,000 commercial-grade drones to be used for military applications.\nThe race was on. There are now about a dozen companies in Taiwan participating in drone manufacturing, and even more when taking into account the island’s global aerospace industry.\nTaiwan’s allegiance to the U.S. and strong technological background make the island a prime target for adversaries interested in military espionage or\nsupply chain attacks\n.\nThe extreme growth of the drone industry in the past decade also had an unfortunate side effect: even consumer models are used for military purposes now. They are capable of carrying smaller weapons, as footage reveals from ongoing conflicts around the world.\nAn investigation into the attacks revealed the use of a long-lasting digital certificate from a company based in Taiwan. All command and control servers, as well as all the companies targeted, were located in Taiwan. As such, it seems likely that this strain of drone attacks is a highly sophisticated, targeted attack with careful planning and execution by the threat actors.\nThe Taiwan attacks demonstrate that American officials and other global watchdogs worried about unidentified drones have legitimate concerns. With drone manufacturers under attack, vigilance isn’t just a good idea. It’s a necessity.\nAbout TRU\nThe\nAcronis Threat Research Unit (TRU)\nis a team of cybersecurity experts specializing in threat intelligence, AI and risk management.\nThe TRU team researches emerging threats, provides security insights, and supports IT teams with guidelines, incident response and educational workshops.\nSee the latest TRU research\nSponsored and written by\nAcronis\n."
    },
    {
        "Title": "Toronto Zoo shares update on last year's ransomware attack",
        "Link": "https://www.bleepingcomputer.com/news/security/toronto-zoo-shares-update-on-last-years-ransomware-attack/",
        "Summary": "The Toronto Zoo, the largest zoo in Canada, has provided more information about the data stolen during a ransomware attack in January 2024. [...]",
        "Date": "2025-03-05",
        "Content": "The Toronto Zoo, the largest zoo in Canada, has provided more information about the data stolen during a ransomware attack in January 2024.\nIn a final notification regarding the cyberattack, the\nToronto Zoo said\nthe resulting data breach impacts varying combinations of personal and financial information belonging to employees, former employees, volunteers, and donors.\nThe exposed information includes transaction data such as impacted individuals' names, street address information, phone numbers, and e-mail addresses. It also contains the last four digits of credit card numbers and associated expiration dates for guests and members who made credit card transactions between January 2022 and April 2023.\n\"The data includes information about all guests and members who engaged the following types of transactions between 2000 to April 2023: general admission and membership purchases,\" it said.\nThe zoo\ndisclosed the incident on January 8\n, saying the attack did not impact the animals' well-being or day-to-day operations.\nToronto Zoo has reported the data breach to the Office of the Information and Privacy Commissioner of Ontario (the IPC) and advises those affected to monitor financial account statements for suspicious activity.\nAttack claimed by Akira ransomware\nWhile Toronto Zoo has not officially linked the incident to a specific threat actor or hacking group, the Akira ransomware operation claimed the breach in January 2024 and has since published the allegedly stolen data on their dark web leak site.\nAkira claims they've stolen 133GB of files from the zoo's compromised file server, including database backups, ticket information, and other user data.\nIn early February, the cybercrime gang started seeding a torrent file containing multiple archives containing over 35GB of this data.\nTorontoZoo entry on Akira's leak site (BleepingComputer)\n\"Lots of NDAs and confidential agreements are represented in the data. Some personal files (driver licenses and so on) can be found in the files. And of course, lots of interesting info about animals,\" the ransomware group says on its leak site.\n​Akira\nemerged two years ago\n, in March 2023, and has quickly gained notoriety after adding a long string of victims worldwide across various industry verticals.\nBased on negotiation chats seen by BleepingComputer, Akira demands ransoms ranging from $200,000 to millions of dollars, depending on the size of the compromised organization.\nSo far, Akira has claimed multiple high-profile victims, including\nStanford University\n,\nNissan Oceania\n, and\nNissan Australia\n. Since it surfaced, the gang has added over 300 organizations to its dark web leak site.\nAccording to an FBI advisory\n, Akira ransomware operators have breached over 250 organizations and collected roughly $42 million in ransom payments until April 2024.\nRelated Articles:\nFake BianLian ransom notes mailed to US CEOs in postal mail scam\nMicrosoft Teams tactics, malware connect Black Basta, Cactus ransomware\nNew Cactus ransomware encrypts itself to evade antivirus\nHunters International ransomware claims attack on Tata Technologies\nQilin ransomware claims attack at Lee Enterprises, leaks stolen data"
    },
    {
        "Title": "Fake BianLian ransom notes mailed to US CEOs in postal mail scam",
        "Link": "https://www.bleepingcomputer.com/news/security/fake-bianlian-ransom-notes-mailed-to-us-ceos-in-postal-mail-scam/",
        "Summary": "Scammers are impersonating the BianLian ransomware gang in fake ransom notes sent to US companies via snail mail through the United States Postal Service. [...]",
        "Date": "2025-03-05",
        "Content": "Scammers are impersonating the BianLian ransomware gang in fake ransom notes sent to US companies via snail mail through the United States Postal Service.\nThe fake ransom notes were first reported by\nGuidepoint Security\ntoday, with BleepingComputer later being sent a scan of the note from a CEO who received the same letter.\nThe envelopes for these ransom notes claim to be from the \"BIANLIAN Group\" and have a return address located in an office building in Boston, Massachusets:\nBIANLIAN GROUP\r\n24 FEDERAL ST, SUITE 100\r\nBOSTON, MA 02110\nIn the letter shared with BleepingComputer, the envelope shows it was mailed on February 25th, 2025. This mailing date is the same as the one seen by Arctic Wolf, who\nalso reported\non the scam today.\nThe letters are being mailed to the CEO of the companies at their corporate mailing address and show that they were processed through a postal facility in Boston, with the envelope marked, \"Time Sensitive Read Immediately.\"\nEnvelope for fake BianLian ransom  note\nSource: BleepingComputer\nThe envelopes contain a ransom note addressed to the company's CEO or another executive, claiming to be from the BianLian ransomware operation. According to notes reviewed by BleepingComputer, they are tailored to the company's industry, with different types of allegedly stolen data corresponding to the company's activities.\nFor example, fake BianLian ransom notes sent to healthcare companies claim that patient and employee information was stolen, while those targeting product-based businesses allege the exposure of customer orders and employee data.\n\"I regret to inform you that we have gained access to [REDACTED] systems and over the past several weeks have exported thousands of data files, including customer order and contact information, employee information with IDs, SSNs, payroll reports, and other sensitive HR documents, company financial documents, legal documents, investor and shareholder information, invoices, and tax documents,\" reads a fake BianLian ransom note.\nFake BianLian ransom note sent via snail mail\nSource: GuidePoint Security\nThe mailed ransom notes are very different from BianLian's, but the scammers attempt to make them look convincing by including the real Tor data leak sites for the ransomware operation in the notes.\nHowever, unlike typical ransomware demands, these fake notes state that BianLian is no longer negotiating with victims. Instead, the victim has 10 days to make a Bitcoin payment to prevent data from being leaked.\nEach ransom note includes a ransom demand ranging between $250,000 and $500,000, a freshly generated Bitcoin address to send payment, and a QR code for the Bitcoin address.\nArctic Wolf said that all healthcare organizations had their ransom demand set to $350,000, which is the same as the one shared by a healthcare company with BleepingComputer, as shown below.\nPayment information in fake BianLian ransom note\nSource: BleepingComputer\nFurthermore, Arctic Wolf states that two ransom notes the researchers saw included legitimate compromised passwords to add legitimacy to the demand.\n\"In at least two letters, the threat actor included a compromised password within the How did this happen? section, almost certainly in an attempt to add legitimacy to their claim.\" explained Arctic Wolf.\nThe consensus in the reports is that these ransom notes are fake and are only designed to scare executives into paying a ransom, as there are no signs of an actual breach.\n\"While GRIT cannot confirm the identity of the letter's authors at this time, we assess with a high level of confidence that the extortion demands contained within are illegitimate and do not originate from the BianLian ransomware group,\" explains GuidePoint Security researcher Grayson North.\nHowever, this does not mean the emails should be ignored. Due to the widespread mailing of these notes, all IT and security admins should notify executives about the scam so that they are aware and do not waste time and resources worrying about them.\nThese fake ransom notes are an evolution of the\nemail extortion scams\nthat have become so popular since 2018. However, instead of targeting personal emails, they are now targeting the CEOs of corporations.\nBleepingComputer contacted the BianLian ransomware operation to see if they were involved with these mailings, but a reply was not immediately available.\nRelated Articles:\nHunters International ransomware claims attack on Tata Technologies\nQilin ransomware claims attack at Lee Enterprises, leaks stolen data\nSarcoma ransomware claims breach at giant PCB maker Unimicron\nRansomware payments fell by 35% in 2024, totalling $813,550,000\nMizuno USA says hackers stayed in its network for two months"
    },
    {
        "Title": "China's Silk Typhoon APT Shifts to IT Supply Chain Attacks",
        "Link": "https://www.darkreading.com/remote-workforce/china-silk-typhoon-it-supply-chain-attacks",
        "Summary": "The nation-state threat group has been breaching providers of remote management tools, identity management providers, and other IT companies to access networks of targeted entities, according to Microsoft.",
        "Date": "2025-03-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/china-silk-typhoon-it-supply-chain-attacks"
    },
    {
        "Title": "Qualcomm, MediaTek Release Security Fix Bonanza",
        "Link": "https://www.darkreading.com/remote-workforce/qualcomm-mediatek-security-fix-bonanza",
        "Summary": "The chipmakers patched bugs, mostly critical and high severity, that affect everything from smartphones to TVs to artificial intelligence platforms.",
        "Date": "2025-03-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/qualcomm-mediatek-security-fix-bonanza"
    },
    {
        "Title": "'Crafty Camel' APT Targets Aviation, OT With Polygot Files",
        "Link": "https://www.darkreading.com/ics-ot-security/crafty-camel-apt-aviation-ot-polygot-files",
        "Summary": "The Iran-linked nation-state group made its debut with a stealthy, sophisticated, and laser-focused cyber-espionage attack on targets in UAE.",
        "Date": "2025-03-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/ics-ot-security/crafty-camel-apt-aviation-ot-polygot-files"
    },
    {
        "Title": "Bogus 'BianLian' Gang Sends Snail-Mail Extortion Letters",
        "Link": "https://www.darkreading.com/threat-intelligence/bogus-bianlian-snail-mail-extortion-letters",
        "Summary": "The letters mimic typical ransom notes and threaten to delete or leak compromised data if payments aren't made, though none of the organizations that received them had active ransomware attacks.",
        "Date": "2025-03-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/bogus-bianlian-snail-mail-extortion-letters"
    },
    {
        "Title": "Why Security Leaders Are Opting for Consulting Gigs",
        "Link": "https://www.darkreading.com/cybersecurity-operations/why-security-leaders-opting-consulting-gigs",
        "Summary": "Many CISOs are weighing the benefits of going virtual as a consultant. Can the pendulum swing in the other direction?",
        "Date": "2025-03-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/why-security-leaders-opting-consulting-gigs"
    },
    {
        "Title": "Black Basta Pivots to Cactus Ransomware Group",
        "Link": "https://www.darkreading.com/threat-intelligence/black-basta-pivots-cactus-ransomware-group",
        "Summary": "The future of the formerly fearsome cybercriminal group remains uncertain as key members have moved to a new affiliation, in fresh attacks that use novel persistence malware BackConnect.",
        "Date": "2025-03-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/black-basta-pivots-cactus-ransomware-group"
    },
    {
        "Title": "'Cocktail of Cyber-Risk' Should Stir Concerns Among CISOs",
        "Link": "https://www.darkreading.com/cyber-risk/thinking-outside-box-cyber-risk",
        "Summary": "A global report published by the World Economic Forum points to a new &quot;world order characterized by greater instability, polarizing narratives, eroding trust, and insecurity.",
        "Date": "2025-03-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/thinking-outside-box-cyber-risk"
    },
    {
        "Title": "US Indicts China’s iSoon ‘Hackers-for-Hire’ Operatives",
        "Link": "https://www.securityweek.com/us-indicts-chinas-isoon-hackers-for-hire-operatives/",
        "Summary": "<p>i-Soon employees charged with conducting extensive hacking campaigns on behalf of Beijing’s security services.</p>\n<p>The post <a href=\"https://www.securityweek.com/us-indicts-chinas-isoon-hackers-for-hire-operatives/\">US Indicts China’s iSoon ‘Hackers-for-Hire’ Operatives </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-03-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/us-indicts-chinas-isoon-hackers-for-hire-operatives/"
    },
    {
        "Title": "Organizations Still Not Patching OT Due to Disruption Concerns: Survey",
        "Link": "https://www.securityweek.com/organizations-still-not-patching-ot-due-to-disruption-concerns-survey/",
        "Summary": "<p>Cyber-physical systems security company TXOne Networks has published its 2024 Annual OT/ICS Cybersecurity Report.</p>\n<p>The post <a href=\"https://www.securityweek.com/organizations-still-not-patching-ot-due-to-disruption-concerns-survey/\">Organizations Still Not Patching OT Due to Disruption Concerns: Survey</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-03-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/organizations-still-not-patching-ot-due-to-disruption-concerns-survey/"
    },
    {
        "Title": "SpecterOps Scores $75M Series B to Scale BloodHound Enterprise Platform",
        "Link": "https://www.securityweek.com/specterops-scores-75m-series-b-to-scale-bloodhound-enterprise-platform/",
        "Summary": "<p>SpecterOps has raised an unusually large $75 million Series B funding round to accelerate the growth of its BloodHound Enterprise platform. </p>\n<p>The post <a href=\"https://www.securityweek.com/specterops-scores-75m-series-b-to-scale-bloodhound-enterprise-platform/\">SpecterOps Scores $75M Series B to Scale BloodHound Enterprise Platform </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-03-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/specterops-scores-75m-series-b-to-scale-bloodhound-enterprise-platform/"
    },
    {
        "Title": "China Hackers Behind US Treasury Breach Caught Targeting IT Supply Chain",
        "Link": "https://www.securityweek.com/china-hackers-behind-us-treasury-breach-caught-targeting-it-supply-chain/",
        "Summary": "<p>Silk Typhoon APT caught using IT supply chain entry points to conduct reconnaissance, siphon data, and move laterally on victim networks.</p>\n<p>The post <a href=\"https://www.securityweek.com/china-hackers-behind-us-treasury-breach-caught-targeting-it-supply-chain/\">China Hackers Behind US Treasury Breach Caught Targeting IT Supply Chain</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-03-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/china-hackers-behind-us-treasury-breach-caught-targeting-it-supply-chain/"
    },
    {
        "Title": "Iranian Hackers Target UAE Firms With Polyglot Files",
        "Link": "https://www.securityweek.com/iranian-hackers-target-uae-firms-with-polyglot-files/",
        "Summary": "<p>An Iranian threat actor was seen targeting UAE organizations with polyglot files to deliver a new backdoor named Sosano.</p>\n<p>The post <a href=\"https://www.securityweek.com/iranian-hackers-target-uae-firms-with-polyglot-files/\">Iranian Hackers Target UAE Firms With Polyglot Files</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-03-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/iranian-hackers-target-uae-firms-with-polyglot-files/"
    },
    {
        "Title": "North Korean Fake IT Workers Pose as Blockchain Developers on GitHub",
        "Link": "https://www.securityweek.com/north-korean-fake-it-workers-pose-as-blockchain-developers-on-github/",
        "Summary": "<p>North Korean fake IT workers are creating personas on GitHub to land blockchain developer jobs at US and Japanese firms.</p>\n<p>The post <a href=\"https://www.securityweek.com/north-korean-fake-it-workers-pose-as-blockchain-developers-on-github/\">North Korean Fake IT Workers Pose as Blockchain Developers on GitHub</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-03-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/north-korean-fake-it-workers-pose-as-blockchain-developers-on-github/"
    },
    {
        "Title": "Two Venezuelans Arrested in US for ATM Jackpotting",
        "Link": "https://www.securityweek.com/two-venezuelans-arrested-in-us-for-atm-jackpotting/",
        "Summary": "<p>Several Venezuelans have been arrested and charged in the US in recent months for their role in ATM jackpotting schemes.</p>\n<p>The post <a href=\"https://www.securityweek.com/two-venezuelans-arrested-in-us-for-atm-jackpotting/\">Two Venezuelans Arrested in US for ATM Jackpotting</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-03-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/two-venezuelans-arrested-in-us-for-atm-jackpotting/"
    },
    {
        "Title": "Ransomware Group Claims Attack on Tata Technologies",
        "Link": "https://www.securityweek.com/ransomware-group-claims-attack-on-tata-technologies/",
        "Summary": "<p>Notorious ransomware group Hunters International threatens to leak 1.4 TB of data allegedly stolen from Tata Technologies.</p>\n<p>The post <a href=\"https://www.securityweek.com/ransomware-group-claims-attack-on-tata-technologies/\">Ransomware Group Claims Attack on Tata Technologies</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-03-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/ransomware-group-claims-attack-on-tata-technologies/"
    },
    {
        "Title": "Chrome 134, Firefox 136 Patch High-Severity Vulnerabilities",
        "Link": "https://www.securityweek.com/chrome-134-firefox-136-patch-high-severity-vulnerabilities/",
        "Summary": "<p>Chrome 134 and Firefox 136 are rolling out across desktop and mobile with patches for multiple high-severity vulnerabilities.</p>\n<p>The post <a href=\"https://www.securityweek.com/chrome-134-firefox-136-patch-high-severity-vulnerabilities/\">Chrome 134, Firefox 136 Patch High-Severity Vulnerabilities</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-03-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chrome-134-firefox-136-patch-high-severity-vulnerabilities/"
    },
    {
        "Title": "Knostic Secures $11 Million to Rein in Enterprise AI Data Leakage, Oversharing",
        "Link": "https://www.securityweek.com/knostic-secures-11-million-to-rein-in-enterprise-ai-data-leakage-oversharing/",
        "Summary": "<p>Knostic provides a “need-to-know” filter on the answers generated by enterprise large language models (LLM) tools.</p>\n<p>The post <a href=\"https://www.securityweek.com/knostic-secures-11-million-to-rein-in-enterprise-ai-data-leakage-oversharing/\">Knostic Secures $11 Million to Rein in Enterprise AI Data Leakage, Oversharing </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-03-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/knostic-secures-11-million-to-rein-in-enterprise-ai-data-leakage-oversharing/"
    }
]