[
    {
        "Title": "Mozilla Updates Firefox Terms Again After Backlash Over Broad Data License Language",
        "Link": "https://thehackernews.com/2025/03/mozilla-updates-firefox-terms-again.html",
        "Summary": "Firefox browser maker Mozilla on Friday updated its Terms of Use a second time within a week following criticism overbroad language that appeared to give the company the rights to all information uploaded by users.\nThe revised Terms of Use now states -\nYou give Mozilla the rights necessary to operate Firefox. This includes processing your data as we describe in the Firefox Privacy Notice. It",
        "Date": "2025-03-01",
        "Content": "Firefox browser maker Mozilla on Friday updated its Terms of Use a second time within a week\nfollowing\ncriticism\noverbroad language that appeared to give the company the rights to all information uploaded by users.\nThe\nrevised\nTerms of Use now states -\nYou give Mozilla the rights necessary to operate Firefox. This includes processing your data as we describe in the Firefox\nPrivacy Notice\n. It also includes a nonexclusive, royalty-free, worldwide license for the purpose of doing as you request with the content you input in Firefox. This does not give Mozilla any ownership in that content.\nA previous version of this clause, which went into effect on February 26, said -\nWhen you upload or input information through Firefox, you hereby grant us a nonexclusive, royalty-free, worldwide license to use that information to help you navigate, experience, and interact with online content as you indicate with your use of Firefox.\nThe development came days after the company\nintroduced\na Terms of Use for Firefox for the first time, along with an updated\nPrivacy Notice\nthat aims to give users more transparency in its data practices.\n\"We've been listening to some of our community's concerns with parts of the TOU, specifically about licensing,\" Ajit Varma, VP of Product at Mozilla,\nsaid\nin a statement. \"Our intent was just to be as clear as possible about how we make Firefox work, but in doing so we also created some confusion and concern.\"\nMozilla emphasized that it doesn't sell or buy data about its users, and that it made the changes because certain jurisdictions define the term \"sell\" more broadly than others, incorporating the various ways by which a consumer's personal information changes hands with another party in exchange for monetary or other benefits.\nOn top of that, it said it already collects and shares some data with its partners from optional ads served on New Tab and\nsponsored suggestions\nin the search bar as a means to stay \"commercially viable.\"\nMozilla also pointed out that while it does not access users' conversations with third-party artificial intelligence (AI) chatbots enabled via the sidebar (and through a shortcut), it does gather technical and interaction data on how this feature is used to help improve the Firefox browser.\nThis includes how often each third-party chatbot provider is chosen, how often suggested prompts are used, and the length of selected text.\n\"Whenever we share data with our partners, we put a lot of work into making sure that the data that we share is stripped of potentially identifying information, or shared only in the aggregate, or is put through our privacy preserving technologies (like OHTTP),\" Varma said.\nThe pushback against Mozilla's Terms of Use follows Google's new\nad tracking policy\nthat has drawn scrutiny from regulators and watchdogs who say it raises privacy concerns.\nThe\nAds platforms program policies\n, which went live on February 16, 2025, allow the use of IP addresses to fingerprint users and reach them across platforms without the need to re-identify them. The U.K. Information Commissioner' Office (ICO) has called it an \"irresponsible\" change.\n\"Organisations seeking to deploy fingerprinting techniques for advertising will need to demonstrate how they are complying with the requirements of data protection law,\" ICO\nsaid\nin a statement. \"These include providing users with transparency, securing freely-given consent, ensuring fair processing and upholding information rights such as the right to erasure.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Ransomware gangs exploit Paragon Partition Manager bug in BYOVD attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/ransomware-gangs-exploit-paragon-partition-manager-bug-in-byovd-attacks/",
        "Summary": "Microsoft had discovered five Paragon Partition Manager BioNTdrv.sys driver flaws, with one used by ransomware gangs in zero-day attacks to gain SYSTEM privileges in Windows. [...]",
        "Date": "2025-03-01",
        "Content": "Microsoft had discovered five Paragon Partition Manager BioNTdrv.sys driver flaws, with one used by ransomware gangs in zero-day attacks to gain SYSTEM privileges in Windows.\nThe vulnerable drivers were exploited in 'Bring Your Own Vulnerable Driver' (BYOVD) attacks where threat actors drop the kernel driver on a targeted system to elevate privileges.\n\"An attacker with local access to a device can exploit these vulnerabilities to escalate privileges or cause a denial-of-service (DoS) scenario on the victim's machine,\" explains a warning from CERT/CC.\n\"Additionally, as the attack involves a Microsoft-signed Driver, an attacker can leverage a Bring Your Own Vulnerable Driver (BYOVD) technique to exploit systems even if Paragon Partition Manager is not installed. \"\nAs BioNTdrv.sys is a kernel-level driver, threat actors can exploit vulnerabilities to execute commands with the same privileges as the driver, bypassing protections and security software.\nMicrosoft researchers discovered all five flaws, noting that one of them, CVE-2025-0289, is leveraged in attacks by ransomware groups. However, the researchers did not disclose what ransomware gangs were exploiting the flaw as a zero-day.\n\"Microsoft has observed threat actors (TAs) exploiting this weakness in BYOVD ransomware attacks, specifically using CVE-2025-0289 to achieve privilege escalation to SYSTEM level, then execute further malicious code,\"\nreads the CERT/CC bulletin\n.\n\"These vulnerabilities have been patched by both Paragon Software, and vulnerable BioNTdrv.sys versions blocked by Microsoft's Vulnerable Driver Blocklist.\"\nThe Paragon Partition Manager flaws discovered by Microsoft are:\nCVE-2025-0288\n– Arbitrary kernel memory write caused by the improper handling of the 'memmove' function, allowing attackers to write to kernel memory and escalate privileges.\nCVE-2025-0287\n– Null pointer dereference arising from a missing validation of a 'MasterLrp' structure in the input buffer, enabling the execution of arbitrary kernel code.\nCVE-2025-0286\n– Arbitrary kernel memory write caused by the improper validation of user-supplied data lengths, allowing attackers to execute arbitrary code.\nCVE-2025-0285\n– Arbitrary kernel memory mapping caused by the failure to validate user-supplied data, enabling privilege escalation by manipulating kernel memory mappings.\nCVE-2025-0289\n– Insecure kernel resource access caused by the failure to validate the 'MappedSystemVa' pointer before passing it to 'HalReturnToFirmware,' leading to potential compromise of system resources.\nThe first four vulnerabilities impact Paragon Partition Manager versions 7.9.1 and previous, while CVE-2025-0298, the actively exploited flaw, impacts version 17 and older.\nUsers of the software are recommended to upgrade to the latest version, which contains BioNTdrv.sys version 2.0.0, which addresses all of the mentioned flaws.\nHowever, it's important to note that even users who don't have Paragon Partition Manager installed are not safe from attacks. BYOVD tactics don't rely on the software being present on the target's machine.\nInstead, threat actors include the vulnerable driver with their own tools, allowing them to load it into Windows and escalate privileges.\nMicrosoft has updated its 'Vulnerable Driver Blocklist' to block the driver from loading in Windows, so users and organizations should verify the protection system is active.\nYou can check if the blocklist is enabled by going to\nSettings\n→\nPrivacy & security\n→\nWindows Security\n→\nDevice security\n→\nCore isolation\n→\nMicrosoft Vulnerable Driver Blocklist\nand making sure the setting is enabled.\nWindows setting for vulnerable drivers blocklist\nSource: BleepingComputer\nA warning on Paragon Software's site also warns that users must upgrade Paragon Hard Disk Manager by today, as it utilizes the same driver, which will be blocked by Microsoft today.\nWhile it is unclear what ransomware gangs are exploiting the Paragon flaw, BYOVD attacks have become increasingly popular among cybercriminals as they allow them to easily gain SYSTEM privileges on Windows devices.\nThreat actors known to be utilizing BYOVD attacks include\nScattered Spider\n,\nLazarus\n,\nBlackByte ransomware\n,\nLockBit ransomware\n, and many more.\nFor this reason, it is important to enable the Microsoft Vulnerable Driver Blocklist feature to prevent vulnerable drivers from being used on your Windows devices.\nRelated Articles:\nGoogle fixes Android kernel zero-day exploited in attacks\nMicrosoft fixes Power Pages zero-day bug exploited in attacks\nHackers use Windows RID hijacking to create hidden admin account\nQilin ransomware claims attack at Lee Enterprises, leaks stolen data\nSerbian police used Cellebrite zero-day hack to unlock Android phones"
    },
    {
        "Title": "U.S. recovers $31 million stolen in 2021 Uranium Finance hack",
        "Link": "https://www.bleepingcomputer.com/news/cryptocurrency/us-recovers-31-million-stolen-in-2021-uranium-finance-hack/",
        "Summary": "U.S. authorities recovered $31 million in cryptocurrency stolen in 2021 cyberattacks on Uranium Finance, a Binance Smart Chain-based DeFi protocol. [...]",
        "Date": "2025-03-01",
        "Content": "U.S. authorities recovered $31 million in cryptocurrency stolen in 2021 cyberattacks on Uranium Finance, a Binance Smart Chain-based DeFi protocol.\nUranium Finance was a decentralized finance (DeFi) protocol built on Binance's BNB Chain that operated as an automated market maker (AMM) similar to Uniswap.\nThe platform\nlaunched in April 2021\n, but hackers quickly exploited vulnerabilities in its smart contracts to drain its assets and push it to premature death, causing millions in investor losses.\nBlockchain intelligence firm TRM Labs reported today that it has aided the Southern District of New York (SDNY) and Homeland Security Investigations (HSI) San Diego in tracking and recovering the stolen assets, resulting in one of the most significant retrievals in recent years.\n\"In February 2023, TRM worked closely with law enforcement to meticulously trace the movement of stolen assets across multiple blockchains, identifying key laundering patterns and generating actionable intelligence for law enforcement,\"\nreads the TRM Labs report\n.\n\"By March 2023, the team had mapped out the attackers' attempts to obfuscate their funds, linking them to Tornado Cash transactions and cross-chain swaps.\"\n\"As a result, law enforcement was able to successfully seize USD 31 million in outstanding funds in February 2025.\"\nStolen money trace\nSource: TRM Labs\nThe funds were stolen in two attacks, both in April 2021, resulting in losses of over $53,700,000.\nThe first attack, from April 6, 2021, exploited a vulnerability in the reward distribution system, leading to a $1.4 million theft.\nThe hacker later returned $1 million, keeping $385,500, which was laundered via Tornado Cash.\nThe second attack took place on April 28, 2021, and leveraged a single-character coding error in Uranium Finance's trading logic, allowing attackers to steal $52 million by manipulating balances.\nThe stolen funds were laundered through decentralized exchanges, converted into various cryptocurrencies, and stored in dormant wallets for years.\nWith over half of this amount now recovered, the\nU.S. SDNY asked\nvictims of the hack to email UraniumVictims@hsi.dhs.gov to claim a portion of the recovered cryptocurrency.\nRelated Articles:\nFBI confirms Lazarus hackers were behind $1.5B Bybit crypto heist\nLazarus hacked Bybit via breached Safe{Wallet} developer machine\nzkLend loses $9.5M in crypto heist, asks hacker to return 90%\nKuCoin to pay nearly $300 million in penalties after guilty plea\nSolana Pump.fun tool DogWifTool compromised to drain wallets"
    }
]