[
    {
        "Title": "RESURGE Malware Exploits Ivanti Flaw with Rootkit and Web Shell Features",
        "Link": "https://thehackernews.com/2025/03/resurge-malware-exploits-ivanti-flaw.html",
        "Summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has shed light on a new malware called RESURGE that has been deployed as part of exploitation activity targeting a now-patched security flaw in Ivanti Connect Secure (ICS) appliances.\n\"RESURGE contains capabilities of the SPAWNCHIMERA malware variant, including surviving reboots; however, RESURGE contains distinctive commands that",
        "Date": "2025-03-30",
        "Content": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has shed light on a new malware called\nRESURGE\nthat has been deployed as part of exploitation activity targeting a now-patched security flaw in Ivanti Connect Secure (ICS) appliances.\n\"RESURGE contains capabilities of the SPAWNCHIMERA malware variant, including surviving reboots; however, RESURGE contains distinctive commands that alter its behavior,\" the agency\nsaid\n. \"The file contains capabilities of a rootkit, dropper, backdoor, bootkit, proxy, and tunneler.\"\nThe security vulnerability associated with the deployment of the malware is\nCVE-2025-0282\n, a stack-based buffer overflow vulnerability affecting Ivanti Connect Secure, Policy Secure, and ZTA Gateways that could result in remote code execution.\nIt impacts the following versions -\nIvanti Connect Secure before version 22.7R2.5\nIvanti Policy Secure before version 22.7R1.2, and\nIvanti Neurons for ZTA gateways before version 22.7R2.3\nAccording to Google-owned Mandiant, CVE-2025-0282 has been weaponized to deliver what's called the SPAWN ecosystem of malware, comprising several components such as SPAWNANT, SPAWNMOLE, and SPAWNSNAIL. The use of SPAWN has been attributed to a China-nexus espionage group dubbed UNC5337.\nLast month, JPCERT/CC\nrevealed\nthat it observed the security defect being used to deliver an updated version of SPAWN known as SPAWNCHIMERA, which combines all the aforementioned disparate modules into one monolithic malware, while also incorporating changes to facilitate inter-process communication via UNIX domain sockets.\nMost notably, the revised variant harbored a feature to patch CVE-2025-0282 so as to prevent other malicious actors from exploiting it for their campaigns.\nRESURGE (\"libdsupgrade.so\"), per CISA, is an improvement over SPAWNCHIMERA with support for three new commands -\nInsert itself into \"ld.so.preload,\" set up a web shell, manipulate integrity checks, and modify files\nEnable the use of web shells for credential harvesting, account creation, password resets, and privilege escalation\nCopy the web shell to the Ivanti running boot disk and manipulate the running coreboot image\nCISA said it also unearthed two other artifacts from an unspecified critical infrastructure entity's ICS device: A variant of\nSPAWNSLOTH\n(\"liblogblock.so\") contained within RESURGE and a bespoke 64-bit Linux ELF binary (\"dsmain\").\n\"The [SPAWNSLOTH variant] tampers with the Ivanti device logs,\" it\nsaid\n. \"The third file is a custom embedded binary that contains an open-source shell script and a subset of applets from the open-source tool BusyBox. The open-source shell script allows for the ability to extract an uncompressed kernel image (vmlinux) from a compromised kernel image.\"\nIt's worth noting that CVE-2025-0282 has also been\nexploited\nas a zero-day by another China-linked threat group tracked as Silk Typhoon (formerly Hafnium), Microsoft disclosed earlier this month.\nThe latest findings indicate that the threat actors behind the malware are actively refining and reworking their tradecraft, making it imperative that organizations patch their Ivanti instances to the latest version.\nAs further mitigation, it's advised to reset credentials of privileged and non-privileged accounts, rotate passwords for all domain users and all local accounts, review access policies to temporarily revoke privileges for affected devices, reset relevant account credentials or access keys, and monitor accounts for signs of anomalous activity.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft tests new Windows 11 tool to remotely fix boot crashes",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-tests-new-quick-machine-recovery-tool-to-fix-boot-crashes/",
        "Summary": "Microsoft has begun testing a new Windows 11 tool called Quick Machine Recovery, which is designed to remotely deploy fixes for buggy drivers and configurations that prevent the operating system from starting. [...]",
        "Date": "2025-03-30",
        "Content": "Microsoft has begun testing a new Windows 11 tool called Quick Machine Recovery, which is designed to remotely deploy fixes for buggy drivers and configurations that prevent the operating system from starting.\nThe tool is part of Microsoft's\nWindows Resiliency Initiative\n, an effort to enhance system stability and reduce downtime by introducing automated tools and features to detect, diagnose, and fix critical failures in Windows 11.\n\"With system failures, devices can sometimes get stuck in the Windows Recovery Environment (Windows RE), severely impacting productivity and often requiring IT teams to spend significant time troubleshooting and restoring affected machines,\"\nexplains Microsoft\n.\n\"With quick machine recovery, when a widespread outage affects devices from starting properly, Microsoft can broadly deploy targeted remediations to affected devices via Windows RE—automating fixes and quickly getting users to a productive state without requiring complex manual intervention.\"\nOn Friday, Microsoft released the Quick Machine Recovery to Windows Insider Preview Beta Channel, so Insiders can start testing the tool.\nQuick Machine Recovery in the Advanced Startup menu\nSource: Microsoft\nWhen enabled and a new driver or configuration change prevents Windows 11 from properly starting, the operating system will boot into the Windows Recovery Environment and automatically launch the Quick Machine Recovery Tool.\nThis tool will connect to the Internet through ethernet or Wi-Fi and send crash data to Microsoft's servers. Based on the analysis of this data, Microsoft can remotely apply fixes such as removing problematic drivers or updates and changing configuration settings.\nThis new tool comes in response to the\nfaulty CrowdStrike update\nthat caused millions of Windows devices worldwide to suddenly crash with a Blue Screen of Death (BSOD) and enter reboot loops in July 2024.\nTo remove the\nbad update\n, Windows admins were forced to boot into the Windows Recovery Environment or Safe Mode and manually delete the driver so their Windows devices could boot normally.\nWith a tool like Quick Machine Recovery, Microsoft could have pushed out a fix that removed the driver and brought machines back online far more easily and quickly.\nMicrosoft says this feature will eventually be enabled by default in Windows 11 Home. The enterprise will be able to customize how the tool works in Windows 11 Pro and Enterprise through\nRemoteRemedation CSP\nor directly on the device via reagentc.exe.\nThe tool can also be preconfigured with network credentials to make it easier to deploy fixes and configure how often problematic PCs reach out to Microsoft's servers for a fix.\nMicrosoft will release a test remediation package in a few days, allowing Insiders to test the feature live.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft's killing script used to avoid Microsoft Account in Windows 11\nWindows 11 update breaks Veeam recovery, causes connection errors\nMicrosoft lifts Windows 11 upgrade block after Asphalt 8 crash fix\nWindows Notepad to get AI text summarization in Windows 11\nWindows 11 KB5053598 & KB5053602 cumulative updates released"
    },
    {
        "Title": "New Crocodilus malware steals Android users’ crypto wallet keys",
        "Link": "https://www.bleepingcomputer.com/news/security/new-crocodilus-malware-steals-android-users-crypto-wallet-keys/",
        "Summary": "A newly discovered Android malware dubbed Crocodilus tricks users into providing the seed phrase for the cryptocurrency wallet using a warning to back up the key to avoid losing access. [...]",
        "Date": "2025-03-30",
        "Content": "A newly discovered Android malware dubbed Crocodilus tricks users into providing the seed phrase for the cryptocurrency wallet using a warning to back up the key to avoid losing access.\nAlthough Crocodilus is a new banking malware, it features fully developed capabilities to take control of the device, harvest data, and remote control.\nResearchers at fraud prevention company ThreatFabric say that the malware is distributed via a proprietary dropper that bypasses Android 13 (and later) security protections.\nThe dropper installs the malware without triggering Play Protect while also bypassing Accessibility Service restrictions.\nWhat makes Crocodilus special is that it integrates social engineering to make victims provide access to their crypto-wallet seed phrase.\nIt achieves this through a screen overlay warning users to “back up their wallet key in the settings within 12 hours” or risk losing access to their wallet.\nBogus message served to cryptocurrency holders\nSource: ThreatFabric\n“This social engineering trick guides the victim to navigate to their seed phrase (wallet key), allowing Crocodilus to harvest the text using its Accessibility Logger,” ThreatFabric\nexplains\n.\n“With this information, attackers can seize full control of the wallet and drain it completely,” the researchers say.\nIn its first operations, Crocodilus was observed targeting users in Turkey and Spain, including bank accounts from those two countries. Judging from the debug messages, it appears that the malware is of Turkish origin.\nIt is unclear how the initial infection occurs, but typically, victims are tricked into downloading\ndroppers\nthrough malicious sites, fake promotions on social media or SMS, and third-party app stores.\nWhen launched, Crocodilus gains access to Accessibility Service, normally reserved for aiding people with disabilities, to unlock access to screen content, perform navigation gestures, and monitor for app launches.\nRequesting Accessibility Service permission\nSource: ThreatFabric\nWhen the victim opens a targeted banking or cryptocurrency app, Crocodilus loads a fake overlay on top of the real app to intercept the victim’s account credentials.\nThe bot component of the malware supports a set of 23 commands that it can execute on the device, including:\nEnable call forwarding\nLaunch a specific application\nPost a push notification\nSend SMS to all contacts or a specified number\nGet SMS messages\nRequest Device Admin privileges\nEnable a black overlay\nEnable/disable sound\nLock screen\nMake itself the default SMS manager\nThe malware also offers remote access trojan (RAT) functionality, which enables its operators to tap on the screen, navigate the user interface, perform swipe gestures, and more.\nThere’s also a dedicated RAT command to take a screenshot of the Google Authenticator application and capture one-time password codes used for two-factor authentication account protection.\nWhile executing these actions, Crocodilus operators can activate a black screen overlay and mute the device to hide the activity from the victim and make it appear as if the device is locked.\nAlthough Crocodilus appears to have a specific targeting limited to Spain and Turkey right now, the malware could expand operations soon, adding more apps to its target list.\nAndroid users are advised to avoid downloading APKs from outside Google Play and to ensure that Play Protect is always active on their devices.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft: New RAT malware used for crypto theft, reconnaissance\nCrypto-stealing apps found in Apple App Store for the first time\nNew Android malware uses Microsoft’s .NET MAUI to evade detection\nMalicious Android 'Vapor' apps on Google Play installed 60 million times\nMassJacker malware uses 778,000 wallets to steal cryptocurrency"
    },
    {
        "Title": "Microsoft's killing script used to avoid Microsoft Account in Windows 11",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsofts-killing-script-used-to-avoid-microsoft-account-in-windows-11/",
        "Summary": "Microsoft has removed the 'BypassNRO.cmd' script from Windows 11 preview builds, which allowed users to bypass the requirement to use a Microsoft Account when installing the operating system. [...]",
        "Date": "2025-03-30",
        "Content": "Microsoft has removed the 'BypassNRO.cmd' script from Windows 11 preview builds, which allowed users to bypass the requirement to use a Microsoft Account when installing the operating system.\nThis change was introduced in the latest Windows 11 Insider Dev preview build, which means it will likely be coming to production builds.\n\"We're removing the bypassnro.cmd script from the build to enhance security and user experience of Windows 11,\" reads the\nWindows 11 Insider Preview Build 26200.5516 release notes\n.\n\"This change ensures that all users exit setup with internet connectivity and a Microsoft Account.\"\nSince the release of Windows 11, Microsoft has made it hard to use the operating system with a local account, instead forcing users to log in with a Microsoft Account.\nMicrosoft says this is done to make using the company's ecosystem of cloud-based features and services easier, such as using your account to\nstore BitLocker recovery keys\n.\n\"When a user signs in with a Microsoft account, the device is connected to cloud services,\"\nexplains Microsoft\n.\n\"The user can share many of their settings, preferences, and apps across devices.\"\nHowever, many users do not want to use a Microsoft Account, thinking it reduces their privacy and allows Microsoft to monitor their activities.\nA popular method to bypass a Microsoft Account during setup is to use a script named 'C:\\windows\\system32\\oobe\\BypassNRO.cmd.' When run during Windows 11 setup, it creates a Registry value that removes the requirement to connect to the Internet during setup, which allows you to set up the operating system with a local account instead.\nThe script can be run during setup by pressing\nShift+F10\nat the \"Let's connect you to a network\" screen to open a Windows command prompt.\nIn the command prompt window, type\nc:\\windows\\system32\\oobe\\BypassNRO.cmd\nto run the script and reboot your computer.\nRunning the BypassNRO.cmd script\nSource: BleepingComputer\nOn reboot, the Windows 11 setup will run again, and when you get to the networking screen, you will now have the option to skip-networking and set up a local account.\nWhile Microsoft is now removing this script, they have not yet removed the BypassNRO Registry value. This means you can manually enter the following commands to achieve the same functionality as the now-removed script.\nreg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\OOBE /v BypassNRO /t REG_DWORD /d 1 /f\r\nshutdown /r /t 0\nIf you feel comfortable modifying the Windows Registry, you can manually create the BypassNRO manually using Regedit, which can be launched from the Shift+F10 command prompt.\nUnfortunately, it would not be surprising to see Microsoft remove the functionality of this Registry value in the future, making this technique no longer work.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nWindows Notepad to get AI text summarization in Windows 11\nMicrosoft tests new Windows 11 tool to remotely fix boot crashes\nWindows 11 update breaks Veeam recovery, causes connection errors\nWindows 11 KB5053598 & KB5053602 cumulative updates released\nWindows 11 KB5052093 update released with 33 changes and fixes"
    }
]