[
    {
        "Title": "U.S. Agencies Warn of Rising Iranian Cyberattacks on Defense, OT Networks, and Critical Infrastructure",
        "Link": "https://thehackernews.com/2025/06/us-agencies-warn-of-rising-iranian.html",
        "Summary": "U.S. cybersecurity and intelligence agencies have issued a joint advisory warning of potential cyber-attacks from Iranian state-sponsored or affiliated threat actors.&nbsp;\n\"Over the past several months, there has been increasing activity from hacktivists and Iranian government-affiliated actors, which is expected to escalate due to recent events,\" the agencies said.\n\"These cyber actors often",
        "Date": "2025-06-30",
        "Content": "U.S. cybersecurity and intelligence agencies have issued a joint advisory warning of potential cyber-attacks from Iranian state-sponsored or affiliated threat actors.\n\"Over the past several months, there has been increasing activity from hacktivists and Iranian government-affiliated actors, which is expected to escalate due to recent events,\" the agencies\nsaid\n.\n\"These cyber actors often exploit targets of opportunity based on the use of unpatched or outdated software with known Common Vulnerabilities and Exposures or the use of default or common passwords on internet-connected accounts and devices.\"\nThere is currently no evidence of a coordinated campaign of malicious cyber activity in the U.S. that can be attributed to Iran, the Cybersecurity and Infrastructure Security Agency (CISA), the Federal Bureau of Investigation (FBI), the Department of Defense Cyber Crime Center (DC3), and the National Security Agency (NSA) noted.\nEmphasizing the need for \"increased vigilance,\" the agencies singled out Defense Industrial Base (DIB) companies, specifically those with ties to Israeli research and defense firms, as being at an elevated risk. U.S. and Israeli entities may also be exposed to distributed denial-of-service (DDoS) attacks and ransomware campaigns, they added.\nAttackers often start with reconnaissance tools like Shodan to find vulnerable internet-facing devices, especially in industrial control system (ICS) environments. Once inside, they can exploit weak segmentation or misconfigured firewalls to move laterally across networks. Iranian groups have previously used remote access tools (RATs), keyloggers, and even legitimate admin utilities like PsExec or Mimikatz to escalate access—all while evading basic endpoint defenses.\nBased on prior campaigns, attacks mounted by Iranian threat actors leverage techniques like automated password guessing, password hash cracking, and default manufacturer passwords to gain access to internet-exposed devices. They have also been found to employ system engineering and diagnostic tools to breach operational technology (OT) networks.\nThe development comes days after the Department of Homeland Security (DHS)\nreleased\na bulletin, urging U.S. organizations to be on the lookout for possible \"low-level cyber attacks\" by pro-Iranian hacktivists amid the ongoing geopolitical tensions between Iran and Israel.\nLast week, Check Point\nrevealed\nthat the Iranian nation-state hacking group tracked as APT35 targeted journalists, high-profile cyber security experts, and computer science professors in Israel as part of a spear-phishing campaign designed to capture their Google account credentials using bogus Gmail login pages or Google Meet invitations.\nAs mitigations, organizations are advised to follow the below steps -\nIdentify and disconnect OT and ICS assets from the public internet\nEnsure devices and accounts are protected with strong, unique passwords, replace weak or default passwords, and enforce multi-factor authentication (MFA)\nImplement phishing-resistant MFA for accessing OT networks from any other network\nEnsure systems are running the latest software patches to protect against known security vulnerabilities\nMonitor user access logs for remote access to the OT network\nEstablish OT processes that prevent unauthorized changes, loss of view, or loss of control\nAdopt full system and data backups to facilitate recovery\nFor organizations wondering where to start, a practical approach is to first review your external attack surface—what systems are exposed, which ports are open, and whether any outdated services are still running. Tools like\nCISA's Cyber Hygiene program\nor open-source scanners such as Nmap can help identify risks before attackers do. Aligning your defenses with the MITRE ATT&CK framework also makes it easier to prioritize protections based on real-world tactics used by threat actors.\n\"Despite a declared ceasefire and ongoing negotiations towards a permanent solution, Iranian-affiliated cyber actors and hacktivist groups may still conduct malicious cyber activity,\" the agencies said.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Europol Dismantles $540 Million Cryptocurrency Fraud Network, Arrests Five Suspects",
        "Link": "https://thehackernews.com/2025/06/europol-dismantles-540-million.html",
        "Summary": "Europol on Monday announced the takedown of a cryptocurrency investment fraud ring that laundered €460 million ($540 million) from more than 5,000 victims across the world.\nThe operation, the agency said, was carried out by the Spanish Guardia Civil, along with support from law enforcement authorities from Estonia, France, and the United States. Europol said the investigation into the syndicate",
        "Date": "2025-06-30",
        "Content": "Europol on Monday announced the takedown of a cryptocurrency investment fraud ring that laundered €460 million ($540 million) from more than 5,000 victims across the world.\nThe operation, the agency said, was carried out by the Spanish Guardia Civil, along with support from law enforcement authorities from Estonia, France, and the United States. Europol said the investigation into the syndicate started in 2023.\nIn addition, the five alleged suspects behind the cryptocurrency scam were arrested on June 25, 2025. Three of the arrests took place in the Canary Islands, while two others were apprehended from Madrid.\n\"To carry out their fraudulent activities, the leaders of the criminal network allegedly used a net of associates spread around the world to raise funds through cash withdrawals, bank transfers, and crypto-transfers,\" Europol\nsaid\n.\nThese types of scams often follow a pattern known as cryptocurrency confidence or romance baiting (formerly \"pig butchering\"), where scammers slowly build trust with victims over weeks or months—often through dating apps or friendly chats—before convincing them to invest in fake crypto platforms. Behind the scenes, fraudsters use social engineering tricks, like fake trading dashboards and scripted conversations, to keep the illusion going. Once money is deposited, it's moved across multiple accounts in a process called layering, making it harder for authorities to trace.\nThe cybercriminals are believed to have set up a corporate and banking network based in Hong Kong, with the illicitly obtained funds routed through a maze of payment gateways and user accounts in the names of different people and in different exchanges.\nThe development comes shortly after the U.S. Department of Justice (DoJ)\nfiled\na civil forfeiture complaint seeking to recover over $225 million in cryptocurrency linked to cryptocurrency confidence (aka romance baiting) scams running out of Vietnam and the Philippines.\nEuropol described the \"scale, variety, sophistication, and reach\" of these online fraud schemes as \"unprecedented,\" and that they're on track to surpass serious and organized crime, thanks to the increased adoption of artificial intelligence (AI) technologies.\n\"The integration of generative artificial intelligence by transnational criminal groups involved in cyber-enabled fraud is a complex and alarming trend observed in Southeast Asia, and one that represents a powerful force multiplier for criminal activities,\"\nsaid\nUNODC Regional Analyst, John Wojcik, late last year.\nAccording to a report from INTERPOL last week, cybercrime reports account for more than 30% of all reported crimes in Western and Eastern Africa. This included online scams, ransomware, business email compromise (BEC), and digital sextortion.\n\"Cybercrime continues to outpace the legal systems designed to stop it,\" INTERPOL\nsaid\n, adding, \"75% of countries surveyed said their legal frameworks and prosecution capacity needed improvement.\"\nPart of what makes this kind of fraud so hard to fight is how criminals exploit legal loopholes and fragmented international laws. Many scammers now use synthetic identities—fake personas built with stolen or AI-generated data—to register accounts or rent bank access. They also recruit financial mules to move money, often without them realizing they're part of a crime.\nTo pull off such investment fraud schemes, unwitting people from Asia and Africa are lured into Southeast Asia with lucrative job opportunities, and forcefully detaining them inside \"scam compounds\" run by transnational organized crime groups originating from China.\nAs many as 53 scam compounds have been identified in Cambodia,\nper Amnesty International\n, where the non-profit said \"human rights abuses have taken place or continue to occur, including human trafficking, torture and other ill-treatment, forced labour, child labour, deprivation of liberty and slavery.\"\nMany of the people forced into these scam compounds were originally promised tech or sales jobs abroad. Once they arrive, their passports are taken and they're forced to scam others under threats of violence or debt.\nLast year, the United States Institute of Peace\nrevealed\nthat the return on cyber scamming is estimated to exceed $12.5 billion annually in Cambodia, which amounts to half the country's formal gross domestic product (GDP).\nThe illegal operation has had such an impact that the Indian Embassy in Cambodia has a prominent warning on its website urging citizens to be vigilant against falling into the hands of human traffickers under the pretext of high-paying jobs, stating job seekers are coerced to undertake online financial scams and other illegal activities.\nAdding more context to the criminal activity is a\nrecent report\nfrom ProPublica that Chinese-language\nTelegram\nchannels\nand groups are advertising to scammers the ability to rent U.S. bank accounts at Bank of America, Chase, Citibank, and PNC, who then use these accounts to launder the proceeds. Telegram has begun to take action on some of these channels.\nMeta is said to have\ndetected and taken down\nno less than seven million Facebook accounts associated with scam centers in Asia and the Middle East since the start of 2024, per a statement shared by the company to the investigative journalism organization.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Blind Eagle Uses Proton66 Hosting for Phishing, RAT Deployment on Colombian Banks",
        "Link": "https://thehackernews.com/2025/06/blind-eagle-uses-proton66-hosting-for.html",
        "Summary": "The threat actor known as Blind Eagle has been attributed with high confidence to the use of the Russian bulletproof hosting service Proton66.\nTrustwave SpiderLabs, in a report published last week, said it was able to make this connection by pivoting from Proton66-linked digital assets, leading to the discovery of an active threat cluster that leverages Visual Basic Script (VBS) files as its",
        "Date": "2025-06-30",
        "Content": "The threat actor known as\nBlind Eagle\nhas been attributed with high confidence to the use of the Russian bulletproof hosting service\nProton66\n.\nTrustwave SpiderLabs, in a\nreport\npublished last week, said it was able to make this connection by pivoting from Proton66-linked digital assets, leading to the discovery of an active threat cluster that leverages Visual Basic Script (VBS) files as its initial attack vector and installs off-the-shelf remote access trojans (RATS).\nMany threat actors rely on bulletpro\nWhile Visual Basic Script (VBS) might seem outdated, it's still a\nof hosting providers like Proton66 because these services intentionally ignore abuse reports and legal takedown requests. This makes it easier for attackers to run phishing sites, command-and-control servers, and malware delivery systems without interruption.\nThe cybersecurity company said it identified a set of domains with a similar naming pattern (e.g., gfast.duckdns[.]org, njfast.duckdns[.]org) beginning in August 2024, all of which resolved to the same IP address (\"45.135.232[.]38\") that's associated with Proton66.\nThe use of dynamic DNS services like DuckDNS also plays a key role in these operations. Instead of registering new domains each time, attackers rotate subdomains tied to a single IP address — making detection harder for defenders.\n\"The domains in question were used to host a variety of malicious content, including phishing pages and VBS scripts that serve as the initial stage of malware deployment,\" security researcher Serhii Melnyk said. \"These scripts act as loaders for second-stage tools, which, in this campaign, are limited to publicly available and often open-source RATs.\"\nWhile VBS might seem outdated, it's still a go-to tool for initial access due to its compatibility with Windows systems and ability to run silently in the background. Attackers use it to download malware loaders, bypass antivirus tools, and blend into normal user activity. These lightweight scripts are often the first step in multi-stage attacks, which later deploy RATs, data stealers, or keyloggers.\nThe phishing pages have been found to legitimate Colombian banks and financial institutions, including Bancolombia, BBVA, Banco Caja Social, and Davivienda. Blind Eagle, also known as AguilaCiega, APT-C-36, and APT-Q-98, is known for its targeting of entities in South America, particularly Colombia and Ecuador.\nThe deceptive sites are engineered to harvest user credentials and other sensitive information. The VBS payloads hosted on the infrastructure come fitted with capabilities to retrieve encrypted executable files from a remote server, essentially acting as a loader for commodity RATS like AsyncRAT or Remcos RAT.\nFurthermore, an analysis of the VBS codes has revealed overlaps with Vbs-Crypter, a tool linked to a subscription-based crypter service called\nCrypters and Tools\nthat's used to obfuscate and pack VBS payloads with an aim to avoid detection.\nTrustwave said it also discovered a botnet panel that allows users to \"control infected machines, retrieve exfiltrated data, and interact with infected endpoints through a broad set of capabilities typically found in commodity RAT management suites.\"\nThe disclosure comes as Darktrace revealed details of a Blind Eagle campaign that has been targeting Colombian organizations since November 2024 by exploiting a now-patched Windows flaw (CVE-2024-43451) to download and execute the next-stage payload, a behavior that was\nfirst documented\nby Check Point in March 2025.\n\"The persistence of Blind Eagle and ability to adapt its tactics, even after patches were released, and the speed at which the group were able to continue using pre-established TTPs highlights that timely vulnerability management and patch application, while essential, is not a standalone defense,\" the company\nsaid\n.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Leveraging Credentials As Unique Identifiers: A Pragmatic Approach To NHI Inventories",
        "Link": "https://thehackernews.com/2025/06/leveraging-credentials-as-unique.html",
        "Summary": "Identity-based attacks are on the rise. Attacks in which malicious actors assume the identity of an entity to easily gain access to resources and sensitive data have been increasing in number and frequency over the last few years. Some recent reports estimate that 83% of attacks involve compromised secrets. According to reports such as the Verizon DBIR, attackers are more commonly using stolen",
        "Date": "2025-06-30",
        "Content": "Identity-based attacks are on the rise. Attacks in which malicious actors assume the identity of an entity to easily gain access to resources and sensitive data have been increasing in number and frequency over the last few years. Some recent reports estimate that\n83% of attacks involve compromised secrets\n. According to reports such as the\nVerizon DBIR\n, attackers are more commonly using stolen credentials to gain their initial foothold, rather than exploiting a vulnerability or misconfiguration.\nAttackers are not just after human identities that they can assume, though. More commonly, they are after Non-Human Identities (NHIs), which\noutnumber human identities in the enterprise by at least 50 to one\n. Unlike humans, machines have no good way to achieve multi-factor authentication, and we, for the most part, have been relying on credentials alone, in the form of API keys, bearer tokens, and JWTs.\nTraditionally, identity and access management (IAM) has been built on the idea of persistent human traits over time. It is rare for a person to change their name, fingerprints, or DNA. We can assume that if you went through an identity verification process, you are confirmed to be the human you claim to be. Based on this, you can obtain certain permissions dependent on your role within the organization and your level of trust.\nSecuring machine identities means getting a handle on the unique trait that bad actors actually care about, namely, their access keys.\nIf we treat these highly valued secrets as the way to uniquely identify the identities we are protecting, then we can leverage that into true observability around how access is granted and used throughout your enterprise.\nAccounting For NHIs Through A Fractured Lens\nBefore we take a deeper look at secrets as unique identifiers, let's first consider how we currently talk about NHIs in the enterprise.\nMost teams struggle with defining NHIs. The canonical definition is simply \"anything that is not a human,\" which is necessarily a wide set of concerns. NHIs manifest differently across cloud providers, container orchestrators, legacy systems, and edge deployments. A Kubernetes service account tied to a pod has distinct characteristics compared to an Azure managed identity or a Windows service account. Every team has historically managed these as separate concerns. This patchwork approach makes it nearly impossible to create a consistent policy, let alone automate governance across environments.\nThe exponential growth of NHIs has left a gap in traditional asset inventory tools, and access reviewers can't keep pace. Enforcement of consistent permissions or security controls across such a wildly varied set of identities seems near impossible. This is on top of aging legacy systems that have not had their passwords rotated or audited in years.\nCompounding this issue is the lack of metadata and ownership around NHIs. Questions like \"What is this identity for?\" or \"Who owns this token?\" frequently go unanswered, as the person who created and released that identity into the system has moved on. This vacuum of accountability makes it difficult to apply basic lifecycle practices such as rotation or decommissioning. NHIs that were created for testing purposes often persist long after the systems they were tied to are discontinued, accumulating risk silently.\nThe UUIDs Of Your Zero Trust Protect Surface\nNo matter what form or shape an NHI takes, in order to do work as part of an application or system, it needs to authenticate to access data and resources and do its work.\nMost commonly, this takes the form of secrets, which look like API keys, certificates, or tokens. These are all inherently unique and can act as cryptographic fingerprints across distributed systems.\nWhen used in this way, secrets used for authentication become traceable artifacts tied directly to the systems that generated them.\nThis allows for a level of attribution and auditing that's difficult to achieve with traditional service accounts. For example, a short-lived token can be directly linked to a specific CI job, Git commit, or workload, allowing teams to answer not just what is acting, but why, where, and on whose behalf.\nThis access-as-the-identifier model can bring clarity to your inventory, offering a unified view of all your machines, workloads, task runners, and even agent-based AI systems. Secrets offer a consistent and machine-verifiable method of indexing NHIs, letting teams centralize visibility into what exists, who owns it, and what it can access, regardless of whether it's running on Kubernetes, GitHub Actions, or a public cloud.\nCritically, this model also supports lifecycle management and Zero Trust principles more naturally than legacy identity frameworks. A secret is only valid when it can be used, which is a provable state, which means unused or expired secrets can be automatically flagged for cleanup. This can stop identity sprawl and ghost accounts, which are endemic in NHI-heavy environments.\nThe Security Ramifications Of Secrets At NHI Identifiers\nIf we are going to talk about secrets as the unique identifier for machines and workloads, we do need to address the fact that they have a nasty tendency to leak. According to our\nState of Secrets Sprawl 2025 research\n, almost 23.8 million secrets were leaked on public GitHub repositories in 2024, a 25% year-over-year increase. Worse yet, a full 35% of the private repositories we researched contained secrets,\n8 times as many\nas we found in public repositories.\nBreaches over the past several years\n, from\nUber\nto the\nU.S. Department of the Treasury\n, have shown that when secrets are scattered across pipelines, codebases, containers, and cloud configs without consistent management, they become a silent invitation to attackers. These leaked or stolen credentials offer attackers a low-friction path to compromise.\nA leaked API key or NHI token allows anyone who attempts to use it to establish a valid session, with no mechanism in place to verify its legitimacy or the context of its use. If the secret is tied to a long-lived, over-permissioned bot or service account, the attacker instantly inherits all that trust.\nThe problem is amplified further when secrets outlive their purpose. Orphaned secrets, credentials forgotten about and never decommissioned, abandoned CI/CD jobs, or one-off projects, linger quietly, often with dangerous levels of access and zero visibility. Without ownership, expiration, or revocation processes, they become ideal entry points for attackers looking for stealth and persistence.\nGitGuardian Can Inventory All Your Secrets, Not Just The Leaked Ones\nSecrets can only live in two possible places: where they belong, safely stored in a secrets management vault, or leaked elsewhere. We have been helping people find the secrets leaked where they are not supposed to be for years now, with our\ninternally focused Secrets Detection offering\nand our\nPublic Monitoring platform\n.\nNow, GitGuardian can act as your cross-environment NHI inventory platform, helping you gain visibility into what secrets are in your vaults, along with metadata around how they are used. GitGuardian builds a unified, contextualized inventory of every secret, regardless of origin or format. Whether it's injected via Kubernetes, embedded in an Ansible playbook, or retrieved from a vault like HashiCorp, each secret is fingerprinted and monitored.\nThis cross-environment awareness allows teams to quickly see\nWhich NHIs have keys leaked publicly.\nIf any internal leaks happened for those same secrets.\nAny secrets redundantly stored in multiple vaults\nIf the secret is long lived and needs rotation\nThe GitGuardian NHI Governance Inventory dashboard showing policy violations and risk scores.\nCrucially, GitGuardian also detects \"zombie\" credentials, secrets that persist without authorization or oversight. Rich metadata, like creator attribution, secret lifespan, permissions scope, and context, empower governance over these non-human actors, enabling real-time inventory alignment and accountability.\nThis visibility isn't just operational, it's strategic. GitGuardian enables centralized policy enforcement across all secret sources, transforming reactive secrets detection into proactive identity governance. By mapping secrets to NHIs and enforcing lifecycle policies like expiration, rotation, and revocation, GitGuardian closes the loop between discovery, vaulting, and enforcement\nBeyond Inventory And Towards NHI Governance\nThe rise of non-human identities has reshaped the identity landscape, and with it, the attack surface. Credentials aren't just access keys. Secrets are the mechanism that allows an attacker to assume an identity that already has persistent access to your data and resources. Without visibility into where those credentials live, how they're used, and whether they're still valid, organizations are left vulnerable to silent compromise.\nGitGuardian's Secrets Security + NHI Governance = Non-Human Identity Security\nTreating secrets as the UUIDs of modern workloads is the clearest path to scalable, cross-platform NHI governance. But that approach only works if you can see the full picture: vaults, pipelines, ephemeral infrastructure, and everything in between.\nGitGuardian delivers that visibility. We are turning fragmented credential sprawl into a unified, actionable inventory. By anchoring NHI identity to its authenticating secret, and layering in rich metadata and lifecycle controls, GitGuardian enables security teams to detect issues early, identify over-permissioned and orphaned credentials, and enforce revocation before a breach occurs.\nWe are helping complex modern enterprises reduce the likelihood of successful identity-based attacks. When credentials are monitored, scoped, and managed in real time, they're no longer low-hanging fruit for attackers.\nWe would love to give you a full demo of the capabilities of the GitGuardian NHI Security platform and help you get unparalleled insight into your NHIs and secrets security.\nAnd if you'd rather explore on your own,\ntake a guided tour of GitGuardian with our interactive demo\n!\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "⚡ Weekly Recap: Airline Hacks, Citrix 0-Day, Outlook Malware, Banking Trojans and more",
        "Link": "https://thehackernews.com/2025/06/weekly-recap-airline-hacks-citrix-0-day.html",
        "Summary": "Ever wonder what happens when attackers don’t break the rules—they just follow them better than we do? When systems work exactly as they’re built to, but that “by design” behavior quietly opens the door to risk?\nThis week brings stories that make you stop and rethink what’s truly under control. It’s not always about a broken firewall or missed patch—it’s about the small choices, default settings",
        "Date": "2025-06-30",
        "Content": "Ever wonder what happens when attackers don't break the rules—they just follow them better than we do? When systems work exactly as they're built to, but that \"by design\" behavior quietly opens the door to risk?\nThis week brings stories that make you stop and rethink what's truly under control. It's not always about a broken firewall or missed patch—it's about the small choices, default settings, and shortcuts that feel harmless until they're not.\nThe real surprise? Sometimes the threat doesn't come from outside—it's baked right into how things are set up. Dive in to see what's quietly shaping today's security challenges.\n⚡ Threat of the Week\nFBI Warns of Scattered Spider's on Airlines\n— The U.S. Federal Bureau of Investigation (FBI) has warned of a new set of attacks mounted by the notorious cybercrime group Scattered Spider targeting the airline sector using sophisticated social engineering techniques to obtain initial access. Cybersecurity vendors Palo Alto Networks Unit 42 and Google Mandiant have also issued similar alerts, urging organizations to be on alert and apply necessary mitigations, including strong authentication, segregation of identities, and enforcing rigorous identity controls for password resets and multi-factor authentication (MFA) registration, to harden their environments to protect against tactics utilized by the threat actor.\nCRYPTOS: Hunting Adversaries in the Crypto Underground\nTrace $1M in stolen crypto live. On July 15th, learn from a researcher how real-world laundering schemes are uncovered using case simulations, wallet clustering, and blockchain forensics. See how illicit funds move—and how they're traced.\nRegister Now ➝\n🔔 Top News\nLapDogs ORB Network Compromised Over 1,000 SOHO Devices\n— A China-linked APT has built an operational relay box (ORB) network called LapDogs comprising over 1,000 backdoored routers for espionage purposes. The digital break-ins began no later than September 2023 and have expanded ever since. The campaign mostly targets end-of-life routers, IoT devices, internet-connected security cameras, virtual servers, and other small office/home office (SOHO) devices, with the goal of building an Operational Relay Box (ORB) network. Five geographic regions — the US (352 victims), Japan (256 victims), South Korea (226 victims), Taiwan (80 victims), and Hong Kong (37 victims) — make up about 90% of the entire ORB network. The attacks leverage known security flaws in Linux-based devices to drop a backdoor called ShortLeash. The purpose of the malware itself is not known, although it has been found to share similarities with another malware sample used by UAT-5918. It's suspected that the devices are being gradually, but steadily, compromised as part of methodical and small-scale efforts across the world to gain long-term access to networks.\nIranian Hacking Group Targets Israeli Cybersecurity Experts\n— APT35, an Iranian state-sponsored hacking group associated with the Islamic Revolutionary Guard Corps (\nIRGC\n) has been linked to a spear-phishing campaign targeting journalists, high-profile cyber security experts, and computer science professors in Israel that seeks to redirect them to bogus phishing pages that are capable of harvesting their Google account credentials. The attacks, which take place via emails and WhatsApp messages, leverage fake Gmail login pages or Google Meet invitations to harvest their credentials. The development comes amid geopolitical tensions between Iran and Israel, which has also led to a spike in hacktivist activity in the region. \"There are about 170 hacker groups attacking Israel, with about 1,345 cyber attacks on Israel, including about 447 cyber attacks launched against Israel after the conflict broke out,\" NSFOCUS\nsaid\nin a report published last week. \"The number of hacker groups attacking Iran reached about 55, and the number of cyber attacks on Iran reached about 155, of which about 20 were launched against Iran after the conflict broke out.\"\nCitrix Patches Actively Exploited 0-Day\n— Citrix has released security updates to address a critical flaw affecting NetScaler ADC that it said has been exploited in the wild. The vulnerability, tracked as CVE-2025-6543 (CVSS score: 9.2), is a memory overflow bug that could result in unintended control flow and denial-of-service. It's currently not known how the vulnerability is being exploited in the wild. The exploitation of CVE-2025-6543 coincides with reports that another critical security vulnerability in NetScaler ADC (CVE-2025-5777, CVSS score: 9.3) is also being weaponized in real-world attacks post public-disclosure.\nU.S. House Bans WhatsApp Use in Government Devices\n— The U.S. House of Representatives has formally banned congressional staff members from using WhatsApp on government-issued devices, citing security concerns. According to the House Chief Administrative Officer (CAO), the decision was taken based on a lack of transparency in how WhatsApp protects user data, the absence of stored data encryption, and potential security risks. WhatsApp has rejected these concerns, stating messages are end-to-end encrypted by default, and that it offers a \"higher level\" of security than other apps.\nNew Tool to Neutralize Cryptomining Botnets\n— Akamai has proposed a novel mechanism to defang cryptomining botnets using XMRogue, a proof-of-concept (PoC) tool that lets defenders stop miners' proxy servers from using compromised endpoints for illicit mining purposes. In cases where a mining proxy is not used, the approach uses a script to send more than 1,000 simultaneous login requests using the attacker's wallet, which will force the pool to temporarily ban the wallet. That said, it's worth noting that these methods don't necessarily remove the malicious code from the systems as it's just a way to disable the mining infrastructure.\n‎️‍🔥 Trending CVEs\nHackers are quick to jump on newly discovered software flaws—sometimes within hours. Whether it's a missed update or a hidden bug, even one unpatched CVE can open the door to serious damage. Below are this week's high-risk vulnerabilities making waves. Review the list, patch fast, and stay a step ahead.\nThis week's list includes —\nCVE-2025-49825\n(Teleport),\nCVE-2025-6218\n(WinRAR),\nCVE-2025-49144\n(Notepad++),\nCVE-2025-27387\n(OPPO ColorOS),\nCVE-2025-2171, CVE-2025-2172\n(Aviatrix Controller),\nCVE-2025-52562\n(ConvoyPanel),\nCVE-2025-27915\n(Zimbra Classic Web Client),\nCVE-2025-48703\n(CentOS Web Panel),\nCVE-2025-23264\n,\nCVE-2025-23265\n(NVIDIA Megatron LM),\nCVE-2025-36537\n(TeamViewer),\nCVE-2025-4563\n(Kubernetes),\nCVE-2025-2135\n(Kibana),\nCVE-2025-3509\n(GitHub),\nCVE-2025-36004\n(IBM i),\nCVE-2025-49853\n(ControlID iDSecure),\nCVE-2025-37101\n(HPE OneView for VMware vCenter),\nCVE-2025-3699\n(Mitsubishi Electric),\nCVE-2025-6709\n(MongoDB),\nCVE-2025-1533, CVE-2025-3464\n(ASUS Armoury Crate), and an\nunpatched flaw\naffecting Kerio Control.\n📰 Around the Cyber World\nSecurity Flaws Affect 100s of Printers and Scanners\n— Eight security vulnerabilities have been\ndisclosed\nin multifunction printers (MFP) from Brother Industries, Ltd, that\naffect\n742 models across 4 vendors, including\nFUJIFILM Business Innovation\n,\nRicoh\n,\nToshiba Tec Corporation\n, and\nKonica Minolta\n. \"Some or all of these vulnerabilities have been identified as affecting 689 models across Brother's range of printer, scanner, and label maker devices,\" Rapid7\nsaid\n. \"Additionally, 46 printer models from FUJIFILM Business Innovation, 5 printer models from Ricoh, and 2 printer models from Toshiba Tec Corporation are affected by some or all of these vulnerabilities.\" The most severe of the flaws is CVE-2024-51978 (CVSS score: 9.8), a critical bug that allows remote unauthenticated attackers to leak the target device's serial number by chaining it with CVE-2024-51977 (CVSS score: 5.3), and generate the target device's default administrator password. Having the admin password enables an attacker to reconfigure the device or abuse functionality intended for authenticated users.\nFrench Police Reportedly Arrest BreachForums Admins\n— French authorities have\narrested\nfive high-ranking members\nof\nBreachForums\n, a\nnotorious online hub\nthat specializes in selling stolen data and cybercriminal tools. This included forum users ShinyHunters, Hollow, Noct, and Depressed. A fifth suspect is said to have been apprehended by French police officials in February 2025. He went by the pseudonym IntelBroker (aka Kyle Northern), who has now been identified as a 25-year-old British man named Kai West. The\nlatest iteration\nof BreachForums is currently offline. According to the U.S. Department of Justice (DoJ), West's real-world identity was exposed after undercover Federal Bureau of Investigation (FBI) agents purchased a stolen API key that granted illicit access to one victim's website, and traced the Bitcoin wallet's address back to him. West has been charged with conspiracy to commit computer intrusions, conspiracy to commit wire fraud, accessing a protected computer to obtain information, and wire fraud. In total, he faces up to 50 years in prison. \"Kai West, an alleged serial hacker, is charged for a nefarious, years-long scheme to steal victim's [sic] data and sell it for millions in illicit funds, causing more than $25 million in damages worldwide,\"\nsaid\nFBI Assistant Director in Charge Christopher G. Raia. The U.S. is seeking his extradition.\nCanada Orders Hikvision to Close its Canadian Operations\n— Canada's government has ordered Chinese CCTV systems vendor Hikvision to cease all its operations in the country and shut down its Canadian business following a national security review. \"The government has determined that Hikvision Canada Ic.'s continued operations in Canada would be injurious to Canada's national security,\" according to a\nstatement\nreleased by Mélanie Joly, Canada's Minister of Industry. \"This determination is the result of a multi-step review that assessed information and evidence provided by Canada's security and intelligence community.\" In addition, the order prohibits the purchase or use of Hikvision products in government departments, agencies, and crown corporations. Hikvision\ncalled\nthe allegations \"unfounded\" and that the decision \"lacks a factual basis, procedural fairness, and transparency.\"\nU.K. NCSC Details \"Authentic Antics\" Malware\n— The National Cyber Security Centre (NCSC) is calling attention to a new malware it calls Authentic Antics that runs within the Microsoft Outlook process, displaying periodic malicious login prompts to steal credentials and OAuth 2.0 tokens in an attempt to gain unauthorized access to victim email accounts. \"The stolen credential and token data is then exfiltrated by authenticating to the victim's Outlook on the web account via the Outlook web API, with the freshly stolen token, to send an email to an actor-controlled email address,\" the NCSC\nsaid\n. \"The emails will not show in the victim's sent folder.\"\nMicrosoft Wants to Avoid Another CrowdStrike-like Outage\n— Microsoft said it's planning to deliver a private preview of the Windows endpoint security platform to select endpoint security partners, including Bitdefender, CrowdStrike, ESET, SentinelOne, Trellix, Trend Micro, and WithSecure, that will allow them to build their anti-malware solutions to run outside the Windows kernel and in the user mode, just as other regular applications. \"This means security products like anti-virus and endpoint protection solutions can run in user mode just as apps do,\" Microsoft\nsaid\n. \"This change will help security developers provide a high level of reliability and easier recovery resulting in less impact on Windows devices in the event of unexpected issues.\" The change, first announced in November 2024, comes nearly a year after a\nfaulty CrowdStrike update\ntook down 8.5 million Windows-based machines around the world. In tandem, Microsoft said it's also giving Blue Screen of Death (BSoD) a big visual makeover nearly 40 years after its debut in Windows, turning it black and listing the stop code and faulty system driver behind the crash in an attempt to give more clarity.\nNoyb Accuses Bumble of Violating E.U. GDPR\n— Bumble's partnership with OpenAI for its\nBumble for Friends feature\nviolates Europe's General Data Protection Regulation, according to a complaint from Austrian privacy non-profit noyb. \"Powered by OpenAI's ChatGPT, the feature is designed to help you start a conversation by providing an AI-generated message,\" noyb\nsaid\n. \"In order to do this, your personal profile information is fed into the AI system without Bumble ever obtaining your consent. Although the company repeatedly shows you a banner designed to nudge you into clicking 'Okay,' which suggests that it relies on user consent, it actually claims to have a so-called 'legitimate interest' to use data.\" Noyb said the \"Okay\" option gives users a false sense of control over their data, when it claims to have a legitimate interest in sending user data to OpenAI.\nJitter-Trap Turns Evasion into Detection\n— Cybersecurity researchers have designed a clever new technique called Jitter-Trap that aims to detect post-exploitation and command-and-control (C2) communication stemming from the use of red teaming frameworks like Cobalt Strike, Sliver, Empire, Mythic, and Havoc that are often adopted by threat actors in cyber attacks to maintain access, execute commands, move laterally, and exfiltrate data, while simultaneously evading detection. These tools are known to employ a parameter called \"sleep\" that defines how often the beacon communicates with its operator (i.e., the C2 server). One obfuscation method used to cloak this periodic beaconing activity action is \"jitter,\" which adds a little bit of randomness to the communication pattern to ensure that it remains undetected. \"The jitter property for sleep-time between requests exists to create light randomness with the intent to look natural and like real traffic caused by users,\" Varonis\nsaid\n. Jitter-Trap demonstrates how patterns of randomness can be leveraged by defenders to determine if such traffic exists in the first place, effectively turning attackers' own tactics against them.\nREvil Members Released in Russia\n— Four members of the REvil ransomware group, Andrey Bessonov, Mikhail Golovachuk, Roman Muromsky, and Dmitry Korotayev, have been found guilty in Russia of financial fraud and cybercrimes, and were\nsentenced\nto five years in prison, but were\nultimately released\nafter a court determined that their sentence would amount to time already served while awaiting trial. This amounts to less than three years in detention. It's worth noting that they were arrested in early 2022 on charges relating to trafficking stolen payment data and using malicious software to commit carding fraud. Other members of the crew, Daniil Puzyrevsky, Ruslan Khansvyarov, Aleksey Malozemov, and Artem Zayets, were\njailed for four-and-a-half to six years\nin October 2024. Another REvil member, Yaroslav Vasinksyi, was arrested in 2021 at the Polish border and extradited to the US a year later. Last year, he was sentenced in May 2024 to almost 14 years in prison and ordered to return $16 million to his various victims. It is uncommon for Russia to prosecute its own hackers. In April 2022, Russia\nsaid\nthe U.S. had unilaterally shut down communication channels with Russia on cybersecurity and withdrawn the negotiation process regarding the REvil gang.\nMalicious Python Package Shuts Down Windows Systems\n— A malicious Python package named psslib has been\ndetected\nin the Python Package Index (PyPI) repository masquerading as a password security utility since November 2018, quietly attracting over 3,700 downloads to date. The package is a typosquat of the legitimate passlib library and is capable of immediately shutting down Windows systems when users enter a password that does not match the value set by the package's developer. The library also incorporates the ability to invoke a system reboot without warning or consent. The discovery comes as two \"protestware\" packages with hidden functionality have been\nflagged\nin the npm registry. The packages (@link-loom/ui-sdk and @link-loom-react-sdk) specifically target Russian-language users visiting Russian or Belarusian domains (.ru, .su, and .by) in a web browser, blocking mouse-based interaction on the web page and indefinitely playing the Ukrainian anthem on a loop. That said, the attack ensures that only repeat visitors to the sites are targeted, meaning it's triggered only when the target visits the websites more than once.\nTudou Guarantee Takes Lead After HuiOne Shutdown\n— An illicit Telegram marketplace called Tudou Guarantee has emerged as the main winner following the\nclosure of HuiOne Guarantee\nlast month. The latest findings show that it's business as usual for Chinese-language black markets in the wake of Telegram's takedown of the two biggest of those bazaars, HuiOne Guarantee and Xinbi Guarantee. Both the services are estimated to have enabled a staggering $35 billion in transactions. Blockchain intelligence firm Elliptic said it's tracking more than thirty highly-active guarantee markets. \"Most notably, Tudou Guarantee has seen users more than double – and cryptocurrency inflows are now approximately equal to those seen for HuiOne Guarantee prior to its shutdown,\" the company\nsaid\n. \"Many of the merchants operating on Tudou are the same ones that previously sold through HuiOne Guarantee, offering stolen data, money laundering services and other products needed by scammers.\" The shift is also significant in light of the fact that HuiOne Guarantee is a major shareholder in Tudou Guarantee. It acquired a 30% stake in December 2024. \"These scammers have inflicted misery on millions of victims around the world, stealing billions of dollars. Unless these marketplaces are actively pursued, they will continue to flourish,\" Elliptic's Tom Robinson was\nquoted as saying\nto WIRED.\nSouth Korea Targeted by MeshAgent and SuperShell\n— Windows and Linux servers in South Korea are being targeted by Chinese-speaking threat actors to drop web shells like\nSuperShell\nand remote desktop software such as MeshAgent to establish persistent access and install additional payloads. The IP address used to stage the payloads has also been found to include\nWogRAT\n(short for \"WingsOfGod\"), a backdoor that can collect system information and execute arbitrary commands issued by a remote server. The exact initial access vector used in the attacks is unknown, according to AhnLab. \"The attacker seems to target not only Windows but also Linux, attempting to take control of the network where the infected system belongs by moving from the initial penetration phase to the lateral movement phase,\" the cybersecurity company\nsaid\n. \"While the ultimate goal is unknown, the attacker may steal sensitive information or infect the network with ransomware if they successfully take control of the organization's network.\"\nAndroxGh0st Malware Evolves to Add New Flaws\n— The threat actors behind the\nAndroxGh0st\nmalware have been found leveraging compromised websites associated with the University of California, San Diego, and an unnamed Jamaican events aggregator platform for C2 purposes. Attacks mounted by the Python-based cloud attack tool are known to leverage a wide range of known security flaws, including those affecting Apache Struts, Apache Shiro, FasterXML, Lantronix PremierWave, Popup Maker WordPress plugin, and Spring Framework, to obtain initial access and drop the malware. \"The botnet exploits popular platforms (e.g., Apache Shiro, Spring framework, WordPress) and IoT devices (Lantronix), enabling remote code execution, sensitive data theft, and cryptomining,\" CloudSEK\nsaid\n.\nPhishing Campaign Leverages CapCut Lures\n— A new phasing campaign is employing fake CapCut invoice lures to trick recipients into clicking on bogus links that mimic Apple account login pages and prompt them to enter their financial information to receive a refund. However, the attack is designed to stealthily hoover their credentials and credit card details to an external server. \"As CapCut continues to dominate the short-form video editing scene, cybercriminals are seizing the opportunity to exploit its popularity,\" Cofense\nsaid\n.\nDutch Police Contact 126 Individuals in Connection with Cracked.io\n— Dutch police have\nidentified and contacted\n126 individuals who held accounts on the Cracked.io hacking forum. Authorities filed criminal cases against eight suspects and warned the remaining individuals against engaging in further criminal activity. The youngest person contacted by authorities was 11 years old. Law enforcement agencies from the U.S. and Europe\nseized Cracked and Nulled\nearlier this January. Prior to the takedown, the forum had more than 4.7 million users and was known for selling hacking services, stolen data, and malware.\nVulnerabilities in Airoha SoCs\n— Cybersecurity researchers have discovered three flaws in devices that incorporate Airoha Systems on a Chip (SoCs) that could be weaponized to take over susceptible products without requiring any authentication or pairing, and on certain phones, even eavesdrop on conversations and extract call history and stored contacts. \"Any vulnerable device can be compromised if the attacker is in Bluetooth range,\" the researchers said. The vulnerabilities, assigned the CVE identifiers CVE-2025-20700, CVE-2025-20701, and CVE-2025-20702, relate to missing authentication for GATT Services, missing authentication for Bluetooth BR/EDR, and an unspecified vulnerability in a custom protocol that allows for manipulating the device. The Bluetooth chipset, according to cybersecurity company ERNW, is used in headsets, earbuds, dongles, speakers, and wireless microphones. \"Some vendors are not even aware that they are using an Airoha SoC,\" ERNW\nnoted\n. \"They have outsourced parts of the development of their device, such as the Bluetooth module.\"\nOperation Overload Uses API to Amplify Pro-Russian Propaganda\n— A Russian disinformation operation known as Operation Overload has adopted artificial intelligence (AI) to generate Russian propaganda and spread it across Telegram, X, BlueSky, and TikTok. The activity involves AI-generated or deceptively edited content, often impersonating journalists, public figures, and respected institutions, to interfere with the political discourse in Ukraine, France, Germany, Poland, Moldova, and the United States. \"While anti-Ukrainian narratives continue to dominate, election interference stands out as a prominent theme,\" CheckFirst\nsaid\n.\nCrypto Drainer Scam Impersonates Tax Authorities\n— A new phishing campaign dubbed Declaration Trap has been observed targeting cryptocurrency users by impersonating European tax authorities, specifically Dutch agencies Belastingdienst and MijnOverheid. In these attacks, prospective victims are lured via email messages to phishing sites that harvest personal information and run crypto drainer phishing kits to siphon seed phrases, and perform unauthorized withdrawals by sending malicious transaction signing requests. \"The victim's journey begins with an email that appears to come from Belastingdienst or MijnOverheid and tells the recipient they need to complete a special declaration form for their crypto assets due to new tax regulations introduced in 2025,\" Group-IB\nsaid\n. \"Scammers use pressure tactics: they set short deadlines for completing the form and threaten victims with fines if they don't comply.\" The disclosure comes as IBM X-Force detailed a phishing campaign that's targeting financial institutions across the world with weaponized Scalable Vector Graphics (\nSVG\n) files embedded with JavaScript to steal credentials and drop remote access trojans (RATs). \"When executed, the SVG-embedded JavaScript drops a ZIP archive containing a JavaScript file that is used to download a Java-based loader,\" IBM\nsaid\n. \"If Java is present, it deploys modular malware including Blue Banana RAT, SambaSpy, and SessionBot.\"\nHive0131 Campaign Delivers DCRat in Colombia\n— In a new phishing campaign detected in early May 2025, the threat actor tracked as Hive0131 targeted users in Colombia with bogus notifications about criminal proceedings to initiate an attack chain that ultimately delivered the modular\nDCRat\nmalware to harvest files, keystrokes, and audio and video recordings. \"Hive0131 is a financially motivated group likely originating from South America that routinely conducts campaigns largely in Latin America (LATAM) to deliver a wide array of commodity payloads,\" IBM X-Force\nsaid\n. \"The current campaigns imitate official correspondence and contain either an embedded link or a PDF lure with an embedded link. Clicking on the embedded link will initiate the infection chain to execute the banking trojan 'DCRat' in memory.\" The attacks, which have also been found to either contain a PDF lure with a link to a TinyURL or an embedded link to a Google Docs location, are characterized by the use of an obfuscated .NET loader dubbed VMDetectLoader that's used to download and execute DCRat.\nCISA and NSA Call for Adoption of Memory-Safe Languages\n— The U.S. Cybersecurity and Infrastructure Security Agency, along with the National Security Agency (NSA), issued guidance on adopting memory-safe languages (MSLs)\nsuch as Rust\nto mitigate memory-related vulnerabilities in software. MSLs offer built-in mechanisms such as bounds checking, memory management, data race prevention, and runtime safety checks to protect against memory bugs. \"Achieving better memory safety demands language-level protections, library support, robust tooling, and developer training,\" the agencies\nsaid\n. \"MSLs offer built-in safeguards that shift safety burdens from developers to the language and the development environment. By integrating safety mechanisms directly at the language level, MSLs enhance security outcomes and reduce reliance on after-the-fact analysis tools.\" However, the report also points out the challenges with adopting MSLs due to legacy systems and tightly coupled code, performance overhead, and the availability (or lack thereof) of tools and libraries available for an MSL.\nNew SmartAttack Technique Uses Smartwatches to Steal Air-Gapped Data\n— A new side-channel attack dubbed\nSmartAttack\nhas demonstrated the use of smartwatches as receivers for ultrasonic covert communication in air-gapped environments. The approach, according to Dr. Mordechai Guri, the head of the Offensive Cyber Research Lab in the Department of Software and Information Systems Engineering at the Ben Gurion University of the Negev in Israel, utilizes the built-in microphones of smartwatches to capture covert signals in real-time within the ultrasonic frequency range of 18-22 kHz. As with other attacks of this kind, the threat model presupposes that the attacker has already infiltrated the air-gapped system and implanted malware that operates stealthily, transmitting information using the infected machine's speakers in a frequency range that's inaudible to humans. On the other end, the attack also requires the threat actor to compromise the smartwatch of an individual with access to the secured environment, and deploy malware capable of receiving the covert ultrasonic communication, decoding it, reconstructing it, and forwarding it to the attacker's infrastructure. In an experimental setup, SmartAttack can be used to transmit data through ultrasonic signals over distances of more than 6 meters, with data rates of up to 50 bits per second. Dr. Guri, who disclosed\nRAMBO and PIXHELL\nattacks last year to exfiltrate data from air-gapped systems, said the findings highlight the \"security risks posed by smartwatches in high-security environments.\" Possible mitigations include prohibiting smartwatches and similar audio-capable wearables when entering secure environments, deploying ultrasonic monitoring systems to identify unauthorized transmissions, deploying ultrasonic jammers, and physically removing or disabling audio hardware components.\nGoogle Adds New Security Feature to Tackle XSS Attacks\n— Google has\nadded\na new security feature to the Chrome browser that automatically escapes \"<\" and \">\" characters inside HTML attributes. The new feature is designed to prevent cross-site scripting attacks that rely on slipping in malicious code inside HTML code. The feature shipped with the stable version of Chrome 138 released on June 24, 2025. \"It's possible that a sanitizer may have a DOM tree it considers safe; however, after re-parsing, this DOM tree will be materially different, resulting in an XSS,\" Google's Michał Bentkowski\nsaid\n. This type of XSS attack is called mutation XSS (mXSS).\n🎥 Cybersecurity Webinars\nDesigning Identity for Trust at Scale—With Privacy, AI, and Seamless Logins in Mind\n➝\nIn today's AI-powered world, customer identity is all about trust. This webinar unpacks insights from the Auth0 2025 Trends Report—covering how users react to AI, rising privacy expectations, and the latest identity threats. Whether you're building login flows or trust strategies, you'll get clear, practical advice to stay ahead.\nStop Pip Installing and Praying: Secure Your Python Supply Chain in 2025\n➝\nThe Python ecosystem in 2025 is under attack—from repo jacking and typosquatting to hidden flaws in common container images. If you're still \"pip installing and hoping,\" it's time to rethink. Join security experts as they unpack real threats, explain tools like CVE, Sigstore, and SLSA, and share how PyPI is responding. Whether you're using YOLO models or managing production apps, you'll get clear, practical steps to secure your Python supply chain today.\n🔧 Cybersecurity Tools\nRIFT\n➝\nMicrosoft has open-sourced RIFT, a tool that helps analysts spot attacker-written code in complex Rust malware. As Rust becomes more popular among threat actors, malware is getting harder to analyze. RIFT cuts through the noise by using automated signature matching and binary diffing to highlight only the custom code—saving time and improving detection.\nDisclaimer: These newly released tools are for educational use only and haven't been fully audited. Use at your own risk—review the code, test safely, and apply proper safeguards.\n🔒 Tip of the Week\nBeyond Defaults: Mastering Windows Hardening ➝\nDefault Windows settings are built for ease, not security. That's fine for casual use—but if you care about protecting your data, business, or even just your privacy, it's time to go beyond the basics.\nThe good news? You don't need to be a sysadmin to lock down your system. Tools like HardeningKitty, CIS-CAT Lite, and Microsoft's Security Compliance Toolkit do the heavy lifting for you. They scan your system and tell you exactly what to fix—like disabling outdated protocols (SMBv1, NetBIOS), hardening Office macros, or turning off risky Windows features you don't even use.\nIf that sounds a bit much, don't worry—there are one-click apps too. ConfigureDefender lets you max out Microsoft Defender's protection (including turning on hidden advanced rules). WPD and O&O ShutUp10++ help you cut Windows tracking, bloatware, and junk settings in minutes. Think of them as the \"Privacy + Security\" switches Microsoft should've given you by default.\nWant to get serious? Start with CIS-CAT Lite to see where your system stands, then run HardeningKitty to close the gaps. These aren't just checkboxes—you're cutting off real-world attack paths like phishing payloads, document-based malware, and lateral movement across networks.\nBottom line: You don't have to \"just use Windows as it is.\" You can make it work for you, not against you—without breaking anything. Small changes, big impact.\nConclusion\nIt's easy to get caught up in the technical details, but at the end of the day, it's about making smart decisions with the tools and time we have. No one can fix everything at once—but knowing where the cracks are is half the battle. Whether it's a quick configuration check or a deeper policy rethink, small steps add up.\nTake a few minutes to scan the highlights and see where your team might need a second look.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "U.S. warns of Iranian cyber threats on critical infrastructure",
        "Link": "https://www.bleepingcomputer.com/news/security/us-warns-of-iranian-cyber-threats-on-critical-infrastructure/",
        "Summary": "U.S. cyber agencies, the FBI, and NSA issued an urgent warning today about potential cyberattacks from Iranian-affiliated hackers targeting U.S. critical infrastructure. [...]",
        "Date": "2025-06-30",
        "Content": "U.S. cyber agencies, the FBI, and NSA issued an urgent warning today about potential cyberattacks from Iranian-affiliated hackers targeting U.S. critical infrastructure.\nCISA says there are no indications of an ongoing campaign but urges critical infrastructure organizations and other potential targets to monitor their defense due to the current unrest in the Middle East and cyber attacks previously linked to Iran.\nIn a\njoint fact sheet\n, the cyber agencies warn that Defense Industrial Base (DIB) companies with ties to Israeli defense and research, are at increased risk at being targeted. Other organizations in critical infrastructure sectors, including energy, water, and healthcare, are also considered potential targets.\nThe advisory warns that Iranian threat actors are Iran are known to exploit unpatched vulnerabilities or utilize default passwords to gain breach systems. This was seen last year when IRGC-affiliated Iranian threat actors\nbreached a Pennsylvania water facility\nin November 2023 by hacking into Unitronics programmable logic controllers (PLCs) exposed online.\nIranian-affiliated hackers also work with or act as hacktivists, performing distributed denial-of-service (DDoS) attacks or defacing websites. These attacks are often conducted in conjunction with politically motivated messages, with the attackers promoting their activities on X and Telegram.\nIranian threat actors have also been observed\nutilizing ransomware\nor working as affiliates\nwith Russian ransomware gangs\n, such as NoEscape, Ransomhouse, and ALPHV (also known as BlackCat). Many of these attacks were focused on Israeli companies, where they encrypted devices and leaked stolen data.\nIn some cases, the\nattackers used data wipers\ninstead of ransomware to conduct destructive attacks on organizations.\nMitigating attacks\nCISA, the DoD, the FBI, and the NSA are urging organizations to adopt the following best practices to protect against these threats:\nIsolate OT and ICS systems from the public internet and restrict remote access.\nUse strong, unique passwords for all online accounts and systems, changing all default account passwords.\nEnable multi-factor authentication (MFA) for critical systems and authentication platforms.\nInstall all software updates, especially on internet-facing systems to fix known vulnerabilities.\nMonitor networks and servers for unusual activity.\nDevelop and test incident response plans to make sure that all backups and recovery plans are working.\nFor more information, organizations can read\nCISA's Iran Threat Overview\nand the\nFBI's Iran Threat web pages\n.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nUS Homeland Security warns of escalating Iranian cyberattack risks\nPro-Israel hackers hit Iran's Nobitex exchange, burn $90M in crypto\nAnubis ransomware adds wiper to destroy files beyond recovery\nNew IOCONTROL malware used in critical infrastructure attacks\nFog ransomware attack uses unusual mix of legitimate and open-source tools"
    },
    {
        "Title": "Germany asks Google, Apple to remove DeepSeek AI from app stores",
        "Link": "https://www.bleepingcomputer.com/news/security/germany-asks-google-apple-remove-deepseek-ai-from-app-stores/",
        "Summary": "The Berlin Commissioner for Data Protection has formally requested Google and Apple to remove the DeepSeek AI application from the application stores due to GDPR violations. [...]",
        "Date": "2025-06-30",
        "Content": "The Berlin Commissioner for Data Protection has formally requested Google and Apple to remove the DeepSeek AI application from the application stores due to GDPR violations.\nThe commissioner, Meike Kamp, alleges that DeepSeek’s owner, Hangzhou DeepSeek Artificial Intelligence, based in Beijing, unlawfully collects data from German users and transfers them for processing in servers in China.\nAs per the GDPR and Article 46 (1) specifically, any personal data collected from individuals in the European Union must be protected according to the standards upheld by the regulatory act.\nHowever, China has very lax data protection regulations and a history of excessive data access requests to private entities. Because of this, it is unlikely that DeepSeek has implemented sufficient legal safeguards to guarantee its security to EU standards.\n“The company has no branch within the European Union (EU),”\nexplains the commissioner\n.\n“The service is made available to users in Germany, among other places, through apps in the Google Play Store and Apple App Store with German-language descriptions and can be used in the German language.”\n“This makes the service subject to the provisions of the European General Data Protection Regulation (GDPR).”\nDeepSeek is a Chinese AI platform that rose to prominence in January 2025 after the release of the third generation of its chatbot, which came with extensive capabilities.\nAlthough this sudden popularity was quickly tarnished by\nserious cybersecurity problems\nthat exposed\ninsecure practices\n, the platform continued to enjoy popularity in the global AI community.\nThe DeepSeek AI app has\n50 million downloads on Google Play\n, Android’s official app store, and\nthousands of ratings on Apple’s App Store\n.\nKamp had requested DeepSeek to voluntarily remove its apps from app stores in Germany this year on May 6 but the company refused to comply.\nHence, the Berlin authorities now made use of Article 16 of the Digital Services Act (DSA), which allows them to report illegal content on platforms to the respective operators, in this case, Apple and Google.\nThe two tech giants will now have to review the commissioner’s report and decide whether DeepSeek AI will be removed from their stores or not.\nAlthough the request was submitted by a state-level regulator and not the German government, there is coordinationwith other regulators from Baden-Württemberg, Rhineland-Palatinate, and Bremen, as well as the Federal Network Agency (Bundesnetzagentur).\nBleepingComputer has contacted Google, Apple, and DeepSeek to comment on the situation, and we will update this post when we hear back from them.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nGermany fines Vodafone $51 million for privacy, security breaches\nGermany takes down eXch cryptocurrency exchange, seizes servers\nDDoS site Dstat.cc seized and two suspects arrested in Germany\nTikTok fined €530 million for sending European user data to China\nWhatsApp unveils 'Private Processing' for cloud-based AI features"
    },
    {
        "Title": "Microsoft Defender for Office 365 now blocks email bombing attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/microsoft-defender-for-office-365-now-blocks-email-bombing-attacks/",
        "Summary": "Microsoft says its Defender for Office 365 cloud-based email security suite will now automatically detect and block email bombing attacks. [...]",
        "Date": "2025-06-30",
        "Content": "Microsoft says its Defender for Office 365 cloud-based email security suite will now automatically detect and block email bombing attacks.\nDefender for Office 365 (formerly known as Office 365 Advanced Threat Protection or Office 365 ATP) protects organizations operating in high-risk industries and dealing with sophisticated threat actors from malicious threats from email messages, links, and collaboration tools.\n\"We're introducing a new detection capability in Microsoft Defender for Office 365 to help protect your organization from a growing threat known as email bombing,\" Redmond\nexplains\nin a Microsoft 365 message center update.\n\"This form of abuse floods mailboxes with high volumes of email to obscure important messages or overwhelm systems. The new 'Mail Bombing' detection will automatically identify and block these attacks, helping security teams maintain visibility into real threats.\"\nThe new 'Mail Bombing' feature started rolling out in late June 2025 and is expected to reach all organizations by late July. It will be toggled on by default, requires no manual configuration, and will automatically send all messages identified as part of a mail bombing campaign to the Junk folder.\nAs the company\nexplained\nover the weekend, Mail Bombing is now available for security operations analysts and administrators as a new detection type in Threat Explorer, the Email entity page, the Email summary panel, and Advanced Hunting.\nIn mail bombing attacks, threat actors flood their targets' email inboxes with thousands or tens of thousands of messages within minutes, either by subscribing them to a large number of newsletters or using dedicated cybercrime services that can send a massive number of emails.\nIn most cases, the attackers' ultimate goal is to overload email security systems as part of social engineering schemes, paving the way to malware or ransomware attacks that can help exfiltrate sensitive data from victims' compromised systems.\nEmail bombing has been employed in attacks by various cybercrime and ransomware groups for over a year. It began with the BlackBasta gang,\nwhich used this tactic\nto fill their victims' mailboxes with emails within minutes before launching their attacks.\nThey would follow up with voice phishing cold calls, posing as their IT support teams\nto trick overwhelmed employees\ninto granting remote access to their devices using AnyDesk or the built-in Windows Quick Assist tool.\nAfter infiltrating their systems, the attackers would deploy various malicious tools and malware implants, enabling them to move laterally through corporate networks before deploying ransomware payloads.\nMore recently, email bombing has been adopted by\na 3AM ransomware affiliate\nand\ncybercriminals linked to the FIN7 group\n, who have also spoofed IT support in social engineering attacks aimed at persuading employees to give up their credentials for remote access to corporate systems.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMicrosoft 365 'Direct Send' abused to send phishing as internal users\nMicrosoft fixes Outlook bug causing crashes when opening emails\nChainLink Phishing: How Trusted Domains Become Threat Vectors\nMicrosoft 365 to block file access via legacy auth protocols by default\nMicrosoft blocks ActiveX by default in Microsoft 365, Office 2024"
    },
    {
        "Title": "Switzerland says government data stolen in ransomware attack",
        "Link": "https://www.bleepingcomputer.com/news/security/switzerland-says-government-data-stolen-in-ransomware-attack/",
        "Summary": "The government in Switzerland is informing that sensitive information from various federal offices has been impacted by a ransomware attack at the third-party organization Radix. [...]",
        "Date": "2025-06-30",
        "Content": "The government in Switzerland is informing that sensitive information from various federal offices has been impacted by a ransomware attack at the third-party organization Radix.\nThe hackers have stolen data from Radix systems and later leaked it on the dark web, the Swiss government says.\nThe exposed data is being analyzed with the help of the country’s National Cyber Security Centre (NCSC) to determine which government agencies are impacted and to what effect.\n“The foundation Radix has been targeted by a ransomware attack, during which data was stolen and encrypted,”\nannounced the Swiss government\n.\n“Radix’s customers include various federal offices. The data has been published on the dark web and will now be analyzed by the relevant offices.”\nSarcoma ransomware attack\nRadix is a Zurich-based non-profit organization dedicated to health promotion. It operates eight competence centers that carry out projects and services commissioned by the Swiss federal government, cantonal and municipal authorities, and other public and private organizations.\nThe organization\nissued a statement\nsaying that Sarcoma ransomware affiliates compromised its systems on June 16.\nSarcoma is a rapidly emerging ransomware group that began operations in October 2024, quickly becoming one of the most active by claiming 36 victims in its first month. One notable case was an attack against\nPCB giant Unimicron\n.\nSarcoma gains access through phishing, older vulnerabilities, and supply-chain attacks. Then the hackers typically rake advantage of RDP connections and move laterally on the network. In the last stage of the attack, the threat actor steals data and may also encrypt it.\nThe threat actor published the data stolen from Radix on their leak portal on the dark web on June 29, likely after extortion efforts failed.\nRadix data exposed on Sarcoma's dark web portal\nSource: BleepingComputer\nRadix says it informed impacted individuals via personalized notifications and notes that there is no evidence that sensitive data from partner organizations was affected.\nMeanwhile, Sarcoma appears to have published a 1.3TB archive on its extortion portal, including several document scans, financial records, contracts, and communications. The data is being offered for free.\nTo mitigate this risk, Radix suggests that potentially exposed individuals remain vigilant over the coming months and be wary of attempts to get their passwords, credit card numbers, and account credentials.\nBleepingComputer has contacted NCSC to request more information about the data unearthed by the ongoing investigations, but a comment wasn’t immediately available.\nIn March 2024, the Swiss government confirmed it had suffered a similar exposure via third-party software services provider Xplain, which was breached by the Play ransomware group on May 23, 2023.\nThat incident resulted in the\nleak of 65,000 documents\nrelating to the Federal Administration, many of which contained sensitive personal information.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nCoinbase breach tied to bribed TaskUs support agents in India\nAustralian Human Rights Commission leaks docs to search engines\nRetail giant Ahold Delhaize says data breach affects 2.2 million people\nMcLaren Health Care says data breach impacts 743,000 patients\nOxford City Council suffers breach exposing two decades of data"
    },
    {
        "Title": "Hikvision Canada ordered to cease operations over security risks",
        "Link": "https://www.bleepingcomputer.com/news/security/hikvision-canada-ordered-to-cease-operations-over-security-risks/",
        "Summary": "The Canadian government has ordered Hikvision's subsidiary in the country to cease all operations following a review that determined them to pose a national security risk. [...]",
        "Date": "2025-06-30",
        "Content": "The Canadian government has ordered Hikvision’s subsidiary in the country to cease all operations following a review that determined them to pose a national security risk.\nThe order was forwarded to Hikvision last Friday, and the matter was made public over the weekend by Mélanie Joly, Canada's Minister of Innovation, Science and Industry.\n“Following a National Security Review under the Investment Canada Act, the Government of Canada has ordered Hikvision Canada Inc. to cease all operations in Canada and close its Canadian business,” reads the\nannouncement\n.\n“The government has determined that Hikvision Canada Inc.’s continued operations in Canada would be injurious to Canada’s national security.”\nWhile Canadian authorities did not share the findings leading to the decision, they say that the ruling is based on a multi-step review of information and evidence provided by the country's security and intelligence community.\nApart from banning Hikvision Canada's operations, the decision also bans all government organizations and crown corporations from buying and using Hikvision equipment.\nCanada government announcement\nSource: @melaniejoly | X\nHikvision Canada Inc. is the Canadian subsidiary of Hangzhou Hikvision Digital Technology Co., Ltd., the world’s largest manufacturer of video surveillance equipment.\nLaunched in 2014, Hikvision Canada has maintained a strong market presence in the country, supplying cost-effective end-to-end security and Artificial Intelligence with the Internet of Things (AIoT) solutions that cover IP cameras, facial detection, intrusion alerts, smart home devices, industrial automation, and building management systems.\nHikvision has faced regulatory scrutiny worldwide in recent years based on its ties to the Chinese government and the potential of its devices serving as a medium for  collecting intelligence and for espionage.\nThough solid evidence of such allegations has not been published, multiple governments,\nincluding the US\n, have banned the sale of Hikvision products based on security reviews.\nResponding to the latest development in Canada, Hikvision has issued a statement condemning the decision and calling the allegations unfounded and politically motivated.\n“We strongly disagree with this decision and view it with deep concern, as we believe it lacks a factual basis, procedural fairness, and transparency,”\nresponded Hikvision\n.\n“Instead of evaluating our technology on its cybersecurity merits, the decision appears to be driven by the parent company’s country of origin, reflecting broader geopolitical tensions and an unjustified bias against Chinese companies.”\nThe firm also notes that, during the security review, it responded to all of Canada’s requests for information with speed and transparency but never received evidence that substantiated the decision to ban its products in the country.\nIt is important to clarify that Canada’s latest action restricts to government's use of Hikvision products and does not apply to products made by Hikvision affiliates outside of Canada.\nHowever, authorities “strongly encourage” all Canadians to take note of the conclusion and make their own decision when choosing surveillance equipment.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nUS House bans WhatsApp on staff devices over security concerns\nGermany asks Google, Apple to remove DeepSeek AI from app stores\nEuropol helps disrupt $540 million crypto investment fraud ring\nFTC approves $126 million in Fortnite refunds over ‘dark patterns’\nCanada says Salt Typhoon hacked telecom firm via Cisco flaw"
    },
    {
        "Title": "Microsoft warns of Windows update delays due to wrong timestamp",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-warns-of-Windows-security-update-delays-due-to-incorrect-metadata-timestamp/",
        "Summary": "Microsoft has confirmed a new known issue causing delivery delays for June 2025 Windows security updates due to an incorrect metadata timestamp. [...]",
        "Date": "2025-06-30",
        "Content": "Microsoft has confirmed a new known issue causing delivery delays for June 2025 Windows security updates due to an incorrect metadata timestamp.\nAs Redmond explains in recent advisory updates, this bug affects Windows 10 and Windows 11 systems in environments with quality update deferral policies that enable admins to delay update installation on managed devices.\nWhile update deployment delays are an expected result when using such policies, the wrong timestamp for the June security updates will postpone them beyond the period specified by administrators, potentially exposing unpatched systems to attacks.\n\"Some devices in environments where IT admins use quality update (QU) deferral policies might experience delays in receiving the June 2025 Windows security update,\" Microsoft\nexplains\n. \"Although the update was released on June 10, 2025, its update metadata timestamp reflects a date of June 20, 2025. This discrepancy might cause devices with configured deferral periods to receive the update later than expected.\"\nWhile still investigating this known issue, Microsoft has provided Windows admins with several temporary workarounds to accelerate deployment for the June 2025 updates until a fix is available.\nTo achieve this, Redmond recommends creating an expedited deployment policy to bypass deferral settings and ensure that the updates are delivered immediately in organizations using Windows Autopatch. As an alternative, admins can modify deferral configurations or deployment rings to minimize the delay for impacted devices.\nAs detailed in a\nnew Microsoft 365 Message Center advisory\n, this can be done by going through the following steps:\nGo to Intune \\ Devices \\ Windows Updates.\nClick on the Quality Updates Tab.\nClick \"Create Expedite Policy\".\nSelect the 6B release, fill out other relevant details, and assign desired Entra groups.\nValidate your update as normal and assign additional groups to the policy to finish rolling out the latest updates to your devices.\n\"This delay issue affects only the timing of update availability for organizations using QU deferral policies and doesn't impact the quality or applicability of the update,\" Microsoft added. \"We will not change the metadata value from the current June 20, 2025, value. This workaround is the final resolution we will provide for this issue.\"\nEarlier this month, Microsoft\nrolled out a configuration update\n(KB5062324) to address a known issue that caused update failures after the scan for Windows updates stopped responding on some Windows 11 systems.\nIn May, Redmond\nfixed another bug\nblocking Windows 11 24H2 feature updates from being delivered via Windows Server Update Services (WSUS) after installing the April 2025 security updates.\nOne month earlier, it addressed what it described as a \"latent code issue\" that was\ncausing some PCs to be upgraded to Windows 11\novernight despite Intune policies designed to block Windows 11 upgrades.\nIn May, the company also revealed that it aims\nto update all software on your PC\nvia a new update orchestration platform built on top of the existing Windows Update infrastructure, a platform that aims to unify the updating system for all apps, drivers, and system components across all Windows systems.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMicrosoft: Windows 11 might fail to start after installing KB5058405\nMicrosoft confirms Family Safety blocks Google Chrome from launching\nMicrosoft creates separate Windows 11 24H2 update for incompatible PCs\nWindows Server emergency update fixes Hyper-V VM freezes, restart issues\nMicrosoft fixes known issue that breaks Windows 11 updates"
    },
    {
        "Title": "Europol helps disrupt $540 million crypto investment fraud ring",
        "Link": "https://www.bleepingcomputer.com/news/security/europol-helps-disrupt-540-million-crypto-investment-fraud-ring/",
        "Summary": "Spanish authorities have arrested five individuals in Madrid and the Canary Islands, suspected of laundering $540 million (€460 million) from illegal cryptocurrency investment schemes and defrauding more than 5,000 victims. [...]",
        "Date": "2025-06-30",
        "Content": "Spanish authorities have arrested five individuals in Madrid and the Canary Islands, suspected of laundering $540 million (€460 million) from illegal cryptocurrency investment schemes and defrauding more than 5,000 victims.\nThe law enforcement operation was supported and coordinated by Europol and investigators from Estonia, France, and the U.S. (Homeland Security Investigations – HSI).\nThe investigation into the fraud ring started in 2023 On the day of the arrests a cryptocurrency expert was deployed in Spain to ensure that the stolen amounts could be retrieved/traced.\nAlthough the investigation of methods used continues, the police believes they have have an understanding of the syndicate's modus operandi, which involved routing the money through obfuscation channels in Asia.\n“To carry out their fraudulent activities, the leaders of the criminal network allegedly used a net of associates spread around the world to raise funds through cash withdrawals, bank transfers and crypto-transfers,”\nexplains Europol in the announcement\n.\n“Investigators suspect the criminal organization of having set up a corporate and banking network based in Hong Kong, allegedly using payment gateways and user accounts in the names of different people and in different exchanges to receive, store and transfer criminal funds.”\nEuropol makes special mention of the role of artificial intelligence (AI) in proliferating investment scams that are becoming more sophisticated.\nThe Spanish police made\nanother arrest in April 2025\nthat backs this trend of growing AI use in scams. During that operation, six individuals were arrested for their involvement in a large-scale cryptocurrency investment scam that relied on AI tools to generate convincing deepfake ads with celebrities.\nEuropol calls the scale, variety, and reach of these schemes “unprecedented,” warning that online fraud is expected to surpass all other types of organized fraud in the coming years.\nThe Federal Trade Commission (FTC) in the U.S. recently reported that\nAmericans lost $12.5 billion\nto online fraud in 2024, a record figure for the country.\nEarlier this month, the U.S. Department of Justice announced the\nretrieval of $225 million\nin cryptocurrency linked to investment fraud. Although the seizure of this amount is a record for the U.S. Secret Service, it represents a mere fraction of the anual losses.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nOperation Secure disrupts global infostealer malware operations\nUS arrests suspects behind $73M ‘pig butchering’ laundering scheme\nPolice arrests 20 suspects for distributing child sexual abuse content\nGermany takes down eXch cryptocurrency exchange, seizes servers\nBreachForums hacking forum operators reportedly arrested in France"
    },
    {
        "Title": "FBI: Cybercriminals steal health data posing as fraud investigators",
        "Link": "https://www.bleepingcomputer.com/news/security/fbi-warns-cybercriminals-steal-health-data-posing-as-fraud-investigators/",
        "Summary": "The Federal Bureau of Investigation (FBI) has warned Americans of cybercriminals impersonating health fraud investigators to steal their sensitive information. [...]",
        "Date": "2025-06-30",
        "Content": "The Federal Bureau of Investigation (FBI) has warned Americans of cybercriminals impersonating health fraud investigators to steal their sensitive information.\nAs the federal law enforcement agency cautioned in a Friday public service announcement, scammers posing as \"legitimate health insurers and their investigative team members\" are emailing or messaging potential victims to pressure them into providing personal or health data that can later be used for fraudulent purposes.\n\"These criminals are sending emails and text messages to patients and health care providers, disguising them as legitimate communications from trusted health care authorities,\" the FBI\nsaid\n.\n\"The messages are designed to pressure victims into disclosing protected health information, medical records, personal financial details, or providing reimbursements for alleged service overpayments or non-covered services.\"\nThe FBI also shared several tips to help protect against fraudulent attempts, advising Americans to be cautious of unsolicited emails, texts, and calls that request personal information and never to click on links contained in such suspicious messages.\nAdditionally, it recommends using strong passwords and enabling Multi-Factor Authentication for all accounts. Before sharing any personal or healthcare information, individuals should also contact their health insurance provider directly to verify the legitimacy of any messages they receive.\nIn March, the Federal Trade Commission (FTC)\nreported\nthat Americans lost a staggering $2.95 billion to imposter scams in 2024. Imposter scams were the most frequently reported type of scam, with more than 845,000 reports filed throughout the year, resulting in a median loss of $800 for one in five victims.\nOne month later, the FBI\nrevealed\nthat cybercriminals had stolen a record $16.6 billion in 2024, marking a 33.3% increase in losses compared to the previous year.\nAs the Department of Health and Human Services (HHS)\nwarned\nin April 2024, cybercriminals are also targeting organizations in the Healthcare and Public Health (HPH) sector using social engineering tactics targeting their IT help desks, breach their systems, and redirect bank transactions in business email compromise (BEC) attacks.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nEuropol helps disrupt $540 million crypto investment fraud ring\nMicrosoft 365 'Direct Send' abused to send phishing as internal users\nHacker 'IntelBroker' charged in US for global data theft breaches\nTrezor’s support platform abused in crypto theft phishing attacks\nNew FileFix attack weaponizes Windows File Explorer for stealthy commands"
    },
    {
        "Title": "Over 1,200 Citrix servers unpatched against critical auth bypass flaw",
        "Link": "https://www.bleepingcomputer.com/news/security/over-1-200-citrix-servers-unpatched-against-critical-auth-bypass-flaw/",
        "Summary": "Over 1,200 Citrix NetScaler ADC and NetScaler Gateway appliances exposed online are unpatched against a critical vulnerability believed to be actively exploited, allowing threat actors to bypass authentication by hijacking user sessions. [...]",
        "Date": "2025-06-30",
        "Content": "Over 1,200 Citrix NetScaler ADC and NetScaler Gateway appliances exposed online are unpatched against a critical vulnerability believed to be actively exploited, allowing threat actors to bypass authentication by hijacking user sessions.\nTracked as CVE-2025-5777 and referred to as Citrix Bleed 2, this out-of-bounds memory read vulnerability results from insufficient input validation, enabling unauthenticated attackers to access restricted memory regions.\nA similar Citrix security flaw, dubbed \"CitrixBleed,\" was exploited in\nransomware attacks\nand\nbreaches targeting governments\nin 2023 to hack NetScaler devices and move laterally across compromised networks.\nSuccessfully exploiting CVE-2025-5777 could allow threat actors to steal session tokens, credentials, and other sensitive data from public-facing gateways and virtual servers, enabling them to\nhijack user sessions\nand bypass multi-factor authentication (MFA).\nIn a June 17 advisory, Citrix\nwarned\ncustomers to terminate all active ICA and PCoIP sessions after upgrading all their NetScaler appliances to a patched version to block potential attacks.\nOn Monday, security analysts from the internet security nonprofit Shadowserver Foundation\nhave discovered\nover the weekend that 2,100 appliances were still vulnerable to CVE-2025-5777 attacks.\nUnpatched NetScaler appliances exposed online (Shadowserver)\nWhile Citrix has yet to confirm that this security flaw is being exploited in the wild,\nsaying\nthat \"currently, there is no evidence to suggest exploitation of CVE-2025-5777,\" cybersecurity firm ReliaQuest reported on Thursday with medium confidence that the vulnerability is already being abused in targeted attacks.\n\"While no public exploitation of CVE-2025-5777, dubbed 'Citrix Bleed 2,' has been reported, ReliaQuest assesses with medium confidence that attackers are actively exploiting this vulnerability to gain initial access to targeted environments,\"\nReliaQuest warned\n.\nReliaQuest identified indicators suggesting post-exploitation activity following unauthorized Citrix access, including a hijacked Citrix web session indicating a successful MFA bypass attempt, session reuse across multiple IP addresses (including suspicious ones), and LDAP queries linked to Active Directory reconnaissance activities.\nShadowserver also\nfound\nover 2,100 NetScaler appliances unpatched against another critical vulnerability (CVE-2025-6543), now actively\nexploited in denial-of-service (DoS) attacks\n.\nWith both flaws being tagged as critical severity vulnerabilities, administrators are advised to deploy the latest patches from Citrix as soon as possible. Companies should also review their access controls and monitor Citrix NetScaler appliances for suspicious user sessions and activity.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nCitrix Bleed 2 flaw now believed to be exploited in attacks\nCitrix warns of NetScaler vulnerability exploited in DoS attacks\nNew 'CitrixBleed 2' NetScaler flaw let hackers hijack sessions\nCisco warns of max severity RCE flaws in Identity Services Engine\nCISA: AMI MegaRAC bug enabling server hijacks exploited in attacks"
    },
    {
        "Title": "Scattered Spider Hacking Spree Continues With Airline Sector Attacks",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/scattered-spider-hacking-spree-airline-sector",
        "Summary": "Microsoft has called the hacker collective one of the most dangerous current cyberthreats.",
        "Date": "2025-06-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/scattered-spider-hacking-spree-airline-sector"
    },
    {
        "Title": "Hired Hacker Assists Drug Cartel in Finding, Killing FBI Sources",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/hacker-drug-cartel-killing-fbi-sources",
        "Summary": "According to a government report, El Chapo's Sinaloa drug cartel used a hacker to spy on people connected to the FBI's 2018 investigation against the kingpin, which led to deadly consequences.",
        "Date": "2025-06-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/hacker-drug-cartel-killing-fbi-sources"
    },
    {
        "Title": "Chinese Company Hikvision Banned By Canadian Government",
        "Link": "https://www.darkreading.com/threat-intelligence/hikvision-banned-canadian-government",
        "Summary": "Though the company's video surveillance products will be prohibited for government use, individuals and private businesses can still buy the vendor's products.",
        "Date": "2025-06-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/hikvision-banned-canadian-government"
    },
    {
        "Title": "Airoha Chip Vulns Put Sony, Bose Earbuds &amp; Headphones at Risk",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/airoha-chip-vulns-sony-bose-earbuds-headphones",
        "Summary": "The vulnerabilities, which have yet to be published, could allow a threat actor to hijack not only Bluetooth earbuds and headphones but also the devices connected to them.",
        "Date": "2025-06-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/airoha-chip-vulns-sony-bose-earbuds-headphones"
    },
    {
        "Title": "AI-Themed SEO Poisoning Attacks Spread Info, Crypto Stealers",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/ai-seo-poisoning-attack-info-crypto-stealers",
        "Summary": "Malicious websites designed to rank high in Google search results for ChatGPT and Luma AI deliver the Lumma and Vidar infostealers and other malware.",
        "Date": "2025-06-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/ai-seo-poisoning-attack-info-crypto-stealers"
    },
    {
        "Title": "Why Cybersecurity Should Come Before AI in Schools",
        "Link": "https://www.darkreading.com/endpoint-security/cybersecurity-before-ai-schools",
        "Summary": "The sooner we integrate cybersecurity basics into school curriculum, the stronger and more resilient our children — and their futures — will be.",
        "Date": "2025-06-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/cybersecurity-before-ai-schools"
    },
    {
        "Title": "Senator Chides FBI for Weak Advice on Mobile Security",
        "Link": "https://krebsonsecurity.com/2025/06/senator-chides-fbi-for-weak-advice-on-mobile-security/",
        "Summary": "Agents with the Federal Bureau of Investigation (FBI) briefed Capitol Hill staff recently on hardening the security of their mobile devices, after a contacts list stolen from the personal phone of the White House Chief of Staff Susie Wiles was reportedly used to fuel a series of text messages and phone calls impersonating her to U.S. lawmakers. But in a letter this week to the FBI, one of the Senate's most tech-savvy lawmakers says the feds aren't doing enough to recommend more appropriate security protections that are already built into most consumer mobile devices.",
        "Date": "2025-06-30",
        "Content": "Agents with the Federal Bureau of Investigation (FBI) briefed Capitol Hill staff recently on hardening the security of their mobile devices, after a contacts list stolen from the personal phone of the White House Chief of Staff Susie Wiles was reportedly used to fuel a series of text messages and phone calls impersonating her to U.S. lawmakers. But in a letter this week to the FBI, one of the Senate’s most tech-savvy lawmakers says the feds aren’t doing enough to recommend more appropriate security protections that are already built into most consumer mobile devices.\nA screenshot of the first page from Sen. Wyden’s letter to FBI Director Kash Patel.\nOn May 29, The Wall Street Journal reported that federal authorities were investigating a clandestine effort to impersonate Ms. Wiles via text messages and in phone calls that may have used AI to spoof her voice. According to The Journal, Wiles told associates her cellphone contacts were hacked, giving the impersonator access to the private phone numbers of some of the country’s most influential people.\nThe execution of this phishing and impersonation campaign — whatever its goals may have been — suggested the attackers were financially motivated, and not particularly sophisticated.\n“It became clear to some of the lawmakers that the requests were suspicious when the impersonator began asking questions about Trump that Wiles should have known the answers to—and in one case, when the impersonator asked for a cash transfer, some of the people said,” the Journal wrote. “In many cases, the impersonator’s grammar was broken and the messages were more formal than the way Wiles typically communicates, people who have received the messages said. The calls and text messages also didn’t come from Wiles’s phone number.”\nSophisticated or not, the impersonation campaign was soon punctuated by the murder of Minnesota House of Representatives Speaker Emerita Melissa Hortman and her husband, and the shooting of Minnesota State Senator John Hoffman and his wife. So when FBI agents offered in mid-June to brief U.S. Senate staff on mobile threats, more than 140 staffers took them up on that invitation (a remarkably high number considering that no food was offered at the event).\nBut according to Sen. Ron Wyden (D-Ore.), the advice the FBI provided to Senate staffers was largely limited to remedial tips, such as not clicking on suspicious links or attachments, not using public wifi networks, turning off bluetooth, keeping phone software up to date, and rebooting regularly.\n“This is insufficient to protect Senate employees and other high-value targets against foreign spies using advanced cyber tools,” Wyden wrote in a letter sent today to FBI Director Kash Patel. “Well-funded foreign intelligence agencies do not have to rely on phishing messages and malicious attachments to infect unsuspecting victims with spyware. Cyber mercenary companies sell their government customers advanced ‘zero-click’ capabilities to deliver spyware that do not require any action by the victim.”\nWyden stressed that to help counter sophisticated attacks, the FBI should be encouraging lawmakers and their staff to enable anti-spyware defenses that are built into Apple’s iOS and Google’s Android phone software.\nThese include Apple’s Lockdown Mode, which is designed for users who are worried they may be subject to targeted attacks. Lockdown Mode restricts non-essential iOS features to reduce the device’s overall attack surface. Google Android devices carry a similar feature called Advanced Protection Mode.\nWyden also urged the FBI to update its training to recommend a number of other steps that people can take to make their mobile devices less trackable, including the use of ad blockers to guard against malicious advertisements, disabling ad tracking IDs in mobile devices, and opting out of commercial data brokers (the suspect charged in the Minnesota shootings reportedly used multiple people-search services to find the home addresses of his targets).\nThe senator’s letter notes that while the FBI has recommended all of the above precautions in various advisories issued over the years, the advice the agency is giving now to the nation’s leaders needs to be more comprehensive, actionable and urgent.\n“In spite of the seriousness of the threat, the FBI has yet to provide effective defensive guidance,” Wyden said.\nNicholas Weaver is a researcher with the International Computer Science Institute, a nonprofit in Berkeley, Calif. Weaver said Lockdown Mode or Advanced Protection will mitigate many vulnerabilities, and should be the default setting for all members of Congress and their staff.\n“Lawmakers are at exceptional risk and need to be exceptionally protected,” Weaver said. “Their computers should be locked down and well administered, etc. And the same applies to staffers.”\nWeaver noted that Apple’s Lockdown Mode has a track record of blocking zero-day attacks on iOS applications; in September 2023, Citizen Lab documented how Lockdown Mode foiled a zero-click flaw capable of installing spyware on iOS devices without any interaction from the victim.\n\nEarlier this month, Citizen Lab researchers documented a zero-click attack used to infect the iOS devices of two journalists with Paragon’s Graphite spyware. The vulnerability could be exploited merely by sending the target a booby-trapped media file delivered via iMessage. Apple also recently updated its advisory for the zero-click flaw (CVE-2025-43200), noting that it was mitigated as of iOS 18.3.1, which was released in February 2025.\nApple has not commented on whether CVE-2025-43200 could be exploited on devices with Lockdown Mode turned on. But HelpNetSecurity observed that at the same time Apple addressed CVE-2025-43200 back in February, the company fixed another vulnerability flagged by Citizen Lab researcher Bill Marczak: CVE-2025-24200, which Apple said was used in an extremely sophisticated physical attack against specific targeted individuals that allowed attackers to disable USB Restricted Mode on a locked device.\nIn other words, the flaw could apparently be exploited only if the attacker had physical access to the targeted vulnerable device. And as the old infosec industry adage goes, if an adversary has physical access to your device, it’s most likely not your device anymore.\nI can’t speak to Google’s Advanced Protection Mode personally, because I don’t use Google or Android devices. But I have had Apple’s Lockdown Mode enabled on all of my Apple devices since it was first made available in September 2022. I can only think of a single occasion when one of my apps failed to work properly with Lockdown Mode turned on, and in that case I was able to add a temporary exception for that app in Lockdown Mode’s settings.\nMy main gripe with Lockdown Mode was captured in a March 2025 column by TechCrunch’s Lorenzo Francheschi-Bicchierai, who wrote about its penchant for periodically sending mystifying notifications that someone has been blocked from contacting you, even though nothing then prevents you from contacting that person directly. This has happened to me at least twice, and in both cases the person in question was already an approved contact, and said they had not attempted to reach out.\nAlthough it would be nice if Apple’s Lockdown Mode sent fewer, less alarming and more informative alerts, the occasional baffling warning message is hardly enough to make me turn it off.\n\r\n         This entry was posted on Monday 30th of June 2025 01:33 PM \r\n         \nThe only way to protect the “Washington Wizards” from themselves is to issue them “dumb phones” that can only make calls.\nYears ago in a meet and greet with a former US Senator, he was the first person I’d heard refer to his cohorts in the Senate and House with this sarcastic term.  Make no mistake, he was making it obvious most in Washington are far from wizards.\nThere is an inverse relationship between people’s level of authority and their willingness to deal with obstructive security measures.\nThe most important wizardry of congresscritters is the summoning of big, beautiful campaign contributions.\nThat’s some senator with some advanced knowledge. I tell ya. Or maybe he listens to his cybersecurity advisors. \nBut going back to this article. I doubt, Brian that securing those people’s phones would do much to the security of our current government. Who cares if they have spyware on their phones, when half of them are ruzzian assets anyway?\nWell this would be a start, but this doesn’t prevent the telecomm provider from being hacked or some kind of Stingray device being used in DC.\nI haven’t heard much about the Chinese hacking US telecomm companies. Looking it up, there is a Reuters report from January 5, 2025 that it isn’t an issue … anymore.\nUnfortunately for US security, this issue is only going to change if security is pushed from the top, given how lax our current president is regarding mobile device security, well any security, the only hope for the US is either spies can’t deal with so much information or it becomes so easy to operate here countries send their worst and dimmest spies.\nAlthough when dealing with security, “hope isn’t a strategy”.\nSo Mr. Krebs does not use Google or Android. I wonder if he could share with us what kind of tech security he does use. For example, what type of encrypted email, what webhost, does he have his own server like Hillary Clinton famously did, what VPN service, security key,  password manager,  go-bag, what kind of physical security? In other words, a tour of the Krebs “Batcave”.\nHaha, dare to dream.\nSo Wiles still has her phone, it was never missing…\nHow do we know the contacts were stolen from whatever computer she syncs contacts with?\nDo these folks’ phone only sync with secured computers? \nWe’ve seen these folks using gmail personal accounts, are we sure they’re not synching their contacts over there, even occasionally/manually, and maybe have a bad gmail password and no 2fa?\nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "Cato Networks Raises $359 Million to Expand SASE Business",
        "Link": "https://www.securityweek.com/cato-networks-raises-359-million-to-expand-sase-business/",
        "Summary": "<p>Founded in 2015, the Tel Aviv based company has now raised more than $1 billion and claims more than 3,500 customers.</p>\n<p>The post <a href=\"https://www.securityweek.com/cato-networks-raises-359-million-to-expand-sase-business/\">Cato Networks Raises $359 Million to Expand SASE Business</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cato-networks-raises-359-million-to-expand-sase-business/"
    },
    {
        "Title": "NASA Needs Agency-Wide Cybersecurity Risk Assessment: GAO",
        "Link": "https://www.securityweek.com/nasa-needs-agency-wide-cybersecurity-risk-assessment-gao/",
        "Summary": "<p>NASA needs to perform an agency-wide cybersecurity risk assessment and to complete important cybersecurity tasks for each of its projects.</p>\n<p>The post <a href=\"https://www.securityweek.com/nasa-needs-agency-wide-cybersecurity-risk-assessment-gao/\">NASA Needs Agency-Wide Cybersecurity Risk Assessment: GAO</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/nasa-needs-agency-wide-cybersecurity-risk-assessment-gao/"
    },
    {
        "Title": "Hacker Conversations: Rachel Tobac and the Art of Social Engineering",
        "Link": "https://www.securityweek.com/hacker-conversations-rachel-tobac-and-the-art-of-social-engineering/",
        "Summary": "<p>Rachel Tobac is a cyber social engineer. She is skilled at persuading people to do what she wants, rather than what they know they ought to do.</p>\n<p>The post <a href=\"https://www.securityweek.com/hacker-conversations-rachel-tobac-and-the-art-of-social-engineering/\">Hacker Conversations: Rachel Tobac and the Art of Social Engineering</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/hacker-conversations-rachel-tobac-and-the-art-of-social-engineering/"
    },
    {
        "Title": "Casie Antalis Named Executive Director of CISA",
        "Link": "https://www.securityweek.com/casie-antalis-named-executive-director-of-cisa/",
        "Summary": "<p>Casie Antalis is the new executive director of the Cybersecurity and Infrastructure Security Agency after the departure of Bridget Bean.</p>\n<p>The post <a href=\"https://www.securityweek.com/casie-antalis-named-executive-director-of-cisa/\">Casie Antalis Named Executive Director of CISA</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/casie-antalis-named-executive-director-of-cisa/"
    },
    {
        "Title": "Airoha Chip Vulnerabilities Expose Headphones to Takeover",
        "Link": "https://www.securityweek.com/airoha-chip-vulnerabilities-expose-headphones-to-takeover/",
        "Summary": "<p>Vulnerabilities in Airoha Bluetooth SoCs expose headphone and earbud products from multiple vendors to takeover attacks.</p>\n<p>The post <a href=\"https://www.securityweek.com/airoha-chip-vulnerabilities-expose-headphones-to-takeover/\">Airoha Chip Vulnerabilities Expose Headphones to Takeover</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/airoha-chip-vulnerabilities-expose-headphones-to-takeover/"
    },
    {
        "Title": "Canada Gives Hikvision the Boot on National Security Grounds",
        "Link": "https://www.securityweek.com/canada-gives-hikvision-the-boot-on-national-security-grounds/",
        "Summary": "<p>Canada has ordered Hikvision to cease all operations in the country and prohibited the purchase and use of Hikvision products within government entities.</p>\n<p>The post <a href=\"https://www.securityweek.com/canada-gives-hikvision-the-boot-on-national-security-grounds/\">Canada Gives Hikvision the Boot on National Security Grounds</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/canada-gives-hikvision-the-boot-on-national-security-grounds/"
    },
    {
        "Title": "Patrick Ware Named Executive Director of US Cyber Command",
        "Link": "https://www.securityweek.com/patrick-ware-named-executive-director-of-us-cyber-command/",
        "Summary": "<p>The NSA’s Patrick Ware has taken up the role of Cybercrom executive director after the departure of Morgan Adamski.</p>\n<p>The post <a href=\"https://www.securityweek.com/patrick-ware-named-executive-director-of-us-cyber-command/\">Patrick Ware Named Executive Director of US Cyber Command</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/patrick-ware-named-executive-director-of-us-cyber-command/"
    },
    {
        "Title": "Hawaiian Airlines Hacked as Aviation Sector Warned of Scattered Spider Attacks",
        "Link": "https://www.securityweek.com/hawaiian-airlines-hacked-as-aviation-sector-warned-of-scattered-spider-attacks/",
        "Summary": "<p>Scattered Spider is targeting airlines and the recent WestJet hack is believed to be the work of the notorious cybercrime group.</p>\n<p>The post <a href=\"https://www.securityweek.com/hawaiian-airlines-hacked-as-aviation-sector-warned-of-scattered-spider-attacks/\">Hawaiian Airlines Hacked as Aviation Sector Warned of Scattered Spider Attacks</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/hawaiian-airlines-hacked-as-aviation-sector-warned-of-scattered-spider-attacks/"
    },
    {
        "Title": "Ahold Delhaize Data Breach Impacts 2.2 Million People",
        "Link": "https://www.securityweek.com/ahold-delhaize-data-breach-impacts-2-2-million-people/",
        "Summary": "<p>The ransomware attack against grocery giant Ahold Delhaize has resulted in the personal information of millions getting stolen.</p>\n<p>The post <a href=\"https://www.securityweek.com/ahold-delhaize-data-breach-impacts-2-2-million-people/\">Ahold Delhaize Data Breach Impacts 2.2 Million People</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/ahold-delhaize-data-breach-impacts-2-2-million-people/"
    },
    {
        "Title": "Marketing Firm Tenacious Marketing USA Allegedly Breached – 414,000 Records for Sale",
        "Link": "https://dailydarkweb.net/marketing-firm-tenacious-marketing-usa-allegedly-breached-414000-records-for-sale/",
        "Summary": "Tenacious Marketing USA, a California-based company providing printing, graphic design, and marketing services, has allegedly suffered a significant data breach. A threat actor has posted a database containing what they claim are 414,000 unique user records for sale on a dark web forum. The company, which handles marketing and distribution for its clients, appears to [&#8230;]",
        "Date": "2025-06-30",
        "Content": "Tenacious Marketing USA, a California-based company providing printing, graphic design, and marketing services, has allegedly suffered a significant data breach. A threat actor has posted a database containing what they claim are 414,000 unique user records for sale on a dark web forum. The company, which handles marketing and distribution for its clients, appears to have had sensitive customer relationship management (CRM) data exposed.\nThe data was advertised on a popular hacking forum and includes a wide array of personally identifiable information (PII) and highly sensitive details. The sample data provided by the seller suggests the information pertains to individuals who may have been involved in accidents, potentially for lead generation purposes for law offices. The exposure of such personal data puts the affected individuals at a severe risk of targeted phishing attacks, identity theft, and other fraudulent activities.\nThe threat actor claims the breach contains a large volume of records, and the sample data indicates the types of information allegedly compromised include:\nFull Name\nPhone Number and Mobile\nFull Address (Address 1, City, State, Zip Code)\nEmail Address\nDate of Birth\nAccident State and Category\nDate of Injury\nHospital Name\nLaw Office Details\nLead Status\nTags:\nCyberSecurity\ndata-breach\ndata-leak\nPII\ntenacious marketing usa"
    },
    {
        "Title": "Bajaj Finserv Allegedly Breached – Sensitive Customer and Employee Data For Sale Online",
        "Link": "https://dailydarkweb.net/bajaj-finserv-allegedly-breached-sensitive-customer-and-employee-data-for-sale-online/",
        "Summary": "A threat actor has allegedly put the financial and personal data of Indian conglomerate Bajaj Finserv&#8217;s customers and employees up for sale on a dark web forum. Bajaj Finserv is a prominent non-banking financial services company in India, offering a vast portfolio of products including loans, insurance, and wealth management to over 100 million customers. [&#8230;]",
        "Date": "2025-06-30",
        "Content": "A threat actor has allegedly put the financial and personal data of Indian conglomerate Bajaj Finserv’s customers and employees up for sale on a dark web forum. Bajaj Finserv is a prominent non-banking financial services company in India, offering a vast portfolio of products including loans, insurance, and wealth management to over 100 million customers. A breach of this magnitude could have significant consequences for the individuals whose data has been compromised.\nThe seller on the forum claims to possess a database containing information on 207,000 unique users. To substantiate their claim, the actor shared a sample of the data which appears to contain an extensive amount of sensitive information. The potential leak includes a wide range of personal, financial, and internal company data, which could be exploited by malicious actors for phishing campaigns, identity theft, and other fraudulent activities. The scale and detail of the allegedly leaked information underscore the critical importance of robust cybersecurity measures for financial institutions.\nThe data, which is being sold for an undisclosed amount in Monero (XMR), allegedly includes numerous fields of customer and internal information. The exposure of such comprehensive data could lead to significant financial and reputational damage for the company and poses a serious privacy risk to its customers and employees. While the company has not yet publicly addressed the alleged incident, the situation highlights the persistent threats facing large corporations that handle sensitive data.\nSome of the allegedly leaked data points include:\nFirst and Last Names\nPhone and Mobile Numbers\nEmail Addresses\nPhysical Addresses (City, State, ZIP Code)\nDate of Joining / Creation Date\nEmployment Details (Department, Title, Employee ID)\nAccount Details (Account Number, Loan Amount, Bank IFSC/MICR)\nBeneficiary Account Number and Name\nCustomer and Dealer Information\nRisk Classification and Scores\nTags:\nBajaj Finserv\nCyberSecurity\ndark web\ndata-breach\ndata-leak\nfinancial data\nIndia\nPII"
    },
    {
        "Title": "Austrian Crypto Giant Bitpanda Allegedly Breached – 5.4 Million User Data for Sale",
        "Link": "https://dailydarkweb.net/austrian-crypto-giant-bitpanda-allegedly-breached-5-4-million-user-data-for-sale/",
        "Summary": "Vienna-based fintech unicorn, Bitpanda, is allegedly the latest victim of a significant data breach, with a threat actor claiming to have exfiltrated the data of 5.4 million verified users across Europe. Bitpanda, a leading European cryptocurrency broker valued at over four billion dollars, offers trading in cryptocurrencies, stocks, and precious metals to its millions of [&#8230;]",
        "Date": "2025-06-30",
        "Content": "Vienna-based fintech unicorn, Bitpanda, is allegedly the latest victim of a significant data breach, with a threat actor claiming to have exfiltrated the data of 5.4 million verified users across Europe. Bitpanda, a leading European cryptocurrency broker valued at over four billion dollars, offers trading in cryptocurrencies, stocks, and precious metals to its millions of customers. The company, founded in 2014, is a fully regulated and licensed platform, making the alleged breach a serious concern for the security of its users’ sensitive financial and personal information.\nThe individual claiming responsibility for the breach alleges that they personally infiltrated Bitpanda’s Tier 1 infrastructure on June 29, 2025, and is now selling the freshly dumped data. The seller emphasizes that this is not a resold or previously leaked database. The data is said to be from a “True Tier 1 source,” implying direct access to internal systems. The alleged hacker has set a price of $15,000 for the entire database and has provided a sample of 200 records to prove their claims. The countries impacted are said to span the European Economic Area, including Germany, France, Spain, Italy, and Austria.\nThe compromised information allegedly includes a wide range of personally identifiable information (PII) and financial data. The threat actor has listed the following data types as being part of the leaked database:\nFull Name\nCountry\nPhone Number\nIP Address\nIBAN / Wallet\nRegistration metadata\nTier level + KYC status\nAs of the time of this report, Bitpanda has not released any official statement confirming or denying the alleged data breach. The claims are solely based on the assertions of the individual selling the data on a hacking forum.\nTags:\nAustria\nBitpanda\ncryptocurrency\nCyberSecurity\ndata-breach\ndata-leak\nFinTech\nGDPR"
    },
    {
        "Title": "Hungryroot Allegedly Breached – Over 1.1 Million User Data for Sale",
        "Link": "https://dailydarkweb.net/hungryroot-allegedly-breached-over-1-1-million-user-data-for-sale/",
        "Summary": "The popular AI-powered grocery and recipe delivery service, Hungryroot, has allegedly suffered a massive data breach, with a threat actor claiming to possess the personal information of over 1.18 million users. The data, which was advertised for sale on a dark web forum, allegedly stems from a breach that occurred on June 29, 2025. Hungryroot [&#8230;]",
        "Date": "2025-06-30",
        "Content": "The popular AI-powered grocery and recipe delivery service, Hungryroot, has allegedly suffered a massive data breach, with a threat actor claiming to possess the personal information of over 1.18 million users. The data, which was advertised for sale on a dark web forum, allegedly stems from a breach that occurred on June 29, 2025. Hungryroot is a well-known service in the United States that uses artificial intelligence to help users with meal planning and grocery shopping, delivering fresh ingredients and recipes directly to their homes. The company’s innovative approach to personalized nutrition and convenience has made it a significant player in the online grocery delivery market.\nThe actor behind the sale claims the compromised database contains a wealth of sensitive user information. The data is being offered in multiple file formats, including a .sql dump and .txt files. This alleged breach could have significant privacy implications for a large number of individuals who have trusted the service with their personal and financial details. The origin of the breach is currently attributed to the individual or group who posted the data for sale on the online forum.\nAccording to the forum post, the following user data has been allegedly compromised:\nFull Names\nEmails\nBilling Addresses\nPasswords\nAll Orders\nAll Customer Information\nAll Coupons\nTags:\ncyberattack\nCyberSecurity\ndata-breach\ndata-leak\nHungryroot"
    },
    {
        "Title": "Unibail-Rodamco-Westfield Corporate Database Allegedly Leaked",
        "Link": "https://dailydarkweb.net/unibail-rodamco-westfield-corporate-database-allegedly-leaked/",
        "Summary": "A threat actor has allegedly breached and put up for sale the corporate database of Unibail-Rodamco-Westfield (URW), a global leader in commercial real estate. URW is a Paris-based company that owns, develops, and operates a vast portfolio of premier shopping centers, office buildings, and convention centers across Europe and the United States, including 39 locations [&#8230;]",
        "Date": "2025-06-30",
        "Content": "A threat actor has allegedly breached and put up for sale the corporate database of Unibail-Rodamco-Westfield (URW), a global leader in commercial real estate. URW is a Paris-based company that owns, develops, and operates a vast portfolio of premier shopping centers, office buildings, and convention centers across Europe and the United States, including 39 locations under the iconic Westfield brand. The company’s significant footprint in the international property market makes any potential data breach a serious concern for its employees, clients, and partners.\nThe claim was made on a hacking forum, where a user announced the sale of the URW corporate database for €1,500. According to the post, the database is available in both .sql and mysql formats and contains sensitive information. The threat actor also claimed that a specific company portal, the US tenant coordination website, was down as a result of the incident. This portal is critical for managing the operational relationship between the real estate giant and its numerous retail tenants in the US.\nThe compromised data allegedly includes a significant amount of information belonging to both company personnel and clients. The threat actor specified the contents of the database as including:\n70,000 records of employees and clients\n60,000 IP addresses\nTags:\ncorporate data\nCyberSecurity\ndata-breach\ndatabase leak\nreal estate\nUnibail-Rodamco-Westfield\nURW"
    },
    {
        "Title": "European Construction Giant Eiffage Allegedly Hit by Major Data Breach",
        "Link": "https://dailydarkweb.net/european-construction-giant-eiffage-allegedly-hit-by-major-data-breach/",
        "Summary": "French civil engineering powerhouse Eiffage S.A., a leading construction and concessions company in Europe, has allegedly suffered a significant data breach. In May 2025, threat actors reportedly exploited the company&#8217;s File Transfer Service, leading to the exposure of a substantial amount of data. With revenues exceeding €23 billion and over 72,000 employees, Eiffage is a [&#8230;]",
        "Date": "2025-06-30",
        "Content": "French civil engineering powerhouse Eiffage S.A., a leading construction and concessions company in Europe, has allegedly suffered a significant data breach. In May 2025, threat actors reportedly exploited the company’s File Transfer Service, leading to the exposure of a substantial amount of data. With revenues exceeding €23 billion and over 72,000 employees, Eiffage is a key player in major infrastructure projects across the continent, making this incident a notable security concern for the industry.\nThe company, which was instrumental in projects like the Channel Tunnel and the Millau Viaduct, along with its subsidiaries, is now at the center of a data security incident. The breach allegedly affects not only the parent company but also its major branches, including Eiffage Énergie Systèmes, Clemessy, and the Goyer Group, with a wide-reaching impact on its operations across France, Germany, Spain, and other European nations. The origin of the attack is attributed to malicious actors who claim to have exfiltrated the data.\nThe compromised information allegedly contains over 40,000 records. The exposed data is said to include sensitive personal and corporate information. The following data types were allegedly compromised in the leak:\nEmployee and corporate partner full names\nCorporate email addresses\nEiffage has yet to release an official statement regarding the alleged breach. The incident highlights the persistent threat of cyberattacks against critical infrastructure and major corporate entities.\nTags:\nConstruction\nCyberSecurity\ndata-breach\ndata-leak\nEiffage\nEurope\nFrance"
    },
    {
        "Title": "Pakistan’s National Citizen Database Allegedly Breached – 602 Million Records Leaked Online",
        "Link": "https://dailydarkweb.net/pakistans-national-citizen-database-allegedly-breached-602-million-records-leaked-online/",
        "Summary": "A threat actor has allegedly leaked a massive database containing the sensitive personal information of 602 million Pakistani citizens. The targeted entity is believed to be Pakistan&#8217;s National Database &#38; Registration Authority (NADRA), the government organization responsible for issuing national identity cards and maintaining the country&#8217;s citizen data registry. The authority holds the foundational data [&#8230;]",
        "Date": "2025-06-30",
        "Content": "A threat actor has allegedly leaked a massive database containing the sensitive personal information of 602 million Pakistani citizens. The targeted entity is believed to be Pakistan’s National Database & Registration Authority (NADRA), the government organization responsible for issuing national identity cards and maintaining the country’s citizen data registry. The authority holds the foundational data for all Pakistani nationals, making it a critical piece of national infrastructure. A breach of this magnitude could represent one of the most significant government data leaks in history, exposing nearly the entire population to potential identity theft, fraud, and other malicious activities.\nThe data was allegedly posted on a dark web forum by a group calling itself ‘Shell Squad’. The actors claim the leak is the “biggest SIM-linked data breach in Pakistan’s history” and have made the entire 900GB+ database available for free on a Telegram channel, with sample links posted on the forum. The compromise allegedly includes highly sensitive and personally identifiable information, tying national ID numbers to mobile phone records. The repercussions of such a leak are severe, potentially enabling widespread social engineering attacks, financial fraud, and targeted surveillance by malicious actors.\nThe exposed data fields allegedly include:\nFull Name\nPhone Number\nAddress\nCNIC Number (Computerized National Identity Card)\nDate of Birth\nMarital Status\nID Type (CNIC or NICOP)\nRegistration and update timestamps\nTags:\nCyberSecurity\ndata-breach\ndata-leak\ngovernment\nNADRA\nPakistan\nPII\nShell Squad"
    },
    {
        "Title": "Syrian IPTV Provider Allegedly Breached",
        "Link": "https://dailydarkweb.net/syrian-iptv-provider-allegedly-breached/",
        "Summary": "A threat actor has claimed responsibility for a significant data breach impacting a Syrian IPTV (Internet Protocol Television) provider. The targeted company, operating under the web domain iptv.sy, is a service that delivers television content over the internet to subscribers. The attack has allegedly resulted in the compromise of a database containing sensitive information belonging [&#8230;]",
        "Date": "2025-06-30",
        "Content": "A threat actor has claimed responsibility for a significant data breach impacting a Syrian IPTV (Internet Protocol Television) provider. The targeted company, operating under the web domain iptv.sy, is a service that delivers television content over the internet to subscribers. The attack has allegedly resulted in the compromise of a database containing sensitive information belonging to more than 55,000 customers and resellers.\nThe cybercriminal group announced the breach on a dark web forum, putting the extensive collection of data up for sale. The leaked records, which are being offered in various file formats including CSV, PDF, and XLSX, allegedly contain a wide range of personally identifiable and financial information. This incident could expose affected individuals to various risks, including identity theft, phishing attacks, and financial fraud.\nThe allegedly exfiltrated data includes the following:\nCompany Name\nUsername\nFull Name (Arabic and English)\nPhone Number\nProtv Mobile Number\nBalance and Invoices\nSubscription Details (Start Date, Expiry Date, Offer Name, Current Package Name)\nIP Address\nFinancial data including Port Fees, Taxes, and ISP Share\nTags:\ncyber-attack\nCyberSecurity\ndata-breach\ndata-leak\nIPTV\nSyrian TV"
    },
    {
        "Title": "Los Angeles LGBT Center Allegedly Hit by Data Breach",
        "Link": "https://dailydarkweb.net/los-angeles-lgbt-center-allegedly-hit-by-data-breach/",
        "Summary": "The Los Angeles LGBT Center, the world&#8217;s largest non-profit organization providing services to the LGBTQ+ community, has allegedly fallen victim to a significant data breach. A threat actor has claimed responsibility for the attack, posting on a dark web forum that they have exfiltrated the organization&#8217;s database and made it available for download. The Los Angeles [&#8230;]",
        "Date": "2025-06-30",
        "Content": "The Los Angeles LGBT Center, the world’s largest non-profit organization providing services to the LGBTQ+ community, has allegedly fallen victim to a significant data breach. A threat actor has claimed responsibility for the attack, posting on a dark web forum that they have exfiltrated the organization’s database and made it available for download. The Los Angeles LGBT Center is a vital institution, offering a wide array of services including health, social services, housing, and advocacy for lesbian, gay, bisexual, and transgender people. The breach could have serious implications for the privacy and safety of the individuals it serves.\nThe perpetrator of the cyberattack alleges that they gained access to the Center’s systems by using a reused credential that was leaked in a previous incident. According to the post, the login details were used to access a backend remote access page. The actor claims to have downloaded the database within 30 minutes, before their access was discovered and revoked. A screenshot was also shared as alleged proof of the unauthorized access.\nThe leaked data, presented in an SQL file, appears to contain a wide range of sensitive personal information. An initial analysis of the file suggests that the following data may have been compromised:\nEmail addresses\nFull Names\nPhysical Addresses\nInternal IDs\nHashed passwords\nLinkedIn profile URLs and other miscellaneous data\nThe exposure of such information places affected individuals at risk of phishing attacks, identity theft, and other malicious activities.\nTags:\ncyberattack\nCyberSecurity\ndata-breach\ndata-leak\nLGBTQ+\nLos Angeles LGBT Center\nnon-profit\nPersonal Information"
    },
    {
        "Title": "Major Ukrainian Investment Firm Dragon Capital Allegedly Breached",
        "Link": "https://dailydarkweb.net/major-ukrainian-investment-firm-dragon-capital-allegedly-breached/",
        "Summary": "Dragon Capital, a leading Ukrainian investment and financial services group, has allegedly been targeted in a cyberattack, resulting in the public release of sensitive company documents. A threat actor posted on a dark web forum claiming to have successfully hacked the firm and has leaked the data freely. Dragon Capital is a pivotal entity in [&#8230;]",
        "Date": "2025-06-30",
        "Content": "Dragon Capital, a leading Ukrainian investment and financial services group, has allegedly been targeted in a cyberattack, resulting in the public release of sensitive company documents. A threat actor posted on a dark web forum claiming to have successfully hacked the firm and has leaked the data freely. Dragon Capital is a pivotal entity in Ukraine’s financial landscape, offering a comprehensive suite of services including investment banking, private equity, and asset management to a wide range of corporate, institutional, and private clients.\nThe perpetrator of the attack allegedly released a 113MB archive containing numerous internal files. The breach appears to be substantial, with the leaked data seemingly containing confidential corporate information. The public disclosure of these documents, as opposed to a ransom demand, suggests the attacker’s primary motive may be to cause reputational harm to the company and disrupt its operations.\nAn examination of the file names included in the leak suggests a wide variety of sensitive information has been exposed. The data allegedly includes internal reports, financial statements, and client-related documents. The potential fallout from this breach could be significant, posing risks to the firm’s clients and partners. The leaked files include:\nInvestor Survey Results\nAccount Agreements\nCode of Conduct and Ethics Policies\nFinancial Reports\nCustodian Tariffs and Licenses\nRegulations for Handling Complaints\nVarious Legal and Tariff Documents\nTags:\nCyberSecurity\ndata-breach\ndata-leak\nDragon Capital\nFinancial Services\nUkraine"
    }
]