[
    {
        "Title": "CoinMarketCap briefly hacked to drain crypto wallets via fake Web3 popup",
        "Link": "https://www.bleepingcomputer.com/news/security/coinmarketcap-briefly-hacked-to-drain-crypto-wallets-via-fake-web3-popup/",
        "Summary": "CoinMarketCap, the popular cryptocurrency price tracking site, suffered a website supply chain attack that exposed site visitors to a wallet drainer campaign to steal visitors' crypto. [...]",
        "Date": "2025-06-22",
        "Content": "CoinMarketCap, the popular cryptocurrency price tracking site, suffered a website supply chain attack that exposed site visitors to a wallet drainer campaign to steal visitors' crypto.\nOn Friday evening, January 20, CoinMarketCap visitors\nbegan seeing Web3 popups\nasking them to connect their wallets to the site. However, when visitors connected their wallets, a malicious script drained cryptocurrency from them.\nThe company later confirmed threat actors utilized a vulnerability in the site's homepage \"doodle\" image to inject malicious JavaScript into the site.\n\"On June 20, 2025, our security team identified a vulnerability related to a doodle image displayed on our homepage. This doodle image contained a link that triggered malicious code through an API call, resulting in an unexpected popup for some users when visited our homepage,\" reads a statement\nposted on X\n.\n\"Upon discovery, We acted immediately to remove the problematic content, identified the root cause, and comprehensive measures have been implemented to isolate and mitigate the issue.\"\n\"We can confirm all systems are now fully operational, and CoinMarketCap is safe and secure for all users.\"\nCybersecurity firm c/side explained that the attack worked by the threat actors somehow modifying the API used by the site to retrieve a doodle image to display on the homepage. This tampered\nJSON payload\nnow included a\nmalicious script tag\nthat injected a wallet drainer script into CoinMarketCap from an external site named \"static.cdnkit[.]io\".\nWhen someone visited the page, the script would execute and display a fake wallet connect popup showing CoinMarketCap branding and mimicking a legitimate Web3 transaction request. However, this script was actually a wallet drainer designed to steal connected wallets' assets.\n\"This was a supply chain attack, meaning the breach didn' target CMC's own servers but a third-party tool or resource used by CMC,\"\nexplains c/side\n.\n\"Such attacks are hard to detect because they exploit trusted elements of a platform.\"\nMore details about the attack came later from a threat actor\nknown as Rey\n, who said that the attackers behind the CoinMarketCap supply chain attack shared a screenshot of the drainer panel on a Telegram channel.\nThis panel indicated that $43,266 was stolen from 110 victims as part of this supply chain attack, with the threat actors speaking in French on the Telegram channel.\nScreenshot of drainer panel shared on Telegram\nSource: Rey\nAs the popularity of cryptocurrency has boomed, so has the threat from wallet drainers, which are commonly used in attacks.\nUnlike traditional phishing, these types of attacks are more often promoted through social media posts, advertisements, spoofed sites, and malicious browser extensions that include malicious wallet-draining scripts.\nReports indicate that\nwallet drainers stole almost $500 million\nin 2024 through attacks targeting more than 300,000 wallet addresses.\nThe problem has become so pervasive that\nMozilla recently introduced a new system\nto detect wallet drainers in browser add-ons uploaded to the Firefox Add-on repository.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMozilla launches new system to detect Firefox crypto drainer add-ons\nUS recovers $225 million of crypto stolen in investment scams\nBitoPro exchange links Lazarus hackers to $11 million crypto heist\nPro-Israel hackers hit Iran's Nobitex exchange, burn $90M in crypto\nNorth Korean hackers deepfake execs in Zoom call to spread Mac malware"
    },
    {
        "Title": "Oxford City Council suffers breach exposing two decades of data",
        "Link": "https://www.bleepingcomputer.com/news/security/oxford-city-council-suffers-breach-exposing-two-decades-of-data/",
        "Summary": "Oxford City Council warns it suffered a data breach where attackers accessed personally identifiable information from legacy systems. [...]",
        "Date": "2025-06-22",
        "Content": "Oxford City Council warns it suffered a data breach where attackers accessed personally identifiable information from legacy systems.\nThe incident has also caused an ICT service disruption, as announced on the website, and although most of the impacted systems have been brought back online, the remaining backlogs may continue to cause delays.\nOxford City Council is the local government authority responsible for managing critical public services, such as housing, planning, waste collection, environmental health, and elections, in Oxford, England.\nThe authority serves a population of around 155,000 residents, but its influence extends further due to the city's international prominence through the University of Oxford, tourism, and research institutions.\nA statement on its website explains that attackers gained unauthorized access to some of its systems and databases, which host personal information.\nBased on the preliminary investigation, the impacted system contained information on former and current Council officers between 2001 and 2022.\n\"Unfortunately, the attackers were able to access some historic data on legacy systems,\"\nreads the statement\npublished on the Oxford City Council website.\n\"We have now identified that people who worked on Oxford City Council-administered elections between 2001 and 2022, including poll station workers and ballot counters, may have had some personal details accessed.\"\nThe statement claims there's no evidence that the exposed data has been further disseminated. Also, there's no mention of citizen data having been compromised.\nBleepingComputer has contacted Oxford City Council to specify if citizen data was stored in the accessed databases, and we will update this post with their response.\nThe organization says the investigation into the incident is still ongoing, and no signs of mass data extraction have been unearthed as of yet.\nOxford City Council says it has begun individually notifying those confirmed to be affected, providing details about the incident, available support resources, and assurances of strengthened security measures to prevent future breaches.\nAlso, the relevant government authorities and law enforcement agencies have been notified accordingly.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nHealthcare SaaS firm says data breach impacts 5.4 million patients\nTexas Dept. of Transportation breached, 300k crash records stolen\nStolen Ticketmaster data from Snowflake attacks briefly for sale again\nMedia giant Lee Enterprises says data breach affects 39,000 people\nUK Legal Aid Agency confirms applicant data stolen in data breach"
    },
    {
        "Title": "Windows Snipping Tool now lets you create animated GIF recordings",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-snipping-tool-now-lets-you-create-animated-gif-recordings/",
        "Summary": "​Microsoft announced that the Windows screenshot and screencast Snipping Tool utility is getting support for exporting animated GIF recordings. [...]",
        "Date": "2025-06-22",
        "Content": "​Microsoft announced that the Windows screenshot and screencast Snipping Tool utility is getting support for exporting animated GIF recordings.\nThis new capability is rolling out to Windows 11 Insiders in the Canary and Dev Channels, who have updated the app to version 11.2505.21.0.\n\"In this update, we are adding GIF export for screen recordings – designed to boost your productivity and turn quick captures into shareable moments,\"\nsaid\nDave Grochocki, a Principal Product Manager Lead at Microsoft.\n\"Please note: GIF export is limited to videos that are 30 seconds or less. If your video is longer than 30 seconds, Snipping Tool will offer to export the first 30 seconds of your video instead.\"\nTo begin recording a new GIF, open the Snipping Tool's screen recorder by pressing Win + Shift + R or launching the app and switching to screen recording mode. Start recording your screen, and once the preview opens, click the 'Export GIF' button at the top of the toolbar.\nNext, choose low GIF quality for a smaller size or high quality for a clearer recording, and then copy it directly to your clipboard or save it to your hard drive.\nSnipping Tool GIF dialog (Microsoft)\n​Last month, Microsoft\nalso started testing\na new AI-powered 'perfect screenshot' tool that helps precisely capture screen content to avoid cropping and a color picker utility that allows picking color codes using HEX, RGB, or HSL values.\n\"Once activated, perfect screenshot will intelligently resize based on the content in your selection,\" Grochocki said at the time. \"You can also quickly enable perfect screenshot by holding the Ctrl keyboard shortcut after invoking Snipping Tool while selecting a region of your screen.\"\nIn April, Snipping Tool was also updated to\ninclude a Text Extractor feature\nthat copies text to the clipboard without actually having to take a screenshot.\nEarlier this year, the company also\nadded a draw & hold feature\nthat helps users draw straight lines and shapes more easily, and\na trim capability\nthat helps adjust the start and end times of screen recordings to cut out any unnecessary video snippets from their video.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMicrosoft adds quick machine recovery to Windows 11 settings\nWindows 11 Notepad gets AI-powered text writing capabilities\nMicrosoft testing Windows 11 support for third-party passkeys\nMicrosoft unveils new security defaults for Windows 365 Cloud PCs\nWindows 11 24H2 emergency update fixes Easy Anti-Cheat BSOD issue"
    }
]