[
    {
        "Title": "Google Exposes Vishing Group UNC6040 Targeting Salesforce with Fake Data Loader App",
        "Link": "https://thehackernews.com/2025/06/google-exposes-vishing-group-unc6040.html",
        "Summary": "Google has disclosed details of a financially motivated threat cluster that it said \"specialises\" in voice phishing (aka vishing) campaigns designed to breach organizations' Salesforce instances for large-scale data theft and subsequent extortion.\nThe tech giant's threat intelligence team is tracking the activity under the moniker UNC6040, which it said exhibits characteristics that align with",
        "Date": "2025-06-04",
        "Content": "Google has disclosed details of a financially motivated threat cluster that it said \"specialises\" in voice phishing (aka vishing) campaigns designed to breach organizations' Salesforce instances for large-scale data theft and subsequent extortion.\nThe tech giant's threat intelligence team is tracking the activity under the moniker\nUNC6040\n, which it said exhibits characteristics that align with threat groups with ties to an online cybercrime collective known as\nThe Com\n.\n\"Over the past several months, UNC6040 has demonstrated repeated success in breaching networks by having its operators impersonate IT support personnel in convincing telephone-based social engineering engagements,\" the company\nsaid\nin a report shared with The Hacker News.\nThis approach, Google's Threat Intelligence Group (GTIG) added, has had the benefit of tricking English-speaking employees into performing actions that give the threat actors access or lead to the sharing of valuable information such as credentials, which are then used to facilitate data theft.\nA noteworthy aspect of UNC6040's activities involves the use of a modified version of Salesforce's\nData Loader\nthat victims are deceived into authorizing so as to connect to the organization's Salesforce portal during the vishing attack. Data Loader is an application used to import, export, and update data in bulk within the Salesforce platform.\nSpecifically, the attackers guide the target to visit Salesforce's connected app setup page and approve the modified version of the Data Loader app that carries a different name or branding (e.g., \"My Ticket Portal\") from its legitimate counterpart. This action grants them unauthorized access to the Salesforce customer environments and exfiltrate data.\nBeyond data loss, the attacks serve as a stepping stone for UNC6040 to move laterally through the victim's network, and then access and harvest information from other platforms such as Okta, Workplace, and Microsoft 365.\nSelect incidents have also involved extortion activities, but only \"several months\" after the initial intrusions were observed, indicating an attempt to monetize and profit off the stolen data presumably in partnership with a second threat actor.\n\"During these extortion attempts, the actor has claimed affiliation with the well-known hacking group ShinyHunters, likely as a method to increase pressure on their victims,\" Google said.\nUNC6040's overlaps with groups linked to The Com stem from the\ntargeting of Okta credentials\nand the use of social engineering via IT support, a tactic that has been embraced by\nScattered Spider\n, another financially motivated threat actor that's part of the loose-knit organized collective.\nThe vishing campaign hasn't gone unnoticed by Salesforce, which, in March 2025, warned of threat actors using social engineering tactics to impersonate IT support personnel over the phone and trick its customers' employees into giving away their credentials or approving the modified Data Loader app.\n\"They have been reported luring our customers' employees and third-party support workers to phishing pages designed to steal credentials and MFA tokens or prompting users to navigate to the login.salesforce[.]com/setup/connect page in order to add a malicious connected app,\" the company\nsaid\n.\n\"In some cases, we have observed that the malicious connected app is a modified version of the Data Loader app published under a different name and/or branding. Once the threat actor gains access to a customer's Salesforce account or adds a connected app, they use the connected app to exfiltrate data.\"\nThe development not only highlights the continued sophistication of social engineering campaigns, but also shows how IT support staff are being increasingly targeted as a way to gain initial access.\n\"The success of campaigns like UNC6040's, leveraging these refined vishing tactics, demonstrates that this approach remains an effective threat vector for financially motivated groups seeking to breach organizational defenses,\" Google said.\n\"Given the extended time frame between initial compromise and extortion, it is possible that multiple victim organizations and potentially downstream victims could face extortion demands in the coming weeks or months.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Chaos RAT Malware Targets Windows and Linux via Fake Network Tool Downloads",
        "Link": "https://thehackernews.com/2025/06/chaos-rat-malware-targets-windows-and.html",
        "Summary": "Threat hunters are calling attention to a new variant of a remote access trojan (RAT) called Chaos RAT that has been used in recent attacks targeting Windows and Linux systems.\nAccording to findings from Acronis, the malware artifact may have been distributed by tricking victims into downloading a network troubleshooting utility for Linux environments.\n\"Chaos RAT is an open-source RAT written in",
        "Date": "2025-06-04",
        "Content": "Threat hunters are calling attention to a new variant of a remote access trojan (RAT) called\nChaos RAT\nthat has been used in recent attacks targeting Windows and Linux systems.\nAccording to findings from Acronis, the malware artifact may have been distributed by tricking victims into downloading a network troubleshooting utility for Linux environments.\n\"Chaos RAT is an open-source RAT written in Golang, offering cross-platform support for both Windows and Linux systems,\" security researchers Santiago Pontiroli, Gabor Molnar, and Kirill Antonenko\nsaid\nin a report shared with The Hacker News.\n\"Inspired by popular frameworks such as Cobalt Strike and Sliver, Chaos RAT provides an administrative panel where users can build payloads, establish sessions, and control compromised machines.\"\nWhile work on the \"remote administration tool\" started way back in 2017, it did not attract attention until\nDecember 2022\n, when it was put to use in a malicious campaign targeting public-facing web applications hosted on Linux systems with the XMRig cryptocurrency miner.\nOnce installed, the malware connects to an external server and awaits commands that allow it to launch reverse shells, upload/download/delete files, enumerate files and directories, take screenshots, gather system information, lock/restart/shutdown the machine, and open arbitrary URLs. The latest version of Chaos RAT is 5.0.3, which was released on May 31, 2024.\nAcronis said that the Linux variants of the malware have since been detected in the wild, often in connection with cryptocurrency mining campaigns. The attack chains observed by the company show that Chaos RAT is distributed to victims via phishing emails containing malicious links or attachments.\nThese artifacts are designed to drop a malicious script that can modify the task scheduler \"/etc/crontab\" to fetch the malware periodically as a way of setting up persistence.\n\"Early campaigns used this technique to deliver cryptocurrency miners and Chaos RAT separately, indicating that Chaos was primarily employed for reconnaissance and information gathering on compromised devices,\" the researchers said.\nAn analysis of a\nrecent sample\nuploaded to VirusTotal in January 2025 from India with the name \"NetworkAnalyzer.tar.gz,\" has raised the possibility that users are being deceived into downloading the malware by masquerading it as a network troubleshooting utility for Linux environments.\nFurthermore, the admin panel that allows users to build payloads and manage infected machines has been found to be\nsusceptible\nto a command injection vulnerability (\nCVE-2024-30850\n, CVSS score: 8.8) that could be combined with a cross-site scripting flaw (\nCVE-2024-31839\n, CVSS score: 4.8) to\nexecute arbitrary code\non the server with elevated privileges. Both the vulnerabilities have since been addressed by Chaos RAT's maintainer as of May 2024.\nWhile it's currently not clear who is behind the use of Chaos RAT in real-world attacks, the development once again illustrates how threat actors continue to weaponize open-source tools to their advantage and confuse attribution efforts.\n\"What starts as a developer's tool can quickly become a threat actor's instrument of choice,\" the researchers said. \"Using publicly available malware helps APT groups blend into the noise of everyday cybercrime. Open-source malware offers a 'good enough' toolkit that can be quickly customized and deployed. When multiple actors use the same open-source malware, it muddles the waters of attribution.\"\nThe disclosure coincides with the emergence of a new campaign that's targeting Trust Wallet users on desktop with counterfeit versions that are distributed via deceptive download links, phishing emails, or bundled software with the goal of harvesting browser credentials, extracting data from desktop-based wallets and browser extensions, executing commands, and acting as a\nclipper malware\n.\n\"Once installed, the malware can scan for wallet files, intercept clipboard data, or monitor browser sessions to capture seed phrases or private keys,\" Point Wild researcher Kedar S Pandit\nsaid\nin a report published this week.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Your SaaS Data Isn't Safe: Why Traditional DLP Solutions Fail in the Browser Era",
        "Link": "https://thehackernews.com/2025/06/your-saas-data-isnt-safe-why.html",
        "Summary": "Traditional data leakage prevention (DLP) tools aren't keeping pace with the realities of how modern businesses use SaaS applications.\nCompanies today rely heavily on SaaS platforms like Google Workspace, Salesforce, Slack, and generative AI tools, significantly altering the way sensitive information is handled. In these environments, data rarely appears as traditional files or crosses networks",
        "Date": "2025-06-04",
        "Content": "Traditional data leakage prevention (DLP) tools aren't keeping pace with the realities of how modern businesses use SaaS applications.\nCompanies today rely heavily on SaaS platforms like Google Workspace, Salesforce, Slack, and generative AI tools, significantly altering the way sensitive information is handled. In these environments, data rarely appears as traditional files or crosses networks in ways endpoint or network-based DLP tools can monitor. Yet, most companies continue using legacy DLP systems, leaving critical security gaps.\nA new white paper,\nRethinking DLP For The SaaS Era: Why Browser-Centric DLP is the New Mandate\n, identifies precisely why current DLP methods struggle to secure modern SaaS-driven workflows. It also explores how browser-native security addresses these gaps by focusing security efforts exactly where user interactions occur, in the browser.\nWhy Traditional DLP Tools Fall Short\nTraditional DLP solutions were built for a simpler time when sensitive data primarily existed as files moved across monitored endpoints or networks. Today, SaaS data doesn't follow those paths, rendering these methods ineffective. Here's how the mismatch creates significant vulnerabilities:\n70%\nof enterprise data leaks now happen directly in-browser, invisible to endpoint or network-based DLP systems.\n53%\nof data leaks involve \"invisible\" actions like copying data into chat apps or text prompts rather than traditional file transfers.\nOver\n50%\nof employees use SaaS applications unapproved by IT, significantly increasing potential leakage channels.\nThe Browser as the New Frontline\nSensitive data today mostly resides within browser sessions. Collaborative editing, real-time messaging, and interactions with AI tools all happen in-browser, making the browser the critical control point for data protection.\nFive Reasons Browser-Centric DLP is Essential\nOrganizations must now shift security attention directly to the browser. Here's why browser-centric DLP is critical:\nData Always in Use:\nData remains actively manipulated in SaaS apps, requiring continuous, real-time browser monitoring.\nInvisible Risks:\nCopy-pasting sensitive information into chat tools or AI prompts often goes unnoticed by traditional solutions.\nComplex Identity Challenges:\nEmployees frequently switch between personal and corporate accounts within one browser session, complicating traditional identity controls.\nShadow SaaS and AI Risks:\nEmployees routinely use unauthorized SaaS or AI tools, creating blind spots for legacy security systems.\nRisky Browser Extensions:\nMalicious or overly permissive browser extensions can quietly steal sensitive data, bypassing traditional controls.\nBrowser-Centric DLP: Addressing Modern Security Gaps\nA browser-centric approach effectively tackles these challenges by:\nContinuously monitoring real-time user actions directly within the browser, including copy-pasting and chat interactions.\nClearly identifying and separating corporate versus personal activities within SaaS apps.\nAutomatically detecting and classifying sensitive data within browser sessions, enabling immediate, context-based security responses.\nGet Ahead of Tomorrow's SaaS Security Threats\nThe SaaS landscape continues to evolve quickly, making traditional security methods increasingly inadequate.\nDownload the full white paper\nto uncover detailed insights into current DLP limitations and actionable steps to protect your sensitive data effectively in today's SaaS-first world.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Malicious PyPI, npm, and Ruby Packages Exposed in Ongoing Open-Source Supply Chain Attacks",
        "Link": "https://thehackernews.com/2025/06/malicious-pypi-npm-and-ruby-packages.html",
        "Summary": "Several malicious packages have been uncovered across the npm, Python, and Ruby package repositories that drain funds from cryptocurrency wallets, erase entire codebases after installation, and exfiltrate Telegram API tokens, once again demonstrating the variety of supply chain threats lurking in open-source ecosystems.\nThe findings come from multiple reports published by Checkmarx,",
        "Date": "2025-06-04",
        "Content": "Several malicious packages have been uncovered across the npm, Python, and Ruby package repositories that drain funds from cryptocurrency wallets, erase entire codebases after installation, and exfiltrate Telegram API tokens, once again demonstrating the variety of supply chain threats lurking in open-source ecosystems.\nThe findings come from multiple reports published by Checkmarx, ReversingLabs, Safety, and Socket in recent weeks. The list of identified packages across these platforms are listed below -\nSocket noted that the two\nmalicious\ngems\nwere published by a threat actor under the aliases Bùi nam, buidanhnam, and si_mobile merely days after Vietnam\nordered\na nationwide ban on the Telegram messaging app late last month for allegedly not cooperating with the government to tackle illicit activities related to fraud, drug trafficking, and terrorism.\n\"These gems silently exfiltrate all data sent to the Telegram API by redirecting traffic through a command-and-control (C2) server controlled by the threat actor,\" Socket researcher Kirill Boychenko\nsaid\n. \"This includes bot tokens, chat IDs, message content, and attached files.\"\nThe software supply chain security company said the gems are \"near-identical clones\" of the legitimate\nFastlane\nplugin \"fastlane-plugin-telegram,\" a widely used library to send deployment notifications to Telegram channels from CI/CD pipelines.\nThe malicious change introduced by the threat actor tweaks the network endpoint used to send and receive Telegram messages to a hard-coded server (\"rough-breeze-0c37.buidanhnam95.workers[.]dev\") that effectively acts as a relay between the victim and the Telegram API, while silently harvesting sensitive data.\nGiven that the malware itself is not region-specific and lacks any geofencing logic to limit its execution to Vietnamese systems, it's suspected that the attackers simply capitalized on the Telegram ban in the country to distribute counterfeit libraries under the guise of a proxy.\n\"This campaign illustrates how quickly threat actors can exploit geopolitical events to launch targeted supply chain attacks,\" Boychenko said. \"By weaponizing a widely used development tool like Fastlane and disguising credential-stealing functionality behind a timely 'proxy' feature, the threat actor leveraged trust in package ecosystems to infiltrate CI/CD environments.\"\nSocket said it also discovered an npm package named \"xlsx-to-json-lh\" that typosquats the legitimate conversion tool \"xlsx-to-json-lc\" and detonates a malicious payload when an unsuspecting developer imports the package. First published in February 2019, it has since been taken down.\n\"This package contains a hidden payload that establishes a persistent connection to a command-and-control (C2) server,\" security researcher Kush Pandya\nsaid\n. \"When triggered, it can delete entire project directories without warning or recovery options.\"\nSpecifically, the destruction actions are unleashed once the French command \"remise à zéro\" (meaning \"reset\") is issued by the C2 server, causing the package to delete source code files, version control data, configuration files, node_modules (including itself), and all project assets.\nAnother set of\nmalicious npm packages\n– pancake_uniswap_validators_utils_snipe, pancakeswap-oracle-prediction, ethereum-smart-contract, and env-process – have been found to steal anywhere between 80 to 85% of the funds present in a victim's Ethereum or BSC wallet using obfuscated JavaScript code and transfer them to an attacker-controlled wallet.\nThe packages, uploaded by a user named @crypto-exploit, have attracted over 2,100 downloads, with \"pancake_uniswap_validators_utils_snipe\" published four years ago. They are currently no longer available for download.\nSimilar cryptocurrency-themed malicious packages discovered on PyPI have incorporated covert functionality to steal Solana private keys, source code, and other sensitive data from compromised systems. It's worth noting that while \"semantic-types\" was benign when it was first uploaded on December 22, 2024, the malicious payload was introduced as an update on January 26, 2025.\nOne collection of PyPI packages is designed to \"\nmonkey patch\n\" Solana key-generation methods by modifying relevant functions at runtime without making any changes to the original source code.\nThe threat actor behind the Python packages, who used the alias cappership to publish them to the repository, is said to have used polished README files and linked them to GitHub repositories in an attempt to lend credibility and trick users into downloading them.\n\"Each time a keypair is generated, the malware captures the private key,\" Boychenko\nsaid\n. \"It then encrypts the key using a hardcoded RSA‑2048 public key and encodes the result in Base64. The encrypted key is embedded in a spl.memo transaction and sent to Solana Devnet, where the threat actor can retrieve and decrypt it to gain full access to the stolen wallet.\"\nThe second batch of\n11 Python packages\nto target the Solana ecosystem, according to Vancouver-based Safety, were uploaded to PyPI between May 4 and 24, 2025. The packages are designed to steal Python script files from the developer's system and transmit them to an external server. One of the identified packages, \"solana-live,\" has also been found to target Jupyter Notebooks for exfiltration while claiming to be a \"price fetching library.\"\nIn a sign that\ntyposquatting\ncontinues to be a significant attack vector, Checkmarx flagged six malicious PyPI packages that impersonate colorama, a widely-used Python package for colorizing terminal output, and colorizr, a color conversion JavaScript library available on npm.\n\"The tactic of using the name from one ecosystem (npm) to attack users of a different ecosystem (PyPI) is unusual,\" the company\nsaid\n. \"Payloads allow persistent remote access to and remote control of desktops and servers, as well as harvesting and exfiltrating sensitive data.\"\nWhat's notable about the campaign is that it targets users of both Windows and Linux systems, allowing the malware to establish a connection with a C2 server, exfiltrate sensitive environment variables and configuration information, and take steps to evade endpoint security controls.\nThat said, it's currently not known if the Linux and Windows payloads are the work of the same attacker, raising the possibility that they may be separate campaigns abusing a similar typosquatting tactic.\nMalicious actors are also wasting no time seizing the growing popularity of artificial intelligence (AI) tools to poison the software supply chain with PyPI packages like aliyun-ai-labs-snippets-sdk, ai-labs-snippets-sdk, and aliyun-ai-labs-sdk that purport to be a Python software development kit (SDK) for interacting with Aliyun AI Labs services.\nThe malicious packages were published to PyPI on May 19, 2024, and were available for download for less than 24 hours. However, the three packages were collectively downloaded more than 1,700 times before they were pulled from the registry.\n\"Once installed, the malicious package delivers an infostealer payload hidden inside a PyTorch model loaded from the initialization script,\" ReversingLabs researcher Karlo Zanki\nsaid\n. \"The malicious payload exfiltrates basic information about the infected machine and the content of the .gitconfig file.\"\nThe malicious code embedded within the model is equipped to gather details about the logged user, the network address of the infected machine, the name of the organization the machine belongs to, and the content of the .gitconfig file.\nInterestingly, the organization name is retrieved by reading the \"_utmc_lui_\" preference key from the configuration of the AliMeeting online meeting application, a videoconferencing application that's popular in China. This suggests that the likely targets of the campaign are developers located in China.\nWhat's more, the attack serves to highlight the growing threat posed by the misuse of machine learning model formats like\nPickle\n, which is susceptible to arbitrary code execution during deserialization.\n\"Threat actors are always trying to find new ways to hide the malicious payloads from security tools — and security analysts,\" Zanki said. \"This time, they were using ML models, a novel approach for distribution of malware via the PyPI platform. This is a clever approach, since security tools are only starting to implement support for the detection of malicious functionality inside ML models.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "HPE Issues Security Patch for StoreOnce Bug Allowing Remote Authentication Bypass",
        "Link": "https://thehackernews.com/2025/06/hpe-issues-security-patch-for-storeonce.html",
        "Summary": "Hewlett Packard Enterprise (HPE) has released security updates to address as many as eight vulnerabilities in its StoreOnce data backup and deduplication solution that could result in an authentication bypass and remote code execution.\n\"These vulnerabilities could be remotely exploited to allow remote code execution, disclosure of information, server-side request forgery, authentication bypass,",
        "Date": "2025-06-04",
        "Content": "Hewlett Packard Enterprise (HPE) has released security updates to address as many as eight vulnerabilities in its StoreOnce data backup and deduplication solution that could result in an authentication bypass and remote code execution.\n\"These vulnerabilities could be remotely exploited to allow remote code execution, disclosure of information, server-side request forgery, authentication bypass, arbitrary file deletion, and directory traversal information disclosure vulnerabilities,\" HPE\nsaid\nin an advisory.\nThis includes a fix for a critical security flaw tracked as CVE-2025-37093, which is rated 9.8 on the CVSS scoring system. It has been described as an authentication bypass bug affecting all versions of the software prior to 4.3.11. The vulnerability, along with the rest, was reported to the vendor on October 31, 2024.\nAccording to the Zero Day Initiative (ZDI), which credited an anonymous researcher for discovering and reporting the shortcoming, said the problem is rooted in the implementation of the machineAccountCheck method.\n\"The issue results from improper implementation of an authentication algorithm,\" ZDI\nsaid\n. \"An attacker can leverage this vulnerability to bypass authentication on the system.\"\nSuccessful exploitation of CVE-2025-37093 could permit a remote attacker to bypass authentication on affected installations. What makes the vulnerability more severe is that it could be chained with the remaining flaws to achieve code execution, information disclosure, and\narbitrary file deletion\nin the context of root -\nCVE-2025-37089 - Remote Code Execution\nCVE-2025-37090 - Server-Side Request Forgery\nCVE-2025-37091 - Remote Code Execution\nCVE-2025-37092 - Remote Code Execution\nCVE-2025-37093 - Authentication Bypass\nCVE-2025-37094 - Directory Traversal Arbitrary File Deletion\nCVE-2025-37095 - Directory Traversal Information Disclosure\nCVE-2025-37096 - Remote Code Execution\nThe disclosure comes as HPE also shipped patches to address multiple critical-severity flaws in\nHPE Telco Service Orchestrator\n(\nCVE-2025-31651\n, CVSS score: 9.8) and\nOneView\n(\nCVE-2024-38475\n,\nCVE-2024-38476\n, CVSS scores: 9.8) to address previously disclosed weaknesses in Apache Tomcat and Apache HTTP Server.\nWhile there are no reports of active exploitation, it's essential that users apply the latest updates for optimal protection.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft unveils free EU cybersecurity program for governments",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-unveils-free-eu-cybersecurity-program-for-governments/",
        "Summary": "Microsoft announced in Berlin today a new European Security Program that promises to bolster cybersecurity for European governments. [...]",
        "Date": "2025-06-04",
        "Content": "Microsoft announced in Berlin today a new European Security Program that promises to bolster cybersecurity for European governments.\nThe program expands to Microsoft's existing\nGovernment Security Program\n, which is free to all European Union countries, including accession states, European Free Trade Association (EFTA) members, the UK, Monaco, and the Vatican.\nThe tech giant noted that the program primarily aims to thwart attacks from state-backed actors in Russia, Iran, China, and North Korea, who have escalated their operations against the EU.\n\"Microsoft continues to observe persistent threat activity targeting European networks from nation-state actors, with Russian and Chinese activity being particularly prolific in Europe,\"\nreads the announcement\n.\n\"Nation-state actors, including those engaging in malicious activity from Iran and North Korea, are predominantly pursuing espionage objectives in Europe through credential theft or the exploitation of vulnerabilities to gain access to corporate and government networks,\" mentions Microsoft in another part.\nState-sponsored attacks targeting Europe\nSource: Microsoft\nAI at the center of cyber-defense\nThe key element of the program is the use of artificial intelligence to create actionable intelligence that will help in the timely detection and blocking of sophisticated attacks.\nMicrosoft will provide real-time AI-driven threat insights tailored to the needs of each nation, leveraging the program and expanding access to intelligence from the Digital Crimes Unit and Threat Analysis Center.\nMoreover, Microsoft will supply updates on foreign influence operations using deepfakes and deliver early warnings and remediation guidance for newly discovered vulnerabilities.\nAnother important pillar in the new program is strengthening partnerships to identify new threats, develop defense measures, and disrupt cybercrime.\nMicrosoft will renew and strengthen collaborations with Europol, the CyberPeace Institute, LASR, and the Western Balkans Cyber Capacity Center, and will continue to support the GitHub Secure Open Source Fund. Also, it will work closer with internet service providers to advise on user-level remediation.\nMicrosoft highlights its recent role in the recent\ntakedown of the Lumma infostealer malware\nas a clear demonstration of its deepening commitment to protecting Europe's digital infrastructure.\nThe info-stealer operation had many infections in the continent, mainly in Spain, France, Poland, Germany, Italy, and the United Kingdom.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nKerberos AS-REP roasting attacks: What you need to know\nMicrosoft adds quick machine recovery to Windows 11 settings\nScattered Spider: Three things the news doesn’t tell you\nCartier discloses data breach amid fashion brand cyberattacks\nDoubling down: How Universal 2nd Factor (U2F) boosts online security"
    },
    {
        "Title": "FBI: Play ransomware breached 900 victims, including critical orgs",
        "Link": "https://www.bleepingcomputer.com/news/security/fbi-play-ransomware-breached-900-victims-including-critical-orgs/",
        "Summary": "In an update to a joint advisory with CISA and the Australian Cyber Security Centre, the FBI said that the Play ransomware gang had breached roughly 900 organizations as of May 2025, three times the number of victims reported in October 2023. [...]",
        "Date": "2025-06-04",
        "Content": "In an update to a joint advisory with CISA and the Australian Cyber Security Centre, the FBI said that the Play ransomware gang had breached roughly 900 organizations as of May 2025, three times the number of victims\nreported in October 2023\n.\n\"Since June 2022, the Play (also known as Playcrypt) ransomware group has impacted a wide range of businesses and critical infrastructure in North America, South America, and Europe. Play ransomware was among the most active ransomware groups in 2024,\" the FBI\nwarned\n.\n\"As of May 2025, FBI was aware of approximately 900 affected entities allegedly exploited by the ransomware actors.\"\nToday's update also notes that the gang uses recompiled malware in every attack, making it more difficult for security solutions to detect and block it. Additionally, some victims have been contacted via phone calls and threatened to pay the ransom to prevent their stolen data from being leaked online.\nSince the start of the year, initial access brokers with ties to Play ransomware operators have also exploited several vulnerabilities (CVE-2024-57726, CVE-2024-57727, and CVE-2024-57728) in the remote monitoring and management tool in remote code execution attacks targeting U.S. organizations.\nIn one such incident, unknown threat actors\ntargeted vulnerable SimpleHelp RMM clients\nto create admin accounts, backdoored the compromised systems with Sliver beacons, potentially preparing them for future ransomware attacks.\nThe Play ransomware-as-a-service (RaaS) operation\nThe Play ransomware gang\nsurfaced almost three years ago, with the first victims reaching out for help in\nBleepingComputer's forums\nin June 2022. Before deploying ransomware on the victims' networks, Play affiliates steal sensitive documents from compromised systems and use them to pressure victims into paying ransom demands under the threat of publishing the stolen data on the gang's dark web leak site.\nHowever, unlike other ransomware operations, Play ransomware uses email as a negotiation channel and will not provide victims with a Tor negotiations page link.\nThe ransomware gang also uses a custom VSS Copying Tool that helps\nsteal files from shadow volume copies\n, even when used by other applications.\nPrevious high-profile Play ransomware victims include cloud computing company\nRackspace\n, the\nCity of Oakland\nin California,\nDallas County\n, car retailer giant\nArnold Clark\n, the\nBelgian city of Antwerp\n, and, more recently,\ndoughnut chain Krispy Kreme\nand American semiconductor supplier\nMicrochip Technology\n.\nIn guidance issued by the FBI, CISA, and the Australian Cyber Security Centre, security teams are urged to prioritize keeping their systems, software, and firmware up to date to reduce the likelihood that unpatched vulnerabilities are exploited in Play ransomware attacks.\nDefenders are also advised to implement multifactor authentication (MFA) across all services, focusing on VPN, webmail, and accounts with access to critical systems in their organizations' networks.\nAdditionally, they should maintain offline data backups and develop and test a recovery routine as part of their organization's standard security practices.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nFBI: Ransomware gangs hack casinos via 3rd party gaming vendors\nBidenCash carding market domains seized in international operation\nFBI warns of NFT airdrop scams targeting Hedera Hashgraph wallets\nMedia giant Lee Enterprises says data breach affects 39,000 people\nGermany doxxes Conti ransomware and TrickBot ring leader"
    },
    {
        "Title": "Hacker arrested for breaching 5,000 hosting accounts to mine crypto",
        "Link": "https://www.bleepingcomputer.com/news/security/hacker-arrested-for-breaching-5-000-hosting-accounts-to-mine-crypto/",
        "Summary": "The Ukrainian police arrested a 35-year-old hacker who breached 5,000 accounts at an international hosting company and used them to mine cryptocurrency, resulting in $4.5 million in damages. [...]",
        "Date": "2025-06-04",
        "Content": "The Ukrainian police arrested a 35-year-old hacker who breached 5,000 accounts at an international hosting company and used them to mine cryptocurrency, resulting in $4.5 million in damages.\n\"The suspect illegally gained access to over 5,000 accounts belonging to clients of an international hosting company that provides server rental services for the operation of various websites and online platforms,\"\nreads the police's announcement\n.\n\"After gaining access to these accounts, the perpetrator began unauthorized deployment of virtual machines (software that emulates a computer's operation) using the company's server resources.\"\nAs the threat actor utilized the accounts to mine cryptocurrency on the hosting provider's servers, the resulting damages were estimated to be $4,500,000.\nThe police's investigation established that the hacker had been active since 2018, using open-source intelligence to find and breach vulnerable infrastructure of international organizations.\nHe periodically changed locations to avoid being tracked down, so he lived in the regions of Poltava, Odesa, Zaporizhzhia, and Dnipropetrovsk during the past years.\nDuring the police raid at his residence, computer equipment, mobile phones, bank cards, and other forms of physical evidence were seized.\nA preliminary examination of the seized materials validated that the hacker maintained multiple accounts on hacker forums.\nThe hacker's seized computer\nSource: Ukraine cyberpolice\nThe seized evidence links the hacker to stolen email credentials, cryptocurrency wallets that held the illegally mined coins, software scripts used for launching and managing the mining activity, and tools for conducting data theft and remote access.\nThe hacker now faces charges under Part 5 of Article 361 of the Criminal Code of Ukraine, which could bring a maximum penalty of 15 years of imprisonment plus three years of prohibitions to engage in certain activities deemed risky.\nThe police noted that the investigation is still underway, and new evidence may add more charges.\nIt is unclear if the clients of the hosting firm that had their accounts hacked will be required to pay the bills inflated from the unauthorized mining activity.\nTo prevent this from happening to you, always use strong, unique passwords and multi-factor authentication to protect accounts with access to cloud resources.\nAlso, regularly check account activity to identify any early compromises and revoke access from unknown devices or applications immediately.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nMalicious VSCode extensions infect Windows with cryptominers\nUkraine claims it hacked Tupolev, Russia’s strategic warplane maker\nFBI warns of NFT airdrop scams targeting Hedera Hashgraph wallets\nCoinbase breach tied to bribed TaskUs support agents in India\nMozilla launches new system to detect Firefox crypto drainer add-ons"
    },
    {
        "Title": "Cisco warns of ISE and CCP flaws with public exploit code",
        "Link": "https://www.bleepingcomputer.com/news/security/cisco-warns-of-ise-and-ccp-flaws-with-public-exploit-code/",
        "Summary": "Cisco has released patches to address three vulnerabilities with public exploit code in its Identity Services Engine (ISE) and Customer Collaboration Platform (CCP) solutions. [...]",
        "Date": "2025-06-04",
        "Content": "Cisco has released patches to address three vulnerabilities with public exploit code in its Identity Services Engine (ISE) and Customer Collaboration Platform (CCP) solutions.\nThe most severe of the three is a critical static credential vulnerability tracked as\nCVE-2025-20286\n, found by GMO Cybersecurity's Kentaro Kawane in Cisco ISE. This identity-based policy enforcement software provides endpoint access control and network device administration in enterprise environments.\nThe vulnerability is due to improperly generated credentials when deploying Cisco ISE on cloud platforms, resulting in shared credentials across different deployments.\nUnauthenticated attackers can exploit it by extracting user credentials from Cisco ISE cloud deployments and using them to access installations in other cloud environments. However, as Cisco explained, threat actors can exploit this flaw successfully only if the Primary Administration node is deployed in the cloud.\n\"A vulnerability in Amazon Web Services (AWS), Microsoft Azure, and Oracle Cloud Infrastructure (OCI) cloud deployments of Cisco Identity Services Engine (ISE) could allow an unauthenticated, remote attacker to access sensitive data, execute limited administrative operations, modify system configurations, or disrupt services within the impacted systems,\" the company\nexplained\n.\n\"The Cisco PSIRT is aware that proof-of-concept exploit code is available for the vulnerability that is described in this advisory.\"\nCisco added that the following ISE deployments are not vulnerable to attacks:\nAll on-premises deployments with any form factors where artifacts are installed from the Cisco Software Download Center (ISO or OVA). This includes appliances and virtual machines with different form factors.\nISE on Azure VMware Solution (AVS)\nISE on Google Cloud VMware Engine\nISE on VMware cloud in AWS\nISE hybrid deployments with all ISE Administrator personas (Primary and Secondary Administration) on-premises with other personas in the cloud.\nThe company advises admins still waiting for a hotfix or who cannot immediately apply the hotfixes released today to run the\napplication reset-config ise\ncommand on the Primary Administration persona cloud node to reset user passwords to a new value.\nHowever, admins should also be aware that this command will reset Cisco ISE to the factory configuration and that restoring backups will also restore the original credentials.\nThe other two security bugs with proof-of-concept exploit code patched today are an arbitrary file upload (\nCVE-2025-20130\n) in Cisco ISE and an information disclosure (\nCVE-2025-20129\n) in the Cisco Customer Collaboration Platform (formerly Cisco SocialMiner).\nIn September, Cisco\npatched another ISE flaw\n, a command injection vulnerability with public exploit code that can let attackers escalate privileges to root on unpatched systems.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nExploit details for max severity Cisco IOS XE flaw now public\nGoogle fixes high severity Chrome flaw with public exploit\nCisco fixes max severity IOS XE flaw letting attackers hijack devices\nCritical Langflow RCE flaw exploited to hack AI app servers\nCritical Erlang/OTP SSH RCE bug now has public exploits, patch now"
    },
    {
        "Title": "Ukraine claims it hacked Tupolev, Russia’s strategic warplane maker",
        "Link": "https://www.bleepingcomputer.com/news/security/ukraine-claims-it-hacked-tupolev-russias-strategic-warplane-maker/",
        "Summary": "The Main Intelligence Directorate (GUR) of Ukraine's Ministry of Defense claims it hacked the Russian aerospace and defense company Tupolev, which develops Russia's supersonic strategic bombers. [...]",
        "Date": "2025-06-04",
        "Content": "The Main Intelligence Directorate (GUR) of Ukraine's Ministry of Defense claims it hacked the Russian aerospace and defense company Tupolev, which develops Russia's supersonic strategic bombers.\nAccording to Ukrainian news outlets, a source within GUR said the military intelligence hackers breached Tupolev's systems and stole 4.4 gigabytes of classified information.\nThis stolen data includes personal data of Tupolev personnel, internal communications (including messages exchanged by the company's management), procurement documents, resumes of engineers and designers, and minutes of closed meetings.\nWhile the source didn't disclose when Tupolev's systems were breached, it said the HUR hackers were inside Tupolev's network for a long time, sufficient to collect other information that could be used in future operations to compromise other organizations in Russia's defense sector.\n\"The value of the data obtained is hard to overstate. There is now virtually nothing secret left in Tupolev's operations as far as Ukrainian intelligence is concerned,\" the anonymous source told\nKyiv Post\n.\n\"We now have comprehensive information on individuals directly involved in maintaining Russia's strategic aviation. The effects of this operation will be felt both on the ground and in the skies.\"\nThey also defaced Tupolev's official website and added an image of an owl with an airplane in its claws. At the moment, the website redirects to the site of United Aircraft Corporation (UAC), a state-owned company created in 2006 to merge aircraft manufacturers Tupolev, Mikoyan, Ilyushin, Irkut, Sukhoi, and Yakovlev under a single brand.\nA United Aircraft Corporation spokesperson was not immediately available for comment when contacted by BleepingComputer earlier today.\nTupolev's defaced website (\nInterfax-Ukraine\n)\n​This follows\nan operation by Ukraine's Security Service (SBU)\nthat used first-person-view (FPV) drones to hit 41 warplanes at four Russian airfields, including A-50 surveillance planes and Tu-160, Tu-22, and Tu-95s strategic bombers.\nPreviously, GUR claimed it\nbreached the servers of the Russian Ministry of Defense\n(Minoborony) and stole sensitive documents containing secret service information.\nUkraine's military intelligence has also claimed unconfirmed breaches into the\nRussian Federal Air Transport Agency\n(Rosaviatsia), the\nRussian Center for Space Hydrometeorology\n, and the\nRussian Federal Taxation Service\n(FNS). In two of these attacks, GUR said its operatives also destroyed databases and wiped servers storing data backups for additional operational disruption.\nUkrainian hacktivists have also been\ntargeting\nRussian\norganizations\nsince Russia invaded Ukraine in February 2014. For instance, in January, the Ukrainian Cyber Alliance (UCA) group\nhacked the Russian internet service provider Nodex\nand wiped compromised systems and backups.\nUCA cyber activists have also claimed other breaches impacting various Russian entities, including Vladimir Putin's political adviser\nVladislav Surkov\n, the\nRussian Ministry of Defense\n​​​, the\nDonetsk People's Republic's Ministry of Coal and Energy\n, the\nCommonwealth of Independent States Institute\n(financed by the Russian state company Gazprom), and multiple Russian military officers and media outlets.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nRussian Laundry Bear cyberspies linked to Dutch Police hack\nRussian hackers breach orgs to track aid routes to Ukraine\nFBI seeks help to unmask Salt Typhoon hackers behind telecom breaches\nHackers abuse OAuth 2.0 workflows to hijack Microsoft 365 accounts\nInfamous message board 4chan taken down following major hack"
    },
    {
        "Title": "BidenCash carding market domains seized in international operation",
        "Link": "https://www.bleepingcomputer.com/news/security/bidencash-carding-market-domains-seized-in-international-operation/",
        "Summary": "Earlier today, law enforcement seized multiple domains of BidenCash, the infamous dark web market for stolen credit cards, personal information, and SSH access. [...]",
        "Date": "2025-06-04",
        "Content": "Earlier today, law enforcement seized multiple domains of BidenCash, the infamous dark web market for stolen credit cards, personal information, and SSH access.\nThe illegal shop’s domain on the dark web now redirects to the Secret Service’s domain for seizing websites involved in illegal activities.\nAn official banner informs visitors that the BidenCash domain has been seized by U.S. law enforcement as part of an international operation led by the United States Secret Service (USSS) and the Federal Bureau of Investigation.\nThe two U.S. agencies were supported in the operation by the Dutch National Police (Politie), the nonprofit security organization The ShadowServer Foundation, and the real-time attack surface visibility company Searchlight Cyber.\nBidenCash dark web domain redirects to USSS domain\nsource: BleepingComputer\nAccording to\nsecurity researcher g0njxa\n, the clear web domain on the .asia TLD for the carder marketplace also redirects to the Secret Service's\nusssdomainseizure.com\ndomain. Some domains are still online, according to some reports.\nA press release from the Department of Justice\ninforms\nthat the operation seized about 145 domains and cryptocurrency associated with the BidenCash marketplace both on the clearweb and on the darknet.\n\"BidenCash administrators charged a fee for every transaction conducted on the website,\" which generated more than $17 million in revenue since it emerged in 2022.\nAccording to the DoJ, the illegal market had more than 117,000 customers and helped traffick over 15 million payment card numbers along with personally identifiable information belonging to card owners.\nBidenCash's card data leaks\nIllegal card shops have been around for more than two decades. Initially, card data was typically collected in large amounts from PoS malware, which harvested the temporarily unencrypted card data from the memory of a point-of-sale (PoS) terminal.\nMore recently card information was stolen using web skimmers - malware planted on online shops to collect payment details from customers at checkout.\nBidenCash started in March 2022 to fill the void left by the\nshutdown of Joker’s Stash\ncard market about a year earlier and the Russian authorities seizing multiple card shops that included Forum, Trump Dumps, and UniCC.\nSince the beginning, the administrators of BidenCash tried to attract attention, not just through the name of the card shop but also by leaking large amounts of card information.\nThey started with a\nsmall leak\nin June 2022 of a database with just 6,600 credit cards but included millions of email addresses.\nA few months later, in October, BidenCash\nleaked a set of 1.2 million credit cards\nin an effort to promote their services.\nMost of the cards were from users in the U.S., expiration dates varied between 2023 and 2026, and covered a wide geography.\nIn 2023, the marketplace leaked two additional databases [\n1\n,\n2\n] that cumulatively counted more than 4 million credit cards.\nBidenCash leak of 1.9 million credit cards\nsource: BleepingComputer\nAlthough administrators of such services often try to restore their operations, these seizures have a significant impact on illegal activities.\nThe U.S. Secret Service is actively involved in fighting financial fraud that involves credit cards, money laundering, cryptocurrency scams, or identity theft operations.\nAt the end of May, the agency and multiple state and local law enforcement partners\nvisited\nmore than 411 businesses in search of illegal skimming devices at ATMs, gas pumps, and point-of-sale (PoS) terminals.\nWhile just 17 skimmers were recovered, it is estimated that the action prevented a potential loss of more than $5 million.\nUpdate [June 4th, 14:19]:\nArticle updated with information the U.S. Department of Justice published in a press release.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nCarding tool abusing WooCommerce API downloaded 34K times on PyPI\nFBI: Play ransomware breached 900 victims, including critical orgs\nFBI warns of NFT airdrop scams targeting Hedera Hashgraph wallets\nPolice takes down AVCheck site used by cybercriminals to scan malware\nFBI warns of Luna Moth extortion attacks targeting law firms"
    },
    {
        "Title": "FBI warns of NFT airdrop scams targeting Hedera Hashgraph wallets",
        "Link": "https://www.bleepingcomputer.com/news/security/fbi-warns-of-nft-airdrop-scams-targeting-hedera-hashgraph-wallets/",
        "Summary": "The FBI is warning about a new scam where cybercriminals exploit NFT airdrops on the Hedera Hashgraph network to steal crypto from cryptocurrency wallets. [...]",
        "Date": "2025-06-04",
        "Content": "The FBI is warning about a new scam where cybercriminals exploit NFT airdrops on the Hedera Hashgraph network to steal crypto from cryptocurrency wallets.\nAirdrops are a method of distributing cryptocurrency tokens for free to wallet addresses, usually as part of a marketing, community growth, or reward campaign, but they are also used as bait for scams.\n\"The Hedera Hashgraph is the distributed ledger used by Hedera. The airdrop feature was originally created by the Hedera Hashgraph network for marketing purposes; however, cyber criminals can exploit this tactic to collect victim data to steal cryptocurrency,\" explains the\nFBI advisory\n.\nIn the attacks targeting wallets on the Hedera Hashgraph network, the threat actors send unsolicited NFTs or tokens to users' wallets with memos prompting users to click on a URL to claim their reward.\nClicking the link takes victims to phishing sites or dApps that ask them to input sensitive information like account passwords and wallet recovery seed phrases.\nThe attackers can then use this sensitive information to hijack the victim's wallets and empty them.\nHedera Hashgraph is a distributed ledger technology (DLT) and public network, similar to Ethereum and Bitcoin, but built on a fundamentally different structure called a hashgraph rather than a blockchain.\nUnlike blockchains that store data in sequential blocks, hashgraph uses a gossip protocol and virtual voting to achieve consensus, allowing for faster, more scalable, and more energy-efficient operations.\nThis technology was introduced in 2018 as a next-generation distributed ledger aiming to overcome the limitations of conventional blockchains, and scammers have started to target it more as its popularity and adoption rise.\nFBI says that fraudsters currently promote their fraud campaigns beyond the unsolicited NFT airdrops, including phishing emails, social media advertisements, and fake websites.\nProtection advice\nWhen receiving airdrop alerts, it is advisable to always verify their legitimacy with the official source before engaging.\nVerify using the official customer service number/email address, and never the ones listed on emails, as those could direct the communication to the scammers.\nDuring the NFT claiming or minting process, it is crucial never to share passwords, seed phrases, or one-time passwords (OTPs), unless you initiated contact.\nFinally, cryptocurrency accounts should be regularly monitored for signs of unauthorized activity/transactions and suspicious login attempts.\nIf you suspect you have been compromised by scammers, it is advisable to contact your account providers and report it as soon as possible.\nThen, report the incident to the FBI's\nInternet Crime Complaint Center\n(IC3) with details such as cryptocurrency addresses and transaction information (ID, date, amount).\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nFBI: Scammers pose as FBI IC3 employees to 'help' recover lost funds\nFBI: Play ransomware breached 900 victims, including critical orgs\nHacker arrested for breaching 5,000 hosting accounts to mine crypto\nBidenCash carding market domains seized in international operation\nCoinbase breach tied to bribed TaskUs support agents in India"
    },
    {
        "Title": "Media giant Lee Enterprises says data breach affects 39,000 people",
        "Link": "https://www.bleepingcomputer.com/news/security/media-giant-lee-enterprises-says-data-breach-affects-39-000-people/",
        "Summary": "Publishing giant Lee Enterprises is notifying nearly 40,000 people whose personal information was stolen in a February 2025 ransomware attack. [...]",
        "Date": "2025-06-04",
        "Content": "Publishing giant Lee Enterprises is notifying nearly 40,000 people whose personal information was stolen in a February 2025 ransomware attack.\nAs one of the largest newspaper groups in the United States, Lee Enterprises publishes 77 daily newspapers and 350 weekly and specialty publications across 26 states. The local news provider's newspapers have a daily circulation of over 1.2 million, and a digital audience reaching tens of millions each month.\nIn a\nfiling\nwith the Office of Maine's Attorney General this week, the company revealed that attackers behind a ransomware attack in February stole documents containing personally identifiable information of 39,779 individuals.\n\"The investigation determined that information may have been accessed or acquired without authorization on February 3, 2025,\" Lee Enterprises revealed in data breach notifications sent to affected individuals.\n\"The information that could have been subject to unauthorized access and/or acquisition includes first and last name, as well as Social Security number.\"\nAfter the incident, Lee Enterprises\nnewsrooms\nacross the United States\nreported\nthat the attack triggered a systems outage, forcing the publisher to shut down many of its networks and leading to widespread printing and delivery disruptions for dozens of newspapers.\nBleepingComputer also\nlearned\nthat the outage had caused significant issues, including corporate VPNs being down and lost access to internal systems and cloud storage.\nA week later, the company submitted a filing with the SEC disclosing that the hackers \"encrypted critical applications and exfiltrated certain files,\" revealing that it\ngot hit by ransomware\n.\nBreach claimed by Qilin ransomware\nWhile the company has yet to attribute the attack to a specific operation, the Qilin ransomware gang\nclaimed responsibility\nin late February.\nThe ransomware gang claimed to have stolen 120,000 documents totaling 350 GB in size and threatened to release them all on March 5.\nQilin added Lee Enterprises to its dark web leak site on February 28, sharing samples of data allegedly stolen from the company's compromised systems, including government ID scans, financial spreadsheets, contracts/agreements, non-disclosure agreements, and other confidential files.\nLee Enterprise entry on Qilin's leak site (BleepingComputer)\n​When BleepingComputer contacted Lee Enterprises to confirm that the stolen data was legitimate, a spokesperson said the company was \"aware of the claims\" and was \"currently investigating them.\"\nLee Enterprises' network\nwas also breached\nbefore the 2020 U.S. presidential election when\nIranian hackers gained access\nto its systems as part of a broader campaign to spread disinformation.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nM&S says customer data stolen in cyberattack, forces password resets\nDragonForce ransomware abuses SimpleHelp in MSP supply chain attack\nAscension says recent data breach affects over 430,000 patients\nKickidler employee monitoring software abused in ransomware attacks\nBaltimore City Public Schools data breach affects over 31,000 people"
    },
    {
        "Title": "Google: Hackers target Salesforce accounts in data extortion attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/google-hackers-target-salesforce-accounts-in-data-extortion-attacks/",
        "Summary": "Google has observed hackers claiming to be the ShinyHunters extortion group conducting social engineering attacks against multi-national companies to steal data from organizations' Salesforce platforms. [...]",
        "Date": "2025-06-04",
        "Content": "Google has observed hackers claiming to be the ShinyHunters extortion group conducting social engineering attacks against multi-national companies to steal data from organizations' Salesforce platforms.\nAccording to Google's Threat Intelligence Group (GTIG), which tracks the threat cluster as 'UNC6040,'  the attacks target English-speaking employees with voice phishing attacks to trick them into connecting a modified version of Salesforce's Data Loader application.\nThe attackers impersonate IT support personnel, requesting the target employee to accept a connection to Salesforce Data Loader, a client application that allows users to import, export, update, or delete data within Salesforce environments.\n\"The application supports OAuth and allows for direct \"app\" integration via the \"connected apps\" functionality in Salesforce,\" explains the researchers.\n\"Threat actors abuse this by persuading a victim over the phone to open the Salesforce connect setup page and enter a \"connection code,\" thereby linking the actor-controlled Data Loader to the victim's environment.\nPrompt to enter connection code\nSource: Google\nThe target organizations already use the Salesforce cloud-based customer relationship management (CRM) platform, so the malicious request to install the tool appears legitimate within the attack's workflow.\nIn the UNC6040 attacks, the app is used to export data stored in Salesforce instances and then use the access to move laterally through connected platforms such as Okta, Microsoft 365, and Workplace.\nAccessing these additional cloud platforms allows the threat actors to access more sensitive information stored on those platforms, including sensitive communications, authorization tokens, documents, and more.\n\"UNC6040 is a financially motivated threat cluster that accesses victim networks by voice phishing social engineering,\" describes the\nGTIG report\n.\n\"Upon obtaining access, UNC6040 has been observed immediately exfiltrating data from the victim's Salesforce environment using Salesforce's Data Loader application.\"\n\"Following this initial data theft, UNC6040 was observed moving laterally through the victim's network, accessing and exfiltrating data from other platforms such as Okta, Workplace, and Microsoft 365.\"\nOverview of the UNC6040 attack\nSource: Google\nIn some cases, the data exfiltration process was stopped prematurely, as protection systems that detected unauthorized activity intervened to revoke access. The threat actors appeared to be aware of this risk, experimenting with various packet sizes before escalating their attack.\nUNC6040 also used modified versions of the Salesforce Data Loader appropriately named to fit the social engineering context. For example, renaming it to \"My Ticket Portal\" and tricking victims into installing the app on their systems during an alleged support phone call.\nGTIG reports the threat actors use Mullvad VPN IPs when exfiltrating the Salesforce data to obfuscate the activity.\nGoogle says that attacks used phishing pages impersonating Okta, linking them to threat actors associated with the \"The Com\" or Scattered Spider tactics.\nFor organizations using Salesforce, Google recommends restricting \"API Enabled\" permissions, limiting app installation authorization, and blocking access from commercial VPNs like Mullvad.\nMore information on protecting Salesforce from social engineering attacks is\navailable here\n.\nAfter publishing our story, Salesforce confirmed to BleepingComputer that accounts are not breached through a vulnerability attack but rather via social engineering attacks.\n\"Salesforce has enterprise-grade security built into every part of our platform, and there’s no indication the issue described stems from any vulnerability inherent to our services,\" Salesforce told BleepingComputer\n\"Attacks like voice phishing are targeted social engineering scams designed to exploit gaps in individual users’ cybersecurity awareness and best practices.\n\"Security is a shared responsibility, and we provide customers with tools, guidance, and security features like Multi-Factor Authentication and IP restrictions to help defend against evolving threats. For full details, please see our blog on how customers can protect their Salesforce environments from social engineering:\nhttps://www.salesforce.com/blog/protect-against-social-engineering/\n.\"\nHackers claim to be part of ShinyHunters\nIn the attacks observed by Google, the threat actors will eventually attempt to extort the company into paying a ransom not to leak the data. Google says these extortion demands can come months later, claiming to be from the infamous ShinyHunters extortion group.\n\"In some instances, extortion activities haven't been observed until several months after the initial UNC6040 intrusion activity, which could suggest that UNC6040 has partnered with a second threat actor that monetizes access to the stolen data,\" explains Google.\n\"During these extortion attempts, the actor has claimed affiliation with the well-known hacking group ShinyHunters, likely as a method to increase pressure on their victims.\"\nShinyHunters is a well-known hacking group that has\nlong been associated\nwith data theft attacks that extort companies into paying a ransom.\nThreat actors associated with the group have been behind numerous high-profile attacks, including the\nSnowFlake data theft attacks\nand the\nPowerSchool data breach\nthat\nimpacted 62 million students\n.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\n3AM ransomware uses spoofed IT calls, email bombing to breach networks\nLuna Moth extortion hackers pose as IT help desks to breach US firms\nCoinbase data breach exposes customer info and government IDs\nMedia giant Lee Enterprises says data breach affects 39,000 people\nScattered Spider: Three things the news doesn’t tell you"
    },
    {
        "Title": "Kerberos AS-REP roasting attacks: What you need to know",
        "Link": "https://www.bleepingcomputer.com/news/security/kerberos-as-rep-roasting-attacks-what-you-need-to-know/",
        "Summary": "Think your passwords are strong enough? AS-REP Roasting is back in the spotlight — and it's targeting weak spots in Active Directory. Learn more from Specops Software how attackers exploit missing Kerberos pre-auth and how to stop them with strong password policies. [...]",
        "Date": "2025-06-04",
        "Content": "Robust passwords remain the cornerstone of online security, even as malicious actors sharpen their attacks. Consider the threat from AS-REP roasting – and the defenses organizations must deploy to protect their Active Directory.\nAS-REP (Authentication Server Response) Roasting targets user objects in Active Directory that don’t require Kerberos pre-authentication. Kerberos – an authentication protocol – usually requires an operator to transmit an Authentication Server Request (known as an AS-REQ) to a domain controller (DC).\nThis message holds a timestamp that is encrypted with a hash of the user’s password. The DC must decrypt that timestamp using its own version of the hash: success sees the DC send back an AS-REP message with a Ticket Granting Ticket (TGT), which can then be used to make access requests.\nHowever, this secure process only functions safely when Kerberos pre-authentication is operational. In some cases, it may be disabled – for example, in systems that don’t support Kerberos, or use an early version of the protocol. In such cases, the DC might send the AS-REP even though the user hasn’t been authenticated.\nIn other words, malicious actors could seek to access and exploit any user object that doesn’t require pre-authentication.\nA growing threat\nThere are\na range of tools that can be used in these attacks\n, such as Rubeus or Impacket. The threat\ntakes place via a three-step process\n:\nThe attacker sends an AS-REQ to the DC, aimed at an object that isn’t configured for Kerberos pre-authentication.\nThe DC responds to this request with an AS-REP message containing a TGT.\nThe criminals then work to access the password in the TGT. They can take it offline, using such techniques as brute force attacks to try to gain access to the user’s passwords.\nActive Directory compromises are a growing concern at the highest levels. For instance, cybersecurity agencies in Australia, Canada, New Zealand, the UK and the US have highlighted\n17 common techniques\nthat are regularly used to target Active Directory. AS-Rep Roasting is high on the list. “Responding to and recovering from malicious activity involving Active Directory compromise is often time consuming, costly and disruptive,” the report warns.\nSecure your Active Directory passwords with Specops Password Policy\nVerizon’s Data Breach Investigation Report found stolen credentials are involved in 44.7% of breaches.\nEffortlessly secure Active Directory with compliant password policies, blocking 4+ billion compromised passwords, boosting security, and slashing support hassles!\nTry it for free\nHow to detect and mitigate AS-REP Roasting\nAS-REP Roasting can be very well-concealed. First you need to work out if you could be a victim – and then you must take steps to defend your Active Directory.\nIdentifying vulnerable accounts: To begin with, you need to work out your vulnerabilities. Through the use of specific scripts,\nit is possible to identify user accounts that don’t have the necessary Kerberos pre-authentication\n.\nEnforcing Kerberos pre-authentication: AS-REP Roasting only works when an object does not require Kerberos pre-authentication; you can therefore mitigate the danger if you ensure this pre-authentication is in place. In some cases, however, it may be that objects need to bypass Kerberos pre-authentication: these objects should be kept out of secure groups and granted only the bare minimum of privileges.\nMonitoring and logging techniques: You should aim to study your networks to monitor specific Event IDs that\ncould indicate someone is requesting TGTs\nor other behaviour that indicates the possibility of an AS-REP Roasting attack.\nThere could be different events involved\n, such as 4625, which are generated when an account fails to log on; 4768, which is generated when a TGT requested; and 4738 and 5136, which are produced when a user account is changed.\nImplement security best practices: AS-REP Roasting and similar techniques are just one step in the process needed to access a password. By implementing passwords of minimum lengths and complication, it can be difficult for the hackers to break into the password, even if they do manage a successful AS-REP Roasting attack.\nPassword power\nBy enforcing Kerberos pre-authentication, it should be possible to protect your Active Directory from AS-REP Roasting attacks. But as we’ve seen, that may not always be possible. This means that strong passwords are just as important as ever – perhaps more so.\nYou can reduce the danger of AS-REP Roasting attacks by ensuring that user accounts are protected with strong and uncompromised passwords. This not only protects your Active Directory from AS-REP Roasting but boosts its security in general.\nOf course, you could have many passwords to analyze, to the point that it becomes overwhelming. But with\nSpecops Password Policy\n, you can simplify the management of fine-grained password policies, and block users from creating weak and easily-guessed passwords.\nThe technology also continuously scans your active directory for breached or compromised passwords, currently blocking more than 4 billion. This makes it far easier to ensure compliance, while bolstering your passwords against hacking even if an attacker succeeds with an AS-REP Roasting attack.\nTry Specops Password Policy for free today\n.\nYour organization’s Active Directory will always need to be protected against malicious actors. Hacking techniques will undoubtedly evolve, as will the technology used to defend your systems – but for as long as people use passwords, password security will remain the foundation of safe and secure online authentication.\nNeed Active Directory security support?\nGet in touch\n.\nSponsored and written by\nSpecops Software\n."
    },
    {
        "Title": "Hacker targets other hackers and gamers with backdoored GitHub code",
        "Link": "https://www.bleepingcomputer.com/news/security/hacker-targets-other-hackers-and-gamers-with-backdoored-github-code/",
        "Summary": "A hacker targets other hackers, gamers, and researchers with exploits, bots, and game cheats in source code hosted on GitHub that contain hidden backdoors to give the threat actor remote access to infected devices. [...]",
        "Date": "2025-06-04",
        "Content": "A hacker targets other hackers, gamers, and researchers with exploits, bots, and game cheats in source code hosted on GitHub that contain hidden backdoors to give the threat actor remote access to infected devices.\nThis campaign was discovered by Sophos researchers, whom a client contacted to estimate the danger of a remote access trojan called Sakura RAT, which is freely available on GitHub.\nThe researchers found that the Sakura RAT code was essentially nonfunctional but had a\nPreBuildEvent\nin the Visual Studio project that downloads and installs malware on the devices of those who attempt to compile it. s.\nThe publisher, \"ischhfd83,\" was discovered to be directly or indirectly linked to another 141 GitHub repositories, 133 of which dropped hidden backdoors, marking this as a concerted campaign to distribute malware.\nOne of the malicious repositories promoting a fake exploit builder\nSource: Sophos\nThe backdoors selection includes Python scripts with obfuscated payloads, malicious screensaver (.scr) files using Unicode tricks, JavaScript files with encoded payloads, and Visual Studio PreBuild events.\nA few repositories appear to have been abandoned since late 2023, but many are active with regular commits, some submitted mere minutes before Sophos' analysis.\nThese commits are fully automated, so their sole purpose is to create a false image of activity that gives the malicious projects an illusion of legitimacy.\nCommits history\nSource: Sophos\n\"Because of the automated workflow runs, many projects had large numbers of commits (one had almost 60,000, despite having only been created in March 2025),\" explains Sophos.\n\"Across all repositories, the average number of commits was 4,446 at the time of our initial collection.\"\nThe number of contributors is fixed to three specific users for each repository, and different publisher accounts are used for each, never surpassing nine repositories assigned to a single account.\nThese repositories receive traffic from YouTube videos, Discord, and posts on cybercrime forums. Sakura RAT itself received some media attention that sparked interest among curious \"script kiddies\" who went out looking for it on GitHub.\nHowever, when victims download the files, running or building the code triggers a multi-step infection stage.\nThe initial backdoor triggering the infection process\nSource: Sophos\nThis process involves VBS scripts getting executed on the disk, PowerShell downloading an encoded payload from hardcoded URLs, fetching a 7zip archive from GitHub, and running an Electron app (SearchFilter.exe).\nThe app loads a bundled archive containing heavily obfuscated 'main.js' and related files, including code for system profiling, command execution, Windows Defender deactivation, and payload retrieval.\nExcerpt from main.js\nSource: Sophos\nThe additional payloads downloaded by the backdoor include info-stealers and remote access trojans such as Lumma Stealer, AsyncRAT, and Remcos, all featuring extensive data theft capabilities.\nAlthough many trojanized repositories are created to target other hackers, a wide variety of lures, such as game cheats, mod tools, and fake exploits, are used to target gamers, students, and even cybersecurity researchers.\nAs anyone can upload source code to GitHub, examining source code and verifying any projects' pre and post-build events is vital before attempting to compile software downloaded from open-source repositories.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nInterlock ransomware gang deploys new NodeSnake RAT on universities\nPrinter maker Procolored offered malware-laced drivers for months\nLumma infostealer malware operation disrupted, 2,300 domains seized\nRansomware gangs increasingly use Skitnet post-exploitation malware\nSupply chain attack hits npm package with 45,000 weekly downloads"
    },
    {
        "Title": "35K Solar Devices Vulnerable to Potential Hijacking",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/35k-solar-devices-internet-exposure-hijacking",
        "Summary": "A little more than three-quarters of these exposed devices are located in Europe, followed by Asia, with 17%.",
        "Date": "2025-06-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/35k-solar-devices-internet-exposure-hijacking"
    },
    {
        "Title": "Vishing Crew Targets Salesforce Data",
        "Link": "https://www.darkreading.com/application-security/vishing-crew-salesforce-data",
        "Summary": "A group Google is tracking as UNC6040 has been tricking users into installing a malicious version of a Salesforce app to gain access to and steal data from the platform.",
        "Date": "2025-06-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/vishing-crew-salesforce-data"
    },
    {
        "Title": "How Neuroscience Can Help Us Battle 'Alert Fatigue'",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/how-neuroscience-battle-alert-fatigue",
        "Summary": "By understanding the neurological realities of human attention, organizations can build more sustainable security operations that protect not only their digital assets but also the well-being of those who defend them.",
        "Date": "2025-06-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/how-neuroscience-battle-alert-fatigue"
    },
    {
        "Title": "Researchers Bypass Deepfake Detection With Replay Attacks",
        "Link": "https://www.darkreading.com/cybersecurity-analytics/researchers-bypass-deepfake-detection-replay-attacks",
        "Summary": "An international group of researchers found that simply rerecording deepfake audio with natural acoustics in the background allows it to bypass detection models at a higher-than-expected rate.",
        "Date": "2025-06-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-analytics/researchers-bypass-deepfake-detection-replay-attacks"
    },
    {
        "Title": "Attackers Impersonate Ruby Packages to Steal Sensitive Telegram Data",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/attackers-impersonate-ruby-packages-telegram-data",
        "Summary": "Malicious RubyGems pose as a legitimate plug-in for the popular Fastlane rapid development platform in a geopolitically motivated attack with global supply chain reach.",
        "Date": "2025-06-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/attackers-impersonate-ruby-packages-telegram-data"
    },
    {
        "Title": "Beware of Device Code Phishing",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/beware-device-code-phishing",
        "Summary": "Hackers are exploiting trusted authentication flows — like Microsoft Teams and IoT logins — to trick users into handing over access tokens, bypassing MFA and slipping undetected into corporate networks.",
        "Date": "2025-06-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/beware-device-code-phishing"
    },
    {
        "Title": "Google Warns of Vishing, Extortion Campaign Targeting Salesforce Customers",
        "Link": "https://www.securityweek.com/google-warns-of-vishing-extortion-campaign-targeting-salesforce-customers/",
        "Summary": "<p>A financially motivated threat actor employing vishing to compromise Salesforce customers, and extort them.</p>\n<p>The post <a href=\"https://www.securityweek.com/google-warns-of-vishing-extortion-campaign-targeting-salesforce-customers/\">Google Warns of Vishing, Extortion Campaign Targeting Salesforce Customers</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/google-warns-of-vishing-extortion-campaign-targeting-salesforce-customers/"
    },
    {
        "Title": "Going Into the Deep End: Social Engineering and the AI Flood",
        "Link": "https://www.securityweek.com/going-into-the-deep-end-social-engineering-and-the-ai-flood/",
        "Summary": "<p>AI is transforming the cybersecurity landscape—empowering attackers with powerful new tools while offering defenders a chance to fight back. But without stronger awareness and strategy, organizations risk falling behind.</p>\n<p>The post <a href=\"https://www.securityweek.com/going-into-the-deep-end-social-engineering-and-the-ai-flood/\">Going Into the Deep End: Social Engineering and the AI Flood</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/going-into-the-deep-end-social-engineering-and-the-ai-flood/"
    },
    {
        "Title": "Compyl Raises $12 Million for GRC Platform",
        "Link": "https://www.securityweek.com/compyl-raises-12-million-for-grc-platform/",
        "Summary": "<p>Compyl has raised $12 million in a Series A funding round that will be invested in go-to-market initiatives, hirings, and GRC platform expansion.</p>\n<p>The post <a href=\"https://www.securityweek.com/compyl-raises-12-million-for-grc-platform/\">Compyl Raises $12 Million for GRC Platform</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/compyl-raises-12-million-for-grc-platform/"
    },
    {
        "Title": "Ramnit Malware Infections Spike in OT as Evidence Suggests ICS Shift",
        "Link": "https://www.securityweek.com/ramnit-malware-infections-spike-in-ot-as-evidence-suggests-ics-shift/",
        "Summary": "<p>Industrial giant Honeywell has published its 2025 Cybersecurity Threat Report with information on the latest trends.</p>\n<p>The post <a href=\"https://www.securityweek.com/ramnit-malware-infections-spike-in-ot-as-evidence-suggests-ics-shift/\">Ramnit Malware Infections Spike in OT as Evidence Suggests ICS Shift</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/ramnit-malware-infections-spike-in-ot-as-evidence-suggests-ics-shift/"
    },
    {
        "Title": "Webinar Today: Redefining Vulnerability Management With Exposure Validation",
        "Link": "https://www.securityweek.com/webinar-today-redefining-vulnerability-management-with-exposure-validation/",
        "Summary": "<p>Learn why your security controls matter more than theoretical risk scores and how exposure validation helps slash massive patch lists down to the few vulnerabilities that truly demand action.</p>\n<p>The post <a href=\"https://www.securityweek.com/webinar-today-redefining-vulnerability-management-with-exposure-validation/\">Webinar Today: Redefining Vulnerability Management With Exposure Validation</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/webinar-today-redefining-vulnerability-management-with-exposure-validation/"
    },
    {
        "Title": "ThreatSpike Raises $14 Million in Series A Funding",
        "Link": "https://www.securityweek.com/threatspike-raises-14-million-in-series-a-funding/",
        "Summary": "<p>ThreatSpike will use the fresh funding to expand its engineering, go-to-market, and security operations teams.</p>\n<p>The post <a href=\"https://www.securityweek.com/threatspike-raises-14-million-in-series-a-funding/\">ThreatSpike Raises $14 Million in Series A Funding</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/threatspike-raises-14-million-in-series-a-funding/"
    },
    {
        "Title": "Victoria’s Secret Says It Will Postpone Earnings Report After Recent Security Breach",
        "Link": "https://www.securityweek.com/victorias-secret-says-it-will-postpone-earnings-report-after-recent-security-breach/",
        "Summary": "<p>Victoria’s Secret is postponing the release of its quarterly earnings following a security breach that disrupted the popular lingerie brand’s corporate operations.</p>\n<p>The post <a href=\"https://www.securityweek.com/victorias-secret-says-it-will-postpone-earnings-report-after-recent-security-breach/\">Victoria&#8217;s Secret Says It Will Postpone Earnings Report After Recent Security Breach</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/victorias-secret-says-it-will-postpone-earnings-report-after-recent-security-breach/"
    },
    {
        "Title": "Thousands Hit by The North Face Credential Stuffing Attack",
        "Link": "https://www.securityweek.com/thousands-hit-by-the-north-face-credential-stuffing-attack/",
        "Summary": "<p>Threat actors steal personal information from thenorthface.com user accounts in a recent credential stuffing campaign.</p>\n<p>The post <a href=\"https://www.securityweek.com/thousands-hit-by-the-north-face-credential-stuffing-attack/\">Thousands Hit by The North Face Credential Stuffing Attack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/thousands-hit-by-the-north-face-credential-stuffing-attack/"
    },
    {
        "Title": "35,000 Solar Power Systems Exposed to Internet",
        "Link": "https://www.securityweek.com/35000-solar-power-systems-exposed-to-internet/",
        "Summary": "<p>Researchers from Forescout have analyzed the prevalence of internet-exposed solar power devices and shared a list of the top vendors and devices.</p>\n<p>The post <a href=\"https://www.securityweek.com/35000-solar-power-systems-exposed-to-internet/\">35,000 Solar Power Systems Exposed to Internet</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/35000-solar-power-systems-exposed-to-internet/"
    },
    {
        "Title": "Trustifi Raises $25 Million for AI-Powered Email Security",
        "Link": "https://www.securityweek.com/trustifi-raises-25-million-for-ai-powered-email-security/",
        "Summary": "<p>Trustifi has raised $25 million in Series A funding to accelerate its product roadmap and go-to-market initiatives.</p>\n<p>The post <a href=\"https://www.securityweek.com/trustifi-raises-25-million-for-ai-powered-email-security/\">Trustifi Raises $25 Million for AI-Powered Email Security</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/trustifi-raises-25-million-for-ai-powered-email-security/"
    },
    {
        "Title": "Nepal Police Allegedly Breached, Sensitive Data Appears for Sale Online",
        "Link": "https://dailydarkweb.net/nepal-police-allegedly-breached-sensitive-data-appears-for-sale-online/",
        "Summary": "The Nepal Police, the national law enforcement agency of Nepal, has allegedly become the victim of a significant data breach, with a large cache of sensitive information reportedly being offered for sale online. The Nepal Police, established in 1955, is a crucial institution responsible for maintaining law and order, investigating crimes, managing traffic, and leading [&#8230;]",
        "Date": "2025-06-04",
        "Content": "The Nepal Police, the national law enforcement agency of Nepal, has allegedly become the victim of a significant data breach, with a large cache of sensitive information reportedly being offered for sale online. The Nepal Police, established in 1955, is a crucial institution responsible for maintaining law and order, investigating crimes, managing traffic, and leading disaster response operations under the Ministry of Home Affairs. The compromise of its data could have serious implications for national security and the privacy of individuals connected to the agency.\nA threat actor is allegedly selling a 48 GB data dump purportedly originating from the Nepal Police website (www.nepalpolice.gov.np). The actor is demanding $15,000 for the information. The contents of the breach allegedly include a wide array of personally identifiable information and official records. This incident highlights the persistent threats faced by governmental organizations and the critical need for robust cybersecurity measures.\nThe compromised data allegedly includes:\nID CARD ( FRONT/ BACK )\nFACE IMAGE\nSIGNATURE\nFIRST NAME\nLAST NAME\nGENDER\nAGE\nBIRTH YEAR\nROLL NUMBER\nADVERTISEMENT NUMBER\nCLASSIFICATION\nEXAM TITLE\nADVERTISEMENT DATE\nEXAM CENTER\nCATEGORIES APPLIED UNDER\nTags:\nallegedly\ncyber-attack\nCyberSecurity\ndata-breach\ngovernment\nlaw enforcement\nNepal\nNepal Police"
    },
    {
        "Title": "Major Spanish Retail Brand Hacendado Allegedly Breached, 27 Million Users’ Data Offered for Sale",
        "Link": "https://dailydarkweb.net/major-spanish-retail-brand-hacendado-allegedly-breached-27-million-users-data-offered-for-sale/",
        "Summary": "Hacendado, a prominent Spanish brand primarily associated with Mercadona, one of Spain&#8217;s largest supermarket chains, has allegedly fallen victim to a significant data breach. An unauthorized actor claims to have exploited a zero-day vulnerability within a third-party logistics and inventory management system integrated with Hacendado&#8217;s backend infrastructure, leading to the compromise of extensive user data. [&#8230;]",
        "Date": "2025-06-04",
        "Content": "Hacendado, a prominent Spanish brand primarily associated with Mercadona, one of Spain’s largest supermarket chains, has allegedly fallen victim to a significant data breach. An unauthorized actor claims to have exploited a zero-day vulnerability within a third-party logistics and inventory management system integrated with Hacendado’s backend infrastructure, leading to the compromise of extensive user data. Hacendado is a widely recognized private label for Mercadona, offering a vast range of grocery and household products, making Mercadona a key player in the Spanish retail sector with millions of customers across Spain and Portugal. The scale of its operations means a data breach could have widespread consequences for its customer base.\nThe perpetrator of the alleged breach is offering a substantial dataset for private sale, reportedly containing information on over 27 million unique users. The compromised data is described as raw and unfiltered, directly scraped from the affected systems. The actor also claims to possess exclusive rights to the unpatched zero-day vulnerability, indicating it has not been reported or fixed. The origin of the breach is attributed to this previously unknown flaw in a third-party vendor’s software, highlighting the persistent risks associated with supply chain vulnerabilities.\nThe following data categories are allegedly included in the breach:\nFull names, emails, and hashed passwords\nLocation data and purchase history\nInternal employee emails and operational logs\nFragmented payment metadata\nTokens and access credentials (partially obfuscated)\nTags:\nalleged breach\nCyberSecurity\ndata-breach\nHacendado\nMercadona\nRetail\nSpain\nthird-party vendor\nuser data\nZero-Day"
    },
    {
        "Title": "Kettering Health Data Breach: 2.6 TB Allegedly Leaked by Interlock Ransomware Group",
        "Link": "https://dailydarkweb.net/kettering-health-data-breach-2-6-tb-allegedly-leaked-by-interlock-ransomware-group/",
        "Summary": "Kettering Health, a significant Ohio-based healthcare network, has allegedly suffered a major data breach at the hands of the Interlock ransomware group. The group has now reportedly published a substantial 2.6 TB of data, purportedly belonging to the healthcare provider. This development follows earlier reports around May 20-21, 2025, when Kettering Health experienced significant operational [&#8230;]",
        "Date": "2025-06-04",
        "Content": "Kettering Health, a significant Ohio-based healthcare network, has allegedly suffered a major data breach at the hands of the Interlock ransomware group. The group has now reportedly published a substantial 2.6 TB of data, purportedly belonging to the healthcare provider. This development follows earlier reports around May 20-21, 2025, when Kettering Health experienced significant operational disruptions due to a cyberattack, which was widely attributed to the Interlock group at the time.\nKettering Health, headquartered in Kettering, Ohio, is a vital healthcare organization serving the Greater Dayton area and surrounding communities. It operates an extensive network including nine hospitals, numerous acute care facilities and clinics, and Kettering College, with a large workforce of physicians and employees. The alleged publication of such a large volume of data raises grave concerns about the potential exposure of sensitive patient and organizational information. The full extent and nature of the compromised data are yet to be officially detailed.\nThis incident underscores the persistent and evolving threat that ransomware attacks pose to critical infrastructure, particularly the healthcare sector. Organizations are continually urged to bolster their cybersecurity defenses and have robust incident response plans in place. The alleged data publication by the Interlock group is a severe escalation following the initial attack that impacted Kettering Health’s services and patient care capabilities in late May."
    },
    {
        "Title": "Australian Non-Profit Epworth Hospital Allegedly Targeted by Global Ransomware Group",
        "Link": "https://dailydarkweb.net/australian-non-profit-epworth-hospital-allegedly-targeted-by-global-ransomware-group/",
        "Summary": "A prominent Australian healthcare provider, Epworth HealthCare, has allegedly been targeted by a global ransomware group. Epworth HealthCare is a leading not-for-profit private hospital group in Victoria, known for its high-quality medical, surgical, and rehabilitation services. Established in 1920, the organization operates major hospitals across Melbourne and Geelong, playing a significant role in the region&#8217;s [&#8230;]",
        "Date": "2025-06-04",
        "Content": "A prominent Australian healthcare provider, Epworth HealthCare, has allegedly been targeted by a global ransomware group. Epworth HealthCare is a leading not-for-profit private hospital group in Victoria, known for its high-quality medical, surgical, and rehabilitation services. Established in 1920, the organization operates major hospitals across Melbourne and Geelong, playing a significant role in the region’s healthcare system.\nThe alleged attack, attributed to a “GLOBAL GROUP,” has resulted in a threat to release compromised data. According to information from a blog post, the attackers have set a deadline of June 4, 2025, for the public release of the data. The specific types of data that have allegedly been compromised have not yet been detailed, but the impending release raises serious concerns about the potential exposure of sensitive patient and operational information.\nThis incident highlights the increasing threat that ransomware groups pose to critical infrastructure, including healthcare facilities. The potential consequences of such a breach could be severe, impacting patient privacy and the operational capabilities of the hospital group. Further details are expected to emerge as the situation develops.\nTags:\nallegedly\naustralia\nCyberSecurity\ndata-breach\nEpworth Hospital\nglobal group\nHealthcare\nNonprofit\nransomware"
    },
    {
        "Title": "Alleged Data Breach at Tradgo: 4.4 GB Database Reportedly for Sale Online",
        "Link": "https://dailydarkweb.net/alleged-data-breach-at-tradgo-in-4-4-gb-database-reportedly-for-sale-online/",
        "Summary": "An Indian platform, tradgo.in, has allegedly been compromised, with a threat actor claiming to be selling a comprehensive database of the company on an online forum. Tradgo.in appears to be a platform involved in financial transactions, Aadhaar-based services, and user data management, making it a significant entity handling sensitive personal and financial information for its [&#8230;]",
        "Date": "2025-06-04",
        "Content": "An Indian platform, tradgo.in, has allegedly been compromised, with a threat actor claiming to be selling a comprehensive database of the company on an online forum. Tradgo.in appears to be a platform involved in financial transactions, Aadhaar-based services, and user data management, making it a significant entity handling sensitive personal and financial information for its users in India. The compromise of such a platform could have serious implications for a large number of individuals.\nThe individual or group behind the alleged sale posted details of the database, which is said to be 4.4 GB in size, containing approximately 49.25 million records spread across 250 tables. The forum post highlights that the database allegedly includes highly sensitive information. The seller is offering this extensive dataset for an undisclosed price, inviting interested parties to make direct contact for negotiations and to receive a sample snippet for verification.\nThe following data titles were allegedly listed as part of the leaked database:\nadhar_data (Aadhaar details)\nadhar_verification (Aadhaar verification data)\ntblusers (user profiles including names, contact info, etc.)\ntblusers_info (additional user information)\ntblewallet (wallet transactions)\ntblpayment (payment records)\ntblrecharge (recharge transactions)\nicici_payments (ICICI bank payment data)\nicici_qr_requests (QR payment requests)\nlocking_order_id (order IDs and locks)\ntblapibalance_log (API balance logs)\nNumerous other tables covering configurations, commissions, and operator data.\nTags:\nAadhaar\nallegedly\nCyberSecurity\ndata-breach\ndata-leak\nfinancial data\nIndia\ntradgo.in\nuser data"
    }
]