[
    {
        "Title": "Supply chain attack hits Gluestack NPM packages with 960K weekly downloads",
        "Link": "https://www.bleepingcomputer.com/news/security/supply-chain-attack-hits-gluestack-npm-packages-with-960k-weekly-downloads/",
        "Summary": "A significant supply chain attack hit NPM after 15 popular Gluestack packages with over 950,000 weekly downloads were compromised to include malicious code that acts as a remote access trojan (RAT). [...]",
        "Date": "2025-06-07",
        "Content": "A significant supply chain attack hit NPM after 16 popular Gluestack 'react-native-aria' packages with over 950,000 weekly downloads were compromised to include malicious code that acts as a remote access trojan (RAT).\nBleepingComputer determined that the compromise began on June 6 at 4:33 PM EST, when a new version of the react-native-aria/focus package was published to NPM. Since then, 16 of the 20 Gluestack\nreact-native-aria packages\nhave been compromised on NPM, with the threat actors publishing a new version as recently as two hours ago.\nOngoing compromise of NPM packages\nSource: BleepingComputer\nThe supply chain attack was discovered by cybersecurity firm\nAikido Security,\nwho discovered obfuscated code injected into the\nlib/index.js\nfile for the following packages:\nPackage Name\nVersion\nWeekly Downloads\nreact-native-aria/button\n0.2.11\n51,000\nreact-native-aria/checkbox\n0.2.11\n81,000\nreact-native-aria/combobox\n0.2.10\n51,000\nreact-native-aria/disclosure\n0.2.9\n3\nreact-native-aria/focus\n0.2.10\n100,000\nreact-native-aria/interactions\n0.2.17\n125,000\nreact-native-aria/listbox\n0.2.10\n51,000\nreact-native-aria/menu\n0.2.16\n22,000\nreact-native-aria/overlays\n0.3.16\n96,000\nreact-native-aria/radio\n0.2.14\n78,000\nreact-native-aria/switch\n0.2.5\n477\nreact-native-aria/toggle\n0.2.12\n81,000\nreact-native-aria/utils\n0.2.13\n120,000\ngluestack-ui/utils\n0.1.17\n55,000\nreact-native-aria/separator\n0.2.7\n65\nreact-native-aria/slider\n0.2.13\n51,000\nThese packages are very popular, with approximately 960,000 weekly downloads, making this a supply chain attack that could have widespread consequences.\nThe malicious code is heavily obfuscated and is appended to the last line of source code in the file, padded with many spaces, so it's not easily spotted when using the code viewer on the NPM site.\nMalicious code added to end of index.js file\nSource: BleepingComputer\nAikido told BleepingComputer that the malicious code is nearly identical to a remote access trojan in\nanother NPM compromise they discovered\nlast month.\nThe researcher's analysis of the previous campaign explains that the remote access trojan will connect to the attackers' command and control server and receive commands to execute.\nThese commands include:\ncd -\nChange current working directory\nss_dir -\nReset directory to script’s path\nss_fcd:<path>\n- Force change directory to <path>\nss_upf:f,d -\nUpload single file f to destination d\nss_upd:d,dest -\nUpload all files under directory d to destination dest\nss_stop -\nSets a stop flag to interrupt current upload process\nAny other input -\nTreated as a shell command, executed via child_process.exec()\nThe trojan also performs Windows PATH hijacking by prepending a fake Python path (%LOCALAPPDATA%\\Programs\\Python\\Python3127) to the PATH environment variable, allowing the malware to silently override legitimate python or pip commands to execute malicious binaries.\nAikido sercurity researcher Charlie Eriksen has attempted to contact Gluestack about the compromise by creating\nGitHub issues\non each of the project's repositories, but there has not been any response at this time.\n\"No response from package maintainers (it's morning on a saturday in the US which is prob exactly why its happening now),\" Arkido told BleepingComputer.\n\"NPM we have contacted and reported each package, this is a process that usually takes multiple days for NPM to address though.\"\nAikido also attributes this attack to the same threat actors who compromised four other NPM packages earlier this week named\nbiatec-avm-gas-station\n,\ncputil-node\n,\nlfwfinance/sdk\n, and\nlfwfinance/sdk-dev\n.\nBleepingComputer reached out to Gluestack about the compromised packages but has not received a reply at this time.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nSupply chain attack hits npm package with 45,000 weekly downloads\nMalicious NPM package uses Unicode steganography to evade detection\nMalicious PyPI packages abuse Gmail, websockets to hijack systems\nAI-hallucinated code dependencies become new supply chain risk\nMalicious npm packages posing as utilities delete project directories"
    },
    {
        "Title": "Malicious npm packages posing as utilities delete project directories",
        "Link": "https://www.bleepingcomputer.com/news/security/malicious-npm-packages-posing-as-utilities-delete-project-directories/",
        "Summary": "Two malicious packages have been discovered in the npm JavaScript package index, which masquerades as useful utilities but, in reality, are destructive data wipers that delete entire application directories. [...]",
        "Date": "2025-06-07",
        "Content": "Two malicious packages have been discovered in the npm JavaScript package index, which masquerades as useful utilities but, in reality, are destructive data wipers that delete entire application directories.\nThe data wiper packages are 'express-api-sync' and 'system-health-sync-api,' and pose as database syncing and system health monitoring Ttools.\nAccording to open-source software security firm Socket, they both contain backdoors that enable remote data-wiping actions at the infected host.\nThe packages were published on npm in May 2025 and have been removed from npm following their reporting by Socket.\nThe firm's historic stats show that express-api-sync was downloaded by unsuspecting developers\n855 times\n, while express-api-sync had\n104 downloads\n.\nThe first package, express-api-sync, registers a hidden POST endpoint (/api/this/that) and waits for requests that contain the secret key 'DEFAULT_123.'\nOnce it receives it, it executes \"rm -rf *\" in the application's directory, deleting all files.\n\"Once triggered, the rm -rf * command executes in the application's working directory, deleting all files, including source code, configuration files, uploaded assets, and any local databases,\" explains the\nSocket report\n.\n\"The endpoint returns status messages to the attacker indicating success ({\"message\":\"All files deleted\"}) or failure of the destruction.\"\nThe second package, 'system-health-sync-api,' is more sophisticated.\nIt registers multiple backdoor endpoints at:\nGET /_/system/health → returns server status\nPOST /_/system/health → primary destruction endpoint\nPOST /_/sys/maintenance → backup destruction endpoint\nIn this case, the secret key is 'HelloWorld,' triggering reconnaissance followed by remote, OS-specific destruction.\nThe wiper supports both Linux ('rm -rf *') and Windows ('rd /s /q .') deletion commands, so it uses the right one depending on the detected architecture.\nMulti-platform destruction\nSource: Socket\nOnce the action is complete, the wiper emails the attacker to ‘anupm019@gmail.com' with the backend URL, the system fingerprint, and the result of the file wipe.\nThe attacker also receives more immediate feedback to their original request via an HTTP response, which confirms whether the destructive command succeeded in real time.\nCases of data wipers in npm are unusual, as they serve no financial gain or data theft purpose, which is the typical case when malware slips onto software distribution platforms.\nSocket comments on this by characterizing the two packages as \"a concerning addition to npm's threat landscape,\" which could signify state-level or sabotage activity creeping into the ecosystem.\n\"These packages don't steal cryptocurrency or credentials—they delete everything,\" concludes Socket.\n\"This suggests attackers motivated by sabotage, competition, or state-level disruption rather than being solely financially motivated.\"\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nNew PathWiper data wiper malware hits critical infrastructure in Ukraine\nDozens of malicious packages on NPM collect host and network data\nHacker targets other hackers and gamers with backdoored GitHub code\nRansomware gangs increasingly use Skitnet post-exploitation malware\nSupply chain attack hits npm package with 45,000 weekly downloads"
    },
    {
        "Title": "Indonesian ISP Wadma Network Allegedly Breached",
        "Link": "https://dailydarkweb.net/indonesian-isp-wadma-network-allegedly-breached/",
        "Summary": "An Indonesian Internet Service Provider, PT Wadma Berkah Sedaya, which operates under the name Wadma Network, has allegedly fallen victim to a data breach. A post on a dark web forum claims to have leaked databases belonging to the company. Wadma Network is an internet and solutions provider based in Bandung, Indonesia, offering fiber optic [&#8230;]",
        "Date": "2025-06-07",
        "Content": "An Indonesian Internet Service Provider, PT Wadma Berkah Sedaya, which operates under the name Wadma Network, has allegedly fallen victim to a data breach. A post on a dark web forum claims to have leaked databases belonging to the company. Wadma Network is an internet and solutions provider based in Bandung, Indonesia, offering fiber optic and wireless connectivity services to its customers. The company’s role as a telecommunications provider makes this alleged breach particularly sensitive, as it could potentially expose customer and internal company data.\nThe origin of the breach appears to be a threat actor who posted the data on a hacking forum. The leaked data, as displayed in the forum post, allegedly contains sensitive financial and administrative information. The actor shared a sample of the data, which includes a table labeled “m_bank,” suggesting the exposure of banking details. This incident raises concerns about the security posture of the ISP and the potential for misuse of the stolen information.\nThe allegedly leaked data includes the following types of information:\nBank ID\nBank Type\nBank Code\nBank Name\nAddress\nCity\nContact Information\nPhone Number\nBank Account Number\nBank Account Holder Name\nTags:\ndata-leak\nfinancial data\nIndonesia\nISP\nWadma Network"
    },
    {
        "Title": "Source Code for mac.c Stealer for macOS Allegedly for Sale",
        "Link": "https://dailydarkweb.net/source-code-for-mac-c-stealer-for-macos-allegedly-for-sale/",
        "Summary": "A sophisticated malware targeting Apple&#8217;s macOS, known as &#8220;mac.c Stealer,&#8221; is allegedly being sold on the dark web. The sale includes the complete source code for the stealer, its command-and-control panel, and the builder, for a starting price of $35,000. This development poses a significant threat to macOS users, as the availability of the source [&#8230;]",
        "Date": "2025-06-07",
        "Content": "A sophisticated malware targeting Apple’s macOS, known as “mac.c Stealer,” is allegedly being sold on the dark web. The sale includes the complete source code for the stealer, its command-and-control panel, and the builder, for a starting price of $35,000. This development poses a significant threat to macOS users, as the availability of the source code could lead to the proliferation of new, customized variants of the malware, making it harder to detect and defend against. The seller claims the project is a ready-made business, complete with a small, existing customer base.\nThe “mac.c Stealer” is a potent information-stealing malware designed to compromise systems running on both Intel (x64_86) and Apple Silicon (ARM) architectures. Its capabilities are extensive and focus on exfiltrating a wide range of sensitive data from infected machines. The malware allegedly has the ability to collect:\nPasswords, cookies, history, and autofill data from Chromium-based browsers.\nCredentials from desktop cryptocurrency wallets and browser-based crypto extensions.\nInformation from the macOS keychain.\nTelegram messenger sessions.\nFiles from the desktop and documents folders.\nGoogle Chrome authentication tokens.\nThe sale of such a feature-rich stealer as a “ready-to-go” package is alarming for the cybersecurity community. It lowers the barrier to entry for less-skilled malicious actors to launch effective cyberattacks against macOS users. The incident underscores the growing trend of malware-as-a-service (MaaS) and highlights the continuous need for robust security measures, even on platforms traditionally considered more secure.\nTags:\nCyberSecurity\ndark web\ndata-breach\ninformation stealer\nmac.c Stealer\nmacOS\nmalware\nsource code"
    },
    {
        "Title": "Universidad Autónoma de Nuevo León (UANL) Allegedly Breached",
        "Link": "https://dailydarkweb.net/universidad-autonoma-de-nuevo-leon-uanl-allegedly-breached/",
        "Summary": "A significant data breach has allegedly struck the Universidad Autónoma de Nuevo León (UANL), one of Mexico&#8217;s largest and most important public universities. A post on a notorious online forum claims to have possession of a database containing sensitive personal information belonging to individuals associated with the institution. The full extent of the breach is [&#8230;]",
        "Date": "2025-06-07",
        "Content": "A significant data breach has allegedly struck the Universidad Autónoma de Nuevo León (UANL), one of Mexico’s largest and most important public universities. A post on a notorious online forum claims to have possession of a database containing sensitive personal information belonging to individuals associated with the institution. The full extent of the breach is not yet clear, but the perpetrator claims the sample of leaked data is only a portion of a much larger database, which is being offered for sale.\nThe Universidad Autónoma de Nuevo León, a public institution with a history dating back to 1933, is a cornerstone of higher education in northeastern Mexico, serving over 218,000 students and employing nearly 7,000 academic staff. The university is a vital center for research and offers a vast array of educational programs. The alleged leak of its data could have serious implications for the privacy and security of its students, faculty, and alumni. The origin of the breach is currently unknown, and it is unclear how the attackers managed to infiltrate the university’s systems.\nThe individual or group behind the alleged leak has listed the types of compromised information. The data allegedly exposed includes:\nFull name\nFull address\nEmail\nPhone\nDegree\nTags:\ndata-leak\nhigher education\nMexico\nPrivacy\nUANL"
    },
    {
        "Title": "Exposed Admin Panel Allegedly Leads to Breach of 85,000 Records at Indian E-Learning Site",
        "Link": "https://dailydarkweb.net/exposed-admin-panel-allegedly-leads-to-breach-of-85000-records-at-indian-e-learning-site/",
        "Summary": "An Indian online education platform, Safalata, part of the Shraddha Group of Education, has allegedly become the latest victim of a significant data breach. The platform, which provides preparatory courses for various government and banking exams with a focus on specialized roles like translators and officers, may have had sensitive information of its users compromised. [&#8230;]",
        "Date": "2025-06-07",
        "Content": "An Indian online education platform, Safalata, part of the Shraddha Group of Education, has allegedly become the latest victim of a significant data breach. The platform, which provides preparatory courses for various government and banking exams with a focus on specialized roles like translators and officers, may have had sensitive information of its users compromised. The institution serves as a key resource for aspirants seeking roles in government sectors, financial institutions, and public service undertakings across India.\nThe data was allegedly published on a dark web forum by a threat actor who claimed to have accessed the information through a critical security lapse. According to the post, a direct link to an administrative panel was left exposed, allowing for unauthorized access to the website’s backend systems. This alleged oversight enabled the exfiltration of a database containing 85,430 user records, raising serious questions about the platform’s security infrastructure and data protection practices.\nThe leaked data allegedly includes:\nA complete database reportedly belonging to the Indian education company.\nInformation corresponding to 85,430 users of the platform.\nTags:\n000 Records at Indian E-Learning Site\nExposed Admin Panel Allegedly Leads to Breach of 85"
    }
]