[
    {
        "Title": "Over 1,000 SOHO Devices Hacked in China-linked LapDogs Cyber Espionage Campaign",
        "Link": "https://thehackernews.com/2025/06/over-1000-soho-devices-hacked-in-china.html",
        "Summary": "Threat hunters have discovered a network of more than 1,000 compromised small office and home office (SOHO) devices that have been used to facilitate a prolonged cyber espionage infrastructure campaign for China-nexus hacking groups.\nThe Operational Relay Box (ORB) network has been codenamed LapDogs by SecurityScorecard's STRIKE team.\n\"The LapDogs network has a high concentration of victims",
        "Date": "2025-06-27",
        "Content": "Threat hunters have discovered a network of more than 1,000 compromised small office and home office (SOHO) devices that have been used to facilitate a prolonged cyber espionage infrastructure campaign for China-nexus hacking groups.\nThe Operational Relay Box (ORB) network has been codenamed\nLapDogs\nby SecurityScorecard's STRIKE team.\n\"The LapDogs network has a high concentration of victims across the United States and Southeast Asia, and is slowly but steadily growing in size,\" the cybersecurity company\nsaid\nin a technical report published this week.\nOther regions where the infections are prevalent include Japan, South Korea, Hong Kong, and Taiwan, with victims spanning IT, networking, real estate, and media sectors. Active infections span devices and services from Ruckus Wireless, ASUS, Buffalo Technology, Cisco-Linksys, Cross DVR, D-Link, Microsoft, Panasonic, and Synology.\nLapDogs' beating heart is a custom backdoor called ShortLeash that's engineered to enlist infected devices in the network. Once installed, it sets up a fake Nginx web server and generates a unique, self-signed TLS certificate with the issuer name \"LAPD\" in an attempt to impersonate the Los Angeles Police Department. It's this reference that has given the ORB network its name.\nShortLeash is assessed to be delivered by means of a shell script to primarily penetrate Linux-based SOHO devices, although artifacts serving a Windows version of the backdoor have also been found. The attacks themselves weaponize N-day security vulnerabilities (e.g.,\nCVE-2015-1548\nand\nCVE-2017-17663\n) to obtain initial access.\nFirst signs of activity related to LapDogs have been detected as far back as September 6, 2023, in Taiwan, with the second attack recorded four months later, on January 19, 2024. There is evidence to suggest that the campaigns are launched in batches, each of which infects no more than 60 devices. A total of 162 distinct intrusion sets have been identified to date.\nThe ORB has been found to share some similarities with another cluster referred to as\nPolarEdge\n, which was documented by Sekoia earlier this February as exploiting known security flaws in routers and other IoT devices to corral them into a network since late 2023 for an as-yet-undetermined purpose.\nThe overlaps aside, LapDogs and PolarEdge are assessed as two separate entities, given the differences in the infection process, the persistence methods used, and the former's ability to also target virtual private servers (VPSs) and Windows systems.\n\"While PolarEdge backdoor replaces the CGI script of the devices with the operator's designated webshell, ShortLeash merely inserts itself into the system directory as a .service file, ensuring the persistence of the service upon reboot, with root-level privileges,\" SecurityScorecard noted.\nWhat's more, it has been gauged with medium confidence that the China-linked hacking crew tracked as\nUAT-5918\nused LapDogs in at least one of its operations aimed at Taiwan. It's currently not known if UAT-5918 is behind the network or is just a client.\nChinese threat actors' use of ORB networks as a means of obfuscation has been previously documented by\nGoogle Mandiant\n,\nSygnia\nand\nSentinelOne\n, indicating that they are being increasingly adopted into their playbooks for highly targeted operations.\n\"While both ORBs and botnets commonly consist of a large set of compromised, legitimate internet-facing devices or virtual services, ORB networks are more like Swiss Army knives, and can contribute to any stage of the intrusion lifecycle, from reconnaissance, anonymized actor browsing, and netflow collection to port and vulnerability scanning, initiating intrusion cycles by reconfiguring nodes into staging or even C2 servers, and relaying exfiltrated data up the stream,\" SecurityScorecard said.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "PUBLOAD and Pubshell Malware Used in Mustang Panda's Tibet-Specific Attack",
        "Link": "https://thehackernews.com/2025/06/pubload-and-pubshell-malware-used-in.html",
        "Summary": "A China-linked threat actor known as Mustang Panda has been attributed to a new cyber espionage campaign directed against the Tibetan community.\nThe spear-phishing attacks leveraged topics related to Tibet, such as the 9th World Parliamentarians' Convention on Tibet (WPCT), China's education policy in the Tibet Autonomous Region (TAR), and a recently published book by the 14th Dalai Lama,",
        "Date": "2025-06-27",
        "Content": "A China-linked threat actor known as\nMustang Panda\nhas been attributed to a new cyber espionage campaign directed against the Tibetan community.\nThe spear-phishing attacks leveraged topics related to Tibet, such as the 9th World Parliamentarians' Convention on Tibet (WPCT), China's education policy in the Tibet Autonomous Region (TAR), and a recently published book by the 14th Dalai Lama,\naccording\nto IBM X-Force.\nThe cybersecurity division of the technology company said it observed the campaign earlier this month, with the attacks leading to the deployment of a known Mustang Panda malware called\nPUBLOAD\n. It's tracking the threat actor under the name Hive0154.\nThe attack chains employ Tibet-themed lures to distribute a malicious archive containing a benign Microsoft Word file, along with articles reproduced by Tibetan websites and photos from WPCT, into opening an executable that's disguised as a document.\nThe executable, as observed in prior Mustang Panda attacks, leverages DLL side-loading to launch a malicious DLL dubbed Claimloader that's then used to deploy\nPUBLOAD\n, a downloader malware that's responsible for contacting a remote server and fetching a next-stage payload dubbed Pubshell.\nPubshell is a \"light-weight backdoor facilitating immediate access to the machine via a reverse shell,\" security researchers Golo Mühr and Joshua Chung said in an analysis published this week.\nAt this stage, it's worth mentioning some of the nomenclature differences: IBM has given the name Claimloader to the custom stager\nfirst documented\nby Cisco Talos in May 2022 and PUBLOAD to the first-stage shellcode downloader, whereas Trend Micro\nidentifies\nboth the stager and the downloader as PUBLOAD. Team T5, similarly, tracks the two components collectively as NoFive.\nThe development comes weeks after IBM's activity which it said is the work of a Hive0154 sub-cluster targeting the United States, Philippines, Pakistan, and Taiwan from late 2024 to early 2025.\nThis activity, like in the case of those targeting Tibet, utilizes weaponized archives originating from spear-phishing emails to target government, military, and diplomatic entities.\nThe digital missives contain links to Google Drive URLs that download the booby-trapped ZIP or RAR archives upon clicking, ultimately resulting in the deployment of TONESHELL in 2024 and PUBLOAD starting this year via Claimloader.\nTONESHELL\n, another oft-used Mustang Panda malware, functions similarly to Pubshell in that it's also used to create a reverse shell and execute commands on the compromised host.\n\"The Pubshell implementation of the reverse shell via anonymous pipes is almost identical to TONESHELL,\" the researchers\nsaid\n. \"However, instead of running a new thread to immediately return any results, Pubshell requires an additional command to return command results. It also only supports running 'cmd.exe' as a shell.\"\n\"In several ways, PUBLOAD and Pubshell appear to be an independently developed 'lite version' of TONESHELL, with less sophistication and clear code overlaps.\"\nThe attacks targeted Taiwan have been characterized by the use of a USB worm called\nHIUPAN\n(aka MISTCLOAK or U2DiskWatch), which is then leveraged to spread Claimloader and PUBLOAD through USB devices.\n\"Hive0154 remains a highly capable threat actor with multiple active sub-clusters and frequent development cycles,\" the researchers said.\n\"China-aligned groups like Hive0154 will continue to refine their large malware arsenal and retain a focus on East Asia-based organizations in the private and public sectors. Their wide array of tooling, frequent development cycles, and USB worm-based malware distribution highlights them as a sophisticated threat actor.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Business Case for Agentic AI SOC Analysts",
        "Link": "https://thehackernews.com/2025/06/business-case-for-agentic-ai-soc.html",
        "Summary": "Security operations centers (SOCs) are under pressure from both sides: threats are growing more complex and frequent, while security budgets are no longer keeping pace. Today’s security leaders are expected to reduce risk and deliver results without relying on larger teams or increased spending.\nAt the same time, SOC inefficiencies are draining resources. Studies show that up to half of all",
        "Date": "2025-06-27",
        "Content": "Security operations centers (SOCs) are under pressure from both sides: threats are growing more complex and frequent, while security budgets are no longer keeping pace. Today's security leaders are expected to reduce risk and deliver results without relying on larger teams or increased spending.\nAt the same time, SOC inefficiencies are draining resources.\nStudies\nshow that up to half of all alerts are false positives, with some reports citing false positive rates as high as\n99 percent\n. This means highly trained analysts spend a disproportionate amount of time chasing down harmless activity, wasting effort, increasing fatigue, and raising the chance of missing real threats.\nIn this environment, the business imperative is clear: maximize the impact of every analyst and every dollar by making security operations faster, smarter, and more focused.\nEnter the Agentic AI SOC Analyst\nThe\nagentic AI SOC Analyst\nis a force multiplier that enables organizations to do more with the team and technology they already have. By automating repetitive investigations and reducing time wasted on false positives, Agentic AI helps organizations redirect human expertise to the threats and initiatives that matter most, aligning security operations with core business goals of resilience, efficiency, and growth.\nAddressing the Skilled Analyst Shortage\nA key driver behind the business case for agentic AI in the SOC is the acute shortage of skilled security analysts. The global cybersecurity workforce gap is now estimated at 4 million professionals, but the real bottleneck for most organizations is the\nscarcity of experienced analysts\nwith the expertise to triage, investigate, and respond to modern threats. One\nISC2\nsurvey report from 2024 shows that 60% of organizations worldwide reported staff shortages significantly impacting their ability to secure the organizations, with another report from the\nWorld Economic Forum\nshowing that just 15% of organizations believe they have the right people with the right skills to properly respond to a cybersecurity incident.\nExisting teams are stretched thin, often forced to prioritize which alerts to investigate and which to leave unaddressed. As previously mentioned, the flood of false positives in most SOCs means that even the most experienced analysts are too distracted by noise, increasing exposure to business-impacting incidents.\nGiven these realities, simply adding more headcount is neither feasible nor sustainable. Instead, organizations must focus on maximizing the impact of their existing skilled staff. The AI SOC Analyst addresses this by automating routine Tier 1 tasks, filtering out noise, and surfacing the alerts that truly require human judgment. This not only drives faster investigations and\nincident response\n, but also helps retain top talent by reducing burnout and enabling more meaningful, strategic work.\nAI SOC Analysts enable security teams to reduce risk, control cost, and deliver more with less. By automating triage, investigation, and even\nremediation\n, they directly improve operational efficiency, reduce the burden on human analysts, and ensure threats are handled before they escalate.\nReducing noise, focusing on what matters\nAI SOC Analysts apply context and behavioral analysis to understand the threat level of an alert, suppressing low-value alerts and elevating high-risk activity. This drastically reduces alert fatigue and ensures analyst time is spent on real threats, not redundant noise. The result: stronger coverage and faster action, without scaling headcount. Organizations that deploy agentic AI SOC Analysts can see upwards of a 90% reduction in false positive alerts that need analyst review.\nIncreasing analyst efficiency and throughput\nTraditional investigation workflows are filled with repetitive, time-consuming tasks: pulling logs, linking evidence, and writing summaries. AI SOC Analysts automate this work, mirroring how experienced analysts think and investigate. The result is a dramatic increase in productivity. Teams can process more cases faster, and focus on strategic tasks like threat hunting and tuning detections.\nLearning and adapting over time\nAI-driven systems do not remain static.\nUnlike SOAR playbooks\n, agentic AI continuously improves based on analyst feedback, historical data, and threat intelligence. This means investigation accuracy increases, false positives are reduced, and the SOC becomes more efficient over time. What starts as an automation tool becomes a compounding asset that grows more effective with use. They can even surface\ninsights for detection engineers\nto create new rules or tune existing ones.\nMetrics that matter to SOC leaders\nAI SOC Analysts drive improvements in the key metrics used to evaluate SOC performance and business impact:\nMean time to investigate and mean time to respond\n: Automated investigations reduce the time from hours to minutes, limiting exposure and enabling faster containment.\nDwell time\n: Faster triage and detection shrinks the window in which attackers can move, steal data, or escalate.\nAlert closure rates\n: Higher rates of resolution reflect stronger SOC throughput and fewer ignored alerts.\nAnalyst productivity\n: When analysts spend less time on repetitive tasks and more time on proactive work, team value increases without growing headcount.\nUnlocking value from your existing stack and team\nAI SOC Analysts enhance the ROI of your existing security stack. By ingesting data from your SIEM, EDR, cloud, and identity platforms, AI ensures every signal is investigated. This closes the loop on alerts that would otherwise be ignored, turning your existing stack into a higher-value investment.\nAI also helps develop internal talent. Clear, consistent investigations act as on-the-job training for junior analysts. They gain exposure to advanced investigative methods without needing years of experience. The result is a more capable team, built faster and at lower cost.\nHow Prophet Security Aligns Security with Business Outcomes\nProphet Security\nhelps organizations move beyond manual investigations and alert fatigue by delivering an agentic AI SOC platform that automates triage, accelerates investigations, and ensures every alert gets the attention it deserves. By integrating across your existing stack, Prophet AI improves analyst efficiency, reduces incident dwell time, and drives faster, more consistent security outcomes.\nSecurity leaders use Prophet AI to get more value from the people and tools they already have, improve their security posture, and turn day-to-day SOC operations into measurable business results. Visit\nProphet Security\ntoday to request a demo and see firsthand how Prophet AI can elevate your SOC operations.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Chinese Group Silver Fox Uses Fake Websites to Deliver Sainbox RAT and Hidden Rootkit",
        "Link": "https://thehackernews.com/2025/06/chinese-group-silver-fox-uses-fake.html",
        "Summary": "A new campaign has been observed leveraging fake websites advertising popular software such as WPS Office, Sogou, and DeepSeek to deliver Sainbox RAT and the open-source Hidden rootkit.\nThe activity has been attributed with medium confidence to a Chinese hacking group called Silver Fox (aka Void Arachne), citing similarities in tradecraft with previous campaigns attributed to the threat actor.",
        "Date": "2025-06-27",
        "Content": "A new campaign has been observed leveraging fake websites advertising popular software such as WPS Office, Sogou, and DeepSeek to deliver Sainbox RAT and the open-source Hidden rootkit.\nThe activity has been attributed with medium confidence to a Chinese hacking group called\nSilver Fox\n(aka Void Arachne), citing similarities in tradecraft with previous campaigns attributed to the threat actor.\nThe phishing websites (\"wpsice[.]com\") have been found to distribute malicious MSI installers in the Chinese language, indicating that the targets of the campaign are Chinese speakers.\n\"The malware payloads include the Sainbox RAT, a variant of Gh0st RAT, and a variant of the open-source Hidden rootkit,\" Netskope Threat Labs researcher Leandro Fróes\nsaid\n.\nThis is not the first time the threat actor has resorted to this modus operandi. In July 2024, eSentire\ndetailed\na campaign that targeted Chinese-speaking Windows users with fake Google Chrome sites to deliver Gh0st RAT.\nThen earlier this February, Morphisec\ndisclosed\nanother campaign that also leveraged bogus sites advertising the web browser to distribute\nValleyRAT\n(aka Winos 4.0), a different version of Gh0st RAT.\nValleyRAT was\nfirst documented\nby Proofpoint in September 2023 as part of a campaign that also singled out Chinese-speaking users with Sainbox RAT and Purple Fox.\nIn the latest attack wave spotted by Netskope, the malicious MSI installers downloaded from the websites are designed to launch a legitimate executable named \"shine.exe,\" which sideloads a rogue DLL \"libcef.dll\" using DLL side-loading techniques.\nThe DLL's primary objective is to extract shellcode from a text file (\"1.txt\") present in the installer and then run it, ultimately resulting in the execution of another DLL payload, a remote access trojan called Sainbox.\n\"The .data section of the analyzed payload contains another PE binary that may be executed, depending on the malware's configuration,\" Fróes explained. \"The embedded file is a rootkit driver based on the open-source project\nHidden\n.\"\nWhile Sainbox comes fitted with capabilities to download additional payloads and steal data, Hidden offers attackers an array of stealthy features to hide malware-related processes and Windows Registry keys on compromised hosts.\n\"Using variants of commodity RATs, such as Gh0st RAT, and open-source kernel rootkits, such as Hidden, gives the attackers control and stealth without requiring a lot of custom development,\" Netskope said.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "MOVEit Transfer Faces Increased Threats as Scanning Surges and CVE Flaws Are Targeted",
        "Link": "https://thehackernews.com/2025/06/moveit-transfer-faces-increased-threats.html",
        "Summary": "Threat intelligence firm GreyNoise is warning of a \"notable surge\" in scanning activity targeting Progress MOVEit Transfer systems starting May 27, 2025—suggesting that attackers may be preparing for another mass exploitation campaign or probing for unpatched systems.MOVEit Transfer is a popular managed file transfer solution used by businesses and government agencies to share sensitive data",
        "Date": "2025-06-27",
        "Content": "Threat intelligence firm GreyNoise is warning of a \"notable surge\" in scanning activity targeting Progress MOVEit Transfer systems starting May 27, 2025—suggesting that attackers may be preparing for another mass exploitation campaign or probing for unpatched systems.\nMOVEit Transfer is a popular managed file transfer solution used by businesses and government agencies to share sensitive data securely. Because it often handles high-value information, it has become a favorite target for attackers.\n\"Prior to this date, scanning was minimal — typically fewer than 10 IPs observed per day,\" the company\nsaid\n. \"But on May 27, that number spiked to over 100 unique IPs, followed by 319 IPs on May 28.\"\nSince then, daily scanner IP volume has remained intermittently elevated between 200 to 300 IPs per day, GreyNoise added, stating it marks a \"significant deviation\" from usual behavior.\nAs many as 682 unique IPs have been flagged in connection with the activity over the past 90 days, with\n449 IP addresses\nobserved in the past 24 hours alone. Of the 449 IPs, 344 have been categorized as suspicious and 77 have been marked malicious.\nA majority of the\nIP addresses\ngeolocate to the United States, followed by Germany, Japan, Singapore, Brazil, the Netherlands, South Korea, Hong Kong, and Indonesia.\nGreyNoise also said it detected low-volume exploitation attempts to weaponize two known MOVEit Transfer flaws (\nCVE-2023-34362\nand\nCVE-2023-36934\n) on June 12, 2025. It's worth noting that CVE-2023-34362 was abused by Cl0p ransomware actors as part of a widespread campaign in 2023, impacting more than 2,770 organizations.\nThe spike in scanning activity is an indication that MOVEit Transfer instances are once again under the threat actor's scanner, making it essential that users block the offending IP addresses, make sure the software is up-to-date, and avoid publicly exposing them over the internet.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "OneClik Malware Targets Energy Sector Using Microsoft ClickOnce and Golang Backdoors",
        "Link": "https://thehackernews.com/2025/06/oneclik-malware-targets-energy-sector.html",
        "Summary": "Cybersecurity researchers have detailed a new campaign dubbed OneClik that leverages Microsoft's ClickOnce software deployment technology and bespoke Golang backdoors to compromise organizations within the energy, oil, and gas sectors.\n\"The campaign exhibits characteristics aligned with Chinese-affiliated threat actors, though attribution remains cautious,\" Trellix researchers Nico Paulo",
        "Date": "2025-06-27",
        "Content": "Cybersecurity researchers have detailed a new campaign dubbed\nOneClik\nthat leverages Microsoft's ClickOnce software deployment technology and bespoke Golang backdoors to compromise organizations within the energy, oil, and gas sectors.\n\"The campaign exhibits characteristics aligned with Chinese-affiliated threat actors, though attribution remains cautious,\" Trellix researchers Nico Paulo Yturriaga and Pham Duy Phuc\nsaid\nin a technical write-up.\n\"Its methods reflect a broader shift toward 'living-off-the-land' tactics, blending malicious operations within cloud and enterprise tooling to evade traditional detection mechanisms.\"\nThe phishing attacks, in a nutshell, make use of a .NET-based loader called OneClikNet to deploy a sophisticated Go-based backdoor codenamed RunnerBeacon that's designed to communicate with attacker-controlled infrastructure that's obscured using Amazon Web Services (AWS) cloud services.\nClickOnce\nis offered by Microsoft as a way to install and update Windows-based applications with minimal user interaction. It was introduced in .NET Framework 2.0. However, the technology can be an attractive means for threat actors looking to execute their malicious payloads without raising any red flags.\nAs noted in the MITRE ATT&CK framework, ClickOnce applications can be used to run malicious code through a trusted Windows binary, \"dfsvc.exe,\" that's responsible for installing, launching, and updating the apps. The apps are launched as a child process of \"dfsvc.exe.\"\n\"Because ClickOnce applications receive only limited permissions, they do not require administrative permissions to install,\" MITRE\nexplains\n. \"As such, adversaries may abuse ClickOnce to proxy execution of malicious code without needing to escalate privileges.\"\nTrellix said the attack chains begin with phishing emails containing a link to a fake hardware analysis website that serves as a conduit for delivering a ClickOnce application, which, in turn, runs an executable using dfsvc.exe.\nThe binary is a ClickOnce loader that's launched by injecting the malicious code via another technique known as AppDomainManager injection, ultimately resulting in the execution of an encrypted shellcode in memory to load the RunnerBeacon backdoor.\nThe Golang implant can communicate with a command-and-control (C2) server over HTTP(s), WebSockets, raw TCP, and SMB named pipes, allowing it to perform file operations, enumerate and terminate running processes, execute shell commands, escalate privileges using token theft and impersonation, and achieve lateral movement.\nAdditionally, the backdoor incorporates anti-analysis features to evade detection, and supports network operations like port scanning, port forwarding, and SOCKS5 protocol to facilitate proxy and routing features.\n\"RunnerBeacon's design closely parallels known\nGo-based Cobalt Strike beacons\n(e.g. the Geacon/Geacon plus/Geacon Pro family),\" the researchers said.\n\"Like Geacon, the set of commands (shell, process enumeration, file I/O, proxying, etc.) and use of cross-protocol C2 are very similar. These structural and functional similarities suggest RunnerBeacon may be an evolved fork or a privately modified variant of Geacon, tailored for stealthier, and cloud-friendly operations.\"\nThree different variants of OneClick have been observed in March 2025 alone: v1a, BPI-MDM, and v1d, with each iteration demonstrating progressively improved capabilities to fly under the radar. That said, a variant of RunnerBeacon was identified in September 2023 at a company in the Middle East in the oil and gas sector.\nAlthough techniques like AppDomainManager injection have been used by\nChina\n- and\nNorth Korea-linked\nthreat actors in the past, the activity has not been formally attributed to any known threat actor or group.\nThe development comes as QiAnXin detailed a campaign mounted by a threat actor it tracks as APT-Q-14 that has also employed ClickOnce apps to propagate malware by exploiting a zero-day cross-site scripting (XSS) flaw in the web version of an unnamed email platform. The vulnerability, it said, has since been patched.\nThe XSS flaw is automatically triggered when a victim opens a phishing email, causing the download of the ClickOne app. \"The body of the phishing email comes from Yahoo News, which coincides with the victim industry,\" QiAnXin\nnoted\n.\nThe intrusion sequence serves a mailbox instruction manual as a decoy, while a malicious trojan is stealthily installed on the Windows host to collect and exfiltrate system information to a C2 server and receive unknown next-stage payloads.\nThe Chinese cybersecurity company said APT-Q-14 also focuses on zero-day vulnerabilities in email software for the Android platform.\nAPT-Q-14 has been described by QiAnXin as originating from Northeast Asia and having overlaps with other clusters dubbed APT-Q-12 (aka Pseudo Hunter) and APT-Q-15, which are assessed to be sub-groups within a\nSouth Korea-aligned threat group\nknown as\nDarkHotel\n(aka APT-C-06).\nEarlier this week, Beijing-based 360 Threat Intelligence Center disclosed DarkHotel's use of the Bring Your Own Vulnerable Driver (BYOVD) technique to terminate Microsoft Defender Antivirus and deploy malware as part of a phishing attack that delivered fake MSI installation packages in February 2025.\nThe malware is engineered to establish communication with a remote server to download, decrypt, and execute unspecified shellcode.\n\"In general, the [hacking group's] tactics have tended to be 'simple' in recent years: Different from the previous use of heavy-weight vulnerabilities, it has adopted flexible and novel delivery methods and attack techniques,\" the company\nsaid\n. \"In terms of attack targets, APT-C-06 still focuses on North Korean-related traders, and the number of targets attacked in the same period is greater.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Scattered Spider hackers shift focus to aviation, transportation firms",
        "Link": "https://www.bleepingcomputer.com/news/security/scattered-spider-hackers-shift-focus-to-aviation-transportation-firms/",
        "Summary": "Hackers associated with Scattered Spider tactics have expanded their targeting to the aviation and transportation industries after previously attacking insurance and retail sectors [...]",
        "Date": "2025-06-27",
        "Content": "Hackers associated with \"Scattered Spider\" tactics have expanded their targeting to the aviation and transportation industries after previously attacking insurance and retail sectors\nThese threat actors have employed a sector-by-sector approach, initially targeting retail companies, such as\nM&S\nand\nCo-op\n, in the United Kingdom and the\nUnited States\nand subsequently shifting their focus\nto insurance companies\n.\nWhile the threat actors were not officially named as responsible for insurance sector attacks at first, recent incidents have impacted\nAflac\n,\nErie Insurance\n, and Philadelphia Insurance Companies.\nHackers target the aviation industry\nOn June 12, Canada's second-largest airline, WestJet,\nsuffered a cyberattack\nthat briefly disrupted the company's internal services and mobile app.\nSoon after the breach, sources told BleepingComputer that Palo Alto Networks and Microsoft were assisting in the response to the attack.\nThe attack was attributed to Scattered Spider, who allegedly compromised the company's data centers and its Microsoft Cloud environment.\nBleepingComputer was informed that the threat actor gained access by performing a self-service password reset for an employee, which enabled them to register their own MFA and obtain remote access to the network through Citrix.\nWhile other threat actors conduct identity attacks, Scattered Spider has become associated with this tactic due to their regular targeting of help desks and password and MFA infrastructure.\nToday, Hawaiian Airlines also disclosed that they\nsuffered a cyberattack\nbut did not provide any details that could indicate who was behind the attack. However, a source told BleepingComputer that it is believed that the same threat actors are responsible.\nPalo Alto Networks' Sam Rubin, SVP of Consulting and Threat Intelligence, has now confirmed on LinkedIn that Scattered Spider has begun targeting the aviation industry.\n\"Unit 42 has observed Muddled Libra (also known as Scattered Spider) targeting the aviation industry,\"\nwarned Rubin\n.\n\"Organizations should be on high alert for sophisticated and targeted social engineering attacks and suspicious MFA reset requests.\"\nMandiant's Charles Carmakal also warned that the threat actors have now switched their focus to both the aviation and transportation sectors.\n\"ALERT: Scattered Spider has added North American airline and transportation organizations to their target list,\"\nCarmakal posted to LinkedIn\n.\n\"Mandiant (part of Google Cloud) is aware of multiple incidents in the airline and transportation sector which resemble the operations of UNC3944 or Scattered Spider.\n\"We recommend that the industry immediately take steps to tighten up their help desk identity verification processes prior to adding new phone numbers to employee/contractor accounts (which can be used by the threat actor to perform self-service password resets), reset passwords, add devices to MFA solutions, or provide employee information (e.g. employee IDs) that could be used for a subsequent social engineering attacks.\"\nAmerican Airlines is also currently suffering an IT outage but it is unclear if it is a security incident. BleepingComputer contacted the airline but has not received a response.\nWhat is Scattered Spider\nScattered Spider, also known as\n0ktapus\n, Starfraud,\nUNC3944\n,\nScatter Swine\n,\nOcto Tempest\n, and\nMuddled Libra\n, is a classification of threat actors that are adept at using social engineering attacks, phishing, multi-factor authentication (MFA) bombing (targeted MFA fatigue), and SIM swapping to gain initial network access on large organizations.\nThese threat actors include young English-speaking people with diverse skill sets who frequent the same hacker forums, Telegram channels, and Discord servers. These mediums are then used to plan and execute attacks in real time.\nSome are believed to be part of the \"Com\" - a loose-knit community of threat actors known for financial fraud, cryptocurrency theft, data breaches, and extortion attacks.\nWhile Scattered Spider is commonly referred to as a cohesive gang, it is actually used to denote threat actors who utilize specific tactics when conducting attacks. As attacks associated with Scattered Spider tactics are also commonly used by different individuals from a loose network of threat actors, it makes it difficult to track them.\nUnlike many other English-speaking threat actors, those associated with \"Scattered Spider\" have been known to partner with Russian-speaking ransomware gangs, such as\nBlackCat\n,\nRansomHub\n,\nQilin\n, and DragonForce.\nOther attacks linked to Scattered Spider include those on\nMGM\n,\nMarks & Spencer\n,\nCo-op\n,\nTwilio\n,\nCoinbase\n,\nDoorDash\n,\nCaesars\n,\nMailChimp\n,\nRiot Games\n, and\nReddit\n.\nOrganizations defending against this type of threat actor should start with gaining complete visibility across the entire infrastructure, identity systems, and critical management services.\nThis includes securing self-service password reset platforms and help desks, common targets of these threat actors.\nBoth\nGoogle Threat Intelligence Group (GTIG)\nand\nPalo Alto Networks\nhave released guides on hardening defenses against the\nknown \"Scattered Spider\" tactics\nused by these threat actors.\nAll admins are advised to familiarize themselves with these tips and harden their identity platforms and processes.\nUpdate 6/27/25: Added that American Airlines is currently suffering from an IT outage.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\n3 key takeaways from the Scattered Spider attacks on insurance firms\nScattered Spider: Three things the news doesn’t tell you\nService desks are under attack: What can you do about it?\nUK shares security tips after major retail cyberattacks\nCo-op confirms data theft after DragonForce ransomware claims attack"
    },
    {
        "Title": "Russia’s throttling of Cloudflare makes sites inaccessible",
        "Link": "https://www.bleepingcomputer.com/news/technology/russias-throttling-of-cloudflare-makes-sites-inaccessible/",
        "Summary": "Starting June 9, 2025, Russian internet service providers (ISPs) have begun throttling access to websites and services protected by Cloudflare, an American internet giant. [...]",
        "Date": "2025-06-27",
        "Content": "Starting June 9, 2025, Russian internet service providers (ISPs) began throttling access to websites and services protected by Cloudflare, making sites inaccessible from the country.\nThe throttling is so aggressive, reportedly only allowing users to download the first 16 KB of any web asset, that it effectively breaks most Cloudflare-backed sites for Russian netizens.\nCloudflare maintains that it has not received formal communication about this from the Russian state but considers this action part of the country’s broader strategy to oust Western tech firms from the domestic market.\nThe internet company states that it is in no position to remediate the situation, as the throttling is outside its control, and there are no effective workarounds or mitigations to address the access problems it causes.\n\"As the throttling is being applied by local ISPs, the action is outside of Cloudflare’s control, and we are unable, at this time, to restore reliable, high-performance access to Cloudflare products and protected websites for Russian users in a lawful manner,\"\nstated Cloudflare\n.\nAccording to reports, the same type of throttling affects other Western internet service providers, including Hetzner (Germany), DigitalOcean (US), and OVH (France).\n\"One primary goal is to combat the tools used to circumvent state censorship. Hetzner and DigitalOcean are widely used by Russians to host private VPN servers, which allow them to bypass the Kremlin's ever-widening blocklists,\"\nreported MediaZona\nearlier this month.\n\"Cloudflare's infrastructure is similarly used by established anti-censorship services like Psiphon. By degrading these core providers, the state can disrupt the ecosystem of circumvention tools without having to block each one individually.\"\nVolume of internet traffic in Russia\nSource: Cloudflare\nFrom a technical perspective, Cloudflare believes that Russian ISPs, including Rostelecom, Megafon, Vimpelcom, MTS, and MGTS, employ multiple throttling and blocking mechanisms against them, including packet injection and packet blocking, which cause timeouts.\nThe throttling works even when connection requests reach servers located outside of Russia and affects all connection methods and protocols, including HTTP/1.1 and HTTP/2 on TCP and TLS, as well as HTTP/3 on QUIC.\nPercentage of packet losses over time\nSource: Cloudflare\nBeing unable to restore access, Cloudflare urges site operators in Russia to lobby local entities to lift restrictions.\nMeanwhile, Russian digital rights and online privacy observatory\nRoskomsvoboda reports\nmassive waves of mobile internet restrictions impacting over 30 regions in the country.\nWhile many of these actions were previously justified as measures to protect against drone attacks near the Ukrainian border, the number of regions impacted by internet access restrictions has recently grown rapidly, according to Roskomsvoboda, now including locations far from the front line.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nAPT28 hackers use Signal chats to launch new malware attacks on Ukraine\nRevil ransomware members released after time served on carding charges\nRussian hackers bypass Gmail MFA using stolen app passwords\nCloudflare blocks record 7.3 Tbps DDoS attack against hosting provider\nCloudflare: Outage not caused by security incident, data is safe"
    },
    {
        "Title": "Citrix Bleed 2 flaw now believed to be exploited in attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/citrix-bleed-2-flaw-now-believed-to-be-exploited-in-attacks/",
        "Summary": "A critical NetScaler ADC and Gateway vulnerability dubbed \"Citrix Bleed 2\" (CVE-2025-5777) is now likely exploited in attacks, according to cybersecurity firm ReliaQuest, seeing an increase in suspicious sessions on Citrix devices. [...]",
        "Date": "2025-06-27",
        "Content": "A critical NetScaler ADC and Gateway vulnerability dubbed \"Citrix Bleed 2\" (CVE-2025-5777) is now likely exploited in attacks, according to cybersecurity firm ReliaQuest, seeing an increase in suspicious sessions on Citrix devices.\nCitrix Bleed 2, named by cybersecurity researcher Kevin Beaumont due to its similarity to the original Citrix Bleed (CVE-2023-4966), is an out-of-bounds memory read vulnerability that allows unauthenticated attackers to access portions of memory that should typically be inaccessible.\nThis could allow attackers to steal session tokens, credentials, and other sensitive data from public-facing gateways and virtual servers, enabling them to hijack user sessions and bypass multi-factor authentication (MFA).\nCitrix's advisor also confirms this risk, warning users to end all ICA and PCoIP sessions after installing security updates to block access to any hijacked sessions.\nThe flaw, tracked as CVE-2025-5777, was\naddressed by Citrix\non June 17, 2025, with no reports of active exploitation. However, Beaumont warned about the high likelihood of exploitation\nearlier this week\n.\nThe researcher's worries now seem justified, as ReliaQuest says with medium confidence that CVE-2025-5777 is already being leveraged in targeted attacks.\n\"While no public exploitation of CVE-2025-5777, dubbed \"Citrix Bleed 2,\" has been reported, ReliaQuest assesses with medium confidence that attackers are actively exploiting this vulnerability to gain initial access to targeted environments,\"\nwarns ReliaQuest\n.\nThis conclusion is based on the following observations from actual attacks seen recently:\nHijacked Citrix web sessions were observed where authentication was granted without user interaction, indicating attackers bypassed MFA using stolen session tokens.\nAttackers reused the same Citrix session across both legitimate and suspicious IP addresses, suggesting session hijacking and replay from unauthorized sources.\nLDAP queries were initiated post-access, showing that attackers performed Active Directory reconnaissance to map users, groups, and permissions.\nMultiple instances of ADExplorer64.exe ran across systems, indicating coordinated domain reconnaissance and connection attempts to various domain controllers.\nCitrix sessions originated from data center IPs associated with consumer VPN providers like DataCamp, suggesting attacker obfuscation via anonymized infrastructure.\nThe above is consistent with post-exploitation activity following unauthorized Citrix access, reinforcing the assessment that CVE-2025-5777 is being exploited in the wild.\nTo protect against this activity, potentially impacted users should upgrade to versions 14.1-43.56+, 13.1-58.32+, or 13.1-FIPS/NDcPP 13.1-37.235+ to remediate the vulnerability.\nAfter installing the latest firmware, admins should terminate all active ICA and PCoIP sessions, as they may have already been hijacked.\nBefore killing active sessions, admins should first review them for suspicious activity using the\nshow icaconnection\ncommand and\nNetScaler Gateway\n>\nPCoIP\n>\nConnections\n.\nAfter reviewing the active sessions, admins can then terminate them using these commands:\nkill icaconnection -all\r\nkill pcoipconnection -all\nIf the immediate installation of security updates is impossible, it is recommended that external access to NetScaler be limited via network ACLs or firewall rules.\nIn response to our questions as to whether CVE-2025-5777 is being actively exploited, Citrix referred us back to a\nblog post published yesterday\nwhere they state that they see no signs of exploitation.\n\"Currently, there is no evidence to suggest exploitation of\nCVE-2025-5777\n,\" reads the Citrix post.\nHowever, another Citrix vulnerability, tracked as\nCVE-2025-6543 is being exploited in attacks\nto cause a denial of service condition on NetScaler devices.\nCitrix says that this flaw and the CVE-2025-5777 flaw are in the same module but are different bugs.\nUpdate 6/27/25: Added information about Citrix's blog post.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nNew 'CitrixBleed 2' NetScaler flaw let hackers hijack sessions\nCitrix warns of NetScaler vulnerability exploited in DoS attacks\nWordPress Motors theme flaw mass-exploited to hijack admin accounts\nHackers exploited Windows WebDav zero-day to drop malware\nDanaBot malware operators exposed via C2 bug added in 2022"
    },
    {
        "Title": "Retail giant Ahold Delhaize says data breach affects 2.2 million people",
        "Link": "https://www.bleepingcomputer.com/news/security/retail-giant-ahold-delhaize-says-data-breach-affects-22-million-people/",
        "Summary": "Ahold Delhaize, one of the world's largest food retail chains, is notifying over 2.2 million individuals that their personal, financial, and health information was stolen in a November ransomware attack that impacted its U.S. systems. [...]",
        "Date": "2025-06-27",
        "Content": "Ahold Delhaize, one of the world's largest food retail chains, is notifying over 2.2 million individuals that their personal, financial, and health information was stolen in a November ransomware attack that impacted its U.S. systems.\nThe multinational retailer and wholesale company operates over 9,400 local stores across Europe, the United States, and Indonesia, employing more than 393,000 people and serving approximately 60 million customers each week in-store and online.\nIt has reported yearly net sales of over $104 billion last year and it operates under a wide range of brands, including Food Lion, Stop & Shop, Giant Food, and Hannaford in the American market, and Delhaize, Maxi, Mega Image, Albert, bol, Alfa Beta, Gall & Gall, and Profi in Europe.\n\"This issue and subsequent mitigating actions have affected certain Ahold Delhaize USA brands and services including a number of pharmacies and certain e-commerce operations,\"\nsaid Ahold Delhaize\nin November, when it disclosed the incident.\nIn a Thursday\nfiling\nwith Maine's Attorney General, the retail giant revealed that the attackers behind the November breach stole the data of 2,242,521 individuals after gaining access to the company's internal U.S. business systems on November 6, 2024.\nWhile it didn't confirm whether customers' information was also affected, Ahold Delhaize stated that the stolen files may have included internal employment records with personal information obtained while working with current and former Ahold Delhaize USA companies.\nThe company added that the stolen items vary for each affected individual and that the stolen documents contain a combination of:\npersonal information such as name, contact information (e.g., postal and email address and telephone number), date of birth, government-issued identification numbers (e.g., Social Security, passport, and driver's license numbers),\nfinancial account information (e.g., bank account number),\nhealth information (e.g., workers' compensation information and medical information contained in employment records),\nand employment-related information.\nAlthough the company has yet to name the cybercrime group behind the breach, the INC Ransom ransomware group added Ahold Delhaize to its dark web extortion portal in April, leaking samples of documents allegedly stolen from the company's compromised systems.\nAhold Delhaize on INC Ransom's leak site (BleepingComputer)\nAhold Delhaize\ntold BleepingComputer\nin April that attackers had stolen data from its U.S. business systems but didn't comment on whether the ransomware gang was involved in the breach.\nToday, an Ahold Delhaize spokesperson once again refused to comment when asked to confirm that INC Ransom was behind the attack, if any systems were encrypted during the attack, and whether the company had been in contact with the attackers about paying a ransom.\n\"It’s important to note that based on our investigation, we have no indication that customer payment or pharmacy systems were compromised in connection with the issue, and the company identified no customer credit card numbers contained in the affected files. Beyond this, we are not providing any additional details on the systems affected,\" BleepingComputer was told.\n​INC Ransom is a ransomware-as-a-service (RaaS) operation that surfaced in July 2023 and has since targeted organizations in both the public and private sectors.\nIts list of more than 250 victims claimed over the last two years includes government, healthcare, educational, and industrial entities, such as Scotland's\nNational Health Service\n(NHS),\nYamaha Motor Philippines\n, and the U.S. division of\nXerox Business Solutions\n(XBS).\nIn April, the ransomware gang also claimed responsibility for an attack on the\nState Bar of Texas,\nwhich later warned over 100,000 members that hackers had stolen their sensitive data.\nINC Ransom has recently shifted its focus to organizations in the United States, with one of its members, tracked by Microsoft as '\nVanilla Tempest\n,' specifically targeting U.S. healthcare providers.\nUpdate June 27, 13:32 EDT: Added Ahold Delhaize statement.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMedia giant Lee Enterprises says data breach affects 39,000 people\nM&S says customer data stolen in cyberattack, forces password resets\nMcLaren Health Care says data breach impacts 743,000 patients\nOxford City Council suffers breach exposing two decades of data\nKrispy Kreme says November data breach impacts over 160,000 people"
    },
    {
        "Title": "Windows 11 KB5060829 update released with 38 new changes, fixes",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5060829-update-released-with-38-new-changes-fixes/",
        "Summary": "​​Microsoft has released the KB5060829 preview cumulative update for Windows 11 24H2, which includes 38 changes, including improvements to the taskbar and a new PC-to-PC migration experience. [...]",
        "Date": "2025-06-27",
        "Content": "​​Microsoft has released the KB5060829 preview cumulative update for Windows 11 24H2, which includes 38 changes, including improvements to the taskbar and a new PC-to-PC migration experience.\nThe\nKB5060829\nupdate is an\noptional non-security preview update\nthat delivers updates at the end of each month, allowing Windows admins to test bug fixes, improvements, and new features that will roll out to all users during next month's Patch Tuesday release.\nHowever, unlike regular Patch Tuesday cumulative updates, monthly preview updates like this one do not include security updates.\nWith KB5060829, Microsoft begins rolling out a PC-to-PC migration experience, which enables Windows users to transfer their files and settings from old computers to new ones during the setup process.\nWhile support for this feature during PC setup is not yet available, it will be introduced with a future update as part of a phased rollout.\nRedmond has also tweaked the taskbar to fit more app icons when space is limited, a new setting that can be adjusted from Taskbar settings > Taskbar behaviors > Show smaller taskbar buttons.\nYou can install KB5060829 by opening\nSettings\n, clicking on\nWindows Update,\nand then on\n'Check for Updates\n.' Since this is an optional update, you will be prompted to install it by clicking the 'Download and install' link.\nYou can also manually download and install this preview update from the\nMicrosoft Update Catalog\n.\nKB5060829 preview update (BleepingComputer)\nWindows 11 KB5060829 highlights\nOnce installed, this optional non-security preview update will update Windows 11 24H2 systems to build 26100.4484.\nThe June 2025 preview update comes with further fixes and improvements, some of the more important ones highlighted below:\n[Scripting]\nFixed: Running a script on a remote Server Message Block (SMB) share may take an unexpectedly long time if the share is hosted on an older Windows Server version, such as Windows Server 2019.\nFixed: When you press\nALT\n+\nTab\nto switch out of a full-screen game, other windows, like Windows Terminal, might stop responding.\nFixed: Explorer.exe might stop working unexpectedly when a window is dragged if window snapping is enabled.\n[Windows Hello]\nFixed: This update addresses an issue that prevented the automatic renewal of expiring certificates in Windows Hello for Business.\n[Storage optimization]\nFixed: An issue that prevented unused language packs and Feature on Demand packages from being entirely removed, which led to unnecessary storage use and longer Windows Update installation times.\nFixed: Windows Search responds very slowly—Search can take over 10 seconds to load before you can use it.\nMicrosoft states that the June 2025 KB5060829 preview update is affected by a single known issue, which causes CJK (Chinese, Japanese, Korean) text to appear blurry or unclear when displayed at 96 DPI (100% scaling) in Chromium-based browsers, such as Google Chrome and Microsoft Edge.\nWindows 11 24H2 is now in broad deployment and is available to all seekers via Windows Update. Microsoft is also rolling out the Windows 11 2024 Update\nto all eligible Windows 10 22H2 PCs\n.\nThe full release notes for the KB5060829 optional update can be found in this\nsupport bulletin\n.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nWindows 11 KB5058499 update rolls out new Share and Click to Do features\nMicrosoft fixes known issue that breaks Windows 11 updates\nWindows 10 KB5061087 update released with 13 changes and fixes\nWindows 11 24H2 emergency update fixes Easy Anti-Cheat BSOD issue\nMicrosoft creates separate Windows 11 24H2 update for incompatible PCs"
    },
    {
        "Title": "Whole Foods supplier UNFI restores core systems after cyberattack",
        "Link": "https://www.bleepingcomputer.com/news/security/whole-foods-supplier-unfi-restores-core-systems-after-cyberattack/",
        "Summary": "American grocery wholesale giant United Natural Foods (UNFI) reports that it has restored its core systems and brought online the electronic ordering and invoicing systems affected by a cyberattack. [...]",
        "Date": "2025-06-27",
        "Content": "American grocery wholesale giant United Natural Foods (UNFI) reports that it has restored its core systems and brought online the electronic ordering and invoicing systems affected by a cyberattack.\nUNFI, which is also a primary distributor for Amazon's Whole Foods,\nsaid\nin a Thursday update that the incident has been contained and that it's now delivering products to stores at \"more normalized levels.\"\nIn a separate\n8-K filing\nwith the U.S. Securities and Exchange Commission, the grocery distributor said it believes the incident is also \"reasonably likely\" to have a material impact on its net income/(loss) and adjusted EBITDA for the year's fourth fiscal quarter of 2025.\n\"In the weeks following the incident, the Company experienced reduced sales volume and increased operational costs as the Company worked to drive solutions-oriented results for its customers. The Company has also incurred, and expects to continue to incur, direct expenses related to the investigation and remediation of the incident,\" UNFI said.\n\"The Company holds cybersecurity insurance that it currently expects will be adequate for the incident, and expects that the full claim and settlement process will extend into its 2026 fiscal year.\"\nUNFI\ndisclosed\nearlier this month that a June 5 cyberattack impacted customer orders and caused temporary disruptions to business operations after it forced it to take some systems offline. The incident was disclosed following\nwidespread\nreports\non\nsocial media\nthat the company's systems had been down, and employees were having their shifts canceled.\nSince the breach was discovered, UNFI has also hired external cybersecurity experts to investigate the incident and notified relevant law enforcement authorities.\nUNFI has not yet disclosed the nature of the attack or whether any ransomware group has claimed responsibility for the breach. However, it told the SEC on Thursday that it \"does not anticipate sending any notifications to individual consumers\" since the incident \"did not involve a breach of security of personal information or protected health information.\"\nThe Rhode Island-based company reported $31 billion in annual revenue in August 2024. With over 28,000 employees, more than 11,000 suppliers, and 53 distribution centers, it delivers fresh and frozen products to over 30,000 locations in the U.S. and Canada, including supermarket chains, e-commerce providers, and independent retailers.\nUNFI is the latest food industry company to face a data breach. In March, Sam's Club, owned by Walmart, announced it was\ninvestigating\na ransomware breach linked to the Clop ransomware gang. JBS Foods, the world's largest beef producer, also\npaid an $11 million ransom\nin 2021 after\nREvil ransomware\nshut down production at\nmultiple sites worldwide\n.\nMore recently, the\nScattered Spider\nthreat actors and the\nDragonForce ransomware\noperation have\ntargeted UK retailers\n, such as\nHarrods\n,\nCo-op\n, and\nMarks & Spencer\n, and are now shifting their focus to U.S.\nretailers\nand\ninsurance companies\n.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nGrocery wholesale giant United Natural Foods hit by cyberattack\nSteel giant Nucor confirms hackers stole data in recent breach\nKettering Health confirms Interlock ransomware behind cyberattack\nSteel giant Nucor Corporation facing disruptions after cyberattack\nHawaiian Airlines discloses cyberattack, flights not affected"
    },
    {
        "Title": "Hawaiian Airlines discloses cyberattack, flights not affected",
        "Link": "https://www.bleepingcomputer.com/news/security/hawaiian-airlines-discloses-cyberattack-flights-not-affected/",
        "Summary": "Hawaiian Airlines, the tenth-largest commercial airline in the United States, is investigating a cyberattack that has disrupted access to some of its systems. [...]",
        "Date": "2025-06-27",
        "Content": "Hawaiian Airlines, the tenth-largest commercial airline in the United States, is investigating a cyberattack that has disrupted access to some of its systems.\nWith over 7,000 employees, 235 average daily flights, and a fleet of over 60 airplanes, Hawaiian Airlines connects Hawai'i with 15 U.S. mainland cities and 10 other destinations across Asia and the Pacific.\nThe airline stated in a statement issued on Thursday morning that the incident didn't affect flight safety and has already contacted relevant authorities to assist in investigating the attack.\nHawaiian Airlines also hired external cybersecurity experts to asses the attack's impact and help restore affected systems.\n\"Hawaiian Airlines is addressing a cybersecurity event that has affected some of our IT systems. Our highest priority is the safety and security of our guests and employees. We have taken steps to safeguard our operations, and our flights are operating safely and as scheduled,\" the airline\nsaid\n.\n\"Upon learning of this incident, we engaged the appropriate authorities and experts to assist in our investigation and remediation efforts. We are currently working toward an orderly restoration and will provide updates as more information is available.\"\nA banner on the airline's website notes that the incident hasn't impacted flights in any way and that travel hasn't been affected.\nThe same alert is also displayed on the Alaska Airlines website, which is owned by Alaska Air Group, a company that\nacquired\nHawaiian Airlines last year.\nHawaiian Airlines website (BleepingComputer)\n​\"There has been no impact on safety, and the airline continues to operate safely. We are monitoring the situation,\" the Federal Aviation Administration told\nReuters\nin a statement.\nCurrently, it is unclear whether Hawaiian Airlines' systems were affected by a ransomware attack that encrypted them or if they were shut down to contain a breach.\nThe airline has yet to disclose the nature of the attack, and no ransomware operations have claimed responsibility for the incident.\nA Hawaiian Airlines spokesperson was not immediately available for comment when contacted by BleepingComputer earlier today.\nThis incident\nfollows a similar attack\nthat affected WestJet, Canada's second-largest airline, on June 13, which prevented customers from accessing the airline's mobile app and website.\nWestJet is also collaborating with third-party forensic experts to investigate the cyberattack and has engaged with law enforcement to fulfill its regulatory obligations.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nUS Homeland Security warns of escalating Iranian cyberattack risks\nHackers switch to targeting U.S. insurance companies\nWestJet investigates cyberattack disrupting internal systems\nGrocery wholesale giant United Natural Foods hit by cyberattack\nHackers behind UK retail attacks now targeting US companies"
    },
    {
        "Title": "Top Apple, Google VPN Apps May Help China Spy on Users",
        "Link": "https://www.darkreading.com/cloud-security/apple-google-vpn-apps-china-spy-users",
        "Summary": "Apple and Google espouse strong values about data privacy, but they allow programs from a Big Brother state to thrive on their app stores, researchers allege.",
        "Date": "2025-06-27",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/apple-google-vpn-apps-china-spy-users"
    },
    {
        "Title": "'CitrixBleed 2' Shows Signs of Active Exploitation",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/citrixbleed-2-active-exploitation",
        "Summary": "If exploited, the critical vulnerability allows attackers to maintain access for longer periods of time than the original CitrixBleed flaw, all while remaining undetected.",
        "Date": "2025-06-27",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/citrixbleed-2-active-exploitation"
    },
    {
        "Title": "Scattered Spider Taps CFO Credentials in 'Scorched Earth' Attack",
        "Link": "https://www.darkreading.com/cloud-security/scattered-spider-cfo-scorched-earth-attack",
        "Summary": "In a recent intrusion, the notorious cybercriminal collective accessed CyberArk vaults and obtained more 1,400 secrets, subverted Azure, VMware, and Snowflake environments, and for the first known time, actively fought back against incident response teams.",
        "Date": "2025-06-27",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/scattered-spider-cfo-scorched-earth-attack"
    },
    {
        "Title": "Hackers Make Hay? Smart Tractors Vulnerable to Full Takeover",
        "Link": "https://www.darkreading.com/cloud-security/hackers-hay-smart-tractors-vulnerable-takeover",
        "Summary": "Hackers can spy on tens of thousands of connected tractors in the latest IoT threat, and brick them too, thanks to poor security in an aftermarket steering system.",
        "Date": "2025-06-27",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/hackers-hay-smart-tractors-vulnerable-takeover"
    },
    {
        "Title": "Vulnerability Debt: How Do You Put a Price on What to Fix?",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/vulnerability-debt-fix-price",
        "Summary": "Putting a vulnerability debt figure together involves work, but having vulnerability debt figures lets you measure real-world values against your overall security posture.",
        "Date": "2025-06-27",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/vulnerability-debt-fix-price"
    },
    {
        "Title": "US Falling Behind China in Exploit Production",
        "Link": "https://www.darkreading.com/cyber-risk/us-falling-behind-china-exploit-production",
        "Summary": "Cyber operations have become critical to national security, but the United States has fallen behind in one significant area — exploit production — while China has built up a significant lead.",
        "Date": "2025-06-27",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/us-falling-behind-china-exploit-production"
    },
    {
        "Title": "'Cyber Fattah' Hacktivist Group Leaks Saudi Games Data",
        "Link": "https://www.darkreading.com/threat-intelligence/cyber-fattah-hacktivist-leaks-saudi-games-data",
        "Summary": "As tensions in the Middle East rise, hacktivist groups are coming out of the woodwork with their own agendas, leading to notable shifts in the hacktivist threat landscape.",
        "Date": "2025-06-27",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/cyber-fattah-hacktivist-leaks-saudi-games-data"
    },
    {
        "Title": "Windows’ Infamous ‘Blue Screen of Death’ Will Soon Turn Black",
        "Link": "https://www.securityweek.com/windows-infamous-blue-screen-of-death-will-soon-turn-black/",
        "Summary": "<p>After more than 40 years of being set against a very recognizable blue, the updated error message will soon be displayed across a black background.</p>\n<p>The post <a href=\"https://www.securityweek.com/windows-infamous-blue-screen-of-death-will-soon-turn-black/\">Windows’ Infamous ‘Blue Screen of Death’ Will Soon Turn Black</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-27",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/windows-infamous-blue-screen-of-death-will-soon-turn-black/"
    },
    {
        "Title": "In Other News: Norway Dam Hacked, $177M Data Breach Settlement, UNFI Attack Update",
        "Link": "https://www.securityweek.com/in-other-news-norway-dam-hacked-177m-data-breach-settlement-unfi-attack-update/",
        "Summary": "<p>Noteworthy stories that might have slipped under the radar: Norwegian dam hacked, AT&#038;T agrees to $177 million data breach settlement, Whole Foods distributor restores systems after attack. </p>\n<p>The post <a href=\"https://www.securityweek.com/in-other-news-norway-dam-hacked-177m-data-breach-settlement-unfi-attack-update/\">In Other News: Norway Dam Hacked, $177M Data Breach Settlement, UNFI Attack Update</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-27",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/in-other-news-norway-dam-hacked-177m-data-breach-settlement-unfi-attack-update/"
    },
    {
        "Title": "Microsoft to Preview New Windows Endpoint Security Platform After CrowdStrike Outage",
        "Link": "https://www.securityweek.com/microsoft-to-preview-new-windows-endpoint-security-platform-after-crowdstrike-outage/",
        "Summary": "<p>Microsoft is preparing a private preview of new Windows endpoint security platform capabilities to help antimalware vendors create solutions that run outside the kernel.</p>\n<p>The post <a href=\"https://www.securityweek.com/microsoft-to-preview-new-windows-endpoint-security-platform-after-crowdstrike-outage/\">Microsoft to Preview New Windows Endpoint Security Platform After CrowdStrike Outage </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-27",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/microsoft-to-preview-new-windows-endpoint-security-platform-after-crowdstrike-outage/"
    },
    {
        "Title": "RevEng.ai Raises $4.15 Million to Secure Software Supply Chain",
        "Link": "https://www.securityweek.com/reveng-ai-raises-4-15-million-to-secure-software-supply-chain/",
        "Summary": "<p>RevEng.ai has raised $4.15 million in seed funding for an AI platform that automatically detects malicious code and vulnerabilities in software.</p>\n<p>The post <a href=\"https://www.securityweek.com/reveng-ai-raises-4-15-million-to-secure-software-supply-chain/\">RevEng.ai Raises $4.15 Million to Secure Software Supply Chain</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-27",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/reveng-ai-raises-4-15-million-to-secure-software-supply-chain/"
    },
    {
        "Title": "Chinese Hackers Target Chinese Users With RAT, Rootkit",
        "Link": "https://www.securityweek.com/chinese-hackers-target-chinese-users-with-rat-rootkit/",
        "Summary": "<p>China-linked Silver Fox hacking group is targeting Chinese users with fake installers carrying a RAT and a rootkit.</p>\n<p>The post <a href=\"https://www.securityweek.com/chinese-hackers-target-chinese-users-with-rat-rootkit/\">Chinese Hackers Target Chinese Users With RAT, Rootkit</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-27",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chinese-hackers-target-chinese-users-with-rat-rootkit/"
    },
    {
        "Title": "Evidence Suggests Exploitation of CitrixBleed 2 Vulnerability",
        "Link": "https://www.securityweek.com/evidence-suggests-exploitation-of-citrixbleed-2-vulnerability/",
        "Summary": "<p>The Citrix NetScaler vulnerability tracked as CitrixBleed 2 and CVE-2025–5777 may be exploited in the wild for initial access.</p>\n<p>The post <a href=\"https://www.securityweek.com/evidence-suggests-exploitation-of-citrixbleed-2-vulnerability/\">Evidence Suggests Exploitation of CitrixBleed 2 Vulnerability</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-27",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/evidence-suggests-exploitation-of-citrixbleed-2-vulnerability/"
    },
    {
        "Title": "Vulnerability Exposed All Open VSX Repositories to Takeover",
        "Link": "https://www.securityweek.com/vulnerability-exposed-all-open-vsx-repositories-to-takeover/",
        "Summary": "<p>A vulnerability in the extension publishing mechanism of Open VSX could have allowed attackers to tamper with any repository.</p>\n<p>The post <a href=\"https://www.securityweek.com/vulnerability-exposed-all-open-vsx-repositories-to-takeover/\">Vulnerability Exposed All Open VSX Repositories to Takeover</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-27",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/vulnerability-exposed-all-open-vsx-repositories-to-takeover/"
    },
    {
        "Title": "Microsoft 365 Direct Send Abused for Phishing",
        "Link": "https://www.securityweek.com/microsoft-365-direct-send-abused-for-phishing/",
        "Summary": "<p>Hackers are abusing the Microsoft 365 Direct Send feature to deliver phishing emails that bypass email security controls.</p>\n<p>The post <a href=\"https://www.securityweek.com/microsoft-365-direct-send-abused-for-phishing/\">Microsoft 365 Direct Send Abused for Phishing</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-27",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/microsoft-365-direct-send-abused-for-phishing/"
    },
    {
        "Title": "Nigerian Crypto Exchange Dtunes.ng Allegedly Breached – User Database For Sale",
        "Link": "https://dailydarkweb.net/nigerian-crypto-exchange-dtunes-ng-allegedly-breached-user-database-for-sale/",
        "Summary": "A significant data breach has allegedly hit Dtunes.ng, a Nigerian platform where users trade gift cards and cryptocurrency for cash. A threat actor posted on a dark web forum claiming to have gained access to and be selling the entire user database of the financial technology company. This alleged incident puts the sensitive information of [&#8230;]",
        "Date": "2025-06-27",
        "Content": "A significant data breach has allegedly hit Dtunes.ng, a Nigerian platform where users trade gift cards and cryptocurrency for cash. A threat actor posted on a dark web forum claiming to have gained access to and be selling the entire user database of the financial technology company. This alleged incident puts the sensitive information of the platform’s customers at considerable risk.\nThe cybercriminal provided a sample of the data to prove their claim, which suggests a major compromise of user privacy. The sale of the full database could lead to a wave of phishing attacks, identity theft, and other malicious activities targeting Dtunes.ng users. The data allegedly leaked includes:\nUser IDs\nUsernames\nEmail Addresses\nRegistration dates and times\nThe threat actor is demanding payment exclusively in Monero (XMR), a cryptocurrency known for its privacy features, and is using an escrow service to facilitate the sale. This incident underscores the persistent threats facing the digital currency exchange industry, where platforms are frequent targets for cyberattacks due to the valuable financial and personal data they hold.\nTags:\nallegedly\ncrypto exchange\nCyberSecurity\ndark web\ndata-breach\nDtunes.ng\nNigeria"
    },
    {
        "Title": "Qilin Ransomware Attack Allegedly Results in Patient’s Death",
        "Link": "https://dailydarkweb.net/qilin-ransomware-attack-allegedly-results-in-patients-death/",
        "Summary": "A patient&#8217;s death has been officially linked to the June 2024 ransomware attack on Synnovis, a critical pathology services provider for several major NHS hospitals in London. King&#8217;s College Hospital NHS Foundation Trust confirmed that a patient safety investigation identified a long wait for a blood test result, a direct consequence of the cyberattack, as [&#8230;]",
        "Date": "2025-06-27",
        "Content": "A patient’s death has been officially linked to the June 2024 ransomware attack on Synnovis, a critical pathology services provider for several major NHS hospitals in London. King’s College Hospital NHS Foundation Trust confirmed that a patient safety investigation identified a long wait for a blood test result, a direct consequence of the cyberattack, as a contributing factor in the patient’s death. The attack is allegedly the work of the Russian-speaking ransomware syndicate Qilin, which crippled essential diagnostic services, including blood testing, across multiple London hospital trusts.\nThe disruption created a systemic crisis, forcing the cancellation of over 10,000 outpatient appointments and more than 1,700 elective procedures at just two of the affected trusts. The inability to conduct normal blood matching led to a reliance on universal O-type blood, triggering a national shortage and urgent appeals for donors. This incident marks a grim milestone, representing the first time a UK health authority has formally acknowledged a direct link between a cyberattack’s operational impact and a patient fatality, moving the threat from theoretical to tragically real.\nIn addition to the clinical paralysis, the Qilin group allegedly exfiltrated nearly 400GB of sensitive data after Synnovis refused to pay a reported $50 million ransom. The attackers subsequently published the stolen information on the darknet, exposing highly personal medical and financial records. The leaked data allegedly included:\nPatient names, dates of birth, and NHS numbers\nDescriptions of blood tests and sensitive pathology results\nInternal financial spreadsheets detailing hospital transactions\nThe attack has exposed the profound vulnerability of the healthcare sector’s reliance on third-party suppliers and has ignited urgent calls for reform. In response, NHS England has urged all vendors to adopt a new cybersecurity charter promoting fundamental security controls such as multi-factor authentication and consistent system patching. The event serves as a harrowing confirmation of what experts have long warned: cyberattacks on critical infrastructure are no longer just a matter of data and finance, but of life and death.\nTags:\nCritical Infrastructure\nCyberSecurity\ndata-breach\nHealthcare\nNHS\npatient safety\nQilin\nransomware\nSynnovis"
    },
    {
        "Title": "Audio Geeks Allegedly Breached",
        "Link": "https://dailydarkweb.net/audio-geeks-allegedly-breached/",
        "Summary": "A threat actor has allegedly leaked a 2 GB database belonging to Audio Geeks, an American company specializing in audio equipment and solutions. The firm, which serves a wide range of clients from individual consumers to corporate entities, is now at the center of a significant data breach claim. The incident came to light after [&#8230;]",
        "Date": "2025-06-27",
        "Content": "A threat actor has allegedly leaked a 2 GB database belonging to Audio Geeks, an American company specializing in audio equipment and solutions. The firm, which serves a wide range of clients from individual consumers to corporate entities, is now at the center of a significant data breach claim. The incident came to light after a post on a dark web forum advertised the sensitive information, exposing the personal details of what appears to be the company’s customer base.\nThe origin of the breach is currently attributed to the individual who published the data on the forum. The leaked database allegedly contains a variety of personally identifiable information. The consequences of such a leak could be severe, potentially exposing affected individuals to phishing scams, identity theft, and other forms of cybercrime. The data was posted publicly, making it accessible to other malicious actors.\nThe compromised information allegedly includes:\nNames\nEmail addresses\nTelephone numbers\nTags:\nAudio Geeks\ncyber-attack\nCyberSecurity\ndata-breach\ndata-leak\nPII"
    },
    {
        "Title": "Ukrainian Internet Provider “Express” Allegedly Breached",
        "Link": "https://dailydarkweb.net/ukrainian-internet-provider-express-allegedly-breached/",
        "Summary": "Ukrainian internet service provider &#8220;Express&#8221; (express.net.ua) has allegedly become the victim of a significant data breach. A threat actor has posted a database containing what is claimed to be sensitive information of nearly 390,000 users for sale on a dark web forum. Express is a regional telecommunications company that provides home and business internet services [&#8230;]",
        "Date": "2025-06-27",
        "Content": "Ukrainian internet service provider “Express” (express.net.ua) has allegedly become the victim of a significant data breach. A threat actor has posted a database containing what is claimed to be sensitive information of nearly 390,000 users for sale on a dark web forum. Express is a regional telecommunications company that provides home and business internet services across various parts of Ukraine, including the Zaporizhzhia region. The breach could impact a substantial number of the company’s customers, exposing their personal and financial information.\nThe threat actor claims the dump contains a total of 388,607 lines of user, payment, and operational data extracted from the company’s servers. The sale post details multiple CSV files, suggesting a comprehensive exfiltration of the provider’s records. Samples of the data appear to corroborate the claims, revealing a wide range of sensitive information.\nThe allegedly leaked data includes:\nUser Information:\nFull names, passwords, phone numbers, and internal account details.\nPayment and Financial Data:\nDetailed payment records from various services, including transaction IDs and, in some cases, customer names and addresses embedded in XML data.\nService Requests and Memos:\nCustomer service requests which include user addresses, connection and disconnection dates, and internal staff comments.\nNew User Applications:\nInformation from new user applications containing names, phone numbers, and street addresses.\nAdministrative Data:\nThe actor also claims to have admin logins and password hashes.\nTags:\nCyberSecurity\ndata-breach\ndatabase\nExpress\nISP\nleaked data\nPrivacy\nUkraine"
    },
    {
        "Title": "Qilin Ransomware Allegedly Hits Spanish City of Melilla and Fijian Giant Tappoo Group",
        "Link": "https://dailydarkweb.net/qilin-ransomware-allegedly-hits-spanish-city-of-melilla-and-fijian-giant-tappoo-group/",
        "Summary": "The Qilin ransomware group has allegedly targeted two major entities, the government of the autonomous Spanish city of Melilla and the prominent Fijian conglomerate, Tappoo Group of Companies. In a bold claim, the threat actors announced they have exfiltrated massive amounts of sensitive data and caused significant operational damage. The City of Melilla is a [&#8230;]",
        "Date": "2025-06-27",
        "Content": "The Qilin ransomware group has allegedly targeted two major entities, the government of the autonomous Spanish city of Melilla and the prominent Fijian conglomerate, Tappoo Group of Companies. In a bold claim, the threat actors announced they have exfiltrated massive amounts of sensitive data and caused significant operational damage. The City of Melilla is a Spanish autonomous city located on the north coast of Africa and is a significant administrative and cultural hub. The Tappoo Group of Companies is one of Fiji’s largest and most respected business houses, with extensive operations in retail, distribution, and manufacturing, making it a cornerstone of the nation’s economy.\nAccording to the claims, the attack on Melilla was particularly severe, with the perpetrators alleging they have not only stolen 4-5 terabytes of data but also completely destroyed the city’s administrative and network infrastructure. The threat actors boast of possessing a nearly complete list of personal data for all of Melilla’s inhabitants, as well as sensitive information on tourists. Furthermore, they claim to hold compromising information regarding the “corrupt” use of funds by high-ranking individuals. In a separate attack, the Tappoo Group was also listed as a victim, with evidence suggesting the theft of highly sensitive internal financial documents.\nThe data allegedly stolen from both organizations is extensive and highly sensitive. For the City of Melilla, the leak purportedly includes personal identification documents and detailed citizen information. For the Tappoo Group, the breach appears to involve confidential financial records. The attackers have published sample data, including a citizen’s application form from Melilla and internal balance sheets from the Tappoo Group, to substantiate their claims.\nAllegedly Leaked Data Includes:\nPersonal Identifiable Information (PII) of Melilla residents and tourists\nInternal financial documents, including balance sheets\nComplete administrative and network infrastructure data\nInformation concerning the alleged inappropriate use of funds\nCitizen and government application forms\nTags:\ncyberattack\ndata-breach\nFiji\ngovernment\nMelilla\nQilin\nransomware\nSpain\nTappoo Group"
    },
    {
        "Title": "Akira Ransomware Allegedly Breaches MultiStone, Imblum Law Offices, and Martin Showers Smith & McDonald",
        "Link": "https://dailydarkweb.net/akira-ransomware-allegedly-breaches-multistone-imblum-law-offices-and-martin-showers-smith-mcdonald/",
        "Summary": "The Akira ransomware group has claimed responsibility for cyberattacks on three U.S. companies, threatening to publish gigabytes of sensitive information. The victims, listed on the gang&#8217;s dark web leak site, include two law firms and a leading stone fabricator. The targeted companies are Imblum Law Offices, a Pennsylvania-based firm specializing in bankruptcy cases; Martin, Showers, [&#8230;]",
        "Date": "2025-06-27",
        "Content": "The Akira ransomware group has claimed responsibility for cyberattacks on three U.S. companies, threatening to publish gigabytes of sensitive information. The victims, listed on the gang’s dark web leak site, include two law firms and a leading stone fabricator. The targeted companies are Imblum Law Offices, a Pennsylvania-based firm specializing in bankruptcy cases; Martin, Showers, Smith & McDonald, LLC, a Texas law firm handling civil litigation and personal injury; and MultiStone, a major fabricator and installer of stone countertops in the Low Country region.\nThe cybercriminal group alleges to have exfiltrated a significant trove of data from each victim, posing a severe risk to the privacy of their clients and employees. The impact on the two law firms is particularly concerning due to the highly confidential nature of legal and personal documents. The attackers claim to be in possession of extensive personally identifiable information (PII) and privileged records. This incident highlights the persistent threat ransomware poses to various sectors, with legal and manufacturing industries proving to be lucrative targets for their sensitive data.\nThe ransomware operators have detailed the types of data they allegedly stole. For Imblum Law Offices and Martin, Showers, Smith & McDonald, the data includes a vast amount of client and employee records. The data allegedly exfiltrated from the victims includes:\nFrom MultiStone (over 8 GB):\nEmployee documents\nFinancial data\nNumerous projects\nConfidentiality agreements\nFrom Imblum Law Offices (over 20 GB):\nClient personal documents (passports, SSNs, death/birth certificates, financial information)\nCourt hearings and protocols\nEmployee information\nOther confidential documents\nFrom Martin, Showers, Smith & McDonald, LLC (over 8 GB):\nScans of client personal documents (passports, SSNs, death/birth certificates, driver’s licenses)\nEmployee information\nConfidential documents\nCourt reports\nTags:\nAkira\ncyberattack\nCyberSecurity\ndata-breach\nImblum Law Offices\nlaw firm\nManufacturing\nMartin Showers Smith & McDonald\nMultiStone\nransomware"
    },
    {
        "Title": "Morocco Clinic System Patient Data Allegedly Leaked Online",
        "Link": "https://dailydarkweb.net/morocco-clinic-system-patient-data-allegedly-leaked-online/",
        "Summary": "A significant data breach has allegedly exposed the sensitive records of 56,000 patients from a clinic system in Morocco. The compromised database, containing records spanning from 2020 to 2025, was posted online by a threat actor. The origin of the breach is currently under investigation, but the incident highlights a major cybersecurity failure within the [&#8230;]",
        "Date": "2025-06-27",
        "Content": "A significant data breach has allegedly exposed the sensitive records of 56,000 patients from a clinic system in Morocco. The compromised database, containing records spanning from 2020 to 2025, was posted online by a threat actor. The origin of the breach is currently under investigation, but the incident highlights a major cybersecurity failure within the nation’s healthcare sector, putting thousands of individuals at risk of identity theft and other malicious activities.\nThe leaked data is extensive and highly sensitive, painting a detailed picture of patients’ medical histories and personal information. The exposure of such confidential data is a severe violation of privacy and could have long-lasting consequences for the individuals affected. This incident underscores the critical importance for healthcare organizations to implement robust cybersecurity measures to protect the valuable and private information they are entrusted with.\nThe allegedly leaked data includes the following:\nPatient ID, name, birth date, and gender\nExamination and physician codes\nDossier numbers and center details\nCreation date and time of records\nDictated medical notes and prescribing physician\nPatient age and examination descriptions\nRadiologist and validating physician details\nStudy instance identifiers\nTags:\nCyberSecurity\ndata-breach\ndata-leak\nHealthcare\nMorocco\npatient records"
    },
    {
        "Title": "RuskiNet Group Allegedly Breaches Har Hevron Regional Council, Neot Hovav, Haruv Institute, ITIM, and Moti",
        "Link": "https://dailydarkweb.net/ruskinet-group-allegedly-breaches-har-hevron-regional-council-neot-hovav-haruv-institute-itim-and-moti/",
        "Summary": "A hacktivist collective identified as the RuskiNet Group has allegedly claimed responsibility for a data breach impacting five Israeli organizations. The group announced the breach on a dark web forum, releasing what they claim to be sensitive data extracted from the websites of these entities. The targeted organizations allegedly include: the Har Hevron (Mount Hebron) [&#8230;]",
        "Date": "2025-06-27",
        "Content": "A hacktivist collective identified as the RuskiNet Group has allegedly claimed responsibility for a data breach impacting five Israeli organizations. The group announced the breach on a dark web forum, releasing what they claim to be sensitive data extracted from the websites of these entities. The targeted organizations allegedly include: the\nHar Hevron (Mount Hebron) Regional Council\n, a local government body; the\nNeot Hovav industrial council\n, a major economic and industrial hub;\nThe Haruv Institute\n, a leading center for research and training on child abuse;\nITIM\n, a non-profit that assists individuals in navigating Israeli religious bureaucracy; and the website\nmoti.org.il\n.\nThe motivation behind the attack appears to be political, fitting the pattern of hacktivist operations that have escalated in the region. The compromised data allegedly contains a wide range of personally identifiable information. The RuskiNet Group claims to have exfiltrated data that includes:\nFull Names\nMobile Numbers\nPersonal Email Addresses\nCity and Residential Addresses\nProfessional Positions\nNames of Judges\nFacebook Profiles\nThe public release of such sensitive information on the dark web poses a significant risk to the individuals whose data has been exposed, potentially leading to identity theft, phishing attacks, and other forms of online harassment. The inclusion of data related to judges and details from an institute dealing with vulnerable children raises particular concerns. This incident highlights the growing trend of hacktivist groups targeting a broad range of organizations to maximize disruption and amplify their political messaging.\nTags:\nCyberSecurity\ndata-breach\ngovernment\nhacktivism\nIsrael\nnon-profit\nRuskiNet Group"
    },
    {
        "Title": "Australian Financial Software Provider DataSafeApps Allegedly Suffers Full Source Code Leak",
        "Link": "https://dailydarkweb.net/australian-financial-software-provider-datasafeapps-allegedly-suffers-full-source-code-leak/",
        "Summary": "DataSafe Applications Pty Ltd, an Australian company that provides a comprehensive, one-stop software solution for the financial services and lending industry, has allegedly become the victim of a significant data breach. An actor on a hacking forum has claimed to have leaked the complete source code for the company&#8217;s platform, DataSafeApps.com.au. The company, which offers [&#8230;]",
        "Date": "2025-06-27",
        "Content": "DataSafe Applications Pty Ltd, an Australian company that provides a comprehensive, one-stop software solution for the financial services and lending industry, has allegedly become the victim of a significant data breach. An actor on a hacking forum has claimed to have leaked the complete source code for the company’s platform, DataSafeApps.com.au. The company, which offers services like a fully-integrated Loan Management System (LMS), secure document signing, and client tracking, is a critical vendor for lenders, brokers, and law firms, primarily in Australia.\nThe alleged breach could have severe implications for DataSafeApps and its clients. The company’s platform is designed to handle highly sensitive financial and personal information, boasting features like blockchain security and end-to-end accounting. The exposure of the full source code could allow malicious actors to analyze the application for critical vulnerabilities, potentially leading to unauthorized access to the sensitive data of the businesses and individuals that rely on their system. The leaked files allegedly include critical components of the application’s infrastructure.\nSome of the allegedly exposed file and data types include:\nLogin and password reset functionalities\nDatabase administration tools (phpmyadmin)\nAPI endpoints\nPDF and Excel generation scripts\nCore application logic and configuration files\nClient-side and server-side scripts\nTags:\naustralia\nCyberSecurity\ndata-breach\nDataSafeApps\nFinancial Services\nhacking\nsource code leak\nTech News"
    },
    {
        "Title": "Zinli Data Breach – Over 100K Users of Popular Venezuelan Digital Wallet Allegedly Exposed",
        "Link": "https://dailydarkweb.net/zinli-data-breach-over-100k-users-of-popular-venezuelan-digital-wallet-allegedly-exposed/",
        "Summary": "A threat actor has allegedly leaked the customer database of Zinli, a digital dollar wallet and Visa prepaid card provider, exposing the sensitive information of more than 100,000 of its Venezuelan users. The data was posted on a notorious dark web forum, where the actor shared a sample of the compromised information, indicating a significant [&#8230;]",
        "Date": "2025-06-27",
        "Content": "A threat actor has allegedly leaked the customer database of Zinli, a digital dollar wallet and Visa prepaid card provider, exposing the sensitive information of more than 100,000 of its Venezuelan users. The data was posted on a notorious dark web forum, where the actor shared a sample of the compromised information, indicating a significant security incident impacting the financial application’s user base.\nZinli operates as a popular financial platform in several Latin American countries, including Venezuela, offering a digital dollar wallet and an international Visa prepaid card. It serves as a crucial tool for many Venezuelans to receive and send dollars, make online purchases, and navigate the country’s complex economic landscape, often acting as an alternative to traditional banking or services like Zelle. The ability to operate in dollars makes it a vital service for users to protect their savings from hyperinflation and transact internationally.\nThe breach purportedly exposes a wide range of personally identifiable information. According to the forum post, the leaked dataset is from June 2025 and contains extensive details on each affected customer. The consequences for users could be severe, potentially leading to identity theft, targeted phishing attacks, and financial fraud.\nThe allegedly leaked data includes:\nFull Name\nEmail Address\nPhone Number\nImage of the Client\nTags:\nCyberSecurity\ndark web\ndata-breach\ndata-leak\nfinancial data\nPII\nvenezuela\nZinli"
    }
]