[
    {
        "Title": "Over 269,000 Websites Infected with JSFireTruck JavaScript Malware in One Month",
        "Link": "https://thehackernews.com/2025/06/over-269000-websites-infected-with.html",
        "Summary": "Cybersecurity researchers are calling attention to a \"large-scale campaign\" that has been observed compromising legitimate websites with malicious JavaScript injections.\nAccording to Palo Alto Networks Unit 42, these malicious injects are obfuscated using JSFuck, which refers to an \"esoteric and educational programming style\" that uses only a limited set of characters to write and execute code.",
        "Date": "2025-06-13",
        "Content": "Cybersecurity researchers are calling attention to a \"large-scale campaign\" that has been observed compromising legitimate websites with malicious JavaScript injections.\nAccording to Palo Alto Networks Unit 42, these malicious injects are obfuscated using\nJSFuck\n, which\nrefers\nto an \"esoteric and educational programming style\" that uses only a limited set of characters to write and execute code.\nThe cybersecurity company has given the technique an alternate name JSFireTruck owing to the profanity involved.\n\"Multiple websites have been identified with injected malicious JavaScript that uses JSFireTruck obfuscation, which is composed primarily of the symbols [, ], +, $, {, and },\" security researchers Hardik Shah, Brad Duncan, and Pranay Kumar Chhaparwal\nsaid\n. \"The code's obfuscation hides its true purpose, hindering analysis.\"\nFurther analysis has determined that the injected code is designed to check the website referrer (\"\ndocument.referrer\n\"), which identifies the address of the web page from which a request originated.\nShould the referrer be a search engine such as Google, Bing, DuckDuckGo, Yahoo!, or AOL, the JavaScript code redirects victims to malicious URLs that can deliver malware, exploits, traffic monetization, and malvertising.\nUnit 42 said its telemetry uncovered 269,552 web pages that have been infected with JavaScript code using the JSFireTruck technique between March 26 and April 25, 2025. A spike in the campaign was first recorded on April 12, when over 50,000 infected web pages were recorded in a single day.\n\"The campaign's scale and stealth pose a significant threat,\" the researchers said. \"The widespread nature of these infections suggests a coordinated effort to compromise legitimate websites as attack vectors for further malicious activities.\"\nSay Hello to HelloTDS\nThe development comes as Gen Digital took the wraps off a sophisticated Traffic Distribution Service (\nTDS\n) called HelloTDS that's designed to conditionally redirect site visitors to fake CAPTCHA pages, tech support scams, fake browser updates, unwanted browser extensions, and cryptocurrency scams through remotely-hosted JavaScript code injected into the sites.\nThe primary objective of the TDS is to act as a gateway, determining the exact nature of content to be delivered to the victims after fingerprinting their devices. If the user is not deemed a suitable target, the victim is redirected to a benign web page.\n\"The campaign entry points are infected or otherwise attacker-controlled streaming websites, file sharing services, as well as malvertising campaigns,\" researchers Vojtěch Krejsa and Milan Špinka\nsaid\nin a report published this month.\n\"Victims are evaluated based on geolocation, IP address, and browser fingerprinting; for example, connections through VPNs or headless browsers are detected and rejected.\"\nSome of these attack chains have been found to serve bogus CAPTCHA pages that leverage the\nClickFix\nstrategy to trick users into running malicious code and infecting their machines with a malware known as\nPEAKLIGHT\n(aka Emmenhtal Loader), which is known to server information stealers like Lumma.\nCentral to the HelloTDS infrastructure is the use of .top, .shop, and .com top-level domains that are used to host the JavaScript code and trigger the redirections following a multi-stage fingerprinting process engineered to collect network and browser information.\n\"The HelloTDS infrastructure behind fake CAPTCHA campaigns demonstrates how attackers continue to refine their methods to bypass traditional protections, evade detection, and selectively target victims,\" the researchers said.\n\"By leveraging sophisticated fingerprinting, dynamic domain infrastructure, and deception tactics (such as mimicking legitimate websites and serving benign content to researchers) these campaigns achieve both stealth and scale.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Ransomware Gangs Exploit Unpatched SimpleHelp Flaws to Target Victims with Double Extortion",
        "Link": "https://thehackernews.com/2025/06/ransomware-gangs-exploit-unpatched.html",
        "Summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Thursday disclosed that ransomware actors are targeting unpatched SimpleHelp Remote Monitoring and Management (RMM) instances to compromise customers of an unnamed utility billing software provider.\n\"This incident reflects a broader pattern of ransomware actors targeting organizations through unpatched versions of SimpleHelp",
        "Date": "2025-06-13",
        "Content": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Thursday disclosed that ransomware actors are targeting unpatched SimpleHelp Remote Monitoring and Management (RMM) instances to compromise customers of an unnamed utility billing software provider.\n\"This incident reflects a broader pattern of ransomware actors targeting organizations through unpatched versions of SimpleHelp RMM since January 2025,\" the agency\nsaid\nin an advisory.\nEarlier this year, SimpleHelp\ndisclosed\na set of flaws (CVE-2024-57727, CVE-2024-57728, and CVE-2024-57726) that could result in information disclosure, privilege escalation, and remote code execution.\nThe vulnerabilities have since come under\nrepeated\nexploitation\nin the wild, including by ransomware groups like DragonForce, to breach targets of interest. Last month, Sophos revealed that a Managed Service Provider's SimpleHelp deployed was accessed by the threat actor using these flaws, and then leveraged it to pivot to other downstream customers.\nCISA said that SimpleHelp versions 5.5.7 and earlier contain multiple vulnerabilities, including CVE-2024-57727, and that the ransomware crews are exploiting it to access downstream customers' unpatched SimpleHelp instances for double extortion attacks.\nThe agency has outlined the below mitigations that organizations, including third-party service providers that make use of SimpleHelp to connect to downstream customers, can implement to better respond to the ransomware activity -\nIdentify and isolate SimpleHelp server instances from the internet and update them to the latest version\nNotify downstream customers and instruct them to take actions to secure their endpoints\nConduct threat hunting actions for indicators of compromise and monitor for unusual inbound and outbound traffic from the SimpleHelp server (for downstream customers)\nDisconnect affected systems from the internet if they have been encrypted by ransomware, reinstall the operating system, and restore data from a clean backup\nMaintain periodic clean, offline backups\nRefrain from exposing remote services such as Remote Desktop Protocol (RDP) on the web\nCISA said it does not encourage victims to pay ransoms as there is no guarantee that the decryptor provided by the threat actors will help recover the files.\n\"Furthermore, payment may also embolden adversaries to target additional organizations, encourage other criminal actors to engage in the distribution of ransomware, and/or fund illicit activities,\" CISA added.\nFog Ransomware Attack Deploys Employee Monitoring Software\nThe development comes as Broadcom-owned Symantec detailed a\nFog\nransomware attack targeting an unnamed financial institution in Asia with a combination of dual-use and open-source pentesting tools not observed in other ransomware-related intrusions.\nFog is a ransomware variant\nfirst detected\nin May 2024. Like other ransomware operations, the financially motivated crew\nemploys\ncompromised virtual private network (VPN) credentials and system vulnerabilities to gain access to an organization's network and encrypt data, but not before exfiltrating it.\nAlternate infection sequences have employed Windows shortcut (LNK) files contained within ZIP archives, which are then distributed via email and phishing attacks. Executing the LNK file leads to the download of a PowerShell script that's responsible for dropping a ransomware loader containing the Fog locker payload.\nThe attacks are also characterized by the use of advanced techniques to escalate privileges and evade detection by deploying malicious code directly in memory and disabling security tools. Fog is capable of targeting both Windows and Linux endpoints.\nAccording to Trend Micro, as of April 2025, the Fog threat actors have claimed\n100 victims\non its data leak site since the start of the year, with a majority of the victims associated with technology, education, manufacturing, and transportation sectors.\n\"The attackers used a legitimate employee monitoring software called\nSyteca\n(formerly Ekran), which is highly unusual,\" Symantec\nsaid\n. \"They also deployed several open-source pen-testing tools – GC2,\nAdaptix\n, and Stowaway – which are not commonly used during ransomware attacks.\"\nWhile the exact initial access vector used in the incident is unknown, the threat actors have been found to use Stowaway, a proxy tool\nwidely used\nby\nChinese hacking groups\n, to deliver Syteca. It's worth noting that GC2 has been\nused in attacks\ncarried out by the Chinese state-sponsored hacking group APT41 in 2023.\nAlso downloaded were legitimate programs like 7-Zip, Freefilesync, and MegaSync to create compressed data archives for data exfiltration.\nAnother interesting aspect of the attacks is that the attackers created a service to establish persistence on the network, several days after the ransomware was deployed. The threat actors are said to have spent about two weeks before dropping the ransomware.\n\"This is an unusual step to see in a ransomware attack, with malicious activity usually ceasing on a network once the attackers have exfiltrated data and deployed the ransomware, but the attackers in this incident appeared to wish to retain access to the victim's network,\" Symantec and Carbon Black researchers said.\nThe uncommon tactics have raised the possibility that the company may have been targeted for espionage reasons, and that the threat actors deployed the Fog ransomware either as a distraction to mask their true goals or to\nmake some quick money on the side\n.\nLockBit Panel Leak Reveals China Among Most Targeted\nThe findings also coincide with revelations that the\nLockBit\nransomware-as-a-service (RaaS) scheme netted around $2.3 million within the last six months, indicating that the e-crime group continues to operate despite several setbacks.\nWhat's more, Trellix's analysis of LockBit's geographic targeting from December 2024 to April 2025 based on the\nMay 2025 admin panel leak\nhas uncovered China to be one of the most heavily targeted countries by affiliates Iofikdis, PiotrBond, and JamesCraig. Other prominent targets include Taiwan, Brazil, and Turkey.\n\"The concentration of attacks in China suggests a significant focus on this market, possibly due to its large industrial base and manufacturing sector,\" security researcher Jambul Tologonov\nsaid\n.\n\"Unlike Black Basta and Conti RaaS groups that occasionally probe Chinese targets without encrypting them, LockBit appears willing to operate within Chinese borders and disregard potential political consequences, marking an interesting divergence in their approach.\"\nThe leak of the affiliate panel has also prompted LockBit to announce a monetary reward for verifiable information about \"xoxo from Prague,\" an anonymous actor who claimed responsibility for the leak.\nOn top of that, LockBit appears to have benefitted from the\nsudden discontinuation of RansomHub\ntowards the end of March 2025, causing some of the latter's affiliates, including BaleyBeach and GuillaumeAtkinson, to transition to LockBit and compel it to reactivate its operations amid ongoing efforts to develop the next version of the ransomware, LockBit 5.0.\n\"What this leak truly shows is the complex and ultimately less glamorous reality of their illicit ransomware activities. While profitable, it's far from the perfectly orchestrated, massively lucrative operation they'd like the world to believe it is,\" Tologonov concluded.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "CTEM is the New SOC: Shifting from Monitoring Alerts to Measuring Risk",
        "Link": "https://thehackernews.com/2025/06/ctem-is-new-soc-shifting-from.html",
        "Summary": "Introduction: Security at a Tipping Point\nSecurity Operations Centers (SOCs) were built for a different era, one defined by perimeter-based thinking, known threats, and manageable alert volumes. But today’s threat landscape doesn’t play by those rules. The sheer volume of telemetry, overlapping tools, and automated alerts has pushed traditional SOCs to the edge. Security teams are overwhelmed,",
        "Date": "2025-06-13",
        "Content": "Introduction: Security at a Tipping Point\nSecurity Operations Centers (SOCs) were built for a different era, one defined by perimeter-based thinking, known threats, and manageable alert volumes. But today's threat landscape doesn't play by those rules. The sheer volume of telemetry, overlapping tools, and automated alerts has pushed traditional SOCs to the edge. Security teams are overwhelmed, chasing indicators that often lead nowhere, while real risks go unnoticed in the noise.\nWe're not dealing with a visibility problem. We're dealing with a relevance problem.\nThat's where\nContinuous Threat Exposure Management\n(CTEM) comes in. Unlike detection-centric operations that react to what's already happened,\nCTEM\nshifts the focus from what could happen to \"why it matters.\" It's a move away from reacting to alerts and toward managing risk with targeted, evidence-based actions.\nThe Problem with Alert-Centric Security\nAt its core, the SOC is a monitoring engine. It digests input from firewalls, endpoints, logs, cloud systems, and more, and then generates alerts based on rules and detections. But this model is outdated and flawed in a modern environment where:\nAttackers stay under the radar by combining small, overlooked vulnerabilities to eventually gain unauthorized access.\nTool overlap creates alert fatigue and conflicting signals.\nSOC analysts burn out trying to sort through and evaluate potential incidents that lack business context.\nThis model treats every alert as a potential emergency. But not every alert deserves equal attention, and many don't deserve attention at all. The consequence is SOCs are pulled in too many directions, with no prioritization, solving for volume instead of value.\nCTEM: From Monitoring to Meaning\nCTEM reimagines security operations as a continuous, exposure-driven approach. Instead of starting with alerts and working backward, CTEM starts by asking:\nWhat are the most critical assets in our environment?\nWhat are the actual paths an attacker could use to reach them?\nWhich exposures are exploitable\nright now?\nHow effective are our defenses against the path?\nCTEM isn't a tool. It's a framework and discipline that continuously maps out potential attack paths, validates security control effectiveness, and prioritizes action based on real-world impact rather than theoretical threat models.\nThis is not about abandoning the SOC. It's about evolving its role from monitoring the past to anticipating and preventing what's next.\nWhy This Shift Matters\nThe rapid escalation of CTEM signals a deeper transformation in how enterprises are approaching their security strategy. CTEM shifts the focus from reactive to dynamic exposure management, reducing risk not just by watching for signs of compromise, but by eliminating the conditions that make compromise possible in the first place.\nThe points below illustrate why CTEM represents not just a better security model, but a smarter, more sustainable one.\n1. Exposure and Exhaustion\nCTEM doesn't try to monitor everything. It identifies what's actually exposed and whether that exposure can lead to harm. This drastically reduces noise while increasing alert accuracy.\n2. Business Context Over Technical Clutter\nSOCs often operate in technical silos, detached from what matters to the business. CTEM injects data-driven risk context into security decisions, and which vulnerabilities are hidden in real attack paths leading to sensitive data, systems or revenue streams.\n3. Prevention Over Reaction\nIn a CTEM model, exposures are mitigated before they're exploited. Rather than racing to respond to alerts after the fact, security teams are focused on closing off attack paths and validating the effectiveness of security controls.\nTogether, these principles reflect why CTEM has become a fundamental change in mindset. By focusing on what's truly exposed, correlating risks directly to business outcomes, and prioritizing prevention, CTEM enables security teams to operate with more clarity, precision, and purpose to help drive measurable impact.\nWhat CTEM Looks Like in Practice\nAn enterprise adopting CTEM may not reduce the number of security tools it uses but it will use them differently. For example:\nExposure insights will guide patching priorities, not CVSS scores.\nAttack path mapping and validation will inform control effectiveness, not generic policy updates.\nValidation exercise – such as automated\npentesting\nor autonomous red teaming – will confirm whether a real attacker could reach valuable data or systems, not just whether control is \"on.\"\nThis core strategic change allows security teams to shift from reactive threat assessment to targeted, data-driven risk reduction where every security activity is connected to potential business impact.\nCTEM and the Future of the SOC\nIn many enterprises, CTEM will sit alongside the SOC, feeding it higher-quality insights and focusing analysts on what actually matters. But in forward-leaning teams, CTEM will become the new SOC, not just operationally but philosophically. A function no longer built around watching but around disrupting. That means:\nThreat detection becomes threat anticipation.\nAlert queues become prioritized risk based on context.\nSuccess is no longer \"we caught the breach in time\" rather it's \"the breach never found a path to begin with.\"\nConclusion: From Volume to Value\nSecurity teams don't need more alerts; they need better questions. They need to know what matters most, what's truly at risk, and what to fix first. CTEM answers those questions. And in doing so, it redefines the very purpose of modern security operations not to respond faster, but to remove the attacker's opportunity altogether.\nIt's time to shift from monitoring everything to measuring what matters. CTEM isn't just an enhancement to the SOC.  It's what the SOC should become.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Apple Zero-Click Flaw in Messages Exploited to Spy on Journalists Using Paragon Spyware",
        "Link": "https://thehackernews.com/2025/06/apple-zero-click-flaw-in-messages.html",
        "Summary": "Apple has disclosed that a now-patched security flaw present in its Messages app was actively exploited in the wild to target civil society members in sophisticated cyber attacks.\nThe vulnerability, tracked as CVE-2025-43200, was addressed on February 10, 2025, as part of iOS 18.3.1, iPadOS 18.3.1, iPadOS 17.7.5, macOS Sequoia 15.3.1, macOS Sonoma 14.7.4, macOS Ventura 13.7.4, watchOS 11.3.1,",
        "Date": "2025-06-13",
        "Content": "Apple has disclosed that a now-patched security flaw present in its Messages app was actively exploited in the wild to target civil society members in sophisticated cyber attacks.\nThe vulnerability, tracked as CVE-2025-43200, was addressed on February 10, 2025, as part of\niOS 18.3.1, iPadOS 18.3.1\n,\niPadOS 17.7.5\n,\nmacOS Sequoia 15.3.1\n,\nmacOS Sonoma 14.7.4\n,\nmacOS Ventura 13.7.4\n,\nwatchOS 11.3.1\n, and\nvisionOS 2.3.1\n.\n\"A logic issue existed when processing a maliciously crafted photo or video shared via an iCloud Link,\" the company said in an advisory, adding the vulnerability was addressed with improved checks.\nThe iPhone maker also acknowledged that it's aware the vulnerability \"may have been exploited in an extremely sophisticated attack against specifically targeted individuals.\"\nIt's worth noting that the iOS 18.3.1, iPadOS 18.3.1, and iPadOS 17.7.5 updates also\nresolved\nanother actively exploited zero-day tracked as CVE-2025-24200. It's currently not known why Apple chose not to disclose the existence of this flaw until now.\nWhile Apple did not share any further details of the nature of the attacks weaponizing CVE-2025-43200, the Citizen Lab said it unearthed forensic evidence that the shortcoming was leveraged to target Italian journalist Ciro Pellegrino and an unnamed prominent European journalist and infect them with\nParagon's Graphite\nmercenary spyware.\nThe interdisciplinary research center described the attack as zero-click, meaning the vulnerability could be triggered on targeted devices without requiring any user interaction.\n\"One of the journalist's devices was compromised with Paragon's Graphite spyware in January and early February 2025 while running iOS 18.2.1,\" researchers Bill Marczak and John Scott-Railton\nsaid\n. \"We believe that this infection would not have been visible to the target.\"\nBoth individuals were notified on April 29, 2025, by Apple that they were\ntargeted\nwith advanced spyware. Apple began\nsending threat notifications\nto alert users it suspects have been targeted by state-sponsored attackers starting November 2021.\nGraphite is a surveillance tool developed by the Israeli private sector offensive actor (PSOA) Paragon. It can access messages, emails, cameras, microphones, and location data without any user action, making detection and prevention especially difficult. The spyware is typically deployed by government clients under the guise of national security investigations.\nThe Citizen Lab said the two journalists were sent iMessages from the same Apple account (codenamed \"ATTACKER1\") to deploy the Graphite tool, indicating that the account may have been used by a single Paragon customer to target them.\nThe development is the latest twist in a scandal that erupted in January, when Meta-owned WhatsApp\ndivulged\nthat the spyware had been deployed against dozens of users globally, including Pellegrino's colleague\nFrancesco Cancellato\n. In all, a total of seven individuals have been publicly identified as victims of Paragon targeting and infection to date.\nEarlier this week, the Israeli spyware maker said it has\nterminated\nits contracts with Italy, citing the government's refusal to let the company independently verify that Italian authorities did not break into the phone of the investigative journalist.\n\"The company offered both the Italian government and parliament a way to determine whether its system had been used against the journalist in violation of Italian law and the contractual terms,\" it\nsaid\nin a statement to Haaretz.\nHowever, the Italian government\nsaid\nthe decision was mutual and that it rejected the offer due to national security concerns.\nThe Parliamentary Committee for the Security of the Republic (COPASIR), in a report published last week,\nconfirmed\nthat Italian foreign and domestic intelligence services used Graphite to target the phones of a limited number of people after necessary legal approval.\nCOPASIR added that the spyware was used to search for fugitives, counter illegal immigration, alleged terrorism, organized crime, fuel smuggling and counter-espionage, and internal security activities. However, the phone belonging to Cancellato was not among the victims, it said, leaving a key question as to who may have targeted the journalist unanswered.\nThe report, however, sheds light on how Paragon's spyware infrastructure works in the background. It said an operator has to sign in with a username and password in order to use Graphite. Each deployment of the spyware generates detailed logs that are located on a server controlled by the customer and not accessible by Paragon.\n\"The lack of accountability available to these spyware targets highlights the extent to which journalists in Europe continue to be subjected to this highly invasive digital threat, and underlines the dangers of spyware proliferation and abuse,\" the Citizen Lab said.\nThe European Union (E.U.) has previously\nraised concerns\nover the unchecked use of commercial spyware, calling for stronger export controls and legal safeguards. Recent cases like this one could intensify pressure for regulatory reforms at both national and E.U. levels.\nApple's threat notification system is based on internal threat intelligence and may not detect all instances of targeting. The company notes that receiving such a warning does not confirm an active infection, but indicates that unusual activity consistent with a targeted attack was observed.\nThe Return of Predator\nThe latest revelations come as Recorded Future's Insikt Group said it observed a \"resurgence\" of Predator-related activity, months after the U.S. government\nsanctioned\nseveral individuals\ntied to Israeli spyware vendor Intellexa/Cytrox.\nThis includes the identification of new victim-facing Tier 1 servers, a previously unknown customer in Mozambique, and connections between Predator infrastructure and FoxITech s.r.o., a Czech entity previously associated with the Intellexa Consortium.\nOver the past two years, Predator operators have been flagged in over a dozen counties, such as Angola, Armenia, Botswana, the Democratic Republic of the Congo, Egypt, Indonesia, Kazakhstan, Mongolia, Mozambique, Oman, the Philippines, Saudi Arabia, and Trinidad and Tobago.\n\"This aligns with the broader observation that Predator is highly active in Africa, with over half of its identified customers located on the continent,\" the company\nsaid\n.\n\"This likely reflects growing demand for spyware tools, especially in countries facing export restrictions, ongoing technical innovation in response to public reporting and security enhancements, and increasingly complex corporate structures designed to impede sanctions and attribution.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Google links massive cloud outage to API management issue",
        "Link": "https://www.bleepingcomputer.com/news/google/google-links-massive-cloud-outage-to-api-management-issue/",
        "Summary": "Google says an API management issue is behind Thursday's massive Google Cloud outage, which disrupted or brought down its services and many other online platforms. [...]",
        "Date": "2025-06-13",
        "Content": "Google says an API management issue is behind Thursday's massive Google Cloud outage, which disrupted or brought down its services and many other online platforms.\nGoogle says\nthe cloud outage\nstarted around 10:49 ET and ended at 3:49 ET, after causing issues for millions of users worldwide for over three hours.\nBesides Google Cloud, the incident also impacted Gmail, Google Calendar, Google Chat, Google Cloud Search, Google Docs, Google Drive, Google Meet, Google Tasks, Google Voice, Google Lens, Discover, and Voice Search.\nHowever, it also caused widespread issues for third-party platforms that rely on Google Cloud, including but not limited to Spotify, Discord, Snapchat, NPM, Firebase Studio, and a limited number of Cloudflare services relying on the Workers KV key-value store.\n\"We are deeply sorry for the impact to all of our users and their customers that this service disruption/outage caused. Businesses large and small trust Google Cloud with your workloads and we will do better,\"\nGoogle said\n.\nWhile it's still working on publishing a full incident report, Google revealed today the root cause of what caused an increased number of 503 errors in external API requests during yesterday's three-hour-long outage.\nAs the company explained today, its Google Cloud API management platform failed due to invalid data, an issue that wasn't discovered and remediated promptly because it lacked effective testing and error-handling systems.\n\"From our initial analysis, the issue occurred due to an invalid automated quota update to our API management system which was distributed globally, causing external API requests to be rejected. To recover we bypassed the offending quota check, which allowed recovery in most regions within 2 hours,\" the company added.\n\"However, the quota policy database in us-central1 became overloaded, resulting in much longer recovery in that region. Several products had moderate residual impact (e.g. backlogs) for up to an hour after the primary issue was mitigated and a small number recovering after that.\"\nCloudflare services taken down by Google's outage\nAfter successfully restoring its own impacted services, Cloudflare also\nrevealed in a post-mortem\nthat yesterday's incident was not caused by a security incident and that no data was lost.\nCloudflare Workers KV error rate during outage (Cloudflare)\n\"The cause of this outage was due to a failure in the underlying storage infrastructure used by our Workers KV service, which is a critical dependency for many Cloudflare products and relied upon for configuration, authentication, and asset delivery across the affected services,\" Cloudflare said.\n\"Part of this infrastructure is backed by a third-party cloud provider, which experienced an outage today and directly impacted the availability of our KV service.\"\nEven though it didn't share the name of the cloud provider behind the Thursday outage, a Cloudflare spokesperson\ntold BleepingComputer\nyesterday that only Cloudflare services relying on Google Cloud were affected.\nIn response to this incident, Cloudflare says it will migrate KV's central store to its own R2 object storage to reduce external dependency and prevent similar issues in the future.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nGoogle Cloud and Cloudflare hit by widespread service outages\nMicrosoft confirms auth issues affecting Microsoft 365 users\nCloudflare: Outage not caused by security incident, data is safe\nOpenAI working to fix ChatGPT outage affecting users worldwide\nMassive Heroku outage impacts web platforms worldwide"
    },
    {
        "Title": "Discord flaw lets hackers reuse expired invites in malware campaign",
        "Link": "https://www.bleepingcomputer.com/news/security/discord-flaw-lets-hackers-reuse-expired-invites-in-malware-campaign/",
        "Summary": "Hackers are hijacking expired or deleted Discord invite links to redirect users to malicious sites that deliver remote access trojans and information-stealing malware. [...]",
        "Date": "2025-06-13",
        "Content": "Hackers are hijacking expired or deleted Discord invite links to redirect users to malicious sites that deliver remote access trojans and information-stealing malware.\nThe campaign relies on a flaw in the Discord invitation system to leverage multi-stage infections that evade multiple antivirus engines.\n\"Reviving\" expired Discord invites\nDiscord invite links are URLs that allow someone to join a specific Discord server. They contain an invite code, which is a unique identifier that grants access to a server and can be temporary, permanent, or custom - vanity links available to 'level 3' servers paying for special perks.\nAs part of the perks for level 3 Discord servers, administrators can create a personalized invite code. For regular servers, Discord generates random invite links automatically and the chance of one repeating itself is very low.\nHowever, hackers noticed that when a level 3 server loses its boost status, the custom invite code becomes available and can be reclaimed by another server.\nResearchers at cybersecurity company Check Point say that this is also true in the case of expired temporary invites or deleted permanent invitation links.\nThey say that \"the mechanism for creating custom invite links surprisingly lets you reuse expired temporary invite codes, and, in some cases, deleted permanent invite codes.\"\nHijacking a temporary invite code (top) and reusing it in a vanity link (bottom)\nSource: Check Point\nAdditionally, the researchers say that Discord's faulty mechanism does not modify the expiration time of an already generated temporary invitation code when reusing it as a permanent invitation link.\n\"Users often mistakenly believe that by simply checking this box, they have made the existing invite permanent (and it was this misunderstanding that was exploited in the attack we observed)\" -\nCheck Point\nAn invite code with lowercase letters and digits cannot be registered as long as it is active. However, if the code has uppercase letters, it can be reused in vanity links with lowercase, even if the original is still valid.\nCheck Point researchers explain that this is possible because Discord stores and compares vanity links in lowercase. As a result, the same code with lower and uppercase letters is valid for two separate servers at the same time.\nRedirecting to malicious servers\nAttackers are monitoring deleted or expired Discord invitations and use them in a campaign that has impacted 1,300 users in the US, UK, France, the Netherlands, and Germany, based on Check Point's download count of the malicious payloads.\nThe researchers say that cybercriminals are hijacking Discord invite links from legitimate communities, and share them on social media or official comunity websites. To add credibility to the deceit, hackers design the malicious servers to look authentic.\nThe malicious Discord servers only show a single channel to the visitor, #verify, and a bot prompts the user to go through a verification process.\nAttacker's Discord channel\nSource: Check Point\nAttempting to do so launches a typical 'ClickFix' attack where the user is redirected to a website that mimics the Discord UI and pretends that the CAPTCHA failed to load.\nThe users are tricked into manually opening the Windows Run dialog and pasting a PowerShell command, which they had already copied to the clipboard for execution.\nThe ClickFix page\nSource: Check Point\nDoing so triggers a multi-stage infection involving PowerShell downloaders, obfuscated C++ loaders, and VBScript files.\nThe final payloads are downloaded from the legitimate Bitbucket software collaboration and file hosting service, and include:\nAsyncRAT\n: Delivered as 'AClient.exe,' this is version 0.5.8 of the malware that uses Pastebin to fetch its C2 address dynamically. Its capabilities include file operations, keylogging, and webcam/microphone access\nSkuld Stealer\n: Delivered as 'skul.exe,' this is an info-stealer that targets browser credentials, cookies, Discord tokens, and cryptocurrency wallet data (injects JS to steal mnemonic phrases and passwords using Discord webhooks)\nChromeKatz\n: A custom version of the the open-source tool, delivered as 'cks.exe', that can steal cookies and passwords\nA scheduled task is also added on the host to re-run the malware loader every five minutes, the researchers discovered.\nInfection chain from ClickFix to malware\nSource: Check Point\nTo defend against this threat, it is recommended that Discord users avoid trusting old invite links, especially those from months-old posts, treat \"verification\" requests with extra caution, and never run copied PowerShell commands that you don't fully understand.\nAdditionally, Discord server administrators are recommended to use permanent invites, which are more difficult to hijack.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nTikTok videos now push infostealer malware in ClickFix attacks\nOperation Secure disrupts global infostealer malware operations\n‘Russian Market’ emerges as a go-to shop for stolen credentials\nLumma infostealer malware operation disrupted, 2,300 domains seized\niClicker site hack targeted students with malware via fake CAPTCHA"
    },
    {
        "Title": "Microsoft: KB5060533 update triggers boot errors on Surface Hub v1 devices",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-kb5060533-update-triggers-boot-errors-on-surface-hub-v1-devices/",
        "Summary": "Microsoft is investigating a known issue that triggers Secure Boot errors and prevents Surface Hub v1 devices from starting up. [...]",
        "Date": "2025-06-13",
        "Content": "Microsoft is investigating a known issue that triggers Secure Boot errors and prevents Surface Hub v1 devices from starting up.\nThese boot problems only impact Surface Hub v1 systems running Windows 10, version 22H2, after installing the\nKB5060533\nJune 2025 Windows security update.\nMicrosoft says that \"Surface Hub v1 devices might fail to start with the following error: 'Secure Boot Violation. Invalid signature detected. Check Secure Boot Policy in Setup.\"\nIt's also important to note that this known issue did not impact Surface Hub 2S and Surface Hub 3 devices, according to Redmond.\nThe company says it released a mitigation one day after discovering the issue, to ensure that other systems would not be impacted after installing the faulty update.\n\"A mitigation was released on July 11, 2025, that prevents additional Surface Hub v1 devices from encountering this issue,\"\nMicrosoft added\n.\n\"We have confirmed this issue affects some Surface Hub v1 devices and are continuing to investigate. We will provide more information when it is available.\"\nSecure Boot Violation error (\nlaihung2006\n)\n​The KB5060533 Windows update behind this known issue\nfixes another bug\ncausing some Hyper-V virtual machines with Windows 10, Windows 11, and Windows Server to freeze or restart unexpectedly.\nOn Tuesday, Redmond\nreleased\nsecurity updates for 66 security flaws, including an actively exploited WebDAV (Web Distributed Authoring and Versioning) zero-day (\nCVE-2025-33053\n) and a publicly disclosed Windows SMB privilege escalation vulnerability (\nCVE-2025-33073\n).\nIn all, the June 2025 Patch Tuesday Windows updates addressed ten critical vulnerabilities, eight allowing attackers to gain remote code execution on unpatched devices, while the other two enable privilege escalation.\nThis week, Microsoft also\nreleased an emergency Windows 11 24H2 update\n(KB5063060) to address an Easy Anti-Cheat incompatibility issue that caused some systems to restart with blue screen of death (BSOD) errors.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nWindows 10 KB5060533 cumulative update released with 7 changes, fixes\nNew Secure Boot flaw lets attackers install bootkit malware, patch now\nMicrosoft shares script to restore inetpub folder you shouldn’t delete\nMozilla releases Firefox 139.0.1 update to fix artifacts on Nvidia GPUs\nWindows Server emergency update fixes Hyper-V VM freezes, restart issues"
    },
    {
        "Title": "Microsoft confirms auth issues affecting Microsoft 365 users",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-confirms-auth-issues-affecting-microsoft-365-users/",
        "Summary": "Microsoft is investigating an ongoing incident that is causing users to experience errors with some Microsoft 365 authentication features. [...]",
        "Date": "2025-06-13",
        "Content": "Microsoft is investigating an ongoing incident that is causing users to experience errors with some Microsoft 365 authentication features.\nAs the company revealed earlier today in an\nincident alert\npublished in the admin center, users may experience errors during self-service password resets and when viewing or registering authentication methods in MySignIns, while admins may be unable to add multi-factor authentication  (MFA) sign-in methods to some users.\nMicrosoft acknowledged the issues following a wave of\ncustomer reports\nstarting on\nat least April 18th\nregarding MFA errors when trying to sign up for Microsoft 365 services.\n\"Your organisation requires that you register additional authentication methods, but no supported methods are currently enabled for your account,\" the error reads.\n\"Ask your admin to enable more authentication methods for you to select, or tell them to register one or more methods for you.\"\nRedmond says this incident is caused by a recent change aiming to improve MFA sign-in functionality. Since acknowledging it less than two hours ago, Microsoft engineers have validated a configuration update designed to mitigate the issues temporarily while working on a long-term solution.\n\"We've identified that some of the infrastructure which processes authentication related requests is not performing within expected thresholds,\" the company explained. \"We're making some configuration changes to mitigate impact and telemetry is showing improvement.\"\nThese ongoing Microsoft 365 issues currently impact customers located on or served through affected infrastructure in Europe, the Middle East, Africa (EMEA), and Asia Pacific (APAC).\nAccording to\nreports\nfrom affected users at NHSmail, the national secure collaboration service for health and social care in England, those impacted see \"we're sorry, we ran into a problem\" or \"no methods available\" errors while setting up MFA on NHS.net accounts.\nMicrosoft\nmitigated another MFA incident\nin January, preventing affected customers from accessing Microsoft 365 Office apps. At the time, Microsoft 365 users impacted by the incident reported that MFA registration and reset were not working.\nAfter resolving the incident, the company explained that the outage was due to an unexpected sudden increase in CPU resource usage, which rendered the infrastructure responsible for registering authentication methods for Multi-Factor Authentication (MFA) operations unresponsive.\nIn May, Microsoft also\nfixed a Microsoft 365 outage\naffecting multiple services across North America, including the company's Teams collaboration platform, while one month earlier, it\nresolved a licensing issue\nthat blocked access to Microsoft 365 services for some customers with Family subscriptions.\nUpdate June 13, 10:31 EDT:\nMicrosoft says the incident has been mitigated and that it was caused by database infrastructure that processes authentication-related requests not performing within expected thresholds.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nNew Microsoft 365 outage impacts Teams and other services\nGoogle links massive cloud outage to API management issue\nCloudflare: Outage not caused by security incident, data is safe\nGoogle Cloud and Cloudflare hit by widespread service outages\nMicrosoft fixes Windows Server auth issues caused by April updates"
    },
    {
        "Title": "Victoria’s Secret restores critical systems after cyberattack",
        "Link": "https://www.bleepingcomputer.com/news/security/victorias-secret-restores-critical-systems-after-cyberattack/",
        "Summary": "Victoria's Secret has restored all critical systems impacted by a May 24 security incident that forced it to shut down corporate systems and the e-commerce website. [...]",
        "Date": "2025-06-13",
        "Content": "Victoria's Secret has restored all critical systems impacted by a May 24 security incident that forced it to shut down corporate systems and the e-commerce website.\nThe company operates around 1,380 retail stores in nearly 70 countries and has reported net sales of $1.353 billion for the first quarter of 2025, with a forecasted net sales range of up to $6.3 billion for the year.\nIn a Thursday\nfiling\nwith the U.S. Securities and Exchange Commission, the company disclosed that all restored critical systems are now fully operational and that it's working with external experts to assess the cyberattack's impact.\nIt also believes the incident will likely have no material impact on its yearly fiscal results, even though it may continue to incur expenses related to the attack.\n\"We immediately enacted our response protocols to contain and eradicate unauthorized network access, and third-party experts were engaged. All critical systems are restored and fully operational,\" Victoria's Secret said.\n\"We continue to assess the full scope and impact of the incident. This incident has not caused a material disruption to our operations to date and we do not believe it will have a material impact to our fiscal year 2025.\"\nQuarterly earnings release delayed\nAs the company revealed\nafter disclosing the incident\nlast month, it was forced to take down corporate systems, some in-store services, and the e-commerce website as a precaution on May 26.\nA Victoria's Secret spokesperson\ntold BleepingComputer\nthat the fashion retail giant was working to restore operations and had hired external experts to investigate the breach.\nIn a June 3 press release, Victoria's Secret added that it had to\npostpone releasing financial results\nfor the first quarter because systems needed during this process were unreachable after the attack.\n\"The restoration process has prevented employees from accessing certain systems and information needed to support the Company's release of its financial results for the first quarter ended May 3, 2025,\" it stated. \"As a result, the Company is postponing the date of its previously announced first quarter 2025 earnings release and earnings call webcast.\"\nVictoria's Secret didn't reply to an email from BleepingComputer requesting more details on the nature of the incident, and no ransomware operations have claimed responsibility for the attack since then.\nThis security incident follows a series of attacks targeting other fashion companies in recent weeks, including French luxury fashion brands\nCartier\nand\nDior\n. German sportswear giant Adidas was also\nbreached last month\n, with the threat actors stealing some of its customers' data after hacking into a customer service provider's systems.\nStarting in April, a campaign linked to\nScattered Spider\nthreat actors and the\nDragonForce\nransomware gang has also\ntargeted multiple retailers\nacross the United Kingdom, including\nMarks & Spencer\n,\nCo-op\n, and\nHarrods\n.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nVictoria’s Secret delays earnings release after security incident\nVictoria’s Secret takes down website after security incident\nMarks & Spencer faces $402 million profit hit after cyberattack\nHackers behind UK retail attacks now targeting US companies\nMarks & Spencer pauses online orders after cyberattack"
    },
    {
        "Title": "Cloudflare: Outage not caused by security incident, data is safe",
        "Link": "https://www.bleepingcomputer.com/news/security/cloudflare-outage-not-caused-by-security-incident-data-is-safe/",
        "Summary": "Cloudflare has confirmed that the massive service outage yesterday was not caused by a security incident and no data has been lost. [...]",
        "Date": "2025-06-13",
        "Content": "Cloudflare has confirmed that the massive service outage yesterday was not caused by a security incident and no data has been lost.\nThe issue has been largely mitigated. It started 17:52 UTC yesterday when the Workers KV (Key-Value) system went completely offline, causing\nwidespread service losses\nacross multiple edge computing and AI services.\nWorkers KV is a globally distributed, consistent key-value store used by Cloudflare Workers, the company’s serverless computing platform. It is a fundamental piece in many Cloudflare services and a failure can cause cascading issues across many components.\nThe disruption also impacted other services used by millions, most notably the Google Cloud Platform.\nWorkers KV error rate during the incident\nSource: Cloudflare\nIn a post mortem, Cloudflare explains that the outage lasted almost 2.5 hours and the root cause was a failure in the Workers KV underlying storage infrastructure due to a third-party cloud provider outage.\n“The cause of this outage was due to a failure in the underlying storage infrastructure used by our Workers KV service, which is a critical dependency for many Cloudflare products and relied upon for configuration, authentication, and asset delivery across the affected services,”\nCloudflare\nsays\n.\n“Part of this infrastructure is backed by a third-party cloud provider, which experienced an outage today and directly impacted the availability of our KV service.”\nCloudflare has determined the impact of the incident on each service:\nWorkers KV\n– experienced a 90.22% failure rate due to backend storage unavailability, affecting all uncached reads and writes.\nAccess, WARP, Gateway\n– all suffered critical failures in identity-based authentication, session handling, and policy enforcement due to reliance on Workers KV, with WARP unable to register new devices, and disruption of Gateway proxying and DoH queries.\nDashboard, Turnstile, Challenges\n– experienced widespread login and CAPTCHA verification failures, with token reuse risk introduced due to kill switch activation on Turnstile.\nBrowser Isolation & Browser Rendering\n– failed to initiate or maintain link-based sessions and browser rendering tasks due to cascading failures in Access and Gateway.\nStream, Images, Pages\n– experienced major functional breakdowns: Stream playback and live streaming failed, image uploads dropped to 0% success, and Pages builds/serving peaked at ~100% failure.\nWorkers AI & AutoRAG\n– were completely unavailable due to dependence on KV for model configuration, routing, and indexing functions.\nDurable Objects, D1, Queues\n– services built on the same storage layer as KV suffered up to 22% error rates or complete unavailability for message queuing and data operations.\nRealtime & AI Gateway\n– faced near-total service disruption due to inability to retrieve configuration from Workers KV, with Realtime TURN/SFU and AI Gateway requests heavily impacted.\nZaraz & Workers Assets\n– saw full or partial failure in loading or updating configurations and static assets, though end-user impact was limited in scope.\nCDN, Workers for Platforms, Workers Builds\n– experienced increased latency and regional errors in some locations, with new Workers builds failing 100% during the incident.\nIn response to this outage, Cloudflare says it will be accelerating several resilience-focused changes, primarily eliminating reliance on a single third-party cloud provider for Workers KV backend storage.\nGradually, the KV’s central store will be migrated to Cloudflare’s own R2 object storage to reduce external dependency.\nCloudflare also plans to implement cross-service safeguards and develop new tooling to gradually restore services during storage outages, preventing traffic surges that could overwhelm recovering systems and cause secondary failures.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nGoogle Cloud and Cloudflare hit by widespread service outages\nMassive Heroku outage impacts web platforms worldwide\nASUS warns of critical auth bypass flaw in routers using AiCloud\nGoogle links massive cloud outage to API management issue\nMicrosoft confirms auth issues affecting Microsoft 365 users"
    },
    {
        "Title": "CISA Reveals 'Pattern' of Ransomware Attacks Against SimpleHelp RMM",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/cisa-ransomware-attacks-simplehelp-rmm",
        "Summary": "A new Cybersecurity and Infrastructure Security Agency (CISA) advisory warned ransomware actors have been actively exploiting a critical SimpleHelp flaw since January.",
        "Date": "2025-06-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/cisa-ransomware-attacks-simplehelp-rmm"
    },
    {
        "Title": "Threat Actor Abuses TeamFiltration for Entra ID Account Takeovers",
        "Link": "https://www.darkreading.com/cloud-security/threat-actor-teamfiltration-entra-id-attacks",
        "Summary": "Researchers discovered a large-scale campaign using the open source penetration-testing framework that has targeted more than 80,000 Microsoft accounts.",
        "Date": "2025-06-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/threat-actor-teamfiltration-entra-id-attacks"
    },
    {
        "Title": "Why CISOs Must Align Business Objectives &amp; Cybersecurity",
        "Link": "https://www.darkreading.com/cybersecurity-operations/why-cisos-align-business-objectives-cybersecurity",
        "Summary": "This alignment makes a successful CISO, but creating the same sentiment across business leadership creates a culture of commitment and greatly contributes to achieving goals.",
        "Date": "2025-06-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/why-cisos-align-business-objectives-cybersecurity"
    },
    {
        "Title": "Cyberattacks on Humanitarian Orgs Jump Worldwide",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/attacks-humanitarian-orgs-jump-worldwide",
        "Summary": "These groups suffered three times the cyberattacks as the year previous, with DDoS attacks dominating and vulnerability scans and SQL injection also more common.",
        "Date": "2025-06-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/attacks-humanitarian-orgs-jump-worldwide"
    },
    {
        "Title": "In Other News: Cloudflare Outage, Cracked.io Users Identified, Victoria’s Secret Cyberattack Cost",
        "Link": "https://www.securityweek.com/in-other-news-cloudflare-outage-cracked-io-users-identified-victorias-secret-cyberattack-cost/",
        "Summary": "<p>Noteworthy stories that might have slipped under the radar: Cloudflare outage not caused by cyberattack, Dutch police identified 126 users of Cracked.io, the Victoria’s Secret cyberattack has cost $10 million. </p>\n<p>The post <a href=\"https://www.securityweek.com/in-other-news-cloudflare-outage-cracked-io-users-identified-victorias-secret-cyberattack-cost/\">In Other News: Cloudflare Outage, Cracked.io Users Identified, Victoria&#8217;s Secret Cyberattack Cost</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/in-other-news-cloudflare-outage-cracked-io-users-identified-victorias-secret-cyberattack-cost/"
    },
    {
        "Title": "TeamFiltration Abused in Entra ID Account Takeover Campaign",
        "Link": "https://www.securityweek.com/teamfiltration-abused-in-entra-id-account-takeover-campaign/",
        "Summary": "<p>Threat actors have abused the TeamFiltration pentesting framework to target over 80,000 Entra ID user accounts.</p>\n<p>The post <a href=\"https://www.securityweek.com/teamfiltration-abused-in-entra-id-account-takeover-campaign/\">TeamFiltration Abused in Entra ID Account Takeover Campaign</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/teamfiltration-abused-in-entra-id-account-takeover-campaign/"
    },
    {
        "Title": "Industry Reactions to Trump Cybersecurity Executive Order: Feedback Friday",
        "Link": "https://www.securityweek.com/industry-reactions-to-trump-cybersecurity-executive-order-feedback-friday/",
        "Summary": "<p>Industry professionals comment on the Trump administration’s new executive order on cybersecurity. </p>\n<p>The post <a href=\"https://www.securityweek.com/industry-reactions-to-trump-cybersecurity-executive-order-feedback-friday/\">Industry Reactions to Trump Cybersecurity Executive Order: Feedback Friday</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/industry-reactions-to-trump-cybersecurity-executive-order-feedback-friday/"
    },
    {
        "Title": "SimpleHelp Vulnerability Exploited Against Utility Billing Software Users",
        "Link": "https://www.securityweek.com/simplehelp-vulnerability-exploited-against-utility-billing-software-users/",
        "Summary": "<p>CISA warns that vulnerable SimpleHelp RMM instances have been exploited against a utility billing software provider’s customers.</p>\n<p>The post <a href=\"https://www.securityweek.com/simplehelp-vulnerability-exploited-against-utility-billing-software-users/\">SimpleHelp Vulnerability Exploited Against Utility Billing Software Users</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/simplehelp-vulnerability-exploited-against-utility-billing-software-users/"
    },
    {
        "Title": "Fog Ransomware Attack Employs Unusual Tools",
        "Link": "https://www.securityweek.com/fog-ransomware-attack-employs-unusual-tools/",
        "Summary": "<p>Multiple legitimate, unusual tools were used in a Fog ransomware attack, including one employed by Chinese hacking group APT41.</p>\n<p>The post <a href=\"https://www.securityweek.com/fog-ransomware-attack-employs-unusual-tools/\">Fog Ransomware Attack Employs Unusual Tools</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/fog-ransomware-attack-employs-unusual-tools/"
    },
    {
        "Title": "Critical Vulnerability Exposes Many Mitel MiCollab Instances to Remote Hacking",
        "Link": "https://www.securityweek.com/critical-vulnerability-exposes-many-mitel-micollab-instances-to-remote-hacking/",
        "Summary": "<p>Mitel has announced patches for a MiCollab path traversal vulnerability that can be exploited remotely without authentication.</p>\n<p>The post <a href=\"https://www.securityweek.com/critical-vulnerability-exposes-many-mitel-micollab-instances-to-remote-hacking/\">Critical Vulnerability Exposes Many Mitel MiCollab Instances to Remote Hacking</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/critical-vulnerability-exposes-many-mitel-micollab-instances-to-remote-hacking/"
    },
    {
        "Title": "Critical Vulnerabilities Patched in Trend Micro Apex Central, Endpoint Encryption",
        "Link": "https://www.securityweek.com/critical-vulnerabilities-patched-in-trend-micro-apex-central-endpoint-encryption-policyserver/",
        "Summary": "<p>Trend Micro patches critical-severity Apex Central and Endpoint Encryption PolicyServer flaws leading to remote code execution.</p>\n<p>The post <a href=\"https://www.securityweek.com/critical-vulnerabilities-patched-in-trend-micro-apex-central-endpoint-encryption-policyserver/\">Critical Vulnerabilities Patched in Trend Micro Apex Central, Endpoint Encryption</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/critical-vulnerabilities-patched-in-trend-micro-apex-central-endpoint-encryption-policyserver/"
    },
    {
        "Title": "ZeroRISC Raises $10 Million for Open Source Silicon Security Solutions",
        "Link": "https://www.securityweek.com/zerorisc-raises-10-million-for-open-source-silicon-security-solutions/",
        "Summary": "<p>ZeroRISC has raised $10 million in seed funding for production-grade open source silicon security, built on OpenTitan designs.</p>\n<p>The post <a href=\"https://www.securityweek.com/zerorisc-raises-10-million-for-open-source-silicon-security-solutions/\">ZeroRISC Raises $10 Million for Open Source Silicon Security Solutions</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/zerorisc-raises-10-million-for-open-source-silicon-security-solutions/"
    },
    {
        "Title": "Global Organizations Targeted in Alleged Access Sale",
        "Link": "https://dailydarkweb.net/global-organizations-targeted-in-alleged-access-sale/",
        "Summary": "A threat actor has allegedly posted a significant sale of network access credentials to numerous high-value organizations across the United States, Europe, and Asia. The advertisement, spotted on a cybercrime forum, offers remote entry into entities spanning critical sectors such as industrial machinery, higher education, and government. The scale of the alleged victims is substantial, [&#8230;]",
        "Date": "2025-06-13",
        "Content": "A threat actor has allegedly posted a significant sale of network access credentials to numerous high-value organizations across the United States, Europe, and Asia. The advertisement, spotted on a cybercrime forum, offers remote entry into entities spanning critical sectors such as industrial machinery, higher education, and government. The scale of the alleged victims is substantial, with the post claiming targets include a US-based industrial equipment firm with over $5 billion in revenue and a Malaysian government body with a revenue exceeding $1 billion.\nThe cybercriminal is allegedly selling various types of remote access, which could provide buyers with an initial foothold to launch further cyberattacks, including ransomware and data theft. The prices for this alleged access range from $500 to as high as $60,000, seemingly correlated with the organization’s size and the level of administrative privilege offered. The seller claims to be offering verified credentials for widely used corporate and government network access points, indicating a potentially severe security breach for the involved entities.\nThe types of allegedly compromised access points for sale include:\nPulse Secure domain user access\nRDweb domain user access\nCisco domain admin access\nGlobal Protect domain user access\nCisco VPN user access\nTags:\nCISCO\nCyberSecurity\ndark web\ndata-breach\ngovernment\nnetwork access\nPulse Secure\nRDP\nthreat actor\nVPN"
    },
    {
        "Title": "Vodafone Egypt Allegedly Breached – 39 Million Customer Records for Sale Online",
        "Link": "https://dailydarkweb.net/vodafone-egypt-allegedly-breached-39-million-customer-records-for-sale-online/",
        "Summary": "A major telecommunications provider, Vodafone Egypt, is allegedly the latest victim of a massive data breach. A threat actor has posted a database containing the personal information of what they claim to be 39 million customers for sale on a clandestine hacking forum. The seller posted the data on June 1, 2025, offering a vast [&#8230;]",
        "Date": "2025-06-13",
        "Content": "A major telecommunications provider,\nVodafone Egypt\n, is allegedly the latest victim of a massive data breach. A threat actor has posted a database containing the personal information of what they claim to be 39 million customers for sale on a clandestine hacking forum. The seller posted the data on June 1, 2025, offering a vast trove of sensitive user information.\nVodafone Egypt is one of the country’s leading mobile network operators, a subsidiary of the global telecommunications giant Vodafone Group. The compromise of its user data on this scale could have severe consequences. The exposed information allegedly includes a wide range of personally identifiable information (PII), which could be exploited by malicious actors for phishing campaigns, identity theft, and other fraudulent activities.\nThe leaked data allegedly includes:\nFull Name\nTelephone Number\nDate of Birth\nGender\nFacebook Profile\nUsername\nPhysical Address, City, and Location\nMail\nTags:\nCyberSecurity\ndata-breach\nEgypt\ntelecommunications\nVodafone\nVodafone Egypt"
    },
    {
        "Title": "Indonesian State-Owned Electricity Giant PLN Allegedly Breached",
        "Link": "https://dailydarkweb.net/indonesian-state-owned-electricity-giant-pln-allegedly-breached/",
        "Summary": "A significant database allegedly belonging to Indonesia&#8217;s state-owned electricity company, Perusahaan Listrik Negara (PLN), has been leaked and is being circulated on the dark web. The compromised data purportedly contains sensitive personal information of an undisclosed number of customers. PLN is the sole electricity provider for the archipelagic nation, serving millions of residential and business [&#8230;]",
        "Date": "2025-06-13",
        "Content": "A significant database allegedly belonging to Indonesia’s state-owned electricity company, Perusahaan Listrik Negara (PLN), has been leaked and is being circulated on the dark web. The compromised data purportedly contains sensitive personal information of an undisclosed number of customers. PLN is the sole electricity provider for the archipelagic nation, serving millions of residential and business customers, making it a critical component of Indonesia’s infrastructure. The breach of its customer database could have far-reaching consequences for the privacy and security of a substantial portion of the Indonesian population.\nThe origin of the leak appears to be a post on a dark web forum, where a user shared a sample of the extensive database. The circulation of such sensitive information on illicit channels raises serious concerns about the potential for identity theft, financial fraud, and targeted phishing campaigns against the affected individuals. This incident highlights the persistent and evolving threats facing critical national infrastructure and the vast repositories of personal data they manage. The alleged breach underscores the importance of robust cybersecurity measures for state-owned enterprises that are entrusted with the personal and confidential information of the public.\nThe leaked data allegedly includes a wide range of customer information. Based on the samples circulating, the compromised data fields include:\nCustomer Names\nFull Addresses\nEmail Addresses\nPhone Numbers\nNational Identity Card Numbers (Nomor Induk Kependudukan – NIK)\nElectricity Usage Details, including meter numbers and tariff types\nGeographical location data (latitude and longitude)\nTags:\nCyberSecurity\ndata-breach\ndata-leak\ngovernment\nIndonesia\nPersonal Data\nPLN"
    },
    {
        "Title": "Sensitive Military and Commercial Data from Spanish Defense Contractor GTD Allegedly Leaked",
        "Link": "https://dailydarkweb.net/sensitive-military-and-commercial-data-from-spanish-defense-contractor-gtd-allegedly-leaked/",
        "Summary": "A significant breach has allegedly occurred at GTD System &#38; Software Engineering, a prominent Spanish technology company specializing in high-tech systems for the defense, aerospace, and energy sectors. The company, a key partner for major European defense and aerospace entities like Navantia and Airbus, is deeply involved in critical international military projects. GTD develops sophisticated [&#8230;]",
        "Date": "2025-06-13",
        "Content": "A significant breach has allegedly occurred at GTD System & Software Engineering, a prominent Spanish technology company specializing in high-tech systems for the defense, aerospace, and energy sectors. The company, a key partner for major European defense and aerospace entities like Navantia and Airbus, is deeply involved in critical international military projects. GTD develops sophisticated software and hardware, including combat management systems for naval frigates and armored vehicles, making the potential exposure of its data a matter of serious concern for international security and defense supply chains.\nThe threat actor claims to have extracted 2.71 GB of sensitive and strategic information directly from the company’s web infrastructure. The data trove is allegedly being sold online and is said to contain highly confidential documents related to major defense projects, including schematics and operational details for the AVANTE 2200 frigates and the VCR 8×8 armored vehicle. The leaked information is said to be subject to International Traffic in Arms Regulations (ITAR), highlighting the critical nature of the compromised files which could offer deep insights into advanced military technologies.\nThe allegedly leaked dataset is exceptionally detailed, providing a comprehensive look into the company’s operations and technological capabilities. The compromised files reportedly include:\nTechnical and Engineering Documents:\nDetailed design and cabling diagrams, software system specifications for combat management systems, and technical manuals.\nContracts and Commercial Documents:\nContract details with partners like Navantia, including financial terms and confidentiality agreements.\nLogistics and Support Information:\nSpare parts lists, component lead times, and reliability analysis for military hardware.\nChemical Material Information (MSDS):\nSpecifications for materials used in military equipment, such as corrosion-resistant coatings.\nTags:\nCyberSecurity\ndata-breach\ndata-leak\nDefense Industry\nGTD\nITAR\nmilitary\nNavantia\nSpain"
    }
]