[
    {
        "Title": "New Supply Chain Malware Operation Hits npm and PyPI Ecosystems, Targeting Millions Globally",
        "Link": "https://thehackernews.com/2025/06/new-supply-chain-malware-operation-hits.html",
        "Summary": "Cybersecurity researchers have flagged a supply chain attack targeting over a dozen packages associated with GlueStack to deliver malware.\nThe malware, introduced via a change to \"lib/commonjs/index.js,\" allows an attacker to run shell commands, take screenshots, and upload files to infected machines, Aikido Security told The Hacker News, stating these packages collectively account for nearly 1",
        "Date": "2025-06-08",
        "Content": "Cybersecurity researchers have\nflagged\na supply chain attack targeting over a dozen packages associated with GlueStack to deliver malware.\nThe malware, introduced via a change to \"lib/commonjs/index.js,\" allows an attacker to run shell commands, take screenshots, and upload files to infected machines, Aikido Security told The Hacker News, stating these packages collectively account for nearly 1 million weekly downloads.\nThe unauthorized access could then be used to perform various follow-on actions like mining cryptocurrency, stealing sensitive information, and even shutting down services. Aikido said the first package compromise was detected on June 6, 2025, at 9:33 p.m. GMT.\nThe list of the impacted packages and the affected versions is below -\n@gluestack-ui/utils version 0.1.16 (101 Downloads)\n@gluestack-ui/utils version 0.1.17 (176 Downloads)\n@react-native-aria/button version 0.2.11 (174 Downloads)\n@react-native-aria/checkbox version 0.2.11 (577 Downloads)\n@react-native-aria/combobox version 0.2.8 (167 Downloads)\n@react-native-aria/disclosure version 0.2.9 (N/A)\n@react-native-aria/focus version 0.2.10 (951 Downloads)\n@react-native-aria/interactions version 0.2.17 (420 Downloads)\n@react-native-aria/listbox version 0.2.10 (171 Downloads)\n@react-native-aria/menu version 0.2.16 (54 Downloads)\n@react-native-aria/overlay version 0.3.16 (751 Downloads)\n@react-native-aria/radio version 0.2.14 (570 Downloads)\n@react-native-aria/slider version 0.2.13 (264 Downloads)\n@react-native-aria/switch version 0.2.5 (56 Downloads)\n@react-native-aria/tabs version 0.2.14 (170 Downloads)\n@react-native-aria/toggle version 0.2.12 (589 Downloads)\n@react-native-aria/utils version 0.2.13 (341 Downloads)\nFurthermore, the malicious code injected into the packages is\nsimilar\nto the remote access trojan that was delivered following the compromise of another npm package \"rand-user-agent\" last month, indicating that the same threat actors could be behind the activity.\nThe trojan is an updated version that supports two new commands to harvest system information (\"ss_info\") and the public IP address of the host (\"ss_ip\").\nThe project maintainers have since\nrevoked the access token\nand marked the impacted versions as deprecated. Users who may have downloaded the malicious versions are recommended to roll back to a safe version to mitigate any potential threats.\n\"The potential impact is massive in scale, and the malware's persistence mechanism is particularly concerning – attackers maintain access to infected machines even after maintainers update the packages,\" the company said in a statement.\nMalicious Packages Found on npm Unleash Destructive Features\nThe development comes as Socket discovered two rogue npm packages – express-api-sync and system-health-sync-api – that masquerade as legitimate utilities but implant wipers that can delete entire application directories.\nPublished by the account \"botsailer\" (email: anupm019@gmail[.]com), the packages were downloaded 112 and 861 times, respectively, before being taken down.\nThe first of the two packages, express-api-sync, claims to be an Express API to sync data between two databases. However, once installed and added by an unsuspecting developer to their application, it triggers the execution of malicious code upon receiving an HTTP request with a hard-coded key \"DEFAULT_123.\"\nUpon receipt of the key, it executes the Unix command \"rm -rf *\" to recursively delete all files from the current directory and below, including source code, configuration files, assets, and local databases.\nThe other package is a lot more sophisticated, acting both as an information stealer and a wiper, while also modifying its deletion commands based on whether the operating system is Windows (\"rd /s /q .\") or Linux (\"rm -rf *\").\n\"Where express-api-sync is a blunt instrument, system-health-sync-api is a Swiss Army knife of destruction with built-in intelligence gathering,\" security researcher Kush Pandya\nsaid\n.\nA notable aspect of the npm package is that it uses email as a covert communication channel, connecting to the attacker-controlled mailbox via hard-coded SMTP credentials. The password is obfuscated using Base64-encoding, whereas the username points to an email address with a domain that's associated with a real estate agency based in India (\"auth@corehomes[.]in\").\n\"Every significant event triggers an email to anupm019@gmail[.]com,\" Socket said. \"The email includes the full backend URL, potentially exposing internal infrastructure details, development environments, or staging servers that shouldn't be publicly known.\"\nThe use of SMTP for data exfiltration is sneaky as most firewalls do not block outbound email traffic, and allows malicious traffic to blend in with legitimate application emails.\nFurthermore, the package resisters endpoints at \"/_/system/health\" and \"/_/sys/maintenance\" to unleash the platform-specific destruction commands, with the latter acting as a fallback mechanism in case the main backdoor is detected and blocked.\n\"Attackers first verify the backdoor via GET /_/system/health which returns the server's hostname and status,\" Pandya explained. \"They can test with dry-run mode if configured, then execute destruction using POST /_/system/health or the backup POST /_/sys/maintenance endpoint with the key \"HelloWorld.\"\nThe discovery of the two new npm packages shows that threat actors are beginning to branch out beyond using bogus libraries for information and cryptocurrency theft to focus on system sabotage -- something of an unusual development as they offer no financial benefits.\nPyPI Package Poses as Instagram Growth Tool to Harvest Credentials\nIt also comes as the software supply chain security firm discovered a new Python-based credential harvester imad213 on the Python Package Index (PyPI) repository that claims to be an Instagram growth tool. According to statistics published on pepy.tech, the package has been downloaded 3,242 times.\n\"The malware uses Base64-encoding to hide its true nature and implements a remote kill switch through a Netlify-hosted control file,\" Pandya\nsaid\n. \"When executed, it prompts users for Instagram credentials, and broadcasts them to ten different third-party bot services while pretending to boost follower counts.\"\nThe Python library has been uploaded by a user named\nim_ad__213\n(aka IMAD-213), who joined the registry on March 21, 2025, and has uploaded three other packages that can harvest Facebook, Gmail, Twitter, and VK credentials (taya, a-b27) or leverage Apache Bench to target streaming platforms and APIs with distributed denial-of-service (DDoS) attacks (poppo213).\nThe list of packages, which are still available for download from PyPI, is below -\nimad213 (3,242 Downloads)\ntaya (930 Downloads)\na-b27 (996 Downloads)\npoppo213 (3,165 Downloads)\nIn a GitHub README.md document published by IMAD-213 about two days before \"imad213\" was uploaded to PyPI, the threat actor\nclaims\nthat the library is mainly for \"educational and research purposes\" and notes that they are not responsible for any misuse.\nThe GitHub description also includes a \"deceptive safety tip,\" urging users to utilize a fake or temporary Instagram account to avoid running into any issues with their main account.\n\"This creates false security, users think they're being cautious while still handing over valid credentials to the attacker,\" Pandya said.\nOnce launched, the malware connects to an external server and reads a text file (\"pass.txt\") and proceeds further with the execution only if the file content matches the string \"imad213.\" The kill switch can serve multiple purposes, allowing the threat actor to determine who gets access to run the library or turn off every downloaded copy by simply changing the context of the control file.\nIn the next step, the library prompts the user to enter their Instagram credentials, which are then saved locally in a file named \"credentials.txt\" and broadcast to ten different dubious bot service websites, some of which link to a network of Turkish Instagram growth tools likely operated by the same entity. The domains were registered in June 2021.\n\"The emergence of this credential harvester reveals concerning trends in social media-targeted malware,\" Socket said. \"With ten different bot services receiving credentials, we're seeing the early stages of credential laundering – where stolen logins are distributed across multiple services to obscure their origin.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Malicious Browser Extensions Infect Over 700 Users Across Latin America Since Early 2025",
        "Link": "https://thehackernews.com/2025/06/malicious-browser-extensions-infect-722.html",
        "Summary": "Cybersecurity researchers have shed light on a new campaign targeting Brazilian users since the start of 2025 to infect users with a malicious extension for Chromium-based web browsers and siphon user authentication data.\n\"Some of the phishing emails were sent from the servers of compromised companies, increasing the chances of a successful attack,\" Positive Technologies security researcher",
        "Date": "2025-06-08",
        "Content": "Cybersecurity researchers have shed light on a new campaign targeting Brazilian users since the start of 2025 to infect users with a malicious extension for Chromium-based web browsers and siphon user authentication data.\n\"Some of the phishing emails were sent from the servers of compromised companies, increasing the chances of a successful attack,\" Positive Technologies security researcher Klimentiy Galkin\nsaid\nin a report. \"The attackers used a malicious extension for Google Chrome, Microsoft Edge, and Brave browsers, as well as Mesh Agent and PDQ Connect Agent.\"\nThe Russian cybersecurity company, which is tracking the activity under the name\nOperation Phantom Enigma\n, said the malicious extension was downloaded 722 times from across Brazil, Colombia, the Czech Republic, Mexico, Russia, and Vietnam, among others. As many as 70 unique victim companies have been identified. Some aspects of the campaign were disclosed in early April by a researcher who goes by the alias\n@johnk3r\non X.\nThe attack starts with phishing emails disguised as invoices that trigger a multi-stage process to deploy the browser extension. The messages encourage recipients to download a file from an embedded link or open a malicious attachment contained within an archive.\nPresent within the files is a batch script that's responsible for downloading and launching a PowerShell script, which, in turn, performs a series of checks to determine if it's running in a virtualized environment and the presence of a software named Diebold Warsaw.\nDeveloped by GAS Tecnologia, Warsaw is a security plugin that's used to secure banking and e-commerce transactions through the Internet and mobile devices in Brazil. It's worth noting that Latin American banking trojans like Casbaneiro have incorporated similar features, as\ndisclosed\nby ESET in October 2019.\nThe PowerShell script is also engineered to disable User Account Control (UAC), set up persistence by configuring the aforementioned batch script to be launched automatically upon system reboot, and establish a connection with a remote server to await further commands.\nThe list of supported commands is as follows -\nPING - Send a heartbeat message to the server by sending \"PONG\" in response\nDISCONNECT - Stop the current script process on the victim's system\nREMOVEKL - Uninstall the script\nCHECAEXT - Check the Windows Registry for the presence of a malicious browser extension, sending OKEXT if it exists, or NOEXT, if the extension is not found\nSTART_SCREEN - Install the extension in the browser by modifying the\nExtensionInstallForcelist\npolicy, which specifies a list of apps and extensions that can be installed without user interaction\nThe detected extensions (identifiers nplfchpahihleeejpjmodggckakhglee, ckkjdiimhlanonhceggkfjlmjnenpmfm, and lkpiodmpjdhhhkdhdbnncigggodgdfli) have already been removed from the Chrome Web Store.\nOther attack chains swap the initial batch script for Windows Installer and Inno Setup installer files that are utilized to deliver the extensions. The add-on, per Positive Technologies, is equipped to execute malicious JavaScript code when the active browser tab corresponds to a web page associated with Banco do Brasil.\nSpecifically, it sends the user's authentication token and a request to the attackers' server to receive commands to likely display a loading screen to the victim (WARTEN or SCHLIEBEN_WARTEN) or serve a malicious QR code on the bank's web page (CODE_ZUM_LESEN). The presence of German words for the commands could either allude to the attacker's location or that the source code was repurposed from somewhere else.\nIn what appears to be an effort to maximize the number of potential victims, the unknown operators have found to leverage invoice-related lures to distribute installer files and deploy remote access software such as MeshCentral Agent or PDQ Connect Agent instead of a malicious browser extension.\nPositive Technologies said it also identified an open directory belonging to the attacker's auxiliary scripts containing links with parameters that included the EnigmaCyberSecurity identifier (\"<victim-domain>/about.php?key=EnigmaCyberSecurity\").\n\"The study highlights the use of rather unique techniques in Latin America, including a malicious browser extension and distribution via Windows Installer and Inno Setup installers,\" Galkin said.\n\"Files in the attackers' open directory indicate that infecting companies was necessary for discreetly distributing emails on their behalf. However, the main focus of the attacks remained on regular Brazilian users. The attackers' goal is to steal authentication data from the victims' bank accounts.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "New Mirai botnet infect TBK DVR devices via command injection flaw",
        "Link": "https://www.bleepingcomputer.com/news/security/new-mirai-botnet-infect-tbk-dvr-devices-via-command-injection-flaw/",
        "Summary": "A new variant of the Mirai malware botnet is exploiting a command injection vulnerability in TBK DVR-4104 and DVR-4216 digital video recording devices to hijack them. [...]",
        "Date": "2025-06-08",
        "Content": "A new variant of the Mirai malware botnet is exploiting a command injection vulnerability in TBK DVR-4104 and DVR-4216 digital video recording devices to hijack them.\nThe flaw, tracked under\nCVE-2024-3721\n, is a command injection vulnerability disclosed by security researcher \"\nnetsecfish\n\" in April 2024.\nThe proof-of-concept (PoC) the researcher published at the time came in the form of a specially crafted POST request to a vulnerable endpoint, achieving shell command execution through the manipulation of certain parameters (mdb and mdc).\nKaspersky\nnow reports\nhaving caught active exploitation of CVE-2024-3721 in its Linux honeypots from a new Mirai botnet variant using netsecfish's PoC.\nThe attackers leverage the exploit to drop an ARM32 malware binary, which establishes communication with the command and control (C2) server to enlist the device to the botnet swarm. From there, the device is likely used to conduct distributed denial of service (DDoS) attacks, proxy malicious traffic, and other behavior.\nMirai's environment checks\nSource: Kaspersky\nAttack impact and fixes\nAlthough netsecfish reported last year that there were approximately 114,000 internet-exposed DVRs vulnerable to CVE-2024-3721, Kaspersky's scans show approximately 50,000 exposed devices, which is still significant.\nMost infections the Russian cybersecurity firm sees as being associated with the latest Mirai variant impact China, India, Egypt, Ukraine, Russia, Turkey, and Brazil. However, this is based on Kaspersky's telemetry, and as its consumer security products are\nbanned in many countries\n, this may not accurately reflect the botnet's targeting focus.\nCurrently, it is unclear if the vendor, TBK Vision, has released security updates to address the CVE-2024-3721 flaw or if it remains unpatched. BleepingComputer contacted TBK to ask about this, but we are still waiting for their response.\nIt's worth noting that DVR-4104 and DVR-4216 have been\nextensively re-branded\nunder the Novo, CeNova, QSee, Pulnix, XVR 5 in 1, Securus, Night OWL, DVR Login, HVR Login, and MDVR brands, so the availability of patches for impacted devices is a complex matter.\nThe researcher who disclosed the TBK Vision flaw discovered other flaws that fueled exploitation against end-of-life devices last year.\nSpecifically, netsecfish has disclosed a\nbackdoor account issue\nand a\ncommand injection vulnerability\nimpacting tens of thousands of EoL D-Link devices in 2024.\nActive exploitation\nwas detected\nin\nboth cases\nonly a few days after the PoC's disclosure. This shows how quickly malware authors incorporate public exploits into their arsenal.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nNew Mirai botnet behind surge in TVT DVR exploitation\nSamsung MagicINFO 9 Server RCE flaw now exploited in attacks\nBotnet hacks 9,000+ ASUS routers to add persistent SSH backdoor\nFBI: BADBOX 2.0 Android malware infects millions of consumer devices\nCisco warns of ISE and CCP flaws with public exploit code"
    },
    {
        "Title": "Crédit Populaire d’Algérie (CPA) Allegedly Targeted by Moroccan Hackers",
        "Link": "https://dailydarkweb.net/credit-populaire-dalgerie-cpa-allegedly-targeted-by-moroccan-hackers/",
        "Summary": "A hacker group has allegedly breached Crédit Populaire d’Algérie (CPA), one of Algeria&#8217;s largest and most influential financial institutions. The bank, which is reportedly 70% owned by the Algerian government, is a significant entity in the nation&#8217;s financial sector. The group claiming responsibility for the attack cites political motivations, stating the operation is a direct [&#8230;]",
        "Date": "2025-06-08",
        "Content": "A hacker group has allegedly breached Crédit Populaire d’Algérie (CPA), one of Algeria’s largest and most influential financial institutions. The bank, which is reportedly 70% owned by the Algerian government, is a significant entity in the nation’s financial sector. The group claiming responsibility for the attack cites political motivations, stating the operation is a direct response to recent actions against the Kingdom of Morocco.\nThe perpetrators claim to have exfiltrated over 30 GB of highly sensitive data from the bank’s systems. To substantiate their claims, they have threatened to leak 500 MB of the raw data immediately. The group has issued a warning that if the bank does not engage with them, the full cache of stolen data will be released to the public. The incident puts the trust and security of the bank’s customers and the institution itself in a precarious position.\nThe allegedly compromised information is said to include a wide range of sensitive documents and records. The list of leaked data titles reportedly includes:\nNational ID documents\nConfidential employee and customer information\nBank account and money transfer records\nInternal administrative documents linked to the Algerian government\nTags:\nAlgeria\nCPA\nCrédit Populaire d’Algérie\nCyberSecurity\ndata-breach"
    },
    {
        "Title": "North Sulawesi Provincial Government Website Allegedly Breached by Hacktivist Group",
        "Link": "https://dailydarkweb.net/north-sulawesi-provincial-government-website-allegedly-breached-by-hacktivist-group/",
        "Summary": "A hacktivist group has allegedly breached the official website of the Legal Documentation and Information Network (JDIH) of the North Sulawesi Provincial Government, jdih.sulutprov.go.id. The group, identifying themselves as &#8220;V FOR VENDETTA CYBER TEAM,&#8221; has claimed responsibility for the attack, stating it is a form of protest against alleged environmental plans in Raja Ampat. The [&#8230;]",
        "Date": "2025-06-08",
        "Content": "A hacktivist group has allegedly breached the official website of the Legal Documentation and Information Network (JDIH) of the North Sulawesi Provincial Government,\njdih.sulutprov.go.id\n. The group, identifying themselves as “V FOR VENDETTA CYBER TEAM,” has claimed responsibility for the attack, stating it is a form of protest against alleged environmental plans in Raja Ampat. The JDIH portal is a critical government service responsible for publishing and managing various legal documents and regional regulations for the province of North Sulawesi, Indonesia.\nThe perpetrators have allegedly leaked a 4MB database file containing sensitive information extracted from the government website. The database appears to hold a wide range of government data, including administrative credentials and public legal documents. This incident raises concerns about the security of government digital infrastructure and the potential for misuse of the compromised information. The alleged motivation behind the attack highlights the growing trend of hacktivism for political or social protest.\nThe allegedly leaked database contains numerous tables, including:\nAdmin user credentials\nAdmin access logs\nAgendas\nNews articles and categories\nPhoto and video galleries\nDraft regional regulations\nCircular letters\nUser data\nTags:\nCyberSecurity\ndata-breach\ngovernment\nhacktivism\nIndonesia\nNorth Sulawesi"
    }
]