[
    {
        "Title": "New Malware Campaign Uses Cloudflare Tunnels to Deliver RATs via Phishing Chains",
        "Link": "https://thehackernews.com/2025/06/new-malware-campaign-uses-cloudflare.html",
        "Summary": "A new campaign is making use of Cloudflare Tunnel subdomains to host malicious payloads and deliver them via malicious attachments embedded in phishing emails.\nThe ongoing campaign has been codenamed SERPENTINE#CLOUD by Securonix.\nIt leverages \"the Cloudflare Tunnel infrastructure and Python-based loaders to deliver memory-injected payloads through a chain of shortcut files and obfuscated",
        "Date": "2025-06-18",
        "Content": "A new campaign is making use of Cloudflare Tunnel subdomains to host malicious payloads and deliver them via malicious attachments embedded in phishing emails.\nThe ongoing campaign has been codenamed\nSERPENTINE#CLOUD\nby Securonix.\nIt leverages \"the Cloudflare Tunnel infrastructure and Python-based loaders to deliver memory-injected payloads through a chain of shortcut files and obfuscated scripts,\" security researcher Tim Peck\nsaid\nin a report shared with The Hacker News.\nThe attack starts with sending payment- or invoice-themed phishing emails bearing a link to a zipped document that contains a Windows shortcut (LNK) file. These shortcuts are disguised as documents to trick victims into opening them, effectively activating the infection sequence.\nThe elaborate multi-step process culminates in the execution of a Python-based shellcode loader that executes payloads packed with the open-source Donut loader entirely in memory.\nSecuronix said the campaign has targeted the United States, United Kingdom, Germany, and other regions across Europe and Asia. The identity of the threat actor(s) behind the campaign is presently unknown, although the cybersecurity company pointed out their English fluency.\nThe\nthreat activity cluster\nis also notable for its shifting initial access methods, pivoting from internet shortcut (URL) files to using LNK shortcut files masquerading as PDF documents. These payloads are then used to retrieve additional stages over WebDAV via the Cloudflare Tunnel subdomains.\nIt's worth noting that a\nvariation of this campaign\nwas previously documented by eSentire and Proofpoint last year, with the attacks paving the way for AsyncRAT, GuLoader, PureLogs Stealer, Remcos RAT, Venom RAT, and XWorm.\nThe abuse of TryCloudflare offers manifold advantages. For starters, malicious actors have long made it harder to detect by using legitimate cloud service providers as a front for their operations, including payload delivery and command-and-control (C2) communication.\nBy using a reputable subdomain (\"*.trycloudflare[.]com\") for nefarious ends, it makes it exceedingly tough for defenders to distinguish between harmful and benign activities, thereby allowing it to evade URL or domain-based blocking mechanisms.\nThe initial infection occurs when the LNK files are launched, causing it to download a next-stage payload, a Windows Script File (WSF), from a remote WebDAV share hosted on a Cloudflare Tunnel subdomain. The WSF file is subsequently executed using cscript.exe in a manner without arousing the victim's suspicion.\n\"This WSF file functions as a lightweight VBScript-based loader, designed to execute an external batch file from a second Cloudflare domain,\" Peck said. \"The 'kiki.bat' file serves as the main payload delivery script next in the series of stagers. Overall, it's designed for stealth and persistence.\"\nThe primary responsibility of the batch script is to display a decoy PDF document, check for antivirus software, and download and execute Python payloads, which are then used to run Donut-packed payloads like AsyncRAT or Revenge RAT in memory.\nSecuronix said there is a possibility that the script may have been vibe-coded using a large language model owing to the presence of well-defined comments in the source code.\n\"The SERPENTINE#CLOUD campaign is a complex and layered infection chain that blends a bit of social engineering, living-off-the-land techniques, and evasive in-memory code execution,\" the company concluded. \"The abuse of Cloudflare Tunnel infrastructure further complicates network visibility by giving the actor a disposable and encrypted transport layer for staging malicious files without maintaining traditional infrastructure.\"\nShadow Vector Targets Colombian Users via SVG Smuggling\nThe disclosure comes as Acronis identified an active malware campaign dubbed\nShadow Vector\ntargeting users in Colombia using booby-trapped scalable vector graphics (SVG) files as the malware delivery vector in phishing emails that impersonate court notifications.\n\"Attackers distributed spear-phishing emails impersonating trusted institutions in Colombia, delivering SVG decoys with embedded links to JS / VBS stagers hosted on public platforms, or password-protected ZIP files containing the payloads directly,\" Acronis researchers Santiago Pontiroli, Jozsef Gegeny, and Ilia Dafchev\nsaid\n.\nThe attacks led to the deployment of remote access trojans like\nAsyncRAT\nand\nRemcos RAT\n, with recent campaigns also utilizing a .NET loader associated with\nKatz Stealer\n. These attack chains involve hiding the payloads within Base64-encoded text of image files hosted on the Internet Archive.\nA noteworthy aspect of the campaign is the use of\nSVG smuggling\ntechniques to deliver malicious ZIP archives using SVG files. These payloads are hosted on file-sharing services such as Bitbucket, Dropbox, Discord, and YDRAY. The download archives contain both legitimate executables and malicious DLLs, the latter of which are sideloaded to ultimately serve the trojans.\n\"A natural evolution from its earlier SVG smuggling techniques, this threat actor has adopted a modular, memory-resident loader that can execute payloads dynamically and entirely in memory, leaving minimal traces behind,\" the researchers said.\n\"The presence of Portuguese-language strings and method parameters within the loader mirrors TTPs commonly observed in Brazilian banking malware, suggesting potential code reuse, shared development resources or even cross-regional actor collaboration.\"\nClickFix Surge Propels Drive-By Compromises\nThe findings also coincide with a rise in social engineering attacks that employ the\nClickFix\ntactic to deploy stealers and remote access trojans like Lumma Stealer and SectopRAT under the guise of fixing an issue or completing a CAPTCHA verification.\nAccording to statistics shared by ReliaQuest, drive-by compromises accounted for 23% of all phishing-based tactics observed between March and May 2025. \"Techniques like ClickFix were central to drive-by downloads,\" the cybersecurity company\nsaid\n.\nClickFix is effective primarily because it deceives targets into carrying out seemingly harmless, everyday actions that are unlikely to raise any red flags, because they're so used to seeing CAPTCHA screening pages and other notifications. What makes it compelling is that it gets users to do the main work of infecting their own machines instead of having to resort to more sophisticated methods like exploiting software flaws.\n\"External remote resources dropped from third to fourth place as attackers increasingly exploit user mistakes rather than technical vulnerabilities,\" ReliaQuest said. \"This shift is likely driven by the simplicity, success rate, and universal applicability of social engineering campaigns like ClickFix.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "1,500+ Minecraft Players Infected by Java Malware Masquerading as Game Mods on GitHub",
        "Link": "https://thehackernews.com/2025/06/1500-minecraft-players-infected-by-java.html",
        "Summary": "A new multi-stage malware campaign is targeting Minecraft users with a Java-based malware that employs a distribution-as-service (DaaS) offering called Stargazers Ghost Network.\n\"The campaigns resulted in a multi-stage attack chain targeting Minecraft users specifically,\" Check Point researchers Jaromír Hořejší and Antonis Terefos said in a report shared with The Hacker News.\n\"The malware was",
        "Date": "2025-06-18",
        "Content": "A new multi-stage malware campaign is targeting Minecraft users with a Java-based malware that employs a distribution-as-service (DaaS) offering called\nStargazers Ghost Network\n.\n\"The campaigns resulted in a multi-stage attack chain targeting Minecraft users specifically,\" Check Point researchers Jaromír Hořejší and Antonis Terefos\nsaid\nin a report shared with The Hacker News.\n\"The malware was impersonating Oringo and Taunahi, which are 'Scripts and macros tools' (aka cheats). Both the first and second stages are developed in Java and can only be executed if the Minecraft runtime is installed on the host machine.\"\nThe end goal of the attack is to trick players into downloading a Minecraft mod from GitHub and deliver a .NET information stealer with comprehensive data theft capabilities. The campaign was first detected by the cybersecurity company in March 2025.\nWhat makes the activity notable is its use of an illicit offering called the Stargazers Ghost Network, which makes use of thousands of GitHub accounts to set up tainted repositories that masquerade as cracked software and game cheats.\nTerefos told The Hacker News that they flagged \"approximately 500 GitHub repositories, including those that are forked or copied,\" adding \"We've also seen 700 stars produced by approximately 70 accounts.\"\nThese malicious repositories, masquerading as Minecraft mods, serve as a conduit for infecting users of the popular video game with a Java loader (e.g., \"Oringo-1.8.9.jar\") that remains undetected by all antivirus engines as of writing.\nThe Java archive (JAR) files implement simple anti-VM and anti-analysis techniques to sidestep detection efforts. Their main objective is to download and run another JAR file, a second-stage stealer that fetches and executes a .NET stealer as the final payload when the game is started by the victim.\nThe second-stage component is retrieved from an IP address (\"147.45.79.104\") that's stored in Base64-encoded format Pastebin, essentially turning the paste tool into a dead drop resolver.\n\"To add mods to a Minecraft game, the user must copy the malicious JAR archive into the Minecraft mods folder. After starting the game, the Minecraft process will load all mods from the folder, including the malicious mod, which will download and execute the second stage,\" the researchers said.\nBesides downloading the .NET stealer, the second-stage stealer is equipped to steal Discord and Minecraft tokens, as well as Telegram-related data. The .NET stealer, on the other hand, is capable of harvesting credentials from various web browsers and gathering files, and information from cryptocurrency wallets and other apps like Steam, and FileZilla.\nIt can also take screenshots and amass information related to running processes, the system's external IP address, and clipboard contents. The captured information is eventually bundled and transmitted back to the attacker via a Discord webhook.\nThe campaign is suspected to be the work of a Russian-speaking threat actor owing to the presence of several artifacts written in the Russian language and the timezone of the attacker's commits (UTC+03:00). It's estimated that more than 1,500 devices may have fallen prey to the scheme.\n\"This case highlights how popular gaming communities can be exploited as effective vectors for malware distribution, emphasizing the importance of caution when downloading third-party content,\" the researchers said.\n\"The Stargazers Ghost Network has been actively distributing this malware, targeting Minecraft players seeking mods to enhance their gameplay. What appeared to be harmless downloads were, in fact, Java-based loaders that deployed two additional stealers, capable of exfiltrating credentials and other sensitive data.\"\nNew Variants of KimJongRAT Stealer Detected\nThe development comes as Palo Alto Networks Unit 42 detailed two new variants of an information stealer codenamed KimJongRAT that's\nlikely connected\nto the same North Korean threat actor behind\nBabyShark\nand\nStolen Pencil\n. KimJongRAT has been detected in the wild as far back as May 2013, delivered as a secondary payload in BabyShark attacks.\n\"One of the new variants uses a Portable Executable (PE) file and the other uses a PowerShell implementation,\" security researcher Dominik Reichel\nsaid\n. \"The PE and PowerShell variants are both initiated by clicking a Windows shortcut (LNK) file that downloads a dropper file from an attacker-controlled content delivery network (CDN) account.\"\nWhile the PE variant's dropper deploys a loader, a decoy PDF and a text file, the dropper in the PowerShell variant deploys a decoy PDF file along with a ZIP archive. The loader, in turn, downloads auxiliary payloads, including the stealer component for KimJongRAT.\nThe ZIP archive delivered by the PowerShell variant's dropper contains scripts that embed the KimJongRAT PowerShell-based stealer and keylogger components.\nBoth the new incarnations are capable of gathering and transferring victim information, files matching specific extensions, and browser data, such as credentials and details from cryptocurrency wallet extensions. The PE variant of KimJongRAT is also designed to harvest FTP and email client information.\n\"The continued development and deployment of KimJongRAT, featuring changing techniques such as using a legitimate CDN server to disguise its distribution, demonstrates a clear and ongoing threat,\" Unit 42 said. \"This adaptability not only showcases the persistent threat posed by such malware but also underscores its developers' commitment to updating and expanding its capabilities.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "FedRAMP at Startup Speed: Lessons Learned",
        "Link": "https://thehackernews.com/2025/06/fedramp-at-startup-speed-lessons-learned.html",
        "Summary": "For organizations eyeing the federal market, FedRAMP can feel like a gated fortress. With strict compliance requirements and a notoriously long runway, many companies assume the path to authorization is reserved for the well-resourced enterprise. But that’s changing.\nIn this post, we break down how fast-moving startups can realistically achieve FedRAMP Moderate authorization without derailing",
        "Date": "2025-06-18",
        "Content": "For organizations eyeing the federal market, FedRAMP can feel like a gated fortress. With strict compliance requirements and a notoriously long runway, many companies assume the path to authorization is reserved for the well-resourced enterprise. But that's changing.\nIn this post, we break down how fast-moving startups can realistically achieve FedRAMP Moderate authorization without derailing product velocity, drawing from real-world lessons, technical insights, and the bruises earned along the way from a cybersecurity startup that just went through the process.\nWhy It Matters\nWinning in the federal space starts with trust—and that trust begins with FedRAMP. But pursuing authorization is not a simple compliance checkbox. It's a company-wide shift that requires intentional strategy, deep security investment, and a willingness to move differently than most startups.\nLet's get into what that actually looks like.\nKeys to a Successful FedRAMP Authorization\n1. Align to NIST 800-53\nfrom Day One\nStartups that bolt on compliance late in the game usually end up rewriting their infrastructure to fit. The better path? Build directly against the\nNIST 800-53 Rev. 5 Moderate baseline\nas your internal security framework—even before FedRAMP is on the roadmap.\nThis early commitment reduces rework, accelerates ATO prep, and fosters a security-first mindset that scales. Additionally, compliance is often a must have for organizations to do business with mid to large enterprises so it's more than a checkbox, it's a business enabler. Here at Beyond Identity, when we say \"secure-by-design\" platform, a foundational component is alignment to strict compliance frameworks from the start.\n2. Build an Integrated Security Team\nFedRAMP isn't just an InfoSec problem—it's a team sport. Success requires tight integration across:\nCompliance-focused InfoSec leads\nwho understand the nuances of FedRAMP controls\nApplication security engineers\nwho can embed guardrails without bottlenecking delivery\nDevSecOps teams\nto operationalize security across pipelines\nPlatform engineers\nresponsible for both cloud posture and deployment parity\nCross-functional collaboration isn't a nice-to-have—it's how you survive the inevitable curveballs.\n3. Mirror Your Commercial and Federal Architectures\nAttempting to run a separate product for the federal market? Don't.\nWinning startups keep a\nsingle software release chain\n, with\nidentical configurations and infrastructure\nacross both environments. That means:\nNo federal-only forks\nNo custom hardening outside the mainline\nOne platform, one set of controls\nThis approach dramatically reduces technical drift, simplifies audits, and ensures your engineers aren't context-switching between two worlds.\nScrutinize the Business Case\nFedRAMP isn't cheap. Initial investments often exceed\n$1 million\n, and timelines can stretch beyond 12 months. Before you start:\nValidate the\nmarket opportunity\n—can you actually win federal deals?\nConfirm\nexecutive sponsorship\n—FedRAMP requires top-down alignment\nLook for\n10x return potential\n—not just for the cost, but for the time and energy involved\nThis isn't a growth experiment. It's a long play that demands conviction.\nPick the Right Partners\nNavigating FedRAMP alone is a losing strategy. Choose external vendors carefully:\nAsk for\ncustomer references\nwith successful FedRAMP delivery\nWatch for\npredatory pricing\n—especially from Third Party Assessment Organizations and automation tools\nPrioritize\ncollaboration and transparency\n—your partner becomes an extension of your team\nCut corners here and you'll pay for it later—in both delays and trust.\nBuild Internal Muscle\nNo external vendor can replace internal readiness. You'll need:\nSecurity architecture skills\nwith depth in cryptography, PKI, and TPMs\nOps maturity\nto manage change control, evidence collection, and ticketing rigor\nStrong program management\nto coordinate vendors, auditors, and internal stakeholders\nTeam training\n—FedRAMP has a steep learning curve. Invest early.\nFedRAMP reshapes how you ship, with slower velocity, higher overhead, and the need for tight cross-functional alignment. While the impact is real, the long-term payoff is disciplined security and process maturity that goes well beyond compliance.\nThe Toughest Challenges\nEvery FedRAMP journey hits turbulence. Some of the hardest problems include:\nInterpreting\nFedRAMP Moderate controls\nwithout clear guidance\nDefining\nauthorization boundaries\nacross microservices and shared components\nOperationalizing\nDevSecOps gates\nthat enforce security without stalling builds\nChoosing the right tools for\nSAST, DAST, SBOM, and SCA\n—and integrating them\nDon't underestimate these. They can become critical blockers without careful planning.\nAchieving FedRAMP at startup speed is possible—but only with ruthless prioritization, integrated security culture, and a deep understanding of what you're signing up for.\nIf you're considering the journey: start small, move deliberately, and commit fully. The federal market rewards trust—but only for those who earn it.\nBeyond Identity is a FedRAMP-moderate identity and access management platform that eliminates identity-based attacks. Learn more at\nbeyondidentity.com\n.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Water Curse Employs 76 GitHub Accounts to Deliver Multi-Stage Malware Campaign",
        "Link": "https://thehackernews.com/2025/06/water-curse-hijacks-76-github-accounts.html",
        "Summary": "Cybersecurity researchers have exposed a previously unknown threat actor known as Water Curse that relies on weaponized GitHub repositories to deliver multi-stage malware.\n\"The malware enables data exfiltration (including credentials, browser data, and session tokens), remote access, and long-term persistence on infected systems,\" Trend Micro researchers Jovit Samaniego, Aira Marcelo, Mohamed",
        "Date": "2025-06-18",
        "Content": "Cybersecurity researchers have exposed a previously unknown threat actor known as Water Curse that relies on weaponized GitHub repositories to deliver multi-stage malware.\n\"The malware enables data exfiltration (including credentials, browser data, and session tokens), remote access, and long-term persistence on infected systems,\" Trend Micro researchers Jovit Samaniego, Aira Marcelo, Mohamed Fahmy, and Gabriel Nicoleta\nsaid\nin an analysis published this week.\nThe \"broad and sustained\" campaign, first spotted last month, set up repositories offering seemingly innocuous penetration testing utilities, but harbored within their Visual Studio project configuration files malicious payloads such as SMTP email bomber and Sakura-RAT.\nWater Curse's arsenal incorporates a wide range of tools and programming languages, underscoring their cross-functional development capabilities to target the supply chain with \"developer-oriented information stealers that blur the line between red team tooling and active malware distribution.\"\n\"Upon execution, the malicious payloads initiated complex multistage infection chains utilizing obfuscated scripts written in Visual Basic Script (VBS) and PowerShell,\" the researchers said. \"These scripts downloaded encrypted archives, extracted Electron-based applications, and performed extensive system reconnaissance.\"\nThe attacks are also characterized by the use of anti-debugging techniques, privilege escalation methods, and persistence mechanisms to maintain a long-term foothold on the affected hosts. Also employed are PowerShell scripts to weaken host defenses and inhibit system recovery.\nWater Curse has been described as a financially motivated threat actor that's driven by credential theft, session hijacking, and resale of illicit access. As many as 76 GitHub accounts have been linked to the campaign. There is evidence to suggest related activity may have been ongoing all the way back to March 2023.\nThe emergence of Water Curse is the latest example of how threat actors are abusing the trust associated with legitimate platforms like GitHub as a delivery channel for malware and stage software supply chain attacks.\n\"Their repositories include malware, evasion utilities, game cheats, aimbots, cryptocurrency wallet tools, OSINT scrapers, spamming bots, and credential stealers,\" Trend Micro said. \"This reflects a multi-vertical targeting strategy that blends cybercrime with opportunistic monetization.\"\n\"Their infrastructure and behavior indicate a focus on stealth, automation, and scalability, with active exfiltration via Telegram and public file-sharing services.\"\nThe disclosure comes as multiple campaigns have been observed leveraging the prevalent\nClickFix\nstrategy to deploy various malware families such as\nAsyncRAT\n,\nDeerStealer\n(via a loader named\nHijack Loader\n),\nFilch Stealer\n,\nLightPerlGirl\n, and\nSectopRAT\n(also via Hijack Loader).\nAsyncRAT is one of the many readily available remote access trojans (RATs) that has been put to use by unidentified threat actors to indiscriminately target thousands of organizations spanning multiple sectors since early 2024. Some aspects of the campaign were\ndocumented\nby Forcepoint in August 2024 and January 2025.\n\"This tradecraft allows the malware to bypass traditional perimeter defenses, particularly by using Cloudflare's temporary tunnels to serve payloads from seemingly legitimate infrastructure,\" Halcyon\nsaid\n. \"These tunnels provide attackers with ephemeral and unregistered subdomains that appear trustworthy to perimeter controls, making it difficult to pre-block or blacklist.\"\n\"Because the infrastructure is spun up dynamically via legitimate services, defenders face challenges in distinguishing malicious use from authorized DevOps or IT maintenance workflows. This tactic enables threat actors to deliver payloads without relying on compromised servers or bulletproof hosting, increasing both the scale and stealth of the campaign.\"\nThe findings also follow the\ndiscovery\nof an ongoing malicious campaign that has targeted various European organizations located in Spain, Portugal, Italy, France, Belgium, and the Netherlands with invoice-themed phishing lures to deliver a named Sorillus RAT (aka\nRatty RAT\n).\nPrevious campaigns distributing the malware have singled out\naccounting and tax professionals\nusing income\ntax return decoys\n, some of which have leveraged HTML smuggling techniques to conceal the malicious payloads.\nThe attack chain detailed by Orange Cyberdefense employs similar phishing emails that aim to trick recipients into opening PDF attachments containing a OneDrive link that points to a PDF file directly hosted on the cloud storage service while prompting the user to click an \"Open the document\" button.\nDoing so redirects the victim to a malicious web server that acts as a traffic distribution system (TDS) to evaluate the incoming request and determine whether they need to proceed further to the next stage of the infection. If the victim's machine meets the necessary criteria, they are displayed a benign PDF while a JAR file is stealthily downloaded to drop and execute Sorillus RAT.\nA Java-based RAT that first surfaced in 2019, Sorillus is a cross-platform malware that can harvest sensitive information, download/upload files, take screenshots, record audio, log keystrokes, run arbitrary commands, and even uninstall itself. It also doesn't help that numerous racked versions of the trojan are available online.\nThe attacks are assessed to be part of a broader campaign that has been observed delivering\nSambaSpy\nto users in Italy. SambaSpy, per Orange Cyberdefense, belongs to the Sorillus malware family.\n\"The operation showcases a strategic blend of legitimate services – such as OneDrive, MediaFire, and tunneling platforms like Ngrok and LocaltoNet – to evade detection,\" the cybersecurity company said. \"The repeated use of Brazilian Portuguese in payloads supports a likely attribution to Brazilian-speaking threat actors.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "CISA Warns of Active Exploitation of Linux Kernel Privilege Escalation Vulnerability",
        "Link": "https://thehackernews.com/2025/06/cisa-warns-of-active-exploitation-of.html",
        "Summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Tuesday placed a security flaw impacting the Linux kernel in its Known Exploited Vulnerabilities (KEV) catalog, stating it has been actively exploited in the wild.\nThe vulnerability, CVE-2023-0386 (CVSS score: 7.8), is an improper ownership bug in the Linux kernel that could be exploited to escalate privileges on susceptible",
        "Date": "2025-06-18",
        "Content": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Tuesday\nplaced\na security flaw impacting the Linux kernel in its Known Exploited Vulnerabilities (\nKEV\n) catalog, stating it has been actively exploited in the wild.\nThe vulnerability,\nCVE-2023-0386\n(CVSS score: 7.8), is an improper ownership bug in the Linux kernel that could be exploited to escalate privileges on susceptible systems. It was patched in early 2023.\n\"Linux kernel contains an improper ownership management vulnerability, where unauthorized access to the execution of the setuid file with capabilities was found in the Linux kernel's OverlayFS subsystem in how a user copies a capable file from a nosuid mount into another mount,\" the agency said.\n\"This uid mapping bug allows a local user to escalate their privileges on the system.\"\nIt's currently not known how the security flaw is being exploited in the wild. In a report published in May 2023, Datadog said the vulnerability is trivial to exploit and that it works by tricking the kernel into creating a SUID binary owned by root in a folder like \"/tmp\" and executing it.\n\"CVE-2023-0386 lies in the fact that when the kernel copied a file from the overlay file system to the 'upper' directory, it did not check if the user/group owning this file was mapped in the current user namespace,\" the company\nsaid\n.\n\"This allows an unprivileged user to smuggle an SUID binary from a 'lower' directory to the 'upper' directory, by using OverlayFS as an intermediary.\"\nLater that year, cloud security firm Wiz detailed two security vulnerabilities dubbed\nGameOver(lay)\n(CVE-2023-32629 and CVE-2023-2640) affecting Ubuntu systems that led to similar consequences as CVE-2023-0386.\n\"These flaws allow the creation of specialized executables, which, upon execution, grant the ability to escalate privileges to root on the affected machine,\" Wiz researchers said.\nFederal Civilian Executive Branch (FCEB) agencies are required to apply the necessary patches by July 8, 2025, to secure their networks against active threats.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Ex-CIA Analyst Sentenced to 37 Months for Leaking Top Secret National Defense Documents",
        "Link": "https://thehackernews.com/2025/06/ex-cia-analyst-sentenced-to-37-months.html",
        "Summary": "A former U.S. Central Intelligence Agency (CIA) analyst has been sentenced to little more than three years in prison for unlawfully retaining and transmitting top secret National Defense Information (NDI) to people who were not entitled to receive them and for attempting to cover up the malicious activity.\nAsif William Rahman, 34, of Vienna, has been sentenced today to 37 months on charges of",
        "Date": "2025-06-18",
        "Content": "A former U.S. Central Intelligence Agency (CIA) analyst has been\nsentenced\nto little more than three years in prison for unlawfully retaining and transmitting top secret National Defense Information (NDI) to people who were not entitled to receive them and for attempting to cover up the malicious activity.\nAsif William Rahman, 34, of Vienna, has been sentenced today to 37 months on charges of stealing and divulging classified information. He was an employee of the CIA since 2016 and had Top Secret security clearance to access Sensitive Compartmented Information (SCI) until he was terminated from his job after he was arrested last November in Cambodia.\nEarlier this January, Rahman pleaded guilty to two counts of willful retention and transmission of classified information related to the national defense.\nAs previously\nreported\nby The Hacker News, Rahman retained multiple Secret and Top Secret documents without authorization on October 17, 2024, took them to his place of residence in a backpack, and wilfully sent them to several individuals who did not have the necessary clearance to receive them.\n\"The defendant photographed the documents and transferred those images to a computer program that allowed him to edit the images to attempt to conceal their source and delete his activity,\" according to court documents. \"The defendant also took steps to conceal his identity while unlawfully sharing classified information with others.\"\nSome of these documents were related to Israel's plans to attack Iran around that time. They eventually began circulating online after they were posted on Telegram by an account called Middle East Spectator.\nTo cover up these acts, Rahman engaged in what the U.S. Department of Justice (DoJ) described as a \"deletion campaign of work product\" on his computer, wiping roughly 1.5 GB of data from his email and personal folder on his system. He also deleted and edited certain journal entries to conceal his personal opinions on U.S. policy.\n\"Asif Rahman violated his position of trust by illegally accessing, removing, and transmitting Top Secret documents vital to the national security of the United States and its allies,\" said Erik S. Siebert, U.S. Attorney for the Eastern District of Virginia.\n\"The urgency with which Mr. Rahman was identified, arrested, charged, and prosecuted is a testament to the commitment and professionalism of the investigators and prosecutors who brought him to justice. This case should serve as a stern warning to those who choose to place their own goals over their allegiance to our nation.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Veeam Patches CVE-2025-23121: Critical RCE Bug Rated 9.9 CVSS in Backup & Replication",
        "Link": "https://thehackernews.com/2025/06/veeam-patches-cve-2025-23121-critical.html",
        "Summary": "Veeam has rolled out patches to contain a critical security flaw impacting its Backup &amp; Replication software that could result in remote code execution under certain conditions.\nThe security defect, tracked as CVE-2025-23121, carries a CVSS score of 9.9 out of a maximum of 10.0.\n\"A vulnerability allowing remote code execution (RCE) on the Backup Server by an authenticated domain user,\" the",
        "Date": "2025-06-18",
        "Content": "Veeam has rolled out patches to contain a critical security flaw impacting its Backup & Replication software that could result in remote code execution under certain conditions.\nThe security defect, tracked as CVE-2025-23121, carries a CVSS score of 9.9 out of a maximum of 10.0.\n\"A vulnerability allowing remote code execution (RCE) on the Backup Server by an authenticated domain user,\" the company\nsaid\nin an advisory.\nCVE-2025-23121 impacts all earlier version 12 builds, including 12.3.1.1139. It has been addressed in version 12.3.2 (build 12.3.2.3617). Security researchers at CODE WHITE GmbH and watchTowr have been credited with discovering and reporting the vulnerability.\nCybersecurity company Rapid7\nnoted\nthat the update likely addresses\nconcerns\nshared by CODE WHITE in late March 2025 that the patch put in place to plug a similar hole (\nCVE-2025-23120\n, CVSS score: 9.9) could be bypassed.\nAlso addressed by Veeam is another flaw in the same product (CVE-2025-24286, CVSS score: 7.2) that allows an authenticated user with the Backup Operator role to modify backup jobs, which could result in arbitrary code execution.\nThe American company separately patched a vulnerability that affected Veeam Agent for Microsoft Windows (CVE-2025-24287, CVSS score: 6.1) that permits local system users to modify directory contents, leading to code execution with elevated permissions. The issue has been patched in version 6.3.2 (build 6.3.2.1205).\nAccording to Rapid7,\nmore than 20% of its incident response cases\nin 2024 involved either the access or exploitation of Veeam, once a threat actor has already established a foothold in the target environment.\nWith security flaws in Veeam backup software\nbecoming a prime target for attackers\nin recent years, it's crucial that customers update to the latest version of the software with immediate effect.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Iran Slows Internet to Prevent Cyber Attacks Amid Escalating Regional Conflict",
        "Link": "https://thehackernews.com/2025/06/iran-restricts-internet-access-to.html",
        "Summary": "Iran has throttled internet access in the country in a purported attempt to hamper Israel's ability to conduct covert cyber operations, days after the latter launched an unprecedented attack on the country, escalating geopolitical tensions in the region.\nFatemeh Mohajerani, the spokesperson of the Iranian Government, and the Iranian Cyber Police, FATA, said the internet slowdown was designed to",
        "Date": "2025-06-18",
        "Content": "Iran has throttled internet access in the country in a purported attempt to hamper Israel's ability to conduct covert cyber operations, days after the latter launched an unprecedented attack on the country, escalating geopolitical tensions in the region.\nFatemeh Mohajerani, the spokesperson of the Iranian Government, and the Iranian Cyber Police, FATA,\nsaid\nthe\ninternet slowdown\nwas\ndesigned\nto maintain internet stability and that the move is \"temporary, targeted, and controlled, to ward off cyber attacks.\" Data\nshared\nby NetBlocks shows a \"significant reduction in internet traffic\" around 5:30 p.m. local time.\nThe development comes amid deepening conflict, with Israel and Iran trading missile attacks since Friday. These attacks have spilled over into cyberspace, as security experts warned of retaliatory cyber operations by Iranian state actors and hacktivist groups.\nThe digital warfare unfolding behind the scenes goes two ways. Earlier this week, a pro-Israeli group known as\nPredatory Sparrow\nclaimed responsibility for a cyber attack on Iran's Bank Sepah,\ncrippling access\nto its website and ATMs.\n\"'Bank Sepah' was an institution that\ncircumvented international sanctions\nand used the people of Iran's money to finance the regime's terrorist proxies, its ballistic missile program, and its military nuclear program,\" the group\nsaid\nin a public statement posted on X.\nPredatory Sparrow also said it sabotaged the bank's infrastructure with help from \"brave Iranians,\" adding \"this is what happens to institutions dedicated to maintaining the dictator's terrorist fantasies.\" Israel has a storied history of\nsophisticated\ncyber operations\n, most notably the\nStuxnet\nattack targeting Iran's nuclear program.\nTel Aviv-based cybersecurity firm Radware\nsaid\nit has observed heightened activity from threat actors affiliated with Iran across public and private Telegram channels.\nSome of the groups, including Mysterious Team Bangladesh and Arabian Ghost, have warned neighboring countries Jordan and Saudi Arabia against supporting Israel and claimed to have shut down Israeli radio stations.\nFurthermore, the Iranian government has urged citizens to delete WhatsApp, one of the country's most popular messaging platforms, stating without giving any evidence that the Meta-owned app has been weaponized by Israel to spy on its users.\nWhatsApp has denied the allegations. In a\nstatement\nto the Associated Press, the company said it does not track users nor does it provide \"bulk information to any government.\"\nThe cyber conflict also follows an announcement from the U.S. Department of State that they were seeking information on Iranian hackers who they accused of targeting critical infrastructure in the U.S., Israel, and other countries using the\nIOCONTROL\n(aka OrpaCrab) malware to breach Industrial Control Systems (ICS).\n\"Cyber Av3ngers, which is associated with the online persona Mr. Soul, has launched a series of malicious cyber activities against U.S. critical infrastructure on behalf of Iran's Islamic Revolutionary Guard Corps Cyber-Electronic Command (IRGC-CEC),\" the department's Rewards for Justice (RFJ) program\nsaid\n.\n\"Cyber Av3ngers actors have utilized malware known as IOCONTROL to target ICS/SCADA devices used by critical infrastructure sectors in the United States and worldwide.\"\nUpdate\nOn June 18, Predatory Sparrow\nsaid\nit was behind a cyber attack on Iranian cryptocurrency exchange Nobitex. The hacktivist collective also said they would publish the platform's source code and data from its internal network within 24 hours.\n\"The Nobitex exchange is at the heart of the regime's efforts to finance terror around the world,\" the group said. \"This exchange is the regime's most popular tool for circumventing international sanctions.\"\nIn a security alert, Nobitex\nsaid\nit suspended all access after it detected \"signs of unauthorized access to a portion of our reporting infrastructure and hot wallet.\" It further reassured users that all of their assets are secure and that it would compensate for all damages.\nAccording to blockchain investigator ZachXBT, around $81.7 million worth of digital assets were\nstolen\nfrom the exchange across Tron, EVM and BTC chains. \"The attacker used the vanity address TKFuckiRGCTerroristsNoBiTEXy2r7mNX,\" ZachXBT\nsaid\nin a post on Telegram.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Pro-Israel hackers hit Iran's Nobitex exchange, burn $90M in crypto",
        "Link": "https://www.bleepingcomputer.com/news/security/pro-israel-hackers-hit-irans-nobitex-exchange-burn-90m-in-crypto/",
        "Summary": "The pro-Israel \"Predatory Sparrow\" hacking group claims to have stolen over $90 million in cryptocurrency from Nobitex, Iran's largest crypto exchange, and burned the funds in a politically motivated cyberattack. [...]",
        "Date": "2025-06-18",
        "Content": "The pro-Israel \"Predatory Sparrow\" hacking group claims to have stolen over $90 million in cryptocurrency from Nobitex, Iran's largest crypto exchange, and burned the funds in a politically motivated cyberattack.\nThe attack occurred on June 18, 2025, with Nobitex\nfirst reporting the breach\non X at 2:24 AM EST.\n\"This morning, June 19, our technical team detected signs of unauthorized access to a portion of our reporting infrastructure and hot wallet,\" reads Nobitex's post.\n\"Immediately upon detection, all access was suspended and our internal security teams are closely investigating the extent of the incident.\"\nSoon after, Predatory Sparrow\nclaimed responsibility\nfor the attack through their Gonjeshke Darande X account, promising to publish the company's source code and internal information stolen during the cyberattack. Nobitex's website has remained offline since the attack.\n\"After the IRGC's 'Bank Sepah' comes the turn of Nobitex. WARNING! In 24 hours, we will release Nobitex's source code and internal information from their internal network. Any assets that remain there after that point will be at risk,\" reads Predatory Sparrow's post.\n\"The Nobitex exchange is at the heart of the regime's efforts to finance terror worldwide, as well as being the regime's favorite sanctions violation tool. We, 'Gonjeshke Darande,' conducted cyberattacks against Nobitex.\"\nBlockchain analysis firm\nElliptic reports\nthat more than $90 million in crypto was drained from Nobitex's wallets and funneled into addresses controlled by the hackers.\nHowever, instead of attempting to capitalize on the breach and keep the stolen crypto for themselves, the hacking group sent nearly all of the crypto to vanity addresses, which are cryptographic wallet addresses with embedded anti-Islamic Republic Guard Corps (IRGC) messages such as \"F*ckIRGCterrorists.\"\nThese vanity addresses require a lot of computational power to generate with usable private keys, and according to Elliptic, the creation of such long string names in a vanity address is \"computationally infeasible.\" This means the hackers intentionally burnt the crypto so that no one could gain access to it again.\n\"The hack also does not appear to be financially motivated,\" explains Elliptic.\n\"The vanity addresses used by the hackers are generated through \"brute force\" methods - involving the creation of large numbers of cryptographic key pairs until one contains the desired text. But creating vanity addresses with text strings as long as those used in this hack is computationally infeasible.\"\nElliptic reports that their investigations into Nobitex also show ties to the IRGC and Iranian leadership.\nOther researchers\npreviously linked\nthe exchange to relatives of Supreme Leader Ali Khamenei, IRGC-affiliated business interests, and\nsanctioned individuals\n, who have reportedly used Nobitex to move funds generated from the\nDiskCryptor and BitLocker\nransomware operations.\nThe Predatory Sparrow hacktivist group\nbreached the Iran-controlled Bank Sepah\na day before the Nobitex attack and also focused on disruption and damage rather than financial gain.\nThese attacks come as\nIran increasingly isolates itself from the global Internet\nto reduce the risk of escalating cyberattacks on its infrastructure.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nHacker steals $223 million in Cetus Protocol cryptocurrency heist\nIsrael arrests new suspect behind Nomad Bridge $190M crypto hack\nUS charges 12 more suspects linked to $230 million crypto theft\nGrinex exchange suspected rebrand of sanctioned Garantex crypto firm\nNorth Korean hackers deepfake execs in Zoom call to spread Mac malware"
    },
    {
        "Title": "North Korean hackers deepfake execs in Zoom call to spread Mac malware",
        "Link": "https://www.bleepingcomputer.com/news/security/north-korean-hackers-deepfake-execs-in-zoom-call-to-spread-mac-malware/",
        "Summary": "North Korean advanced persistent threat (APT) 'BlueNoroff' (aka 'Sapphire Sleet' or 'TA444') are using deepfake company executives during fake Zoom calls to trick employees into installing custom malware on their computers. [...]",
        "Date": "2025-06-18",
        "Content": "The North Korean BlueNoroff hacking group is deepfaking company executives during Zoom calls to trick employees into installing custom malware on their macOS devices.\nBlueNoroff (aka Sapphire Sleet or TA444) is a North Korean advanced persistent threat (APT) group known for conducting cryptocurrency theft attacks using Windows and Mac malware.\nHuntress researchers uncovered a new BlueNoroff attack on June 11, 2025, when they were called to investigate a potential intrusion on a partner's network.\nLike previous attacks, the primary goal was most likely cryptocurrency theft, which aligns with other recent reports about the threat actors from\nSentinelLabs\n,\nMicrosoft\n,\nJamf\n, and\nKaspersky\n.\nZoom attacks\nThe target, an employee at a tech firm, was contacted by the attackers on Telegram, who posed as external professionals requesting a meeting.\nThe attacker sent a message containing a Calendly link for what appeared to be a Google Meet session, but the invite link was actually a fake Zoom domain controlled by the attackers.\nThis tactic is similar to a campaign\ndiscovered by Trail of Bits\nin April, who attributed it to the North Korean activity cluster 'Elusive Comet.'\nWhen the employee attended the meeting, which was actually a Zoom meeting, it included deepfake videos of recognizable senior leadership from the employee's company and various external participants to add credibility.\nDuring the meeting, the victim encountered issues with their microphone, which didn't work, seemingly due to technical problems. The deepfakes advised the victim to download a supposed Zoom extension that would fix the problem.\nThe link provided via Telegram led the victim to download an AppleScript file (zoom_sdk_support.scpt).\nMalicious AppleScript script sent as a fix for microphone issues\nSource: Huntress\nUpon execution, the file opens a legitimate Zoom SDK webpage, but after parsing 10,500 blank lines, it executes a malicious command that downloads a secondary payload from an external source (https[://]support[.]us05webzoom[.]biz) and executes it.\nBy the time Huntress was called to investigate, the final payload had been pulled from the attacker-controlled domain. However, they were able to find a version on VirusTotal that provided some insight.\n\"The script begins by disabling bash history logging and then checks if Rosetta 2, which allows Apple Silicon Macs to run x86_64 binaries, is installed,\" explains Huntress' report.\n\"If it isn’t, it silently installs it to ensurex86_64 payloads can run. It then creates a file called .pwd, which is hidden from the user’s view due to the period prepending it and downloads the payload from the malicious, fake Zoom page to /tmp/icloud_helper.\"\nOverall, the reseachers found eight distinct malicious binaries on the host compromised in this attack.\nExcluding minor tools used in process injection and implant decryption, the Mac malware used in the campaign were:\nTelegram 2\n– Nim-based persistence implant disguised as a legitimate Telegram updater. It runs on a schedule and acts as the entry point for the rest of the malware chain. The binary is signed with a valid Telegram developer certificate, helping it evade scrutiny and remain undetected.\nRoot Troy V4\n– Go-based backdoor that enables remote code execution, command queuing during sleep states, and downloading of additional payloads. It serves as the central controller for post-infection operations and maintains the malware's configuration and state.\na (InjectWithDyld)\n– A second-stage loader that decrypts encrypted implants using a password-derived AES key and injects them into memory. It uses macOS-specific APIs for process injection and includes antiforensic functionality to wipe traces of itself after use.\nXScreen (keyboardd)\n– Surveillance component that logs keystrokes, records the screen, and monitors the clipboard. It operates continuously in the background and sends collected data to a command-and-control server.\nCryptoBot (airmond)\n– Cryptocurrency-focused infostealer written in Go. It targets over 20 wallet platforms, extracting sensitive data and storing it in a local encrypted cache for exfiltration.\nThe intrusion discovered by Huntress reflects the growing sophistication of BlueNoroff, who now leverages AI deepfakes for social engineering and custom macOS malware.\nHuntress warns that many Mac users have been lulled into thinking they're less likely to be targeted by malware.\nHowever, as macOS gains broader adoption in the enterprise, threat actors increasingly develop malware that targets the operating system.\nRecent campaigns, ranging from\nwidespread infostealers\nand\ndrainers aimed at crypto theft\nto advanced,\ntargeted attacks on organizations\nlike this, make it clear that macOS users must be better prepared and protected.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nHackers use fake Ledger apps to steal Mac users’ seed phrases\nHackers abuse Zoom remote control feature for crypto-theft attacks\nDark Partners cybercrime gang fuels large-scale crypto heists\nApple fixes WebKit zero-day exploited in ‘extremely sophisticated’ attacks\nInstagram ads mimicking BMO, EQ Banks are finance scams"
    },
    {
        "Title": "Microsoft 365 to block file access via legacy auth protocols by default",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-365-to-block-file-access-via-legacy-auth-protocols-by-default/",
        "Summary": "Microsoft has announced that it will soon update security defaults for all Microsoft 365 tenants to block access to SharePoint, OneDrive, and Office files via legacy authentication protocols. [...]",
        "Date": "2025-06-18",
        "Content": "Microsoft has announced that it will start updating security defaults for all Microsoft 365 tenants in July to block access to SharePoint, OneDrive, and Office files via legacy authentication protocols.\nThese changes will also address application access permissions that can expose organizations to unnecessary security risks. The rollout is set to begin in mid-July 2025, with an estimated completion date by August 2025.\nMicrosoft will enable them by default for all Microsoft 365 tenants, across Microsoft Entra, Microsoft 365 apps, SharePoint Online, and Microsoft OneDrive, with no additional licensing required.\nAs the company explained in a Microsoft 365 admin center message\non Tuesday\n, Microsoft 365 will automatically block legacy browser authentication to SharePoint and OneDrive using RPS (Relying Party Suite) after the changes roll out, together with FPRPC (FrontPage Remote Procedure Call) protocol for Office file opens.\n\"Legacy authentication protocols like RPS (Relying Party Suite) are vulnerable to brute-force and phishing attacks due to non-modern authentication. Blocking this prevents applications that are using outdated methods from accessing SharePoint and OneDrive via browser,\" the company explained.\n\"FrontPage Remote Procedure Call (FPRPC) is a legacy protocol used for remote web page authoring. While no longer widely used, Legacy protocols such as FPRPC can be more susceptible to compromise and blocking FPRPC helps reduce exposure to vulnerabilities. With this change, FPRPC will be blocked for opening files, preventing the use of this non-modern protocol in Microsoft 365 clients.\"\nAfter the new security defaults roll out, Microsoft 365 tenants will also require admin consent for third-party apps to access files and sites, preventing users from overexposing their organization's content.\nWith this change, Microsoft-managed App Consent Policies will prevent users from consenting to third-party applications accessing their files and sites by default until they have admin approval.\nFor configuring admin consent, you can refer to\nthis Microsoft Entra support document\n. They can also configure granular access policies for specific users or groups, as detailed\nhere\n.\n\"As part of the Microsoft Secure Future Initiative (SFI) and in alignment with the 'Secure by Default' principle, we are updating default settings in Microsoft 365 to help you meet the minimum security benchmark and harden your tenant's security posture,\" Redmond added.\n\"This is the first step in a broader effort to evaluate and evolve Microsoft 365 defaults through the lens of security best practices.\"\nSince the start of the year, the company has also begun\ndisabling all ActiveX controls\nin Windows versions of Microsoft 365 and Office 2024 applications and said it will start rolling out a new Teams feature designed to\nblock screenshots during meetings\nin July.\nMore recently, Microsoft\nannounced\nlast week it will add .library-ms and .search-ms file types to the list of blocked Outlook attachments starting next month.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMicrosoft blocks ActiveX by default in Microsoft 365, Office 2024\nMicrosoft confirms auth issues affecting Microsoft 365 users\nMicrosoft Teams will soon block screen capture during meetings\nMicrosoft makes all new accounts passwordless by default\nChainLink Phishing: How Trusted Domains Become Threat Vectors"
    },
    {
        "Title": "'Stargazers' use fake Minecraft mods to steal player passwords",
        "Link": "https://www.bleepingcomputer.com/news/security/stargazers-use-fake-minecraft-mods-to-steal-player-passwords/",
        "Summary": "A large-scale malware campaign specifically targets Minecraft players with malicious mods and cheats that infect Windows devices with infostealers that steal credentials, authentication tokens, and cryptocurrency wallets. [...]",
        "Date": "2025-06-18",
        "Content": "A large-scale malware campaign specifically targets Minecraft players with malicious mods and cheats that infect Windows devices with infostealers that steal credentials, authentication tokens, and cryptocurrency wallets.\nThe campaign,\ndiscovered by Check Point Research\n, is conducted by the Stargazers Ghost Network and leverages the Minecraft massive modding ecosystem and legitimate services like GitHub to reach a large audience of potential targets.\nCheck Point has seen thousands of views, or hits, on Pastebin links used by the threat actors to deliver payloads to targets' devices, indicating the broad reach of this campaign.\nStealthy Minecraft malware\nThe Stargazers Ghost Network is a distribution-as-a-service (DaaS) operation active on GitHub since last year, first documented by Check Point in a campaign involving\n3,000 accounts\nspreading infostealers.\nThe same operation, which is boosted by\nfake GitHub stars\n, was observed\ninfecting over 17,000 systems\nin late 2024 with a novel Godot-based malware.\nThe latest campaign described by Check Point researchers Jaromír Hořejší and Antonis Terefos targets Minecraft with Java malware that evades detection by all anti-virus engines.\nThe researchers found multiple GitHub repositories run by Stargazers, disguised as Minecraft mods and cheats like Skyblock Extras, Polar Client, FunnyMap, Oringo, and Taunahi.\n\"We have identified approximately 500 GitHub repositories, including those that are forked or copied, which were part of this operation aimed at Minecraft players,\" Antonis Terefos told BleepingComputer.\n\"We've also seen 700 stars produced by approximately 70 accounts.\"\nFour repositories participating in this operation\nSource: Check Point\nOnce executed within Minecraft, the first-stage JAR loader downloads the next stage from Pastebin using a base64 encoded URL, fetching a Java-based stealer.\nThis stealer targets Minecraft account tokens and user data from the Minecraft launcher and popular third-party launchers like Feather, Lunar, and Essential.\nIt also attempts to steal Discord and Telegram account tokens, sending the stolen data via HTTP POST requests to the attacker's server.\nThe Java stealer also serves as a loader for the next stage, a .NET-based stealer called '44 CALIBER,' which is a more \"traditional\" info stealer, attempting to snatch information stored in web browsers, VPN account data, cryptocurrency wallets, Steam, Discord, and other apps.\nOverview of the infection chain\nSource: Check Point\n44 CALIBER also collects system information and clipboard data and can grab screenshots of the victim's computer.\n\"After deobfuscation we can observe that it steals various credentials from browsers (Chromium, Edge, Firefox), files (Desktop, Documents, %USERPROFILE%/Source), Cryptocurrency wallets (Armory, AtomicWallet, BitcoinCore, Bytecoin, DashCore, Electrum, Ethereum, LitecoinCore, Monero, Exodus, Zcash, Jaxx), VPNs (ProtonVPN, OpenVPN, NordVPN), Steam, Discord, FileZilla, Telegram,\" warns the researchers.\nThe stolen data is exfiltrated via Discord webhooks, accompanied by Russian comments. This clue, combined with UTC+3 commit timestamps, suggests that the operators of this campaign are Russian.\nCheck Point has shared the full indicators of compromise (IoCs) at the bottom of its report to help detect and block the threat.\nTo stay safe against this and similar campaigns, Microsoft players should only download mods from reputable platforms and verified community portals and stick to trusted publishers.\nIf prompted to download from GitHub, check the number of starts, forks, and contributors, scrutinize commits for signs of fake activity, and check recent actions on the repository.\nUltimately, it is prudent to use a separate \"burner\" Minecraft account when testing mods and avoid logging into your main account.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nDiscord flaw lets hackers reuse expired invites in malware campaign\nOperation Secure disrupts global infostealer malware operations\n‘Russian Market’ emerges as a go-to shop for stolen credentials\nTikTok videos now push infostealer malware in ClickFix attacks\nLumma infostealer malware operation disrupted, 2,300 domains seized"
    },
    {
        "Title": "ChainLink Phishing: How Trusted Domains Become Threat Vectors",
        "Link": "https://www.bleepingcomputer.com/news/security/chainlink-phishing-how-trusted-domains-become-threat-vectors/",
        "Summary": "Phishing has evolved—and trust is the new attack vector. ChainLink Phishing uses real platforms like Google Drive & Dropbox to sneak past filters and steal credentials in the browser. Watch Keep Aware's on-demand webinar to see how these attacks work—and how to stop them. [...]",
        "Date": "2025-06-18",
        "Content": "Phishing remains one of cybersecurity’s most enduring threats, not because defenders aren’t evolving, but because attackers are adapting even faster.\nToday’s most effective campaigns aren’t just built on spoofed emails or shady domains. They exploit something far more insidious: trust in the tools and services we use every day, leading to zero-hour phishing.\nThe Rise of ChainLink Phishing\nTraditional phishing relied on easily identifiable red flags such as suspicious senders and questionable URLs. But modern phishing has matured.\nAttackers now deploy\nchained sequences\n, funneling a victim from email through trusted infrastructure before harvesting credentials.\nAn employee might receive a link from what appears to be Google Drive or Dropbox. At first glance, there’s nothing unusual. But after the initial click, the user is quietly routed through a series of prompts, each looking credible on reputable sites, until they unknowingly hand over business-essential credentials to an attacker.\nThis technique, which we call\nChainLink Phishing\n, relies on leveraging the legitimate platforms and reputable domains that enterprise tools allow and that IT security teams are oblivious to.\nBrowser Phishing Protection With Keep Aware\nKeep Aware stops phishing attacks in real-time where they start: inside the browser.\nBy analyzing user behavior, form submissions, and site context, not just URLs, Keep Aware shuts down threats before credentials ever leave the page. Equip your security team with precise visibility, policy enforcement, and immediate threat response all from within the existing web browsers across the organization.\nRequest a Demo\nWhy These Attacks Are So Effective\nThe browser has become the center of the knowledge worker’s universe. From code reviews to HR tasks, nearly every action begins and ends in a browser tab.\nThis centralization gives attackers a singular surface to exploit, yet it has been vastly underprotected.\nEven the most security-aware employees can be deceived when a link appears to come from a known domain and follows the expected behavior. The user often believes they’re engaging in normal activity until it’s too late.\nBy using legitimate links, passing email authentication checks, and even inserting CAPTCHAs along the way, attackers sidestep traditional defenses and enable zero-hour phishing to succeed undetected.\nCAPTCHAs and verification steps are now so common in everyday browsing that attackers exploit them as social engineering tactics, not only in phishing campaigns, but also in other\nbrowser-based threats like ClickFix\n.\nExample of ChainLink Phishing Leveraging Compromised Domain, CAPTCHA, and Email Validation\n“Known Good” Is No Longer Safe\nThis shift highlights a painful truth:\n“known good” is no longer a reliable security signal\n. In fact, it’s become the perfect disguise for bad actors.\nTo truly address threats like ChainLink Phishing, we need to move beyond static blocklists and domain-based filtering. The future of phishing protection lies in real-time analysis of web pages and users’ interactions with them.\nSome of the legitimate platforms used in ChainLink Phishing attacks\nWhen the Security Stack Can’t See the Threat\nA phishing link that originates from a trusted service will often sail past email and network filters. Traffic to the phishing site is allowed unimpeded because the domain isn’t on an intel feed and its reputation is undamaged. And since no malware is deployed, just credential harvesting, endpoint tools have nothing to detect.\nDespite having layered defenses like:\nSecure email gateways (SEGs)\nDNS filtering\nSecure web gateways (SWGs)\nEDR/AV\nNative browser protections\n… Most organizations remain vulnerable. Why? Because these tools are designed to block known malicious web behavior and endpoint solutions are oblivious to credential-harvesting web forms. The subtle misuse of legitimate domains, combined with additional evasive techniques, leads to users falling victim to zero-hour phishing.\nDefend Where Phishing Really Strikes\nThese sequenced attacks exploit trusted pathways, leading users to phishing sites that easily bypass traditional defenses. By the time credentials are entered, it’s often too late—and most organizations never saw it coming. To effectively mitigate these threats, security needs to shift to where the risk materializes:\nthe browser\n. It’s time to stop phishing at the root source, not just at the perimeter.\nTo understand how these chained phishing sequences work, and how to detect and stop them before damage is done, watch Keep Aware’s latest on-demand webinar:\nChainLink Phishing: The Chained Sequences of Modern Phishing\nSponsored and written by\nKeep Aware\n."
    },
    {
        "Title": "CISA warns of attackers exploiting Linux flaw with PoC exploit",
        "Link": "https://www.bleepingcomputer.com/news/security/cisa-warns-of-attackers-exploiting-linux-flaw-with-poc-exploit/",
        "Summary": "CISA has warned U.S. federal agencies about attackers targeting a high-severity vulnerability in the Linux kernel's OverlayFS subsystem that allows them to gain root privileges. [...]",
        "Date": "2025-06-18",
        "Content": "CISA has warned U.S. federal agencies about attackers targeting a high-severity vulnerability in the Linux kernel's OverlayFS subsystem that allows them to gain root privileges.\nThis local privilege escalation security flaw (\nCVE-2023-0386\n) is caused by a Linux kernel improper ownership management weakness and was patched in\nJanuary 2023\nand publicly disclosed\ntwo months later\n.\nMultiple proof-of-concept (PoC) exploits were also shared on GitHub starting in May 2023, making exploitation attempts easier to pull off and pushing the vulnerability to the top of Linux admins' patching priority lists.\nAccording to an\nanalysis\nby Datadog Security Labs, CVE-2023-0386 is trivial to exploit and impacts a wide range of Linux distributions, including popular ones like Debian, Red Hat, Ubuntu, and Amazon Linux, if they're using a kernel version lower than 6.2.\n\"Linux Kernel contains an improper ownership management vulnerability, where unauthorized access to the execution of the setuid file with capabilities was found in the Linux kernel's OverlayFS subsystem in how a user copies a capable file from a nosuid mount into another mount,\" CISA\nexplains\n. \"This uid mapping bug allows a local user to escalate their privileges on the system.\"\n​As mandated by the November 2021 Binding Operational Directive (BOD) 22-01, U.S. federal agencies now must secure their networks against ongoing attacks targeting the CVE-2023-0386 flaw added to CISA's Known Exploited Vulnerabilities catalog.\nThe cybersecurity agency has given Federal Civilian Executive Branch (FCEB) agencies three weeks to patch their Linux systems by July 8.\n\"These types of vulnerabilities are frequent attack vectors for malicious cyber actors and pose significant risks to the federal enterprise,\" CISA\nsaid\nin an advisory that tags CVE-2023-0386 as actively exploited for the first time since it was patched.\nOn Tuesday, security researchers with the Qualys Threat Research Unit (TRU)\nalso warned\nthat threat actors could exploit two recently patched local privilege escalation (LPE) vulnerabilities to get root on systems running major Linux distributions.\nQualys TRU developed proof-of-concept exploits and successfully targeted CVE-2025-6019 to gain root privileges on Debian, Ubuntu, Fedora, and openSUSE systems.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nCritical Langflow RCE flaw exploited to hack AI app servers\nNew Linux udisks flaw lets attackers get root on major Linux distros\nHacker selling critical Roundcube webmail exploit as tech info disclosed\nOver 84,000 Roundcube instances vulnerable to actively exploited flaw\nCisco warns of ISE and CCP flaws with public exploit code"
    },
    {
        "Title": "Healthcare SaaS firm says data breach impacts 5.4 million patients",
        "Link": "https://www.bleepingcomputer.com/news/security/episource-says-data-breach-impacts-54-million-patients/",
        "Summary": "Episource warns of a data breach after hackers stole health information of over 5 million people in the United States in a January cyberattack. [...]",
        "Date": "2025-06-18",
        "Content": "Episource warns of a data breach after hackers stole health information of over 5 million people in the United States in a January cyberattack.\nEpisource is an American healthcare services company that provides risk adjustment, medical coding, data analytics, and technology solutions to health plans and providers. They help insurers optimize payments and compliance in government programs like Medicare Advantage.\nIn a data breach notification on its website, Episource says it detected unusual activity on its systems on February 6, 2025. An investigation revealed that hackers accessed and exfiltrated sensitive data stored on these systems between January 27 and the time of the discovery.\n\"We learned from our investigation that a cybercriminal was able to see and take copies of some data in our computer systems,\"\nexplains Episource\n.\n\"This happened between January 27, 2025 and February 6, 2025.  To date, we are not aware of any misuse of the data.\"\nThe exposed data varied per individual but may include one or more of the following data types:\nFull name\nPhysical address\nEmail address\nPhone number\nInsurance plan information\nMedicaid ID and information\nMedical record details (diagnoses, test results, medications, images, treatments)\nDate of birth\nSocial Security number (SSN)\nThe statement underlines that no banking or payment card information has been exposed due to this incident.\nA filing at the U.S. Department of Health and Human Services Office for Civil Rights's\nbreach portal\nsays the cyberattack impacted 5,418,866 people.\nAlthough Episource has begun notifying impacted individuals since April 23, 2025, the number of exposed people was submitted to the authorities on June 6 and published yesterday.\nEpisource serves multiple healthcare providers and insurers, and the data exposed in this incident comes from these clients.\nThe notice does not name any specific providers whose data was involved, and Episource says not all of its clients were impacted by this incident.\nThe notifications sent to affected patients are on behalf of Episource's clients, so these people will not be receiving separate notices from the providers.\nImpacted individuals are advised to stay vigilant against unsolicited communications, review their benefits statement for services they didn't receive, and monitor bank and credit card statements for suspicious activity.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nM&S says customer data stolen in cyberattack, forces password resets\nAscension says recent data breach affects over 430,000 patients\nYale New Haven Health data breach affects 5.5 million patients\nScania confirms insurance claim data breach in extortion attempt\nHacker steals 1 million Cock.li user records in webmail data breach"
    },
    {
        "Title": "BeyondTrust warns of pre-auth RCE in Remote Support software",
        "Link": "https://www.bleepingcomputer.com/news/security/beyondtrust-warns-of-pre-auth-rce-in-remote-support-software/",
        "Summary": "BeyondTrust has released security updates to fix a high-severity flaw in its Remote Support (RS) and Privileged Remote Access (PRA) solutions that can let unauthenticated attackers gain remote code execution on vulnerable servers. [...]",
        "Date": "2025-06-18",
        "Content": "BeyondTrust has released security updates to fix a high-severity flaw in its Remote Support (RS) and Privileged Remote Access (PRA) solutions that can let unauthenticated attackers gain remote code execution on vulnerable servers.\nRemote Support is BeyondTrust's enterprise-grade remote support solution that helps IT support teams troubleshoot issues by remotely connecting to systems and devices, while Privileged Remote Access acts as a secure gateway and ensures that users can only access the specific systems and resources they're authorized to use.\nTracked as CVE-2025-5309, this Server-Side Template Injection vulnerability was discovered by\nJorren Geurts of Resillion\nin the chat feature of BeyondTrust RS/PRA.\n\"Remote Support and Privileged Remote Access components do not properly escape input intended for the template engine, leading to a potential template injection vulnerability,\" BeyondTrust\nexplained in a Monday advisory\n.\n\"This flaw may allow an attacker to execute arbitrary code in the context of the server. Notably, in the case of Remote Support, exploitation does not require authentication.\"\nBeyondTrust has patched all RS/PRA cloud systems as of June 16, 2025, and advised on-premises customers to apply the patch manually if they haven't enabled automatic updates.\nAdministrators who cannot deploy the security patches right away can mitigate the risk of exploitation for CVE-2025-5309 by enabling SAML authentication for the Public Portal. They should also enforce the use of session keys by disabling the Representative List and the Issue Submission Survey while ensuring that session keys are turned on.\nProduct\nFixed version\nRemote Support\n24.2.2 to 24.2.4 with HELP-10826-2 Patch\nRemote Support\n24.3.1 to 24.3.3 with HELP-10826-2 Patch\nRemote Support\n24.3.4 and any future 24.3.x release\nPrivileged Remote Access\n25.1.1 with HELP-10826-1 Patch\nPrivileged Remote Access\n25.1.2 and above\nPrivileged Remote Access\n24.2.2 to 24.2.4 with HELP-10826-2 Patch\nPrivileged Remote Access\n24.3.1 to 24.3.3 with HELP-10826-2 Patch\nPrivileged Remote Access\n25.1.1 with HELP-10826-1 Patch\nWhile the company didn't say this vulnerability has been exploited in the wild, other BeyondTrust RS/PRA security flaws have been targeted in attacks in recent years.\nMore recently, the company disclosed in early December that attackers\nbreached its systems\nusing two RS/PRA zero-day bugs (CVE-2024-12356 and CVE-2024-12686) and a\nPostgreSQL zero-day\n(CVE-2025-1094). They also stole an API key during the breach, which was used to compromise 17 Remote Support SaaS instances.\nLess than one month later, the U.S. Treasury Department revealed that\nits network had been hacked\n, an incident which was later\nlinked to Chinese state-backed hackers\ntracked as Silk Typhoon.\nThe Chinese cyberspies targeted\nthe Office of Foreign Assets Control (OFAC)\n, which administers trade and economic sanctions programs, and\nthe Committee on Foreign Investment in the United States (CFIUS)\n, which reviews foreign investments for national security risks.\nSilk Typhoon is believed to have accessed the Treasury's BeyondTrust instance to steal unclassified information about potential sanctions actions and other similarly sensitive documents.\nCISA added CVE-2024-12356 to its Known Exploited Vulnerabilities catalog on December 19, ordering U.S. federal agencies to\nsecure their networks within a week\n, by January 13.\nBeyondTrust provides identity security services for over 20,000 customers in more than 100 countries, including 75% of Fortune 100 companies worldwide.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nNew Veeam RCE flaw lets domain users hack backup servers\nSitecore CMS exploit chain starts with hardcoded 'b' password\nTrend Micro fixes critical vulnerabilities in multiple products\nHacker selling critical Roundcube webmail exploit as tech info disclosed\nOver 84,000 Roundcube instances vulnerable to actively exploited flaw"
    },
    {
        "Title": "New Linux udisks flaw lets attackers get root on major Linux distros",
        "Link": "https://www.bleepingcomputer.com/news/linux/new-linux-udisks-flaw-lets-attackers-get-root-on-major-linux-distros/",
        "Summary": "Attackers can exploit two newly discovered local privilege escalation (LPE) vulnerabilities to gain root privileges on systems running major Linux distributions. [...]",
        "Date": "2025-06-18",
        "Content": "Attackers can exploit two newly discovered local privilege escalation (LPE) vulnerabilities to gain root privileges on systems running major Linux distributions.\nThe first flaw (tracked as\nCVE-2025-6018\n) was found in the configuration of the Pluggable Authentication Modules (PAM) framework on openSUSE Leap 15 and SUSE Linux Enterprise 15, allowing local attackers to gain the privileges of the \"allow_active\" user.\nThe other security bug (\nCVE-2025-6019\n) was discovered in libblockdev, and it enables an \"allow_active\" user to gain root permissions via the udisks daemon (a storage management service that runs by default on most Linux distributions).\nWhile successfully abusing the two flaws as part of a \"local-to-root\" chain exploit can let attackers quickly gain root and completely take over a SUSE system, the libblockdev/udisks flaw is also extremely dangerous on its own.\n\"Although it nominally requires 'allow_active' privileges, udisks ships by default on almost all Linux distributions, so nearly any system is vulnerable,\"\nsaid\nQualys TRU senior manager Saeed Abbasi.\n\"Techniques to gain 'allow_active,' including the PAM issue disclosed here, further negate that barrier. An attacker can chain these vulnerabilities for immediate root compromise with minimal effort.\"\nThe Qualys Threat Research Unit (TRU), which discovered and reported both flaws, has also developed\nproof-of-concept exploits\nand successfully targeted CVE-2025-6019 to get root privileges on Ubuntu, Debian, Fedora, and openSUSE Leap 15 systems.\nAdmins urged to patch immediately\nThe Qualys Security Advisory team has shared more technical details regarding these two vulnerabilities\nhere\nand linked to security patches in this\nOpenwall post\n.\n\"Root access enables agent tampering, persistence, and lateral movement, so one unpatched server endangers the whole fleet. Patch both PAM and libblockdev/udisks everywhere to eliminate this path,\" Abbasi added.\n\"Given the ubiquity of udisks and the simplicity of the exploit, organizations must treat this as a\ncritical, universal risk and deploy patches without delay\n.\"\nIn recent years, Qualys researchers have discovered several other Linux security vulnerabilities that let attackers hijack unpatched Linux systems, even in default configurations.\nSecurity flaws they discovered include a flaw in Polkit's pkexec component (\ndubbed PwnKit\n), one in glibc's ld.so dynamic loader (\nLooney Tunables\n), another in the Kernel's filesystem layer (\ndubbed Sequoia\n), and one in the Sudo Unix program (aka\nBaron Samedit\n).\nShortly after the Looney Tunables flaw was disclosed, proof-of-concept (PoC) exploits were\nreleased online\n. One month later, attackers\nbegan exploiting it\nto steal cloud service provider (CSP) credentials using Kinsing malware.\nQualys also recently\nfound five LPE vulnerabilities\nintroduced over 10 years ago in the needrestart utility used by default in Ubuntu Linux 21.04 and later.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nCISA warns of attackers exploiting Linux flaw with PoC exploit\nASUS Armoury Crate bug lets attackers get Windows admin privileges\nMicrosoft shares script to restore inetpub folder you shouldn’t delete\nGoogle fixes Android zero-day exploited by Serbian authorities\nMicrosoft: Windows 'inetpub' folder created by security fix, don’t delete"
    },
    {
        "Title": "Asana warns MCP AI feature exposed customer data to other orgs",
        "Link": "https://www.bleepingcomputer.com/news/security/asana-warns-mcp-ai-feature-exposed-customer-data-to-other-orgs/",
        "Summary": "Work management platform Asana is warning users of its new Model Context Protocol (MCP) feature that a flaw in its implementation potentially led to data exposure from their instances to other users and vice versa. [...]",
        "Date": "2025-06-18",
        "Content": "Work management platform Asana is warning users of its new Model Context Protocol (MCP) feature that a flaw in its implementation potentially led to data exposure from their instances to other users and vice versa.\nThe data exposure was due to a logic flaw in the MCP system and not the result of a hack, but the risk that arises from the incident could still be significant in some cases.\nAsana is a project and task management SaaS platform used by organizations to plan, track, and manage work, assign tasks to team members, set deadlines, and collaborate from a centralized interface.\nAs of last year, the platform had over 130,000 paying customers and millions of free-tier users across 190 countries.\nOn May 1, 2025, Asana introduced the MCP server feature with large language model (LLM) integration, enabling AI-powered capabilities such as summarization, smart replies, natural language queries, and more.\nHowever, a software bug in the MCP server exposed data from Asana instances to other MCP users, with the data type being limited to each user's access scope.\nThis means that organizations did not have their entire Asana workspace leaked to the public. Still, other companies' users with access to MCP might have seen certain data from another domain, including chatbot-generated queries.\nDepending on the integration type and engagement with the chatbots, the exposed data could include task-level information, project metadata, team details, comments and discussions, and any uploaded files.\nAsana discovered the logic flaw that created this exposure on June 4, so these cross-organization data leaks occurred for over a month.\nGiven the functional role of Asana within organizations, it is possible that these leaks contained sensitive information that could create privacy or even regulatory complexities for impacted entities.\nFor this reason, it is recommended that admins review Asana logs for MCP access, review generated AI summaries or answers, and report it immediately if they see data that appears to have been pulled from another organization.\nLLM integration should be set to restricted access, and auto-reconnections and bot pipelines should be paused until trust has been re-established and there are no residual exposure risks.\nAsana sent notices with links to communication forms to each impacted organization but has not issued a public statement about the incident.\nUpGuard, who informed BleepingComputer about the issue,\nshared more details\non its own blog space, including advice for potentially impacted users.\nBleepingComputer has contacted Asana to ask about the scope of the exposure and the number of affected organizations/users, and a spokesperson has told us the incident impacts roughly 1,000 customers.\nIn the meantime, the MCP server has been taken offline, but Asana's\nstatus page\nindicates that it has returned to normal operational status as planned on June 17, 17:00 UTC.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nZero-click AI data leak flaw uncovered in Microsoft 365 Copilot\nOpenAI confirms threat actors use ChatGPT to write malware\nLeak confirms OpenAI's ChatGPT will integrate MCP\nInterlock ransomware claims DaVita attack, leaks stolen data\nApple fixes two zero-days exploited in targeted iPhone attacks"
    },
    {
        "Title": "OpenAI Awarded $200M Contract to Work With DoD",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/openai-awarded-200m-contract-dod",
        "Summary": "OpenAI intends to help streamline the Defense Department's administrative processes using artificial intelligence.",
        "Date": "2025-06-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/openai-awarded-200m-contract-dod"
    },
    {
        "Title": "The Triple Threat of Burnout: Overworked, Unsatisfied, Trapped",
        "Link": "https://www.darkreading.com/cybersecurity-operations/triple-threat-burnout-overworked-unsatisfied-trapped",
        "Summary": "Many cybersecurity professionals still don't feel comfortable admitting when they need a break. And the impact goes beyond being overworked.",
        "Date": "2025-06-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/triple-threat-burnout-overworked-unsatisfied-trapped"
    },
    {
        "Title": "GodFather Banking Trojan Debuts Virtualization Tactic",
        "Link": "https://www.darkreading.com/cloud-security/godfather-banking-trojan-debuts-virtualization-tactic",
        "Summary": "The Android malware is targeting Turkish financial institutions, completely taking over legitimate banking and crypto apps by creating an isolated virtualized environment on a device.",
        "Date": "2025-06-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/godfather-banking-trojan-debuts-virtualization-tactic"
    },
    {
        "Title": "New Tool Traps Jitters to Detect Beacons",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/jitter-trap-tool-detect-beacons",
        "Summary": "Concerned by rapidly evolving evasion tactics, the new Jitter-Trap tool from Varonis aims to help organizations detect beacons that help attackers establish communication inside a victim network.",
        "Date": "2025-06-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/jitter-trap-tool-detect-beacons"
    },
    {
        "Title": "How CISOs Can Govern AI &amp; Meet Evolving Regulations",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/cisos-govern-ai-evolving-regulations",
        "Summary": "Security teams are no longer just the last line of defense — they are the foundation for responsible AI adoption.",
        "Date": "2025-06-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/cisos-govern-ai-evolving-regulations"
    },
    {
        "Title": "Serpentine#Cloud Uses Cloudflare Tunnels in Sneak Attacks",
        "Link": "https://www.darkreading.com/cloud-security/serpentinecloud-cloudflare-tunnels-sneak-attacks",
        "Summary": "An unidentified threat actor is using .lnk Windows shortcut files in a series of sophisticated attacks utilizing in-memory code execution and living-off-the-land cyberattack strategies.",
        "Date": "2025-06-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/serpentinecloud-cloudflare-tunnels-sneak-attacks"
    },
    {
        "Title": "Indian Car-Sharing Firm Zoomcar Latest to Suffer Breach",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/indian-car-sharing-firm-zoomcar-breach",
        "Summary": "The company acknowledged that cybercriminals had taken sensitive information on more than 8 million users, including names, phone numbers, car registration numbers, addresses, and emails.",
        "Date": "2025-06-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/indian-car-sharing-firm-zoomcar-breach"
    },
    {
        "Title": "Russian Hackers Bypass Gmail MFA with App Specific Password Ruse",
        "Link": "https://www.securityweek.com/russian-hackers-bypass-gmail-mfa-with-app-specific-password-ruse/",
        "Summary": "<p>Russian hackers posed as US State Department staff and convinced targets to generate and give up Google app-specific passwords.</p>\n<p>The post <a href=\"https://www.securityweek.com/russian-hackers-bypass-gmail-mfa-with-app-specific-password-ruse/\">Russian Hackers Bypass Gmail MFA with App Specific Password Ruse</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/russian-hackers-bypass-gmail-mfa-with-app-specific-password-ruse/"
    },
    {
        "Title": "Gerrit Misconfiguration Exposed Google Projects to Malicious Code Injection",
        "Link": "https://www.securityweek.com/gerrit-misconfiguration-exposed-google-projects-to-code-injection/",
        "Summary": "<p>Misconfigured permissions in Google’s Gerrit code collaboration platform could have led to the compromise of ChromiumOS and other Google projects.</p>\n<p>The post <a href=\"https://www.securityweek.com/gerrit-misconfiguration-exposed-google-projects-to-code-injection/\">Gerrit Misconfiguration Exposed Google Projects to Malicious Code Injection</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/gerrit-misconfiguration-exposed-google-projects-to-code-injection/"
    },
    {
        "Title": "Critical Vulnerability Patched in Citrix NetScaler",
        "Link": "https://www.securityweek.com/critical-vulnerability-patched-in-citrix-netscaler/",
        "Summary": "<p>Citrix has released patches for critical- and high-severity vulnerabilities in NetScaler and Secure Access Client and Workspace for Windows.</p>\n<p>The post <a href=\"https://www.securityweek.com/critical-vulnerability-patched-in-citrix-netscaler/\">Critical Vulnerability Patched in Citrix NetScaler</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/critical-vulnerability-patched-in-citrix-netscaler/"
    },
    {
        "Title": "Linux Security: New Flaws Allow Root Access, CISA Warns of Old Bug Exploitation",
        "Link": "https://www.securityweek.com/linux-security-new-flaws-allow-root-access-cisa-warns-of-old-bug-exploitation/",
        "Summary": "<p>Qualys has disclosed two Linux vulnerabilities that can be chained for full root access, and CISA added a flaw to its KEV catalog.</p>\n<p>The post <a href=\"https://www.securityweek.com/linux-security-new-flaws-allow-root-access-cisa-warns-of-old-bug-exploitation/\">Linux Security: New Flaws Allow Root Access, CISA Warns of Old Bug Exploitation</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/linux-security-new-flaws-allow-root-access-cisa-warns-of-old-bug-exploitation/"
    },
    {
        "Title": "Mitigating AI Threats: Bridging the Gap Between AI and Legacy Security",
        "Link": "https://www.securityweek.com/mitigating-ai-threats-bridging-the-gap-between-ai-and-legacy-security/",
        "Summary": "<p>Adopting a layered defense strategy that includes human-centric tools and updating security components.</p>\n<p>The post <a href=\"https://www.securityweek.com/mitigating-ai-threats-bridging-the-gap-between-ai-and-legacy-security/\">Mitigating AI Threats: Bridging the Gap Between AI and Legacy Security</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/mitigating-ai-threats-bridging-the-gap-between-ai-and-legacy-security/"
    },
    {
        "Title": "OpenAI to Help DoD With Cyber Defense Under New $200 Million Contract",
        "Link": "https://www.securityweek.com/openai-to-help-dod-with-cyber-defense-under-new-200-million-contract/",
        "Summary": "<p>OpenAI has been awarded a $200 million contract for AI capabilities to help the Defense Department address national security challenges.</p>\n<p>The post <a href=\"https://www.securityweek.com/openai-to-help-dod-with-cyber-defense-under-new-200-million-contract/\">OpenAI to Help DoD With Cyber Defense Under New $200 Million Contract</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/openai-to-help-dod-with-cyber-defense-under-new-200-million-contract/"
    },
    {
        "Title": "Chrome 137 Update Patches High-Severity Vulnerabilities",
        "Link": "https://www.securityweek.com/chrome-137-update-patches-high-severity-vulnerabilities/",
        "Summary": "<p>Google has released a Chrome 137 update to resolve two memory bugs in the browser’s V8 and Profiler components.</p>\n<p>The post <a href=\"https://www.securityweek.com/chrome-137-update-patches-high-severity-vulnerabilities/\">Chrome 137 Update Patches High-Severity Vulnerabilities</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chrome-137-update-patches-high-severity-vulnerabilities/"
    },
    {
        "Title": "Code Execution Vulnerabilities Patched in Veeam, BeyondTrust Products",
        "Link": "https://www.securityweek.com/code-execution-vulnerabilities-patched-in-veeam-beyondtrust-products/",
        "Summary": "<p>Veeam and BeyondTrust have resolved several vulnerabilities that could be exploited for remote code execution.</p>\n<p>The post <a href=\"https://www.securityweek.com/code-execution-vulnerabilities-patched-in-veeam-beyondtrust-products/\">Code Execution Vulnerabilities Patched in Veeam, BeyondTrust Products</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/code-execution-vulnerabilities-patched-in-veeam-beyondtrust-products/"
    },
    {
        "Title": "Data Breach at Healthcare Services Firm Episource Impacts 5.4 Million People",
        "Link": "https://www.securityweek.com/data-breach-at-healthcare-services-firm-episource-impacts-5-4-million-people/",
        "Summary": "<p>Hackers have stolen personal and health information belonging to the customers of healthcare organizations served by Episource.</p>\n<p>The post <a href=\"https://www.securityweek.com/data-breach-at-healthcare-services-firm-episource-impacts-5-4-million-people/\">Data Breach at Healthcare Services Firm Episource Impacts 5.4 Million People</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/data-breach-at-healthcare-services-firm-episource-impacts-5-4-million-people/"
    },
    {
        "Title": "Alleged Leak Exposes Detailed Logistics Schedule of Algerian Ministry of Defense",
        "Link": "https://dailydarkweb.net/alleged-leak-exposes-detailed-logistics-schedule-of-algerian-ministry-of-defense/",
        "Summary": "A threat actor has allegedly breached the systems of the Algerian Ministry of Defense, claiming to have exfiltrated sensitive internal documents. The Ministry of National Defense is a critical government body for the People&#8217;s Democratic Republic of Algeria, responsible for overseeing the nation&#8217;s armed forces and its defense infrastructure. The breach, if confirmed, could expose [&#8230;]",
        "Date": "2025-06-18",
        "Content": "A threat actor has allegedly breached the systems of the Algerian Ministry of Defense, claiming to have exfiltrated sensitive internal documents. The Ministry of National Defense is a critical government body for the People’s Democratic Republic of Algeria, responsible for overseeing the nation’s armed forces and its defense infrastructure. The breach, if confirmed, could expose crucial details about the country’s military logistics and supply chain operations.\nThe perpetrators announced the data leak on a dark web forum and a corresponding Telegram channel, publishing what they claim are classified internal documents. The post stated they had “successfully obtained a portion of internal documents from the Algerian Ministry of Defense, focusing specifically on logistics and supply chain infrastructure.” The allegedly leaked data appears to detail the internal logistics structure of the ministry.\nThe compromised information allegedly includes:\nDetailed weekly schedules for logistical operations.\nSpecific tasks, including network updates, training, and equipment management.\nThe names and ranks of military personnel assigned to these tasks.\nTimelines and completion dates for operations.\nTags:\nAlgeria\nCyberSecurity\ndata-breach\ndata-leak\ngovernment\nmilitary"
    },
    {
        "Title": "Iran’s Largest Crypto Exchange Nobitex Allegedly Breached by Hacktivist Group",
        "Link": "https://dailydarkweb.net/irans-largest-crypto-exchange-nobitex-allegedly-breached-by-hacktivist-group/",
        "Summary": "The prominent Iranian cryptocurrency exchange, Nobitex, has allegedly been breached by a hacktivist group known as &#8220;Gonjeshke Darande,&#8221; or &#8220;Predatory Sparrow.&#8221; The group, known for its anti-regime stance, announced the cyberattack, claiming to have infiltrated the exchange&#8217;s internal network. Nobitex, founded in 2017, is the largest and most popular cryptocurrency trading platform in Iran, playing [&#8230;]",
        "Date": "2025-06-18",
        "Content": "The prominent Iranian cryptocurrency exchange, Nobitex, has allegedly been breached by a hacktivist group known as “Gonjeshke Darande,” or “Predatory Sparrow.” The group, known for its anti-regime stance, announced the cyberattack, claiming to have infiltrated the exchange’s internal network. Nobitex, founded in 2017, is the largest and most popular cryptocurrency trading platform in Iran, playing a significant role in the country’s access to the international digital economy, particularly in the face of stringent economic sanctions. The exchange serves a substantial user base within Iran, making it a high-value target for those seeking to disrupt the nation’s financial activities.\nIn a public statement, Gonjeshke Darande asserted that the cyberattack was a direct response to Nobitex’s alleged complicity in financing terrorism and facilitating the evasion of international sanctions by the Iranian government. The hacktivist collective has framed the breach as an act of opposition to the current regime, positioning the targeting of a key financial entity as a means of protest. This incident follows a pattern of disruptive cyber activities attributed to the group against various Iranian entities, highlighting the escalating digital front in the ongoing geopolitical tensions surrounding Iran.\nThe attackers have threatened to publicly release sensitive information allegedly exfiltrated from Nobitex’s servers. The data dump, according to the group’s claims, could be extensive and damaging to the exchange and its users. The following categories of data have allegedly been compromised:\nNobitex’s complete source code\nInternal company and operational information\nUser data\nTags:\ncryptocurrency\nCyberSecurity\ndata-breach\nfinancial crime\nGonjeshke Darande\nhacktivism\nIran\nNobitex\nsanctions evasion"
    },
    {
        "Title": "Server Access for Italian Healthcare Solutions Provider Allegedly for Sale Online",
        "Link": "https://dailydarkweb.net/server-access-for-italian-healthcare-solutions-provider-allegedly-for-sale-online/",
        "Summary": "A threat actor has allegedly listed server access for an Italian technology company for sale on a cybercrime forum. The compromised firm is described as a provider of digital solutions for the healthcare industry with reported revenues of approximately $5 million. The nature of the company&#8217;s business, dealing with healthcare technology, raises significant concerns about [&#8230;]",
        "Date": "2025-06-18",
        "Content": "A threat actor has allegedly listed server access for an Italian technology company for sale on a cybercrime forum. The compromised firm is described as a provider of digital solutions for the healthcare industry with reported revenues of approximately $5 million. The nature of the company’s business, dealing with healthcare technology, raises significant concerns about the potential risk to sensitive systems and data. The threat originates from a post on a known forum where a user is attempting to monetize this unauthorized access.\nAccording to the seller, the breach provides extensive control over one of the company’s servers. The listing is supported by screenshots that appear to show a Windows Server manager interface and the results of an internal network scan. These images suggest the compromised network is a small workgroup of 13 devices, including workstations and servers. The actor is allegedly selling local administrator privileges combined with remote access through AnyDesk, offering a direct and persistent entry point into the company’s network for a relatively small price.\nThe types of access allegedly for sale include:\nLocal Administrator access to a company server\nAnyDesk remote control access\nEntry into an internal workgroup network containing multiple devices\nTags:\ncybercrime\nCyberSecurity\ndata-breach\nHealthcare\nItaly\nMMPLANET\nserver access"
    },
    {
        "Title": "Alleged Sale of Network Access Targets Critical US Industries",
        "Link": "https://dailydarkweb.net/alleged-sale-of-network-access-targets-critical-us-industries/",
        "Summary": "A recent post on a dark web forum advertises what is allegedly active network access to several US-based companies. The post&#8217;s author is seeking to collaborate with other cybercriminals to monetize the access on a percentage basis, rather than selling it outright. The targeted companies, while not named, operate in significant sectors, including Oil and [&#8230;]",
        "Date": "2025-06-18",
        "Content": "A recent post on a dark web forum advertises what is allegedly active network access to several US-based companies. The post’s author is seeking to collaborate with other cybercriminals to monetize the access on a percentage basis, rather than selling it outright. The targeted companies, while not named, operate in significant sectors, including Oil and Gas, Consumer Electronics, and Pharmaceuticals, with reported revenues ranging from $22 million to $40 million. This development suggests a dangerous trend of threat actors seeking partnerships to conduct more sophisticated attacks, such as ransomware deployment or corporate espionage.\nThe forum post claims the seller possesses high-level access within the victims’ networks, potentially bypassing established security measures. The specifics of the alleged access vary by target but include both domain user and highly privileged domain administrator credentials. This level of compromise could grant attackers widespread control over a company’s digital infrastructure. The author also detailed the connection methods available, including Socks 5 and reverse shells, indicating active and persistent access to the compromised networks.\nAccording to the post, the access was gained despite the presence of endpoint detection and response (EDR) and antivirus solutions on the victims’ systems. The details of the alleged compromise include:\nDomain user access to a $22 million US Oil and Gas company.\nDomain user access to a $40 million US Consumer Electronics and Computer Networking firm.\nDomain Admin access to a $35 million US company in the Drug Stores & Pharmacies sector."
    },
    {
        "Title": "Israeli Organizations Weizmann Institute, Mor-logistics, and Agura B.C. LTD Allegedly Breached by Handala Hacking Group",
        "Link": "https://dailydarkweb.net/israeli-organizations-weizmann-institute-mor-logistics-and-agura-b-c-ltd-allegedly-breached-by-handala-hacking-group/",
        "Summary": "A hacking collective known as Handala has claimed responsibility for cyberattacks on three prominent Israeli entities: the Weizmann Institute of Science, cryptocurrency software firm Agura B.C. LTD, and the sensitive cargo handler Mor-logistics. The group announced the alleged breaches, threatening to release vast amounts of sensitive data and signaling a significant, coordinated operation against key [&#8230;]",
        "Date": "2025-06-18",
        "Content": "A hacking collective known as Handala has claimed responsibility for cyberattacks on three prominent Israeli entities: the Weizmann Institute of Science, cryptocurrency software firm Agura B.C. LTD, and the sensitive cargo handler Mor-logistics. The group announced the alleged breaches, threatening to release vast amounts of sensitive data and signaling a significant, coordinated operation against key sectors of Israel’s infrastructure. The origin of the Handala group is not explicitly stated, but their messaging positions them as being in opposition to the state of Israel.\nThe alleged victims represent diverse and critical parts of the Israeli economy and state apparatus. Agura B.C. LTD, a Haifa-based company founded in 2018, is a crucial behind-the-scenes player in the global cryptocurrency market, providing essential software for exchanges, trading, and digital wallet management. Mor-logistics is described as a trusted partner for multiple security agencies, responsible for transporting sensitive cargo. The Weizmann Institute of Science is one of Israel’s most prestigious research universities, which the hackers claim is involved in military and weapons development. The importance of these institutions suggests the attackers aimed to cause widespread disruption and expose highly sensitive information.\nAccording to the hackers’ claims, the infiltrations are severe, with the group allegedly exfiltrating massive volumes of data. They have stated they took over 4 terabytes of data from the Weizmann Institute and 425 gigabytes from Mor-logistics. In their communications, the group issued threats, giving Agura’s clients a 48-hour deadline before control is lost and asserting that the full data dumps from the other breaches would be made public imminently. The group claims to have breached core infrastructures and seized internal documents and classified research data.\nAllegedly Leaked/Compromised Data:\nWeizmann Institute of Science:\nOver 4 TB of data, allegedly including internal documents, sensitive research, and classified data.\nMor-logistics:\n425 GB of data from the logistics company’s systems.\nAgura B.C. LTD:\nFull control over the company’s software platforms used by cryptocurrency exchanges worldwide.\nTags:\nAgura B.C. LTD\ncyberattack\nCyberSecurity\ndata-breach\nGeopolitical Hacking\nHandala\nIsrael\nMor-logistics\nWeizmann Institute of Science"
    },
    {
        "Title": "FranceCasse Database Allegedly Leaked and Put Up for Sale Online",
        "Link": "https://dailydarkweb.net/francecasse-database-allegedly-leaked-and-put-up-for-sale-online/",
        "Summary": "A significant data breach has allegedly struck FranceCasse.fr, a prominent online platform in France that connects individuals with a vast network of auto salvage yards to find used car parts. According to a post on a dark web forum, a threat actor is selling what they claim to be the company&#8217;s complete database, source code, [&#8230;]",
        "Date": "2025-06-18",
        "Content": "A significant data breach has allegedly struck FranceCasse.fr, a prominent online platform in France that connects individuals with a vast network of auto salvage yards to find used car parts. According to a post on a dark web forum, a threat actor is selling what they claim to be the company’s complete database, source code, and other internal data from 2025. This incident could potentially expose the sensitive information of over half a million customers.\nFranceCasse.fr serves as a crucial intermediary for motorists seeking affordable, recycled auto parts, boasting a network of 250 approved End-of-Life Vehicle (ELV) centers. The alleged breach compromises the very customers who turn to the service for cost-effective vehicle maintenance. The seller on the forum claims the leaked data amounts to 62 GB and is contained within a .sql file with over 20 tables. The sale is reportedly limited to ten buyers, increasing the risk of the data being used for malicious purposes such as phishing, identity theft, and other fraudulent activities.\nThe threat actor has listed several data categories included in the alleged breach, providing a glimpse into the extent of the compromised information. The leaked data purportedly includes:\nCustomer Information:\nFull names, email addresses, hashed passwords, physical addresses, phone numbers, and IP addresses.\nCompany and Transactional Data:\nDetails on products, payment information, and internal company data.\nTechnical Assets:\nThe complete source code of the FranceCasse.fr website.\nTags:\nautomotive industry\ncustomer-data\nCyberSecurity\ndata-breach\ndata-leak\nFranceCasse\nPersonal Data\nsource code"
    },
    {
        "Title": "Brazilian Telecom Giant Telecall Allegedly Breached 70GB of Data for Sale",
        "Link": "https://dailydarkweb.net/brazilian-telecom-giant-telecall-allegedly-breached-70gb-of-data-for-sale/",
        "Summary": "A threat actor has allegedly put 70 gigabytes of sensitive data belonging to Telecall, a major Brazilian telecommunications provider, up for sale on a dark web forum. Telecall is a key player in Brazil&#8217;s telecom industry, providing advanced VoIP, SIP, and broadband services to prominent commercial and government clients, including the national oil and gas [&#8230;]",
        "Date": "2025-06-18",
        "Content": "A threat actor has allegedly put 70 gigabytes of sensitive data belonging to Telecall, a major Brazilian telecommunications provider, up for sale on a dark web forum. Telecall is a key player in Brazil’s telecom industry, providing advanced VoIP, SIP, and broadband services to prominent commercial and government clients, including the national oil and gas company Petrobras. The company’s infrastructure is described as a critical backbone for commercial communications in Brazil, making this alleged breach particularly significant.\nThe seller claims the dataset contains a vast amount of strategic and sensitive information, representing only a fraction of a larger, yet-unexplored, trove of data. The information allegedly exposes deep operational details, network configurations, and customer data. According to the post, the compromised data includes tens of millions of records and is being offered for sale, with a price tag running into thousands of dollars in cryptocurrency. The threat actor suggests the data could be used for network analysis, fraud, or competitive intelligence.\nThe posting details the extensive nature of the allegedly leaked information, which reportedly includes:\nCall Detail Records (CDR) with originating/destination numbers, call times, and durations.\nSIP Network Configurations, including IP interfaces, routing policies, and quality of service settings.\nNumber Management and Portability records.\nLists of Toll-Free (0800) numbers for commercial clients.\nInternal technical documentation and operational guides.\nIncident management tickets, SLAs, and failure analysis reports.\nCustomer data, including contracts and identification numbers (CNPJ/CPF).\nTags:\nBrazil\nCyberSecurity\ndark web\ndata-breach\ndata-leak\nTelecall\ntelecommunications"
    }
]