[
    {
        "Title": "Discord Invite Link Hijacking Delivers AsyncRAT and Skuld Stealer Targeting Crypto Wallets",
        "Link": "https://thehackernews.com/2025/06/discord-invite-link-hijacking-delivers.html",
        "Summary": "A new malware campaign is exploiting a weakness in Discord's invitation system to deliver an information stealer called Skuld and the AsyncRAT remote access trojan.\n\"Attackers hijacked the links through vanity link registration, allowing them to silently redirect users from trusted sources to malicious servers,\" Check Point said in a technical report. \"The attackers combined the ClickFix",
        "Date": "2025-06-14",
        "Content": "A new malware campaign is exploiting a weakness in Discord's invitation system to deliver an information stealer called\nSkuld\nand the\nAsyncRAT\nremote access trojan.\n\"Attackers hijacked the links through vanity link registration, allowing them to silently redirect users from trusted sources to malicious servers,\" Check Point\nsaid\nin a technical report. \"The attackers combined the ClickFix phishing technique, multi-stage loaders, and time-based evasions to stealthily deliver AsyncRAT, and a customized Skuld Stealer targeting crypto wallets.\"\nThe issue with Discord's invite mechanism is that it allows attackers to hijack expired or deleted invite links and secretly redirect unsuspecting users to malicious servers under their control. This also means that a Discord invite link that was once trusted and shared on forums or social media platforms could unwittingly lead users to malicious sites.\nDetails of the campaign come a little over a month after the cybersecurity company\nrevealed\nanother sophisticated phishing campaign that hijacked expired vanity invite links to entice users into joining a Discord server and instruct them to visit a phishing site to verify ownership, only to have their digital assets drained upon connecting their wallets.\nWhile users can create temporary, permanent, or\ncustom\n(vanity) invite links on Discord, the platform prevents other legitimate servers from reclaiming a previously expired or deleted invite. However, Check Point found that creating custom invite links allows the reuse of expired invite codes and even deleted permanent invite codes in some cases.\nThis ability to reuse Discord expired or deleted codes when creating custom vanity invite links opens the door to abuse, allowing attackers to claim it for their malicious server.\n\"This creates a serious risk: Users who follow previously trusted invite links (e.g., on websites, blogs, or forums) can unknowingly be redirected to fake Discord servers created by threat actors,\" Check Point said.\nThe Discord invite-link hijacking, in a nutshell, involves taking control of invite links originally shared by legitimate communities and then using them to redirect users to the malicious server. Users who fall prey to the scheme and join the server are asked to complete a verification step in order to gain full server access by authorizing a bot, which then leads them to a fake website with a prominent \"Verify\" button.\nThis is where the attackers take the attack to the next level by incorporating the infamous\nClickFix\nsocial engineering tactic to trick users into infecting their systems under the pretext of verification.\nSpecifically, clicking the \"Verify\" button surreptitiously executes JavaScript that copies a PowerShell command to the machine's clipboard, after which the users are urged to launch the Windows Run dialog, paste the already copied \"verification string\" (i.e., the PowerShell command), and press Enter to authenticate their accounts.\nBut in reality, performing these steps triggers the download of a PowerShell script hosted on Pastebin that subsequently retrieves and executes a first-stage downloader, which is ultimately used to drop AsyncRAT and Skuld Stealer from a remote server and execute them.\nAt the heart of this attack lies a meticulously engineered, multi-stage infection process designed for both precision and stealth, while also taking steps to subvert security protections through sandbox security checks.\nAsyncRAT, which offers comprehensive remote control capabilities over infected systems, has been found to employ a technique called\ndead drop resolver\nto access the actual command-and-control (C2) server by reading a Pastebin file.\nThe other payload is a Golang information stealer that's downloaded from Bitbucket. It's equipped to steal sensitive user data from Discord, various browsers, crypto wallets, and gaming platforms.\nSkuld is also capable of harvesting crypto wallet seed phrases and passwords from the Exodus and Atomic crypto wallets. It accomplishes this using an approach called wallet injection that replaces legitimate application files with trojanized versions downloaded from GitHub. It's worth noting that a similar technique was recently put to use by a rogue npm package named\npdf-to-office\n.\nThe attack also employs a custom version of an open-source tool known as\nChromeKatz\nto bypass Chrome's app-bound encryption protections. The collected data is exfiltrated to the miscreants via a Discord webhook.\nThe fact that payload delivery and data exfiltration occur via trusted cloud services such as GitHub, Bitbucket, Pastebin, and Discord allows the threat actors to blend in with normal traffic and fly under the radar. Discord has since disabled the malicious bot, effectively breaking the attack chain.\nCheck Point said it also identified another campaign mounted by the same threat actor that distributes the loader as a modified version of a hacktool for unlocking pirated games. The malicious program, also hosted on Bitbucket, has been downloaded 350 times.\nIt has been assessed that the victims of these campaigns are primarily located in the United States, Vietnam, France, Germany, Slovakia, Austria, the Netherlands, and the United Kingdom.\nThe findings represent the latest example of how cybercriminals are targeting the popular social platform, which has had its content delivery network (CDN)\nabused\nto\nhost malware in the past\n.\n\"This campaign illustrates how a subtle feature of Discord's invite system, the ability to reuse expired or deleted invite codes in vanity invite links, can be exploited as a powerful attack vector,\" the researchers said. \"By hijacking legitimate invite links, threat actors silently redirect unsuspecting users to malicious Discord servers.\"\n\"The choice of payloads, including a powerful stealer specifically targeting cryptocurrency wallets, suggests that the attackers are primarily focused on crypto users and motivated by financial gain.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "WestJet investigates cyberattack disrupting internal systems",
        "Link": "https://www.bleepingcomputer.com/news/security/westjet-investigates-cyberattack-disrupting-internal-systems/",
        "Summary": "WestJet, Canada's second-largest airline, is investigating a cyberattack that has disrupted access to some internal systems as it responds to the breach. [...]",
        "Date": "2025-06-14",
        "Content": "WestJet, Canada's second-largest airline, is investigating a cyberattack that has disrupted access to some internal systems as it responds to the breach.\n\"WestJet is aware of a cybersecurity incident involving internal systems and the WestJet app, which has restricted access for several users,\" reads a\nsecurity advisory\non WestJet's site.\n\"We have activated specialized internal teams in cooperation with law enforcement and Transport Canada to investigate the matter and limit impacts.\"\n\"We are expediting efforts to maintain the safety of our operation and safeguard sensitive data and personal information for both our guests and employees, and we apologize to all guests for any disruption to their access to WestJet's services.\"\nThe attack also prevented users from logging into the website and mobile app, with those services now restored.\nA Saturday morning update says the company's operation continues to run safely, but the attack has impacted access to some of its software and services.\nIt is unclear if the loss of access to its systems is caused by a ransomware attack that encrypted those devices or if they shut them to prevent the spread of the breach.\nBleepingComputer contacted WestJet with questions about the beach but has not received a reply at this time.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nVictoria’s Secret restores critical systems after cyberattack\nFog ransomware attack uses unusual mix of legitimate and open-source tools\nErie Insurance confirms cyberattack behind business disruptions\nTexas Dept. of Transportation breached, 300k crash records stolen\nGrocery wholesale giant United Natural Foods hit by cyberattack"
    },
    {
        "Title": "Anubis ransomware adds wiper to destroy files beyond recovery",
        "Link": "https://www.bleepingcomputer.com/news/security/anubis-ransomware-adds-wiper-to-destroy-files-beyond-recovery/",
        "Summary": "<The Anubis ransomware-as-a-service (RaaS) operation has added to its file-encrypting malware a wiper module&nbsp;that destroys targeted files, making recovery impossible even if the ransom is paid. [...]",
        "Date": "2025-06-14",
        "Content": "The Anubis ransomware-as-a-service (RaaS) operation has added to its file-encryptimg malware a wiper module that destroys targeted files, making recovery impossible even if the ransom is paid.\nAnubis (not to be confused with the\nsame-name Android malware\nwith a\nransomware module\n) is a relatively new RaaS first observed in December 2024 but became more active at the beginning of the year.\nOn February 23, the operators announced an affiliate program on the RAMP forum.\nA\nreport from KELA\nat the time explained that Anubis offered ransomware affiliates an 80% share of their proceeds. Data extortion affiliates were offered a 60%, and initial access brokers a 50% cut.\nCurrently, Anubis’ extortion page on the dark web lists only eight victims, indicating that it could increase the attack volume once confidence in the technical aspect is strengthened.\nOn that front, a Trend Micro report published yesterday contains evidence that the operators of Anubis are actively working on adding new features, an unusual one being a file-wiping function.\nThe researchers found the wiper in the latest Anubis samples they dissected, and believe the feature was introduced to increase the pressure on the victim to pay quicker instead of stalling negotiations or ignoring them altogether.\n“What further sets Anubis apart from other RaaS and lends an edge to its operations is its use of a file wiping feature, designed to sabotage recovery efforts even after encryption,”\nexplains Trend Micro\n.\n“This destructive tendency adds pressure on victims and raises the stakes of an already damaging attack.”\nThe destructive behavior is activated using the command-line parameter ‘/WIPEMODE,’ which requires key-based authentication to issue.\nAnubis' wipe mode\nSource: Trend Micro\nWhen activated, the wiper erases all file contents, reducing their sizes to 0 KB while keeping the filenames and structure intact.\nThe victim will still see all files in the expected directories, but their contents will be irreversibly destroyed, making recovery impossible.\nFiles before encryption (top) and after (bottom)\nSource: Trend Micro\nTrend Micro’s analysis reveals that Anubis supports several commands at launch, including for privilege elevation, directory exclusion, and target paths for encryption.\nImportant system and program directories are excluded by default to avoid rendering the system completely unusable.\nThe ransomware removes Volume Shadow Copies and terminates processes and services that could interfere with the encryption process.\nThe encryption system uses ECIES (Elliptic Curve Integrated Encryption Scheme), and the researchers noted implementation similarities to EvilByte and Prince ransomware.\nThe encrypted files are appended the ‘.anubis’ extension, an HTML ransom note is dropped on impacted directories, and the malware also performs an attempt (failed) to change the desktop wallpaper.\nThe Anubis ransom note\nSource: Trend Micro\nTrend Micro observed that Anubis attacks begin with phishing emails that carry malicious links or attachments.\nThe complete list of the indicators of compromise (IoCs) associated with Anubis attacks is\navailable here\n.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMalicious npm packages posing as utilities delete project directories\nNew PathWiper data wiper malware hits critical infrastructure in Ukraine\nMicrosoft: Octo Tempest is one of the most dangerous financial hacking groups\nAhold Delhaize confirms data theft after INC ransomware claims attack\nFog ransomware attack uses unusual mix of legitimate and open-source tools"
    },
    {
        "Title": "Windows 11 users want these five features back",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-users-want-these-five-features-back/",
        "Summary": "When Windows 11 was first released, many long-time users felt features they loved had been taken away overnight. Three and a half years later, the same complaints still rise to the top of the Feedback Hub with tens of thousands of votes. [...]",
        "Date": "2025-06-14",
        "Content": "When Windows 11 was first released, many long-time users felt features they loved had been taken away overnight.\nThree and a half years later, the same complaints still rise to the top of the Feedback Hub with tens of thousands of votes.\nBelow are the five most wanted Windows 11 features on the Microsoft Feedback Hub.\nThe most wanted requests in Windows 11\n\"Bring back the ability to move the taskbar to the top and sides of the screen on Windows 11\"\nRight now, the taskbar is glued to the bottom edge, and users want the freedom to move the taskbar to the top or sides of the screen.\nNo option to change taskbar position\nFeedback Hub's post on the topic has racked up 24,046 votes and 2,086 comments, but the feedback is not fresh.\nUsers posted this feedback immediately when Windows 11 shipped to testers, and Microsoft has maintained a radio silence about its plans to upgrade the taskbar.\n\"The move taskbar feature is missing now for years. Why has this not been changed yet?\" writes a user, who also begs Microsoft to \"please replace whoever is responsible for the current design.\"\nOne user wonders if Microsoft's stock phrase \"We've got it\" really means \"We're ignoring it.\"\nMicrosoft's Feedback Hub has an automated reply to the post that just says \"We'll be continuing to evolve Windows 11 and its features based on feedback like this, so thank you so much for taking the time to give us your feedback.\"\n\"I would like to be able to turn off the Recommended section in the Start menu and have the whole area disappear in Windows 11.\"\nThe second most-voted request sits at 17,479 votes and 794 comments.\nThree years after Windows 11's launch, Microsoft still doesn't understand that users do not want a Start menu with the recommended menu.\nI personally hate it, too, because it just clogs up the Start menu with recent app or file activities, which are already exposed via the File Explorer.\n\"No, I don't want to reduce the size, I want to hide it, forever, for good,\" a user wrote.\nAnother poster calls the pane \"a useless, empty space\" that wastes screen real estate, and the rest of the users fear it will become an \"Advertising space.\"\nIn reply to the Feedback, Microsoft noted that full removal is not available but lists half a dozen toggles inside\nSettings\n>\nPersonalization\n>\nStart\nat least reduce the content.\nStart menu personalization settings\nThe company recently added a More pins layout in Windows 11 23H2 that lets you shrink the pane to one row, but you can't get rid of the Recommended feed for now.\n\"Add an option for Windows search to use my preferred search provider\"\nWindows search still funnels web queries into Bing and opens them in Edge unless you live in the European Economic Area, where new regulations force Microsoft to respect the default browser.\nThe proposal for a global switch has 11,007 votes and 101 comments.\nOne user says the EU rule \"should apply in the United States, heck, everywhere in the world.\"  Another user is bothered by \"sparkles next to the search bar\" and wants to disable them.\nEuropean Insiders have already seen test builds that unlock the choice, but Microsoft has no plans to bring it outside the EU.\n\"The CPU/Processor requirements for Windows 11 are too high and I think you should lower them\"\nThis feedback was first published in 2021, and it now holds 8,483 votes and 1,025 comments.\nUsers are upset that their fully capable PCs cannot run Windows 11.\nWindows 11 TPM requirement\nOne user says they own a gaming rig with \"near best hardware\" but an unsupported processor, calling the situation another \"Vista/8.1\" moment.\nAnother user agrees and notes that \"millions of PCs are going to end up in the landfill for no good reason,\" as we approach Windows 10's doomsday.\n\"Update the Windows 11 taskbar to support never combining app icons and hiding labels\"\nIn Windows 10, you could set your taskbar so each window stayed separate and labels stayed hidden.\nWindows 11 now has an option to set \"\nnever-combine\n\" mode, but it still feels unfinished.\nOpen enough apps, and the bar collapses icons into a \"…\" block. Icons change width whenever, say, your Spotify song title updates, which makes everything jump around.\nSimilarly, labels are forced on by default and can't be turned off, so you lose precious space at the bottom of the screen.\nIn a Feedback Hub post, one tester even called it \"horrible\" and begged Microsoft to \"please finally fix this,\" while another asked why labels are forced at all when choosing never-combine, as \"it eats too much space.\"\nIf you visit the Feedback Hub, you'll see dozens of similar posts.\nBleepingComputer observed that these five feedback posts account for over 75,000 votes alone, and each still pulls in fresh comments weekly.\nIt's crystal clear that users want Microsoft to improve Windows 11, but is the Redmond giant listening?\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nWindows 11 KB5060842 and KB5060999 cumulative updates released\nWindows 11 KB5058499 update rolls out new Share and Click to Do features\nWindows 11's Recall AI is now rolling out on Copilot+ PCs\nMicrosoft creates separate Windows 11 24H2 update for incompatible PCs\nMicrosoft June 2025 Patch Tuesday fixes exploited zero-day, 66 flaws"
    }
]