[
    {
        "Title": "nOAuth Vulnerability Still Affects 9% of Microsoft Entra SaaS Apps Two Years After Discovery",
        "Link": "https://thehackernews.com/2025/06/noauth-vulnerability-still-affects-9-of.html",
        "Summary": "New research has uncovered continued risk from a known security weakness in Microsoft's Entra ID, potentially enabling malicious actors to achieve account takeovers in susceptible software-as-a-service (SaaS) applications.\nIdentity security company Semperis, in an analysis of 104 SaaS applications, found nine of them to be vulnerable to Entra ID cross-tenant nOAuth abuse.\nFirst disclosed by",
        "Date": "2025-06-25",
        "Content": "New research has uncovered continued risk from a known security weakness in Microsoft's\nEntra ID\n, potentially enabling malicious actors to achieve account takeovers in susceptible software-as-a-service (SaaS) applications.\nIdentity security company Semperis, in an\nanalysis\nof 104 SaaS applications, found nine of them to be vulnerable to Entra ID cross-tenant nOAuth abuse.\nFirst disclosed by Descope in June 2023,\nnOAuth\nrefers to a weakness in how SaaS applications implement OpenID Connect (\nOIDC\n), which refers to an authentication layer built atop OAuth to verify a user's identity.\nThe authentication implementation flaw essentially allows a bad actor to change the mail attribute in the Entra ID account to that of a victim's and take advantage of the app's \"Log in with Microsoft\" feature to hijack that account.\nThe attack is trivial, but it also works because Entra ID permits users to have an unverified email address, opening the door to user impersonation across tenant boundaries.\nIt also exploits the fact that an app using multiple identity providers (e.g., Google, Facebook, or Microsoft) could inadvertently allow an attacker to sign in to a target user's account simply because the email address is used as the sole criteria to uniquely identify users and merge accounts.\nSemperis' threat model focuses on a variant of nOAuth, specifically finding applications that allow for Entra ID cross-tenant access. In other words, both the attacker and the victim are on two different Entra ID tenants.\n\"nOAuth abuse is a serious threat that many organizations may be exposed to,\" Eric Woodruff, chief identity architect at Semperis, said. \"It's low effort, leaves almost no trace and bypasses end‑user protections.\"\n\"An attacker that successfully abuses nOAuth would be able not only to gain access to the SaaS application data, but also potentially to pivot into Microsoft 365 resources.\"\nSemperis said it reported the findings to Microsoft in December 2024, prompting the Windows maker to reiterate recommendations it gave back in 2023, coinciding with the public disclosure of nOAuth. It also noted that vendors that do not comply with the guidelines risk getting their apps removed from the Entra App Gallery.\nMicrosoft has also\nemphasized\nthat the use of claims other than subject identifier (referred to as the \"sub\" claim) to uniquely identify an end user in OpenID Connect is non-compliant.\n\"If an OpenID Connect relying party uses any other claims in a token besides a combination of the sub (subject) claim and the iss (issuer) claim as a primary account identifier in OpenID Connect, they're breaking the contract of expectations between federated identity provider and relying party,\" the company noted at that time.\nMitigating nOAuth ultimately rests in the hands of developers, who must properly implement authentication to prevent account takeovers by creating a unique, immutable user identifier.\n\"nOAuth abuse exploits cross-tenant vulnerabilities and can lead to SaaS application data exfiltration, persistence, and lateral movement,\" the company said. \"The abuse is difficult for customers of vulnerable applications to detect and impossible for customers of vulnerable applications to defend against.\"\nThe disclosure comes as Trend Micro revealed that misconfigured or overly privileged containers in Kubernetes environments can be used to facilitate access to sensitive Amazon Web Services (AWS) credentials, enabling attackers to conduct follow-on activities.\nThe cybersecurity company said attackers can exploit excessive privileges granted to containers using methods like packet sniffing of unencrypted HTTP traffic to access plaintext credentials and API spoofing, which uses manipulated Network Interface Card (NIC) settings to intercept Authorization tokens and gain elevated privileges.\n\"The findings [...] highlight critical security considerations when using Amazon EKS Pod Identity for simplifying AWS resource access in Kubernetes environments,\" security researcher Jiri Gogela\nsaid\n.\n\"These vulnerabilities underscore the importance of adhering to the principle of least privilege, ensuring container configurations are scoped appropriately, and minimizing opportunities for exploitation by malicious actors.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Citrix Releases Emergency Patches for Actively Exploited CVE-2025-6543 in NetScaler ADC",
        "Link": "https://thehackernews.com/2025/06/citrix-releases-emergency-patches-for.html",
        "Summary": "Citrix has released security updates to address a critical flaw affecting NetScaler ADC that it said has been exploited in the wild.\nThe vulnerability, tracked as CVE-2025-6543, carries a CVSS score of 9.2 out of a maximum of 10.0.\nIt has been described as a case of memory overflow that could result in unintended control flow and denial-of-service. However, successful exploitation requires the",
        "Date": "2025-06-25",
        "Content": "Citrix has released security updates to address a critical flaw affecting NetScaler ADC that it said has been exploited in the wild.\nThe vulnerability, tracked as\nCVE-2025-6543\n, carries a CVSS score of 9.2 out of a maximum of 10.0.\nIt has been described as a case of memory overflow that could result in unintended control flow and denial-of-service. However, successful exploitation requires the appliance to be configured as a Gateway (VPN virtual server, ICA Proxy, CVPN, RDP Proxy) or AAA virtual server.\nThe shortcoming impacts the below versions -\nNetScaler ADC and NetScaler Gateway 14.1 prior to 14.1-47.46\nNetScaler ADC and NetScaler Gateway 13.1 prior to 13.1-59.19\nNetScaler ADC and NetScaler Gateway 12.1 and 13.0 (vulnerable and end-of-life)\nNetScaler ADC 13.1-FIPS and NDcPP prior to 13.1-37.236-FIPS and NDcPP\n\"Secure Private Access on-prem or Secure Private Access Hybrid deployments using NetScaler instances are also affected by the vulnerabilities,\" Citrix said.\n\"Customers need to upgrade these NetScaler instances to the recommended NetScaler builds to address the vulnerabilities.\"\nThe company did not reveal how the flaw is being exploited in real-world attacks, but said \"exploits of CVE-2025-6543 on unmitigated appliances have been observed.\"\nThe disclosure comes shortly after Citrix patched another critical-rated security flaw in NetScaler ADC (\nCVE-2025-5777\n, CVSS score: 9.3) that could be exploited by threat actors to gain access to susceptible appliances.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Citrix Bleed 2 Flaw Enables Token Theft; SAP GUI Flaws Risk Sensitive Data Exposure",
        "Link": "https://thehackernews.com/2025/06/citrix-bleed-2-flaw-enables-token-theft.html",
        "Summary": "Cybersecurity researchers have detailed two now-patched security flaws in SAP Graphical User Interface (GUI) for Windows and Java that, if successfully exploited, could have enabled attackers to access sensitive information under certain conditions.\nThe vulnerabilities, tracked as CVE-2025-0055 and CVE-2025-0056 (CVSS scores: 6.0), were patched by SAP as part of its monthly updates for January",
        "Date": "2025-06-25",
        "Content": "Cybersecurity researchers have detailed two now-patched security flaws in\nSAP Graphical User Interface\n(GUI) for Windows and Java that, if successfully exploited, could have enabled attackers to access sensitive information under certain conditions.\nThe vulnerabilities, tracked as\nCVE-2025-0055\nand\nCVE-2025-0056\n(CVSS scores: 6.0), were patched by SAP as part of its\nmonthly updates for January 2025\n.\n\"The research discovered that SAP GUI input history is stored insecurely, both in the Java and Windows versions,\" Pathlock researcher Jonathan Stross\nsaid\nin a report shared with The Hacker News.\nSAP GUI user history\nallows\nusers to access previously entered values in input fields with the goal of saving time and reducing errors. This historical information is stored locally on devices. This can include usernames, national IDs, social security numbers (SSNs), bank account numbers, and internal SAP table names.\nThe vulnerabilities identified by Pathlock are rooted in this input history feature, allowing an attacker with administrative privileges or access to the victim's user directory on the operating system to access the data within a predefined directory based on the SAP GUI variant.\nSAP GUI for Windows - %APPDATA%\\LocalLow\\SAPGUI\\Cache\\History\\SAPHistory<WINUSER>.db\nSAP GUI for Java - %APPDATA%\\LocalLow\\SAPGUI\\Cache\\History or $HOME/.SAPGUI/Cache/History (Windows or Linux) and $HOME/Library/Preferences/SAP/Cache/History (macOS)\nThe issue is that the inputs are saved in the database file using a weak XOR-based encryption scheme in the case of SAP GUI for Windows, which makes them trivial to decode with minimal effort. In contrast, SAP GUI for Java stores these historical entries in an unencrypted fashion as Java serialized objects.\nAs a result, depending on the user input provided in the past, the disclosed information could include anything between non-critical data to highly sensitive data, thereby impacting the confidentiality of the application.\n\"Anyone with access to the computer can potentially access the history file and all sensitive information it stores,\" Stross said. \"Because the data is stored locally and weakly (or not at all) encrypted, exfiltration through HID injection attacks (like USB Rubber Ducky) or phishing becomes a real threat.\"\nPathlock also pointed out the two vulnerabilities served as a foundation for a third information disclosure flaw (\nCVE-2025-0059\n, CVSS score: 6.0) in SAP NetWeaver Application Server ABAP, which is based on SAP GUI for HTML. However, it does not have a patch.\nTo mitigate any potential risks associated with information disclosure, it's advised to disable the input history functionality and delete existing database or serialized object files from the aforementioned directories.\nCitrix Patches CVE-2025-5777\nThe disclosure comes as Citrix\npatched\na critical-rated security flaw in NetScaler (CVE-2025-5777, CVSS score: 9.3) that could be exploited by threat actors to gain access to susceptible appliances.\nThe shortcoming stems from insufficient input validation that may enable unauthorized attackers to grab valid session tokens from memory via malformed requests, effectively bypassing authentication protections. However, this only works when Netscaler is configured as a Gateway or AAA virtual server.\nThe vulnerability has been\ncodenamed\nCitrix Bleed 2 by security researcher Kevin Beaumont, owing to its similarities to\nCVE-2023-4966\n(CVSS score: 9.4), which came under active exploitation in the wild two years ago.\nIt has been\naddressed\nin the following versions -\nNetScaler ADC and NetScaler Gateway 14.1-43.56 and later releases\nNetScaler ADC and NetScaler Gateway 13.1-58.32 and later releases of 13.1\nNetScaler ADC 13.1-FIPS and 13.1-NDcPP 13.1-37.235 and later releases of 13.1-FIPS and 13.1-NDcPP\nNetScaler ADC 12.1-FIPS 12.1-55.328 and later releases of 12.1-FIPS\nSecure Private Access on-prem or Secure Private Access Hybrid deployments using NetScaler instances are also affected by the vulnerabilities. Citrix is recommending that users run the following commands to terminate all active ICA and PCoIP sessions after all NetScaler appliances have been upgraded -\nkill icaconnection -all\nkill pcoipConnection -all\nThe company is also urging customers of NetScaler ADC and NetScaler Gateway versions 12.1 and 13.0 to move to a support version as they are now End Of Life (EOL) and no longer supported.\nWhile there is no evidence that the flaw has been weaponized, watchTowr CEO Benjamin Harris said it \"checks all the boxes\" for attacker interest and that exploitation could be around the corner.\n\"CVE-2025-5777 is shaping up to be every bit as serious as CitrixBleed, a vulnerability that caused havoc for end-users of Citrix Netscaler appliances in 2023 and beyond as the initial breach vector for numerous high-profile incidents,\" Benjamin Harris, CEO at watchTowr, told The Hacker News.\n\"The details surrounding CVE-2025-5777 have quietly shifted since its initial disclosure, with fairly important pre-requisites or limitations being removed from the NVD CVE description -- specifically, the comment that this vulnerability was in the lesser-exposed Management Interface has now been removed -- leading us to believe that this vulnerability is significantly more painful than perhaps first signaled.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Pro-Iranian Hacktivist Group Leaks Personal Records from the 2024 Saudi Games",
        "Link": "https://thehackernews.com/2025/06/pro-iranian-hacktivist-group-leaks.html",
        "Summary": "Thousands of personal records allegedly linked to athletes and visitors of the Saudi Games have been published online by a pro-Iranian hacktivist group called Cyber Fattah.\nCybersecurity company Resecurity said the breach was announced on Telegram on June 22, 2025, in the form of SQL database dumps, characterizing it as an information operation \"carried out by Iran and its proxies.\"\n\"The actors",
        "Date": "2025-06-25",
        "Content": "Thousands of personal records allegedly linked to athletes and visitors of the Saudi Games have been published online by a pro-Iranian hacktivist group called Cyber Fattah.\nCybersecurity company Resecurity said the breach was announced on Telegram on June 22, 2025, in the form of SQL database dumps, characterizing it as an information operation \"carried out by Iran and its proxies.\"\n\"The actors gained unauthorized access to phpMyAdmin (backend) and exfiltrated stored records,\" Resecurity\nsaid\n. \"This is an example of Iran using data breaches as part of a larger anti-U.S., anti-Israel, and anti-Saudi propaganda activity in cyberspace, targeting major sports and social events.\"\nIt's believed that the data is likely pulled from the Saudi Games 2024 official website and then shared on\nDarkForums\n, a cybercrime forum that has gained attention in the wake of BreachForums' repeated takedowns. The information was published by a forum user named ZeroDayX, a burner profile that was likely created to promote this breach.\nThe leaked data includes IT staff credentials; government official email addresses; athletes' and visitors' information; passports and ID cards; bank statements; medical forms; and scanned copies of sensitive documents.\n\"The activities of Cyber Fattah align with a broader trend of hacktivism in the Middle East, where groups frequently engage in cyber warfare as a form of activism,\" Resecurity said.\nThe leak unfolds against the backdrop of\nsimmering tensions\nbetween Iran and Israel, with as many as 119 hacktivist groups claiming to have conducted cyber attacks or have made declarations to align with or act against the two nations, per\nCyberknow\n.\nCyber Fattah, which calls itself an \"Iranian cyber team,\" has a history of targeting Israeli and Western web resources and government agencies.\nIt's also known to collaborate with other threat actors active in the region, such as 313 Team, which claimed responsibility for a distributed denial-of-service (DDoS) attack against social media platform Truth Social in retaliation for U.S. airstrikes on Iran's nuclear facilities.\n\"This incident by Cyber Fattah may indicate an interesting shift from Israel-centric malicious activity toward a broader focus on anti-U.S. and anti-Saudi messaging,\" Resecurity said.\nLast week, a pro-Israel group known as Predatory Sparrow (aka Adalat Ali, Gonjeshke Darande, Indra, or MeteorExpress) claimed to have leaked data obtained from the Iranian Ministry of Communications. Notably, it also\nhacked\nIran's largest cryptocurrency exchange, Nobitex, and burned over $90 million in cryptocurrency by sending digital assets to invalid wallets.\nCybersecurity company Outpost24 said the attackers possibly had \"access to internal documentation that detailed the inner workings of the exchange and possibly even authentication credentials\" to pull off the heist, or that it was a case of a rogue insider who worked with the group.\n\"This was not a financially motivated heist but a strategic, ideological, and psychological operation,\" security researcher Lidia López Sanz\nsaid\n. \"By destroying rather than exfiltrating funds, the threat actor emphasized its goals: dismantling public trust in regime-linked institutions and signaling its technical superiority.\"\nSubsequently, on June 18, Iran's state broadcaster IRIB's (short for Islamic Republic of Iran Broadcasting) television stream was hijacked to display pro-Israeli and anti-Iranian government imagery. IRIB claimed Israel was behind the incident.\nImage Source: Cyberknow\nIsrael, for its part, has also become a target of pro-Palestine hacking groups like the\nHandala team\n, which has listed\nseveral Israeli organizations\non its data leak site starting June 14, 2025. These included Delek Group, Y.G. New Idan, and AeroDreams.\nAnother trend observed in the cyber warfare between Iran and Israel is the coming together of smaller hacktivist groups to form umbrella entities like the Cyber Islamic Resistance or United Cyber Front for Palestine and Iran.\n\"These loosely affiliated 'cyber unions' share resources and synchronize campaigns, amplifying their impact despite limited technical sophistication,\" Trustwave SpiderLabs\nsaid\nin a report published last week.\nThe company also singled out another pro-Iranian group named\nDieNet\nthat, despite its pro-Iranian and pro-Hamas stance, is believed to include Russian-speaking members and connections to other cyber communities in Eastern Europe.\n\"What distinguishes DieNet from many other pro-Iranian actors is its hybrid identity,\" it noted. \"Linguistic analysis of DieNet's messages, as well as timestamps, metadata, and interaction pattern, suggests that at least part of the group communicates internally in Russian or uses Slavic-language resources.\"\n\"This points to the broader phenomenon of cross-regional cyber collaboration, where ideological alignment overrides geographic or national boundaries.\"\nGroup-IB, in an\nanalysis\nof Telegram-based hacktivist activity following June 13, v during the time period. In all, more than 5,800 messages have been recorded across various hacktivist channels between June 13 and 20.\nThe deployment of\ncyber capabilities\nin the context of the Iran-Israel war, as well as other recent geopolitical events surrounding Hamas–Israel and Russia-Ukraine conflicts, demonstrates how digital operations are increasingly being integrated to supplement kinetic actions, influence public perception, and disrupt critical infrastructure, Trustwave added.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Beware the Hidden Risk in Your Entra Environment",
        "Link": "https://thehackernews.com/2025/06/beware-hidden-risk-in-your-entra.html",
        "Summary": "If you invite guest users into your Entra ID tenant, you may be opening yourself up to a surprising risk.&nbsp;\nA gap in access control in Microsoft Entra’s subscription handling is allowing guest users to create and transfer subscriptions into the tenant they are invited into, while maintaining full ownership of them.&nbsp;\nAll the guest user needs are the permissions to create subscriptions in",
        "Date": "2025-06-25",
        "Content": "If you invite guest users into your Entra ID tenant, you may be opening yourself up to a surprising risk.\nA gap in access control in Microsoft Entra's subscription handling is allowing guest users to create and transfer subscriptions into the tenant they are invited into, while maintaining full ownership of them.\nAll the guest user needs are the permissions to create subscriptions in their home tenant, and an invitation as a guest user into an external tenant. Once inside, the guest user can create subscriptions in their home tenant, transfer them into the external tenant, and retain full ownership rights. This stealthy privilege escalation tactic allows a guest user to gain a privileged foothold in an environment where they should only have limited access.\nMany organizations treat guest accounts as low-risk based on their temporary, limited access, but this behavior, which works as designed, opens the door to known attack paths and lateral movement within the resource tenant. It can allow a threat actor to achieve unauthorized reconnaissance and persistence in the defender's Entra ID, and advance privilege escalation in certain scenarios.\nTypical threat models and best practices don't account for an unprivileged guest creating their own subscription within your tenant, so this risk may not only exist outside your organization's controls; it may be off your security team's radar as well.\nHow to Compromise Your Entra ID Tenant with a Guest User Account\nGuest-made subscription footholds exploit the fact that Microsoft's billing permissions (Enterprise Agreement or Microsoft Customer Agreement) are scoped at the billing account, not the Entra directory. Most security teams think about Azure permissions as either Entra Directory Roles (such as Global Administrator) or Azure RBAC Roles (such as Owner). But there is another set of permissions that get overlooked: Billing Roles.\nWhile Entra Directory and Azure RBAC Roles focus on managing permissions around identities and access to resources, Billing roles operate at the billing account level, which exists outside the well-understood Azure tenant authentication and authorization boundaries. A user with the right billing role can spin up or transfer subscriptions from their home tenant to gain control inside a target tenant, and a security team that is strictly auditing Entra Directory roles won't gain visibility of these subscriptions in a standard Entra permission review.\nWhen a B2B guest user is invited to a resource tenant, they access the tenant via federation from their home tenant. This is a cost-saving measure, the trade-off being that your tenant cannot enforce auth controls like MFA. As such, defenders usually try to limit the privileges and access of guests as they are inherently less securable. However, if the guest has a valid billing role in their home tenant, they can use it to become a subscription owner inside Azure.\nThis is also true for guest users who exist in pay-as-you-go Azure tenants that an attacker could spin up in just a few minutes. And, by default, any user, including guests, can invite external users into the directory. This means an attacker could leverage a compromised account to invite in a user with the correct billing permissions into your environment.\nHow an Attacker can Gain Elevated Access Using an Unprivileged Entra Guest Account:\nAttacker gets control of a user with a billing role that can create subscriptions / owner of a subscription in a tenant, either by:\nCreating their own Entra tenant using an Azure free trial (the user they signed up with will be a Billing Account owner)\nOr, by compromising an existing user in a tenant who already has a privileged billing role / subscription ownership\nAttacker gets an invite to become a guest user in their target Entra tenant. By default, any user or guest can invite a guest into the tenant.\nAttacker logs into the Azure Portal, goes into their own home directory – which they completely control.\nAttacker navigates to Subscriptions > Add +.\nAttacker switches to the \"Advanced\" tab and sets the defender's directory as the target directory.\nAttacker creates subscription. No subscription will appear in the attacker tenant. Instead, the subscription appears in the defender tenant, under the root management group.\nAttacker will automatically be assigned the RBAC Role of \"Owner\" for this subscription.\nReal-World Risk: What a Restless Guest Can Do with a New Subscription\nOnce an attacker has a subscription with Owner permissions within another organization's tenant, they can use that access to perform actions that would normally be blocked by their limited role. These include:\nListing Root Management Group Administrators -\nIn many tenant configurations, guest users have zero permissions to list other users within a tenant; however, following a guest subscription attack, that visibility becomes possible. The guest Owner can view the \"Access Control\" role assignments on the subscription they've created. Any administrators assigned at the root management group level of the tenant will be inherited and will appear in the role assignments view of the subscription, exposing a list of high-value privileged accounts that are ideal targets for follow-on attacks and social engineering.\nWeakening the Default Azure Policy Tied to the Subscription -\nBy default, all subscriptions (and their resources) are governed by Azure policies designed to enforce security standards and trigger alerts when violations occur. However, when a guest becomes a subscription Owner, they have full write permissions to all policies that apply to their subscription and can modify or disable them, effectively muting security alerts that would otherwise notify defenders of suspicious or non-compliant activity. This further reduces visibility from security monitoring tools, allowing the attacker to perform malicious activities or target external systems under the radar.\nCreating a User-Managed Identity in the Entra ID Directory -\nA guest user with subscription Owner permissions can create a User-Managed Identity, a special Azure identity that lives in the Entra directory, but is linked to cloud workloads, within their subscription. This identity can:\nPersist independently of the original guest account\nBe granted roles or permissions beyond the subscription\nBlend in with legitimate service identities, making detection harder\nLaunch a targeted API permission phishing attack to trick legitimate admins into granting this managed identity elevated privileges.\nRegistering Microsoft Entra-Joined Devices and abusing Conditional Access Policies -\nAzure allows trusted devices to be registered and joined to Entra ID. An attacker can register devices under their hijacked subscription and have them appear as compliant corporate devices. Many organizations use dynamic device groups to auto-assign roles or access based on device status (e.g., \"all users on compliant laptops get access to X\"). By spoofing or registering a device, an attacker could abuse Conditional Access Policies and gain unauthorized access to trusted assets. This represents a device-based variant of a known dynamic group exploit\n[1]\npreviously seen in user object targeting. BeyondTrust's Identity Security Insights product has helped customers uncover many similar misconfigured dynamic groups that unintentionally expose hidden\nPaths to Privilege™\n.\nWhy Guest Subscription Creation Is a Growing Concern for Entra Security\nWhile more work is required to understand the true implications of this updated threat model, what we already know is concerning: any guest account federated into your tenant may represent a path to privilege. The risk is not hypothetical. Researchers at BeyondTrust have observed attackers actively abusing guest-based subscription creation in the wild. The threat is present, active, and the real danger here lies in the fact that it's largely under the radar.\nThese actions fall outside what most Azure administrators expect a guest user to be capable of. Most security teams don't account for guest users being able to create and control subscriptions. As a result, this attack vector often falls outside of typical Entra threat models, making this path to privilege under-recognized, unexpected, and dangerously accessible.\nThis attack vector is extremely common in B2B scenarios, where home and resource tenants are often controlled by different organizations. We suspect many organizations leveraging Entra ID B2B Guest features are unaware of the possible paths to privilege that this feature inadvertently enables.\nMitigations: How to Prevent Guest Subscription Accounts from Gaining a Foothold\nTo mitigate this behaviour, Microsoft allows organizations to configure Subscription Policies to block guests from transferring subscriptions into their tenant. This setting restricts subscription creation to explicitly permitted users only, and Microsoft has published supporting documentation\n[2]\nfor this control.\nIn addition to enabling this policy, we recommend the following actions:\nAudit all guest accounts in your environment and remove those that are no longer required\nHarden guest controls as much as possible: for instance, disable guest-to-guest invitations\nMonitor all subscriptions in your tenant regularly to detect unexpected guest-created subscriptions and resources\nMonitor all Security Center alerts in the Azure Portal; some may appear even if the visibility is inconsistent\nAudit device access, especially if these utilize dynamic group rules.\nTo assist defenders, BeyondTrust Identity Security Insights provides built-in detections to flag subscriptions created by guest accounts, offering automated visibility into these unusual behaviors.\nBeyondTrust Identity Security Insights customers can gain a holistic view of all Identities across their entire identity fabric. This includes gaining a consolidated understanding of Entra Guest accounts and their True Privilege™.\nThe Bigger Picture: Identity Misconfigurations Are the New Exploits\nGuest-made subscription compromise isn't an anomaly; it's a stark example of the many overlooked\nidentity security\nweaknesses that can undermine the modern enterprise environment, if not adequately addressed. Misconfigurations and weak default settings are prime access points for threat actors who are looking for the hidden paths into your environment.\nIt isn't just your admin accounts that need to be included in your security policies anymore. B2B trust models, inherited billing rights, and dynamic roles mean that every account is a potential launch point for privilege escalation. Re-examine your guest access policies, visibility tools, and subscription governance models now, before these Restless Guests take advantage.\nTo gain a snapshot of potential identity-based risks in your environment, including those introduced through guest access, BeyondTrust offers a no-cost\nIdentity Security Risk Assessment\n.\nNote:\nThis article is expertly written and contributed by Simon Maxwell-Stewart, Senior Security Researcher at BeyondTrust. Simon Maxwell-Stewart is a University of Oxford physics graduate with over a decade of experience in the big data environment. Before joining BeyondTrust, he worked as a Lead Data Scientist in healthcare, and successfully brought multiple machine learning projects into production. Now working as a \"resident graph nerd\" on BeyondTrust's security research team, Simon applies his expertise in graph analysis to help drive identity security innovation.\nMnemonic. \"Abusing dynamic groups in Azure AD for privilege escalation.\" Available: https://www.mnemonic.io/resources/blog/abusing-dynamic-groups-in-azure-ad-for-privilege-escalation/\nMicrosoft. \"Manage Azure subscription policies.\" Available: https://learn.microsoft.com/en-us/azure/cost-management-billing/manage/manage-azure-subscription-policy\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "SonicWall NetExtender Trojan and ConnectWise Exploits Used in Remote Access Attacks",
        "Link": "https://thehackernews.com/2025/06/sonicwall-netextender-trojan-and.html",
        "Summary": "Unknown threat actors have been distributing a trojanized version of SonicWall's SSL VPN NetExtender application to steal credentials from unsuspecting users who may have installed it.\n\"NetExtender enables remote users to securely connect and run applications on the company network,\" SonicWall researcher Sravan Ganachari said. \"Users can upload and download files, access network drives, and use",
        "Date": "2025-06-25",
        "Content": "Unknown threat actors have been distributing a trojanized version of SonicWall's SSL VPN NetExtender application to steal credentials from unsuspecting users who may have installed it.\n\"NetExtender enables remote users to securely connect and run applications on the company network,\" SonicWall researcher Sravan Ganachari\nsaid\n. \"Users can upload and download files, access network drives, and use other resources as if they were on the local network.\"\nThe malicious payload delivered via the rogue VPN software has been codenamed\nSilentRoute\nby Microsoft, which detected the campaign along with the network security company.\nSonicWall said the malware-laced NetExtender impersonates the latest version of the software (10.3.2.27) and has been found to be distributed via a fake website that has since been taken down. The installer is digitally signed by CITYLIGHT MEDIA PRIVATE LIMITED.\"\nThis suggests that the campaign is targeting users searching for NetExtender on search engines like Google or Bing, and tricking them into installing it through spoofed sites propagated via known techniques like spear-phishing, search engine optimization (SEO) poisoning, malvertising, or social media posts.\nTwo different components of the installer have been modified to facilitate the exfiltration of the configuration information to a remote server under the attacker's control.\nThese include \"NeService.exe\" and \"NetExtender.exe,\" which have been altered to bypass the validation of digital certificates various NetExtender components and continue execution regardless of the validation results and exfiltrate the information to 132.196.198[.]163 over port 8080.\n\"The threat actor added code in the installed binaries of the fake NetExtender so that information related to VPN configuration is stolen and sent to a remote server,\" Ganachari said.\n\"Once the VPN configuration details are entered and the \"Connect\" button is clicked, the malicious code performs its own validation before sending the data to the remote server. Stolen configuration information includes the username, password, domain, and more.\"\nThreat Actors Abuse ConnectWise Authenticode Signatures\nThe development comes as G DATA detailed a threat activity cluster dubbed EvilConwi that involves bad actors abusing ConnectWise to embed malicious code using a technique called\nauthenticode\nstuffing without invalidating the digital signature.\nThe German cybersecurity company\nsaid\nit has observed a spike in attacks using this technique since March 2025. The infection chains primarily leverage phishing emails as an initial access vector or through bogus sites advertised as artificial intelligence (AI) tools on Facebook.\nThese email messages contain a OneDrive link that redirects recipients to a Canva page with a \"View PDF\" button, which results in the surreptitious download and execution of a ConnectWise installer.\nThe attacks work by implanting malicious configurations in unauthenticated attributes within the Authenticode signature to serve a fake Windows update screen and prevent users from shutting down their systems, as well as including information about the external URL to which the remote connection should be established for persistent access.\nWhat makes EvilConwi notable is that it offers malicious actors a cover for nefarious operations by conducting them using a trusted, legitimate, and maybe elevated system or software process, thereby allowing them to fly under the radar.\n\"By modifying these settings, threat actors create their own remote access malware that pretends to be a different software like an AI-to-image converter by Google Chrome,\" security researcher Karsten Hahn said. \"They commonly add fake Windows update images and messages too, so that the user does not turn off the system while threat actors remotely connect to them.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "North Korea-linked Supply Chain Attack Targets Developers with 35 Malicious npm Packages",
        "Link": "https://thehackernews.com/2025/06/north-korea-linked-supply-chain-attack.html",
        "Summary": "Cybersecurity researchers have uncovered a fresh batch of malicious npm packages linked to the ongoing Contagious Interview operation originating from North Korea.\nAccording to Socket, the ongoing supply chain attack involves 35 malicious packages that were uploaded from 24 npm accounts. These packages have been collectively downloaded over 4,000 times. The complete list of the JavaScript",
        "Date": "2025-06-25",
        "Content": "Cybersecurity researchers have uncovered a fresh batch of malicious npm packages linked to the ongoing\nContagious Interview\noperation originating from North Korea.\nAccording to\nSocket\n, the ongoing supply chain attack involves 35 malicious packages that were uploaded from 24 npm accounts. These packages have been collectively downloaded over 4,000 times. The complete list of the JavaScript libraries is below -\nreact-plaid-sdk\nsumsub-node-websdk\nvite-plugin-next-refresh\nvite-plugin-purify\nnextjs-insight\nvite-plugin-svgn\nnode-loggers\nreact-logs\nreactbootstraps\nframer-motion-ext\nserverlog-dispatch\nmongo-errorlog\nnext-log-patcher\nvite-plugin-tools\npixel-percent\ntest-topdev-logger-v1\ntest-topdev-logger-v3\nserver-log-engine\nlogbin-nodejs\nvite-loader-svg\nstruct-logger\nflexible-loggers\nbeautiful-plugins\nchalk-config\njsonpacks\njsonspecific\njsonsecs\nutil-buffers\nblur-plugins\nproc-watch\nnode-orm-mongoose\nprior-config\nuse-videos\nlucide-node, and\nrouter-parse\nOf these, six continue to remain available for download from npm: react-plaid-sdk, sumsub-node-websdk, vite-plugin-next-refresh, vite-loader-svg, node-orm-mongoose, and router-parse.\nEach of the identified npm packages contains a hex-encoded loader dubbed HexEval, which is designed to collect host information post installation and selectively deliver a follow-on payload that's responsible for delivering a known JavaScript stealer called\nBeaverTail\n.\nBeaverTail, in turn, is configured to download and execute a Python backdoor called InvisibleFerret, enabling the threat actors to collect sensitive data and establish remote control of infected hosts.\n\"This nesting-doll structure helps the campaign evade basic static scanners and manual reviews,\" Socket researcher Kirill Boychenko said. \"One npm alias also shipped a cross-platform keylogger package that captures every keystroke, showing the threat actors' readiness to tailor payloads for deeper surveillance when the target warrants it.\"\nContagious Interview, first\npublicly documented\nby Palo Alto Networks Unit 42 in late 2023, is an\nongoing campaign\nundertaken by North Korean state-sponsored threat actors to obtain unauthorized access to developer systems with the goal of conducting cryptocurrency and data theft.\nThe cluster is also broadly tracked under the monikers CL-STA-0240, DeceptiveDevelopment, DEV#POPPER, Famous Chollima, Gwisin Gang, Tenacious Pungsan, UNC5342, and Void Dokkaebi.\nRecent iterations of the campaign have also been observed taking advantage of the ClickFix social engineering tactic to deliver malware such as GolangGhost and PylangGhost. This sub-cluster of activity has been designated the name\nClickFake Interview\n.\nThe latest findings from Socket point to a multi-pronged approach where Pyongyang threat actors are embracing various methods to trick prospective targets into installing malware under the pretext of an interview or a Zoom meeting.\nThe npm offshoot of Contagious Interview typically involves the attackers\nposing\nas\nrecruiters\non LinkedIn, sending job seekers and developers coding assignments by sharing a link to a malicious project hosted on GitHub or Bitbucket that embeds the npm packages within them.\n\"They target software engineers who are actively job-hunting, exploiting the trust that job-seekers typically place in recruiters,\" Boychenko said. \"Fake personas initiate contact, often with scripted outreach messages and convincing job descriptions.\"\nThe victims are then coaxed into cloning and running these projects outside containerized environments during the purported interview process.\n\"This malicious campaign highlights an evolving tradecraft in North Korean supply chain attacks, one that blends malware staging, OSINT-driven targeting, and social engineering to compromise developers through trusted ecosystems,\" Socket said.\n\"By embedding malware loaders like HexEval in open source packages and delivering them through fake job assignments, threat actors sidestep perimeter defenses and gain execution on the systems of targeted developers. The campaign's multi-stage structure, minimal on-registry footprint, and attempt to evade containerized environments point to a well-resourced adversary refining its intrusion methods in real-time.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft Extends Windows 10 Security Updates for One Year with New Enrollment Options",
        "Link": "https://thehackernews.com/2025/06/microsoft-extends-windows-10-security.html",
        "Summary": "Microsoft on Tuesday announced that it's extending Windows 10 Extended Security Updates (ESU) for an extra year by letting users either pay a small fee of $30 or by sync their PC settings to the cloud.\nThe development comes ahead of the tech giant's upcoming October 14, 2025, deadline, when it plans to officially end support and stop providing security updates for devices running Windows 10. The",
        "Date": "2025-06-25",
        "Content": "Microsoft on Tuesday\nannounced\nthat it's extending Windows 10 Extended Security Updates (\nESU\n) for an extra year by letting users either pay a small fee of $30 or by sync their PC settings to the cloud.\nThe development comes ahead of the tech giant's upcoming\nOctober 14, 2025, deadline\n, when it plans to officially end support and stop providing security updates for devices running Windows 10. The desktop operating system was launched in July 2015.\nThe Windows maker describes ESU as a \"last resort option\" for customers who need to run legacy Microsoft software that has reached end-of-life (EoL) status. This is meant to be a temporary solution while migrating to a newer supported platform.\nAccording to\nStatCounter data\nas of May 2025, Windows 10's market share stands at 53.19% globally, making it the most widely used version of Windows. This is followed by Windows 11 at 43%.\nAs part of the new enrollment options announced by Microsoft, individuals can opt-in to the program from their personal Windows 10 PC through an \"enrollment wizard\" available in the Settings app. Users can choose one of the three options -\nUse Windows Backup to sync your settings to the cloud (at no additional cost)\nRedeem 1,000 Microsoft Rewards points (at no additional cost)\nPay $30 (local pricing may change)\nOnce the appropriate option is selected, users' PCs will be automatically enrolled into the program. ESU coverage for Windows 10 devices runs from October 15, 2025, to October 13, 2026.\nThe enrollment wizard is currently available in the Windows Insider Program, and is expected to be rolled out to Windows 10 customers in July, with expanded availability set for mid-August.\nCommercial organizations can also subscribe to ESU for $61 per device for one year, after which the subscription can be renewed every year at an increasing cost for up to three years. This option, however, does not cover markers like Russia, Belarus, Cuba, Iran, North Korea, Sudan, and Syria.\nIt's worth noting that ESUs do not cover new features, non-security updates, or design change requests. Another key aspect to factor in is that using Microsoft Rewards or Windows Backup requires users to sign up for a Microsoft account, if they don't have it already.\n\"Individuals or organizations who elect to continue using Windows 10 after support ends on October 14, 2025, will have the option of enrolling their PCs into a paid ESU subscription,\" Microsoft\nnotes\n.\n\"The ESU program enables PCs to continue to receive critical and important security updates through an annual subscription service after support ends.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Hackers turn ScreenConnect into malware using Authenticode stuffing",
        "Link": "https://www.bleepingcomputer.com/news/security/hackers-turn-screenconnect-into-malware-using-authenticode-stuffing/",
        "Summary": "Threat actors are abusing the ConnectWise ScreenConnect installer to build signed remote access malware by modifying hidden settings within the client's  Authenticode signature. [...]",
        "Date": "2025-06-25",
        "Content": "Threat actors are abusing the ConnectWise ScreenConnect installer to build signed remote access malware by modifying hidden settings within the client's  Authenticode signature.\nConnectWise ScreenConnect is a remote monitoring and management (RMM) software that allows IT admins and managed service providers (MSPs) to troubleshoot devices remotely.\nWhen a ScreenConnect installer is built, it can be customized to include the remote server the client should connect to, what text is shown in the dialog boxes, and logos that should be displayed. This configuration data is saved within the file's authenticode signature.\nThis technique, called authenticode stuffing, allows for the insertion of data into a certificate table while keeping the digital signature intact.\nScreenConnect abused for initial access\nCybersecurity firm\nG DATA observed\nmalicious ConnectWise binaries with identical hash values across all file sections except for the certificate table.\nThe only difference was a modified certificate table containing new malicious configuration information while still allowing the file to remain signed.\nG DATA says the first samples were found in the\nBleepingComputer forums\n, where members\nreported being infected\nafter falling for phishing attacks. Similar attacks were reported on Reddit.\nThese phishing attacks utilized either PDFs or intermediary Canva pages that linked to executables hosted on Cloudflare's R2 servers (r2.dev).\nExample PDF used in the phishing campaign\nSource: BleepingComputer\nThe file, called \"Request for Proposal.exe,\" seen by BleepingComputer, is a malicious ScreenConnect client [\nVirusTotal\n] configured to connect to the attacker's servers at 86.38.225[.]6:8041 (relay.rachael-and-aidan.co[.]uk)\nG DATA built a tool to extract and review the settings found in these campaigns, where the researchers found significant modifications, such as changing the installer's title to \"Windows Update\" and replacing the background with a fake Windows Update image shown below.\nConnectWise ScreenConnect client showing a fake Windows Update screen\nSource: G DATA\nEssentially, the threat actors converted the legitimate ConnectWise ScreenConnect client into malware that allows them to stealthily gain access to infected devices.\nAfter contacting G DATA, ConnectWise revoked the certificate used in these binaries, and G DATA is now flagging these samples as Win32.Backdoor.EvilConwi.* and Win32.Riskware.SilentConwi.*.\nG DATA says they never received a reply from ConnectWise about this campaign and their report.\nAnother campaign is also enterprise software, this time distributing\ntrojanized versions of the SonicWall NetExtender VPN client\nto steal usernames, passwords, and domain information.\nAccording to an advisory from SonicWall, these modified versions send captured credentials to an attacker-controlled server, making it critical for users only to obtain software clients from official sites.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nConnectWise breached in cyberattack linked to nation-state hackers\nMicrosoft fixes known issue that breaks Windows 11 updates\nWindows 10 KB5061087 update released with 13 changes and fixes\nMicrosoft to remove legacy drivers from Windows Update for security boost\nConnectWise rotating code signing certificates over security concerns"
    },
    {
        "Title": "Hackers abuse Microsoft ClickOnce and AWS services for stealthy attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/oneclik-attacks-use-microsoft-clickonce-and-aws-to-target-energy-sector/",
        "Summary": "A sophisticated malicious campaign that researchers call OneClik has been leveraging Microsoft's ClickOnce software deployment tool and custom Golang backdoors to compromise organizations within the energy, oil, and gas sectors. [...]",
        "Date": "2025-06-25",
        "Content": "A sophisticated malicious campaign that researchers call OneClik has been leveraging Microsoft’s ClickOnce software deployment tool and custom Golang backdoors to compromise organizations within the energy, oil, and gas sectors.\nThe hackers rely on legitimate AWS cloud services (AWS, Cloudfront, API Gateway, Lambda) to keep the command and control (C2) infrastructure hidden.\nClickOnce\nis a deployment technology from Microsoft that allows developers to create self-updating Windows-based applications, reducing user interaction to a minimum.\nSecurity researchers at cybersecurity company Trellix analyzed three variants of the campaign (v1a, BPI-MDM, and v1d), all of them deploying “a sophisticated Golanguage backdoor” called RunnerBeacon via a .NET-based loader tracked as OneClikNet.\nAccording to them, each version of the OneClik campaign evolved with advanced tactics and C2 obfuscation, robust anti-analysis, and sandbox evasion techniques.\nWhile operational indicators point to China-affiliated threat actors, the researchers are cautious in making an attribution.\nAbusing Microsoft’s ClickOnce deployment tool\nOneClik attacks combine legitimate tools with custom malware and cloud and enterprise tooling, which allows the threat actor to evade detection of the operation.\nIt starts with a phishing email with a link to a fake hardware analysis site hosted in the Azure ecosystem that delivers a .APPLICATION file (ClickOnce manifest) disguised as a legitimate tool.\nTrellix researchers say that the attacker used ClickOnce apps as a delivery mechanism for malicious payloads without triggering the user account control mechanism.\n“ClickOnce apps launch under the Deployment Service (dfsvc.exe), enabling attackers to proxy execution of malicious payloads through this trusted host.\nBecause ClickOnce applications run with user-level privileges (no user account control required), they offer an appealing delivery mechanism for threat actors aiming to avoid privilege escalation,” the\nresearchers explain\n.\nInfection chain in OneClik attacks\nsource: Trellix\nAfter execution, the ClickOnce loader runs malicious payloads by hijacking how the .NET application loads assemblies, a technique called\nAppDomainManager injection\n.\nIn the case of OneClik, this allowed the threat actor to use a legitimate .NET executable, such as\nZSATray.exe\n,\numt.exe\n, or\nied.exe\n, to load something else than the normal dependencies.\n“With the loader in place, payload execution proceeds under\ndfsvc.exe\n, blending with benign ClickOnce activities,” Trellix researchers say.\nTo conceal the operation for a longer period, the threat actor leveraged legitimate AWS services, which made C2 communication appear as normal cloud usage as it mixed with harmless CDN traffic.\nIn the OneClik v1a variant, the beacon contacted a Cloudfront distribution domain and an API Gateway endpoint. In the v1d it used an AWS Lambda function URL as the HTTP callback address.\n“By “hiding in the cloud,” attackers exploit the high trust and availability of AWS: defenders must decrypt SSL or denylist entire AWS domains to notice this traffic, which is often impractical,” Trellix researchers clarify.\nGo-based RunnerBeacon backdoor\nAn analysis of the Golang-based RunnerBeacon backdoor showed that its C2 protocol encrypted all traffic using the RC4 stream cipher algorithm and serialized data using MessagePack.\nIt features a modular message protocol with multiple message types, among them BeaconData, FileRequest, CommandRequest, SOCKSRequest, and FileUpload.\nSome of the methods the backdoor uses to hinder analysis, the researchers found an “obfuscate_and_sleep” routine and randomized “jitter” in beacon intervals.\nThe researchers also observed high-level commands that allow the threat actor to:\nexecute shell commands (CreateProcessW)\nnumerate processes\nrun file operations (directory listing, upload, download)\ncarry out network-related tasks (port scanning)\nestablish a SOCKS5 tunnel to proxy data traffic\nAdditional RunnerBeacon capabilities include advanced operations like process injection and setting the stage for privilege escalation.\nTrellix says that RunnerBeacon’s design is similar to known Go-based Cobalt Strike beacons like those in the Geacon family.\nDue to the similarities in the set of commands and the use of cross-protocol C2, they say that “RunnerBeacon may be an evolved fork or privately modified variant of Geacon, tailored for stealthier, and cloud-friendly operations”\nCautious attribution\nAlthough the OneClik campaign was discovered recently, at the beginning of March, a variant of the RunnerBeacon loader was identified in September 2023 at a company in the Middle East in the oil and gas sector.\nThe delivery method could not be determined but the variant’s code is almost identical to the analyzed module from the OneClik operation.\nThe clues pointing to activity related to a China-affiliated state actor include tactics, techniques, and procedures seen in other campaigns attributed to Chinese threat actors.\nTrellix highlights that the .NET AppDomainManager injection technique has been used in multiple cyberattacks attributed to Chinese threat actors. The same goes for the method used to deploy the encrypted payload.\nAdditionally, previous China-linked campaigns show a preference for cloud-based staging using services from Alibaba and Amazon.\nHowever, these overlaps are not enough to attribute the OneClik attacks to a specific threat actor.\nThe\nreport\nfrom Trellix includes a comprehensive list of indicators of compromise for all components in the OneClik campaign, ranging from phishing lures and malware loaders to configuration files, backdoor binaries, legitimate executables, domains, and configuration parameters.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nSitecore CMS exploit chain starts with hardcoded 'b' password\nSentinelOne shares new details on China-linked breach attempt\nMalicious npm packages posing as utilities delete project directories\nHacker targets other hackers and gamers with backdoored GitHub code\nMicrosoft and CrowdStrike partner to link hacking group names"
    },
    {
        "Title": "New wave of ‘fake interviews’ use 35 npm packages to spread malware",
        "Link": "https://www.bleepingcomputer.com/news/security/new-wave-of-fake-interviews-use-35-npm-packages-to-spread-malware/",
        "Summary": "A new wave of North Korea's 'Contagious Interview' campaign is targeting job seekers with malicious npm packages that infect dev's devices with infostealers and backdoors. [...]",
        "Date": "2025-06-25",
        "Content": "A new wave of North Korea's 'Contagious Interview' campaign is targeting job seekers with malicious npm packages that infect dev's devices with infostealers and backdoors.\nThe packages were discovered by\nSocket Threat Research\n, which reports they load the BeaverTail info-stealer and InvisibleFerret backdoor on victims' machines, two\nwell-documented payloads\nassociated with DPRK actors.\nThe latest attack wave uses 35 malicious packages submitted to npm through 24 accounts. The packages have been downloaded over 4,000 times in total, and six of them remain available at the time of writing.\nSeveral of the 35 malicious npm packages typosquat or mimic well-known and trusted libraries, making them especially dangerous.\nNotable examples of those are:\nreact-plaid-sdk, reactbootstraps\nvite-plugin-next-refresh, vite-loader-svg\nnode-orm-mongoose\njsonpacks, jsonspecific\nchalk-config\nnode-loggers, *-logger\nframer-motion-ext\nnextjs-insight\nstruct-logger, logbin-nodejs\nVictims, typically software engineers and developers, are led to download these packages by North Korean operatives posing as recruiters, requesting job candidates to work on a test project.\n\"Posing as recruiters on LinkedIn, the North Korean threat actors send coding \"assignments\" to developers and job seekers via Google Docs, embed these malicious packages within the project, and often pressure candidates to run the code outside containerized environments while screen-sharing,\" explains Socket.\nBaiting document sent to targets\nSource: Socket\nThe assignments are hosted on Bitbucket and disguised as legitimate tests, but in reality, they trigger an infection chain that drops multiple payloads on the target's computer.\nThe first stage is HexEval Loader, hidden in the npm packages, which fingerprints the host, contacts the threat actor's command-and-control (C2) server, and uses 'eval()' to fetch and execute the second stage payload, BeaverTail.\nBeaverTail is a multi-platform info-stealer and malware loader that steals browser data, including cookies and cryptocurrency wallets, and loads the third stage, InvisibleFerret.\nInvisibleFerret is a cross-platform persistent backdoor delivered as a ZIP file, giving the attackers deeper, ongoing access to the victim's system with remote control, file theft, and screen-shooting capabilities.\nFinally, the attackers drop a cross-platform (Windows, macOS, Linux) keylogger tool that hooks into low-level input events and performs real-time surveillance and data exfiltration.\nThis keylogger was only associated with one of the npm aliases used in the campaign, so it might be deployed only on select high-value targets.\nOverview of the attack\nSource: Socket\nSoftware developers approached with lucrative remote job offers should treat these invitations with caution and always run unknown code in containers or virtual machines instead of executing it on their OS.\nLast March, North Korean hackers Lazarus were caught submitting\nanother set of malicious packages\non npm, so this is an ongoing risk.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nNorth Korean hackers deepfake execs in Zoom call to spread Mac malware\nMalicious NPM package uses Unicode steganography to evade detection\nMalware found in NPM packages with 1 million weekly downloads\nMalicious npm packages posing as utilities delete project directories\nAndroid malware Crocodilus adds fake contacts to spoof trusted callers"
    },
    {
        "Title": "Google releases Gemini CLI with free Gemini 2.5 Pro",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/google-releases-gemini-cli-with-free-gemini-25-pro/",
        "Summary": "Google has released Gemini 2.5 Pro-powered Gemini CLI, which allows you to use Gemini inside your terminal, including Windows Terminal. [...]",
        "Date": "2025-06-25",
        "Content": "Google has\nreleased\nGemini 2.5 Pro-powered Gemini CLI, which allows you to use Gemini inside your terminal, including Windows Terminal.\nGemini CLI is written in Typescript and it works across all platforms, including Windows, macOS and Linux.\nIf you're a developer, you can follow Gemini CLI's guidelines and plug it into scripts and extend capabilities of existing tools.\nGemini CLI in Windows Terminal\nSource: BleepingComputer\nFor example, if you use Cursor AI or Windsurf, you can integrate Gemini CLI and aid your vibe coding.\nTo use Gemini CLI, open a terminal window and run the command\nnpx https://github.com/google-gemini/gemini-cli\n.\nOnce done, select the theme and link your Google account to begin using the AI inside the terminal.\nYou can link a Google account to Gemini CLI to unlock features like a 1-million context window, 60 model requests per minute, and up to 1,000 requests per day\nIf you want to run multiple agents or use it for proper development, Google recommends using Gemini Code Assist.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nGoogle rolls out text-to-image model Imagen 4 for free\nGoogle’s upcoming Gemini Kingfall is allegedly a coding beast\nGoogle Chrome to use on-device AI to detect tech support scams\nGoogle NotebookLM is now using Gemini 2.5 Flash\nGoogle Cloud donates A2A AI protocol to the Linux Foundation"
    },
    {
        "Title": "Citrix warns of NetScaler vulnerability exploited in DoS attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/citrix-warns-of-netscaler-vulnerability-exploited-in-dos-attacks/",
        "Summary": "Citrix is warning that a vulnerability in NetScaler appliances tracked as CVE-2025-6543 is being actively exploited in the wild, causing devices to enter a denial of service condition. [...]",
        "Date": "2025-06-25",
        "Content": "Citrix is warning that a vulnerability in NetScaler appliances tracked as CVE-2025-6543 is being actively exploited in the wild, causing devices to enter a denial of service condition.\n\"Exploits of CVE-2025-6543 on unmitigated appliances have been observed,\" warns Citrix's advisory.\nTracked internally as\nCTX694788\n, CVE-2025-6543 is a critical flaw impacting NetScaler ADC and NetScaler Gateway and can be triggered by unauthenticated, remote requests, leading the appliance to go offline.\nThe flaw impacts NetScaler ADC and NetScaler Gateway versions 14.1 before 14.1-47.46, 13.1 before 13.1-59.19, and NetScaler ADC 13.1-FIPS and NDcPP before 13.1-37.236-FIPS and NDcPP.\nIt only affects NetScaler devices configured as a Gateway (VPN virtual server, ICA Proxy, Clientless VPN (CVPN), RDP Proxy) or an AAA virtual server.\nCitrix fixed the flaw in NetScaler ADC and Gateway 14.1-47.46, 13.1-59.19, and ADC 13.1-FIPS and 13.1-NDcPP 13.1-37.236 and later releases of 13.1-FIPS and 13.1-NDcPP.\nThe warning arrives as admins deal with\nanother critical NetScaler flaw dubbed CitrixBleed 2\n.\nThat bug, tracked as CVE-2025-5777, allows attackers to hijack user sessions by extracting session tokens from a device's memory.\nA similar Citrix flaw named \"CitrixBleed\" was previously used by\nransomware gangs\nand in\nattacks on governments\nin 2023 to gain widescale access to NetScaler devices and move laterally across corporate environments.\nWith both flaws being critical bugs, administrators are advised to apply the latest patches from Citrix as soon as possible.\nCompanies should also monitor their NetScaler instances for unusual user sessions, abnormal behavior, and to review access controls.\nBleepingComputer contacted Citrix to learn how CVE-2025-6543 is being exploited in attacks and will update this article if we receive a response.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nNew 'CitrixBleed 2' NetScaler flaw let hackers hijack sessions\nCloudflare blocks record 7.3 Tbps DDoS attack against hosting provider\nPolice takes down six DDoS-for-hire services, arrests admins\nPro-Russia hacktivists bombard Dutch public orgs with DDoS attacks\nCloudflare mitigates record number of DDoS attacks in 2025"
    },
    {
        "Title": "WinRAR patches bug letting malware launch from extracted archives",
        "Link": "https://www.bleepingcomputer.com/news/security/winrar-patches-bug-letting-malware-launch-from-extracted-archives/",
        "Summary": "WinRAR has addressed a directory traversal vulnerability tracked as CVE-2025-6218 that, under certain circumstances, allows malware to be executed after extracting a malicious archive. [...]",
        "Date": "2025-06-25",
        "Content": "WinRAR has addressed a directory traversal vulnerability tracked as CVE-2025-6218 that, under certain circumstances, allows malware to be executed after extracting a malicious archive.\nThe flaw tracked as CVE-2025-6218 and assigned a CVSS score of 7.8 (high severity), was discovered by security researcher\nwhs3-detonator\nwho reported it through Zero Day Initiative on June 5, 2025.\nIt affects only the Windows version of WinRAR, from version 7.11 and older, and a fix was released in WinRAR version 7.12 beta 1, which was made available yesterday.\n\"When extracting a file, previous versions of WinRAR, Windows versions of RAR, UnRAR, portable UnRAR source code and UnRAR.dll can be tricked into using a path, defined in a specially crafted archive, instead of user specified path,\"\nread the changelog notes\n.\nA malicious archive could contain files with crafted relative paths tricking WinRAR into \"silently\" extracting those to sensitive locations like system directories and auto-run or startup folders.\nIf the archive's contents are malicious, these files could launch automatically and trigger dangerous code execution the next time the user logs into Windows.\nAlthough the programs will run with user-level access rather than administrative or SYSTEM rights, they can still steal sensitive data like browser cookies and saved passwords, install persistence mechanisms, or provide remote access for further lateral movement.\nThe risk of CVE-2025-6218 is contained by the fact that user interaction is required for its exploitation, like opening a malicious archive or visiting a specially crafted page.\nHowever, it is very common for users to utilize old versions of WinRar, and as there are so many ways to distribute malicious archives, the risk remains very high.\nBesides CVE-2025-6218, WinRAR 7.12 beta 1 also addresses an HTML injection in report generation problem reported by Marcin Bobryk, where archived file names containing < or > could be injected into the HTML report as raw HTML tags. This could enable HTML/JS injection if reports are opened in a web browser.\nTwo more minor issues fixed in the latest WinRAR release include incomplete testing of recovery volumes and timestamp precision loss for Unix records.\nAlthough CVE-2025-6218 does not impact Unix versions, Android, and portable UnRAR source code, all users of WinRAR, regardless of the platform, are recommended to upgrade to the latest version immediately.\nCurrently, there are no reports about CVE-2025-6218, but given the widespread deployment of WinRAR globally and\nthe history\nof hackers\ntargeting the software\n, users should update to the latest version immediately.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nSitecore CMS exploit chain starts with hardcoded 'b' password\nNew Veeam RCE flaw lets domain users hack backup servers\nTrend Micro fixes critical vulnerabilities in multiple products\nHackers exploited Windows WebDav zero-day to drop malware\nHewlett Packard Enterprise warns of critical StoreOnce auth bypass"
    },
    {
        "Title": "New 'CitrixBleed 2' NetScaler flaw let hackers hijack sessions",
        "Link": "https://www.bleepingcomputer.com/news/security/new-citrixbleed-2-netscaler-flaw-let-hackers-hijack-sessions/",
        "Summary": "A recent vulnerability in Citrix NetScaler ADC and Gateway is dubbed \"CitrixBleed 2,\" after its similarity to an older exploited flaw that allowed unauthenticated attackers to hijack authentication session cookies from vulnerable devices. [...]",
        "Date": "2025-06-25",
        "Content": "A recent vulnerability in Citrix NetScaler ADC and Gateway is dubbed \"CitrixBleed 2,\" after its similarity to an older exploited flaw that allowed unauthenticated attackers to hijack authentication session cookies from vulnerable devices.\nLast week, Citrix published a\nsecurity bulletin\nwarning about flaws tracked as CVE-2025-5777 and CVE-2025-5349 that impact NetScaler ADC and Gateway versions before 14.1-43.56, releases before 13.1-58.32, and also 13.1-37.235-FIPS/NDcPP and 2.1-55.328-FIPS.\nThe CVE-2025-5777 is a critical flaw that is caused by out-of-bounds memory read, allowing unauthenticated attacks to access portions of memory that they should not have access to.\nThis flaw impacts NetScaler devices that are configured as a Gateway (VPN virtual server, ICA Proxy, Clientless VPN (CVPN), RDP Proxy) or an AAA virtual server.\nCybersecurity researcher\nKevin Beaumont says\nthe flaw echoes the infamous '\nCitrixBleed\n' vulnerability (CVE-2023-4966), which was extensively exploited by threat actors, including\nransomware\nand\ngovernment attacks\n.\nBeaumont characterized CVE-2025-5777 as 'CitrixBleed 2,' stating that the flaw could allow attackers to potentially access session tokens, credentials, and other sensitive data from public-facing gateways and virtual servers.\nLeaked tokens can be replayed to hijack user sessions and bypass multi-factor authentication (MFA).\nThe same security bulletin lists a second, high-severity flaw tracked as CVE-2025-5349.\nThis is an improper access control problem in the NetScaler Management Interface, exploitable if the attacker has access to the NSIP (NetScaler Management IP), Cluster Management IP, or Local GSLB Site IP.\nTo address both risks, users are recommended to install NetScaler ADC and Gateway 14.1-43.56, 13.1-58.32 and later, 13.1-NDcPP 13.1-37.235 (FIPS), and 12.1-55.328 (FIPS).\nWhile Citrix has not stated whether these flaws are being actively exploited, they do recommend that admins terminate all active ICA and PCoIP sessions as soon as all appliances have been updated. This advice was also given by Citrix regarding the original CitrixBleed flaws.\nBefore killing active sessions, admins should first review existing sessions for suspicious activity using the\nshow icaconnection\ncommand and\nNetScaler Gateway\n>\nPCoIP\n>\nConnections\nto see PCoIP sessions.\nAfter reviewing the active sessions, admins should then terminate them using these commands:\nkill icaconnection -all\r\nkill pcoipconnection -all\nIn a\nLinkedIn post\n, Mandiant CTO Charles Carmakal warns that it is essential to kill sessions after updating devices to prevent previously stolen sessions from being used even after devices are no longer vulnerable.\n\"Many organizations did not terminate sessions when remediating a similar vulnerability in 2023 (CVE-2023-4966 aka \"Citrix Bleed\"),\" warns Carmakal.\n\"In those cases, session secrets were stolen before companies patched, and the sessions were hijacked after the patch. Many of those compromises resulted in nation-state espionage or ransomware deployment.\"\nThe flaws also impact end-of-life ADC / Gateway 12.1 (non-FIPS) and ADC / Gateway 13.0, which will not be receiving patches. Those still using these versions should upgrade to an actively supported release as soon as possible.\nBeaumont's internet scans return over 56,500 publicly exposed NetScaler ADC and Gateway endpoints, though what percentage of those are running versions vulnerable to CVE-2025-5349 and CVE-2025-5777 is unknown.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nCitrix warns of NetScaler vulnerability exploited in DoS attacks\nGoogle fixes high severity Chrome flaw with public exploit\nWinRAR patches bug letting malware launch from extracted archives\nHow Today’s Pentest Models Compare and Why Continuous Wins\nWordPress Motors theme flaw mass-exploited to hijack admin accounts"
    },
    {
        "Title": "BreachForums hacking forum operators reportedly arrested in France",
        "Link": "https://www.bleepingcomputer.com/news/security/breachforums-hacking-forum-operators-reportedly-arrested-in-france/",
        "Summary": "The French police have reportedly arrested five operators of the BreachForum cybercrime forum, a website used by cybercriminals to leak and sell stolen data that exposed the sensitive information of millions. [...]",
        "Date": "2025-06-25",
        "Content": "The French police have reportedly arrested five operators of the BreachForum cybercrime forum, a website used by cybercriminals to leak and sell stolen data that exposed the sensitive information of millions.\nNews of the arrests come from\nLe Parisien\n, which claims the law enforcement operation was carried out by the cybercrime unit (BL2C) of the Paris police department on Monday.\nAccording to reporters, the police carried out simultaneous raids in the regions of Hauts-de-Seine (Paris), Seine-Maritime (Normandy), and Réunion (overseas).\nDuring this action, they have arrested four hackers known online by the handles \"ShinyHunters,\" \"Hollow,\" \"Noct,\" and \"Depressed.\"\nFor months, rumors circulated that another well-known threat actor, \"IntelBroker,\" had also been arrested. Le Parisien reports that IntelBroker was also arrested by French authorities in February 2025.\nThe BreachForums hacking forums have gone through numerous iterations over the years but acted as a community for cybercriminals to trade, sell, and leak stolen data, as well as sell access to corporate networks and other illegal cybercrime services.\nIn 2023, the\noriginal BreachForums shut down\nafter its operator, Conor Brian FitzPatrick (aka Pompompurin),\nwas arrested\n.\nSoon after, other threat actors in the community launched BreachForums v2, which was led by threat actors known as ShinyHunters, Baphomet, and, later, IntelBroker.\nThe five threat actors that were arrested were reportedly involved in the operation of this new launch of the site.\nShinyHunters and IntelBroker were admins/owners of the site, and archived posts show Hollow acting as a moderator.  It is unclear what involvement \"depressed\" and \"noct\" had in the operation of the site.\nThose cybercriminals are accused of having direct involvement in data breaches against French entities like Boulanger, SFR, France Travail, and the French Football Federation.\nThe attack against France Travail (formerly Pôle Emploi) was particularly notable for compromising the sensitive details of an estimated\n43 million individuals\n.\nIntelBroker rose to notoriety for his involvement in highly publicized breaches at\nEuropol\n,\nGeneral Electric\n,\nWeee!\n,\nAMD\n,\nHPE\n,\nNokia\n, and\nCisco\n. However, the threat actor entered the spotlight after\nbreaching DC Health Link\n, the organization that administers the health care plans of U.S. House members, their staff, and their families.\nShinyHunters is the most notorious among those arrested, as the alias has been linked to multiple high-profile data breaches and attacks, including those against\nSalesforce\nand\nPowerSchool\n, and the\nSnowFlake attacks\n, which impacted\nSantander\n,\nTicketmaster\n,\nAT&T\n,\nAdvance Auto Parts\n,\nNeiman Marcus\n, and\nCylance\n.\nThe ShinyHunters threat actors have also been involved in a large number breaches in 2025, with the group believed to consist of multiple threat actors operating under the same name.\nBreachForums v2 went offline in April 2025 after the site was allegedly breached by a MyBB zero-day vulnerability. The forum never returned online.\nBleepingComputer has contacted the Paris police and ANSSI to comment on the validity and accuracy of the reports, but we have not received a response yet.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nOperation Secure disrupts global infostealer malware operations\nRyuk ransomware’s initial access expert extradited to the U.S.\nPolice seizes Archetyp Market drug marketplace, arrests admin\nStolen Ticketmaster data from Snowflake attacks briefly for sale again\nPolice arrests 20 suspects for distributing child sexual abuse content"
    },
    {
        "Title": "And Now Malware That Tells AI to Ignore It?",
        "Link": "https://www.darkreading.com/cloud-security/malware-tells-ai-to-ignore-it",
        "Summary": "Though rudimentary and largely non-functional, the wryly named &quot;Skynet&quot; binary could be a harbinger of things to come on the malware front.",
        "Date": "2025-06-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/malware-tells-ai-to-ignore-it"
    },
    {
        "Title": "Millions of Brother Printers Hit by Critical, Unpatchable Bug",
        "Link": "https://www.darkreading.com/endpoint-security/millions-brother-printers-critical-unpatchable-bug",
        "Summary": "A slew of vulnerabilities, including a critical CVSS 9.8 that enables an attacker to generate the default admin password, affect hundreds of printer, scanner, and label-maker models made by manufacturer Brother.",
        "Date": "2025-06-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/millions-brother-printers-critical-unpatchable-bug"
    },
    {
        "Title": "CISA Is Shrinking: What Does It Mean for Cyber?",
        "Link": "https://www.darkreading.com/cybersecurity-operations/cisa-is-shrinking-what-does-it-mean-for-cyber-",
        "Summary": "Dark Reading Confidential Episode 7: Cyber experts Tom Parker and Jake Williams offer their views on the practical impact of cuts to the US Cybersecurity and Infrastructure Security Agency.",
        "Date": "2025-06-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/cisa-is-shrinking-what-does-it-mean-for-cyber-"
    },
    {
        "Title": "Dire Wolf Ransomware Comes Out Snarling, Bites Technology, Manufacturing",
        "Link": "https://www.darkreading.com/threat-intelligence/dire-wolf-ransomware-manufacturing-technology",
        "Summary": "The emerging group has already gotten its teeth into 16 victims since May with its double extortion tactics, claiming victims in 11 countries, including the US, Thailand, and Taiwan.",
        "Date": "2025-06-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/dire-wolf-ransomware-manufacturing-technology"
    },
    {
        "Title": "Hundreds of MCP Servers Expose AI Models to Abuse, RCE",
        "Link": "https://www.darkreading.com/cloud-security/hundreds-mcp-servers-ai-models-abuse-rce",
        "Summary": "The servers that connect AI with real-world data are occasionally wide-open channels for cyberattacks.",
        "Date": "2025-06-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/hundreds-mcp-servers-ai-models-abuse-rce"
    },
    {
        "Title": "Generative AI Exacerbates Software Supply Chain Risks",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/generative-ai-exacerbates-software-supply-chain-risks",
        "Summary": "Malicious actors are exploiting AI-fabricated software components — presenting a major challenge for securing software supply chains.",
        "Date": "2025-06-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/generative-ai-exacerbates-software-supply-chain-risks"
    },
    {
        "Title": "XOR Marks the Flaw in SAP GUI",
        "Link": "https://www.darkreading.com/cloud-security/xor-flaw-sap-gui",
        "Summary": "The company has patched two vulnerabilities in its Graphical User Interface that would have allowed attackers to grab data from a user's input history feature.",
        "Date": "2025-06-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/xor-flaw-sap-gui"
    },
    {
        "Title": "Africa Sees Surge in Cybercrime as Law Enforcement Struggles",
        "Link": "https://www.darkreading.com/cyber-risk/africa-surge-cybercrime-law-enforcement-struggles",
        "Summary": "Cybercrime accounts for more than 30% of all reported crime in East Africa and West Africa, with online scams, ransomware, business email compromise, and digital sextortion taking off.",
        "Date": "2025-06-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/africa-surge-cybercrime-law-enforcement-struggles"
    },
    {
        "Title": "Thousands of SaaS Apps Could Still Be Susceptible to nOAuth",
        "Link": "https://www.securityweek.com/thousands-of-saas-apps-could-still-be-susceptible-to-noauth/",
        "Summary": "<p>New research suggests more than 10,000 SaaS apps could remain vulnerable to a nOAuth variant despite the basic issue being disclosed in June 2023.</p>\n<p>The post <a href=\"https://www.securityweek.com/thousands-of-saas-apps-could-still-be-susceptible-to-noauth/\">Thousands of SaaS Apps Could Still Be Susceptible to nOAuth</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/thousands-of-saas-apps-could-still-be-susceptible-to-noauth/"
    },
    {
        "Title": "Microsoft Offers Free Windows 10 Extended Security Update Options as EOS Nears",
        "Link": "https://www.securityweek.com/microsoft-offers-free-windows-10-extended-security-update-options-as-eos-nears/",
        "Summary": "<p>With end of support scheduled for October 2025, Windows 10 users will be able to continue receiving important security updates. </p>\n<p>The post <a href=\"https://www.securityweek.com/microsoft-offers-free-windows-10-extended-security-update-options-as-eos-nears/\">Microsoft Offers Free Windows 10 Extended Security Update Options as EOS Nears</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/microsoft-offers-free-windows-10-extended-security-update-options-as-eos-nears/"
    },
    {
        "Title": "Hackers Abuse ConnectWise to Hide Malware",
        "Link": "https://www.securityweek.com/hackers-abuse-connectwise-to-hide-malware/",
        "Summary": "<p>G Data has observed a surge in malware infections originating from ConnectWise applications with modified certificate tables.</p>\n<p>The post <a href=\"https://www.securityweek.com/hackers-abuse-connectwise-to-hide-malware/\">Hackers Abuse ConnectWise to Hide Malware</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/hackers-abuse-connectwise-to-hide-malware/"
    },
    {
        "Title": "SonicWall Warns of Trojanized NetExtender Stealing User Information",
        "Link": "https://www.securityweek.com/sonicwall-warns-of-trojanized-netextender-stealing-user-information/",
        "Summary": "<p>SonicWall says a modified version of the legitimate NetExtender application contains information-stealing code.</p>\n<p>The post <a href=\"https://www.securityweek.com/sonicwall-warns-of-trojanized-netextender-stealing-user-information/\">SonicWall Warns of Trojanized NetExtender Stealing User Information</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/sonicwall-warns-of-trojanized-netextender-stealing-user-information/"
    },
    {
        "Title": "New Vulnerabilities Expose Millions of Brother Printers to Hacking",
        "Link": "https://www.securityweek.com/new-vulnerabilities-expose-millions-of-brother-printers-to-hacking/",
        "Summary": "<p>Rapid7 has found several serious vulnerabilities affecting over 700 printer models from Brother and other vendors. </p>\n<p>The post <a href=\"https://www.securityweek.com/new-vulnerabilities-expose-millions-of-brother-printers-to-hacking/\">New Vulnerabilities Expose Millions of Brother Printers to Hacking</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/new-vulnerabilities-expose-millions-of-brother-printers-to-hacking/"
    },
    {
        "Title": "Why Sincerity Is a Strategic Asset in Cybersecurity",
        "Link": "https://www.securityweek.com/why-sincerity-is-a-strategic-asset-in-cybersecurity/",
        "Summary": "<p>Strong security doesn’t just rely on tools—it starts with trust, clarity, and sincerity from the top down.</p>\n<p>The post <a href=\"https://www.securityweek.com/why-sincerity-is-a-strategic-asset-in-cybersecurity/\">Why Sincerity Is a Strategic Asset in Cybersecurity</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/why-sincerity-is-a-strategic-asset-in-cybersecurity/"
    },
    {
        "Title": "Code Execution Vulnerability Patched in GitHub Enterprise Server",
        "Link": "https://www.securityweek.com/code-execution-vulnerability-patched-in-github-enterprise-server/",
        "Summary": "<p>A high-severity vulnerability in GitHub Enterprise Server could have allowed remote attackers to execute arbitrary code.</p>\n<p>The post <a href=\"https://www.securityweek.com/code-execution-vulnerability-patched-in-github-enterprise-server/\">Code Execution Vulnerability Patched in GitHub Enterprise Server</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/code-execution-vulnerability-patched-in-github-enterprise-server/"
    },
    {
        "Title": "Chrome 138, Firefox 140 Patch Multiple Vulnerabilities",
        "Link": "https://www.securityweek.com/chrome-138-firefox-140-patch-multiple-vulnerabilities/",
        "Summary": "<p>Chrome 138 and Firefox 140 are rolling out with fixes for two dozen vulnerabilities, including high-severity memory safety issues.</p>\n<p>The post <a href=\"https://www.securityweek.com/chrome-138-firefox-140-patch-multiple-vulnerabilities/\">Chrome 138, Firefox 140 Patch Multiple Vulnerabilities</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chrome-138-firefox-140-patch-multiple-vulnerabilities/"
    },
    {
        "Title": "Mainline Health, Select Medical Each Disclose Data Breaches Impacting 100,000 People",
        "Link": "https://www.securityweek.com/mainline-health-select-medical-each-disclose-data-breaches-impacting-100000-people/",
        "Summary": "<p>Mainline Health and Select Medical Holdings have suffered data breaches that affect more than 100,000 individuals. </p>\n<p>The post <a href=\"https://www.securityweek.com/mainline-health-select-medical-each-disclose-data-breaches-impacting-100000-people/\">Mainline Health, Select Medical Each Disclose Data Breaches Impacting 100,000 People</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/mainline-health-select-medical-each-disclose-data-breaches-impacting-100000-people/"
    },
    {
        "Title": "Russian APT Hits Ukrainian Government With New Malware via Signal",
        "Link": "https://www.securityweek.com/russian-apt-hits-ukrainian-government-with-new-malware-via-signal/",
        "Summary": "<p>Russia-linked APT28 deployed new malware against Ukrainian government targets through malicious documents sent via Signal chats.</p>\n<p>The post <a href=\"https://www.securityweek.com/russian-apt-hits-ukrainian-government-with-new-malware-via-signal/\">Russian APT Hits Ukrainian Government With New Malware via Signal</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/russian-apt-hits-ukrainian-government-with-new-malware-via-signal/"
    },
    {
        "Title": "Alliedbankers Insurance Corporation Allegedly Hit by Massive 80GB Data Breach",
        "Link": "https://dailydarkweb.net/alliedbankers-insurance-corporation-allegedly-hit-by-massive-80gb-data-breach/",
        "Summary": "Major Philippine non-life insurer, Alliedbankers Insurance Corporation, is allegedly the latest victim of a significant data breach. A threat actor has claimed to possess 80GB of data from the company, releasing an initial 5GB sample on a known cybercrime forum. The initial post announced the breach and shared a link to the first batch of [&#8230;]",
        "Date": "2025-06-25",
        "Content": "Major Philippine non-life insurer, Alliedbankers Insurance Corporation, is allegedly the latest victim of a significant data breach. A threat actor has claimed to possess 80GB of data from the company, releasing an initial 5GB sample on a known cybercrime forum. The initial post announced the breach and shared a link to the first batch of data, promising that a full dump of the company’s server would be made public soon.\nAlliedbankers Insurance Corporation, a key player in the Philippine financial sector since 1960 and a member of the Lucio Tan Group of Companies, provides a wide array of insurance services including motor, fire, personal accident, and marine coverage. The potential exposure of sensitive data belonging to its numerous clients raises serious concerns. The breach could impact thousands of individuals and businesses who have entrusted their information to the insurer.\nWhile the full contents of the 80GB server dump have not been verified, the initial files suggest a major compromise of the company’s systems. The allegedly leaked data may include:\nCustomer personally identifiable information (PII)\nInsurance policy details and records\nClaims information and documentation\nCorporate financial data\nInternal company documents\nThis incident is currently developing. Alliedbankers Insurance Corporation has not yet released a public statement regarding the alleged breach.\nTags:\nAlliedbankers\nCyberSecurity\ndata-breach\ndata-leak\nInsurance\nPhilippines"
    },
    {
        "Title": "Spanish Insurer Pelayo Seguros Allegedly Breached – Database of 1.5 Million Users For Sale",
        "Link": "https://dailydarkweb.net/spanish-insurer-pelayo-seguros-allegedly-breached-database-of-1-5-million-users-for-sale/",
        "Summary": "A threat actor has allegedly put a database containing the records of 1.5 million customers of Pelayo Seguros, a prominent Spanish insurance company, up for sale on a dark web forum. The seller claims the data is &#8220;fresh content&#8221; and is asking for $1,500 in cryptocurrency (Bitcoin or Monero) for the entire dataset. The post [&#8230;]",
        "Date": "2025-06-25",
        "Content": "A threat actor has allegedly put a database containing the records of 1.5 million customers of Pelayo Seguros, a prominent Spanish insurance company, up for sale on a dark web forum. The seller claims the data is “fresh content” and is asking for $1,500 in cryptocurrency (Bitcoin or Monero) for the entire dataset. The post was accompanied by a sample of the data structure to prove the legitimacy of the information.\nPelayo Seguros is a major player in the Spanish insurance market, with a history dating back to 1933. The company provides a wide range of insurance products, including automotive, home, life, and health policies, to over 845,000 members and holds more than 1.2 million policies. The alleged breach is significant, as the exposure of sensitive customer data could lead to a variety of malicious activities, including phishing campaigns, identity theft, and targeted fraud.\nThe compromised information allegedly includes a vast amount of personally identifiable information (PII) and other sensitive details. Based on the information shared by the seller, the leaked data fields include:\nFull Name (First and Last)\nNational ID (ID_CLI)\nIBAN (Bank Account Number)\nFull Address (Street, Postal Code, City, Region)\nEmail Address and status\nPhone Number (via contact fields)\nDate of Birth\nGender\nPolicy and Client Details\nInternal user and creation/modification dates\nTags:\nCyberSecurity\ndark web\ndata-breach\nInsurance\nPelayo Seguros\nPII Leak"
    },
    {
        "Title": "Alleged Data Leak at AKRAB Resource Malaysia Exposes Sensitive Student Information",
        "Link": "https://dailydarkweb.net/alleged-data-leak-at-akrab-resource-malaysia-exposes-sensitive-student-information/",
        "Summary": "An image circulating online suggests a significant data breach at a Malaysian entity identified as &#8220;AKRAB RESOURCE MALAYSIA,&#8221; exposing the personal and educational details of numerous students. The leaked data appears to primarily affect recipients of scholarships from prominent Malaysian foundations, including Yayasan Sime Darby (YSD) and Yayasan Peneraju Pendidikan Bumiputera. The leaked information, as [&#8230;]",
        "Date": "2025-06-25",
        "Content": "An image circulating online suggests a significant data breach at a Malaysian entity identified as “AKRAB RESOURCE MALAYSIA,” exposing the personal and educational details of numerous students. The leaked data appears to primarily affect recipients of scholarships from prominent Malaysian foundations, including Yayasan Sime Darby (YSD) and Yayasan Peneraju Pendidikan Bumiputera.\nThe leaked information, as displayed in the image, includes a range of sensitive data points for each student:\nFull Name\nContact Number\nNational Identity Card (IC) Number\nEmail Address\nScholarship Category (e.g., “YSD SKILL ENRICHMENT,” “Peneraju Tunas Potensi – YSD Bursary”)\nCourse of Study\nEducational Institution\nWhile the exact nature of AKRAB Resource Malaysia’s relationship with the affected foundations is not publicly detailed, it is plausible that the entity acts as a third-party administrator or vendor for the scholarship programs. In such cases, the data breach may have originated from this vendor rather than the foundations themselves.\nInvestigations into the entities mentioned reveal:\nAKRAB Resource Malaysia:\nThe name “AKRAB” is associated with several entities in Malaysia. While it stands for “Rakan Pembimbing Perkhidmatan Awam” (Public Service Counselling Associates) within government agencies, there are also privately-owned businesses registered as “AKRAB RESOURCES” and “AKRAB DATA RESOURCES SDN BHD.” The latter is listed as an information technology company.\nYayasan Sime Darby (YSD):\nA well-known foundation in Malaysia, YSD provides a significant number of scholarships and bursaries for students across various fields of study.\nPeneraju Tunas Potensi:\nThis is a scholarship program managed by Yayasan Peneraju Pendidikan Bumiputera, an agency under the Malaysian Ministry of Economy focused on developing local talent. The presence of a “YSD-Peneraju Tunas Potensi Bursary” in the leaked data indicates a collaborative effort between the two foundations.\nAs of now, there have been no official statements from AKRAB Resource Malaysia, Yayasan Sime Darby, or Yayasan Peneraju regarding this specific data leak. The incident highlights the growing concern over data security in Malaysia and the potential risks associated with third-party data management. Individuals who have applied for or received scholarships from these foundations are advised to be vigilant against potential phishing scams and identity theft.\nTags:\nAKRAB Resource Malaysia\nCyberSecurity\ndata-breach\nMalaysia\nPersonal Data Protection\nScholarship\nStudent Data Leak\nYayasan Peneraju\nYayasan Sime Darby\nYSD"
    },
    {
        "Title": "Saudi Mining & Logistics Firm Kalad Allegedly Breached, Full Database Leaked",
        "Link": "https://dailydarkweb.net/saudi-mining-logistics-firm-kalad-allegedly-breached-full-database-leaked/",
        "Summary": "A threat actor has allegedly breached Kalad, a company described as a mining and logistics contractor in Saudi Arabia. In a post on a cybercrime forum, the hacker claimed to have not only exfiltrated the company&#8217;s entire database but also defaced its official website, kalad.com.sa. The post included a screenshot of the defaced homepage as [&#8230;]",
        "Date": "2025-06-25",
        "Content": "A threat actor has allegedly breached Kalad, a company described as a mining and logistics contractor in Saudi Arabia. In a post on a cybercrime forum, the hacker claimed to have not only exfiltrated the company’s entire database but also defaced its official website, kalad.com.sa. The post included a screenshot of the defaced homepage as proof of the intrusion.\nKalad is allegedly a contractor in Saudi Arabia’s vital mining and logistics sector. Companies in this industry play a significant role in the Kingdom’s supply chain and economic infrastructure, making them potentially high-value targets for cyberattacks. The successful breach of such an entity could expose sensitive operational and commercial data, impacting its clients and business continuity.\nThe threat actor advertised a full database dump for download, which allegedly contains a wide range of sensitive information. The attacker also claimed the breach was accomplished using a “Zero-Day exploit.” The compromised data allegedly includes:\nFull client records\nInternal emails\nEmployee credentials\nContract files and more…\nTags:\ncyber-attack\nCyberSecurity\ndata-breach\ndatabase leak\nLogistics\nMining\nSaudi Arabia"
    },
    {
        "Title": "Cambodian Education Giant MJQ Education Allegedly Breached, Applicant Data Leaked",
        "Link": "https://dailydarkweb.net/cambodian-education-giant-mjq-education-allegedly-breached-applicant-data-leaked/",
        "Summary": "Mengly J. Quach Education (MJQ Education), a leading educational institution in Cambodia, has allegedly suffered a significant data breach. A threat actor has claimed responsibility for the attack, leaking sensitive information purportedly belonging to job applicants via a dark web forum. The compromised data appears to have been lifted from the institution&#8217;s recruitment portal, recruitment.mjqeducation.edu.kh. [&#8230;]",
        "Date": "2025-06-25",
        "Content": "Mengly J. Quach Education (MJQ Education), a leading educational institution in Cambodia, has allegedly suffered a significant data breach. A threat actor has claimed responsibility for the attack, leaking sensitive information purportedly belonging to job applicants via a dark web forum. The compromised data appears to have been lifted from the institution’s recruitment portal,\nrecruitment.mjqeducation.edu.kh\n.\nMJQ Education is one of the largest educational providers in the nation, operating the prominent Aii Language Centers and American Intercon School system. The company holds the distinction of being the first educational services provider to be listed on the Cambodia Securities Exchange, highlighting its importance in the country’s development. The breach reportedly originated from a forum post containing a link to a folder with the leaked information.\nThe leaked files allegedly contain a trove of personally identifiable information (PII) from individuals who have applied for positions at the institution. Analysis of the provided sample documents suggests the breach includes a wide range of sensitive data. The compromised information allegedly includes:\nCurriculum Vitae (CVs)\nNational ID cards\nCOVID-19 vaccination cards\nProvisional certificates and educational documents\nFamily and residence books (Sៀវភៅស្នាក់នៅ)\nThis incident raises serious privacy concerns for the individuals whose data has been exposed. The availability of such comprehensive personal information on the dark web could potentially lead to identity theft, fraud, and other malicious activities targeting the victims.\nTags:\nCambodia\nCyberSecurity\ndark web\ndata-breach\ndata-leak\nEducation\nMJQ Education\nPII"
    },
    {
        "Title": "Customer Documents from Dubai Motorcycle Rental Firm Allegedly Leaked Online",
        "Link": "https://dailydarkweb.net/customer-documents-from-dubai-motorcycle-rental-firm-allegedly-leaked-online/",
        "Summary": "A threat actor has allegedly offered a database for sale containing nearly 1,500 sets of personal documents purportedly belonging to customers of a motorcycle rental company in Dubai. The data was advertised on a dark web forum, raising concerns about the security of personal information required for vehicle rentals in the popular tourist and business [&#8230;]",
        "Date": "2025-06-25",
        "Content": "A threat actor has allegedly offered a database for sale containing nearly 1,500 sets of personal documents purportedly belonging to customers of a motorcycle rental company in Dubai. The data was advertised on a dark web forum, raising concerns about the security of personal information required for vehicle rentals in the popular tourist and business destination. The complete archive, containing 1,497 sets of documents, was listed for a price of $750.\nThe specific motorcycle rental company from which the data was allegedly stolen has not been named. Dubai is a major hub for tourism and business, with a thriving vehicle rental market that caters to both residents and international visitors. Companies in this sector routinely collect sensitive identification documents to comply with local regulations and for insurance purposes, making them a valuable target for malicious actors. A breach in this sector could potentially compromise the data of a wide range of individuals.\nThe threat actor posted several censored images as proof of the data, which appear to be scans of personal identification. The exposed information allegedly includes sensitive documents required for renting a vehicle. The data for sale is said to contain:\nPersonal Identification Documents\nID Cards\nVerification Photos\nThis incident highlights the ongoing risks of data breaches and the importance of robust cybersecurity measures for companies that handle sensitive personal information. The sale of such documents on the dark web could lead to identity theft, fraud, and other malicious activities targeting the individuals whose data was compromised.\nTags:\nCyberSecurity\ndark web\ndata-breach\nDubai\nidentity theft\nPrivacy\nUAE"
    },
    {
        "Title": "Akira Ransomware Allegedly Hits Six Companies, Including Seppeler Gruppe and Access Financial",
        "Link": "https://dailydarkweb.net/akira-ransomware-allegedly-hits-six-companies-including-seppeler-gruppe-and-access-financial/",
        "Summary": "The Akira ransomware group has allegedly expanded its list of victims, claiming to have breached six different companies in a widespread and varied attack. In a recent update to their dark web leak site, the threat actors threatened to publish gigabytes of sensitive corporate and personal data, demonstrating their continued focus on a double-extortion strategy. [&#8230;]",
        "Date": "2025-06-25",
        "Content": "The Akira ransomware group has allegedly expanded its list of victims, claiming to have breached six different companies in a widespread and varied attack. In a recent update to their dark web leak site, the threat actors threatened to publish gigabytes of sensitive corporate and personal data, demonstrating their continued focus on a double-extortion strategy.\nThe victims named in this alleged campaign span multiple critical industries, underscoring the broad scope of the operation. The targeted companies purportedly include:\nSeppeler Gruppe:\nAn international group of industrial service and production companies.\nAccess Financial:\nA leading global provider of contract management and payroll services.\nKeystone Shipping:\nA U.S.-based shipowner and operator with over a century of history.\nIntegrity Mortgage:\nA mortgage provider operating under the MAC 5 Mortgage umbrella.\nDatrose:\nA business outsourcing company specializing in document management and staffing.\nVS Associates:\nA financial firm providing wealth management and investment advice.\nThe attackers claim the stolen data is comprehensive and highly sensitive. If released, the information could cause significant operational and reputational damage. The allegedly exfiltrated data includes:\nPersonal employee and client information (Social Security numbers, dates of birth, addresses, and ID scans)\nCorporate financial data (audits, payment details, invoices, and salary information)\nConfidential legal and business documents (NDAs, contracts, and correspondence)\nProprietary operational data, including cargo ship blueprints\nTags:\nAccess Financial\nAkira\ncyber-attack\nCyberSecurity\ndata-breach\nDatrose\nIntegrity Mortgage\nKeystone Shipping\nransomware\nSeppeler Gruppe\nVS Associates"
    }
]