[
    {
        "Title": "Google Chrome Zero-Day CVE-2025-2783 Exploited by TaxOff to Deploy Trinper Backdoor",
        "Link": "https://thehackernews.com/2025/06/google-chrome-zero-day-cve-2025-2783.html",
        "Summary": "A now-patched security flaw in Google Chrome was exploited as a zero-day by a threat actor known as TaxOff to deploy a backdoor codenamed Trinper.\nThe attack, observed in mid-March 2025 by Positive Technologies, involved the use of a sandbox escape vulnerability tracked as CVE-2025-2783 (CVSS score: 8.3).\nGoogle addressed the flaw later that month after Kaspersky reported in-the-wild",
        "Date": "2025-06-17",
        "Content": "A now-patched security flaw in Google Chrome was exploited as a zero-day by a threat actor known as TaxOff to deploy a backdoor codenamed\nTrinper\n.\nThe attack, observed in mid-March 2025 by Positive Technologies, involved the use of a sandbox escape vulnerability tracked as CVE-2025-2783 (CVSS score: 8.3).\nGoogle\naddressed\nthe flaw later that month after Kaspersky reported in-the-wild exploitation in a campaign dubbed Operation ForumTroll targeting various Russian organizations.\n\"The initial attack vector was a phishing email containing a malicious link,\" security researchers Stanislav Pyzhov and Vladislav Lunin\nsaid\n. \"When the victim clicked the link, it triggered a one-click exploit (CVE-2025-2783), leading to the installation of the Trinper backdoor employed by TaxOff.\"\nThe phishing email is said to have been disguised as an invitation to the Primakov Readings forum – the same lure detailed by Kaspersky – urging users to click on a link that led to a fake website hosting the exploit.\nTaxOff is the name assigned to a\nhacking group\nthat was first documented by the Russian cybersecurity company in late November 2024 as targeting domestic government agencies using legal and finance-related phishing emails to deliver Trinper.\nWritten in C++, the backdoor makes use of multithreading to capture victim host information, record keystrokes, gather files matching specific extensions (.doc, .xls, .ppt, .rtf, and .pdf), and establish a connection with a remote server to receive commands and exfiltrate the results of the execution.\nThe instructions sent from the command-and-control (C2) server extend the implant's functionality, allowing it to read/write files, run commands using cmd.exe, launch a reverse shell, change directory, and shutdown itself.\n\"Multithreading provides a high degree of parallelism to hide the backdoor while retaining the ability to collect and exfiltrate data, install additional modules, and maintain communications with C2,\" Lunin noted at the time.\nPositive Technologies said its investigation into the mid-March 2025 intrusion led to the discovery of another attack dating back to October 2024 that also commenced with a phishing email, which purported to be an invitation to an international conference called \"Security of the Union State in the modern world.\"\nThe email message also contained a link, which downloaded a ZIP archive file containing a Windows shortcut that, in turn, launched a PowerShell command to ultimately serve a decoy document while also dropping a loader responsible for launching the Trinper backdoor by means of the open-source\nDonut\nloader. A variation of the attack has been found to swap out the Donut loader in favor of Cobalt Strike.\nThis attack chain, per the company, shares several tactical similarities with that of another hacking group tracked as\nTeam46\n, raising the possibility that the two threat activity clusters are one and the same.\nInterestingly, another set of phishing emails sent by the Team46 attackers a month before claimed to be from Moscow-based telecom operator Rostelecom, alerting recipients of supposed maintenance outages last year.\nThese emails included a ZIP archive, which embedded a shortcut that launched a PowerShell command to deploy a loader that had been previously used to deliver another backdoor in an attack targeting an unnamed Russian company in the rail freight industry.\nThe March 2024 intrusion,\ndetailed\nby Doctor Web, is notable for the fact that one of the payloads weaponized a DLL hijacking vulnerability in the Yandex Browser (\nCVE-2024-6473\n, CVSS score: 8.4) as a zero-day to download and execute unspecified malware. It was\nresolved\nin version 24.7.1.380 released in September 2024.\n\"This group leverages zero-day exploits, which enables it to penetrate secure infrastructures more effectively,\" the researchers said. \"The group also creates and uses sophisticated malware, implying that it has a long-term strategy and intends to maintain persistence on the compromised systems for an extended period.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "LangSmith Bug Could Expose OpenAI Keys and User Data via Malicious Agents",
        "Link": "https://thehackernews.com/2025/06/langchain-langsmith-bug-let-hackers.html",
        "Summary": "Cybersecurity researchers have disclosed a now-patched security flaw in LangChain's LangSmith platform that could be exploited to capture sensitive data, including API keys and user prompts.\nThe vulnerability, which carries a CVSS score of 8.8 out of a maximum of 10.0, has been codenamed AgentSmith by Noma Security.\nLangSmith is an observability and evaluation platform that allows users to",
        "Date": "2025-06-17",
        "Content": "Cybersecurity researchers have disclosed a now-patched security flaw in LangChain's LangSmith platform that could be exploited to capture sensitive data, including API keys and user prompts.\nThe vulnerability, which carries a CVSS score of 8.8 out of a maximum of 10.0, has been codenamed\nAgentSmith\nby Noma Security.\nLangSmith\nis an observability and evaluation platform that allows users to develop, test, and monitor large language model (LLM) applications, including those built using LangChain. The service also offers what's called a\nLangChain Hub\n, which acts as a repository for all publicly listed prompts, agents, and models.\n\"This newly identified vulnerability exploited unsuspecting users who adopt an agent containing a pre-configured malicious proxy server uploaded to 'Prompt Hub,'\" researchers Sasi Levi and Gal Moyal\nsaid\nin a report shared with The Hacker News.\n\"Once adopted, the malicious proxy discreetly intercepted all user communications – including sensitive data such as API keys (including OpenAI API Keys), user prompts, documents, images, and voice inputs – without the victim's knowledge.\"\nThe first phase of the attack essentially unfolds thus: A bad actor crafts an artificial intelligence (AI) agent and configures it with a model server under their control via the\nProxy Provider feature\n, which allows the prompts to be tested against any model that is compliant with the OpenAI API. The attacker then shares the agent on LangChain Hub.\nThe next stage kicks in when a user finds this malicious agent via LangChain Hub and proceeds to \"Try It\" by providing a prompt as input. In doing so, all of their communications with the agent are stealthily routed through the attacker's proxy server, causing the data to be exfiltrated without the user's knowledge.\nThe captured data could include OpenAI API keys, prompt data, and any uploaded attachments. The threat actor could weaponize the OpenAI API key to gain unauthorized access to the victim's OpenAI environment, leading to more severe consequences, such as model theft and system prompt leakage.\nWhat's more, the attacker could use up all of the organization's API quota, driving up billing costs or temporarily restricting access to OpenAI services.\nIt doesn't end there. Should the victim opt to clone the agent into their enterprise environment, along with the embedded malicious proxy configuration, it risks continuously leaking valuable data to the attackers without giving any indication to them that their traffic is being intercepted.\nFollowing responsible disclosure on October 29, 2024, the vulnerability was addressed in the backend by LangChain as part of a fix deployed on November 6. In addition, the patch implements a warning prompt about data exposure when users attempt to clone an agent containing a custom proxy configuration.\n\"Beyond the immediate risk of unexpected financial losses from unauthorized API usage, malicious actors could gain persistent access to internal datasets uploaded to OpenAI, proprietary models, trade secrets and other intellectual property, resulting in legal liabilities and reputational damage,\" the researchers said.\nNew WormGPT Variants Detailed\nThe disclosure comes as Cato Networks revealed that threat actors have released two previously unreported WormGPT variants that are powered by xAI Grok and Mistral AI Mixtral.\nWormGPT\nlaunched\nin mid-2023 as an uncensored generative AI tool designed to expressly facilitate malicious activities for threat actors, such as creating tailored phishing emails and writing snippets of malware. The project\nshut down\nnot long after the tool's author was\nouted\nas a 23-year-old Portuguese programmer.\nSince then several new \"WormGPT\" variants have been advertised on cybercrime forums like BreachForums, including xzin0vich-WormGPT and keanu-WormGPT, that are designed to provide \"uncensored responses to a wide range of topics\" even if they are \"unethical or illegal.\"\n\"'WormGPT' now serves as a recognizable brand for a new class of uncensored LLMs,\" security researcher Vitaly Simonovich\nsaid\n.\n\"These new iterations of WormGPT are not bespoke models built from the ground up, but rather the result of threat actors skillfully adapting existing LLMs. By manipulating system prompts and potentially employing fine-tuning on illicit data, the creators offer potent AI-driven tools for cybercriminal operations under the WormGPT brand.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Silver Fox APT Targets Taiwan with Complex Gh0stCringe and HoldingHands RAT Malware",
        "Link": "https://thehackernews.com/2025/06/silver-fox-apt-targets-taiwan-with.html",
        "Summary": "Cybersecurity researchers are warning of a new phishing campaign that's targeting users in Taiwan with malware families such as HoldingHands RAT and Gh0stCringe.\nThe activity is part of a broader campaign that delivered the Winos 4.0 malware framework earlier this January by sending phishing messages impersonating Taiwan's National Taxation Bureau, Fortinet FortiGuard Labs said in a report",
        "Date": "2025-06-17",
        "Content": "Cybersecurity researchers are warning of a new phishing campaign that's targeting users in Taiwan with malware families such as HoldingHands RAT and Gh0stCringe.\nThe activity is part of a broader campaign that delivered the\nWinos 4.0\nmalware framework earlier this January by\nsending phishing messages\nimpersonating Taiwan's National Taxation Bureau, Fortinet FortiGuard Labs\nsaid\nin a report shared with The Hacker News.\nThe cybersecurity company said it identified additional malware samples through continuous monitoring and that it observed the same threat actor, referred to as Silver Fox APT, using malware-laced PDF documents or ZIP files distributed via phishing emails to deliver Gh0stCringe and a malware strain based on HoldingHands RAT.\nIt's worth noting that both\nHoldingHands RAT\n(aka Gh0stBins) and\nGh0stCringe\nare variants of a known remote access trojan called Gh0st RAT, which is widely used by Chinese hacking groups.\nThe starting point of the attack is a phishing email that masquerades as messages from the government or business partners, employing lures related to taxes, invoices, and pensions to persuade recipients into opening the attachment. Alternate attack chains have been found to leverage an embedded image that, when clicked, downloads the malware.\nThe PDF files, in turn, contain a link that redirects prospective targets to a download page hosting a ZIP archive. Present within the file are several legitimate executables, shellcode loaders, and encrypted shellcode.\nThe multi-stage infection sequence entails the use of the shellcode loader to decrypt and execute the shellcode, which is nothing but DLL files sideloaded by the legitimate binaries using DLL side-loading techniques. Intermediate payloads deployed as part of the attack incorporate anti-VM and privilege escalation so as to ensure that the malware runs unimpeded on the compromised host.\nThe attack culminates with the execution of \"msgDb.dat,\" which implements command-and-control (C2) functions to collect user information and download additional modules to facilitate file management and remote desktop capabilities.\nFortinet said it also discovered the threat actor propagating Gh0stCringe via PDF attachments in phishing emails that take users to document download HTM pages.\n\"The attack chain comprises numerous snippets of shellcode and loaders, making the attack flow complex,\" the company said. \"Across winos, HoldingHands, and Gh0stCringe, this threat group continuously evolves its malware and distribution strategies.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Google Warns of Scattered Spider Attacks Targeting IT Support Teams at U.S. Insurance Firms",
        "Link": "https://thehackernews.com/2025/06/google-warns-of-scattered-spider.html",
        "Summary": "The notorious cybercrime group known as Scattered Spider (aka UNC3944) that recently targeted various U.K. and U.S. retailers has begun to target major insurance companies, according to Google Threat Intelligence Group (GTIG).\n\"Google Threat Intelligence Group is now aware of multiple intrusions in the U.S. which bear all the hallmarks of Scattered Spider activity,\" John Hultquist, chief analyst",
        "Date": "2025-06-17",
        "Content": "The notorious cybercrime group known as Scattered Spider (aka UNC3944) that recently targeted\nvarious U.K. and U.S. retailers\nhas begun to target major insurance companies, according to Google Threat Intelligence Group (GTIG).\n\"Google Threat Intelligence Group is now aware of multiple intrusions in the U.S. which bear all the hallmarks of Scattered Spider activity,\" John Hultquist, chief analyst at GTIG, said in an email Monday.\n\"We are now seeing incidents in the insurance industry. Given this actor's history of focusing on a sector at a time, the insurance industry should be on high alert, especially for social engineering schemes which target their help desks and call centers.\"\nScattered Spider is the name assigned to an amorphous collective that's known for its use of advanced social engineering tactics to breach organizations. In recent months, the threat actors are believed to have forged an alliance with the DragonForce ransomware cartel in the wake of the latter's supposed takeover of\nRansomHub\n's infrastructure.\n\"The group has repeatedly demonstrated its ability to impersonate employees, deceive IT support teams, and bypass multi-factor authentication (MFA) through cunning psychological tactics,\" SOS Intelligence\nsaid\n.\n\"Often described as 'native English speakers,' they are suspected to operate in or have ties to Western countries, bringing a cultural fluency that makes their phishing and phone-based attacks alarmingly effective.\"\nEarlier this month, ReliaQuest\nrevealed\nthat Scattered Spider and DragonForce are increasingly targeting managed service providers (MSPs) and IT contractors to obtain access to several downstream customers through a single compromise.\nGoogle-owned Mandiant\nsaid\nthe threat actors often single out large enterprise organizations, likely hoping to land a bigger payday.\nParticularly targeted are enterprises with large help desks and outsourced IT functions that are susceptible to social engineering attacks.\nTo mitigate against tactics utilized by the e-crime group, it's recommended to enhance authentication, enforce rigorous identity controls, implement access restrictions and boundaries to prevent privilege escalation and lateral movement, and train help desk personnel to positively identify employees before resetting their accounts.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Are Forgotten AD Service Accounts Leaving You at Risk?",
        "Link": "https://thehackernews.com/2025/06/are-forgotten-ad-service-accounts.html",
        "Summary": "For many organizations, Active Directory (AD) service accounts are quiet afterthoughts, persisting in the background long after their original purpose has been forgotten. To make matters worse, these orphaned service accounts (created for legacy applications, scheduled tasks, automation scripts, or test environments) are often left active with non-expiring or stale passwords.\nIt’s no surprise",
        "Date": "2025-06-17",
        "Content": "For many organizations, Active Directory (AD) service accounts are quiet afterthoughts, persisting in the background long after their original purpose has been forgotten. To make matters worse, these orphaned service accounts (created for legacy applications, scheduled tasks, automation scripts, or test environments) are often left active with non-expiring or stale passwords.\nIt's no surprise that AD service accounts often evade routine security oversight. Security teams, overwhelmed by daily demands and lingering technical debt, often overlook service accounts (unlinked to individual users and rarely scrutinized) allowing them to quietly fade into the background. However, this obscurity makes them prime targets for attackers seeking stealthy ways into the network. And left unchecked, forgotten service accounts can serve as silent gateways for attack paths and lateral movement across enterprise environments. In this article, we'll examine the risks that forgotten AD service accounts pose and how you can reduce your exposure.\nUncover and inventory the forgotten\nAs the old cybersecurity adage goes, you can't protect what you can't see. This holds especially true for AD service accounts. Gaining visibility is the first step to securing them, but orphaned or unmonitored service accounts often operate silently in the background, escaping notice and oversight. These forgotten service accounts are especially problematic, as they've played a central role in some of the most damaging breaches in recent years. In the case of the\n2020 SolarWinds attack\n, compromised service accounts were instrumental in helping threat actors navigate targeted environments and access sensitive systems.\nOnce attackers gain a foothold through phishing or social engineering, their next move typically involves hunting for service accounts to exploit and using them to elevate privileges and move laterally through the network. Fortunately, administrators have a variety of techniques available to identify and uncover forgotten or unmonitored AD service accounts:\nQuery AD for service principal name (SPN)-enabled accounts, which are typically used by services to authenticate with other systems.\nFilter for accounts with non-expiring passwords, or those that haven't logged in for an extended period.\nScan scheduled tasks and scripts for hard-coded or embedded credentials that reference unused accounts.\nReview group membership anomalies, where service accounts may have inherited elevated privileges over time.\nAudit your Active Directory. You can run a read-only scan today with Specops' free AD auditing tool:\nSpecops Password Auditor\nA real-world example: Botnet exploits forgotten accounts\nIn early 2024, security researchers discovered a\nbotnet of over 130,000 devices\ntargeting Microsoft 365 service accounts in a massive password-spraying campaign. The attackers bypassed multi-factor authentication (MFA) by abusing basic authentication, an outdated authentication scheme still enabled in many environments. Because these attacks didn't trigger typical security alerts, many organizations were unaware they were compromised. This example is just one of many that highlight the importance of securing service accounts and eliminating legacy authentication mechanisms.\nPrivilege creep leads to silent escalation\nEven service accounts that were initially created with minimal permissions can become dangerous over time. This scenario, known as privilege creep, occurs when accounts accumulate permissions due to system upgrades, role changes, or nested group memberships. What starts as a low-risk utility account can quietly evolve into a high-impact threat, capable of accessing critical systems without anyone realizing it.\nSecurity teams should therefore review service account roles and permissions on a regular basis; if access isn't actively managed, even well-intentioned configurations can drift into risky territory.\nKey practices for securing AD service accounts\nEffective AD service account management requires a deliberate, disciplined approach, as these logins are high-value targets that require proper handling. Here are\nsome best practices\nthat form the backbone of a strong AD service account security strategy:\nEnforce least privilege\nGrant only the permissions absolutely necessary for each account to function. Avoid placing service accounts in broad or powerful groups like Domain Admins.\nUse managed service accounts and group managed service accounts\nManaged service accounts (MSAs) and group managed service accounts (gMSAs) provide automatic password rotation and cannot be used for interactive logins—this makes them safer than traditional user accounts and easier to maintain securely.\nAudit regularly\nUse built-in AD auditing or third-party tools to track account usage, logins, and permission changes. Watch for signs of misuse or misconfiguration.\nEnforce strong password policies\nLong, complex passphrases\nshould be the standard. Avoid reused or hard-coded credentials. Passwords should be rotated regularly or managed through automated tooling.\nRestrict usage\nService accounts should not allow interactive logins. Assign a unique account to each service or application to contain any potential compromise.\nActively disable unused accounts\nIf an account is no longer in use, it should be disabled immediately. Periodic PowerShell queries can help identify stale or inactive accounts.\nSeparate roles\nCreate distinct service accounts for different functions like application services, database access, network tasks. This compartmentalization reduces the impact radius of any one compromise.\nApply MFA where necessary\nAlthough service accounts should not support interactive logins, some instances may require exceptions. For these edge cases,\nenable MFA\nto increase security.\nUse dedicated organizational units\nGrouping service accounts in specific organizational units (OUs) simplifies policy enforcement and auditing. It also makes it easier to spot anomalies and maintain consistency.\nReview dependencies and access\nAs environments evolve, revisit what each service account is used for and whether it still needs the same level of access. Adjust or retire accounts accordingly.\nAutomation and tools streamline AD service account security\nSpecops Password Auditor performs read-only scans of Active Directory to identify weak passwords, unused accounts, and other vulnerabilities, all without changing any AD settings. With built-in reports and alerts, security teams can proactively address AD service account risks instead of waiting for a breach to happen. Automating password management, policy enforcement, and auditing both strengthens security and reduces administrative overhead.\nDownload for free\n.\nFinding issues is one thing, but we also need to focus on prevention. Implementing the other best practices listed in this article manually is no small feat. Fortunately, tools like\nSpecops Password Policy\ncan help automate many of these processes, enforcing these best practices in a manageable and scalable way across your entire Active Directory environment.\nBook a Specops Password Policy demo today.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Hard-Coded 'b' Password in Sitecore XP Sparks Major RCE Risk in Enterprise Deployments",
        "Link": "https://thehackernews.com/2025/06/hard-coded-b-password-in-sitecore-xp.html",
        "Summary": "Cybersecurity researchers have disclosed three security flaws in the popular Sitecore Experience Platform (XP) that could be chained to achieve pre-authenticated remote code execution.\nSitecore Experience Platform is an enterprise-oriented software that provides users with tools for content management, digital marketing, and analytics and reports.\nThe list of vulnerabilities, which are yet to be",
        "Date": "2025-06-17",
        "Content": "Cybersecurity researchers have disclosed three security flaws in the popular Sitecore Experience Platform (XP) that could be chained to achieve pre-authenticated remote code execution.\nSitecore Experience Platform is an\nenterprise-oriented software\nthat provides users with tools for content management, digital marketing, and analytics and reports.\nThe list of vulnerabilities, which are yet to be assigned CVE identifiers, is as follows -\nUse of hard-coded credentials\nPost-authenticated remote code execution via path traversal\nPost-authenticated remote code execution via Sitecore PowerShell Extension\nwatchTowr Labs researcher Piotr Bazydlo said the\ndefault user account\n\"sitecore\\ServicesAPI\" has a single-character password that's hard-coded to \"\nb\n.\"\nWhile the user has no roles and permissions assigned in Sitecore, the attack surface management firm found that the credentials could be alternately used against the \"/sitecore/admin\" API endpoint to sign in as \"sitecore\\ServicesAPI\" and obtain a valid session cookie for the user.\n\"While we can't access 'Sitecore Applications' (where a significant portion of functionality is defined) as the ServicesAPI has no roles assigned, we can still: (1) Access a number of APIs, and (2) Pass through IIS authorization rules and directly access some endpoints,\" Bazydlo\nexplained\n.\nThis, in turn, opens the door to remote code execution via a\nzip slip vulnerability\nthat makes it possible to upload a specially crafted ZIP file via the \"/sitecore/shell/Applications/Dialogs/Upload/Upload2.aspx\" endpoint and causes the archive's contents (e.g., a web shell) to be written to the webroot directory.\nThe entire sequence of actions is listed below -\nAuthenticate as the \"sitecore\\ServicesAPI\" user\nAccess Upload2.aspx\nUpload a ZIP file, which contains a web shell called /\\/../<web_shell>\nWhen prompted, check the Unzip option and complete the upload\nAccess the web shell\nThe third vulnerability has to do with an unrestricted file upload flaw in PowerShell Extensions that can also be exploited as the \"sitecore\\ServicesAPI\" user to achieve remote code execution through the \"/sitecore%20modules/Shell/PowerShell/UploadFile/PowerShellUploadFile2.aspx\" endpoint.\nwatchTowr pointed out that the hard-coded password originates from within the Sitecore installer that imports a pre-configured user database with the ServicesAPI password set to \"b.\" This change, the company said, went into effect starting version 10.1.\nThis also means that the exploit chain only works if users have installed Sitecore using installers for versions ≥ 10.1. Users are likely not impacted if they were previously running a version prior to 10.1 and then upgraded to a newer vulnerable version, assuming the old database is being migrated, and not the database embedded within the installation package.\nWith previously disclosed flaws in Sitecore XP coming under active exploitation in the wild (\nCVE-2019-9874 and CVE-2019-9875\n), it's essential that users apply the latest patches, if not already, to safeguard against potential cyber threats.\n\"By default, recent versions of Sitecore shipped with a user that had a hard-coded password of 'b.' It's 2025, and we can't believe we still have to say this, but that's very bad,\" Benjamin Harris, CEO and founder of watchTowr, told The Hacker News in a statement.\n\"Sitecore is deployed across thousands of environments, including banks, airlines, and global enterprises – so the blast radius here is massive. And no, this isn't theoretical: we've run the full chain, end-to-end. If you're running Sitecore, it doesn't get worse than this – rotate creds and patch immediately before attackers inevitably reverse engineer the fix.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Backups Are Under Attack: How to Protect Your Backups",
        "Link": "https://thehackernews.com/2025/06/how-to-protect-your-backups-from-ransomware-attacks.html",
        "Summary": "Ransomware has become a highly coordinated and pervasive threat, and traditional defenses are increasingly struggling to neutralize it. Today’s ransomware attacks initially target your last line of defense — your backup infrastructure. Before locking up your production environment, cybercriminals go after your backups to cripple your ability to recover, increasing the odds of a ransom payout.",
        "Date": "2025-06-17",
        "Content": "Ransomware has become a highly coordinated and pervasive threat, and traditional defenses are increasingly struggling to neutralize it. Today's ransomware attacks initially target your last line of defense — your backup infrastructure. Before locking up your production environment, cybercriminals go after your backups to cripple your ability to recover, increasing the odds of a ransom payout.\nNotably, these attacks are carefully engineered takedowns of your defenses. The threat actors disable backup agents, delete snapshots, modify retention policies, encrypt backup volumes (especially those that are network accessible) and exploit vulnerabilities in integrated backup platforms. They are no longer trying just to deny your access but erase the very means of recovery. If your backup environment isn't built with this evolving threat landscape in mind, it's at high risk of getting compromised.\nHow can IT pros defend against this? In this guide, we'll uncover the weak strategies that leave backups exposed and explore actionable steps to harden both on-site and cloud-based backups against ransomware. Let's see how to build a resilient backup strategy, one that you can trust 100% even in the face of sophisticated ransomware attacks.\nCommon pitfalls that leave backups exposed\nInadequate separation and the lack of offsite or immutable copies are among the most common weaknesses in backup strategies. Snapshots or local backups alone aren't enough; if they reside in the same on-site environment as production systems, they can be easily discovered, encrypted or deleted by attackers. Without proper isolation, backup environments are highly susceptible to lateral movement, allowing ransomware to spread from compromised systems to backup infrastructure.\nHere are some of the most common lateral attack techniques used to compromise backups:\nActive Directory (AD) attacks: Attackers exploit AD to escalate privileges and gain access to backup systems.\nVirtual host takeover: Malicious actors utilize a misconfiguration or vulnerability in the guest tools or hypervisor code to control the hypervisor and virtual machines (VMs), including those hosting backups.\nWindows-based software attacks: Threat actors exploit built-in Windows services and known behaviors across versions for entry points into backup software and backup repositories.\nCommon vulnerabilities and exposures (CVE) exploit: High-severity CVEs are routinely targeted to breach backup hosts before patches are applied.\nAnother major pitfall is relying on a single cloud provider for cloud backups, which creates a single point of failure and increases the risk of total data loss. For instance, if you're backing up Microsoft 365 data in the Microsoft environment, your backup infrastructure and source systems share the same ecosystem, making them easy to discover. With stolen credentials or application programming interface (API) access, attackers can compromise both at once.\nBuild backup resilience with the 3-2-1-1-0 strategy\nThe 3-2-1 backup rule has long been the gold standard in data protection. However, as ransomware increasingly targets backup infrastructure, it's no longer enough. Today's threat landscape calls for a more resilient approach, one that assumes attackers will try to destroy your ability to recover.\nThat's where the 3-2-1-1-0 strategy comes in. This approach aims to keep three copies of your data and store them on two different media, with one copy offsite, one immutable copy and zero backup errors.\nFig 1: The 3-2-1-1-0 backup strategy\nHere's how it works:\n3 copies of data: 1 production + 2 backups\nWhen backing up, it's critical not to rely solely on file-level backups. Use image-based backups that capture the full system — the operating system (OS), applications, settings and data — for more complete recovery. Look for capabilities, such as bare metal recovery and instant virtualization.\nUse a dedicated backup appliance (physical or virtual) instead of standard backup software for greater isolation and control. When looking for appliances, consider ones built on hardened Linux to reduce the attack surface and avoid Windows-based vulnerabilities and commonly targeted file types.\n2 different media formats\nStore backups on two distinct media types — local disk and cloud storage — to diversify risk and prevent simultaneous compromise.\n1 offsite copy\nEnsure one backup copy is stored offsite and geographically separated to protect against natural disasters or site-wide attacks. Use a physical or logical airgap wherever possible.\n1 immutable copy\nMaintain at least one backup copy in an immutable cloud storage so that it cannot be altered, encrypted or deleted by ransomware or rogue users.\n0 errors\nBackups must be regularly verified, tested and monitored to ensure they're error-free and recoverable when needed. Your strategy isn't complete until you have full confidence in recovery.\nTo make the 3-2-1-1-0 strategy truly effective, it's critical to harden the environment where your backups live. Consider the following best practices:\nDeploy the backup server in a secure local area network (LAN) environment to limit accessibility.\nRestrict access using the principle of least privilege. Use role-based access control (RBAC) to ensure no local domain accounts have admin rights over the backup systems.\nSegment backup networks with no inbound traffic from the internet. Only allow outbound. Also, only protected systems should be able to communicate with the backup server.\nEmploy a firewall to enforce network access controls and use port-based access control lists (ACLs) on network switch ports.\nDeploy agent-level encryption so data written to the backup server is encrypted using a unique key that only you can generate with your own passphrase.\nDisable unused services and ports to reduce the number of potential attack vectors.\nEnable multifactor authentication (MFA) — preferably biometric rather than time-based one-time password (TOTP) — for all access to the backup environment.\nKeep backup systems patched and up to date to avoid exposure to known vulnerabilities.\nPhysically secure all backup devices with locked enclosures, access logs and surveillance measures.\nBest practices for securing cloud-based backups\nRansomware can just as easily target cloud platforms, especially when backups live in the same ecosystem. That's why segmentation and isolation are critical.\nData segmentation and isolation\nTo build a true air gap in the cloud, backup data must reside in a separate cloud infrastructure with its own authentication system. Avoid any reliance on production-stored secrets or credentials. This separation reduces the risk of a compromised production environment impacting your backups.\nUse private cloud backup architecture\nChoose services that move backup data out of the source environment and into an alternative cloud environment, such as a private cloud. This creates a logically isolated environment that's shielded from original access vectors, delivering the air-gapped protection needed to withstand modern ransomware. Shared environments make it easier for attackers to discover, access or destroy both source and backup assets in a single campaign.\nAuthentication and access control\nCloud-based backups should use a completely separate identity system. Implement MFA (preferably biometric), RBAC and alerting for unauthorized changes, such as agent removal or retention policy modifications. Credentials must never be stored in the same ecosystem being backed up. Keeping access tokens and secrets outside of the production environment (like Azure or Microsoft 365) eliminates any dependency on them for backup recovery.\nHow Datto BCDR secures your backups for 100% recovery confidence\nEven with the right strategy, resilience ultimately depends on the tools you choose. That's where Datto's business continuity and disaster recovery (BCDR) platform stands out. Datto BCDR offers seamless local and cloud continuity powered by its SIRIS and ALTO appliances and immutable Datto BCDR Cloud. It ensures your backups are always recoverable, even in worst-case scenarios.\nFig 2: How Datto BCDR delivers business continuity\nHere's how Datto BCDR delivers guaranteed recovery:\nLocal and cloud redundancy\n: Datto BCDR provides robust backup appliances that double as local recovery targets. You can run workloads and applications directly on the device during a failure. If on-prem systems are compromised, recovery shifts seamlessly to the Datto BCDR Cloud for virtualized operations, ensuring business continuity without disruption.\nThe power of immutable Datto BCDR Cloud\n: Purpose-built for backup and disaster recovery, the Datto BCDR Cloud delivers unmatched flexibility, security and performance. It goes beyond basic offsite storage to offer multilayered protection, making critical data both safe and instantly recoverable.\nEffective ransomware defense\n: Datto appliances run on a hardened Linux architecture to mitigate vulnerabilities commonly targeted in Windows systems. They also include built-in ransomware detection that actively scans for threats before any recovery is initiated.\nAutomated, verified backup testing\n: Datto's automated screenshot verification confirms that VMs can boot from backups. It also performs application-level checks to ensure workloads function correctly after restore, helping IT teams validate recovery without guesswork.\nLightning-fast recovery options to make recovery seamless include\n:\nFeatures like 1-Click Disaster Recovery (1-Click DR) that make disaster recovery near instant.\nSecure, image-based backups for full-system restoration.\nCloud Deletion Defense™ to instantly recover deleted cloud snapshots, whether accidental or malicious.\nIs it time to rethink your backup strategy?\nCyber resilience starts with backup security. Before ransomware strikes, ask yourself: Are your backups truly separated from your production systems? Can they be deleted or encrypted by compromised accounts? When was the last time you tested them?\nNow is the time to evaluate your backup strategy through a risk-based lens. Identify the gaps, fortify the weak points and make recovery a certainty — not a question.\nExplore how Datto BCDR can help you implement a secure, resilient backup architecture that's built for real-world threats.\nGet pricing today.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "New Flodrix Botnet Variant Exploits Langflow AI Server RCE Bug to Launch DDoS Attacks",
        "Link": "https://thehackernews.com/2025/06/new-flodrix-botnet-variant-exploits.html",
        "Summary": "Cybersecurity researchers have called attention to a new campaign that's actively exploiting a recently disclosed critical security flaw in Langflow to deliver the Flodrix botnet malware.\n\"Attackers use the vulnerability to execute downloader scripts on compromised Langflow servers, which in turn fetch and install the Flodrix malware,\" Trend Micro researchers Aliakbar Zahravi, Ahmed Mohamed",
        "Date": "2025-06-17",
        "Content": "Cybersecurity researchers have called attention to a new campaign that's actively exploiting a recently disclosed critical security flaw in Langflow to deliver the\nFlodrix\nbotnet malware.\n\"Attackers use the vulnerability to execute downloader scripts on compromised Langflow servers, which in turn fetch and install the Flodrix malware,\" Trend Micro researchers Aliakbar Zahravi, Ahmed Mohamed Ibrahim, Sunil Bharti, and Shubham Singh\nsaid\nin a technical report published today.\nThe activity entails the exploitation of\nCVE-2025-3248\n(CVSS score: 9.8), a missing authentication vulnerability in\nLangflow\n, a Python-based \"visual framework\" for building artificial intelligence (AI) applications.\nSuccessful exploitation of the flaw could enable unauthenticated attackers to execute arbitrary code via crafted HTTP requests. It was patched by Langflow in March 2025 with version 1.3.0.\nLast month, the U.S. Cybersecurity and Infrastructure Security Agency (CISA)\nflagged\nthe active exploitation of CVE-2025-3248 in the wild, with the SANS Technology Institute revealing that it detected exploit attempts against its honeypot servers.\nThe latest findings from Trend Micro show that threat actors are targeting unpatched internet-exposed Langflow instances leveraging a\npublicly-available\nproof-of-concept (PoC) code to conduct reconnaissance and drop a shell script downloader responsible for retrieving and executing the Flodrix botnet malware from \"80.66.75[.]121:25565.\"\nOnce installed, Flodrix sets up communications with a remote server to receive commands over TCP in order to launch distributed denial-of-service (DDoS) attacks against target IP addresses of interest. The botnet also supports connections over the TOR anonymity network.\n\"Since Langflow does not enforce input validation or sandboxing, these payloads are compiled and executed within the server's context, leading to [remote code execution],\" the researchers said. \"Based on these steps, the attacker is likely profiling all vulnerable servers and uses the collected data to identify high-value targets for future infections.\"\nTrend Micro said it identified the unknown threat actors to be hosting different downloader scripts on the same host used to fetch Flodrix, suggesting that the campaign is undergoing active development.\nFlodrix is assessed to be an evolution of another botnet called\nLeetHozer\nthat's linked to the\nMoobot group\n. The improved variant incorporates the ability to discreetly remove itself, minimize forensic traces, and complicate analysis efforts by obfuscating command-and-control (C2) server addresses and other important indicators.\n\"Another significant change is the introduction of new DDoS attack types, which are now also encrypted, adding a further layer of obfuscation,\" Trend Micro said. \"The new sample also notably enumerates the running processes by opening /proc directory to access all running processes.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "TP-Link Router Flaw CVE-2023-33538 Under Active Exploit, CISA Issues Immediate Alert",
        "Link": "https://thehackernews.com/2025/06/tp-link-router-flaw-cve-2023-33538.html",
        "Summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Monday added a high-severity security flaw in TP-Link wireless routers to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation.&nbsp;\nThe vulnerability in question is CVE-2023-33538 (CVSS score: 8.8), a command injection bug that could result in the execution of arbitrary system commands when",
        "Date": "2025-06-17",
        "Content": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Monday\nadded\na high-severity security flaw in TP-Link wireless routers to its Known Exploited Vulnerabilities (\nKEV\n) catalog, citing evidence of active exploitation.\nThe vulnerability in question is\nCVE-2023-33538\n(CVSS score: 8.8), a command injection bug that could result in the\nexecution of arbitrary system commands\nwhen processing the ssid1 parameter in a specially crafted HTTP GET request.\n\"TP-Link TL-WR940N V2/V4, TL-WR841N V8/V10, and TL-WR740N V1/V2 contain a command injection vulnerability via the component /userRpm/WlanNetworkRpm,\" the agency said.\nCISA has also warned that there is a possibility that affected products could be end-of-life (EoL) and/or end-of-service (EoS), urging users to discontinue their use if no mitigations are available. According to TP-Link, official support for all the three router models\nhave ended\n, meaning that they are unlikely to receive any fixes.\nThere is currently no public information available about how the shortcoming is being exploited in the wild, the scale of the attacks, and who is behind them.\nIn December 2024, Palo Alto Networks Unit 42\nrevealed\nthat it had identified additional samples of an operational technology (OT)-centric malware called\nFrostyGoop\n(aka BUSTLEBERM) and that one of the IP addresses corresponding to an ENCO control device also acted as a router web server using TP-Link WR740N to facilitate access to the ENCO device from a web browser.\nHowever, it further pointed out that \"there is no hard evidence to indicate that the attackers exploited [CVE-2023-33538] in the July 2024 FrostyGoop attack.\"\nThe Hacker News has reached out to TP-Link for further details, and we will update the story if we hear back. In light of active exploitation, federal agencies are required to remediate the flaw by July 7, 2025.\nNew Activity Targets CVE-2023-28771\nThe disclosure comes as GreyNoise has warned of exploit attempts targeting a critical security flaw impacting Zyxel firewalls (\nCVE-2023-28771\n, CVSS score: 9.8).\nCVE-2023-28771 refers to another operating system command injection vulnerability that could permit an unauthenticated attacker to execute commands by sending crafted requests to a susceptible device. It was patched by Zyxel in April 2023.\nWhile the vulnerability was\nweaponized\nto build distributed denial-of-service (DDoS) botnets such as Mirai shortly after public disclosure, the threat intelligence firm said it spotted heightened attempts to exploit it as recently as June 16, 2025.\nAs many as 244 unique IP addresses are said to have participated in the efforts over a short timespan, with the activity targeting the United States, United Kingdom, Spain, Germany, and India.\n\"Historical analysis indicates that in the two weeks preceding June 16, these IPs were not observed engaging in any other scanning or exploit behavior — only targeting CVE-2023-28771,\" GreyNoise\nsaid\n, adding it identified \"indicators consistent with Mirai botnet variants.\"\nTo mitigate the threat, users are recommended to update their Zyxel devices to the latest version, monitor for any anomalous activity, and limit exposure where applicable.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Meta Starts Showing Ads on WhatsApp After 6-Year Delay From 2018 Announcement",
        "Link": "https://thehackernews.com/2025/06/meta-starts-showing-ads-on-whatsapp.html",
        "Summary": "Meta Platforms on Monday announced that it's bringing advertising to WhatsApp, but emphasized that the ads are \"built with privacy in mind.\"\nThe ads are expected to be displayed on the Updates tab through its Stories-like Status feature, which allows ephemeral sharing of photos, videos, voice notes, and text for 24 hours. These efforts are \"rolling out gradually,\" per the company.\nThe media",
        "Date": "2025-06-17",
        "Content": "Meta Platforms on Monday\nannounced\nthat it's bringing advertising to WhatsApp, but emphasized that the ads are \"built with privacy in mind.\"\nThe ads are\nexpected\nto be displayed on the\nUpdates tab\nthrough its Stories-like Status feature, which allows ephemeral sharing of photos, videos, voice notes, and text for 24 hours. These efforts are \"rolling out gradually,\" per the company.\nThe media giant, which acquired WhatsApp for a record $19.3 billion in February 2014,\nfirst announced\nits plans for ads in Status way back in November 2018.\nMeta also claimed that the ads implementation was developed in the \"most privacy-oriented way possible\" and that it only uses limited information to serve ads.\n\"Your personal messages, calls, and statuses remain end-to-end encrypted, meaning no one can see or hear them,\" the company said.\n\"To show ads in Status or Channels you might care about, we'll use limited info like your country or city, language, the Channels you're following, and how you interact with the ads you see.\"\nIt's worth noting that Meta will use ad preferences from across a user's accounts, including Facebook and Instagram, should they have added WhatsApp to the\nAccounts Center\n. Adding WhatsApp to Accounts Center is an optional setting, and is off by default.\nThe\nexact nature of the information\ncollected includes -\nCountry code and age (where applicable)\nDevice information, such as language settings\nGeneral location, like city or country\nActivity information on Status and Channels such as channels people follow, content people engage with in channels and how people interact with the ads they see\nActivity on Meta's other apps\nFurthermore, Meta said it will neither sell or share users' phone numbers with marketers, nor will it tap into users' personal messages, calls, and groups for ad targeting.\n\"By default, WhatsApp removes or alters personal information (like phone numbers) before sharing it with Meta so that Meta cannot identify individuals and is only able to suggest ads that may appeal to people who share broad characteristics, such as people in the same general area,\" WhatsApp said.\nWhatsApp has long been marketed as a more private and secure messaging platform. However, its foray into advertisements could color its reputation as the company tries to balance user features vis-à-vis monetizing the service.\nThe development comes as Meta has added a warning prompt to its Meta AI chatbot app before letting users share their artificial intelligence (AI) prompts to the public Discover feed,\nfollowing\nreports\nof\nusers\naccidentally\nsharing\nchats\nwith sensitive personal information.\nPrivacy and security experts\ncriticized\nthe feature, with the Mozilla Foundation\nstating\nthat the app does not make it clear that the prompts users share are accessible to anyone across the world.\n\"Prompts you post are public and visible to everyone. Your prompts may be suggested by Meta on other Meta apps. Avoid sharing personal or sensitive information,\" a message now reads. The change was\nfirst reported\nby Business Insider.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Paddle settles for $5 million over facilitating tech support scams",
        "Link": "https://www.bleepingcomputer.com/news/security/paddle-settles-for-5-million-over-facilitating-tech-support-scams/",
        "Summary": "Paddle.com and its U.S. subsidiary will pay $5 million to settle Federal Trade Commission (FTC) allegations that the company facilitated deceptive tech-support schemes that harmed many U.S. consumers, including older adults. [...]",
        "Date": "2025-06-17",
        "Content": "Paddle.com and its U.S. subsidiary will pay $5 million to settle Federal Trade Commission (FTC) allegations that the company facilitated deceptive tech-support schemes that harmed many U.S. consumers, including older adults.\nPaddle, a UK-based payment processor, offers payments, tax handling, compliance, and checkout infrastructure for software and digital product sellers by acting as a \"merchant of record.\"\nAccording to\nthe FTC\n, Paddle failed to perform adequate screening and fraud prevention, enabling foreign operators like Restoro, Reimage, and PC Vark, to exploit the U.S. credit card system.\nThese schemes used fake virus alerts and pop-up warnings, often impersonating Microsoft or McAfee, to lure consumers into buying unneeded software or tech support services and charged them via unauthorized subscription renewals.\nPC Vark sold scareware through deceptive alerts and routed victims to call centers. Paddle processed $12.5 million for PC Vark, despite numerous complaints and chargeback rates exceeding 7%.\nLast year,\nRestoro and Reimage\nsettled over allegations that it was involved in nearly identical scams that directed victims to phone-based upsells. Paddle processed over $37 million in transactions for them.\n\"From April 2020 to at least June 2023, Paddle processed over $37 million in credit and debit card charges for a pair of affiliated deceptive tech support software merchants, \"Restoro Limited\" and \"Reimage Limited\" (collectively, \"Reimage\"). These Reimage entities were registered in the Isle of Man and later re-domiciled in Cyprus,\" reads the\nFTC complaint\n.\nThe FTC complaint also alleges that internal Paddle communications showed that the company knew about the fraud, understood it disproportionately affected non-technical, older consumers, and deliberately concealed the activity to avoid scrutiny from banks and card networks.\nTo stay under chargeback thresholds and avoid detection, Paddle allegedly used chargeback prevention tools like Ethoca and Verifi to refund flagged transactions before they could be formally reported, masking accurate fraud rates.\nPaddle also allowed merchants to begin charging U.S. consumers before completing \"Know Your Customer\" (KYC) checks, sometimes processing over $500,000 without providing any identification.\nThe FTC alleges that Paddle functioned as an unregistered payment facilitator (payfac) and aggregator, violating Visa and Mastercard rules by processing for thousands of merchants without proper disclosure or compliance.\nThe FTS says that even after receiving explicit warnings about scams and chargebacks, Paddle sought revenue-sharing deals with other high-risk processors to keep profiting from problematic clients. It even asked PC Vark to sign indemnity agreements to cover Paddle's potential liabilities from consumer fraud claims.\nAs part of\nthe settlement agreement\nthat includes a monetary relief of $5,000,000, Paddle will be:\nBanned from processing payments for tech-support telemarketers.\nProhibited from aiding deceptive merchants or helping them evade fraud detection.\nRequired to screen and monitor clients and report their activities.\nRequired to clearly disclose subscription terms, obtain informed consent, and offer simple cancellation.\nPaddle\npublished a statement\nnoting that the agreement with FTC confirms its policy not to work with companies accused of deceptive practices, which it calls \"abhorrent.\"\nThe company emphasized that it did not process payments for the deceptive telemarketing itself but only for the initial software purchases.\nTo avoid getting scammed, it is important to remember that Microsoft, McAfee, or other antivirus providers will never use pop-ups or unsolicited calls to tell you your computer is infected, so these are always part of scams.\nAvoid buying software through unfamiliar websites or ads, do not make rushed decisions based on alleged urgency, and use ad blockers or internet security tools to block these pop-ups and redirects.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nFTC cracks down on Genshin Impact gacha loot box practices\nOperation Secure disrupts global infostealer malware operations\nPolice takes down AVCheck site used by cybercriminals to scan malware\nFTC finalizes order requiring GoDaddy to secure hosting services\nUK Legal Aid Agency confirms applicant data stolen in data breach"
    },
    {
        "Title": "Scania confirms insurance claim data breach in extortion attempt",
        "Link": "https://www.bleepingcomputer.com/news/security/scania-confirms-insurance-claim-data-breach-in-extortion-attempt/",
        "Summary": "Automotive giant Scania confirmed it suffered a cybersecurity incident where threat actors used compromised credentials to breach its systems and steal insurance claim documents. [...]",
        "Date": "2025-06-17",
        "Content": "Automotive giant Scania confirmed it suffered a cybersecurity incident where threat actors used compromised credentials to breach its Financial Services systems and steal insurance claim documents.\nScania told BleepingComputer that the attackers emailed several Scania employees, threatening to leak the data online unless their demands were met.\nScania is a major Swedish manufacturer of heavy trucks, buses, and industrial and marine engines and is a member of the Volkswagen Group.\nThe company, which is known for its durable fuel-efficient engines, employs over\n59,000 people\nand has an annual revenue of $20.5 billion, selling over 100,000 vehicles yearly.\nLate last week, threat monitoring platform\nHackmanac spotted\na hacking forum post by a threat actor named 'hensi,' who is selling data they claimed to have stolen from 'insurance.scania.com,' offering it to a single exclusive buyer.\nThreat actor's post on underground forums\nSource: @H4ckmanac | X\nScania confirmed the breach to BleepingComputer, stating that their systems were breached on May 28, 2025, using an external IT partner's credentials stolen by infostealer malware.\n\"We can confirm there has been a security related incident in the application \"insurance.scania.com\", the application is provided by an external IT partner,\" stated a Scania spokesperson.\n\"On the 28th and 29th of May, a perpetrator used credentials for a legitimate external user to gain access to a system used for insurance purposes; our current assumption is that the credentials used by the perpetrator were leaked by a password stealer malware.\"\n\"Using the compromised account, documents related to insurance claims were downloaded.\"\nInsurance claim documents are likely to contain personal and possibly sensitive financial or medical data, so the incident could have a significant impact on those affected. At this time, the number of exposed individuals remains undefined.\nThe breach was followed by an extortion phase where the attackers contacted Scania employees directly using a @proton.me email address to extort the company, following up with the publication of samples of the stolen data on hacking forums.\n\"Early on the 30th (CEST) the attacker sent emails from proton.me to a number of Scania employees threatening to disclose the data.\"\n\"A follow-up email with similar content came later from an unrelated 3rd party whose email had been compromised. The data was later leaked by an actor named Hensi.\"\nThe compromised application is no longer reachable online, and an investigation into the incident has been launched.\nMeanwhile, Scania told BleepingComputer that the breach had limited impact and that it notified privacy authorities regarding the incident.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nPowerSchool hacker pleads guilty to student data extortion scheme\nCoinbase data breach exposes customer info and government IDs\nLuna Moth extortion hackers pose as IT help desks to breach US firms\nAnubis ransomware adds wiper to destroy files beyond recovery\nHackers switch to targeting U.S. insurance companies"
    },
    {
        "Title": "Instagram 'BMO' ads use AI deepfakes to scam banking customers",
        "Link": "https://www.bleepingcomputer.com/news/security/instagram-bmo-ads-use-ai-deepfakes-to-scam-banking-customers/",
        "Summary": "Instagram ads impersonating financial institutions like Bank of Montreal (BMO) and EQ Bank (Equitable Bank) are being used to target Canadian consumers with phishing scams and investment fraud.\n\nSome ads use AI-powered deepfake videos in an attempt to collect your personal information, while others drive traffic to phishing pages. [...]",
        "Date": "2025-06-17",
        "Content": "Instagram ads impersonating financial institutions like Bank of Montreal (BMO) and EQ Bank (Equitable Bank) are being used to target Canadian consumers with phishing scams and investment fraud.\nSome ads use AI-powered deepfake videos in an attempt to collect your personal information, while others use official branding to drive traffic outside of the platform to lookalike illicit domains that are not affiliated with banks.\nClosely impersonate bank branding\nWe have come across multiple instances of Instagram ads that may appear to be run by Canadian banks but are scams.\nAn example ad shown below claims to be from \"Eq Marketing\" and closely mimics EQ Bank's branding and color scheme, while promising a rather optimistic interest yield of \"4.5%\".\nTapping on it, however, takes you to a counterfeit\nRBCpromos1[.]cfd\nphishing website that is not affiliated with EQ Bank, and attempts to collect your banking credentials.\nFake EQ Bank ad targeting Canadian banking consumers\n(BleepingComputer)\nThe letters \"RBC\" in the phishing domain also imply that the domain could have been associated with other phishing campaigns targeting, for example, consumers of RBC or Royal Bank of Canada, one of the largest Canadian banks.\nTapping \"Yes, continue with my account\" presents the user with a fraudulent \"EQ Bank\" login screen, prompting for banking credentials.\nBy contrast, a legitimate ad from EQ Bank seen by us on platforms like Reddit leads visitors to the official\neqbank.ca\nwebsite (and is seen promoting a more realistic interest rate):\nA legitimate EQ Bank ad seen on Reddit\n(BleepingComputer)\nUse AI deepfake videos of a bank strategist\nAnother fraudulent ad captioned 'BMO Belski' appears as a story on Instagram. The ad prompts users with a few screening questions such as, \"How long have you been investing in stocks?\"\nScreening questions are a common engagement tool employed by legitimate advertisers to gauge their prospects before leading them to the most relevant product offerings.\nIn this case, however, after answering these bogus questions, the user is led to a screen prompting them to submit contact information to the advertiser, i.e., 'BMO Belski':\nVague 'BMO Belski' Instagram ads seen collecting your information\n(BleepingComputer)\nThe ad is clever—not only does it misuse BMO's name, but also implies affiliation with\nBrian Belski\n, the bank's Chief Investment Strategist and leader of the Investment Strategy Group. A casual user may be tricked into believing they are being presented with credible financial advice and investment products from a renowned expert.\nWe additionally noticed 'BMO Belski' ads playing AI-generated deepfake videos of Belski, luring people to a \"private WhatsApp investment group\".\nFake 'BMO Belski' ads play AI deepfake videos\n(BleepingComputer)\n'Facebook advertiser isn't on Instagram'\nA common theme we observed among these ads was that the advertiser accounts running them did not exist on Instagram, but rather on Facebook alone.\n'BMO Belski' has a\nFacebook page\n(\narchived\n) with some thousand-plus followers, but no presence on Instagram where the entity's ads show up.\n'BMO Belski' has no Instagram presence\n(BleepingComputer)\nMeta Business Manager does make it possible to\nrun Instagram ads using your Facebook page\n(without having an Instagram account).\nThe exact reason for scammers following this route is not clear. We suspect, however, that doing so saves scammers the trouble of establishing their presence and followership on Instagram, which could take time. Besides, recently created Instagram accounts (linked to an ad) may be easier to spot than... if they were to simply not exist.\nInterestingly, the 'BMO Belski' Facebook page, which has existed since October 27, 2023, contains just two posts, both made this week.\nBMO Belski Facebook page has two posts\n(BleepingComputer)\nBefore its use in impersonating the BMO spokesperson, the page was originally titled 'Brentlinger Matt Blumm' when it was created, yet another sign of threat actors repurposing digital assets like stolen social media pages, much like the aforementioned\nRBCpromos1\nphishing domain.\n'BMO Belski' Facebook page was previously titled 'Brentlinger Matt Blumm'\n(BleepingComputer)\nWhereas creating brand new pages for their scams would bear a recent creation date, raising red flags, repurposing pages buys scammers more credibility as they can now show that a page has existed for a while and has followers (whether real or bots).\nWe reported the fraudulent ads to Instagram, but these ads continued to appear even days after, indicating the dangers of such campaigns due to logistical delays in nuking them.\nBleepingComputer reached out to BMO and EQ Bank, making them aware of these campaigns. We have also approached Meta's communications team for comment.\nA source familiar with the matter told BleepingComputer that Meta is currently investigating this content and will remove any that is deemed to be fraudulent.\nEQ Bank told BleepingComputer that it is aware of the phishing ad campaign and is working proactively with the platforms to have them taken down as quickly as possible.\n\"They are, of course, in no way condoned or endorsed by us,\" an EQ Bank spokesperson told BleepingComputer.\n\"It's unfortunate that these kinds of high-fidelity scams are on the rise to take advantage of customers.\"\n\"The safety and security of our customers remains our top priority. We urge our customers to exercise caution when encountering online promotions and to verify the legitimacy of any communication by contacting us directly through our official channels. We've also advised our entire customer base of the rise of these kinds of scams to ensure they’re aware of what to look for and where to be cautious.\"\nReaders should be mindful when clicking on ads on social media platforms like Instagram and Facebook, even if these appear to be from legitimate organizations and bear their branding.\nInstagram ads from real advertisers\n(BleepingComputer)\nAds appearing from Instagram accounts with a \"verified\" badge, shown above, may provide additional assurance as to their credibility. Users should, however, still ensure that they are being led to websites or forms that are not impersonations but official domains and assets of the organization they claim to represent.\nAs the saying goes, if it looks too good to be true, it probably is.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nGoogle claims users find ads in AI search 'helpful'\nFBI: US officials targeted in voice deepfake attacks since April\nFake AI video generators drop new Noodlophile infostealer malware\nGoogle Chrome to use on-device AI to detect tech support scams\nWhatsApp unveils 'Private Processing' for cloud-based AI features"
    },
    {
        "Title": "New Veeam RCE flaw lets domain users hack backup servers",
        "Link": "https://www.bleepingcomputer.com/news/security/new-veeam-rce-flaw-lets-domain-users-hack-backup-servers/",
        "Summary": "​Veeam has released security updates today to fix several Veeam Backup & Replication (VBR) flaws, including a critical remote code execution (RCE) vulnerability. [...]",
        "Date": "2025-06-17",
        "Content": "​Veeam has released security updates today to fix several Veeam Backup & Replication (VBR) flaws, including a critical remote code execution (RCE) vulnerability.\nTracked as CVE-2025-23121, this security flaw was reported by security researchers at watchTowr and CodeWhite, and it only impacts domain-joined installations.\nAs Veeam\nexplained\nin a Tuesday security advisory, the vulnerability can be exploited by authenticated domain users in low-complexity attacks to gain code execution remotely on the Backup Server. This flaw affects Veeam Backup & Replication 12 or later, and it was fixed in version 12.3.2.3617, which was released earlier today.\nWhile CVE-2025-23121 only impacts VBR installations joined to a domain, any domain user can exploit it, making it easy to abuse in those configurations.\nUnfortunately, many companies have joined their backup servers to a Windows domain, ignoring\nVeeam's best practices\n, which advise admins to use a separate Active Directory Forest and protect the administrative accounts with two-factor authentication.\nIn March, Veeam\npatched another RCE vulnerability\n(CVE-2025-23120) in Veeam's Backup & Replication software that impacts domain-joined installations.\nRansomware gangs have also\ntold BleepingComputer\nyears ago that they always target VBR servers because they simplify stealing victims' data and block restoration efforts by deleting backups before deploying the ransomware payloads on the victims' networks.\nAs Sophos X-Ops incident responders revealed in November, another VBR RCE flaw (CVE-2024-40711)\ndisclosed in September\nis now being exploited\nto deploy Frag ransomware\n.\nThe same vulnerability was also used to gain remote code execution on vulnerable Veeam backup servers\nin Akira and Fog ransomware attacks\nstarting in October.\nIn the past, the\nCuba ransomware\ngang and\nFIN7,\na financially motivated threat group known to collaborate with the Conti, REvil, Maze, Egregor, and BlackBasta ransomware gangs, were also observed exploiting VBR vulnerabilities.\nVeeam's products are used by\nover 550,000 customers\nworldwide, including 82% of Fortune 500 companies and 74% of Global 2,000 firms.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nTrend Micro fixes critical vulnerabilities in multiple products\nSitecore CMS exploit chain starts with hardcoded 'b' password\nExploit details for max severity Cisco IOS XE flaw now public\nHackers are exploiting critical flaw in vBulletin forum software\nUnpatched critical bugs in Versa Concerto lead to auth bypass, RCE"
    },
    {
        "Title": "Sitecore CMS exploit chain starts with hardcoded 'b' password",
        "Link": "https://www.bleepingcomputer.com/news/security/sitecore-cms-exploit-chain-starts-with-hardcoded-b-password/",
        "Summary": "A chain of Sitecore Experience Platform (XP) vulnerabilities allows attackers to perform remote code execution (RCE) without authentication to breach and hijack servers. [...]",
        "Date": "2025-06-17",
        "Content": "A chain of Sitecore Experience Platform (XP) vulnerabilities allows attackers to perform remote code execution (RCE) without authentication to breach and hijack servers.\nSitecore is a popular enterprise CMS used by businesses to create and manage content across websites and digital media.\nDiscovered by\nwatchTowr researchers\n, the pre-auth RCE chain disclosed today consists of three distinct vulnerabilities. It hinges on the presence of an internal user (sitecore\\ServicesAPI) with a hardcoded password set to \"b\", making it trivial to hijack.\nThis built-in user isn't an admin and has no assigned roles. However, the researchers could still use it to authenticate via an alternate login path (/sitecore/admin) due to Sitecore's backend-only login checks being bypassed in non-core database contexts.\nThe result is a valid \".AspNet.Cookies\" session, granting the attacker authenticated access to internal endpoints protected by IIS-level authorization but not Sitecore role checks.\nWith this initial foothold secured, attackers can exploit the second vulnerability, a Zip Slip flaw in Sitecore's Upload Wizard.\nAs watchTowr explains, a ZIP file uploaded via the wizard can contain a malicious file path like\n/\\/../webshell.aspx\n. Due to insufficient path sanitization and the way Sitecore maps paths, this results in writing arbitrary files into the webroot, even without knowledge of the full system path.\nThis enables the attacker to upload a webshell and execute remote code.\nA third vulnerability becomes exploitable when the Sitecore PowerShell Extensions (SPE) module is installed (commonly bundled with SXA).\nThis flaw allows an attacker to upload arbitrary files to attacker-specified paths, bypassing extension or location restrictions entirely and providing a simpler route to reliable RCE.\nImpact and risk\nThe three vulnerabilities reported by watchTowr affect Sitecore XP versions 10.1 through 10.4.\nWatchTowr's scans show over 22,000 publicly exposed Sitecore instances, highlighting a significant attack surface, though not all are necessarily vulnerable.\nPatches addressing the issues were made available in May 2025, but the CVE IDs and technical details were embargoed until June 17, 2025, to give customers time to update.\n\"Sitecore is deployed across thousands of environments, including banks, airlines, and global enterprises — so the blast radius here is massive,\" commented watchTowr CEO Benjamin Harris to BleepingComputer.\n\"And no, this isn't theoretical: we've run the full chain, end-to-end. If you're running Sitecore, it doesn't get worse than this – rotate creds and patch immediately before attackers inevitably reverse engineer the fix.\"\nAs of writing, there is no public evidence of exploitation in the wild.\nHowever, watchTowr's technical blog contains enough detail to build a fully working exploit, so the risk of real-world abuse is imminent.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nNew Veeam RCE flaw lets domain users hack backup servers\nTrend Micro fixes critical vulnerabilities in multiple products\nExploit details for max severity Cisco IOS XE flaw now public\nHackers are exploiting critical flaw in vBulletin forum software\nUnpatched critical bugs in Versa Concerto lead to auth bypass, RCE"
    },
    {
        "Title": "UK fines 23andMe for ‘profoundly damaging’ breach exposing genetics data",
        "Link": "https://www.bleepingcomputer.com/news/security/uk-fines-23andme-for-profoundly-damaging-breach-exposing-genetics-data/",
        "Summary": "The UK Information Commissioner's Office (ICO) has fined genetic testing provider 23andMe £2.31 million ($3.12 million) over 'serious security failings' that led to a 'profoundly damaging' data breach in 2023. [...]",
        "Date": "2025-06-17",
        "Content": "The UK Information Commissioner's Office (ICO) has fined genetic testing provider 23andMe £2.31 million ($3.12 million) over 'serious security failings' that led to a 'profoundly damaging' data breach in 2023.\nThe data protection watchdog said today that 23andMe failed to protect the sensitive data of UK residents who had their genotype data, health reports, and personal information stolen in credential stuffing attacks using stolen login credentials that went unnoticed for five months between April 2023 and September 2023.\n\"This was a profoundly damaging breach that exposed sensitive personal information, family histories, and even health conditions of thousands of people in the UK,\"\nsaid\nJohn Edwards, UK's Information Commissioner. \"As one of those impacted told us: once this information is out there, it cannot be changed or reissued like a password or credit card number.\"\nAs the genomics company disclosed in\ndata breach notification letters\nsent to impacted individuals, some of this extremely sensitive stolen data was released on the unofficial 23andMe subreddit site and the BreachForums hacking forum.\nThe leaked information included the data of\n4.1 million people\nliving in the United Kingdom and Germany, as well as that of\n1 million Ashkenazi Jews\n.\nAfter discovering this extensive breach, 23andMe implemented measures to block similar incidents, including\nenabling two-factor authentication by default\nand requiring customers to\nreset passwords\n.\n\"As part of our regulatory process, we took into consideration representations from 23andMe, before deciding on whether to impose a financial penalty, and the final amount of the penalty,\" an ICO spokesperson told BleepingComputer when asked how the fine amount was calculated.\n\"The amount of this fine has been set in accordance with our\nData Protection Fining Guidance | ICO\n. This\nspecific section\nof the fining guidance details the maximum amount we may fine a company.\"\nThis fine comes after the California-based genetic testing provider\nfiled for Chapter 11 bankruptcy\nin late March and announced that it plans to sell its assets following multiple years of financial struggles.\nThe 2023 data breach has\nled to multiple class-action lawsuits\n, which prompted 23andMe to\namend its Terms of Use in November 2023\nto make it harder to get sued. However, the company claimed the changes only aimed to simplify the arbitration process.\nIn September 2024, the DNA testing giant\nagreed to pay $30 million\nto settle a lawsuit over the 2023 data breach that had exposed the data of 6.4 million customers worldwide.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMarks & Spencer faces $402 million profit hit after cyberattack\nO2 UK patches bug leaking mobile user location from call metadata\nUK Legal Aid Agency confirms applicant data stolen in data breach\nUK Legal Aid Agency investigates cybersecurity incident\nHacker steals 1 million Cock.li user records in webmail data breach"
    },
    {
        "Title": "Microsoft fixes Surface Hub boot issues with emergency update",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-surface-hub-boot-issues-with-emergency-update/",
        "Summary": "Microsoft has released an emergency update to fix a known issue causing startup failures for some Surface Hub v1 devices running Windows 10. [...]",
        "Date": "2025-06-17",
        "Content": "Microsoft has released an emergency update to fix a known issue causing startup failures for some Surface Hub v1 devices running Windows 10.\nAs the company explained when it\nacknowledged\nthis issue last week, users see Secure Boot Violation errors on affected devices, prompting them to check the Secure Boot Policy in setup.\nThese boot problems only impact Surface Hub v1 systems running Windows 10, version 22H2, after installing the June 2025 Windows security update (\nKB5060533\n). Microsoft also noted that these boot problems do not affect Surface Hub 2S and Surface Hub 3 devices.\nWhile the company released a mitigation one day after discovering it to ensure that other systems would not be impacted after installing the buggy update, it also rolled out an emergency out-of-band update (KB5063159) to address this issue on Monday.\n\"This update prevents Surface Hub v1 devices from encountering a start failure issue. The start failure issue was observed when some Surface Hub v1 devices installed the update KB5060533,\"\nMicrosoft said\n.\n\"On June 11, 2025, we paused the update KB5060533 offering for Surface Hub v1 to prevent new devices from experiencing the failure. If you installed earlier updates, only the new updates contained in this package will be downloaded and installed on your device.\"\nSecure Boot Violation error (\nlaihung2006\n)\n​​The KB5060533 Windows update behind this issue\nfixes another bug\nthat triggers unexpected restarts or freezes on some Hyper-V virtual machines with Windows 10, Windows 11, and Windows Server.\nLast week, Microsoft\nissued another emergency update\n(KB5063060) to address an Easy Anti-Cheat incompatibility issue, causing some Windows 11 24H2 systems to reboot with blue screen of death errors.\nRedmond also\nreleased\nsecurity updates for 66 security flaws last Tuesday, including a publicly disclosed Windows SMB privilege escalation vulnerability (\nCVE-2025-33073\n) and an actively exploited WebDAV (Web Distributed Authoring and Versioning) zero-day (\nCVE-2025-33053\n).\nThe June 2025 Patch Tuesday Windows updates addressed ten critical vulnerabilities, eight allowing attackers to gain remote code execution on unpatched devices, while the other two can let them escalate privileges.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMicrosoft: KB5060533 update triggers boot errors on Surface Hub v1 devices\nWindows 11 24H2 emergency update fixes Easy Anti-Cheat BSOD issue\nNew Secure Boot flaw lets attackers install bootkit malware, patch now\nWindows 10 KB5060533 cumulative update released with 7 changes, fixes\nMicrosoft shares script to restore inetpub folder you shouldn’t delete"
    },
    {
        "Title": "How to automate IT ticket handling with AI and Tines",
        "Link": "https://www.bleepingcomputer.com/news/security/how-to-automate-it-ticket-handling-with-ai-and-tines/",
        "Summary": "Tired of drowning in IT tickets? This AI-powered workflow built on Tines auto-triages common issues like known bugs & password resets—saving time for your team and speeding up resolution. Learn more about Tines and get a free account now. [...]",
        "Date": "2025-06-17",
        "Content": "Run by the team at workflow orchestration and AI platform Tines, the Tines library features pre-built workflows shared by IT and security practitioners from across the community - all free to import and deploy through the platform’s\nCommunity Edition\n.\nA recent standout is a ticket-handling workflow developed by Connor Brewer, Principal Solutions Architect at Uzado Inc., a Canadian IT and security service provider.\nBuilt with Tines Pages and powered by AI, the workflow invites employees to submit common IT issues through a simple form, then automatically responds or routes the ticket to the right practitioner, reducing manual triage and speeding up resolution.\n“At Uzado, these types of requests account for roughly 20% of IT tickets,” Connor explains. “We estimate that 10% of these could be resolved automatically, representing significant time savings and enabling analysts to focus on more complex challenges. The benefits extend to end users as well, who often prefer instant, AI-guided troubleshooting over waiting for IT responses.”\nIn this guide, we’ll share an overview of the workflow and walk you through setting it up in your own environment.\nThe problem – manual ticket handling that drains time and focus\nIT teams deal with a steady stream of support tickets, many of which are simple and repetitive, like audio issues or password resets. These low-effort tasks consume a disproportionate amount of practitioner time and introduce challenges like:\nAlert fatigue from high ticket volumes\nContext switching that interrupts deeper project work\nSlow response times for end users who need quick resolutions\nUzado wanted to streamline how their team handled routine requests, without sacrificing service quality or analyst control.\nWhat Will You Automate? The Top Ways IT Teams are Modernizing Their Operations\nWith threat actors moving faster and CVEs hitting record highs, manual patching simply can’t keep up.\nDiscover how teams are taking the pain out of patch management. Learn how you can strengthen both IT operations and your organization’s security posture with automated, scalable workflows.\nGet the guide\nThe solution – an AI-powered self-service IT help desk app\nConnor’s workflow tackles the problem by giving users a simple self-service interface built with Tines Pages. It leverages AI to analyze and triage incoming requests, determining whether to auto-resolve or escalate them.\nA sample webpage with form, built using Tines Pages\nHere’s how it works:\nUser submission: A form powered by Tines Pages captures the request (e.g., \"My Zoom audio isn't working\").\nAI triage: The workflow uses AI to analyze the request, summarizing it and determining whether it’s user-actionable.\nAutomated response: If the issue is simple (e.g., audio muted in Zoom), the app sends a helpful, step-by-step resolution. If it requires deeper investigation, it automatically escalates the issue to a support analyst.\nA sample response that the user might receive\nKey benefits of this workflow\nTime savings by eliminating manual triage for routine issues\nBetter user experience with instant feedback and guidance\nImproved morale as analysts focus on more meaningful work\nScalability without increasing headcount\nCustomizable for teams in IT, security, DevOps, and more\nWorkflow overview\nTools used\nTines\n– workflow orchestration and AI platform (Community Edition available)\nTines Pages\n– a product feature that enables you to build interactive forms and apps\nL\narge Language Model (LLM)\n– powers triage and response logic; customers can choose their preferred AI model in Tines\nSlack or other system integrations\nfor escalations\nSample AI prompt\nHere’s the LLM prompt Connor used to craft actionable responses:\nYou are an expert helpdesk assistant who analyzes requests received by a support team in a Managed Service Provider company.\nYour responses are strictly JSON objects without any preamble text or summary text after the JSON.\nYou create a title for the request, summarize the requests, recommend some actions as an array that could help solve the customer's problems, a polite response to acknowledge the user's request informing them a support agent will reach out to them shortly, and determine whether or not this problem is something a regular user could solve without any special technical knowledge.\nPlease be very conservative with what you believe is end user actionable. Do not request they reach out to any IT support themselves. Do not request the requestor elaborates on their request.\nAnalyze the following request and respond using the fields listed below:\ntitle\nsummary\nrecommended_action\nrequest_acknowledgement\nend_user_actionable\nSome assumptions you should hold to be true:\nThe end user is asking about their personal device or a company-owned device unless otherwise stated.\nIf this is end user actionable, the response you provide needs to be tailored to the requestor in a way that they can themselves solve the problem if you deem that it is a problem which can be resolved by a typical user. If it is not, please tailor the response to an IT professional.\nConfiguring the workflow - step-by-step guide\nThe Tines Community Edition sign-up form\n1. Log into Tines or create a new account.\n2. Ensure AI is enabled on your tenant. For this, you need to be the tenant owner. Select the account settings drop-down in the top left of your screen, and check the box to turn AI on.\nThe workflow on Tines’ drag-and-drop canvas\n3. Navigate to the\npre-built workflow in the library\n. Select import. This should take you straight to your new pre-built workflow.\nAdding a new credential in Tines\n4. (Optional) Set up credentials for any additional tools you’d like to use.\nWhile the core workflow uses Tines Pages and AI for triage and response, you can optionally integrate additional tools for escalations or notifications - for example, sharing unresolved tickets via Slack.\nTo connect these tools:\nTo create a new credential from the Storyboard, click the plus (+) icon beside Credentials on the storyboard to the right, then search for and select your credential from the list to get started. Follow the credential setup guides at explained.tines.com if you need help.\nEditing the Tines page\n5. Configure your actions: Edit the layout of your Tines Page, adjust the AI prompt as needed, and configure any optional escalation or notification actions.\n6. Test the workflow: Submit a request via the form to test your workflow.\n7. Publish and operationalize: Publish your workflow and share the Page URL with your desired users.\nTo try this workflow for yourself, you can sign up for a\nfree Tines account\n.\nSponsored and written by\nTines\n."
    },
    {
        "Title": "Hacker steals 1 million Cock.li user records in webmail data breach",
        "Link": "https://www.bleepingcomputer.com/news/security/hacker-steals-1-million-cockli-user-records-in-webmail-data-breach/",
        "Summary": "Email hosting provider Cock.li has confirmed it suffered a data breach after threat actors exploited flaws in its now-retired Roundcube webmail platform to steal over a million user records. [...]",
        "Date": "2025-06-17",
        "Content": "Email hosting provider Cock.li has confirmed it suffered a data breach after threat actors exploited flaws in its now-retired Roundcube webmail platform to steal over a million user records.\nThe incident exposed all users who had logged in to the mail service since 2016, estimated at 1,023,800 people, along with contact entries for an additional 93,000 users.\nCock.li is a Germany-based free email hosting provider with a privacy-focused ethos and lax moderation policies, run by a single operator known as 'Vincent Canfield' since 2013.\nIt is promoted as an alternative to mainstream email providers, supporting standard security protocols like SMTP, IMAP, and TLS.\nCock.li is used by people who distrust major providers and members of infosec and open-source communities. It is also popular among cybercriminals, such as affiliates from Dharma, Phobos, and other ransomware gangs.\nLate last week, the Cock.li service was disrupted without public explanation, leaving users wondering what might have happened.\nSoon after, a threat actor\nclaimed to be selling\ntwo databases containing dumped from Cock.li that contained sensitive user information, offering them for sale for a minimum of one Bitcoin ($92.5k).\nThreat actor attempting to sell Cock.li database\nSource: BleepingComputer\nCock.li\npublished a statement\non its website yesterday, confirming the breach and the validity of the threat actor's claims.\nThe email service confirmed that the following information has been exposed for 1,023,800 user accounts:\nEmail address\nFirst and last login timestamps\nFailed login attempts and count\nLanguage\nA serialized blob of Roundcube settings and email signature\nContact names (only for a subset of 10,400 accounts)\nContact email addresses (only for a subset of 10,400 accounts)\nvCards (only for a subset of 10,400 accounts)\nComments (only for a subset of 10,400 accounts)\nThe service's announcement clarifies that user account passwords, email content, and IP addresses were not compromised, as these are not present in the stolen databases.\nMeanwhile, the 10,400 account holders who had third-party contact information exposed will be getting a separate notification.\nFor everyone who used the service since 2016, it is recommended to reset their account passwords.\nThe Cock.li data breach could be valuable to researchers and law enforcement, as the exposed information can be used to learn more about the threat actors who use the platform.\nCock. li's removes Roundcube\nCock.li says they believe the data was stolen using an old RoundCube SQL injection vulnerability tracked as CVE-2021-44026.\nThis breach comes just as Cock.li recently analyzed an RCE flaw in Roundcube, CVE-2025-49113, which is\nbelieved to be actively exploited in attacks\n. Their analysis led them to remove the software from their platform in June 2025.\n\"Cock.li will no longer be offering Roundcube webmail,\" explained the service admins.\n\"Regardless of whether our version was vulnerable to this, we've learned enough about Roundcube to pull it from the service for good.\"\n\"Another webmail is definitely on the table, but it is not an immediate priority for us.\"\nThe announcement mentions that better security practices could have prevented this user data leak, admitting that \"Cock.li should not have been running Roundcube in the first place.\"\nFor those who want to continue using Cock.li for email, they will now have to use an IMAP or SMTP/POP3 client.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nZoomcar discloses security breach impacting 8.4 million users\nThe North Face warns customers of April credential stuffing attack\nAdidas warns of data breach after customer service provider hack\nUK Legal Aid Agency confirms applicant data stolen in data breach\nNova Scotia Power confirms hackers stole customer data in cyberattack"
    },
    {
        "Title": "'HoldingHands' Acts Like a Pickpocket With Taiwan Orgs",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/holdinghands-pickpocket-taiwan-orgs",
        "Summary": "Since at least January, the threat actor has been employing multiple malware tools to steal information for potential future attacks against Taiwanese businesses and government agencies.",
        "Date": "2025-06-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/holdinghands-pickpocket-taiwan-orgs"
    },
    {
        "Title": "Private 5G: New Possibilities — and Potential Pitfalls",
        "Link": "https://www.darkreading.com/cyber-risk/securing-private-5g-networks-new-challenges-for-cisos",
        "Summary": "While ushering in &quot;great operational value&quot; for organizations, private 5G networks add yet another layer to CISOs' responsibilities.",
        "Date": "2025-06-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/securing-private-5g-networks-new-challenges-for-cisos"
    },
    {
        "Title": "Operation Endgame: Do Takedowns and Arrests Matter?",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/operation-endgame-takedowns-arrests-matter",
        "Summary": "Cybercrime response needs more aggressive actions from those seeking to protect victims and pursue criminals.",
        "Date": "2025-06-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/operation-endgame-takedowns-arrests-matter"
    },
    {
        "Title": "The Cyber Future Is Riskier Than You Think",
        "Link": "https://www.darkreading.com/cyber-risk/the-cyber-future-is-riskier-than-you-think",
        "Summary": "Sound suggestions on how to tackle four &quot;quiet problems&quot; that often slip through the security cracks.",
        "Date": "2025-06-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/the-cyber-future-is-riskier-than-you-think"
    },
    {
        "Title": "Hackers Exploit Critical Langflow Flaw to Unleash Flodrix Botnet",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/hackers-exploit-langflow-flaw-flodrix-botnet",
        "Summary": "A vulnerability in the popular Python-based tool for building AI agents and workflows is under active exploitation, allowing for full system compromise, DDoS attacks, and potential loss or theft of sensitive data",
        "Date": "2025-06-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/hackers-exploit-langflow-flaw-flodrix-botnet"
    },
    {
        "Title": "WestJet Airlines App, Website Suffer After Cyber Incident",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/westjet-airline-app-website-operations-suffer-cyber-incident",
        "Summary": "Though its operations are running smoothly, the airline warned customers and employees to exercise caution when sharing personal information online.",
        "Date": "2025-06-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/westjet-airline-app-website-operations-suffer-cyber-incident"
    },
    {
        "Title": "New ClickFix Malware Variant ‘LightPerlGirl’ Targets Users in Stealthy Hack",
        "Link": "https://www.securityweek.com/new-clickfix-malware-variant-lightperlgirl-targets-users-in-stealthy-hack/",
        "Summary": "<p>Researchers identify a previously unknown ClickFix variant exploiting PowerShell and clipboard hijacking to deliver the Lumma infostealer via a compromised travel site.</p>\n<p>The post <a href=\"https://www.securityweek.com/new-clickfix-malware-variant-lightperlgirl-targets-users-in-stealthy-hack/\">New ClickFix Malware Variant ‘LightPerlGirl’ Targets Users in Stealthy Hack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/new-clickfix-malware-variant-lightperlgirl-targets-users-in-stealthy-hack/"
    },
    {
        "Title": "Zyxel Firewall Vulnerability Again in Attacker Crosshairs",
        "Link": "https://www.securityweek.com/zyxel-firewall-vulnerability-again-in-attacker-crosshairs/",
        "Summary": "<p>GreyNoise warns of a spike in exploitation attempts targeting a two-year-old vulnerability in Zyxel firewalls.</p>\n<p>The post <a href=\"https://www.securityweek.com/zyxel-firewall-vulnerability-again-in-attacker-crosshairs/\">Zyxel Firewall Vulnerability Again in Attacker Crosshairs</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/zyxel-firewall-vulnerability-again-in-attacker-crosshairs/"
    },
    {
        "Title": "US Insurance Industry Warned of Scattered Spider Attacks",
        "Link": "https://www.securityweek.com/us-insurance-industry-warned-of-scattered-spider-attacks/",
        "Summary": "<p>Google is warning insurance companies that Scattered Spider appears to have shifted its focus from the retail sector. </p>\n<p>The post <a href=\"https://www.securityweek.com/us-insurance-industry-warned-of-scattered-spider-attacks/\">US Insurance Industry Warned of Scattered Spider Attacks</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/us-insurance-industry-warned-of-scattered-spider-attacks/"
    },
    {
        "Title": "Circumvent Raises $6 Million for Cloud Security Platform",
        "Link": "https://www.securityweek.com/circumvent-raises-6-million-for-cloud-security-platform/",
        "Summary": "<p>Cloud security startup Circumvent has raised $6 million to develop a network of agents for autonomous prioritization and remediation.</p>\n<p>The post <a href=\"https://www.securityweek.com/circumvent-raises-6-million-for-cloud-security-platform/\">Circumvent Raises $6 Million for Cloud Security Platform</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/circumvent-raises-6-million-for-cloud-security-platform/"
    },
    {
        "Title": "Organizations Warned of Vulnerability Exploited Against Discontinued TP-Link Routers",
        "Link": "https://www.securityweek.com/organizations-warned-of-vulnerability-exploited-against-discontinued-tp-link-routers/",
        "Summary": "<p>CISA warns that a vulnerability impacting multiple discontinued TP-Link router models is exploited in the wild.</p>\n<p>The post <a href=\"https://www.securityweek.com/organizations-warned-of-vulnerability-exploited-against-discontinued-tp-link-routers/\">Organizations Warned of Vulnerability Exploited Against Discontinued TP-Link Routers</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/organizations-warned-of-vulnerability-exploited-against-discontinued-tp-link-routers/"
    },
    {
        "Title": "Asus Armoury Crate Vulnerability Leads to Full System Compromise",
        "Link": "https://www.securityweek.com/asus-armoury-crate-vulnerability-leads-to-full-system-compromise/",
        "Summary": "<p>A high-severity authorization bypass vulnerability in Asus Armoury Crate provides attackers with low-level system privileges.</p>\n<p>The post <a href=\"https://www.securityweek.com/asus-armoury-crate-vulnerability-leads-to-full-system-compromise/\">Asus Armoury Crate Vulnerability Leads to Full System Compromise</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/asus-armoury-crate-vulnerability-leads-to-full-system-compromise/"
    },
    {
        "Title": "Recent Langflow Vulnerability Exploited by Flodrix Botnet",
        "Link": "https://www.securityweek.com/recent-langflow-vulnerability-exploited-by-flodrix-botnet/",
        "Summary": "<p>A critical Langflow vulnerability tracked as CVE-2025-3248 has been exploited to ensnare devices in the Flodrix botnet.</p>\n<p>The post <a href=\"https://www.securityweek.com/recent-langflow-vulnerability-exploited-by-flodrix-botnet/\">Recent Langflow Vulnerability Exploited by Flodrix Botnet</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/recent-langflow-vulnerability-exploited-by-flodrix-botnet/"
    },
    {
        "Title": "Thailand’s Cyber Police Allegedly Breached Hacker Claims to Sell Admin Panel Access",
        "Link": "https://dailydarkweb.net/thailands-cyber-police-allegedly-breached-hacker-claims-to-sell-admin-panel-access/",
        "Summary": "A threat actor has allegedly breached the internal systems of Thailand&#8217;s Technology Crime Suppression Division (TCSD) and is attempting to sell access on a dark web forum. The TCSD is a crucial unit of the Royal Thai Police, responsible for investigating a wide range of cybercrimes, including online fraud, identity theft, and illegal digital content. [&#8230;]",
        "Date": "2025-06-17",
        "Content": "A threat actor has allegedly breached the internal systems of Thailand’s Technology Crime Suppression Division (TCSD) and is attempting to sell access on a dark web forum. The TCSD is a crucial unit of the Royal Thai Police, responsible for investigating a wide range of cybercrimes, including online fraud, identity theft, and illegal digital content. The division’s role in national security and digital surveillance makes this alleged breach particularly alarming, as it could compromise sensitive law enforcement data and ongoing investigations.\nThe seller posted screenshots purportedly showing administrative access to a “5C Center” dashboard. The images display highly sensitive information, suggesting a deep compromise of the cyber police’s operational data. The alleged breach appears to provide access to a vast database of criminal cases and citizen information. The exposure of such data could not only hamper police operations but also place victims and informants at significant risk.\nThe allegedly leaked data includes:\nTotal damage value from reported crimes, amounting to 139.108M.\nOver 1.2 million bank account numbers.\nOver 32,000 phone numbers.\nMore than 414,000 case stories or reports.\nDetailed case files including type of case, financial damage, and personal information of individuals involved.\nTags:\ncybercrime\ncybersecurity news\ndata-breach\ngovernment\nroyal thai police\nTCSD\nThailand"
    },
    {
        "Title": "China’s Human Resources and Social Security Network Allegedly Breached, 88 Million Citizen Records for Sale Online",
        "Link": "https://dailydarkweb.net/chinas-human-resources-and-social-security-network-allegedly-breached-88-million-citizen-records-for-sale-online/",
        "Summary": "A significant cybersecurity incident has allegedly exposed the personal data of 88 million Chinese citizens. A threat actor on a dark web forum has claimed to be selling a massive database obtained from the China HRSS Information Technology Network (hrssit.cn). The network appears to be a crucial part of the country&#8217;s Human Resources and Social [&#8230;]",
        "Date": "2025-06-17",
        "Content": "A significant cybersecurity incident has allegedly exposed the personal data of 88 million Chinese citizens. A threat actor on a dark web forum has claimed to be selling a massive database obtained from the China HRSS Information Technology Network (\nhrssit.cn\n). The network appears to be a crucial part of the country’s Human Resources and Social Security informatization system, which handles sensitive information for residents across various provinces and municipalities. The seller is offering the entire dataset for sale, payable in cryptocurrency.\nThe China HRSS Information Technology Network serves as a digital backbone for human resources and social security services, making the alleged breach extremely severe. If the claims are authentic, the exposure of such detailed personal information on a massive scale could lead to unprecedented levels of identity theft, financial fraud, and highly targeted phishing scams against millions of people. The data connects individuals’ names and national ID numbers with their employment history and contact information, creating a comprehensive profile for malicious actors to exploit.\nThe threat actor provided a sample of the data, which allegedly includes a wide range of personally identifiable information (PII). The compromised data fields are said to be:\nName\nNational ID\nMobile Number\nCompany\nBirthday\nSex\nMobile Province\nMobile City\nMobile Carrier\nID Province\nID City\nTags:\nChina\nCyberSecurity\ndark web\ndata-breach\ngovernment\nPII"
    },
    {
        "Title": "RedDotPayment, Krungsri, National Telecom, and HITRUST Allegedly Breached in Major Data Leak",
        "Link": "https://dailydarkweb.net/reddotpayment-krungsri-national-telecom-and-hitrust-allegedly-breached-in-major-data-leak/",
        "Summary": "A threat actor has allegedly leaked a massive trove of sensitive customer and payment data implicating several major financial, telecommunications, and technology firms across Asia. The data leak reportedly stems from a dispute over a penetration test conducted on RedDotPayment, a major Singapore-based payment gateway owned by global fintech giant PayU. The actor claims they [&#8230;]",
        "Date": "2025-06-17",
        "Content": "A threat actor has allegedly leaked a massive trove of sensitive customer and payment data implicating several major financial, telecommunications, and technology firms across Asia. The data leak reportedly stems from a dispute over a penetration test conducted on RedDotPayment, a major Singapore-based payment gateway owned by global fintech giant PayU. The actor claims they are now selling the data after the company refused to honor a prior agreement. The breach potentially affects customers of RedDotPayment and other major companies, including Thailand’s fifth-largest bank, Krungsri (Bank of Ayudhya), the state-owned National Telecom of Thailand, and the Taiwanese online security and payment solutions firm, HiTRUST Inc.\nThe implicated companies are significant players in their respective markets. RedDotPayment is a critical component of the e-commerce infrastructure in Southeast Asia, processing online transactions for a vast network of merchants. The alleged involvement of Krungsri, a systemically important bank in Thailand, and National Telecom, a major Thai telecommunications provider, widens the potential impact to a large base of banking and telecom customers. Furthermore, the inclusion of HiTRUST, a company specializing in online transaction security, is particularly concerning. Given the nature of the exposed data, this incident poses a severe risk of financial fraud, identity theft, and other malicious activities targeting the affected individuals.\nThe leaked data samples appear to be raw transaction records containing highly sensitive personal and financial information. If the full database is as comprehensive as the samples suggest, the consequences for consumers could be severe. An analysis of the allegedly leaked information indicates it includes the following:\nFull Customer Names\nContact Information (Email and Phone Numbers)\nComplete Credit Card Numbers\nCredit Card Expiry Dates\nCredit Card CVV Security Codes\nTransaction Details (Amount, Currency, Merchant Name)\nCustomer’s IP Address and Browser Information\nTags:\nCyberSecurity\ndata-breach\ndata-leak\nFinTech\nHITRUST\nKrungsri\nNational Telecom\npayment security\nPayU\nRedDotPayment\nSingapore\nTaiwan\nThailand"
    }
]