[
    {
        "Title": "Cryptojacking Campaign Exploits DevOps APIs Using Off-the-Shelf Tools from GitHub",
        "Link": "https://thehackernews.com/2025/06/cryptojacking-campaign-exploits-devops.html",
        "Summary": "Cybersecurity researchers have discovered a new cryptojacking campaign that's targeting publicly accessible DevOps web servers such as those associated with Docker, Gitea, and HashiCorp Consul and Nomad to illicitly mine cryptocurrencies.\nCloud security firm Wiz, which is tracking the activity under the name JINX-0132, said the attackers are exploiting a wide range of known misconfigurations and",
        "Date": "2025-06-02",
        "Content": "Cybersecurity researchers have discovered a new cryptojacking campaign that's targeting publicly accessible DevOps web servers such as those associated with Docker, Gitea, and HashiCorp Consul and Nomad to illicitly mine cryptocurrencies.\nCloud security firm Wiz, which is tracking the activity under the name\nJINX-0132\n, said the attackers are exploiting a wide range of known misconfigurations and vulnerabilities to deliver the miner payload.\n\"Notably, this campaign marks what we believe to be the first publicly documented instance of Nomad misconfigurations being exploited as an attack vector in the wild,\" researchers Gili Tikochinski, Danielle Aminov, and Merav Bar\nsaid\nin a report shared with The Hacker News.\nWhat sets these attacks further stand out is that the bad actors download the necessary tools directly from GitHub repositories rather than using their own infrastructure for staging purposes. The use of off-the-shelf tools is seen as a deliberate attempt to cloud attribution efforts.\nJINX-0132 is said to have compromised Nomad instances that manage hundreds of clients that, given the combined CPU and RAM resources, would cost tens of thousands of dollars per month. This also serves to highlight the compute power that drives the cryptojacking activity.\nIt's worth mentioning that abuse of Docker API is a well-known launchpad for such attacks. Just last week, Kaspersky\nrevealed\nthat threat actors are targeting misconfigured Docker API instances to enlist them to a cryptocurrency mining botnet.\nExposed Docker API instances open the door for threat actors to execute malicious code by spinning up containers that mount the host file system or launch a cryptocurrency image by invoking standard Docker endpoints like \"/containers/create\" and \"/containers/{id}/start.\"\nWiz said the threat actors are also taking advantage of either a vulnerability (e.g., CVE-2020-14144) or misconfiguration in Gitea, a lightweight open-source solution for hosting Git repositories, to obtain an initial foothold in the target.\nSpecifically, it has been found that publicly exposed instances of Gitea are vulnerable to remote code execution if the attacker has access to an existing user with permission to create git hooks, they are running version 1.4.0, or the installation page was left unlocked (i.e., INSTALL_LOCK=false).\nHashiCorp Consul, likewise, could pave the way for arbitrary code execution if the system is not\nproperly configured\nand it permits any user with remote access to the server to register services and define health checks, which, in turn, can include a bash command that will be executed by the registered agent.\n\"In the campaign orchestrated by JINX-0132, they abused this capability to add malicious checks that, in practice, simply execute mining software,\" Wiz said. \"JINX-0132 adds multiple services with seemingly random names whose real purpose was to download and run the XMRig payload.\"\nJINX-0132 has also been observed exploiting misconfigurations in publicly-exposed Nomad server API to create multiple new jobs on compromised hosts that are responsible for downloading the XMRig miner payload from GitHub and executing it. The attacks hinge on the fact that Nomad is\nnot secure-by-default\nto create and run these jobs.\n\"This default configuration effectively means that unrestricted access to the server API can be tantamount to remote code execution (RCE) capabilities on the server itself and all connected nodes,\" Wiz said.\nAccording to data from Shodan, there are over 5,300 exposed Consul servers and more than 400 exposed Nomad servers across the world. A majority of the exposures are concentrated around China, the United States, Germany, Singapore, Finland, the Netherlands, and the United Kingdom.\nAttacker Exploits Internet-exposed Open WebUI System to Run Miner\nThe disclosure comes as Sysdig revealed details of a malware campaign targeting Linux and Windows by exploiting a misconfigured system hosting\nOpen WebUI\nto upload an artificial intelligence (AI)-generated Python script and ultimately deliver cryptocurrency miners.\n\"The exposure to the internet allowed anyone to execute commands on the system — a dangerous mistake attackers are well aware of and actively scanning for,\" security researchers Miguel Hernandez and Alessandra Rizzo\nsaid\nin a report shared with the publication.\n\"Once the attackers discovered the exposed training system, they began using Open WebUI Tools, a plugin system used to enhance LLM capabilities. Open WebUI allows Python scripts to be uploaded so that LLMs can use them to extend their functionality. Once uploaded as an Open WebUI Tool, the malicious Python code was executed.\"\nThe Python code, Sysdig said, is designed to download and execute cryptocurrency miners like T-Rex and XMRig, creates a systemd service for persistence, and utilizes a Discord webhook for command-and-control (C2). The malware also incorporates libraries such as processhider and argvhider to hide the mining process on Linux systems and serves as a defense evasion tactic.\nOn compromised Windows systems, the attack proceeds along similar lines, but also entails the deployment of the Java Development Kit (JDK) in order to execute a JAR file (\"application-ref.jar\") downloaded from 185.208.159[.]155. The JAR file, for its part, serves as a Java-based loader to run a secondary JAR payload.\nThe attack chain culminates with the execution of two files \"INT_D.DAT\" and \"INT_J.DAT,\" the latter of which is equipped to steal credentials associated with Discord and cryptocurrency wallet extensions installed in Google Chrome.\nSysdig said there are more than 17,000 Open WebUI instances that are accessible over the internet. However, it's not clear how many are actually misconfigured or susceptible to other security weaknesses.\n\"Accidental misconfigurations where systems like Open WebUI are exposed to the internet remain a serious problem,\" the researchers said. \"The attacker also targeted both Linux and Windows systems, with the Windows version including sophisticated infostealer and evasion techniques.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Preinstalled Apps on Ulefone, Krüger&Matz Phones Let Any App Reset Device, Steal PIN",
        "Link": "https://thehackernews.com/2025/06/preinstalled-apps-on-ulefone-kruger.html",
        "Summary": "Three security vulnerabilities have been disclosed in preloaded Android applications on smartphones from Ulefone and Krüger&amp;Matz that could enable any app installed on the device to perform a factory reset and encrypt an application.\nA brief description of the three flaws is as follows -\n\nCVE-2024-13915 (CVSS score: 6.9) - A pre-installed \"com.pri.factorytest\" application on Ulefone and",
        "Date": "2025-06-02",
        "Content": "Three security vulnerabilities have been\ndisclosed\nin preloaded Android applications on smartphones from Ulefone and Krüger&Matz that could enable any app installed on the device to perform a factory reset and encrypt an application.\nA brief description of the three flaws is as follows -\nCVE-2024-13915\n(CVSS score: 6.9) - A pre-installed \"com.pri.factorytest\" application on Ulefone and Krüger&Matz smartphones exposes a \"com.pri.factorytest.emmc.FactoryResetService\" service that allows any installed application to perform a factory reset of the device.\nCVE-2024-13916\n(CVSS score: 6.9) - A pre-installed \"com.pri.applock\" application on Kruger&Matz smartphones allows a user to encrypt any application using user-provided PIN code or by using biometric data. The app also exposes a \"com.android.providers.settings.fingerprint.PriFpShareProvider\" content provider's \"query()\" method that permits any malicious app already installed on the device by some other means to exfiltrate the PIN code.\nCVE-2024-13917\n(CVSS score: 8.3) - A pre-installed \"com.pri.applock\" application on Kruger&Matz smartphones exposed an \"com.pri.applock.LockUI\" activity that allows any other malicious application, with no granted Android system permissions, to inject an arbitrary\nintent\nwith system-level privileges to a protected application.\nWhile exploiting CVE-2024-13917 requires an adversary to know the protecting PIN number, it could be chained with CVE-2024-13916 to leak the PIN code.\nCERT Polska, which detailed the vulnerabilities, credited Szymon Chadam for responsibly disclosing them. However, the exact patch status of these flaws remain unclear. The Hacker News has reached out to both Ulefone and Krüger&Matz for additional comment and we will update the story if we hear back.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Qualcomm Fixes 3 Zero-Days Used in Targeted Android Attacks via Adreno GPU",
        "Link": "https://thehackernews.com/2025/06/qualcomm-fixes-3-zero-days-used-in.html",
        "Summary": "Qualcomm has shipped security updates to address three zero-day vulnerabilities that it said have been exploited in limited, targeted attacks in the wild.\nThe flaws in question, which were responsibly disclosed to the company by the Google Android Security team, are listed below -\n\nCVE-2025-21479 and CVE-2025-21480 (CVSS score: 8.6) - Two incorrect authorization vulnerabilities in the Graphics",
        "Date": "2025-06-02",
        "Content": "Qualcomm has shipped security updates to address three zero-day vulnerabilities that it said have been exploited in limited, targeted attacks in the wild.\nThe flaws in question, which were responsibly disclosed to the company by the Google Android Security team, are listed below -\nCVE-2025-21479 and CVE-2025-21480\n(CVSS score: 8.6) - Two incorrect authorization vulnerabilities in the Graphics component that could result in memory corruption due to unauthorized command execution in GPU microcode while executing a specific sequence of commands\nCVE-2025-27038\n(CVSS score: 7.5) - A use-after-free vulnerability in the Graphics component that could result in memory corruption while rendering graphics using Adreno GPU drivers in Chrome\n\"There are indications from Google Threat Analysis Group that CVE-2025-21479, CVE-2025-21480, CVE-2025-27038 may be under limited, targeted exploitation,\" Qualcomm\nsaid\nin an advisory.\n\"Patches for the issues affecting the Adreno Graphics Processing Unit (GPU) driver have been made available to OEMs in May together with a strong recommendation to deploy the update on affected devices as soon as possible.\"\nThere are currently no details on how the vulnerabilities are being exploited, in what context, and by whom. That said, similar flaws in Qualcomm chipsets (\nCVE-2023-33063, CVE-2023-33106, and CVE-2023-33107\n) have been weaponized in the past by purveyors of commercial spyware like\nVariston and Cy4Gate\n.\nLast December, Amnesty International revealed that another security flaw in Qualcomm (\nCVE-2024-43047\n) had been exploited by the Serbian Security Information Agency (BIA) and the Serbian police to unlock seized Android devices belonging to activists, journalists, and protestors using Cellebrite's data extraction software to gain elevated access and deploy an Android spyware called NoviSpy.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "⚡ Weekly Recap: APT Intrusions, AI Malware, Zero-Click Exploits, Browser Hijacks and More",
        "Link": "https://thehackernews.com/2025/06/weekly-recap-apt-intrusions-ai-malware.html",
        "Summary": "If this had been a security drill, someone would’ve said it went too far. But it wasn’t a drill—it was real. The access? Everything looked normal. The tools? Easy to find. The detection? Came too late.\nThis is how attacks happen now—quiet, convincing, and fast. Defenders aren’t just chasing hackers anymore—they’re struggling to trust what their systems are telling them.\nThe problem isn’t too",
        "Date": "2025-06-02",
        "Content": "If this had been a security drill, someone would've said it went too far. But it wasn't a drill—it was real. The access? Everything looked normal. The tools? Easy to find. The detection? Came too late.\nThis is how attacks happen now—quiet, convincing, and fast. Defenders aren't just chasing hackers anymore—they're struggling to trust what their systems are telling them.\nThe problem isn't too few alerts. It's too many, with no clear meaning. One thing is clear: if your defense still waits for obvious signs, you're not protecting anything. You're just watching it happen.\nThis recap highlights the moments that mattered—and why they're worth your attention.\n⚡ Threat of the Week\nAPT41 Exploits Google Calendar for Command-and-Control\n— The Chinese state-sponsored threat actor known as APT41 deployed a malware called TOUGHPROGRESS that uses Google Calendar for command-and-control (C2). Google said it observed the spear-phishing attacks in October 2024 and that the malware was hosted on an unspecified compromised government website. TOUGHPROGRESS is designed to read and write events with an attacker-controlled Google Calendar, and extract the commands specified in them for subsequent execution. The results of the execution are written back to another Calendar event from where they can be accessed by the attackers. The campaign targeted multiple other government entities, although the company did not reveal who was singled out.\nComplete Zero Trust Protection Across Your Workforce, Branches, and Clouds\nWith a Zero Trust Everywhere security approach, organizations free themselves from firewalls and other network-centric appliances. They unify security and policy across all users, all locations, and all devices, drastically reducing cost and complexity.\nLearn More ➝\n🔔 Top News\nNew Law Enforcement Operation Takes down AvCheck[.]net\n— Authorities in the United States, in partnership with Finland and the Netherlands, have seized four domains and associated infrastructure that offered counter-antivirus (CAV) tools and crypting services to other threat actors to help their malware stay undetected from security software. These include AvCheck[.]net, Cryptor[.]biz, and Crypt[.]guru. \"The seized domains offered services to cybercriminals, including counter-antivirus (CAV) tools,\" the U.S. Justice Department said. \"When used together, CAV and crypting services allow criminals to obfuscate malware, making it undetectable and enabling unauthorized access to computer systems.\" Authorities said the seizure of AvCheck was made possible by exploiting the mistakes of the admins. \"The admins did not provide the security they promised,\" officials said in a notice, stating they have also confiscated a database containing usernames, email addresses, payment information, and more.\nMicrosoft, Dutch security agencies lift veil on Void Blizzard\n— A previously unknown hacker group with suspected ties to the Kremlin was responsible for a cyberattack last year on the Dutch police and has also targeted other Western nations that deliver military support to Ukraine. \"Laundry Bear has successfully managed to fly below the radar by employing simple attack methods and attack vectors involving tools which are readily available on victims' computers and are therefore difficult for organizations to detect and distinguish from other known Russian threat actors,\" the Netherlands government said. The group's existence came to light after investigating the September 2024 breach of the Dutch National Police, during which the group gained access to an account belonging to an employee by using a stolen session cookie and, through it, they managed to grab the work-related contact information of other police employees. While the attack techniques follow the cyber espionage playbook, the targeting is very specific with a victim list that overlaps with other Russia-linked cyber spies. The findings show that Ukraine and NATO member states continue to remain prime hunting grounds for Russian threat groups.\nEDDIESTEALER Bypasses Chrome's App-Bound Encryption to Steal Browser Data\n— A new Rust-based information stealer called EDDIESTEALER is being propagated via fake CAPTCHA verification pages that trick users into running PowerShell commands. The stealer is notable for its ability to bypass Chromium's app-bound encryption to gain access to unencrypted sensitive data, such as cookies. It does so by implementing an open-source project called ChromeKatz in Rust. EDDIESTEALER is not the only stealer to make efforts to sidestep new defenses introduced by Google. Another stealer malware known as Katz Stealer employs DLL injection to obtain the encryption key used to secure the cookies and passwords in Chromium-based browsers. A third stealer malware family dubbed ZeroCrumb, publicly\nreleased\non GitHub, achieves the same objective by \"impersonating a Chrome instance using Transacted Hollowing, effectively allowing us to use the IElevator COM interface to decrypt the app-bound key.\" This key is ultimately used to decrypt and access the browser cookies.\nEarth Lamia Targets Brazil, India, and Southeast Asia\n— A China-linked threat actor known as Earth Lamia has been tied to a broader set of attacks targeting organizations in Brazil, India, and Southeast Asia since 2023. The hacking group, which overlaps with REF0657, STAC6451, and CL-STA-0048, makes use of various flaws in internet-exposed servers, including the recently disclosed SAP NetWeaver vulnerability, to obtain initial access, drop web shells, and deploy post-exploitation tools like Cobalt Strike, VShell, and Brute Ratel C4. Some of the attacks have also leveraged a previously unseen .NET backdoor codenamed PULSEPACK to establish communication with a remote server and load different plugins to realize its goals. The development came as the Czech government\nsaid\nChinese hackers broke into one of the ministry's unclassified systems as early as 2022 and lingered undetected inside critical infrastructure networks. The Czech government delivered a pointed warning to China, publicly attributing the intrusion in the foreign ministry's networks to APT31, a cyber-espionage hacking unit linked to Beijing's Ministry of State Security.\nConnectWise Says Suspected Nation-State Actor Targeted its Systems\n— ConnectWise, the developer of remote access and support software ScreenConnect, has disclosed that it was the victim of a cyber attack that it said was likely perpetrated by a nation-state threat actor. It revealed that it has engaged the services of Google Mandiant to probe the breach and that a \"very small number of ScreenConnect customers\" were impacted. The activity, it said, is linked to the exploitation of CVE-2025-3935, a high-severity vulnerability in ScreenConnect versions 25.2.3 and earlier that could be exploited for ViewState code injection attacks using publicly disclosed ASP.NET machine keys. The attack technique was disclosed in February by Microsoft as being actively exploited by bad actors to inject malicious code and deliver the Godzilla post-exploitation framework. While Microsoft did not attribute the attacks to a specific actor or group, Godzilla has been tied to China-linked state-sponsored hackers.\n‎️‍🔥 Trending CVEs\nAttackers love software vulnerabilities – they're easy doors into your systems. Every week brings fresh flaws, and waiting too long to patch can turn a minor oversight into a major breach. Below are this week's critical vulnerabilities you need to know about. Take a look, update your software promptly, and keep attackers locked out.\nThis week's list includes —\nCVE-2025-3935\n(ConnectWise ScreenConnect),\nCVE-2025-47577\n(TI WooCommerce Wishlist plugin),\nCVE-2025-2760\n,\nCVE-2025-2761\n(GIMP),\nCVE-2025-0072\n(Arm Mali GPU),\nCVE-2025-27462, CVE-2025-27463, CVE-2025-27464\n(Citrix XenServer VM Tools for Windows),\nCVE-2025-4793\n(PHPGurukul Online Course Registration),\nCVE-2025-47933\n(Argo CD),\nCVE-2025-46701\n(Apache Tomcat CGI servlet),\nCVE-2025-48057\n(Icinga 2),\nCVE-2025-48827\n,\nCVE-2025-48828\n(vBulletin),\nCVE-2025-41438, CVE-2025-46352\n(Consilium Safety CS5000 Fire Panel),\nCVE-2025-1907\n(Instantel Micromate),\nCVE-2025-26383\n(Johnson Controls iSTAR Configuration Utility),\nCVE-2018-1285\n(Rockwell Automation FactoryTalk Historian ThingWorx),\nCVE-2025-26147\n(Denodo Scheduler),\nCVE-2025-24916, and CVE-2025-24917\n(Tenable Network Monitor).\n📰 Around the Cyber World\nMandatory Ransomware Payment Disclosure Begins in Australia\n— Australia became the first country in the world to\nrequire\nvictims of ransomware attacks to declare to the government any extortion payments made on their behalf to cyber criminals. The law, initially proposed last year, only applies to organizations with an annual turnover greater than AU$3 million ($1.93 million) alongside a smaller group of specific entities working within critical infrastructure sectors. The turnover threshold is expected to capture just the top 6.5% of all registered businesses in Australia, comprising roughly half of the country's economy. Applicable organizations must\nreport\nany ransomware payment they make to the Australian Signals Directorate (ASD) reporting tool within 72 hours of making the payment or becoming aware that the ransomware payment has been made. The report must include the following information: The ransomware payment amount demanded and paid and the method of provision that was demanded and used. The requirements do not apply to public sector bodies. Failure to comply can result in civil penalties.\nX is Pausing Encrypted DMs\n— X said it's pausing the encrypted DMs feature to make some improvements under the hood. The feature was originally\nlaunched\nin May 2023. \"Starting today we will be pausing the encrypted DMs feature while we work on making some improvements,\" the company\nsaid\nin a post on X. \"You will still be able to access your encrypted DMs, but won't be able to send new ones.\" Up to now, encrypted DMs have been available only on messages between verified users who are mutual or who have previously accepted DMs from each other. It did not mention when the feature will be available again.\nExploitation Attempts Detected Against vBulletin Flaws\n— Two newly disclosed critical security flaws in open-source forum software vBulletin have come under active exploitation in the wild. The flaws, tracked as CVE-2025-48827 (CVSS score: 10.0) and CVE-2025-48828 (CVSS score: 9.0), allow unauthenticated users to invoke protected API controllers' methods when running on PHP 8.1 or later, and execute arbitrary PHP code by abusing Template Conditionals in the template engine. The flaws,\ndiscovered\nby researcher Egidio Romano and disclosed on May 23, 2025, are said to have been\nquietly patched\nin April 2024. According to KEVIntel's Ryan Dewhurst, the\nvulnerabilities\nhave since seen exploitation attempts from IP addresses based in Poland.\nChina Accuses Taiwan of Attacking Tech Company\n— Chinese authorities have accused a hacker group allegedly backed by Taiwan's ruling Democratic Progressive Party (DPP) of carrying out a cyber attack on a local technology company and targeting sensitive infrastructure across the mainland, state media Global Times\nreported\n. Authorities claimed the hacking group orchestrated attacks on\nnearly 1,000 sensitive networks\n, including military, energy and government systems. \"The hackers deployed phishing emails, exploited public vulnerabilities, conducted brute-force password attacks and used low-grade Trojan horse programs to carry out the attacks,\" the Guangzhou city police was quoted as saying. In a\nstatement\nto Reuters, Taiwan's National Security Bureau has denied the allegations, accusing the Chinese Communist Party of \"manipulating inaccurate information to confuse the outside world\" and shift blame.\nRussian Hospital Programmer Gets 14 Years for Passing Soldier Data to Ukraine\n— A Russian court\nsentenced\nAlexander Levchishina, a 37-year-old former hospital programmer, to 14 years in a high-security penal colony for allegedly leaking personal data of Russian soldiers to Ukraine. He is said to have copied electronic medical records of Russian military personnel from his workplace computer at a hospital in the city of Bratsk in April 2022. He then sent the data to Ukrainian intelligence services to post on a Telegram channel reportedly operated by Ukrainian agents. Levchishin was arrested in July 2023. He has also been fined 50,000 rubles (about $627) and banned from working in certain fields for four years after serving his sentence. Earlier this month, an 18-year-old Russian tech student, who was detained in January 2024, for allegedly helping Ukrainian hackers carry out cyber attacks against Russia, was sentenced to six years in a penal colony.\nApple Safari Allows Credential Theft via BitM Attack using Fullscreen API\n— A weakness in Apple's Safari web browser could allow threat actors to leverage the full-screen browser-in-the-middle (\nBitM\n) technique to steal account credentials from unsuspecting users. By abusing the Fullscreen API, which instructs any content on a web page to enter the browser's full-screen viewing mode, bad actors can exploit the loophole to trick victims into typing sensitive data in an attacker-controlled remote browser window by simply clicking on a link. \"While the attack works on all browsers, fullscreen BiTM attacks are particularly convincing on Safari browsers due to the lack of clear visual cues when going fullscreen,\" SquareX\nsaid\n. \"In Firefox and Chromium-based browsers such as Chrome and Edge, there is a messaging requirement whenever fullscreen is activated. When it comes to the Safari browser, there is no messaging requirement when the requestFullscreen() method is called. The only sign that Safari provides when entering fullscreen mode is a 'swipe' animation, which is barely noticeable and more importantly, not a signal that most users associate with going fullscreen.\" In response to the findings, Apple said: \"After investigating further, we have determined that there are no security implications because any website, once in full screen, can already completely control and change its appearance. We already have an animation to indicate changes.\"\nThreat Actors Install DB Client Tools for Data Exfiltration\n— Hackers have been observed installing legitimate DB client tools like DBeaver, Navicat, and sqlcmd directly on targeted systems to exfiltrate data in an effort to sidestep detection. \"These behaviors are easy to disguise as those of a legitimate administrator, making them difficult to detect,\" AhnLab\nsaid\n. \"Traces of the leak can only be confirmed through some system logs, local records of client tools, and execution logs of SQL servers.\"\nFTC Hits GoDaddy with Order Mandating a Robust Security Program\n— The U.S. Federal Trade Commission (FTC) has\nfinalized\nan order requiring popular domain registrar and web hosting company GoDaddy to secure its services to settle charges of \"\nunreasonable security practices\n\" that led to several data breaches since between 2019 and 2022. GoDaddy has not admitted to any wrongdoing, nor has it been fined. The company has been ordered to implement at least one multi-factor authentication method, hire an independent third-party assessor to conduct biennial reviews of its information security program, and report any new breaches to the U.S. government within 10 days.\nU.S. Government Employee Arrested for Allegedly Trying to Leak Secrets to Foreign Government\n— Nathan Vilas Laatsch, a 28-year-old IT specialist employed by the Defense Intelligence Agency (DIA), was arrested on May 29, 2025, for allegedly attempting to transmit national defense information to an officer or agent of a foreign government. Laatsch became a civilian employee of the DIA in 2019 and worked with the Insider Threat Division. He is also said to have held a Top Secret security clearance. The U.S. Justice Department (DoJ) said the Federal Bureau of Investigation (FBI) launched an operation in March 2025 after receiving a tip that an unrelated individual offered to provide classified information to a friendly foreign government. \"After multiple communications with an FBI agent — who Laatsch allegedly believed to be an official of the foreign government — Laatsch began transcribing classified information to a notepad at his desk and, over the course of approximately three days, repeatedly exfiltrated the information from his workspace,\" the DoJ\nsaid\n. \"Laatsch subsequently confirmed to the FBI agent that he was prepared to transmit the information.\" Laatsch, per the DoJ, then agreed to drop the classified information at a public park in northern Virginia. The defendant, subsequently, sought information from the foreign government, even expressing interest in gaining citizenship with the country he believed to be conspiring with in exchange for providing additional classified information. But he also noted that he was \"not opposed to other compensation.\" Laatsch was eventually arrested last week after he arrived at a prearranged location with the undercover FBI agent to transmit multiple classified documents to the foreign country.\nPakistan Arrests 21 in Connection With HeartSender Malware Service\n— Authorities in Pakistan have arrested 21 individuals accused of operating\nHeartSender\n(aka The Manipulaters), an\nillicit service\nthat peddled phishing toolkits and fraud-enabling tools. The e-crime offering, which first came to light in 2020, suffered a major blow earlier this January, when U.S. and Dutch law enforcement agencies dismantled 39 domains and associated servers linked to HeartSender as part of an operation codenamed Heart Blocker. DomainTools revealed last year that the group had a physical presence in Pakistan, including Lahore, Fatehpur, Karachi, and Faisalabad. According to\nDawn\n, among those arrested included Rameez Shahzad (aka Saim Raza), the alleged ringleader of the criminal enterprise, as well as Muhammad Aslam (Rameez's father), Atif Hussain, Muhammad Umar Irshad, Yasir Ali, Syed Saim Ali Shah, Muhammad Nowsherwan, Burhanul Haq, Adnan Munawar, Abdul Moiz, Hussnain Haider, Bilal Ahmad, Dilbar Hussain, Muhammad Adeel Akram, Awais Rasool, Usama Farooq, Usama Mehmood and Hamad Nawaz.\nLumma Stealer Remains Active Despite Takedown\n— Despite a coordinated effort to\ntopple the infrastructure\nbehind the Lumma infostealer, the malware continues to operate. While there appears to be \"significant reputational damage,\" the operators are said to be actively undertaking efforts to reinstate the business, per\nCheck Point\n. Lumma Stealer's developer revealed that law enforcement agencies were able to infiltrate its main server by exploiting an unknown vulnerability in the Integrated Dell Remote Access Controller (iDRAC) and wiping the server and its backups. Authorities are also believed to have created a phishing login page to the harvest credentials and digital footprints of Lumma customers, as well as planted a JavaScript snippet in the dashboard server that tried to access the customers' web cameras. The Lumma threat actors have since said that \"everything has been restored, and we are working normally.\" What's more, information stolen from compromised computers continues to appear for sale on Lumma's own Telegram marketplace as well as other Russian markets. With Lumma down, but not completely extinguished, the success of the disruption may all ultimately depend on psychological tactics adopted by authorities to instill distrust among its customers.\nNew Android Malware GhostSpy Emerges\n— Cybersecurity researchers have detailed a new Android malware called GhostSpy that enables keylogging, screen capture, background audio and video recording, SMS and call log theft, GPS location tracking, and remote command execution. The infection commences with a dropper app that weaponizes\naccessibility services\nand user interface automation to sideload and install a secondary payload containing the information-gathering features. \"It abuses Device Admin APIs to entrench itself deeply in the system and employs anti-uninstall tactics, including system dialog hijacking and full-screen overlay obfuscation, making it extremely persistent and nearly impossible to remove through conventional means,\" CYFIRMA\nsaid\n. \"Critically, the malware also bypasses banking app screen-mirroring protection using a skeleton view reconstruction method, which harvests the full UI layout of protected applications. This allows attackers to extract sensitive data from interfaces that typically block screenshots or screen sharing.\" There is evidence to suggest that the malware is the work of a Brazilian threat actor, based on the Telegram and YouTube channels set up by them.\nZanubis Evolves to Focus on Banks in Peru\n— Speaking of Android malware, Kaspersky has charted the evolution of the\nZanubis\nAndroid banking trojan as a multi-faceted threat. It's known for its targeting of banks and financial entities in Peru since August 2022. \"The main infection vector of Zanubis is impersonating legitimate Peruvian Android applications and then misleading the user into enabling the accessibility permissions,\" the Russian security vendor\nsaid\n. \"Once these permissions are granted, the malware gains extensive capabilities that allow its operators to steal the user's banking data and credentials, as well as perform remote actions and control the device without the user's knowledge.\" New versions of the malware have been found to improve upon their data exfiltration and remote-control functionality, in addition to refining its obfuscation methods, adding features, switching between encryption algorithms, shifting targets, setting itself as the default messaging app to harvest one-time passwords (OTPs), and modifying social engineering techniques to boost infection rates. The trojan masquerades as legitimate apps from a company in the energy sector and a bank that was not previously targeted by suspected Peruvian threat actors. \"These updates are often aligned with recurring campaigns, suggesting a deliberate effort to keep the malware relevant and effective,\" it added.\nOpenAI's O3 Model Sabotages Shutdown Attempts\n— The OpenAI O3 model sabotaged its shutdown mechanism to prevent being turned off even when explicitly instructed to do so, Palisade Research revealed. The model found inventive ways to pull it off, even altering the kill command used by the shutdown script to say \"intercepted\" or \"Shutdown skipped\" instead. Google's Gemini 2.5 Pro complied with the instructions. \"As companies develop AI systems capable of operating without human oversight, these behaviors become significantly more concerning,\" Palisade\nsaid\n.\nStalkerware Apps Spyzie, Cocospy, and Spyic Go Offline\n— Three \"near-identical but differently branded\" stalkerware apps, Cocospy, Spyic, and Spyzie, have\ngone dark\nand the websites advertising them have disappeared. The development comes months after a common security flaw was identified in all of them, allowing anybody to access the personal data of any device with one of the apps installed. The apps essentially allowed the person planting the tool to gain access to the victims' messages, photos, call logs, and real-time location data without their knowledge or consent. According to TechCrunch, at least 25 stalkerware operations have been breached since 2017, out of which 10 of them have shut down. Last May, a spyware named\npcTattletale\nsaid it was \"out of business and completely done\" after a data breach. The app, which stealthily and continually captured screenshots of hotel booking systems,\nsuffered from a security flaw\nthat allowed the screenshots to be available to anyone on the internet, not just its intended users. Then earlier this February, another Spanish spyware vendor\nVariston\nclosed shop\n.\nUTG-Q-015 Targets Government and Enterprise Websites\n— A threat actor called UTG-Q-015 has been\nobserved\nleveraging N-day security flaws (CVE-2021-38647, CVE-2017-9805, and CVE-2017-12611) to infiltrate government and enterprise websites in March 2025, as well as single out blockchain websites and financial institutions using puddle mounting and instant messaging phishing tactics to deliver backdoors and other malicious payloads. The activity has been attributed to a Southeast Asian actor that provides penetration and intelligence services to companies in the region. Another espionage campaign\noriginating from Southeast Asia\nhas been attributed to what has been described as a \"\nnew OceanLotus group\n,\" which is\nsaid\nto have made use of zero-day flaws in terminal software to target China's military, energy, and aerospace sectors.\nTCC Bypass in Cursor's macOS App Disclosed\n— A security vulnerability has been identified in Cursor, a popular artificial intelligence (AI)-powered code editor for macOS, that enables malicious software to circumvent Apple's built-in security protections and access sensitive user data without proper authorization. The vulnerability, in a nutshell, makes it possible to get around Apple's Transparency, Consent, and Control (\nTCC\n) framework. \"The problem is that the application enables\nRunAsNode fuse\n,\" Afine researcher Karol Mazurek\nsaid\n. \"When enabled, the app can be executed as a generic Node.js process. This enables malware to inject malicious code that inherits the application's TCC permissions.\" Following responsible disclosure, Cursor has stated that the issue \"falls outside their threat model\" and that it has no plans of fixing it.\nSecurity Flaw in Lovable Allows Access to Sensitive Data\n— Earlier this year, Lovable, the popular vibe coding app, was found to be susceptible to\nVibeScamming\n, enabling anyone to create perfect scam pages, host them, and even set up admin dashboards to track stolen data. Now, new research has\nrevealed\nthat the service has failed to address a \"critical security flaw\" that\nallows\nremote unauthenticated attackers to read or write to arbitrary database tables of generated sites. This included names, email addresses, financial information, and secret API keys. The vulnerability (\nCVE-2025-48757\n, CVSS score: 9.3), per Replit researcher Matt Palmer, resides in Lovable's implementation of Row Level Security (RLS) policies. \"Applications developed using its platform often lack secure RLS configurations, allowing unauthorized actors to access sensitive user data and inject malicious data,\" Palmer\nsaid\nin a post on X. Lovable\nresponded\n: \"We're not yet where we want to be in terms of security and we're committed to keep improving the security posture for all Lovable users.\"\nCyber Toufan's Tactics Exposed\n— Cybersecurity researchers have detailed the operation playbook of an Iranian threat actor called\nCyber Toufan\n, which has previously targeted Israel-based users with the proprietary POKYBLIGHT wiper. Characterized as a pro-Palestinian threat group along the lines of\nHandala\n, Cyber Toufan has claimed responsibility for over 100 breaches across sectors including government, defense, finance, and critical infrastructure, OP Innovate said. \"Each case followed a consistent pattern: initial access via weak or reused credentials without MFA, stealthy lateral movement across the network, and coordinated data leak campaigns distributed publicly via Telegram,\" researchers Matan Matalon and Filip Dimitrov\nsaid\n. \"Unlike traditional APTs that rely on sophisticated zero-days, these actors exploit poor security hygiene, turning basic negligence into their primary attack vector.\"\n🎥 Cybersecurity Webinars\nThe Hidden Danger Inside Every AI Agent — And How Hackers Are Exploiting It\n→ AI agents can't run without access—but the service accounts and API keys they use often go unseen and unsecured. These invisible identities are becoming a top target for attackers. Join Astrix Security's Jonathan Sander to uncover the hidden risks behind AI and learn how to lock them down before it's too late. Don't wait for a breach—secure your AI from the inside out.\nYour Trusted Apps Are Being Weaponized — Here's How to Spot It\n→ Attackers no longer need to break in—they blend in. Using \"Living Off Trusted Sites\" (LOTS) tactics, they exploit popular apps and services to hide in plain sight. Join Zscaler's threat-hunting experts Marina Liang and Jessica Lee for a deep dive into how stealth attacks are uncovered across the world's largest security cloud. Learn the tools, techniques, and real-world cases behind modern evasion—and how to detect what your security stack is likely missing. If you're defending enterprise systems, this is your blueprint for spotting what others overlook.\n🔧 Cybersecurity Tools\nRedTeamTP\n— This toolkit streamlines red team infrastructure deployment using GitHub Actions. It supports Cobalt Strike, Mythic, and phishing setups across AWS, Azure, and DigitalOcean—handling config generation, provisioning, and teardown through repeatable, secure workflows.\nCloudRec\n— It is an open-source multi-cloud CSPM platform that helps secure cloud environments through automated asset discovery, real-time risk detection, and customizable OPA-based policies. It supports AWS, GCP, Alibaba Cloud, and more, with a flexible, scalable architecture.\n🔒 Tip of the Week\nUse AI Models to Challenge Your Security Assumptions →\nAI tools like OpenAI's o3 aren't just for writing code—they can now help spot serious bugs, including vulnerabilities that even experts may miss. In one real case, o3 helped uncover a hidden flaw in Linux's kernel code by analyzing how different threads could access the same object at the wrong time—something that's easy to overlook.\nHow to apply this: When reviewing code or systems, try giving an AI model a specific function, some background about how it's used, and ask it questions like:\nWhat could go wrong if two users interact at the same time?\nCould this object be deleted while still in use?\nAre all failure cases handled properly?\nWhy it works: Even experienced security teams make assumptions—about timing, logic, or structure—that attackers won't. AI doesn't assume. It explores every path, including the unlikely ones where real threats hide.\nUse AI to think differently, and you may catch weak spots before someone else does.\nConclusion\nThe tools may keep changing, but the core challenge remains: knowing what to act on, and when. As new threats emerge and familiar ones resurface in unexpected ways, clarity becomes your sharpest defense.\nUse these insights to question assumptions, update plans, and strengthen the weak spots that don't always show up on dashboards. Good security isn't just about staying ahead—it's about staying sharp.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "The Secret Defense Strategy of Four Critical Industries Combating Advanced Cyber Threats",
        "Link": "https://thehackernews.com/2025/06/the-secret-defense-strategy-of-four.html",
        "Summary": "The evolution of cyber threats has forced organizations across all industries to rethink their security strategies. As attackers become more sophisticated — leveraging encryption, living-off-the-land techniques, and lateral movement to evade traditional defenses — security teams are finding more threats wreaking havoc before they can be detected. Even after an attack has been identified, it can",
        "Date": "2025-06-02",
        "Content": "The evolution of cyber threats has forced organizations across all industries to rethink their security strategies. As attackers become more sophisticated — leveraging encryption, living-off-the-land techniques, and lateral movement to evade traditional defenses — security teams are finding more threats wreaking havoc before they can be detected. Even after an attack has been identified, it can be hard for security teams to prove to auditors that they have fully mitigated the issues that allowed the attackers in.\nSecurity teams worldwide have prioritized endpoint detection and response (EDR), which has become so effective that threat actors have changed their tactics to avoid attack vectors protected by host-based defenses.\nThese advanced threats are particularly vexing for critical infrastructure providers in\nfinancial services\n,\nenergy and utilities\n,\ntransportation\n, and\ngovernment agencies\nthat may have proprietary systems that cannot be protected by traditional endpoint security, have unique protocols that may not be recognized by existing security tools, or are governed by regulations requiring full disclosure and proof of mitigation.\nElite security teams have turned to the ground truth that can only be provided by the network to both identify suspicious behavior and demonstrate full mitigation and compliance. This ground truth provides an immutable record of all network activities and enables threat hunters to proactively search for potential threats.\nFINANCIAL SERVICES:\nDefending against silent threats to financial data\nThe financial services industry faces a perfect storm: it's the most targeted sector globally, operates under strict regulatory requirements, and manages highly sensitive data that commands premium prices on criminal markets. For financial institutions, network detection and response (NDR) is essential for identifying unauthorized data access, protecting microsecond transactions, and demonstrating regulatory compliance.\nDetecting unauthorized data access and exfiltration\nBanks and investment firms deploy NDR solutions to monitor for subtle indicators of data theft. Unlike many industries where attackers seek to disrupt operations, financial services attackers often aim to remain undetected while accessing valuable data. NDR platforms help identify suspicious data access patterns and exfiltration attempts, even when disguised within encrypted channels.\nTake a hypothetical scenario where a major financial institution is dealing with an attacker who has established persistence for more than six months and was slowly exfiltrating customer financial data using encrypted channels during normal business hours. This type of activity could be missed by SIEM and EDR tools, but NDR can detect anomalous traffic patterns that other tools miss.\nMaintaining a microsecond security advantage\nHigh-frequency trading (HFT) environments face unique security challenges due to ultra-low latency requirements that make traditional inline security tools impractical. Custom hardware often cannot support endpoint agents, creating visibility gaps, while proprietary algorithms require protection from theft and manipulation.\nAdvanced NDR solutions address these challenges through passive monitoring that introduces zero latency while maintaining full network visibility. They provide sophisticated protocol analysis for proprietary trading protocols that conventional tools cannot decode, plus microsecond-precision timestamping allows the detection of subtle manipulation attempts.\nDemonstrating regulatory compliance\nWith regulations like the Digital Operations Resilience Act (DORA), Network and Information Security Directive (NIS2), and FINRA rules, banks must maintain comprehensive audit trails of network activity. NDR solutions provide the detailed forensic evidence necessary for both compliance verification and post-incident investigation.\nNDR deployments provide continuous network monitoring and evidence preservation required by regulators. When a financial institution experiences a security incident, NDR can demonstrate exactly what happened, how they responded, and provide evidence of whether a breach has been fully remediated, which is increasingly becoming a regulatory expectation.\nENERGY AND UTILITIES:\nBridging IT/OT security gaps\nWith traditional IT networks and operational technology (OT) environments controlling physical infrastructure, the energy sector has become a prime target for criminal and nation-state actors. The recent\nVolt Typhoon attacks\nexemplify threats actively compromising critical infrastructure by targeting systems that can't be protected by traditional endpoint security.\nThe Federal Energy Regulatory Commission (FERC) issued Order No. 887 requiring internal network security monitoring (INSM) for high-impact bulk electric system security stacks, expanding beyond perimeter- and host-based security controls to include detection of anomalous network activity.\nIdentifying reconnaissance of energy infrastructure\nAdvanced threat actors typically conduct extensive reconnaissance before launching attacks. NDR solutions help identify these early-stage activities by detecting unusual scanning patterns, enumeration attempts, and other reconnaissance indicators against critical systems.\nOT systems weren't necessarily built with cybersecurity in mind, though they have strong physical security capabilities. These systems cannot run traditional endpoint security technology and also have their own unique vulnerabilities. Because they need to be accessible quickly in emergencies, they often don't have stronger security, like complex passwords.\n\"I've often heard customers reflecting on the fact that they don't have time to remember a 15-digit complex password that changes every three months or needs to be reset at the moment because someone forgot it,\" said Vince Stoffer, Corelight Field CTO. \"They need access quickly to address whatever issue may be at hand, which can result in organizations configuring default or simple passwords that are easy to remember, but also easy for an attacker to brute force their way through.\"\nMonitoring IT/OT convergence points\nEnergy companies need to monitor traffic between IT and OT networks, watching for attempts to pivot from corporate networks into critical operational systems. Security teams can't put endpoint agents on most OT systems, but they can monitor network traffic to and from these environments.\nThe National Association of Regulatory Utility Commissioners established cybersecurity baselines for electric distribution systems that require organizations to store and protect security-focused logs from authentication tools, intrusion detection/intrusion prevention systems, firewalls, and other security tools for detection and incident response activities. For OT assets where logs are non-standard or not available, they expect organizations to collect and store network traffic and communications between those assets and other systems for forensic purposes, which NDR makes possible.\nDetecting protocol anomalies in industrial systems\nEnergy companies leverage NDR's protocol analysis capabilities to identify anomalies in industrial control system communications that might indicate tampering or unauthorized commands. For example, consider a power generation facility using the Modbus protocol to control turbine operations. NDR monitoring might detect unexpected commands attempting to set turbine speed to dangerous levels or commands from unauthorized IP addresses, flagging deviations from established communication patterns before equipment damage or safety incidents occur.\nTRANSPORTATION:\nSecuring increasingly connected systems\nIncreasingly interconnected systems within the transportation industry create greater risk as cybercriminals can access more data and potentially disrupt operations along entire supply chains.\nMonitoring fleet management and control systems\nTransportation organizations need to monitor communications between central management systems and vehicle fleets, ships, or aircraft. Modern transportation operations rely heavily on real-time data exchange, including GPS coordinates, route optimization, fuel management, and emergency communications. These communications often traverse multiple networks, creating numerous opportunities for interception or manipulation.\n\"We hear from customers that to help maintain efficiency and streamline operations, their fleets and signaling infrastructure are increasingly connected. NDR gives them visibility into these connections, allowing them to detect attempts to interfere with safety-critical systems before physical operations are affected,\" said Stoffer.\nNDR can identify anomalies such as navigation commands from unauthorized sources, GPS spoofing attempts, or suspicious modifications to autopilot systems, enabling transportation operators to respond to threats before they impact passenger safety.\nProtecting passenger data and payment systems\nTransportation companies process large volumes of passenger data and payment information, making them attractive targets. NDR helps monitor for unauthorized access to these systems, particularly from internal networks where attackers might move laterally after initial compromise.\nNDR's behavioral analysis capabilities can detect anomalous database queries, unusual file access patterns, or unexpected network connections to payment processing systems that indicate data harvesting activities.\nDetecting operational disruption attempts\nFor transportation, operational disruption can have immediate safety implications. Railway signaling systems, air traffic control communications, and traffic management platforms represent critical control points where malicious interference could result in catastrophic incidents.\nNDR solutions help identify attacks designed to disrupt scheduling, routing, or communication systems before they impact physical operations by monitoring specialized protocols and communication patterns that control transportation infrastructure.\nGOVERNMENT:\nDefending against advanced persistent threats\nGovernment agencies are continuously targeted by advanced persistent threats (APTs) from nation-state adversaries, requiring them to defend high-value assets and classified information across complex environments while complying with stringent federal cybersecurity frameworks such as NIST 800-53, CMMC, and FISMA.\nIdentifying long-term persistence and data collection\nGovernment organizations deploy NDR to identify subtle indicators of APTs that might establish a long-term presence within networks. These attackers focus on intelligence gathering over extended periods rather than immediate disruption, making them particularly dangerous to national security interests.\n\"The threats we faced when I headed up security at the Defense Intelligence Agency were well-funded, stealthy, sophisticated, and persistent,\" said Jean Schaffer, Corelight Federal CTO. \"Now in the zero trust era, where every user and device must be continuously validated, NDR plays a critical role by providing the non-erasable visibility needed to detect lateral movement attacks, even when they're using legitimate credentials and living-off-the-land techniques that evade endpoint detection.\"\nNDR's continuous network monitoring capabilities can analyze baseline network behavior to identify anomalies such as unusual data flows during off-hours, gradual increases in outbound traffic to suspicious destinations, or subtle changes in communication patterns indicating lateral movement.\nEnsuring Zero Trust compliance\nZero trust\nis critically important to public sector organizations, driven by federal mandates requiring agencies to adopt zero trust architectures by the end of fiscal year 2024. NDR plays a pivotal role in enabling zero trust by providing foundational network visibility that zero trust models require.\nSince zero trust assumes a breach has already occurred, NDR delivers real-time monitoring of all network communications, supports identity and access validation, and eliminates blind spots that traditional security tools miss.\nProviding attribution evidence\nFor national security agencies, understanding who is behind an attack is often as important as detecting the attack itself. NDR provides rich forensic data that helps analysts identify tactics, techniques, and procedures (TTPs) associated with specific threat actors, supporting attribution efforts.\nThe platform captures detailed network communications, connection patterns, and command-and-control infrastructure usage that form unique behavioral fingerprints for different adversary groups, enabling agencies to correlate current incidents with historical threat intelligence.\nCommon threads across industries\nDespite their different priorities, several common themes emerge across these sectors:\nThe value of network ground truth\n: All industries recognize that network traffic provides an objective record of activity that attackers struggle to falsify or erase.\nComplementary security approach\n: Organizations across sectors deploy NDR alongside EDR and SIEM, recognizing that different security technologies excel at detecting different types of threats.\nEncrypted traffic analysis\n: As encryption becomes ubiquitous, all industries value NDR's ability to provide detailed data and threat detection for encrypted communications, even when decryption is not a viable option.\nSupport for legacy systems\n: Each sector relies on NDR to monitor systems where agents cannot be deployed due to operational constraints, age, or proprietary nature.\nAs cyber threats continue to evolve in sophistication, NDR's role in security architectures will likely continue to grow. The technology's ability to provide visibility across diverse environments while detecting subtle indicators of compromise makes it particularly valuable for organizations protecting critical infrastructure and sensitive data.\nFor security teams evaluating NDR solutions, understanding these industry-specific use cases can help guide implementation strategies and ensure the technology addresses their organization's particular security challenges. For more information about Corelight's Open NDR platform, visit\ncorelight.com\n.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Fake Recruiter Emails Target CFOs Using Legit NetBird Tool Across 6 Global Regions",
        "Link": "https://thehackernews.com/2025/06/fake-recruiter-emails-target-cfos-using.html",
        "Summary": "Cybersecurity researchers have warned of a new spear-phishing campaign that uses a legitimate remote access tool called Netbird to target Chief Financial Officers (CFOs) and financial executives at banks, energy companies, insurers, and investment firms across Europe, Africa, Canada, the Middle East, and South Asia.&nbsp;\n\"In what appears to be a multi-stage phishing operation, the attackers",
        "Date": "2025-06-02",
        "Content": "Cybersecurity researchers have warned of a new spear-phishing campaign that uses a legitimate remote access tool called Netbird to target Chief Financial Officers (CFOs) and financial executives at banks, energy companies, insurers, and investment firms across Europe, Africa, Canada, the Middle East, and South Asia.\n\"In what appears to be a multi-stage phishing operation, the attackers aimed to deploy NetBird, a legitimate wireguard-based remote access tool on the victim's computer,\" Trellix researcher Srini Seethapathy\nsaid\nin an analysis.\nThe activity, first detected by the cybersecurity company in mid-May 2025, has not been attributed to a known threat actor or group.\nThe starting point of the attack is a phishing email that impersonates a recruiter from Rothschild & Co. and claims to offer a \"strategic opportunity\" with the company. The email is designed to entice the recipients into opening a purported PDF attachment that, in reality, is a phishing link that redirects them to a Firebase app-hosted URL.\nWhat's notable about the infection is that the real redirect URL is stored in the page in encrypted form and is accessible only after the victim solves a CAPTCHA verification check, ultimately leading to the download of a ZIP archive.\n\"Solving the puzzle executes a [JavaScript] function that decrypts it with a hard-coded key and redirects the user to the decrypted link,\" Seethapathy said. \"Attackers are leaning on these custom CAPTCHA gates more and more, hoping to slip past defenses that already flag phishing sites protected by Cloudflare Turnstile or Google reCAPTCHA.\"\nPresent within the archive is a Visual Basic Script (VBScript) that's responsible for retrieving a next-stage VBScript from an external server and launching it via \"wscript.exe.\" This second-stage VBScript downloader then fetches another payload from the same server, renames it to \"trm.zip,\" and extracts two MSI files from it: NetBird and OpenSSH.\nThe last phase involves installing the two programs on the infected host, creating a hidden local account, enabling remote desktop access, and persisting NetBird via scheduled tasks such that it automatically launches on system reboot. The malware also removes any NetBird desktop shortcuts to ensure that the compromise is not detected by the victim.\nTrellix said it identified another redirect URL that has been active for nearly a year and serves the same VBScript payload, indicating that the campaign may have been around for some time.\nThe findings once again show how adversaries are\nincreasingly relying\non legitimate remote access applications such as ConnectWise ScreenConnect, Atera, Splashtop, FleetDeck, and LogMeIn Resolve to establish persistence and use it to burrow into the victim's network, while simultaneously evading detection.\n\"This attack isn't your typical phishing scam,\" Seethapathy said. \"It's well-crafted, targeted, subtle, and designed to slip past technology and people. It is a multi-stage attack where the adversary uses social engineering and defense evasion techniques to create and maintain persistent access to the victim system.\"\nThe disclosure coincides with the discovery of various email-based social engineering campaigns in the wild -\nAttacks that\nabuse\na trusted domain associated with a well-known Japanese internet service provider (ISP) to send phishing messages from the email address \"company@nifty[.]com\" in an attempt to get past email authentication checks and harvest credentials\nAttacks that\nabuse\nthe Google Apps Script development platform to host phishing pages that look legitimate and steal Microsoft login credentials by employing invoice-themed email lures\nAttacks that\nmimic\nan Apple Pay invoice to steal sensitive user data, including credit card details and Yahoo Mail account details\nAttacks that\nabuse\nNotion workspaces to host phishing pages that trick users into clicking on links that take the victims to a fake Microsoft login page under the guise of viewing a shared document and exfiltrate the credentials via a Telegram bot\nAttacks that\nexploit\na years-old security flaw in Microsoft Office (\nCVE-2017-11882\n) to deliver the Formbook malware variant hidden in a fake PNG file and steal sensitive data from compromised hosts\nPhaaS Services Lower the Bar\nThe findings also come as Trustwave detailed the operational connections between\nTycoon\nand\nDadSec\n(aka Phoenix) phishing kits, highlighting their infrastructural overlaps and the use of a centralized phishing infrastructure. DadSec is the work of a threat actor tracked by Microsoft under the moniker Storm-1575.\n\"The infrastructure used by DadSec is also connected to a new campaign leveraging the 'Tycoon 2FA' Phishing-as-a-Service (PhaaS) platform,\" Trustwave researchers Cris Tomboc and King Orande\nsaid\n. \"The investigation into the Tycoon2FA phishing kit reveals how adversaries continue to refine and expand their tactics within the Phishing-as-a-Service (PhaaS) ecosystem.\"\nTycoon 2FA PhaaS Operation\nThe growing popularity of PhaaS services is evidenced by the emergence of a new \"plug-and-play\" Chinese-language kit dubbed Haozi that's estimated to have facilitated over $280,000 worth of criminal transactions over the past five months by selling advertising to third-party services. It operates on a subscription basis for $2,000 per year.\n\"Unlike legacy phishing kits that require attackers to configure scripts or infrastructure manually, Haozi offers a sleek, public-facing web panel,\" Netcraft\nsaid\n. \"Once an attacker purchases a server and puts its credentials into the panel, the phishing software is automatically set up, with no need to run a single command.\"\n\"This frictionless setup contrasts with other PhaaS tools like the AI-enabled\nDarcula\nsuite, where minimal command-line usage is still necessary.\"\nBesides supporting an admin panel where users can manage all their campaigns in one place, Haozi has been found to offer advertising space, acting as an intermediary to connect phishing kit buyers with third-party services, such as those related to SMS vendors.\nHaozi phishing dashboard\nAnother aspect that sets Haozi apart from other kits is a dedicated after-sales Telegram channel (@yuanbaoaichiyu) to assist customers with debugging issues and optimizing their campaigns, positioning it as an attractive option for aspiring cybercriminals who have no technical expertise.\n\"As enterprise security teams become more effective at detecting and addressing intrusion attempts, attackers are deploying social engineering and phishing scams, tactics that don't require breaching a hardened perimeter,\" Netcraft researcher Harry Everett said.\n\"PhaaS offerings lower the skill floor and scale campaigns through automation and community support. These new models function more like SaaS businesses than black-market hacking groups, complete with subscription pricing, customer service, and product updates.\"\nMicrosoft, in an advisory published last week, further revealed how PhaaS platforms are increasingly driving adversary-in-the-middle (AiTM) credential phishing as the adoption of multi-factor authentication (MFA) surges.\nSome of the other techniques include\ndevice code phishing\n; OAuth consent phishing; where threat actors employ the Open Authorization (OAuth) protocol and send emails with a malicious consent link for a third-party application; device join phishing, where threat actors use a phishing link to trick targets into authorizing the domain-join of an actor-controlled device.\nThe Windows maker said it has observed suspected Russian-linked threat actors employing third-party application messages or emails referencing upcoming meeting invitations to deliver a malicious link containing a valid authorization code. The device join phishing technique was\nfirst documented\nby Volexity in April 2025.\n\"While both end users and automated security measures have become more capable at identifying malicious phishing attachments and links, motivated threat actors continue to rely on exploiting human behavior with convincing lures,\" Igor Sakhnov, corporate vice president and deputy CISO of Identity at Microsoft,\nsaid\n.\n\"As these attacks hinge on deceiving users, user training and awareness of commonly identified social engineering techniques are key to defending against them.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Cartier discloses data breach amid fashion brand cyberattacks",
        "Link": "https://www.bleepingcomputer.com/news/security/cartier-discloses-data-breach-amid-fashion-brand-cyberattacks/",
        "Summary": "Luxury fashion brand Cartier is warning customers it suffered a data breach that exposed customers' personal information after its systems were compromised. [...]",
        "Date": "2025-06-02",
        "Content": "Luxury fashion brand Cartier is warning customers it suffered a data breach that exposed customers' personal information after its systems were compromised.\nIn notification letters sent today and shared by recipients on\nsocial media\n, Cartier revealed that hackers breached its systems and stole a limited amount of customer information.\n\"We are writing to inform you that an unauthorized-party gained temporary access to our system and obtained limited client information,\" Cartier stated in the data breach notification.\n\"We contained the issue and have further enhanced the protection of our systems and data.\"\nAccording to the company, the compromised information includes names, email addresses, and countries where the customer resides.\nCartier stresses that the breach did not include more sensitive data, such as passwords, credit card numbers, or banking details.\nHowever, the company warns that the stolen data could be used in targeted attacks, asking customers to remain vigilant against unsolicited or suspicious communications.\n\"Given the nature of the data, we recommend that you remain alert for any unsolicited communications or any other suspicious correspondence,\" the company added.\nCartier says it has informed law enforcement about the incident and is working with an external cybersecurity company to remediate the breach.\nBleepingComputer contacted Cartier to learn more about the breach, such as when it occurred and how many people were impacted, but has not received a reply at this time.\nFashion brands under attack\nThis breach follows similar security incidents at other fashion brands disclosed last month.\nIn May,\nDior disclosed a data breach\nafter threat actors breached its systems and stole customer contact details, purchase histories, and preferences.\nAlso last month,\nAdidas warned customers\nabout a data breach resulting from a compromise at one of its third-party service providers. The attackers accessed contact information but did not obtain any payment details or account credentials.\nLike Cartier and Dior, Adidas has launched an investigation with cybersecurity experts.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nThe North Face warns customers of April credential stuffing attack\nAttackers are mapping your attack surface—are you?\nVictoria’s Secret takes down website after security incident\nData broker LexisNexis discloses data breach affecting 364,000 people\nTrain for the CISSP domain by domain with this training bundle deal"
    },
    {
        "Title": "The North Face warns customers of April credential stuffing attack",
        "Link": "https://www.bleepingcomputer.com/news/security/the-north-face-warns-customers-of-april-credential-stuffing-attack/",
        "Summary": "Outdoor apparel retailer The North Face is warning customers that their personal information was stolen in credential stuffing attacks targeting the company's website in April. [...]",
        "Date": "2025-06-02",
        "Content": "Outdoor apparel retailer The North Face is warning customers that their personal information was stolen in credential stuffing attacks targeting the company's website in April.\nThe North Face is a major American outdoor apparel and equipment brand owned by VF Corporation that also controls Vans, Timberland, and Dickies.\nThe North Face generates over $3 billion in annual revenue, making it one of the largest outdoor brands in the world, with its e-commerce accounting for approximately 42% of its total sales volumes.\nCredential stuffing attacks are a type of cyberattack where threat actors attempt to gain unauthorized access to user accounts by automating login attempts using username-password pairs previously exposed in data breaches.\nThe technique is possible thanks to \"credentials recycling,\" which is when people use the same username and password across multiple online services.\nHowever, if the accounts are protected by multi-factor authentication (MFA), these attacks fail even if the passwords are compromised.\nThe North Face has now begun to send data breach notifications to impacted customers, with a sample notice shared with the\nVermont Attorney General\nthat informs customers that it recently suffered a credential stuffing attack.\n\"On April 23, 2025, we discovered unusual activity involving our website, thenorthface.com, which we investigated immediately,\"\nreads the notice\n.\n\"Following a careful and prompt investigation, we concluded that an attacker had launched a small scale credential stuffing attack against our website on April 23, 2025.\"\nThe data that has been exposed includes the following:\nFull name\nPurchase history\nShipping address\nEmail address\nDate of birth\nTelephone number\nIt is noted that payment information was not exposed, as an external provider handles payments on the site, and The North Face doesn't retain anything but a token required for the process to go through.\nA history of cybersecurity failures\nIn the case of The North Face, the decision not to enforce MFA on all accounts has come at a significant cost to its customer base, as this is the fourth credential stuffing incident the brand's site has suffered since 2020.\nEarlier this year, its parent company, VF Outdoor, informed of a credential stuffing attack impacting 'thenorthface.com' and 'timberland.com,'\ndiscovered on March 13, 2025\n. That incident exposed 15,700 accounts.\nTwo similar incidents were disclosed in\nNovember 2020\nand\nSeptember 2022\n, impacting over 200,000 customers.\nThe most severe cybersecurity incident hitting The North Face was a\nDecember 2023 ransomware attack\nthat was later confirmed to have\nimpacted 35,000,000 customers\n.\nBleepingComputer has contacted The North Face to request more details about the latest incident, including how many customers are impacted, but we are still waiting for a response.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nAdidas warns of data breach after customer service provider hack\nUK Legal Aid Agency confirms applicant data stolen in data breach\nNova Scotia Power confirms hackers stole customer data in cyberattack\nFashion giant Dior discloses cyberattack, warns of data breach\nM&S says customer data stolen in cyberattack, forces password resets"
    },
    {
        "Title": "SentinelOne: Last week’s 7-hour outage caused by software flaw",
        "Link": "https://www.bleepingcomputer.com/news/technology/sentinelone-last-weeks-7-hour-outage-caused-by-software-flaw/",
        "Summary": "American cybersecurity company SentinelOne revealed over the weekend that a software flaw triggered a seven-hour-long outage on Thursday. [...]",
        "Date": "2025-06-02",
        "Content": "American cybersecurity company SentinelOne revealed over the weekend that a software flaw triggered a seven-hour-long outage on Thursday.\nThis massive outage affected multiple customer-facing services in what SentinelOne described as a \"global service disruption.\"\nSentinelOne acknowledged the outage in a post published Thursday, reassuring customers that their systems were still protected.\n\"Customer endpoints are still protected at this time, but managed response services will not have visibility. Threat data reporting is delayed, not lost. Our initial RCA suggests this is not a security incident,\" SentinelOne\nsaid\n.\nIn a root cause analysis issued two days later, the company confirmed the incident's root cause was not a cyberattack or a security breach but a software flaw in an infrastructure control system that deleted critical network routes and DNS resolver rules automatically, which caused most services to go down in all regions.\nServices were brought down after all required connecting infrastructure became reachable after a flaw in an outgoing cloud management function led to the restoration of an empty backup of the AWS Transit Gateway route table.\n\"SentinelOne is currently in the process of transitioning our production systems to a new cloud architecture built on Infrastructure-as-Code (IaC) principles. The deletion occurred after a soon-to-be-deprecated (i.e. outgoing) control system was triggered by the creation of a new account,\" SentinelOne\nexplained\n.\n\"A software flaw in the control system's configuration comparison function misidentified discrepancies and applied what it believed to be the appropriate configuration state, overwriting previously established network settings. As this outgoing control system is no longer our source of truth for network configurations, it restored an empty route table.\"\nAs a result of this outage, programmatic access to the company's services was also interrupted, while Unified Asset Management/Inventory and Identity services were also brought down, blocking customers from viewing vulnerabilities or accessing identity consoles.\nThe company added that the outage may have impacted data ingestion from various third-party services, as well as Managed Detection and Response (MDR) alerts.\nSentinelOne says the customers' endpoints remained protected, even though their security teams couldn't log into the SentinelOne management console, access SentinelOne data, or manage SentinelOne services.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nMATLAB dev confirms ransomware attack behind service outage\nKettering Health hit by system-wide outage after ransomware attack\nMobile carrier Cellcom confirms cyberattack behind extended outages\nNew \"Bring Your Own Installer\" EDR bypass used in ransomware attack\nNew Microsoft 365 outage impacts Teams and other services"
    },
    {
        "Title": "Google Chrome to distrust Chunghwa Telecom, Netlock certificates in August",
        "Link": "https://www.bleepingcomputer.com/news/security/google-chrome-to-distrust-chunghwa-telecom-netlock-certificates-in-august/",
        "Summary": "Google says it will no longer trust root CA certificates signed by Chunghwa Telecom and Netlock in the Chrome Root Store due to a pattern of compliance failures and failure to make improvements. [...]",
        "Date": "2025-06-02",
        "Content": "Google says it will no longer trust root CA certificates signed by Chunghwa Telecom and Netlock in the Chrome Root Store due to a pattern of compliance failures and failure to make improvements.\nThe change will come in Google Chrome version 139, which is scheduled for release on August 1, 2025.\nThe tech giant cites ongoing compliance failures, broken improvement commitments, and lack of measurable progress as the reasons for this action.\n\"Chrome's confidence in the reliability of Chunghwa Telecom and Netlock as CA Owners included in the Chrome Root Store has diminished due to patterns of concerning behavior observed over the past year,\"\nreads the announcement\n.\n\"These patterns represent a loss of integrity and fall short of expectations, eroding trust in these CA Owners as publicly-trusted certificate issuers trusted by default in Chrome.\"\nChunghwa Telecom is Taiwan's largest telecom provider, operating internet, mobile, and fixed-line services. It runs a public Certificate Authority (CA) called ePKI and HiPKI, issuing digital certificates for secure web communications.\nNetlock is a significant Hungarian provider of digital certification services (electronic signatures, timestamping, and TLS/SSL certificates), best known for its Arany (Gold Class) Root CA, which is widely used in Hungary and other European countries.\nThe Chrome Root Store is a list of trusted certificate authorities maintained by Google and used by Chrome to validate HTTPS connections.\nBoth entities have acted as public Certification Authorities (CAs) for years, with their certificates included in the Chrome Root Store, meaning Chrome trusted them by default.\nStarting on August 1, 2025, Google Chrome will display a \"Your connection is not private\" warning when users visit websites that continue to use certificates issued by Chunghwa Telecom or Netlock, as their root CAs will no longer be trusted.\nWarning generated on pages using non-trusted certificates\nSource: Google\nAlthough moving past that page will be possible, this action will break the smooth browsing experience on impacted sites and create trust issues for visitors.\nFor this reason, impacted web admins are recommended to take action now and switch to a trusted CA as soon as possible.\nWhile Netlock and Chunghwa Telecom certificates signed up to July 31, 2025, will still be trusted, it is recommended not to postpone their inevitable replacement.\nGoogle notes that impacted enterprises can override trust changes by installing the affected roots as locally trusted.\nIt should be noted that this change will not impact Microsoft Edge, Mozilla Firefox, or Apple Safari, as they utilize different browser trust stores.\nThis latest action follows a similar one\nagainst Entrust\n, announced in June 2024 and entering into force on November 12, 2024.\nAt the time, Google justified its decision by noting that Entrust had been involved in multiple publicly disclosed incidents that showed it had failed to meet industry compliance and security standards since 2018.\nSimilarly, Entrust failed to deliver on promises to improve its practices or showcase measurable progress.\nIn March 2025, Google announced new mandatory security\nrequirements for all CAs\nissuing publicly trusted HTTPS/TLS certificates, signaling its intent to tighten standards and push CAs to quickly meet evolving compliance expectations.\nThe Chunghwa Telecom and Netlock cases are the first examples of enforcing those stricter requirements, with more likely to follow in the future.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nCISA tags recently patched Chrome bug as actively exploited\nGoogle fixes high severity Chrome flaw with public exploit\nGoogle Chrome to block admin-level browser launches for better security\nGoogle Chrome to use on-device AI to detect tech support scams\nThreat actors abuse Google Apps Script in evasive phishing attacks"
    },
    {
        "Title": "Microsoft and CrowdStrike partner to link hacking group names",
        "Link": "https://www.bleepingcomputer.com/news/security/microsoft-and-crowdstrike-partner-to-link-hacking-group-names/",
        "Summary": "Microsoft and CrowdStrike announced today that they've partnered to connect the aliases used for specific threat groups without actually using a single naming standard. [...]",
        "Date": "2025-06-02",
        "Content": "Microsoft and CrowdStrike announced today that they've partnered to connect the aliases used for specific threat groups without actually using a single naming standard.\nAs the two companies explained on Monday, this will be done by mapping (or linking) the different names their security analysts use for each group they track.\nMicrosoft has updated its\nthreat actor reference guide\nwith a list of common hacking groups tracked by CrowdStrike and Redmond, all mapped using each company's naming systems.\n\"This reference guide serves as a starting point, a way to translate across naming systems so defenders can work faster and more efficiently, especially in environments where insights from multiple vendors are in play,\"\nsaid\nVasu Jakkal, Corporate Vice President for Microsoft Security.\n\"This effort is not about creating a single naming standard. Rather, it's meant to help our customers and the broader security community align intelligence more easily, respond faster, and stay ahead of threat actors.\"\nThis naming taxonomy mapping effort is the initial step towards making tracking overlapping threat actor activity easier and avoiding unnecessary confusion and complexity.\nAs Microsoft also revealed today, Google/Mandiant and Palo Alto Networks' Unit 42 will also be contributing their own information to make attribution faster and clearer, with other cybersecurity companies likely to join this initiative in the future.\nAfter more security firms join this alliance and start sharing their telemetry data, this initiative will bring clarity and make it simpler for network defenders to translate naming systems and build a far more accurate view of malicious campaigns.\n\"CrowdStrike and Microsoft are proud to take the first step, but we know this must be a community-led initiative to succeed,\"\nadded\nAdam Meyers, Senior Vice President for Intelligence at CrowdStrike.\n\"Together, the companies have already deconflicted more than 80 threat actors through direct, analyst-led collaboration. These represent some of the most active and sophisticated adversaries in the world.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nCommvault says recent breach didn't impact customer backup data\nEncryptHub's dual life: Cybercriminal vs Windows bug-bounty researcher\n‘Russian Market’ emerges as a go-to shop for stolen credentials\nMicrosoft Authenticator now warns to export passwords before July cutoff\nWindows 10 KB5058481 update brings seconds back to calendar flyout"
    },
    {
        "Title": "‘Russian Market’ emerges as a go-to shop for stolen credentials",
        "Link": "https://www.bleepingcomputer.com/news/security/russian-market-emerges-as-a-go-to-shop-for-stolen-credentials/",
        "Summary": "The \"Russian Market\" cybercrime marketplace has emerged as one of the most popular platforms for buying and selling credentials stolen by information stealer malware. [...]",
        "Date": "2025-06-02",
        "Content": "The \"Russian Market\" cybercrime marketplace has emerged as one of the most popular platforms for buying and selling credentials stolen by information stealer malware.\nAlthough the marketplace has been active for roughly six years and became relatively popular by 2022,\nReliaQuest reports\nthat the Russian Market has recently reached new heights. Part of this surge in popularity is due to the\ntakedown of the Genesis Market\n, which created a large vacuum in the field.\nAlthough the majority (85%) of credentials sold on the Russian Market are \"recycled\" from existing sources, it has still won massive cybercrime audiences thanks to its wide selection of items of sale and availability of logs at prices as low as $2.\nAn infostealer log is commonly a text file, or multiple files, created by infostealer malware that contains the account passwords, session cookies, credit card data, cryptocurrency wallet data, and system profiling data stolen from an infected device.\nEach log can contain dozens or even thousands of credentials, so the total number of stolen credentials could be hundreds of millions or more. Once collected, the logs are uploaded back to an attacker's server, where they are collected for use in further malicious activity or sold on marketplaces like the Russian Market.\nLogs page on the marketplace\nSource: ReliaQuest\nInfostealers have become an immensely popular tool for threat actors, with\nmany campaigns\nnow\ntargeting the enterprise\nto steal session cookies and corporate credentials.\nReliaQuest says this is reflected in the Russian Market, with 61% of the stolen logs containing SaaS credentials from platforms like Google Workspace, Zoom, and Salesforce. Also, 77% of the logs included SSO (Single Sign-On) credentials.\n\"Compromised cloud accounts afford attackers access to critical systems and present the perfect opportunity to steal sensitive data,\" explains the researchers.\nLumma falters, Acreed rises\nReliaQuest analyzed over 1.6 million posts on the Russian Market to graph the rise and fall in popularity of specific info-stealing malware.\nUntil recently, most logs were stolen by Lumma stealer, which accounts for 92% of all credential logs sold on the Russian Market.\nInfostealer logs percentage of Russian Market\nSource: ReliaQuest\nLumma dominated the market after the collapse of Raccoon Stealer, following\nlaw enforcement action\n. However, the same fate could be unfolding for Lumma, as its operations were recently\ndisrupted by a global law enforcement operation\nwhere 2,300 domains were seized.\nThe long-term results of this operation remain unclear, and\nCheck Point reported\nthat Lumma's developers are currently attempting to rebuild and restart their cybercrime operations.\nIn the meantime, ReliaQuests reports seeing a sudden rise of a new infostealer named Acreed, which is rapidly gaining traction following the takedown of Lumma.\nAcreed's swift ascent in the Russian Market is reflected in the over 4,000 logs uploaded within its first week of operations,\naccording to Webz\n.\nAcreed isn't different from a typical info-stealer regarding the information it targets, which includes data stored in Chrome, Firefox, and their various derivatives, including passwords, cookies, cryptocurrency wallets, and credit card details.\nInfo-stealers are infecting users via phishing emails, \"ClickFix\" attacks, malvertising for premium software, and YouTube or TikTok videos. So, vigilance and good software download practices are recommended to avoid this widespread risk.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nLumma infostealer malware operation disrupted, 2,300 domains seized\nTikTok videos now push infostealer malware in ClickFix attacks\nPolice arrests 270 dark web vendors, buyers in global crackdown\nKosovo extradites BlackDB admin to face US cybercrime charges\nFake AI video generators drop new Noodlophile infostealer malware"
    },
    {
        "Title": "Microsoft ships emergency patch to fix Windows 11 startup failures",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-ships-emergency-patch-to-fix-windows-11-installation-issues/",
        "Summary": "Microsoft has released an out-of-band update to address a known issue causing some Windows 11 systems to enter recovery and fail to start after installing the KB5058405 May 2025 security update. [...]",
        "Date": "2025-06-02",
        "Content": "Microsoft has released an out-of-band update to address a known issue causing some Windows 11 systems to enter recovery and fail to start after installing the KB5058405 May 2025 security update.\nUsers on the affected computers see 0xc0000098 recovery errors in ACPI.sys (the Windows Advanced Configuration and Power Interface driver, a Windows kernel-mode driver critical for power management and device configuration), warning them that the device must be repaired because the operating system couldn't be loaded.\nAs Microsoft revealed when it\nacknowledged the issue\non Thursday, this known issue affects Windows 11 22H2/23H2 systems in enterprise environments and mainly impacts Azure Virtual Machines, Azure Virtual Desktop, and on-premises virtual machines hosted on Citrix or Hyper-V.\n\"We are investigating reports of the May 13, 2025 Windows security update (KB5058405) failing to install on some Windows 11, version 22H2 and 23H2 devices,\" the company said when it\nacknowledged the issue\non Thursday.\n​Redmond added that PCs running Windows Home or Pro editions in home environments are unlikely to face these issues because the impacted virtual machines are mostly used in IT environments.\nRecovery screen with 0xc0000098 ACPI.sys error (\nMain-Apartment8743\n)\nEmergency update available via Microsoft Update Catalog\nOver the weekend, the company released the KB5062170 non-security out-of-band update to mitigate these installation and boot problems, which can be installed manually using the standalone MSU packages from the\nMicrosoft Update Catalog\n.\n\"We recommend using\nAzure Virtual Machine repair commands\nas a workaround for Azure customers who have already applied the May 2025 Windows security update and are experiencing this issue,\" the company\nnoted\nin a Saturday update to the Windows release health dashboard.\n\"If you have not yet deployed the May 2025 Windows security update (KB5058405) and your environment includes devices running in a virtual desktop infrastructure on Windows 11, versions 22H2 and 23H2, we recommend you apply the OOB update instead.\"\nIn April, Microsoft addressed a \"latent code issue\"\ncausing some systems to be upgraded to Windows 11\nautomatically despite Intune policies set up to block Windows 11 upgrades.\nMicrosoft also fixed a known issue\nblocking Windows 11 24H2 feature updates\nvia Windows Server Update Services (WSUS) after deploying the April 2025 security updates.\nEarlier this month, it shipped another round of emergency out-of-band updates to\nmitigate a Windows 10 bug\nforcing PCs into BitLocker recovery after installing the May 2025 security updates.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nMicrosoft: Windows 11 might fail to start after installing KB5058405\nWindows Server emergency update fixes Hyper-V VM freezes, restart issues\nMicrosoft: New Windows updates fix Active Directory policy issues\nWindows 11 KB5058411 and KB5058405 cumulative updates released\nWindows 11 upgrade block lifted after Safe Exam Browser fix"
    },
    {
        "Title": "Qualcomm fixes three Adreno GPU zero-days exploited in attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/qualcomm-fixes-three-adreno-gpu-zero-days-exploited-in-attacks/",
        "Summary": "Qualcomm has released security patches for three zero-day vulnerabilities in the Adreno Graphics Processing Unit (GPU) driver that impact dozens of chipsets and are actively exploited in targeted attacks. [...]",
        "Date": "2025-06-02",
        "Content": "Qualcomm has released security patches for three zero-day vulnerabilities in the Adreno Graphics Processing Unit (GPU) driver that impact dozens of chipsets and are actively exploited in targeted attacks.\nThe company says two critical flaws (tracked as\nCVE-2025-21479\nand\nCVE-2025-21480\n) were reported through the Google Android Security team in late January, and a third high-severity vulnerability (\nCVE-2025-27038\n) was reported in March.\nThe first two are both Graphics framework incorrect authorization weaknesses that can lead to memory corruption because of unauthorized command execution in the GPU micronode while executing a specific sequence of commands, while CVE-2025-27038 is a use-after-free causing memory corruption while rendering graphics using Adreno GPU drivers in Chrome.\n\"There are indications from Google Threat Analysis Group that CVE-2025-21479, CVE-2025-21480, CVE-2025-27038 may be under limited, targeted exploitation,\"\nQualcomm warned\nin a Monday advisory.\n\"Patches for the issues affecting the Adreno Graphics Processing Unit (GPU) driver have been made available to OEMs in May together with a strong recommendation to deploy the update on affected devices as soon as possible.\"\nThis month, Qualcomm has also addressed a buffer over-read in Data Network Stack & Connectivity (\nCVE-2024-53026\n) that unauthenticated attackers can exploit to gain access to restricted information using invalid RTCP packets sent during a VoLTE/VoWiFi IMS calls.\nIn October, the company\nfixed\nanother zero-day (CVE-2024-43047) that the Serbian Security Information Agency (BIA) and the Serbian police\nexploited\nto unlock seized Android devices belonging to activists, journalists, and protestors using Cellebrite's data extraction software.\nWhile investigating the attacks, Google's Threat Analysis Group (TAG) found evidence suggesting that devices were also infected with NoviSpy spyware using an exploit chain to circumvent Android's security mechanisms and install itself persistently at the kernel level.\nOne year earlier, Qualcomm also warned that threat actors were\nexploiting three more zero-day vulnerabilities\nin its GPU and Compute DSP drivers.\nIn recent years, the company has patched various other chipset security flaws that could let attackers access users'\ntext messages, call history\n,\nmedia files\n,\nand real-time conversations\n.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nGoogle fixes Android zero-day exploited by Serbian authorities\nGoogle fixes Android zero-days exploited in attacks, 60 other flaws\nCISA tags recently patched Chrome bug as actively exploited\nGoogle tags a tenth Chrome zero-day as exploited this year\nSAP patches second zero-day flaw exploited in recent attacks"
    },
    {
        "Title": "EMR-ISAC Shuts Down: What Happens Now?",
        "Link": "https://www.darkreading.com/threat-intelligence/emr-isac-shuts-down-what-now",
        "Summary": "The Emergency Management and Response - Information Sharing and Analysis Center provided essential information to the emergency services sector on physical and cyber threats and its closure leaves an information vacuum for these organizations.",
        "Date": "2025-06-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/emr-isac-shuts-down-what-now"
    },
    {
        "Title": "Exploitation Risk Grows for Critical Cisco Bug",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/exploitation-risk-grows-critical-cisco-bug",
        "Summary": "New details on the Cisco IOS XE vulnerability could help attackers develop a working exploit soon, researchers say.",
        "Date": "2025-06-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/exploitation-risk-grows-critical-cisco-bug"
    },
    {
        "Title": "Trickbot, Conti Ransomware Operator Unmasked Amid Huge Ops Leak",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/trickbot-conti-ransomware-operator-unmasked",
        "Summary": "An anonymous whistleblower has leaked large amounts of data tied to the alleged operator behind Trickbot and Conti ransomware.",
        "Date": "2025-06-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/trickbot-conti-ransomware-operator-unmasked"
    },
    {
        "Title": "Australia Begins New Ransomware Payment Disclosure Rules",
        "Link": "https://www.darkreading.com/threat-intelligence/australia-ransomware-payment-disclosure-rules",
        "Summary": "The country will require certain organizations to report ransomware payments and communications within 72 hours after they're made or face potential civil penalties.",
        "Date": "2025-06-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/australia-ransomware-payment-disclosure-rules"
    },
    {
        "Title": "Critical Bugs Could Spark Takeover of Widely Used Fire Safety OT/ICS Platform",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/critical-bugs-takeover-fire-safety-ot-ics-platform",
        "Summary": "The unpatched security vulnerabilities in Consilium Safety's CS5000 Fire Panel could create &quot;serious safety issues&quot; in environments where fire suppression and safety are paramount, according to a CISA advisory.",
        "Date": "2025-06-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/critical-bugs-takeover-fire-safety-ot-ics-platform"
    },
    {
        "Title": "Beyond the Broken Wall: Why the Security Perimeter Is Not Enough",
        "Link": "https://www.darkreading.com/endpoint-security/beyond-broken-wall-why-security-perimeter-not-enough",
        "Summary": "Organizations need to abandon perimeter-based security for data-centric protection strategies in today's distributed IT environments.",
        "Date": "2025-06-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/beyond-broken-wall-why-security-perimeter-not-enough"
    },
    {
        "Title": "In the AI Race With China, Don't Forget About Security",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/ai-race-china-dont-forget-about-security",
        "Summary": "The US needs to establish a clear framework to provide reasonable guardrails to protect its interests — the quicker, the better.",
        "Date": "2025-06-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/ai-race-china-dont-forget-about-security"
    },
    {
        "Title": "Cartier Data Breach: Luxury Retailer Warns Customers that Personal Data Was Exposed",
        "Link": "https://www.securityweek.com/cartier-data-breach-jewelry-maker-warns-customers-that-personal-data-was-exposed/",
        "Summary": "<p>Luxury brand Cartier disclosed a data breach in which an unauthorized party gained access to its systems and obtained some client information.</p>\n<p>The post <a href=\"https://www.securityweek.com/cartier-data-breach-jewelry-maker-warns-customers-that-personal-data-was-exposed/\">Cartier Data Breach: Luxury Retailer Warns Customers that Personal Data Was Exposed</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cartier-data-breach-jewelry-maker-warns-customers-that-personal-data-was-exposed/"
    },
    {
        "Title": "Cryptojackers Caught Mining Monero via Exposed DevOps Infrastructure",
        "Link": "https://www.securityweek.com/cryptojackers-caught-mining-monero-via-exposed-devops-infrastructure/",
        "Summary": "<p>Cryptocurrency mining operation hits exposed Consul dashboards, Docker Engine APIs and Gitea code-hosting instances to push Monero miner.</p>\n<p>The post <a href=\"https://www.securityweek.com/cryptojackers-caught-mining-monero-via-exposed-devops-infrastructure/\">Cryptojackers Caught Mining Monero via Exposed DevOps Infrastructure</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cryptojackers-caught-mining-monero-via-exposed-devops-infrastructure/"
    },
    {
        "Title": "Qualcomm Flags Exploitation of Adreno GPU Flaws, Urges OEMs to Patch Urgently",
        "Link": "https://www.securityweek.com/qualcomm-flags-exploitation-of-adreno-gpu-flaws-urges-oems-to-patch-urgently/",
        "Summary": "<p>Chipmaker says there are indications from Google Threat Analysis Group that a trio of flaws “may be under limited, targeted exploitation.”</p>\n<p>The post <a href=\"https://www.securityweek.com/qualcomm-flags-exploitation-of-adreno-gpu-flaws-urges-oems-to-patch-urgently/\">Qualcomm Flags Exploitation of Adreno GPU Flaws, Urges OEMs to Patch Urgently</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/qualcomm-flags-exploitation-of-adreno-gpu-flaws-urges-oems-to-patch-urgently/"
    },
    {
        "Title": "vBulletin Vulnerability Exploited in the Wild",
        "Link": "https://www.securityweek.com/vbulletin-vulnerability-exploited-in-the-wild/",
        "Summary": "<p>Exploitation of the vBulletin vulnerability tracked as CVE-2025-48827 and CVE-2025-48828 started shortly after disclosure.</p>\n<p>The post <a href=\"https://www.securityweek.com/vbulletin-vulnerability-exploited-in-the-wild/\">vBulletin Vulnerability Exploited in the Wild</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/vbulletin-vulnerability-exploited-in-the-wild/"
    },
    {
        "Title": "Chrome to Distrust Chunghwa Telecom and Netlock Certificates",
        "Link": "https://www.securityweek.com/chrome-to-distrust-chunghwa-telecom-and-netlock-certificates/",
        "Summary": "<p>Patterns of concerning behavior led Google to remove trust in certificates from Chunghwa Telecom and Netlock from Chrome.</p>\n<p>The post <a href=\"https://www.securityweek.com/chrome-to-distrust-chunghwa-telecom-and-netlock-certificates/\">Chrome to Distrust Chunghwa Telecom and Netlock Certificates</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chrome-to-distrust-chunghwa-telecom-and-netlock-certificates/"
    },
    {
        "Title": "Alleged Conti, TrickBot Gang Leader Unmasked",
        "Link": "https://www.securityweek.com/alleged-conti-trickbot-gang-leader-unmasked/",
        "Summary": "<p>Russian national Vitaly Nikolaevich Kovalev is believed to be the leader of the Conti and TrickBot cybercrime groups.</p>\n<p>The post <a href=\"https://www.securityweek.com/alleged-conti-trickbot-gang-leader-unmasked/\">Alleged Conti, TrickBot Gang Leader Unmasked</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/alleged-conti-trickbot-gang-leader-unmasked/"
    },
    {
        "Title": "Technical Details Published for Critical Cisco IOS XE Vulnerability",
        "Link": "https://www.securityweek.com/technical-details-published-for-critical-cisco-ios-xe-vulnerability/",
        "Summary": "<p>The critical flaw, tracked as CVE-2025-20188 (CVSS score of 10/10), allows attackers to execute arbitrary code remotely.</p>\n<p>The post <a href=\"https://www.securityweek.com/technical-details-published-for-critical-cisco-ios-xe-vulnerability/\">Technical Details Published for Critical Cisco IOS XE Vulnerability</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/technical-details-published-for-critical-cisco-ios-xe-vulnerability/"
    },
    {
        "Title": "Counter Antivirus Service AVCheck Shut Down by Law Enforcement",
        "Link": "https://www.securityweek.com/authorities-take-down-counter-antivirus-service-avcheck/",
        "Summary": "<p>Counter antivirus services such as AVCheck allow cybercriminals to test whether their malware is detected by antivirus products.</p>\n<p>The post <a href=\"https://www.securityweek.com/authorities-take-down-counter-antivirus-service-avcheck/\">Counter Antivirus Service AVCheck Shut Down by Law Enforcement</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/authorities-take-down-counter-antivirus-service-avcheck/"
    },
    {
        "Title": "US Government Is Investigating Messages Impersonating Trump’s Chief of Staff, Susie Wiles",
        "Link": "https://www.securityweek.com/us-government-is-investigating-messages-impersonating-trumps-chief-of-staff-susie-wiles/",
        "Summary": "<p>Elected officials, business executives and other prominent figures in recent weeks received messages from someone impersonating Susie Wiles.</p>\n<p>The post <a href=\"https://www.securityweek.com/us-government-is-investigating-messages-impersonating-trumps-chief-of-staff-susie-wiles/\">US Government Is Investigating Messages Impersonating Trump&#8217;s Chief of Staff, Susie Wiles</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/us-government-is-investigating-messages-impersonating-trumps-chief-of-staff-susie-wiles/"
    },
    {
        "Title": "In Other News: PoC for Fortinet Bug, AI Model Subverts Shutdown, RAT Source Code Leaked",
        "Link": "https://www.securityweek.com/in-other-news-poc-for-fortinet-bug-ai-model-subverts-shutdown-rat-source-code-leaked/",
        "Summary": "<p>Noteworthy stories that might have slipped under the radar: simple PoC code released for Fortinet zero-day, OpenAI O3 disobeys shutdown orders, source code of SilverRAT emerges online.</p>\n<p>The post <a href=\"https://www.securityweek.com/in-other-news-poc-for-fortinet-bug-ai-model-subverts-shutdown-rat-source-code-leaked/\">In Other News: PoC for Fortinet Bug, AI Model Subverts Shutdown, RAT Source Code Leaked</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/in-other-news-poc-for-fortinet-bug-ai-model-subverts-shutdown-rat-source-code-leaked/"
    },
    {
        "Title": "Universitas Udayana Bali Allegedly Breached",
        "Link": "https://dailydarkweb.net/universitas-udayana-bali-allegedly-breached/",
        "Summary": "Universitas Udayana (UNUD), a significant public university situated in Denpasar, Bali, Indonesia, has allegedly been the victim of a cyberattack leading to a substantial data breach. Established in 1962, the university is a key institution of higher education in Eastern Indonesia, hosting a diverse range of academic programs and a large student population. The attack [&#8230;]",
        "Date": "2025-06-02",
        "Content": "Universitas Udayana (UNUD), a significant public university situated in Denpasar, Bali, Indonesia, has allegedly been the victim of a cyberattack leading to a substantial data breach. Established in 1962, the university is a key institution of higher education in Eastern Indonesia, hosting a diverse range of academic programs and a large student population. The attack was purportedly claimed by an online entity or group.\nThe perpetrators claim to have accessed and exfiltrated data from the university’s digital infrastructure, releasing a “preview” of the compromised information. This initial sample suggests that at least one university database has been affected, with a specific table containing user information and 353 entries reportedly being compromised. The leaked data allegedly contains user-specific information.\nThe complete scope of the breach is currently undetermined, but the initial claims indicate the potential exposure of personal and sensitive data belonging to individuals associated with the university. The following data field titles were reportedly included in the leaked dataset:\nid\nid_sso\nstate\nvisits\npassword\nusername\ndate_visit\nTags:\nallegedly\nBali\nCyberSecurity\ndata-breach\ndata-leak\nEducation\nUniversitas Udayana\nUNUD"
    },
    {
        "Title": "Uruguay’s National Vehicle System SUCIVE Allegedly Breached, Access Reportedly for Sale Online",
        "Link": "https://dailydarkweb.net/uruguays-national-vehicle-system-sucive-allegedly-breached-access-reportedly-for-sale-online/",
        "Summary": "A concerning post has surfaced on an online forum advertising the alleged sale of access to the network systems of Uruguay&#8217;s Sistema Único de Cobro de Ingresos Vehiculares (SUCIVE). SUCIVE is the unified system for collecting vehicle revenue, including vehicle taxes and fines, across Uruguay. It is a critical piece of national infrastructure, handling sensitive [&#8230;]",
        "Date": "2025-06-02",
        "Content": "A concerning post has surfaced on an online forum advertising the alleged sale of access to the network systems of Uruguay’s Sistema Único de Cobro de Ingresos Vehiculares (SUCIVE). SUCIVE is the unified system for collecting vehicle revenue, including vehicle taxes and fines, across Uruguay. It is a critical piece of national infrastructure, handling sensitive data for vehicle owners and managing significant financial transactions for the state. The compromise of such a system could have widespread implications for Uruguayan citizens and government operations.\nThe unidentified seller claims that the offered access would allow for extensive manipulation and viewing capabilities within the SUCIVE network. The advertisement suggests that the buyer would allegedly be able to perform actions such as modifying fines, including marking them as paid, altering vehicle details like expiration dates and driver information, consulting comprehensive vehicle records including registration and official documents, and even creating new users within the administrative system. The sale was listed with a disclaimer attempting to absolve the seller of responsibility for misuse, a common tactic in such illicit offerings.\nThe alleged capabilities offered by the seller highlight the potential severity of the breach, including:\nModification of financial records related to fines.\nAlteration of vehicle ownership and compliance data.\nUnauthorized access to sensitive vehicle and owner documentation.\nCreation of unauthorized administrative accounts.\nTags:\nAlleged\ncyber-attack\nCyberSecurity\ndata-breach\ngovernment\nSUCIVE\nUruguay\nvehicle registration"
    },
    {
        "Title": "Royal Moroccan Football Federation Allegedly Breached, FTP Server Data Leaked",
        "Link": "https://dailydarkweb.net/royal-moroccan-football-federation-allegedly-breached-ftp-server-data-leaked/",
        "Summary": "The Royal Moroccan Football Federation (FRMF), the governing body for football in Morocco, has allegedly fallen victim to a cyberattack. A threat actor has claimed responsibility for breaching an FTP (File Transfer Protocol) server belonging to the federation and has reportedly released the data. The FRMF is a significant organization within the nation, responsible for [&#8230;]",
        "Date": "2025-06-02",
        "Content": "The Royal Moroccan Football Federation (FRMF), the governing body for football in Morocco, has allegedly fallen victim to a cyberattack. A threat actor has claimed responsibility for breaching an FTP (File Transfer Protocol) server belonging to the federation and has reportedly released the data. The FRMF is a significant organization within the nation, responsible for managing the country’s national football leagues, national football teams, and is a key player in Morocco’s co-hosting of the 2030 FIFA World Cup and the upcoming 2025 Africa Cup of Nations.\nThe full scope and specific contents of the compromised data have not yet been officially detailed, but the threat actor’s claim suggests a significant exfiltration of files residing on the federation’s FTP server. These types of servers are commonly utilized for storing and transferring a wide array of file types, which could potentially include sensitive operational documents, administrative records, or personal information. The individual or group claiming responsibility for the breach also indicated that further data related to Morocco might be released in the near future.\nTags:\nCyberSecurity\ndata-breach\nFRMF\nFTP\nMorocco\nRoyal Moroccan Football Federation"
    },
    {
        "Title": "Indonesian Government Employee System “Ekinerja Tulungagung” Allegedly Breached",
        "Link": "https://dailydarkweb.net/indonesian-government-employee-system-ekinerja-tulungagung-allegedly-breached/",
        "Summary": "A sensitive data breach has allegedly impacted &#8220;Ekinerja Tulungagung,&#8221; an electronic performance management system used by civil servants in the Tulungagung Regency of East Java, Indonesia. The Ekinerja system is crucial for managing the personal and professional data of government employees in the region, making this alleged breach a significant concern for data privacy and [&#8230;]",
        "Date": "2025-06-02",
        "Content": "A sensitive data breach has allegedly impacted “Ekinerja Tulungagung,” an electronic performance management system used by civil servants in the Tulungagung Regency of East Java, Indonesia. The Ekinerja system is crucial for managing the personal and professional data of government employees in the region, making this alleged breach a significant concern for data privacy and security.\nThe compromised information reportedly includes a range of personally identifiable information (PII) and employment details of the civil servants. The extent of the breach is still being assessed, but the potential exposure of such sensitive data raises alarms about identity theft, fraud, and other malicious uses. This incident underscores the growing threat of cyberattacks targeting government infrastructure and the critical need for robust cybersecurity measures to protect official and personal data.\nThe leaked data titles allegedly include:\nNIP (Civil Servant Identification Number)\nNama Pegawai (Employee Name)\nUnit Kerja (Work Unit)\nJabatan (Position/Job Title)\nJabatan PLT/PLH (Acting/Temporary Position)\nTags:\nCyberSecurity\ndata-breach\nEkinerja Tulungagung\ngovernment\nIndonesia"
    },
    {
        "Title": "Yuantong Express Allegedly Breached: 7.4 Million User Data Records Reportedly for Sale",
        "Link": "https://dailydarkweb.net/yuantong-express-allegedly-breached-7-4-million-user-data-records-reportedly-for-sale/",
        "Summary": "Major Chinese logistics company, Yuantong Express (YTO Express), has allegedly suffered a significant data breach, with a threat actor claiming to be selling 7.4 million records of user information. YTO Express, headquartered in Shanghai, is one of the leading express delivery companies in China, playing a crucial role in the country&#8217;s massive e-commerce and logistics [&#8230;]",
        "Date": "2025-06-02",
        "Content": "Major Chinese logistics company, Yuantong Express (YTO Express), has allegedly suffered a significant data breach, with a threat actor claiming to be selling 7.4 million records of user information. YTO Express, headquartered in Shanghai, is one of the leading express delivery companies in China, playing a crucial role in the country’s massive e-commerce and logistics network. The company provides a wide range of domestic and international delivery services, making it a vital part of the supply chain for numerous businesses and individual consumers.\nThe individual or group behind the alleged sale posted in an online forum, claiming the compromised data includes a variety of sensitive customer details. While the authenticity of the data is yet to be fully verified, the sample provided in the post suggests that the information could be extensive. The news highlights the persistent and evolving threats facing large organizations that handle substantial volumes of personal data.\nThe following data types are allegedly included in the breach:\nNames\nAddresses\nTelephone numbers\nProduct names\nTags:\nallegedly\nChina\nCyberSecurity\ndata-breach\ndata-leak\nLogistics\nPersonal Information\nYTO Express\nYuantong Express"
    }
]