[
    {
        "Title": "Former Black Basta Members Use Microsoft Teams and Python Scripts in 2025 Attacks",
        "Link": "https://thehackernews.com/2025/06/former-black-basta-members-use.html",
        "Summary": "Former members tied to the Black Basta ransomware operation have been observed sticking to their tried-and-tested approach of email bombing and Microsoft Teams phishing to establish persistent access to target networks.\n\"Recently, attackers have introduced Python script execution alongside these techniques, using cURL requests to fetch and deploy malicious payloads,\" ReliaQuest said in a report",
        "Date": "2025-06-11",
        "Content": "Former members tied to the Black Basta ransomware operation have been observed sticking to their tried-and-tested approach of\nemail bombing and Microsoft Teams phishing\nto establish persistent access to target networks.\n\"Recently, attackers have introduced Python script execution alongside these techniques, using cURL requests to fetch and deploy malicious payloads,\" ReliaQuest\nsaid\nin a report shared with The Hacker News.\nThe development is a sign that the threat actors are continuing to pivot and regroup, despite the\nBlack Basta brand\nsuffering a huge blow and a decline after the\npublic leak of its internal chat logs\nearlier this February.\nThe cybersecurity company said half of the Teams phishing attacks that were observed between February and May 2025 originated from onmicrosoft[.]com domains, and that breached domains accounted for 42% of the attacks during the same period. The latter is a lot more stealthy and allows threat actors to impersonate legitimate traffic in their attacks.\nAs recently as last month, ReliaQuest's customers in the finance and insurance sector and the construction sector have been targeted using Teams phishing by masquerading as help desk personnel to trick unsuspecting users.\n\"The shutdown of Black Basta's data-leak site, despite the continued use of its tactics, indicates that former affiliates have likely either migrated to another RaaS group or formed a new one,\" the company added. \"The most probable scenario is that former members have joined the\nCACTUS RaaS group\n, which is evidenced by Black Basta leader Trump referencing a $500–600K payment to CACTUS in the leaked chats.\"\nThat said, it's worth noting that CACTUS hasn't named any organizations on its data leak site since March 2025, indicating that the group has either disbanded or is deliberately trying to avoid drawing attention to itself. Another possibility is that the affiliates have moved to\nBlackLock\n, which, in turn, is believed to have started collaborating with a\nransomware cartel\nnamed\nDragonForce\n.\nThe threat actors have also been spotted leveraging the access obtained via the Teams phishing technique to initial remote desktop sessions via Quick Assist and AnyDesk, and then downloading a malicious Python script from a remote address and executing it to establish command-and-control (C2) communications.\n\"The use of Python scripts in this attack highlights an evolving tactic that's likely to become more prevalent in future Teams phishing campaigns in the immediate future,\" ReliaQuest said.\nThe Black Basta-style social engineering strategy of using a combination of email spamming, Teams phishing, and Quick Assist has since also found takers among the BlackSuit ransomware group, raising the possibility that BlackSuit affiliates have either embraced the approach or absorbed members of the group.\nAccording to Rapid7, the initial access serves as a pathway to download and execute updated variants of a Java-based RAT that was previously deployed to act as a\ncredential harvester\nin Black Basta attacks.\n\"The Java malware now abuses cloud-based file hosting services provided by both Google and Microsoft to proxy commands through the respective cloud service provider's (CSP) servers,\" the company\nsaid\n. \"Over time, the malware developer has shifted away from direct proxy connections (i.e., the config option is left blank or not present), towards OneDrive and Google Sheets, and most recently, towards simply using Google Drive.\"\nThe new iteration of the malware packs in more features to transfer files between the infected host and a remote server, initiate a SOCKS5 proxy tunnel, steal credentials stored in web browsers, present a fake Windows login window, and download a Java class from a supplied URL and run it in memory.\nLike the 3AM ransomware attacks detailed by Sophos a couple of weeks ago, the intrusions are also characterized by the use of a tunneling backdoor called QDoor, a malware previously attributed to BlackSuit, and a Rust payload that's likely a custom loader for the SSH utility, and a Python RAT referred to as\nAnubis\n.\nThe findings come amid a number of developments in the ransomware landscape -\nThe financially motivated group known as\nScattered Spider\nhas\ntargeted\nmanaged service providers (MSPs) and IT vendors as part of a \"one-to-many\" approach to infiltrate multiple organizations through a single compromise, in some cases exploiting compromised accounts from the global IT contractor Tata Consultancy Services (TCS) to gain initial access.\nScattered Spider has created bogus login pages using the Evilginx phishing kit to bypass multi-factor authentication (MFA) and\nforged strategic alliances\nwith major ransomware operators like ALPHV (aka BlackCat), RansomHub, and, most recently, DragonForce, to conduct sophisticated attacks targeting MSPs by exploiting vulnerabilities in\nSimpleHelp remote desktop software\n.\nQilin\n(aka Agenda and Phantom Mantis) ransomware operators have\nlaunched\na coordinated intrusion campaign targeting several organizations between May and June 2025 by weaponizing Fortinet FortiGate vulnerabilities (e.g.,\nCVE-2024-21762\nand\nCVE-2024-55591\n) for initial access.\nThe\nPlay\n(aka Balloonfly and PlayCrypt) ransomware group is\nestimated\nto have compromised 900 entities as of May 2025 since its emergence in mid-2022. Some of the attacks have leveraged SimpleHelp flaws (CVE-2024-57727) to target many U.S.-based entities following public disclosure of the vulnerability.\nThe administrator of the\nVanHelsing\nransomware group\nhas leaked the entire source code on the RAMP forum, citing internal conflicts between developers and leadership. The leaked details include the TOR keys, ransomware source code, admin web panel, chat system, file server, and the blog with its full database, per\nPRODAFT\n.\nThe\nInterlock\nransomware group\nhas deployed a previously undocumented JavaScript remote access trojan called\nNodeSnake\nas part of attacks targeting local government and higher education organizations in the United Kingdom in January and March 2025. The malware, distributed via phishing emails, offers persistent access, system reconnaissance, and remote command execution capabilities.\n\"RATs enable attackers to gain remote control over infected systems, allowing them to access files, monitor activities, and manipulate system settings,\" Quorum Cyber\nsaid\n. \"Threat actors can use a RAT to maintain persistence within an organization as well as to introduce additional tooling or malware to the environment. They can also access, manipulate, destroy, or exfiltrate data.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "295 Malicious IPs Launch Coordinated Brute-Force Attacks on Apache Tomcat Manager",
        "Link": "https://thehackernews.com/2025/06/295-malicious-ips-launch-coordinated.html",
        "Summary": "Threat intelligence firm GreyNoise has warned of a \"coordinated brute-force activity\" targeting Apache Tomcat Manager interfaces.\nThe company said it observed a surge in brute-force and login attempts on June 5, 2025, an indication that they could be deliberate efforts to \"identify and access exposed Tomcat services at scale.\"\nTo that end, 295 unique IP addresses have been found to be engaged",
        "Date": "2025-06-11",
        "Content": "Threat intelligence firm GreyNoise has warned of a \"coordinated brute-force activity\" targeting Apache Tomcat Manager interfaces.\nThe company said it\nobserved\na surge in brute-force and login attempts on June 5, 2025, an indication that they could be deliberate efforts to \"identify and access exposed Tomcat services at scale.\"\nTo that end, 295 unique IP addresses have been found to be engaged in brute-force attempts against Tomcat Manager on that date, with all of them classified as malicious. Over the past 24 hours,\n188 unique IPs\nhave been recorded, a majority of them located in the United States, the United Kingdom, Germany, the Netherlands, and Singapore.\nIn a similar vein,\n298 unique IPs\nwere observed conducting login attempts against Tomcat Manager instances. Of the 246 IP addresses flagged in the last 24 hours, all of them are categorized as malicious and originate from the same locations.\nTargets of these attempts include the United States, the United Kingdom, Spain, Germany, India, and Brazil for the same time period. GreyNoise noted that a significant chunk of the activity came from infrastructure hosted by DigitalOcean (ASN 14061).\n\"While not tied to a specific vulnerability, this behavior highlights ongoing interest in exposed Tomcat services,\" the company added. \"Broad, opportunistic activity like this often serves as an early warning of future exploitation.\"\nTo mitigate any potential risks, organizations with exposed Tomcat Manager interfaces are recommended to implement strong authentication and access restrictions, and monitor for any signs of suspicious activity.\nThe disclosure comes as Bitsight revealed that it found more than 40,000 security cameras openly accessible on the internet, potentially enabling anyone to access live video feeds captured by these devices over HTTP or Real-Time Streaming Protocol (RTSP). The exposures are concentrated in the United States, Japan, Austria, Czechia, and South Korea.\nThe telecommunications sector accounts for 79% of the exposed cameras, followed by technology (6%), media (4.1%), utilities (2.5%), education (2.2%), business services (2.2%), and government (1.2%).\nThe installations range from those installed in residences, offices, public transportation systems, and factory settings, inadvertently leaking sensitive information that could then be exploited for espionage, stalking, and extortion.\nUsers are advised to change default usernames and passwords, disable remote access if not required (or restrict access with firewalls and VPNs), and keep firmware up-to-date.\n\"These cameras – intended for security or convenience – have inadvertently become public windows into sensitive spaces, often without their owners' knowledge,\" security researcher João Cruz\nsaid\nin a report shared with The Hacker News.\n\"No matter the reason why one individual or organization needs this kind of device, the fact that anyone can buy one, plug it in, and start streaming with minimal setup is likely why this is still an ongoing threat.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "INTERPOL Dismantles 20,000+ Malicious IPs Linked to 69 Malware Variants in Operation Secure",
        "Link": "https://thehackernews.com/2025/06/interpol-dismantles-20000-malicious-ips.html",
        "Summary": "INTERPOL on Wednesday announced the dismantling of more than 20,000 malicious IP addresses or domains that have been linked to 69 information-stealing malware variants.\nThe joint action, codenamed Operation Secure, took place between January and April 2025, and involved law enforcement agencies from 26 countries to identify servers, map physical networks, and execute targeted takedowns.\n\"These",
        "Date": "2025-06-11",
        "Content": "INTERPOL on Wednesday announced the dismantling of more than 20,000 malicious IP addresses or domains that have been linked to 69 information-stealing malware variants.\nThe joint action, codenamed\nOperation Secure\n, took place between January and April 2025, and involved\nlaw enforcement agencies\nfrom 26 countries to identify servers, map physical networks, and execute targeted takedowns.\n\"These coordinated efforts resulted in the takedown of 79 percent of identified suspicious IP addresses,\" INTERPOL\nsaid\nin a statement. \"Participating countries reported the seizure of 41 servers and over 100 GB of data, as well as the arrest of 32 suspects linked to illegal cyber activities.\"\nVietnamese authorities arrested 18 suspects, and confiscated devices, SIM cards, business registration documents, and money worth $11,500. Further house raids have led to the arrest of another 12 people in Sri Lanka and two individuals in Nauru.\nThe Hong Kong Police, per INTERPOL, identified 117 command-and-control servers hosted across 89 internet service providers. These servers were designed to act as a hub to launch and manage malicious campaigns, such as phishing, online fraud, and social media scams.\nCountries involved in Operation Secure include Brunei, Cambodia, Fiji, Hong Kong (China), India, Indonesia, Japan, Kazakhstan, Kiribati, Laos, Macau (China), Malaysia, Maldives, Nauru, Nepal, Papua New Guinea, Philippines, Samoa, Singapore, Solomon Islands, South Korea, Sri Lanka, Thailand, Timor-Leste, Tonga, Vanuatu, and Vietnam.\nThe development comes weeks after a global operation led to the\nseizure of 2,300 domains\nassociated with the Lumma Stealer malware.\nInformation stealers, often sold on the cybercrime underground on a subscription basis, are seen as a stepping stone for threat actors to gain unauthorized access to target networks. These malicious programs make it possible to siphon browser credentials, passwords, cookies, credit card details, and cryptocurrency wallet data from infected machines.\nThe stolen information is then monetized in the form of logs on various forums, enabling other actors to conduct follow-on attacks, including ransomware, data breaches, and business email compromise (BEC).\nSingapore-headquartered Group-IB, which was one of the private sector companies that participated in the operation, said it provided mission-critical intelligence related to user accounts compromised by stealer malware like Lumma, RisePro, and Meta Stealer.\n\"The compromised credentials and sensitive data acquired by cybercriminals through infostealer malware often serve as initial vectors for financial fraud and ransomware attacks,\" said Dmitry Volkov, CEO of Group-IB.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Why DNS Security Is Your First Defense Against Cyber Attacks?",
        "Link": "https://thehackernews.com/2025/06/why-dns-security-is-your-first-defense.html",
        "Summary": "In today’s cybersecurity landscape, much of the focus is placed on firewalls, antivirus software, and endpoint detection. While these tools are essential, one critical layer often goes overlooked: the Domain Name System (DNS). As the starting point of nearly every online interaction, DNS is not only foundational - it’s increasingly a target. When left unsecured, it becomes a single point of",
        "Date": "2025-06-11",
        "Content": "In today's cybersecurity landscape, much of the focus is placed on firewalls, antivirus software, and endpoint detection. While these tools are essential, one critical layer often goes overlooked: the Domain Name System (DNS). As the starting point of nearly every online interaction, DNS is not only foundational - it's increasingly a target. When left unsecured, it becomes a single point of failure that can disrupt services, redirect users, or expose sensitive data. Securing it isn't just good practice - it's a necessity.\nWhy DNS Is a Core Part of Internet Infrastructure\nThe Domain Name System, or DNS, functions like the internet's address book. It translates easy-to-remember domain names (like\nexample.com\n) into the numerical IP addresses (like\n1.2.3.4\n) that computers use to identify each other across networks. Every time a user visits a website, opens an app, or sends an email, a DNS query is triggered in the background to connect that request to the correct server. Without DNS, users would need to memorize complex strings of numbers for every online destination. While it operates quietly and efficiently, DNS is essential to how we navigate the internet - and when it's disrupted or attacked, the entire digital experience can break down.\nDNS: A Prime Target for Cyber Attackers\nDNS might seem like just another background process - quietly resolving domain names so users can browse the internet without typing IP addresses. But beneath that simplicity lies a critical system that cyber attackers love to exploit. Why? Because DNS touches everything. It's involved in almost every click, connection, and request made online.\nThe problem is, that DNS wasn't built with security in mind. Most DNS traffic is unencrypted, unauthenticated, and largely invisible to traditional security tools. That makes it the perfect channel for attackers to launch stealthy, high-impact attacks - from silent redirections to full-scale service outages.\nSome of the most common DNS-based attacks include:\nDNS Spoofing\n- Trick the resolver into sending users to fake websites that look real.\nDNS Hijacking\n- Change DNS records or settings to reroute traffic through malicious servers.\nDNS Tunneling\n- Hide stolen data inside DNS traffic to sneak it past firewalls.\nDDoS on DNS Servers\n- Overwhelm DNS infrastructure, making websites and apps unreachable.\nThese aren't just technical tricks - they're methods that can take entire businesses offline, compromise sensitive data, or silently spy on users. That's why securing DNS is no longer optional - it's a frontline defense.\nEarly Detection, Early Defense\nSecuring DNS means protecting the very first step in an attacker's chain. By inspecting and controlling DNS traffic, organizations can block threats before they reach internal systems. This doesn't just reduce the chance of compromise - it buys time. Time to react, time to investigate, and time to mitigate before damage is done.\nIn this way, DNS becomes more than just a directory service - it transforms into a sensor and a shield. Through careful\nmonitoring of DNS queries\nand patterns, it's possible to detect anomalies that suggest early-stage intrusions, like malware trying to call home or users unknowingly accessing a spoofed domain.\nWhat makes this even more compelling is the fact that DNS traffic is relatively lightweight and ubiquitous. It offers a rich stream of security-relevant data without adding intrusive layers to user devices or degrading performance.\nThe Role of ClouDNS in Securing DNS\nFast DNS resolution is a critical foundation, but without integrated security, it leaves your infrastructure exposed. This is where advanced DNS providers bring critical capabilities to the table - features that ensure both resilience and security.\nOne such provider is\nClouDNS\n, a global DNS hosting provider that combines speed, reliability, and built-in security to help organizations stay online and protected. Their infrastructure includes\nDDoS-protected DNS\n, a necessity in today's environment where DDoS attacks can take down entire domains in minutes. By absorbing and deflecting malicious traffic, such systems ensure uninterrupted access for legitimate users even under active attack.\nAnother crucial advancement is\nDNSSEC (Domain Name System Security Extensions)\n. DNSSEC adds cryptographic signatures to DNS records, ensuring that the responses users receive are authentic and unaltered. Without it, attackers can spoof legitimate-looking domains and redirect users to malicious destinations with alarming ease. With DNSSEC enabled, that risk is drastically reduced.\nAs threats grow more sophisticated, encrypting DNS queries is now a critical layer of defense. ClouDNS supports\nDNS over HTTPS (DoH)\nand\nDNS over TLS (DoT)\n, which help prevent man-in-the-middle attacks by encrypting DNS queries between the client and the resolver. This matters especially in environments like public Wi-Fi, where unencrypted traffic can be intercepted or tampered with.\nAnd because DNS isn't just about websites, but also plays a crucial role in email delivery, ClouDNS helps secure this process as well. From its user-friendly platform, users can easily create and manage\nSPF, DKIM, and DMARC records\n- essential DNS configurations that help prevent phishing and spoofing by specifying which mail servers are authorized to send emails on behalf of a domain. ClouDNS simplifies even more complex setups, enabling organizations to strengthen their domain reputation and improve email deliverability.\nDNS Security Is Not Optional, It's Fundamental\nAs digital infrastructure grows more complex, DNS is no longer just a background service - it's a critical control point in every online interaction. From loading websites and processing transactions to sending emails and accessing cloud-based tools, DNS is the silent engine behind it all. Its reach is vast, and so is its potential impact if left unsecured.\nBecause DNS touches every corner of an organization's digital footprint, it offers a unique vantage point - and an opportunity. When properly secured and monitored, DNS becomes more than just a resolver; it acts as an early detection layer, revealing suspicious patterns, malicious queries, and signs of compromise before threats escalate.\nThat's why working with a DNS provider that understands both performance and security - like ClouDNS - is not just a technical decision; it's a business-critical one. It's about ensuring uptime, trust, and protection in a digital world that leaves no room for blind spots.\nFinal Thoughts\nAs cyber threats grow more advanced, relying solely on internal defenses is no longer enough. DNS, as the first step in nearly every online interaction, plays a critical role in stopping threats before they reach the network. When properly secured, DNS becomes more than infrastructure - it becomes a frontline defense. Prioritizing DNS security is not just smart; it's essential for building a resilient digital foundation.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "SinoTrack GPS Devices Vulnerable to Remote Vehicle Control via Default Passwords",
        "Link": "https://thehackernews.com/2025/06/sinotrack-gps-devices-vulnerable-to.html",
        "Summary": "Two security vulnerabilities have been disclosed in SinoTrack GPS devices that could be exploited to control certain remote functions on connected vehicles and even track their locations.\n\"Successful exploitation of these vulnerabilities could allow an attacker to access device profiles without authorization through the common web management interface,\" the U.S. Cybersecurity and Infrastructure",
        "Date": "2025-06-11",
        "Content": "Two security vulnerabilities have been disclosed in SinoTrack GPS devices that could be exploited to control certain remote functions on connected vehicles and even track their locations.\n\"Successful exploitation of these vulnerabilities could allow an attacker to access device profiles without authorization through the common web management interface,\" the U.S. Cybersecurity and Infrastructure Security Agency (CISA)\nsaid\nin an advisory.\n\"Access to the device profile may allow an attacker to perform some remote functions on connected vehicles such as tracking the vehicle location and disconnecting power to the fuel pump where supported.\"\nThe vulnerabilities, per the agency, affect all versions of the SinoTrack IoT PC Platform. A brief description of the flaws is below -\nCVE-2025-5484\n(CVSS score: 8.3) - Weak authentication to the central SinoTrack device management interface stems from the use of a default password and a username that's an identifier printed on the receiver.\nCVE-2025-5485\n(CVSS score: 8.6) - The username used to authenticate to the web management interface, i.e., the identifier, is a numerical value of no more than 10 digits.\nAn attacker could retrieve device identifiers with either physical access or by capturing identifiers from pictures of the devices posted on publicly accessible websites such as eBay. Furthermore, the adversary could enumerate potential targets by incrementing or decrementing from known identifiers or through enumerating random digit sequences.\n\"Due to its lack of security, this device allows remote execution and control of the vehicles to which it is connected and also steals sensitive information about you and your vehicles,\" security researcher Raúl Ignacio Cruz Jiménez, who reported the flaws to CISA, told The Hacker News in a statement.\nThere are currently no fixes that address the vulnerabilities. The Hacker News has reached out to SinoTrack for comment, and we will update the story if we hear back.\nIn the absence of a patch, users are advised to change the default password as soon as possible and take steps to conceal the identifier. \"If the sticker is visible on publicly accessible photographs, consider deleting or replacing the pictures to protect the identifier,\" CISA said.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "How to Build a Lean Security Model: 5 Lessons from River Island",
        "Link": "https://thehackernews.com/2025/06/how-to-build-lean-security-model-5.html",
        "Summary": "In today&rsquo;s security landscape, budgets are tight, attack surfaces are sprawling, and new threats emerge daily. Maintaining a strong security posture under these circumstances without a large team or budget can be a real challenge. Yet lean security models are not only possible - they can be highly effective.\nRiver Island, one of the UK&rsquo;s leading fashion retailers, offers a powerful",
        "Date": "2025-06-11",
        "Content": "In today’s security landscape, budgets are tight, attack surfaces are sprawling, and new threats emerge daily. Maintaining a strong security posture under these circumstances without a large team or budget can be a real challenge. Yet lean security models are not only possible - they can be highly effective.\nRiver Island, one of the UK’s leading fashion retailers, offers a powerful case study on how to do more with less. As River Island’s InfoSec Officer, Sunil Patel and his small team of three are responsible for securing over 200 stores, an e-commerce platform, a major distribution center, and head offices. With no headcount growth on the horizon, Sunil had to rethink how security could scale effectively.\nBy adopting a lean security model, powered by\nIntruder’s exposure management platform\n, the team was able to improve visibility, respond faster to threats, and empower others across the business to fix what matters most.\nHere are five key lessons from their approach that any security team can apply.\n1. Automate Attack Surface Visibility\nA lean security model relies on the ability to quickly and clearly understand your external attack surface. River Island’s team lacked a central way to track what was exposed to the internet. Without a single, up-to-date view of their internet-facing assets, they relied on spreadsheets and manual checks and struggled to keep up with new risks stemming from a constantly changing infrastructure.\nBy adopting\ncontinuous network monitoring\nas part of their exposure management process, the team now detects attack surface changes automatically. When a new or unexpected service - like a login page, admin panel, or database - becomes accessible from the internet, they’re notified in real-time. This gives Sunil and his team a live, accurate view of what’s exposed and makes it easy to start automatically scanning these exposed assets for vulnerabilities.\n2. Select the Right Tools for the Job\nThe last thing a lean team needs is a stack of overlapping tools - each doing little, none doing enough.\nRiver Island had a range of security solutions in place, but many were underutilized. Sunil estimated they were “only getting about 5-6% of the possible value” from some products.\nRather than adding more to the mix, the team consolidated. This means less time spent context-switching and more time acting on clear, unified insights. With a smaller toolkit, it is easier to build the integrations and automation that are an essential part of being lean.\n3. Automate Emerging Threat Detection\nHigh-profile vulnerabilities like Log4j put lean teams under immense pressure. When critical vulnerabilities emerge, your ability to stay secure depends on how quickly you can assess exposure. But with limited resources, scrambling to do this manually is inefficient and unsustainable.\nUnified exposure management platforms like Intruder take the pressure off by automatically scanning for newly disclosed critical vulnerabilities so that you’re not left waiting for your next weekly or monthly scan to find out whether you have an issue.\nSpeaking to the impact of this, Sunil said, “When Log4j hit, our CIO asked if we were affected. I could tell him straight away: ‘We’re good - Intruder’s scanned for it and we’re in the clear.’”\nThis level of assurance builds trust with leadership, avoids unnecessary fire drills, and frees up the team to focus on remediation rather than investigation.\n4. Enable Asset Owners to Fix Issues Fast\nIn adopting a lean security model, the goal isn’t to fix everything yourself - it’s to make sure the right people are equipped to fix the right things, fast. That means removing the security team as a bottleneck and empowering others to remediate weaknesses.\n“One of my goals was to take the security team out of the equation completely from a process perspective,” said Sunil.\nPreviously, the InfoSec team was responsible for chasing down asset owners and translating technical recommendations for non-security experts. Now, by integrating their exposure management platform with Jira, vulnerabilities are routed directly to the relevant teams - along with easy-to-follow instructions needed to take action.\nThis shift has freed up InfoSec to focus on higher priorities, while service delivery managers handle day-to-day remediation.\nSunil said, “We’re not the nagging manager anymore. We just monitor and make sure things are progressing.”\n5. Report on Cyber Hygiene\nWhen you're running a lean security team, the last thing you want is to spend your limited time manually pulling reports or communicating updates to stakeholders. But visibility still matters - especially at the leadership level.\nAt River Island, that trust was built by shifting away from ad-hoc reporting towards automated dashboards that clearly show what’s exposed, what’s been fixed, and what still needs attention.\nSunil said, “I told my CIO, ‘You don’t have many one-to-ones with me,’ and he laughed and said, ‘That’s a good thing - it means nothing’s broken. Intruder gives him the confidence that we’ve got it covered, so he doesn’t need to check-in. That’s how I know things are working.”\nSmall Teams, Big Impact\nBeing lean doesn’t mean being underpowered. With the right tools, processes, and mindset, security teams of any size can build scalable, resilient, and efficient operations. River Island’s experience shows that doing more with less isn’t just possible - it can be a smarter, more sustainable approach to security.\nUnder pressure to do more with less?\nTry Intruder for free with a 14-day trial\n.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft Patches 67 Vulnerabilities Including WEBDAV Zero-Day Exploited in the Wild",
        "Link": "https://thehackernews.com/2025/06/microsoft-patches-67-vulnerabilities.html",
        "Summary": "Microsoft has released patches to fix 67 security flaws, including one zero-day bug in Web Distributed Authoring and Versioning (WebDAV) that it said has come under active exploitation in the wild.\nOf the 67 vulnerabilities, 11 are rated Critical and 56 are rated Important in severity. This includes 26 remote code execution flaws, 17 information disclosure flaws, and 14 privilege escalation",
        "Date": "2025-06-11",
        "Content": "Microsoft has released patches to fix\n67 security flaws\n, including one zero-day bug in Web Distributed Authoring and Versioning (WebDAV) that it said has come under active exploitation in the wild.\nOf the 67 vulnerabilities, 11 are rated Critical and 56 are rated Important in severity. This includes 26 remote code execution flaws, 17 information disclosure flaws, and 14 privilege escalation flaws.\nThe patches are in addition to\n13 shortcomings\naddressed by the company in its Chromium-based Edge browser since the release of last month's\nPatch Tuesday update\n.\nThe vulnerability that has been weaponized in real-world attacks concerns a remote code execution in WebDAV (\nCVE-2025-33053\n, CVSS score: 8.8) that can be triggered by deceiving users into clicking on a specially crafted URL.\nThe tech giant credited Check Point researchers Alexandra Gofman and David Driker for discovering and reporting the bug. It's worth mentioning that CVE-2025-33053 is the first zero-day vulnerability to be disclosed in the WebDAV standard.\nIn a separate report, the cybersecurity company attributed the abuse of CVE-2025-33053 to a\nthreat actor\nknown as\nStealth Falcon\n(aka FruityArmor), which has a history of leveraging Windows zero-days in its attacks. In September 2023, the hacking group was observed using a backdoor dubbed Deadglyph as part of an espionage campaign aimed at entities in Qatar and Saudi Arabia.\nWhile Stealth Falcon operations have been identified as likely tied to the United Arab Emirates by the Citizen Lab in the past, Eli Smadja, research group manager at Check Point Research, told The Hacker News they are \"unable to confirm any country affiliations\" given their focus on the groups and their tactics.\n\"The activity appears to be highly targeted, affecting specific victims rather than being widespread,\" Smadja said of the latest activity.\n\"The attack used a .url file that exploited a zero-day vulnerability (CVE-2025-33053) to execute malware from an actor-controlled WebDAV server,\" Check Point\nsaid\n. \"CVE-2025-33053 allows remote code execution through manipulation of the working directory.\"\nIn the attack chain observed against an unnamed defense company in Turkey, the threat actor is said to have employed CVE-2025-33053 to deliver Horus Agent, a custom implant built for the Mythic command-and-control (C2) framework. It's believed that the malicious payload used to initiate the attack, a URL shortcut file, was sent as an archived attachment in a phishing email.\nThe URL file is used to launch iediagcmd.exe, a legitimate diagnostics utility for Internet Explorer, leveraging it to launch another payload called Horus Loader, which is responsible for serving a decoy PDF document and executing Horus Agent.\n\"Written in C++, the implant shows no significant overlap with known C-based Mythic agents, aside from commonalities in the generic logic related to Mythic C2 communications,\" Check Point said. \"While the loader makes sure to implement some measures to protect the payload, the threat actors placed additional precautions within the backdoor itself.\"\nThis includes the use of techniques like string encryption and control flow flattening to complicate analysis efforts. The backdoor then connects to a remote server to fetch tasks that allow it to collect system information, enumerate files and folders, download files from the server, inject shellcode into running processes, and exit the program.\nCVE-2025-33053 infection chain\nHorus Agent is assessed to be an evolution of the customized Apollo implant, an open-source .NET agent for Mythic framework, that was previously put to use by Stealth Falcon between 2022 and 2023.\n\"Horus is a more advanced version of the threat groups' custom Apollo implant, rewritten in C++, improved, and refactored,\" Check Point said.\n\"Similar to the Horus version, the Apollo version introduces extensive victim fingerprinting capabilities while limiting the number of supported commands. This allows the threat actors to focus on stealthy identification of the infected machine and next stage payload delivery, while also keeping the implant size significantly smaller (only 120Kb) than the full agent.\"\nThe company said it also observed the threat actor leveraging several previously undocumented tools such as the following -\nCredential Dumper, which targets an already-compromised Domain Controller to steal Active Directory and Domain Controller credential-related files\nPassive backdoor, which listens for incoming requests and executes shellcode payloads\nKeylogger, a custom C++ tool that records all keystrokes and writes them to a file under \"C:/windows/temp/~TN%LogName%.tmp\"\nThe keylogger notably lacks any C2 mechanism, meaning that it likely works in conjunction with another component that can exfiltrate the file to the attackers.\n\"Stealth Falcon employs commercial code obfuscation and protection tools, as well as custom-modified versions tailored for different payload types,\" the Check Point said. \"This makes their tools more difficult to reverse-engineer and complicates tracking technical changes over time.\"\nThe active exploitation of CVE-2025-33053 has prompted the U.S. Cybersecurity and Infrastructure Security Agency (CISA) to\nadd\nit to the Known Exploited Vulnerabilities (\nKEV\n) catalog, requiring Federal Civilian Executive Branch (FCEB) agencies to apply the fix by July 1, 2025.\n\"What makes this flaw particularly concerning is the widespread use of WebDAV in enterprise environments for remote file sharing and collaboration,\" Mike Walters, President and Co-Founder of Action1,\nsaid\n. \"Many organizations enable WebDAV for legitimate business needs — often without fully understanding the security risks it introduces.\"\nThe most severe vulnerability resolved by Microsoft is a privilege escalation flaw in Power Automate (\nCVE-2025-47966\n, CVSS score: 9.8) that could permit an attacker to elevate privileges over a network. However, there is no customer action required to mitigate the bug.\nOther vulnerabilities of note include elevation of privilege flaws in Common Log File System Driver (\nCVE-2025-32713\n, CVSS score: 7.8), Windows Netlogon (\nCVE-2025-33070\n, CVSS score: 8.1), and Windows SMB Client (\nCVE-2025-33073\n, CVSS score: 8.8), as well as a critical unauthenticated RCE vulnerability in the Windows KDC Proxy Service (\nCVE-2025-33071\n, CVSS score: 8.1).\n\"Over the past several months, the CLFS driver has become a\nconsistent\nfocus\nfor both threat actors and security researchers due to its exploitation in multiple ransomware operations,\" Ben McCarthy, lead cyber security engineer at Immersive said.\n\"It is categorized as a heap-based buffer overflow — a type of memory corruption vulnerability. The attack complexity is considered low, and successful exploitation allows an attacker to escalate privileges.\"\nCVE-2025-33073 is the only vulnerability to be listed as publicly known at the time of release, with CrowdStrike, Synacktiv, SySS GmbH, RedTeam Pentesting, and Google Project Zero acknowledged for reporting the bug.\n\"Even though CVE-2025-33073 is referred to by Microsoft as an elevation of privilege, it is actually an authenticated remote command execution as SYSTEM on any machine which does not enforce SMB signing,\" Synacktiv researchers Wilfried Bécard and Guillaume André\nsaid\n.\nReflective Kerberos relay attack (CVE-2025-33073)\nThe path to exploitation requires a victim to connect to a malicious SMB server controlled by the attacker, ultimately leading to privilege escalation by means of a reflective Kerberos relay attack.\n\"The principle behind the attack is that we coerced a Windows host to connect to our attack system via SMB and authenticate via Kerberos,\" RedTeam Pentesting\nsaid\nin a technical analysis. \"The Kerberos ticket is then relayed back to the same host again via SMB. The resulting SMB session had high-privileged NT AUTHORITY\\SYSTEM privileges that are sufficient to execute arbitrary commands.\nAdam Barnett, lead software engineer at Rapid7, said the exploitation of CVE-2025-33071 requires the attacker to exploit a cryptographic flaw and win a race condition.\n\"The bad news is that Microsoft considers exploitation more likely regardless, and since a KDC proxy helps Kerberos requests from untrusted networks more easily access trusted assets without any need for a direct TCP connection from the client to the domain controller, the trade-off here is that the KDC proxy itself is quite likely to be exposed to an untrusted network,\" Barnett added.\nLast but not least, Microsoft has also rolled out patches to remediate a secure boot bypass bug (\nCVE-2025-3052\n, CVSS score: 6.7)\ndiscovered\nby\nBinarly\nthat enables the execution of untrusted software.\n\"A vulnerability exists in a UEFI application signed with a Microsoft third-party UEFI certificate, which allows an attacker to bypass UEFI Secure Boot,\" Redmond said in an alert. \"An attacker who successfully exploited this vulnerability could bypass Secure Boot.\"\nCERT Coordination Center (CERT/CC), in an advisory released Tuesday, said the vulnerability is rooted in Unified Extensible Firmware Interface (UEFI) applications DTBios and BiosFlashShell from DT Research, allowing Secure Boot bypass using a specially crafted NVRAM variable.\n\"The vulnerability stems from improper handling of a runtime NVRAM variable that enables an arbitrary write primitive, capable of modifying critical firmware structures, including the global Security2 Architectural Protocol used for Secure Boot verification,\" CERT/CC\nsaid\n.\n\"Because the affected applications are signed by the Microsoft UEFI Certificate Authority, this vulnerability can be exploited on any UEFI-compliant system, allowing unsigned code to run during the boot process.\"\nSuccessful exploitation of the vulnerability could permit the execution of unsigned or malicious code even before the operating system loads, potentially enabling attackers to drop persistent malware that can survive reboots and even disable security software.\nMicrosoft, however, is not affected by CVE-2025-4275 (aka\nHydroph0bia\n), another Secure Boot bypass vulnerability present in an InsydeH2O UEFI application that allows digital certificate injection through an unprotected NVRAM variable (\"SecureFlashCertData\"), resulting in arbitrary code execution at the firmware level.\n\"This issue arises from the unsafe use of an NVRAM variable, which is used as trusted storage for a digital certificate in the trust validation chain,\" CERT/CC\nsaid\n. \"An attacker can store their own certificate in this variable and subsequently run arbitrary firmware (signed by the injected certificate) during the early boot process within the UEFI environment.\"\nSoftware Patches from Other Vendors\nIn addition to Microsoft, security updates have also been released by other vendors over the past few weeks to rectify several vulnerabilities, including —\nAdobe\nAmazon Web Services\nAMD\nArm\nAtlassian\nAutomationDirect\nBosch\nBroadcom\n(including VMware)\nCanon\nCisco\nD-Link\nDell\nDrupal\nF5\nFortinet\nGitLab\nGoogle\nAndroid\nand\nPixel\nGoogle Chrome\nGoogle Cloud\nHitachi Energy\nHP\nHP Enterprise\n(including Aruba Networking)\nIBM\nIntel\nInsyde\nIvanti\nJenkins\nJuniper Networks\nLenovo\nLinux distributions\nAmazon Linux\n,\nDebian\n,\nOracle Linux\n,\nRed Hat\n,\nRocky Linux\n,\nSUSE\n, and\nUbuntu\nMediaTek\nMitel\nMitsubishi Electric\nMoxa\nMozilla\nFirefox and Thunderbird\nNVIDIA\nPalo Alto Networks\nPhoenix Technologies\nQNAP\nQualcomm\nRoundcube\nSalesforce\nSamsung\nSAP\nSchneider Electric\nSiemens\nSolarWinds\nSonicWall\nSplunk\nSpring Framework\nSynology\nTrend Micro\nApex Central\n,\nApex One\n,\nEndpoint Encryption PolicyServer\n, and\nWFBS\nVeritas\nZimbra\n, and\nZoho ManageEngine\nExchange Reporter Plus\nand\nOpManager\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "SmartAttack uses smartwatches to steal data from air-gapped systems",
        "Link": "https://www.bleepingcomputer.com/news/security/smartattack-uses-smartwatches-to-steal-data-from-air-gapped-systems/",
        "Summary": "A new attack dubbed 'SmartAttack' uses smartwatches as a covert ultrasonic signal receiver to exfiltrate data from physically isolated (air-gapped) systems. [...]",
        "Date": "2025-06-11",
        "Content": "A new attack dubbed 'SmartAttack' uses smartwatches as a covert ultrasonic signal receiver to exfiltrate data from physically isolated (air-gapped) systems.\nAir-gapped systems, commonly deployed in mission-critical environments such as government facilities, weapons platforms, and nuclear power plants, are physically isolated from external networks to prevent malware infections and data theft.\nDespite this isolation, they remain vulnerable to compromise through insider threats such as rogue employees using USB drives or state-sponsored supply chain attacks.\nOnce infiltrated, malware can operate covertly, using stealthy techniques to modulate the physical characteristics of hardware components to transmit sensitive data to a nearby receiver without interfering with the system's regular operations.\nSmartAttack was devised by Israeli university researchers led by\nMordechai Guri\n, a specialist in the field of covert attack channels who previously presented methods to leak data using\nLCD screen noise\n,\nRAM modulation\n,\nnetwork card LEDs\n,\nUSB drive RF signals\n,\nSATA cables\n, and\npower supplies\n.\nWhile attacks on air-gapped environments are, in many cases, theoretical and extremely difficult to achieve, they still present interesting and novel approaches to exfiltrate data.\nHow SmartAttack works\nSmartAttack requires malware to somehow infect an air-gapped computer to gather sensitive information such as keystrokes, encryption keys, and credentials. It can then use the computer's built-in speaker to emit ultrasonic signals to the environment.\nBy using a binary frequency shift keying (B-FSK), the audio signal frequencies can be modulated to represent binary data, aka ones and zeroes. A frequency of 18.5 kHz represents \"0,\" while 19.5 kHz denotes \"1.\"\nThe covert channel and interference from keyboard typing\nSource: arxiv.org\nFrequencies at this range are inaudible to humans, but they can still be caught by a smartwatch microphone worn by a person nearby.\nThe sound monitoring app in the smartwatch applies signal processing techniques to detect frequency shifts and demodulate the encoded signal, while integrity tests can also be applied.\nThe final exfiltration of the data can take place via Wi-Fi, Bluetooth, or cellular connectivity.\nThe smartwatch can either be purposefully equipped with this tool by a rogue employee, or outsiders may infect it without the wearer's knowledge.\nPerformance and limitations\nThe researchers note that smartwatches use small, lower-SNR microphones compared to smartphones, so signal demodulation is quite challenging, especially at higher frequencies and lower signal intensities.\nEven wrist orientation was found to play a crucial role in the feasibility of the attack, working best when the watch has \"line-of-sight\" with the computer speaker.\nDepending on the transmitter (speaker type), the maximum transmission range is between 6 and 9 meters (20 – 30 feet).\nTransmitter type performance\nSource: arxiv.org\nThe data transmission rate ranges from 5 bits per second (bps) to 50 bps, reducing reliability as the rate and distance increase.\nPerformance measurements (Signal to Noise Ratio, Bit Error Rate)\nSource: arxiv.org\nThe researchers say the best way to counter the SmartAttack is to prohibit using smartwatches in secure environments.\nAnother measure would be to remove in-built speakers from air-gapped machines. This would eliminate the attack surface for all acoustic covert channels, not just SmartAttack.\nIf none of this is feasible, ultrasonic jamming through the emission of broadband noise, software-based firewalls, and audio-gapping could still prove effective.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide"
    },
    {
        "Title": "Erie Insurance confirms cyberattack behind business disruptions",
        "Link": "https://www.bleepingcomputer.com/news/security/erie-insurance-confirms-cyberattack-behind-business-disruptions/",
        "Summary": "Erie Insurance and Erie Indemnity Company have disclosed that a weekend cyberattack is behind the recent business disruptions and platform outages on its website. [...]",
        "Date": "2025-06-11",
        "Content": "Erie Insurance and Erie Indemnity Company have disclosed that a weekend cyberattack is behind the recent business disruptions and platform outages on its website.\nErie Indemnity Company is the management company for the Erie Insurance Group, a property and casualty insurer with over 6 million active policies. The company provides auto, home, life, and business insurance policies through independent agents.\nSince Saturday, June 7, Erie Insurance has been suffering from widespread outages and business disruptions, with customers unable to log into the customer portal and reporting difficulties making claims or receiving paperwork from the company.\nError shown when attempting to log into Erie Insurance site\nToday, Erie Indemnity Group filed a\nForm 8-K filing\nwith the U.S. Securities and Exchange Commission, stating it detected \"unusual network activity\" on June 7, 2025.\nIn a similar notice on the Erie Insurance website, the company says it activated its incident response protocol in response to the attack.\n\"On Saturday, June 7, Erie Insurance's Information Security team identified unusual network activity. We took immediate action to respond to the situation to safeguard our systems and data,\" reads a\nnotice on Erie Insurance's site\n.\n\"Since Saturday, we have continued to take protective action for the security of our systems.\"\n\"We are working with law enforcement and are conducting a comprehensive forensic analysis with the assistance of leading cybersecurity experts to gain a full understanding of this event.\"\nWhen companies suffer a cyberattack, the usual response is to shut down systems to prevent the attack's spread to other devices.\nUnfortunately, this response also disrupts applications and websites used to conduct business, impacting customers and business partners. It can take days, if not weeks, to fully restore service after a large-scale cyberattack.\nErie Insurance also warns that they will not call or email customers to request payments during this outage.\n\"During this outage, Erie Insurance will not call or email customers to request payments,\" reads an alert at the top of the page.\n\"As is best practice, do not click on any links from unknown sources or provide your personal information by phone or email.\"\nErie says the incident's full scope, nature, and impact are still being determined.\nThe company told BleepingComputer that policyholders who need to initiate a claim can contact their local agent or ERIE's First Notice of Loss team at (800) 367-3743. Erie Insurance also said customer care is available at (800) 458-0811.\nNo information has been shared regarding whether this is a ransomware attack or if data was stolen during the breach.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nArla Foods confirms cyberattack disrupts production, causes delays\nSteel giant Nucor Corporation facing disruptions after cyberattack\nMedical device maker Masimo warns of cyberattack, manufacturing delays\nTexas Dept. of Transportation breached, 300k crash records stolen\nGrocery wholesale giant United Natural Foods hit by cyberattack"
    },
    {
        "Title": "Zero-click AI data leak flaw uncovered in Microsoft 365 Copilot",
        "Link": "https://www.bleepingcomputer.com/news/security/zero-click-ai-data-leak-flaw-uncovered-in-microsoft-365-copilot/",
        "Summary": "A new attack dubbed 'EchoLeak' is the first known zero-click AI vulnerability that enables attackers to exfiltrate sensitive data from Microsoft 365 Copilot from a user's context without interaction. [...]",
        "Date": "2025-06-11",
        "Content": "A new attack dubbed 'EchoLeak' is the first known zero-click AI vulnerability that enables attackers to exfiltrate sensitive data from Microsoft 365 Copilot from a user's context without interaction.\nThe attack was\ndevised by Aim Labs researchers\nin January 2025, who reported their findings to Microsoft. The tech giant assigned the\nCVE-2025-32711\nidentifier to the information disclosure flaw, rating it critical, and fixed it server-side in May, so no user action is required.\nAlso, Microsoft noted that there's no evidence of any real-world exploitation, so this flaw impacted no customers.\nMicrosoft 365 Copilot is an AI assistant built into Office apps like Word, Excel, Outlook, and Teams that uses OpenAI's GPT models and Microsoft Graph to help users generate content, analyze data, and answer questions based on their organization's internal files, emails, and chats.\nThough fixed and never maliciously exploited, EchoLeak holds significance for demonstrating a new class of vulnerabilities called 'LLM Scope Violation,' which causes a large language model (LLM) to leak privileged internal data without user intent or interaction.\nAs the attack requires no interaction with the victim, it can be automated to perform silent data exfiltration in enterprise environments, highlighting how dangerous these flaws can be when deployed against AI-integrated systems.\nHow EchoLeak works\nThe attack begins with a malicious email sent to the target, containing text unrelated to Copilot and formatted to look like a typical business document.\nThe email embeds a hidden prompt injection crafted to instruct the LLM to extract and exfiltrate sensitive internal data.\nBecause the prompt is phrased like a normal message to a human, it bypasses Microsoft's XPIA (cross-prompt injection attack) classifier protections.\nLater, when the user asks Copilot a related business question, the email is retrieved into the LLM's prompt context by the Retrieval-Augmented Generation (RAG) engine due to its formatting and apparent relevance.\nThe malicious injection, now reaching the LLM, \"tricks\" it into pulling sensitive internal data and inserting it into a crafted link or image.\nAim Labs found that some markdown image formats cause the browser to request the image, which sends the URL automatically, including the embedded data, to the attacker's server.\nOverview of the attack chain\nSource: Aim Labs\nMicrosoft CSP blocks most external domains, but Microsoft Teams and SharePoint URLs are trusted, so these can be abused to exfiltrate data without problem.\nThe EchoLeak attack in action\nSource: Aim Labs\nEchoLeak may have been fixed, but the increasing complexity and deeper integration of LLM applications into business workflows are already overwhelming traditional defenses.\nThe same trend is bound to create new weaponizable flaws adversaries can stealthily exploit for high-impact attacks.\nIt is important for enterprises to strengthen their prompt injection filters, implement granular input scoping, and apply post-processing filters on LLM output to block responses that contain external links or structured data.\nMoreover, RAG engines can be configured to exclude external communications to avoid retrieving malicious prompts in the first place.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nChatGPT prepares o3-pro model for $200 Pro subscribers\nOpenAI is hopeful GPT-5 will compete a little more\nChatGPT rolls out Memory upgrade for free users\nCybercriminals exploit AI hype to spread ransomware, malware\nResearchers claim ChatGPT o3 bypassed shutdown in controlled test"
    },
    {
        "Title": "Hackers exploited Windows WebDav zero-day to drop malware",
        "Link": "https://www.bleepingcomputer.com/news/security/stealth-falcon-hackers-exploited-windows-webdav-zero-day-to-drop-malware/",
        "Summary": "An APT hacking group known as 'Stealth Falcon' exploited a Windows WebDav RCE vulnerability in zero-day attacks since March 2025 against defense and government organizations in Turkey, Qatar, Egypt, and Yemen. [...]",
        "Date": "2025-06-11",
        "Content": "An APT hacking group known as 'Stealth Falcon' exploited a Windows WebDav RCE vulnerability in zero-day attacks since March 2025 against defense and government organizations in Turkey, Qatar, Egypt, and Yemen.\nStealth Falcon (aka 'FruityArmor') is an advanced persistent threat (APT) group known for conducting cyberespionage attacks against Middle East organizations.\nThe flaw, tracked under CVE-2025-33053, is a remote code execution (RCE) vulnerability that arises from the improper handling of the working directory by certain legitimate system executables.\nSpecifically, when a .url file sets its WorkingDirectory to a remote WebDAV path, a built-in Windows tool can be tricked into executing a malicious executable from that remote location instead of the legitimate one.\nThis allows attackers to force devices to execute arbitrary code remotely from WebDAV servers under their control without dropping malicious files locally, making their operations stealthy and evasive.\nThe vulnerability was discovered by Check Point Research, with Microsoft fixing the flaw in the\nlatest Patch Tuesday update\n, released yesterday.\nAccording to Check Point, the attempted attacks attacks may not have been successful, though the vulnerability is valid and confirmed to be exploited nonetheless.\n\"In March 2025, Check Point Research identified an attempted cyberattack against a defense company in Turkey,\"\nmentions the Check Point report\n.\n\"The threat actors used a previously undisclosed technique to execute files hosted on a WebDAV server they controlled, by manipulating the working directory of a legitimate built-in Windows tool.\"\nThe attempted attacks used a deceptive URL file disguised as a PDF, sent to targets via phishing email.\nCheck Point retrieved the file and subsequent payloads hosted on the attacker's server to analyze the attempted attack.\nThe exploit begins with a .url file, shown below, whose URL parameter points to\niediagcmd.exe\n, a legitimate Internet Explorer diagnostics tool. When executed, this tool launches various network diagnostic commands, such as route, ipconfig, and netsh, to help troubleshoot networking issues.\nHowever, the flaw is exploitable due to how Windows locates and runs these command-line diagnostic tools.\nURL file used to exploit CVE-2025-33053\nSource: Check Point\nWhen iediagcmd.exe is executed, the Windows diagnostic programs are launched using the .NET Process.Start() function. This function first looks in the application's current working directory for the program before searching the Windows system folders, like System32.\nIn this attack, the malicious .url exploit sets the working directory to the attacker's WebDAV server, causing the iediagcmd.exe tool to run the commands directly from the remote WebDav share.\nThis causes iediagcmd.exe to run the attacker's fake route.exe program from the remote server, which installs a custom multi-stage loader called 'Horus Loader.'\nThe loader then drops the primary payload, 'Horus Agent,' a custom C++ Mythic C2 implant that supports command execution for system fingerprinting, config changes, shellcode injection, and file operations.\nCommands supported by Horus Agent\nSource: Check Point\nCheck Point also found several post-exploitation tools, including a credential file dumper, a keylogger, and a passive backdoor consisting of a tiny C service listening for encrypted shellcode payloads over the network.\nStealth Falcon's infection chain\nSource: Check Point\nCheck Point underlines the evolution of Stealth Falcon, a threat actor active since at least 2012,\nfocused on espionage\n.\nPreviously, the threat actors used customized Apollo agents, whereas their latest Horus tools are more advanced, evasive, and modular, providing operational stealth and flexibility.\nGiven the active exploitation of CVE-2025-33053 in espionage operations, critical organizations are recommended to apply the latest Windows updates as soon as possible.\nIf upgrading is impossible, it is recommended to block or closely monitor WebDAV traffic for suspicious outbound connections to unknown endpoints.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nFortinet fixes critical zero-day exploited in FortiVoice attacks\nSAP fixes suspected NetWeaver zero-day exploited in attacks\nGoogle patches new Chrome zero-day bug exploited in attacks\nHackers are exploiting critical flaw in vBulletin forum software\nSAP patches second zero-day flaw exploited in recent attacks"
    },
    {
        "Title": "Microsoft creates separate Windows 11 24H2 update for incompatible PCs",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-creates-separate-windows-11-24h2-update-for-incompatible-pcs/",
        "Summary": "Microsoft confirmed on Tuesday that it's pushing a revised security update targeting some Windows 11 24H2 systems incompatible with the initial update released during this month's Patch Tuesday. [...]",
        "Date": "2025-06-11",
        "Content": "Microsoft confirmed on Tuesday that it's pushing a revised security update targeting some Windows 11 24H2 systems incompatible with the initial update released during this month's Patch Tuesday.\n\"This update is being gradually rolled out to devices running Windows 11, version 24H2. We've identified a compatibility issue affecting a limited set of these devices,\" the company\nsaid\nin a Twitter thread.\n\"If your device is affected, you'll receive a revised update with all the June 2025 security improvements in the near term.\"\nIn a message center update on Tuesday, Redmond\nadded\nthat \"the June 2025 security update is fully available for all other supported versions of Windows.\"\nMicrosoft has yet to disclose the hardware or software configurations affected by the compatibility issue that prompted the release of a revised security update and how the affected PCs were impacted after installing this month's Patch Tuesday cumulative updates.\nAlso, the company didn't share if this was the first time it released a revised Patch Tuesday update to address compatibility issues and if this is something customers can expect from Microsoft in the future.\nA Microsoft spokesperson was not immediately available for comment when contacted by BleepingComputer earlier today.\n​On Tuesday, Microsoft\nreleased\nsecurity updates (\nKB5060842 and KB5060999\n) for 66 vulnerabilities in Windows 11 24H2 and 23H2, including one actively exploited Web Distributed Authoring and Versioning (WebDAV) zero-day (\nCVE-2025-33053\n) and a publicly disclosed Windows SMB privilege escalation flaw.\nThis month's Patch Tuesday Windows updates addressed ten critical vulnerabilities, eight allowing attackers to gain remote code execution on unpatched devices and two enabling them to escalate privileges.\nKB5060842 also resolves a Windows Hello issue preventing users from signing in with self-signed certificates and extends system restore points availability up to 60 days on Windows 11 24H2 devices, while KB5060999 fixes a graphics support issue blocking Remote Desktop connections with \"session has ended\" and \"remote desktop connection cannot be established\" errors.\nThe same day, Microsoft released the\nKB5060533\nWindows 10 22H2 cumulative update, which brings seconds back to the time shown in the Calendar flyout and fixes an issue causing Hyper-V virtual machines with Windows 10, Windows 11, and Windows Server\nto freeze or restart unexpectedly\n.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMicrosoft: Windows 11 might fail to start after installing KB5058405\nWindows 11 upgrade block lifted after Safe Exam Browser fix\nMicrosoft: Windows 11 24H2 now ready to rollout to everyone\nMicrosoft pushes fix for Windows 11 24H2 update failures\nMicrosoft: Windows 11 24H2 updates fail with 0x80240069 errors"
    },
    {
        "Title": "Brute-force attacks target Apache Tomcat management panels",
        "Link": "https://www.bleepingcomputer.com/news/security/brute-force-attacks-target-apache-tomcat-management-panels/",
        "Summary": "A coordinated campaign of brute-force attacks using hundreds of unique IP addresses targets Apache Tomcat Manager interfaces exposed online. [...]",
        "Date": "2025-06-11",
        "Content": "A coordinated campaign of brute-force attacks using hundreds of unique IP addresses targets Apache Tomcat Manager interfaces exposed online.\nTomcat is a popular open-source web server widely used by large enterprises and SaaS providers, while Tomcat Manager is a web-based administration tool that comes bundled with the Tomcat server and helps admins manage deployed web apps via a graphical interface.\nTomcat Manager is configured by default to only allow access from localhost (127.0.0.1), with no pre-configured credentials and remote access blocked. However, when exposed online, the web app can be targeted by attackers, as cybersecurity company GreyNoise observed recently.\nStarting June 5th, GreyNoise analysts discovered two coordinated campaigns targeting Apache Tomcat Manager interfaces and trying to gain access to Tomcat services over the Internet.\nThe first\nused nearly 300 unique IP addresses\n, most tagged as malicious, which were attempting to log into exposed online, and the second\nemployed 250 malicious IPs\nto target Tomcat Manager web apps in brute force attacks, where threat actors use automated tools to test thousands or even millions of possible credentials.\n\"Roughly 400 unique IPs were involved in the activity observed across both tags during this period of elevated activity. Most of the activity originating from these IPs exhibited a narrow focus on Tomcat services. A significant portion of this activity originated from infrastructure hosted by DigitalOcean (ASN 14061),\"\nGreyNoise said\n.\n\"While not tied to a specific vulnerability, this behavior highlights ongoing interest in exposed Tomcat services. Broad, opportunistic activity like this often serves as an early warning of future exploitation.\"\nTomcat brute force attacks (GreyNoise)\n​The cybersecurity company advised organizations with Tomcat Manager interfaces exposed online to ensure they have strong authentication and access restrictions.\nUsers should check security logs for any suspicious login activity and promptly block any IP addresses that could be behind a breach attempt.\nWhile no specific security vulnerability was exploited in these attacks, Apache released security fixes in March to\npatch a remote code execution (RCE) vulnerability\nin Apache Tomcat (CVE-2025-24813) actively exploited in the wild to take over vulnerable servers with a simple PUT request.\nThe threat actors behind the attacks reportedly used proof-of-concept (PoC) exploits released on GitHub just 30 hours after the flaw was disclosed and patched.\nIn December, Apache also\nfixed another Tomcat RCE flaw\n(CVE-2024-56337) that could be used to bypass the patch for a second critical RCE vulnerability (CVE-2024-50379) mitigated days earlier.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nGoogle patched bug leaking phone numbers tied to accounts\nNew PumaBot botnet brute forces SSH credentials to breach devices\nBotnet hacks 9,000+ ASUS routers to add persistent SSH backdoor\nApache Parquet exploit tool detect servers vulnerable to critical flaw\nUK NCSC: Cyberattacks impacting UK retailers are a wake-up call"
    },
    {
        "Title": "Operation Secure disrupts global infostealer malware operations",
        "Link": "https://www.bleepingcomputer.com/news/security/operation-secure-disrupts-global-infostealer-malware-operations/",
        "Summary": "An international law enforcement action codenamed \"Operation Secure\" targeted infostealer malware infrastructure in a massive crackdown across 26 countries, resulting in 32 arrests, data seizures, and server takedowns. [...]",
        "Date": "2025-06-11",
        "Content": "An international law enforcement action codenamed \"Operation Secure\" targeted infostealer malware infrastructure in a massive crackdown across 26 countries, resulting in 32 arrests, data seizures, and server takedowns.\nLed by Interpol and conducted from January to April 2025, the operation focused on disrupting infostealer malware groups that steal financial and personal data through widespread infections.\nThe data stolen by infostealers commonly includes account credentials, browser cookies, and cryptocurrency wallet details. This data is then compiled into \"logs\" and sold on cybercrime markets or used in targeted attacks against high-value victims.\nThe\nresults of Operation Secure\nare significant, resulting in:\nOver 20,000 malicious IPs/domains linked to infostealers were taken down\n41 servers supporting info-stealers operations were seized\n32 suspects were arrested\n100 GB of data was confiscated\n216,000 victims were notified\nThe authorities also identified a large cluster of 117 servers in Hong Kong that were used as command-and-control (C2) infrastructure for phishing, online fraud, and social media scam operations.\nA highlight of the action comes from the Vietnamese police, who arrested 18 suspects, including a leader of a cybercrime group dedicated to the selling of corporate accounts.\nAuthorities seize servers facilitating cybercrime operations\nSource: Interpol\nOperation Secure was also assisted by private cybersecurity partners, including Kaspersky, Group-IB, and Trend Micro.\nIn a report shared with BleepingComputer,\nGroup-IB specifies\nthat the action has impacted infrastructure tied to\nLumma\n,\nRisePro\n, and the\nMETA Stealer\n.\nThe researchers provided mission-critical intelligence to the authorities on the activity of the identified operators and infrastructure.\nGroup-IB also tracked the operators' Telegram and dark web accounts that were used to advertise the malware and sell stolen data.\nThis is the second significant\ndisruption for Lumma Stealer\n, following another international effort led by the U.S. DoJ, the FBI, and Microsoft in May 2025.\nDuring that action, the authorities seized 2,300 domains associated with the malware-as-a-service information stealer operation, whose access was sold to other cybercriminals for a subscription between $250 and $1,000.\nMETA also suffered a disruption previously, in October 2024, when 'Operation Magnus'\nseized infrastructure and data\nassociated with the cybercrime platform.\nInfostealers have become a major cybersecurity threat in recent years, fueling many high-profile breaches we regularly report on.\nStolen data from these malware infections has been linked to incidents at\nUnitedHealth\n,\nPowerSchool\n,\nHotTopic\n,\nCircleCI\n, and\nSnowflake\n.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nPolice arrests 20 suspects for distributing child sexual abuse content\n‘Russian Market’ emerges as a go-to shop for stolen credentials\nPolice takes down AVCheck site used by cybercriminals to scan malware\nTikTok videos now push infostealer malware in ClickFix attacks\nLumma infostealer malware operation disrupted, 2,300 domains seized"
    },
    {
        "Title": "Microsoft fixes unreachable Windows Server domain controllers",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-unreachable-windows-server-domain-controllers/",
        "Summary": "Microsoft has resolved a known issue that caused some Windows Server 2025 domain controllers to become unreachable after a restart and triggered app or service failures. [...]",
        "Date": "2025-06-11",
        "Content": "Microsoft has resolved a known issue that caused some Windows Server 2025 domain controllers to become unreachable after a restart and triggered app or service failures.\nAs Redmond explained\nwhen it acknowledged\nthe bug in April, servers loading the standard firewall profile instead of the domain firewall one after rebooting will have issues managing network traffic correctly.\nBecause of this issue, services and applications running on impacted domain controller servers or remote devices may fail or become unreachable for endpoints and servers on the same network.\n\"Windows Server 2025 domain controllers (such as servers hosting the Active Directory domain controller role) might not manage network traffic correctly following a restart,\" Microsoft said.\n\"As a result, Windows Server 2025 domain controllers may not be accessible on the domain network, or are incorrectly accessible over ports and protocols which should otherwise be prevented by the domain firewall profile.\"\nThis week, the company addressed this known issue in the\nKB5060842\nWindows security update released during the\nJune 2025 Patch Tuesday\n.\nAdmins who can't immediately install this month's updates to mitigate the bug can also apply a temporary workaround requiring them to restart the network adapter manually on impacted servers using the\nRestart-NetAdapter *\nPowerShell command.\nHowever, it's important to note that they'll have to restart it after every reboot until they install the KB5060842 update because this known issue will trigger automatically whenever affected domain controllers are restarted.\nOn Tuesday, Microsoft also\nfixed another known issue\npreventing some Windows users\nfrom logging into their\naccounts\nusing Windows Hello after installing the KB5055523 April 2025 security update.\nIn April, the company\nresolved another KB5055523\nissue\nthat\nwas causing authentication issues when Credential Guard was enabled on systems using the Kerberos PKINIT pre-auth security protocol.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMicrosoft: Windows Server 2025 restarts break connectivity on some DCs\nMicrosoft fixes Windows Server auth issues caused by April updates\nMicrosoft: April updates cause Windows Server auth issues\nMicrosoft: Windows Server hotpatching to require subscription\nMicrosoft fixes Windows Server 2025 blue screen, install issues"
    },
    {
        "Title": "Microsoft fixes Windows Server auth issues caused by April updates",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-windows-server-auth-issues-caused-by-april-updates/",
        "Summary": "Microsoft has fixed a known issue causing authentication problems on Windows Server domain controllers after installing the April 2025 security updates. [...]",
        "Date": "2025-06-11",
        "Content": "Microsoft has fixed a known issue causing authentication problems on Windows Server domain controllers after installing the April 2025 security updates.\nPlatforms affected by these problems include Windows Server 2016, Windows Server 2019, Windows Server 2022, and the latest version, Windows Server 2025.\nHowever, as Microsoft further explained when it acknowledged this known issue\nin early May\n, home users are unlikely to be impacted since domain controllers are typically used in enterprise authentication scenarios.\n\"After installing the April Windows monthly security update released April 8, 2025 (KB5055523) or later, Active Directory Domain Controllers (DC) might experience issues when processing Kerberos logons or delegations using certificate-based credentials that rely on key trust via the Active Directory msds-KeyCredentialLink field,\" Microsoft said.\n\"This can result in authentication issues in Windows Hello for Business (WHfB) Key Trust environments or environments that have deployed Device Public Key Authentication (also known as Machine PKINIT).\"\nThese issues could also affect software using these two features for authentication, including but not limited to identity management systems, third-party single sign-on (SSO) solutions, and smart card authentication products.\nThis week, the company\nreleased\nthe following cumulative updates that resolve the auth issues on all impacted Windows releases:\nKB5060842\n(Windows Server 2025)\nKB5060526\n(Windows Server 2022)\nKB5060531\n(Windows Server 2019)\nKB5061010\n(Windows Server 2016)\n\"We recommend you install the latest security update for your device as it contains important improvements and issue resolutions, including this one,\" Redmond\nexplains\nin a Tuesday Windows release health update.\n\"If you are using an update released before this date and have this issue, you should temporarily delay setting a value of '2' to registry key AllowNtAuthPolicyBypass on updated DCs servicing self-signed certificate-based authentication,\" it added, referring admins to the Registry Settings section of the\nKB5057784\nsupport document.\nAs Microsoft explained last month, these authentication issues are\nlinked to security measures\nthat mitigate a high-severity vulnerability (\nCVE-2025-26647\n) that can let authenticated attackers escalate privileges remotely by exploiting an improper input validation weakness in Windows Kerberos (which\nreplaced NTLM\nas the new default authentication protocol for domain-connected devices on Windows versions released since Windows 2000.\nIn April, Microsoft\nfixed another known issue\ncausing auth problems on Windows 11 and Windows Server 2025 systems using the Kerberos PKINIT security protocol when Credential Guard is enabled.\nThe company also had to release emergency out-of-band (OOB) updates in November 2022 to\nresolve a bug causing Kerberos sign-in failures\nand other auth issues affecting Windows domain controllers.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMicrosoft: April updates cause Windows Server auth issues\nMicrosoft fixes auth issues on Windows Server, Windows 11 24H2\nMicrosoft fixes unreachable Windows Server domain controllers\nNew Windows Server emergency updates fix container launch issue\nMicrosoft: New Windows updates fix Active Directory policy issues"
    },
    {
        "Title": "Infostealer Ring Bust-up Takes Down 20,000 Malicious IPs",
        "Link": "https://www.darkreading.com/threat-intelligence/infostealer-ring-bust-20000-malicious-ips",
        "Summary": "Interpol's Operation Secure arrested more than 30 suspects across Vietnam, Sri Lanka, and Nauru, and seized 117 command-and-control servers allegedly used to run widespread phishing, business email compromise, and other cyber scams.",
        "Date": "2025-06-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/infostealer-ring-bust-20000-malicious-ips"
    },
    {
        "Title": "ConnectWise to Rotate Code-Signing Certificates",
        "Link": "https://www.darkreading.com/remote-workforce/connectwise-rotate-code-signing-certificates",
        "Summary": "The move is unrelated to a recent nation-state attack the vendor endured but stems from a report by a third-party researcher.",
        "Date": "2025-06-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/connectwise-rotate-code-signing-certificates"
    },
    {
        "Title": "Agentic AI Takes Over Gartner's SRM Summit",
        "Link": "https://www.darkreading.com/cloud-security/agentic-ai-gartner-srm-summit",
        "Summary": "Agentic AI was everywhere at Gartner's Security &amp; Risk Management Summit in Washington, DC, this year, as the AI security product engine chugs ahead at full speed.",
        "Date": "2025-06-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/agentic-ai-gartner-srm-summit"
    },
    {
        "Title": "Google Bug Allowed Brute-Forcing of Any User Phone Number",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/google-bug-brute-forcing-phone-number",
        "Summary": "The weakness in Google's password-recovery page, discovered by a researcher called Brutecat, exposed private user contact information to attackers, opening the door to phishing, SIM-swapping, and other attacks.",
        "Date": "2025-06-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/google-bug-brute-forcing-phone-number"
    },
    {
        "Title": "Security Pitfalls &amp; Solutions of Multiregion Cloud Architectures",
        "Link": "https://www.darkreading.com/cloud-security/security-pitfalls-solutions-multiregion-cloud-architectures",
        "Summary": "Cloud resilience is no longer just about surviving service interruptions; it's about operating securely under any circumstances, across any geographic area.",
        "Date": "2025-06-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/security-pitfalls-solutions-multiregion-cloud-architectures"
    },
    {
        "Title": "Mirai Botnets Exploit Flaw in Wazuh Security Platform",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/mirai-botnets-exploit-wazuh-security-platform",
        "Summary": "The two campaigns are good examples of the ever-shrinking time-to-exploit timelines that botnet operators have adopted for newly published CVEs.",
        "Date": "2025-06-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/mirai-botnets-exploit-wazuh-security-platform"
    },
    {
        "Title": "India's Security Leaders Struggle to Keep Up With Threats",
        "Link": "https://www.darkreading.com/cybersecurity-operations/india-security-leaders-struggle-threats",
        "Summary": "Business and security executives in the South Asian nation worry over AI, cybersecurity, new digital privacy regulations, and a talent gap that hobbles innovation.",
        "Date": "2025-06-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/india-security-leaders-struggle-threats"
    },
    {
        "Title": "Patch Tuesday, June 2025 Edition",
        "Link": "https://krebsonsecurity.com/2025/06/patch-tuesday-june-2025-edition/",
        "Summary": "Microsoft today released security updates to fix at least 67 vulnerabilities in its Windows operating systems and software. Redmond warns that one of the flaws is already under active attack, and that software blueprints showing how to exploit a pervasive Windows bug patched this month are now public.",
        "Date": "2025-06-11",
        "Content": "Microsoft today released security updates to fix at least 67 vulnerabilities in its Windows operating systems and software. Redmond warns that one of the flaws is already under active attack, and that software blueprints showing how to exploit a pervasive Windows bug patched this month are now public.\n\nThe sole zero-day flaw this month is CVE-2025-33053, a remote code execution flaw in the Windows implementation of WebDAV — an HTTP extension that lets users remotely manage files and directories on a server. While WebDAV isn’t enabled by default in Windows, its presence in legacy or specialized systems still makes it a relevant target, said Seth Hoyt, senior security engineer at Automox.\nAdam Barnett, lead software engineer at Rapid7, said Microsoft’s advisory for CVE-2025-33053 does not mention that the Windows implementation of WebDAV is listed as deprecated since November 2023, which in practical terms means that the WebClient service no longer starts by default.\n“The advisory also has attack complexity as low, which means that exploitation does not require preparation of the target environment in any way that is beyond the attacker’s control,” Barnett said. “Exploitation relies on the user clicking a malicious link. It’s not clear how an asset would be immediately vulnerable if the service isn’t running, but all versions of Windows receive a patch, including those released since the deprecation of WebClient, like Server 2025 and Windows 11 24H2.”\nMicrosoft warns that an “elevation of privilege” vulnerability in the Windows Server Message Block (SMB) client (CVE-2025-33073) is likely to be exploited, given that proof-of-concept code for this bug is now public. CVE-2025-33073 has a CVSS risk score of 8.8 (out of 10), and exploitation of the flaw leads to the attacker gaining “SYSTEM” level control over a vulnerable PC.\n“What makes this especially dangerous is that no further user interaction is required after the initial connection—something attackers can often trigger without the user realizing it,” said Alex Vovk, co-founder and CEO of Action1. “Given the high privilege level and ease of exploitation, this flaw poses a significant risk to Windows environments. The scope of affected systems is extensive, as SMB is a core Windows protocol used for file and printer sharing and inter-process communication.”\nBeyond these highlights, 10 of the vulnerabilities fixed this month were rated “critical” by Microsoft, including eight remote code execution flaws.\nNotably absent from this month’s patch batch is a fix for a newly discovered weakness in Windows Server 2025 that allows attackers to act with the privileges of any user in Active Directory. The bug, dubbed “BadSuccessor,” was publicly disclosed by researchers at Akamai on May 21, and several public proof-of-concepts are now available. Tenable’s Satnam Narang said organizations that have at least one Windows Server 2025 domain controller should review permissions for principals and limit those permissions as much as possible.\nAdobe has released updates for Acrobat Reader and six other products addressing at least 259 vulnerabilities, most of them in an update for Experience Manager. Mozilla Firefox and Google Chrome both recently released security updates that require a restart of the browser to take effect. The latest Chrome update fixes two zero-day exploits in the browser (CVE-2025-5419 and CVE-2025-4664).\nFor a detailed breakdown on the individual security updates released by Microsoft today, check out the Patch Tuesday roundup from the SANS Internet Storm Center. Action 1 has a breakdown of patches from Microsoft and a raft of other software vendors releasing fixes this month. As always, please back up your system and/or data before patching, and feel free to drop a note in the comments if you run into any problems applying these updates.\n\r\n         This entry was posted on Tuesday 10th of June 2025 08:10 PM \r\n         \nThanks Brian.\nKB5060842 failed to install on one of my PCs. According to windowslatest.com, there is an issue and some users may need to wait for a revised version of KB5060842.\nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "Securonix Acquires Threat Intelligence Firm ThreatQuotient",
        "Link": "https://www.securityweek.com/securonix-acquires-threat-intelligence-firm-threatquotient/",
        "Summary": "<p>Cybersecurity heavyweight Securonix acquires ThreatQuotient to boost plans to build an all-in-one security operations stack. </p>\n<p>The post <a href=\"https://www.securityweek.com/securonix-acquires-threat-intelligence-firm-threatquotient/\">Securonix Acquires Threat Intelligence Firm ThreatQuotient</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/securonix-acquires-threat-intelligence-firm-threatquotient/"
    },
    {
        "Title": "Maze Banks $25M to Tackle Cloud Security with AI Agents",
        "Link": "https://www.securityweek.com/maze-banks-25m-to-tackle-cloud-security-with-ai-agents/",
        "Summary": "<p>Maze and its investors are betting on finding profits in software that uses AI-powered agents to automate critical parts of the process.</p>\n<p>The post <a href=\"https://www.securityweek.com/maze-banks-25m-to-tackle-cloud-security-with-ai-agents/\">Maze Banks $25M to Tackle Cloud Security with AI Agents</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/maze-banks-25m-to-tackle-cloud-security-with-ai-agents/"
    },
    {
        "Title": "Flaw in Industrial Computer Maker’s UEFI Apps Enables Secure Boot Bypass on Many Devices",
        "Link": "https://www.securityweek.com/flaw-in-industrial-computer-makers-uefi-apps-enables-secure-boot-bypass-on-many-devices/",
        "Summary": "<p>Vulnerable DTResearch UEFI firmware applications can be used in BYOVD attacks to bypass Secure Boot.</p>\n<p>The post <a href=\"https://www.securityweek.com/flaw-in-industrial-computer-makers-uefi-apps-enables-secure-boot-bypass-on-many-devices/\">Flaw in Industrial Computer Maker&#8217;s UEFI Apps Enables Secure Boot Bypass on Many Devices</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/flaw-in-industrial-computer-makers-uefi-apps-enables-secure-boot-bypass-on-many-devices/"
    },
    {
        "Title": "Webinar Today: Rethinking Endpoint Hardening for Today’s Attack Landscape",
        "Link": "https://www.securityweek.com/webinar-today-rethinking-endpoint-hardening-for-todays-attack-landscape/",
        "Summary": "<p>Learn how attackers hide in plain sight—and what you can do to stop them without slowing down your business.</p>\n<p>The post <a href=\"https://www.securityweek.com/webinar-today-rethinking-endpoint-hardening-for-todays-attack-landscape/\">Webinar Today: Rethinking Endpoint Hardening for Today’s Attack Landscape</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/webinar-today-rethinking-endpoint-hardening-for-todays-attack-landscape/"
    },
    {
        "Title": "Fortinet, Ivanti Patch High-Severity Vulnerabilities",
        "Link": "https://www.securityweek.com/fortinet-ivanti-patch-high-severity-vulnerabilities/",
        "Summary": "<p>Patches released by Fortinet and Ivanti resolve over a dozen vulnerabilities, including high-severity flaws leading to code execution, credential leaks.</p>\n<p>The post <a href=\"https://www.securityweek.com/fortinet-ivanti-patch-high-severity-vulnerabilities/\">Fortinet, Ivanti Patch High-Severity Vulnerabilities</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/fortinet-ivanti-patch-high-severity-vulnerabilities/"
    },
    {
        "Title": "40,000 Security Cameras Exposed to Remote Hacking",
        "Link": "https://www.securityweek.com/40000-unprotected-security-cameras-found-on-internet/",
        "Summary": "<p>Bitsight has identified over 40,000 security cameras that can be easily hacked for spying or other types of malicious activity.</p>\n<p>The post <a href=\"https://www.securityweek.com/40000-unprotected-security-cameras-found-on-internet/\">40,000 Security Cameras Exposed to Remote Hacking</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/40000-unprotected-security-cameras-found-on-internet/"
    },
    {
        "Title": "Recently Disrupted DanaBot Leaked Valuable Data for 3 Years",
        "Link": "https://www.securityweek.com/recently-disrupted-danabot-leaked-valuable-data-for-3-years/",
        "Summary": "<p>Investigators leveraged a vulnerability dubbed DanaBleed to obtain insights into the internal operations of the DanaBot botnet.</p>\n<p>The post <a href=\"https://www.securityweek.com/recently-disrupted-danabot-leaked-valuable-data-for-3-years/\">Recently Disrupted DanaBot Leaked Valuable Data for 3 Years</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/recently-disrupted-danabot-leaked-valuable-data-for-3-years/"
    },
    {
        "Title": "Cyera Raises $540 Million to Expand AI-Powered Data Security Platform",
        "Link": "https://www.securityweek.com/cyera-raises-540-million-to-expand-ai-powered-data-security-platform/",
        "Summary": "<p>Series E funding round brings Cyera’s total funding to over $1.3 billion and values the data security firm at $6 billion.</p>\n<p>The post <a href=\"https://www.securityweek.com/cyera-raises-540-million-to-expand-ai-powered-data-security-platform/\">Cyera Raises $540 Million to Expand AI-Powered Data Security Platform</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cyera-raises-540-million-to-expand-ai-powered-data-security-platform/"
    },
    {
        "Title": "Horizon3.ai Raises $100 Million in Series D Funding",
        "Link": "https://www.securityweek.com/horizon3-ai-raises-100-million-in-series-d-funding/",
        "Summary": "<p>Horizon3.ai has raised $100 million to expand product capabilities, and to scale its partner ecosystem and federal market presence.</p>\n<p>The post <a href=\"https://www.securityweek.com/horizon3-ai-raises-100-million-in-series-d-funding/\">Horizon3.ai Raises $100 Million in Series D Funding</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/horizon3-ai-raises-100-million-in-series-d-funding/"
    },
    {
        "Title": "Rethinking Success in Security: Why Climbing the Corporate Ladder Isn’t Always the Goal",
        "Link": "https://www.securityweek.com/rethinking-success-in-security-why-climbing-the-corporate-ladder-isnt-always-the-goal/",
        "Summary": "<p>Many security professionals feel pressured to pursue leadership roles, but success can also mean going deeper, not just higher.</p>\n<p>The post <a href=\"https://www.securityweek.com/rethinking-success-in-security-why-climbing-the-corporate-ladder-isnt-always-the-goal/\">Rethinking Success in Security: Why Climbing the Corporate Ladder Isn&#8217;t Always the Goal</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/rethinking-success-in-security-why-climbing-the-corporate-ladder-isnt-always-the-goal/"
    },
    {
        "Title": "Saudi Arabia Based Web Development Firm Mooonux Allegedly Breached",
        "Link": "https://dailydarkweb.net/saudi-arabia-based-web-development-firm-mooonux-allegedly-breached/",
        "Summary": "The web development and hosting company, Mooonux, has allegedly been compromised, with a threat actor claiming to be selling root shell access and the company&#8217;s full database on a cybercrime forum. Mooonux is known for creating and hosting websites for various clients. The breach allegedly affects not only Mooonux but also the eight other websites [&#8230;]",
        "Date": "2025-06-11",
        "Content": "The web development and hosting company, Mooonux, has allegedly been compromised, with a threat actor claiming to be selling root shell access and the company’s full database on a cybercrime forum. Mooonux is known for creating and hosting websites for various clients. The breach allegedly affects not only Mooonux but also the eight other websites it hosts, putting a wide range of client data at risk. The total database size is reported to be over 5 GB.\nThe attacker claims the initial intrusion occurred approximately a month ago by purchasing logs from an information-stealing malware that contained the company’s FileZilla FTP credentials. After gaining initial access and downloading files, the perpetrator alleges they installed a root shell on the server. This, they claim, provided them with persistent administrative access even after the company attempted to secure its systems by changing the FTP password, highlighting a potentially flawed incident response procedure.\nThe threat actor is attempting to sell this high-level access along with a complete copy of the company’s data for no less than $100. The leaked data allegedly includes a wide array of sensitive information.\nLeaked data allegedly includes:\nFull source code (SRC) for Mooonux and its client websites\nCompany and client emails\nComplete databases (DBs)\ncPanel and server configuration files\nSSL certificates and private keys\nClient and internal user data\nTags:\nCyberSecurity\ndata-breach\ndata-leak\nFTP\nMooonux\nroot access\nweb hosting"
    },
    {
        "Title": "Bogota Government Entity Allegedly Breached, Citizen Data Leaked Online",
        "Link": "https://dailydarkweb.net/bogota-government-entity-allegedly-breached-citizen-data-leaked-online/",
        "Summary": "A threat actor has allegedly leaked a database containing 19,200 records from the District Institute for Participation and Community Action (IDPAC), a key governmental body in Bogotá, Colombia. The data was posted on a dark web forum, with the actor claiming to have exfiltrated sensitive information belonging to citizens who have interacted with the agency. [&#8230;]",
        "Date": "2025-06-11",
        "Content": "A threat actor has allegedly leaked a database containing 19,200 records from the District Institute for Participation and Community Action (IDPAC), a key governmental body in Bogotá, Colombia. The data was posted on a dark web forum, with the actor claiming to have exfiltrated sensitive information belonging to citizens who have interacted with the agency. IDPAC is a vital public entity responsible for fostering, strengthening, and guaranteeing the right to citizen participation in the capital city, managing community action boards, and promoting democratic culture. The breach could potentially impact thousands of individuals involved in local governance and community initiatives.\nThe actor behind the incident advertised the data leak, providing samples and links to the full database. The compromised information allegedly includes a wide range of personally identifiable information (PII), which could be exploited for various malicious activities, including identity theft, phishing campaigns, and fraud. The exposure of such data from a government source is particularly concerning, as it can erode public trust and endanger the privacy of citizens engaged in civic processes.\nThe leaked data allegedly contains the following personal details:\nID numbers\nFull names\nDates of birth\nPhysical addresses\nEmail addresses\nCell phone numbers\nTags:\nBogotá\nColombia\nCyberSecurity\ndata-breach\ngovernment\nIDPAC"
    },
    {
        "Title": "Malaysian Blood Donation Platform MyBloodMiles Allegedly Breached, Donor Data Exposed",
        "Link": "https://dailydarkweb.net/malaysian-blood-donation-platform-mybloodmiles-allegedly-breached-donor-data-exposed/",
        "Summary": "A Malaysian blood donation and donor management platform, MyBloodMiles, has allegedly been breached by threat actors. Information regarding the unauthorized access was posted on a dark web forum, claiming to have gained entry to the website&#8217;s admin panel. MyBloodMiles appears to be a system designed to manage and encourage blood donations, connecting with donors and [&#8230;]",
        "Date": "2025-06-11",
        "Content": "A Malaysian blood donation and donor management platform, MyBloodMiles, has allegedly been breached by threat actors. Information regarding the unauthorized access was posted on a dark web forum, claiming to have gained entry to the website’s admin panel. MyBloodMiles appears to be a system designed to manage and encourage blood donations, connecting with donors and handling sensitive personal and medical information, making any potential data leak a significant privacy concern.\nThe perpetrators of the attack allegedly gained access to the backend systems of the platform, exposing a trove of highly sensitive data. Screenshots shared by the threat actors suggest that the compromised information includes detailed records of blood donors and blood bag inventories. This allegedly exfiltrated data contains personal and medical details crucial to the blood donation process. The breach highlights the critical need for robust security measures within healthcare-related platforms that store citizen data.\nThe data allegedly accessed from the admin panel includes:\nDonor names\nBarcodes\nBlood types\nEligibility status\nBlood bag received and expiry dates\nTags:\nCyberSecurity\ndata-breach\nHealthcare\nMalaysia\nMyBloodMiles"
    },
    {
        "Title": "IT Solutions Provider Beep Systems Allegedly Breached, Over 174,000 User Records for Sale",
        "Link": "https://dailydarkweb.net/it-solutions-provider-beep-systems-allegedly-breached-over-174000-user-records-for-sale/",
        "Summary": "Beep Systems, a company that presents itself as a provider of various IT solutions including cybersecurity, data management, and cloud services, is allegedly the latest victim of a significant data breach. A threat actor has claimed to have successfully infiltrated the company&#8217;s infrastructure and is now offering a comprehensive database, purportedly belonging to beepsystems.com, for [&#8230;]",
        "Date": "2025-06-11",
        "Content": "Beep Systems, a company that presents itself as a provider of various IT solutions including cybersecurity, data management, and cloud services, is allegedly the latest victim of a significant data breach. A threat actor has claimed to have successfully infiltrated the company’s infrastructure and is now offering a comprehensive database, purportedly belonging to beepsystems.com, for sale on a dark web forum. The company, which offers to provide “solutions for all security,” now finds its own data and that of its users allegedly compromised.\nAccording to the post made by the data broker, the breach has resulted in the exposure of a full SQL database containing over five million lines of data. The seller claims the database holds information on 174,828 unique users and is also making the full phpmyadmin and database files available to potential buyers. The compromised data allegedly includes sensitive personal information that could be leveraged for various malicious activities.\nThe leaked data allegedly includes the following user details:\nFull Name\nEmail Address\nPhone Number\nPassword\nTags:\nBeep Systems\ncyber-attack\nCyberSecurity\ndata-breach\ndata-leak\ndatabase\nIT solutions"
    },
    {
        "Title": "SNCF Connect Allegedly Breached, Millions of Customer and Worker Records for Sale",
        "Link": "https://dailydarkweb.net/sncf-connect-allegedly-breached-millions-of-customer-and-worker-records-for-sale/",
        "Summary": "A threat actor has allegedly posted for sale the database of SNCF Connect, the online reservation and ticketing service for France&#8217;s national state-owned railway company, Société Nationale des Chemins de fer Français (SNCF). SNCF is a critical component of France&#8217;s public transportation infrastructure, managing the country&#8217;s national rail traffic, including the high-speed TGV trains. The [&#8230;]",
        "Date": "2025-06-11",
        "Content": "A threat actor has allegedly posted for sale the database of SNCF Connect, the online reservation and ticketing service for France’s national state-owned railway company, Société Nationale des Chemins de fer Français (SNCF). SNCF is a critical component of France’s public transportation infrastructure, managing the country’s national rail traffic, including the high-speed TGV trains. The online platform, sncf-connect.com, is a vital tool for millions of travelers, facilitating ticket purchases, journey planning, and management of loyalty programs. The alleged breach, posted on a dark web forum, claims to contain the data of over five million customers and workers.\nThe seller, claims the database is recent and includes a wide range of sensitive personal and financial information. The post included a sample of the data to substantiate their claims, though the authenticity of the breach has not been officially confirmed by SNCF. This incident could pose a significant risk of fraud, phishing attacks, and identity theft for the millions of individuals whose data may have been compromised.\nThe leaked data allegedly includes a comprehensive list of user and employee details. The fields listed for sale are:\nCustomer ID\nFirst name\nLast name\nEmail address\nPhone number\nDate of birth\nPhysical address (address, postal code, city, country)\nRegistration date\nLast login date\nVerification status\nPayment method ID\nIBAN\nBIC Swift\nTax ID\nLoyalty card number\nTags:\nCyberSecurity\ndata-breach\ndata-leak\nFrance\npersonally identifiable information\nPII\nSNCF\ntransportation"
    },
    {
        "Title": "Spanish Tech News Giant ADSLZone Defaced in Politically Motivated Attack",
        "Link": "https://dailydarkweb.net/spanish-tech-news-giant-adslzone-defaced-in-politically-motivated-attack/",
        "Summary": "The prominent Spanish technology news and forum website, ADSLZone, has allegedly been targeted in a defacement attack. A group identifying as &#8220;@gov.eth&#8221; claimed responsibility for the incident, altering the website&#8217;s homepage to display politically charged messages. ADSLZone is a major online publication in Spain, providing news and tutorials on internet services, mobile telephony, software, and [&#8230;]",
        "Date": "2025-06-11",
        "Content": "The prominent Spanish technology news and forum website, ADSLZone, has allegedly been targeted in a defacement attack. A group identifying as “@gov.eth” claimed responsibility for the incident, altering the website’s homepage to display politically charged messages. ADSLZone is a major online publication in Spain, providing news and tutorials on internet services, mobile telephony, software, and technology to a large readership, making this public-facing attack particularly significant.\nThe attackers replaced several articles on the main page with their own banner, which included slogans critical of the current Spanish government. The nature of the defacement appears to be a form of hacktivism, aiming to broadcast a political message rather than to steal data or cause long-term damage to the site’s infrastructure. There has been no mention or evidence of a data breach accompanying the defacement, and the impact seems confined to the temporary alteration of the website’s content.\nThe messages displayed by the attackers included:\nHACKED BY @GOV.ETH\n#SanchezCorrupto\n#SanchezDimiteYa\nA link to a Telegram channel\nADSLZone was actively working to restore its website to its normal state. The incident highlights the vulnerability of high-traffic media outlets to politically motivated cyber-attacks, where the primary goal is public disruption and message propagation.\nTags:\nADSLZone\ncyber-attack\nCyberSecurity\ndefacement\nhacktivism\nNews\nSpain"
    },
    {
        "Title": "Database Containing 10k virtualmacosx User Accounts Allegedly Shared Online",
        "Link": "https://dailydarkweb.net/database-containing-10k-virtualmacosx-user-accounts-allegedly-shared-online/",
        "Summary": "A user on a dark web forum has shared what allegedly appears to be the sensitive data of approximately 10,000 users of virtualmacosx.com, also known as vmOSX. The company in question is a U.S.-based cloud service provider that offers virtual Mac OS X servers and desktops, a critical service for developers and businesses needing remote [&#8230;]",
        "Date": "2025-06-11",
        "Content": "A user on a dark web forum has shared what allegedly appears to be the sensitive data of approximately 10,000 users of virtualmacosx.com, also known as vmOSX. The company in question is a U.S.-based cloud service provider that offers virtual Mac OS X servers and desktops, a critical service for developers and businesses needing remote access to a macOS environment for tasks like iOS app development. The appearance of this data online could present significant privacy and security risks to the platform’s user base.\nThe data was shared by a threat actor on a known hacking forum. Instead of claiming to have breached the website, the user simply shared the database allegedly belonging to the company. The shared information could be exploited by malicious actors for various nefarious purposes, including targeted phishing campaigns, identity theft, and other fraudulent activities.\nThe allegedly shared data includes the following user details:\nFull Names\nCompany Names\nEmail Addresses\nHashed Passwords\nPhysical Addresses (including street, city, state, and country)\nPhone Numbers\nIP Addresses\nAccount Status\nAccount creation and last login dates\nTags:\nCloud security\nCyberSecurity\ndark web\ndata-breach\ndata-leak\nPII\nvirtualmacosx\nvmOSX"
    },
    {
        "Title": "Alleged Sale of Access to Kyrgyzstan’s Foreign Ministry",
        "Link": "https://dailydarkweb.net/alleged-sale-of-access-to-kyrgyzstans-foreign-ministry/",
        "Summary": "A threat actor has allegedly put comprehensive access to the digital infrastructure of the Ministry of Foreign Affairs of Kyrgyzstan up for sale on a dark web forum. The Ministry is the central government body responsible for implementing the nation&#8217;s foreign policy, managing its diplomatic relations with other countries and international organizations. A compromise of [&#8230;]",
        "Date": "2025-06-11",
        "Content": "A threat actor has allegedly put comprehensive access to the digital infrastructure of the Ministry of Foreign Affairs of Kyrgyzstan up for sale on a dark web forum. The Ministry is the central government body responsible for implementing the nation’s foreign policy, managing its diplomatic relations with other countries and international organizations. A compromise of this ministry could have significant implications for the nation’s security and its international standing, potentially exposing sensitive diplomatic communications and state secrets.\nThe seller claims to have obtained complete control over the ministry’s systems. The post, which appeared on a clandestine online marketplace, asserts that the access is extensive and provides a list of the compromised assets. The threat actor is advertising the sale to “only serious buyers,” suggesting an attempt to monetize the access for a significant sum. This incident highlights the persistent and evolving threats facing government institutions worldwide, where state-level data is a prime target for cybercriminals.\nThe allegedly compromised data includes access to the following:\nPersonal mailboxes\nMail servers\nPersonal computers\nDatabases\nTags:\ncyberattack\nCyberSecurity\ndata-breach\ngovernment\nKyrgyzstan\nMinistry of Foreign Affairs"
    }
]