[
    {
        "Title": "New Android Malware Surge Hits Devices via Overlays, Virtualization Fraud and NFC Theft",
        "Link": "https://thehackernews.com/2025/06/new-android-malware-surge-hits-devices.html",
        "Summary": "Cybersecurity researchers have exposed the inner workings of an Android malware called AntiDot that has compromised over 3,775 devices as part of 273 unique campaigns.\n\"Operated by the financially motivated threat actor LARVA-398, AntiDot is actively sold as a Malware-as-a-Service (MaaS) on underground forums and has been linked to a wide range of mobile campaigns,\" PRODAFT said in a report",
        "Date": "2025-06-19",
        "Content": "Cybersecurity researchers have exposed the inner workings of an Android malware called AntiDot that has compromised over 3,775 devices as part of 273 unique campaigns.\n\"Operated by the financially motivated threat actor LARVA-398, AntiDot is actively sold as a Malware-as-a-Service (MaaS) on underground forums and has been linked to a wide range of mobile campaigns,\" PRODAFT\nsaid\nin a report shared with The Hacker News.\nAntiDot is advertised as a \"three-in-one\" solution with capabilities to record the device screen by abusing Android's accessibility services, intercept SMS messages, and extract sensitive data from third-party applications.\nThe Android botnet is suspected to be delivered via malicious advertising networks or through highly tailored phishing campaigns based on activity that indicates selective targeting of victims based on language and geographic location.\nAntiDot was first\npublicly documented\nin May 2024 after it was spotted being distributed as Google Play updates to accomplish its information theft objectives.\nLike other Android trojans, it features a wide range of capabilities to conduct overlay attacks, log keystrokes, and remotely control infected devices using Android's MediaProjection API. It also establishes a WebSocket communication to facilitate real-time, bi-directional communication between the infected device and an external server.\nIn December 2024, Zimperium\nrevealed\ndetails of a mobile phishing campaign that distributed an updated version of AntiDot dubbed AppLite Banker using job offer-themed decoys.\nThe latest findings from the Swiss cybersecurity company show that there are at least 11 active command-and-control (C2) servers in operation that are overseeing no less than 3,775 infected devices across 273 distinct campaigns.\nA Java-based malware at its core, AntiDot is heavily obfuscated using a commercial packer to sidestep detection and analysis efforts. The malware, per PRODAFT, is delivered as part of a three-stage process that starts with an APK file.\n\"An inspection of the AndroidManifest file reveals that many class names do not appear in the original APK,\" the company said. \"These missing classes are dynamically loaded by the packer during installation, and include malicious code extracted from an encrypted file. The entire mechanism is intentionally crafted to avoid detection by antivirus tools.\"\nOnce launched, it serves a bogus update bar and prompts the victim to grant it accessibility permissions, after which it unpacks and loads a DEX file incorporating the botnet functions.\nA core feature of AntiDot is its ability to monitor for newly launched applications and serve and serve a bogus login screen from the C2 server when the victim opens a cryptocurrency- or payment-related app that the operators are interested in.\nThe malware also abuses accessibility services to gather extensive information about the contents of the active screens and sets itself as the default SMS app for capturing incoming and outgoing texts. Furthermore, it can monitor phone calls, block calls from specific numbers, or redirect them, effectively opening up more avenues for fraud.\nAnother important feature is that it can keep track of real-time notifications displayed in the device's status bar and takes steps to either dismiss or snooze them in a bid to suppress alerts and avoid alerting the user of suspicious activity.\nPRODAFT said the C2 panel that powers the remote control functions is built using MeteorJS, an open-source JavaScript framework that enables real-time communication. The panel has six different tabs -\nBots, which displays a list of all the compromised devices and their details\nInjects, which displays a list of all target apps for overlay injection and view the overlay template for each inject\nAnalytic, which displays a list of applications installed on victim devices and likely used to identify new and popular apps for future targeting\nSettings, which contains the core configuration options for the panel, including updating the injects\nGates, which is used to manage the infrastructure endpoints that the bots connect to\nHelp, which offers support resources for using the malware\n\"AntiDot represents a scalable and evasive MaaS platform designed for financial gain through persistent control of mobile devices, especially in localized and language-specific regions,\" the company said. \"The malware also employs WebView injection and overlay attacks to steal credentials, making it a serious threat to user privacy and device security.\"\nGodFather Returns\nThe development as Zimperium zLabs said it uncovered a \"sophisticated evolution\" of the GodFather Android banking trojan that makes use of on-device virtualization to hijack legitimate mobile banking and cryptocurrency applications and carry out real-time fraud.\n\"The core of this novel technique is the malware's ability to create a complete, isolated virtual environment on the victim's device. Instead of simply mimicking a login screen, the malware installs a malicious 'host' application that contains a virtualization framework,\" researchers Fernando Ortega and Vishnu Pratapagiri\nsaid\n.\n\"This host then downloads and runs a copy of the actual targeted banking or cryptocurrency app within its controlled sandbox.\"\nShould the victim launch the app, they are redirected to the virtual instance, from where their activities are monitored by the threat actors. In addition, the latest version of GodFather packs in features to bypass static analysis tools by making use of ZIP manipulation and filling the AndroidManifest file with irrelevant permissions.\nLike in the case of AntiDot, GodFather relies on accessibility services to conduct its information gathering activities and control compromised devices. While Google has enforced security protections that prevent sideloaded apps from enabling accessibility service starting Android 13, a\nsession-based installation approach\ncan get around this safeguard.\nThe session-based method is used by Android app stores to handle app installation, as do texting apps, mail clients, and browsers when presented with APK files.\nCentral to the functioning of the malware is its virtualization feature. In the first stage, it collects information about the list of installed apps and checks if it includes any of the predetermined apps it's configured to target.\nIf matches are found, it extracts relevant information from those apps and then proceeds to install a copy of those apps in a virtual environment inside the dropper app. Thus when the victim attempts to launch the actual banking application on their device, GodFather intercepts the action and opens the virtualized instance instead.\nIt's worth pointing out that similar virtualization features were previously flagged in another Android malware codenamed\nFjordPhantom\n, which was documented by Promon in December 2023. The method represents a paradigm shift in mobile threat capabilities that go beyond the traditional overlay tactic to steal credentials and other sensitive data.\n\"While this GodFather campaign casts a wide net, targeting\nnearly 500 applications\nglobally, our analysis reveals that this highly sophisticated virtualization attack is currently focused on a dozen Turkish financial institutions,\" the company said.\n\"A particularly alarming capability uncovered in the GodFather malware is its capacity to steal device lock credentials, irrespective of whether the victim uses an unlock pattern, a PIN, or a password. This poses a significant threat to user privacy and device security.\"\nThe mobile security company said the abuse of accessibility services is one of the many ways malicious apps can achieve privilege escalation on Android, allowing them to obtain permissions that exceed their functional requirements. These include misuse of Original Equipment Manufacturer (OEM) permissions and security vulnerabilities in pre-installed apps that cannot be removed by users.\n\"Preventing privilege escalation and securing Android ecosystems against malicious or over-privileged applications requires more than user awareness or reactive patching—it demands proactive, scalable, and intelligent defense mechanisms,\" security researcher Ziv Zeira\nsaid\n.\nSuperCard X Malware Comes to Russia\nThe findings also follow the first recorded attempts to target Russian users with SuperCard X, a newly emerged Android malware that can conduct near-field communication (NFC) relay attacks for fraudulent transactions.\nAccording to Russian cybersecurity company F6, SuperCard X is a malicious modification of a legitimate tool called\nNFCGate\nthat can capture or modify NFC traffic. The end goal of the malware is to not only receive NFC traffic from the victim, but also bank card data read by sending commands to its EMV chip.\n\"This application allows attackers to steal bank card data by intercepting NFC traffic for subsequent theft of money from users' bank accounts,\" F6 researcher Alexander Koposov\nsaid\nin a report published this week.\nAttacks leveraging SuperCard X were\nfirst spotted\ntargeting Android users in Italy earlier this year, weaponizing NFC technology to relay data from victims' physical cards to attacker-controlled devices, from where they were used to carry out fraudulent ATM withdrawals or authorize point-of-sale (PoS) payments.\nThe Chinese-speaking MaaS platform, advertised on Telegram as capable of targeting customers of major banks in the U.S., Australia and Europe, shares substantial code-level overlaps with\nNGate\n, an Android malware that has also been found weaponizing NFCGate for malicious purposes in the Czech Republic.\nAll these campaigns are united by the fact that they rely on smishing techniques to convince a potential victim of the need to install an APK file on the device under the guise of a useful program.\nMalicious Apps Spotted on App Stores\nWhile all of the aforementioned malware strains require victims to sideload the apps on their devices, new research has also unearthed malicious apps on the official Google Play Store and Apple's App Store with capabilities to\nharvest personal information\nand\nsteal mnemonic phrases\nassociated with cryptocurrency wallets with the goal of draining their assets.\nOne of the apps in question, RapiPlata, is estimated to have been downloaded around 150,000 times on both Android and iOS devices, underscoring the severity of the threat. The app is a type of malware known as\nSpyLoan\n, which lures users by claiming to offer loans at low-interest rates, only to be subjected to extortion, blackmail, and data theft.\n\"RapiPlata primarily targets Colombian users by promising quick loans,\" Check Point said. \"Beyond its predatory lending practices, the app engages in extensive data theft. The app had extensive access to sensitive user data -- including SMS messages, call logs, calendar events, and installed applications -- even going so far as to upload this data to its servers.\"\nThe cryptocurrency wallet phishing apps, on the other hand, have been distributed through compromised developer accounts and serve a phishing page via WebView to obtain the seed phrases.\nAlthough these apps have since been removed from the respective app stores, the danger is that the Android apps could be available for download from third-party websites. Users are advised to exercise caution when downloading financial or loan-related applications.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "BlueNoroff Deepfake Zoom Scam Hits Crypto Employee with macOS Backdoor Malware",
        "Link": "https://thehackernews.com/2025/06/bluenoroff-deepfake-zoom-scam-hits.html",
        "Summary": "The North Korea-aligned threat actor known as BlueNoroff has been observed targeting an employee in the Web3 sector with deceptive Zoom calls featuring deepfaked company executives to trick them into installing malware on their Apple macOS devices.\nHuntress, which revealed details of the cyber intrusion, said the attack targeted an unnamed cryptocurrency foundation employee, who received a",
        "Date": "2025-06-19",
        "Content": "The North Korea-aligned threat actor known as\nBlueNoroff\nhas been observed targeting an employee in the Web3 sector with deceptive Zoom calls featuring deepfaked company executives to trick them into installing malware on their Apple macOS devices.\nHuntress, which revealed details of the cyber intrusion, said the attack targeted an unnamed cryptocurrency foundation employee, who received a message from an external contact on Telegram.\n\"The message requested time to speak to the employee, and the attacker sent a Calendly link to set up meeting time,\" security researchers Alden Schmidt, Stuart Ashenbrenner, and Jonathan Semon\nsaid\n. \"The Calendly link was for a Google Meet event, but when clicked, the URL redirects the end user to a fake Zoom domain controlled by the threat actor.\"\nAfter several weeks, the employee is said to have joined a group Zoom meeting that included several deepfakes of known members of the senior leadership of their company, along with other external contacts.\nHowever, when the employee said they were unable to use their microphone, the synthetic personas urged them to download and install a Zoom extension to address the supposed issue. The link to the extension, shared via Telegram, downloaded an AppleScript that went by the name \"zoom_sdk_support.scpt.\"\nThis AppleScript first opens a legitimate webpage for the Zoom software development kit (SDK), but is also configured to stealthily download a next-stage payload from a remote server (\"support[.]us05web-zoom[.]biz\") and executes a shell script.\nThe script begins by disabling bash history logging and then checks if Rosetta 2 is installed on the compromised Mac, and if not, installs it.\nRosetta\nis a software that enables Macs running Apple silicon to run apps that were built for a Mac with an Intel processor (x86_64).\nThe script then proceeds to create a hidden file called \".pwd,\" and downloads a binary from the malicious Zoom web page (\"web071zoom[.lus/fix/audio-fv/7217417464\") to the \"/tmp/icloud_helper\" directory. It also performs another request to \"web071zoom[.]us/fix/audio-tr/7217417464\" to fetch another unspecified payload.\nThe shell script also prompts the user to provide their system password and wipes the history of executed commands to avoid leaving a forensic trail. Huntress said its investigation led to the discovery of eight distinct malicious binaries on the victim host -\nTelegram 2\n, a Nim-based binary responsible for starting the primary backdoor\nRoot Troy V4\n, a fully-featured Go backdoor that's used to run remote AppleScript payloads, shell commands, and download additional malware and execute them\nInjectWithDyld\n, a C++ binary loader downloaded by Root Troy V4, which, in turn, drops two more payloads: A\nbenign Swift application\nto facilitate process injection and a different\nNim implant\nthat enables the operator to issue commands and receive responses asynchronously\nXScreen\n, an Objective-C keylogger with features to monitor the victim's keystrokes, clipboard, and the screen, and send the information to a command-and-control (C2) server\nCryptoBot\n, a Go-based information stealer that can collect cryptocurrency related files from the host\nNetChk\n, an almost empty binary that's designed to generate random numbers forever\nBlueNoroff, also tracked under the names Alluring Pisces, APT38, Black Alicanto, Copernicium, Nickel Gladstone, Stardust Chollima, and TA444, is a sub-cluster within the Lazarus Group that has a\nhistory\nof\nstriking\nfinancial institutions, cryptocurrency businesses, and ATMs for\nmonetary gain\nand generate revenue for the Democratic People's Republic of Korea (DPRK).\nThe group is best known for orchestrating a series of cryptocurrency heists known as\nTraderTraitor\nto target employees of organizations engaged in blockchain research with malicious cryptocurrency trading applications. Some of the significant cases include the hacks of\nBybit\nin February 2025 and\nAxie Infinity\nin March 2022.\n\"Remote workers, especially in high-risk areas of work, are often the ideal targets for groups like TA444,\" Huntress said. \"It is important to train employees to identify common attacks that start off with social engineering related to remote meeting software.\"\nAccording to DTEX's\nlatest assessment\nof North Korea's cyber structure, the APT38 mission likely no longer exists and has fractured into TraderTraitor (aka Jade Sleet and UNC4899) and\nCryptoCore\n(aka CageyChameleon, CryptoMimic, DangerousPassword, LeeryTurtle, and Sapphire Sleet), with the two clusters becoming the new faces of financial theft for the regime.\n\"TraderTraitor is arguably the most prolific of any of the DPRK APT groups when it comes to cryptocurrency theft and seems to have housed the most talent from the original APT38 effort,\" DTEX said. \"CryptoCore has been active since at least 2018, likely splitting out of APT38 with TraderTraitor.\"\nWhat's more, the use of audio issue-themed lures to trick prospective victims into compromising their own machines with malware has its echoes in an evolution of another North Korea-linked campaign dubbed Contagious Interview, which involves using ClickFix-style alerts to deliver a Go-based malware named GolangGhost.\nThe new iteration, referred to as\nClickFake Interview\n, revolves around creating fake job advertisements and duping job applicants into copying and running a malicious command under the pretext of addressing an issue with access camera and microphone on a fake website set up by the threat actors to complete their hiring assessment.\nThese cross-platform attacks, per Cisco Talos, have since evolved further, employing a Python version of GolangGhost that has been codenamed PylangGhost. The bogus assessment sites impersonate well-known financial entities such as Archblock, Coinbase, Robinhood, and Uniswap, and have been found to target a small set of users mainly located in India.\n\"In recent campaigns, the threat actor Famous Chollima — potentially made up of multiple groups — has been using a Python-based version of their trojan to target Windows systems, while continuing to deploy a Golang-based version for MacOS users,\" security researcher Vanja Svajcer\nsaid\n. \"Linux users are not targeted in these latest campaigns.\"\nPylangGhost, like its Golang counterpart, establishes contact with a C2 server to receive commands that enable the attackers to remotely control the infected machine, download/upload files, as well as steal cookies and credentials from over 80 browser extensions, including password managers and cryptocurrency wallets.\n\"It is not clear [...] why the threat actors decided to create two variants using a different programming language, or which was created first,\" Talos remarked. \"The structure, the naming conventions and the function names are very similar, which indicates that the developers of the different versions either worked closely together or are the same person.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Secure Vibe Coding: The Complete New Guide",
        "Link": "https://thehackernews.com/2025/06/secure-vibe-coding-complete-new-guide.html",
        "Summary": "DALL-E for coders? That’s the promise behind vibe coding, a term describing the use of natural language to create software. While this ushers in a new era of AI-generated code, it introduces \"silent killer\" vulnerabilities: exploitable flaws that evade traditional security tools despite perfect test performance.\nA detailed analysis of secure vibe coding practices is available here.\nTL;DR: Secure",
        "Date": "2025-06-19",
        "Content": "DALL-E for coders? That's the promise behind vibe coding,\na term\ndescribing the use of natural language to create software. While this ushers in a new era of AI-generated code, it introduces \"silent killer\" vulnerabilities: exploitable flaws that evade traditional security tools despite perfect test performance.\nA detailed analysis of secure vibe coding practices is available\nhere\n.\nTL;DR: Secure Vibe Coding\nVibe coding, using natural language to generate software with AI, is revolutionizing development in 2025. But while it accelerates prototyping and democratizes coding, it also introduces \"silent killer\" vulnerabilities: exploitable flaws that pass tests but evade traditional security tools.\nThis article explores:\nReal-world examples of AI-generated code in production\nShocking stats: 40% higher secret exposure in AI-assisted repos\nWhy LLMs omit security unless explicitly prompted\nSecure prompting techniques and tool comparisons (GPT-4, Claude, Cursor, etc.)\nRegulatory pressure from the EU AI Act\nA practical workflow for secure AI-assisted development\nBottom line: AI can write code, but it won't secure it unless you ask, and even then, you still need to verify.\nSpeed without security is just fast failure.\nIntroduction\nVibe coding has exploded in 2025. Coined by Andrej Karpathy, it's the idea that anyone can describe what they want and get functional code back from large language models. In\nKarpathy's words\n, vibe coding is about \"giving in to the vibes, embrace exponentials, and forget that the code even exists.\"\nFrom Prompt to Prototype: A New Development Model\nThis model isn't theoretical anymore. Pieter Levels (@levelsio) famously launched a multiplayer flight sim,\nFly.Pieter.com\n, using AI tools like Cursor, Claude, and Grok 3. He created the first prototype in under 3 hours using just one prompt:\n\"Make a 3D flying game in the browser.\"\nAfter 10 days, he had made\n$38,000 from the game\nand was earning around $5,000 monthly from ads as the project scaled to 89,000 players by March 2025.\nBut it's not just games. Vibe coding is being used to build MVPs, internal tools, chatbots, and even early versions of full-stack apps. According to\nrecent analysis\n, nearly\n25% of Y Combinator startups\nare now using AI to build core codebases.\nBefore you dismiss this as ChatGPT hype, consider the scale: we're not talking about toy projects or weekend prototypes. These are funded startups building production systems that handle real user data, process payments, and integrate with critical infrastructure.\nThe promise? Faster iteration. More experimentation. Less gatekeeping.\nBut there's a hidden cost to this speed.\nAI-generated code creates what security researchers call \"silent killer\" vulnerabilities, code that functions perfectly in testing but contains exploitable flaws that bypass traditional security tools and survive CI/CD pipelines to reach production.\nSources:\nY Combinator research\n|\nGitGuardian research\n|\nStanford University research\nThe Problem: Security Doesn't Auto-Generate\nThe catch is simple:\nAI generates what you ask for, not what you forget to ask.\nIn many cases, that means critical security features are left out.\nThe problem isn't just naive prompting, it's systemic:\nLLMs are trained to\ncomplete\n, not\nprotect\n. Unless security is explicitly in the prompt, it's usually ignored.\nTools like GPT-4 may suggest deprecated libraries or verbose patterns that mask subtle vulnerabilities.\nSensitive data is often hardcoded because the model \"saw it that way\" in training examples.\nPrompts like \"Build a login form\" often yield insecure patterns: plaintext password storage, no MFA, and broken auth flows.\nAccording to this new\nSecure Vibe Coding\nguide, this leads to what they call\n\"security by omission\"\n, functioning software that quietly ships with exploitable flaws. In one cited case, a developer used AI to fetch stock prices from an API and accidentally committed their hardcoded key to GitHub. A single prompt resulted in a real-world vulnerability.\nHere's another real example:\nA developer prompted AI to \"create a password reset function that emails a reset link.\" The AI generated working code that successfully sent emails and validated tokens. But it used a non-constant-time string comparison for token validation, creating a timing-based side-channel attack where attackers could brute-force reset tokens by measuring response times. The function passed all functional tests, worked perfectly for legitimate users, and would have been impossible to detect without specific security testing.\nTechnical Reality: AI Needs Guardrails\nThe\nguide\npresents a deep dive into how different tools handle secure code, and how to prompt them properly. For example:\nClaude\ntends to be more conservative, often flagging risky code with comments.\nCursor AI\nexcels at real-time linting and can highlight vulnerabilities during refactors.\nGPT-4\nneeds specific constraints, like:\n\"Generate [feature] with OWASP Top 10 protections. Include rate limiting, CSRF protection, and input validation.\"\nIt even includes secure prompt templates, like:\n# Insecure\n\"Build a file upload server\"\n\n# Secure\n\"Build a file upload server that only accepts JPEG/PNG, limits files to 5MB, sanitizes filenames, and stores them outside the web root.\"\nThe lesson: if you don't say it, the model won't do it. And even if you do say it, you still need to check.\nRegulatory pressure is mounting.\nThe EU AI Act now classifies some vibe coding implementations as \"high-risk AI systems\" requiring conformity assessments, particularly in critical infrastructure, healthcare, and financial services. Organizations must document AI involvement in code generation and maintain audit trails.\nSecure Vibe Coding in Practice\nFor those deploying vibe coding in production,\nthe guide suggests\na clear workflow:\nPrompt with Security Context\n– Write prompts like you're threat modeling.\nMulti-Step Prompting\n– First generate, then ask the model to review its own code.\nAutomated Testing\n– Integrate tools like Snyk, SonarQube, or GitGuardian.\nHuman Review\n– Assume every AI-generated output is insecure by default.\n# Insecure AI output: \nif token == expected_token: \n\n# Secure version: \nif hmac.compare_digest(token, expected_token):\nThe Accessibility-Security Paradox\nVibe coding democratizes software development, but democratization without guardrails creates systemic risk. The same natural language interface that empowers non-technical users to build applications also removes them from understanding the security implications of their requests.\nOrganizations are addressing this through tiered access models: supervised environments for domain experts, guided development for citizen developers, and full access only for security-trained engineers.\nVibe Coding ≠ Code Replacement\nThe smartest organizations treat AI as an augmentation layer, not a substitute. They use vibe coding to:\nAccelerate boring, boilerplate tasks\nLearn new frameworks with guided scaffolds\nPrototype experimental features for early testing\nBut they still rely on experienced engineers for architecture, integration, and final polish.\nThis is the new reality of software development: English is becoming a programming language, but only if you still understand the underlying systems. The organizations succeeding with vibe coding aren't replacing traditional development, they're augmenting it with security-first practices, proper oversight, and recognition that speed without security is just fast failure. The choice isn't whether to adopt AI-assisted development, it's whether to do it securely.\nFor those seeking to dive deeper into secure vibe coding practices,\nthe full guide\nprovides extensive guidelines.\nSecurity-focused Analysis of Leading AI Coding Systems\nAI System\nKey Strengths\nSecurity Features\nLimitations\nOptimal Use Cases\nSecurity Considerations\nOpenAI Codex / GPT-4\nVersatile, strong comprehension\nCode vulnerability detection (Copilot)\nMay suggest deprecated libraries\nFull-stack web dev, complex algorithms\nVerbose code may obscure security issues; weaker system-level security\nClaude\nStrong explanations, natural language\nRisk-aware prompting\nLess specialized for coding\nDoc-heavy, security-critical apps\nExcels at explaining security implications\nDeepSeek Coder\nSpecialized for coding, repo knowledge\nRepository-aware, built-in linting\nLimited general knowledge\nPerformance-critical, system-level programming\nStrong static analysis; weaker logical security flaw detection\nGitHub Copilot\nIDE integration, repo context\nReal-time security scanning, OWASP detection\nOver-reliance on context\nRapid prototyping, developer workflow\nBetter at detecting known insecure patterns\nAmazon CodeWhisperer\nAWS integration, policy-compliant\nSecurity scan, compliance detection\nAWS-centric\nCloud infrastructure, compliant envs\nStrong in generating compliant code\nCursor AI\nNatural language editing, refactoring\nIntegrated security linting\nLess suited for new, large codebases\nIterative refinement, security auditing\nIdentifies vulnerabilities in existing code\nBASE44\nNo-code builder, conversational AI\nBuilt-in auth, secure infrastructure\nNo direct code access, platform-limited\nRapid MVP, non-technical users, business automation\nPlatform-managed security creates vendor dependency\nThe\ncomplete guide\nincludes secure prompt templates for 15 application patterns, tool-specific security configurations, and enterprise implementation frameworks, essential reading for any team deploying AI-assisted development.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Uncover LOTS Attacks Hiding in Trusted Tools — Learn How in This Free Expert Session",
        "Link": "https://thehackernews.com/2025/06/uncover-lots-attacks-hiding-in-trusted.html",
        "Summary": "Most cyberattacks today don’t start with loud alarms or broken firewalls. They start quietly—inside tools and websites your business already trusts.\nIt’s called “Living Off Trusted Sites” (LOTS)—and it’s the new favorite strategy of modern attackers. Instead of breaking in, they blend in.\nHackers are using well-known platforms like Google, Microsoft, Dropbox, and Slack as launchpads. They hide",
        "Date": "2025-06-19",
        "Content": "Most cyberattacks today don't start with loud alarms or broken firewalls. They start quietly—inside tools and websites your business already trusts.\nIt's called \"\nLiving Off Trusted Sites\n\" (LOTS)—and it's the new favorite strategy of modern attackers. Instead of breaking in, they blend in.\nHackers are using well-known platforms like Google, Microsoft, Dropbox, and Slack as launchpads. They hide malicious code inside routine traffic, making it incredibly difficult for traditional defenses to detect them.\nAnd here's the scary part: many security teams don't even realize it's happening—until it's too late.\nWhy You're Not Seeing These Attacks\nLOTS tactics don't look suspicious at first glance. There's no malware signature to flag, and no unusual IP address to trace. It's legitimate traffic—until it's not.\nAttackers are exploiting:\nCommon business tools\nlike Teams, Zoom, and GitHub\nShortened or vanity URLs\nto redirect users\nTrusted cloud services\nto host malicious payloads\nIn short, they're using your trust against you.\nWhat You'll Learn in This Free Webinar\nJoin Zscaler's top threat hunters for \"\nThreat Hunting Insights from the World's Largest Security Cloud\n\"—a must-attend webinar revealing how stealthy LOTS attacks are detected and stopped in real time. Get frontline tactics to outsmart threats hiding in trusted tools.\nYou'll discover:\n🔍 The latest LOTS attack techniques seen in real environments\n🛠️ How threat hunters caught stealthy attackers hiding inside \"normal\" traffic\n🚨 What trusted tools are being misused right now by threat actors\n🔐 Simple, proven ways to improve LOTS detection and reduce risk\n🔭 What's coming next: trends shaping the future of stealth-based attacks\nThis session is for anyone responsible for defending their organization—whether you're a security leader trying to stay ahead of evolving threats, a threat hunter sharpening your detection skills, or part of an IT or SOC team overwhelmed by false positives and stealthy attacks. If your company relies on SaaS apps, cloud platforms, or collaborative tools, you're already a target—and LOTS tactics are designed to slip past unnoticed.\nWatch this Webinar\nAttackers today aren't trying to break in—they're blending in. By hiding inside trusted tools and platforms, they bypass traditional defenses and operate in plain sight. This webinar gives you rare access to real-world detection stories and techniques from experts who analyze trillions of security signals every day inside the world's largest inline security cloud.\nReserve your seat now\nto gain exclusive frontline insights, proven tactics, and smarter strategies that could save your team hours—and stop attacks before they succeed.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Russian APT29 Exploits Gmail App Passwords to Bypass 2FA in Targeted Phishing Campaign",
        "Link": "https://thehackernews.com/2025/06/russian-apt29-exploits-gmail-app.html",
        "Summary": "Threat actors with suspected ties to Russia have been observed taking advantage of a Google account feature called application specific passwords (or app passwords) as part of a novel social engineering tactic designed to gain access to victims' emails.\nDetails of the highly targeted campaign were disclosed by Google Threat Intelligence Group (GTIG) and the Citizen Lab, stating the activity",
        "Date": "2025-06-19",
        "Content": "Threat actors with suspected ties to Russia have been observed taking advantage of a Google account feature called\napplication specific passwords\n(or app passwords) as part of a novel social engineering tactic designed to gain access to victims' emails.\nDetails of the highly targeted campaign were disclosed by Google Threat Intelligence Group (GTIG) and the Citizen Lab, stating the activity seeks to impersonate the U.S. Department of State.\n\"From at least April through early June 2025, this actor targeted prominent academics and critics of Russia, often using extensive rapport building and tailored lures to convince the target to set up application specific passwords (ASPs), GTIG researchers Gabby Roncone and Wesley Shields\nsaid\n.\n\"Once the target shares the ASP passcode, the attackers establish persistent access to the victim's mailbox.\"\nThe activity has been attributed by Google to a threat cluster it tracks as UNC6293, which it says is likely affiliated with the\nRussian state-sponsored hacking group\ncalled APT29 (aka BlueBravo, Cloaked Ursa, CozyLarch, Cozy Bear, ICECAP, Midnight Blizzard, and The Dukes).\nThe social engineering unfolds over a span of several weeks to establish rapport with targets, rather than induce a sense of pressure or urgency that may have otherwise raised suspicion.\nThis involves sending benign phishing emails disguised as meeting invitations that include no less than four different fictitious addresses with the \"@state.gov\" email address in the CC line to lend it a veneer of credibility.\n\"A target might reason 'if this isn't legitimate, surely one of these State Department employees would say something, especially if I reply and keep them on the CC line,'\" the Citizen Lab\nsaid\n.\n\"We believe that the attacker is aware that the State Department's email server is apparently configured to accept all messages and does not emit a 'bounce' response even when the address does not exist.\"\nThis indicates that these attacks are meticulously planned and executed to trick victims into parting with a 16-digit passcode that gives the adversary permission to access their mailbox under the pretext of enabling \"secure communications between internal employees and external partners.\"\nGoogle describes these app passwords as a way for a less secure app or device the ability to access a user's Google account that has two-factor authentication (2FA) enabled.\n\"When you use 2-Step Verification, some less secure apps or devices may be blocked from accessing your Google account,\" per the company. \"App passwords are a way to let the blocked app or device access your Google account.\"\nThe initial messages are designed to elicit a response from the target to set up a meeting, after which they are sent a PDF document that lists a series of steps to create an app password in order to securely access a fake Department of State cloud environment and share the code with them.\n\"The attackers then set up a mail client to use the ASP, likely with the end goal of accessing and reading the victim's email correspondence,\" GTIG said. \"This method also allows the attackers to have persistent access to accounts.\"\nGoogle said it observed a second campaign bearing Ukrainian themes, and that the attackers logged into victim accounts mainly using residential proxies and VPS servers to evade detection. The company said it has since taken steps to secure the accounts compromised by the campaigns.\nUNC6293's ties to APT29 stem from a series of similar social engineering attacks that have leveraged novel techniques like\ndevice code phishing\nand\ndevice join phishing\nto gain unauthorized access to Microsoft 365 accounts since the start of the year.\nDevice join phishing is particularly noteworthy for the fact that it tricks victims into sending back to the attackers a Microsoft-generated OAuth code to hijack their accounts.\n\"Since April 2025, Microsoft has observed suspected Russian-linked threat actors using third-party application messages or emails referencing upcoming meeting invitations to deliver a malicious link containing valid authorization code,\" Microsoft\nrevealed\nlast month.\n\"When clicked, the link returns a token for the Device Registration Service, allowing registration of the threat actor's device to the tenant.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Meta Adds Passkey Login Support to Facebook for Android and iOS Users",
        "Link": "https://thehackernews.com/2025/06/meta-adds-passkey-login-support-to.html",
        "Summary": "Meta Platforms on Wednesday announced that it's adding support for passkeys, the next-generation password standard, on Facebook.\n\"Passkeys are a new way to verify your identity and login to your account that's easier and more secure than traditional passwords,\" the tech giant said in a post.\nSupport for passkeys is expected to be available \"soon\" on Android and iOS mobile devices. The feature is",
        "Date": "2025-06-19",
        "Content": "Meta Platforms on Wednesday announced that it's adding support for passkeys, the next-generation password standard, on Facebook.\n\"Passkeys are a new way to verify your identity and login to your account that's easier and more secure than traditional passwords,\" the tech giant\nsaid\nin a post.\nSupport for passkeys is expected to be available \"soon\" on Android and iOS mobile devices. The feature is also coming to its Messenger platform in the coming months.\nThe company said passkeys can also be used to auto-fill payment information when making purchases using Meta Pay.\nMeta previously rolled out passkeys support for\nWhatsApp on Android\nin October 2023, and on iOS a\nfew months later\nin April 2024. There is no word yet on when it plans to bring passkeys to Instagram.\nPasskeys, backed by the FIDO Alliance, is a passwordless authentication solution that allows users to securely sign in to online services by using biometrics or the device lock PIN code.\n\"Passkeys are an upgrade in security compared to traditional passwords and one-time SMS codes because they are resistant to guessing or theft by malicious websites or scam links, making them effective against phishing and password spraying attacks,\" Meta said.\nLast month, Microsoft made passkeys the\ndefault sign-in method\nfor new consumer accounts. More recently, Apple\npreviewed\nupcoming changes to its Passwords app that allows users to import and export passkeys between participating credential manager apps across iOS, iPadOS, macOS, and visionOS 26.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "New Linux Flaws Enable Full Root Access via PAM and Udisks Across Major Distributions",
        "Link": "https://thehackernews.com/2025/06/new-linux-flaws-enable-full-root-access.html",
        "Summary": "Cybersecurity researchers have uncovered two local privilege escalation (LPE) flaws that could be exploited to gain root privileges on machines running major Linux distributions.\nThe vulnerabilities, discovered by Qualys, are listed below -\n\nCVE-2025-6018 - LPE from unprivileged to allow_active in SUSE 15's Pluggable Authentication Modules (PAM)\nCVE-2025-6019 - LPE from allow_active to root in",
        "Date": "2025-06-19",
        "Content": "Cybersecurity researchers have uncovered two local privilege escalation (LPE) flaws that could be exploited to gain root privileges on machines running major Linux distributions.\nThe\nvulnerabilities\n, discovered by Qualys, are listed below -\nCVE-2025-6018\n- LPE from unprivileged to allow_active in SUSE 15's Pluggable Authentication Modules (\nPAM\n)\nCVE-2025-6019\n- LPE from allow_active to root in\nlibblockdev\nvia the\nudisks\ndaemon\n\"These modern 'local-to-root' exploits have collapsed the gap between an ordinary logged-in user and a full system takeover,\" Saeed Abbasi, Senior Manager at Qualys Threat Research Unit (TRU),\nsaid\n.\n\"By chaining legitimate services such as udisks loop-mounts and PAM/environment quirks, attackers who own any active GUI or SSH session can vault across polkit's allow_active trust zone and emerge as root in seconds.\"\nThe cybersecurity company said CVE-2025-6018 is present in the PAM configuration of openSUSE Leap 15 and SUSE Linux Enterprise 15, enabling an unprivileged local attacker to elevate to the \"allow_active\" user and call\nPolkit\nactions that are otherwise reserved for a physically present user.\nCVE-2025-6019, on the other hand, affects libblockdev and is exploitable via the\nudisks daemon\nincluded by default on most Linux distributions. It essentially permits an \"allow_active\" user to gain full root privileges by chaining it with CVE-2025-6018.\n\"Although it nominally requires 'allow_active' privileges, udisks ships by default on almost all Linux distributions, so nearly any system is vulnerable,\" Abbasi added. \"Techniques to\ngain 'allow_active,'\nincluding the PAM issue disclosed here, further negate that barrier.\"\nOnce root privileges are obtained, an attacker has carte blanche access to the system, allowing them use it as a springboard for broader post-compromise actions, such as altering security controls and implanting backdoors for covert access.\nQualys said it has developed proof-of-concept (PoC) exploits to confirm the presence of these vulnerabilities on various operating systems, including Ubuntu, Debian, Fedora, and openSUSE Leap 15.\nTo mitigate the risk posed by these flaws, it's essential to apply patches provided by the Linux distribution vendors. As temporary workarounds, users can modify the Polkit rule for \"org.freedesktop.udisks2.modify-device\" to require administrator authentication (\"auth_admin\").\nFlaw Disclosed in Linux PAM\nThe disclosure comes as maintainers of Linux PAM resolved a high-severity path traversal flaw (\nCVE-2025-6020\n, CVSS score: 7.8) that could also allow a local user to escalate to root privileges. The issue has been fixed in version 1.7.1.\n\"The module\npam_namespace\nin linux-pam <= 1.7.0 may access user-controlled paths without proper protections, which allows a local user to elevate their privileges to root via multiple symlink attacks and race conditions,\" Linux PAM maintainer Dmitry V. Levin\nsaid\n.\nLinux systems are vulnerable if they use pam_namespace to set up\npolyinstantiated directories\nfor which the path to either the polyinstantiated directory or instance directory is under user-control. As workarounds for CVE-2025-6020, users can disable pam_namespace or ensure it does not operate on user-controlled paths.\nANSSI's Olivier Bal-Petre, who reported the flaw to the maintainer on January 29, 2025,\nsaid\nusers should also update their namespace.init script if they do not use the one provided by their distribution to ensure that the either of two paths are safe to operate on as root.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "No, the 16 billion credentials leak is not a new data breach",
        "Link": "https://www.bleepingcomputer.com/news/security/no-the-16-billion-credentials-leak-is-not-a-new-data-breach/",
        "Summary": "News broke today of a \"mother of all breaches,\" sparking wide media coverage filled with warnings and fear-mongering. However, it appears to be a compilation of previously leaked credentials stolen by infostealers, exposed in data breaches, and via credential stuffing attacks. [...]",
        "Date": "2025-06-19",
        "Content": "News broke today of a \"mother of all breaches,\" sparking wide media coverage filled with warnings and fear-mongering. However, it appears to be a compilation of previously leaked credentials stolen by infostealers, exposed in data breaches, and via credential stuffing attacks.\nTo be clear, this is not a new data breach, or a breach at all, and the websites involved were not recently compromised to steal these credentials.\nInstead, these stolen credentials were likely circulating for some time, if not for years. It was then collected by a cybersecurity firm, researchers, or threat actors and repackaged into a database that was exposed on the Internet.\nCybernews, which\ndiscovered\nthe briefly exposed compilation, stated it was stored in a format commonly associated with infostealer malware, though they did not share samples\nAn infostealer is malware that attempts to steal credentials, cryptocurrency wallets, and other data from an infected device. Over the years, infostealers have become a massive problem, leading to breaches worldwide.\nThese types of malware impact both Windows and Macs, and when executed, will gather all the credentials it can find stored on a device and save them in what is called a \"log.\"\nAn infostealer log is generally an archive containing numerous text files and other stolen data. The text files contain lists of credentials stolen from browsers, files, and other applications.\nExample infostealer log\nSource: BleepingComputer\nStolen credentials are usually saved one per line in the following format:\nURL:username:password\nSometimes, the delimiter between each component is changed to a comma, semicolon, or dash.\nFor example, the following is how an infostealer will save credentials stolen from a device to a log:\nhttps://www.facebook.com/:jsmith@example.com:Databr3achFUd!\r\nhttps://www.bank.com/login.php:jsmith:SkyIsFa11ing#\r\nhttps://x.com/i/flow/login:jsmith@example.com:StayCalmCarryOn\nIf someone is infected with an infostealer and has a thousand credentials saved in their browser, the infostealer will steal them all and store them in the log. These logs are then uploaded to the threat actor, where the credentials can be used for further attacks or sold on cybercrime marketplaces.\nThe\ninfostealer problem\nhas gotten so bad and pervasive that compromised credentials have become one of the most common ways for threat actors to breach networks.\nWe have a webinar next month titled \"\nStolen credentials: The New Front Door to Your Network\n\" that focuses on infostealers, compromised credentials, and how organizations can protect themselves.\nThis problem has also led law enforcement worldwide to actively crack down on these cybercrime operations in recent actions, such as \"\nOperation Secure\n\" and the\ndisruption of LummaStealer\n.\nAs infostealers have become so abundant and commonly used, threat actors release massive compilations for free on Telegram, Pastebin, and Discord to gain reputation among the cybercrime community or as teasers to paid offerings.\nThreat actors offering infostealer logs for free on Telegram\nSource: BleepingComputer\nTo see how many passwords are given away for free, the single 1,261.4 MB file in the image above contained over 64,000 credential pairs.\nThere are thousands, if not hundreds of thousands, of similarly leaked archives being shared online, resulting in billions of credentials records released for free.\nMany of these free archives were likely compiled into the massive database that was briefly exposed and seen by Cybernews.\nSimilar credential collections were released in the past, such as the\nRockYou2024 leak\n, with over 9 billion records, and \"\nColection #1\n,\" which contained over 22 million unique passwords.\nDespite the buzz, there's no evidence this compilation contains new or previously unseen data\nWhat should you do?\nSo, now that you know there was a massive leak of credentials likely stolen through infostealers, data breaches, and credential-stuffing attacks, you may be wondering what you should do.\nThe most important step is to adopt and maintain good cybersecurity habits you should already be following.\nIf you're concerned that an infostealer might be present on your computer, scan your device with a trusted antivirus program before changing any passwords. Otherwise, newly entered credentials could be stolen as well.\nOnce you're confident your system is clean, focus on improving your password hygiene.\nThat means using a unique, strong password for every site you use, and relying on a password manager to keep them organized and secure.\nHowever, even unique passwords won't help you stay protected if you are hacked, fall for a phishing attack, or install malware.\nTherefore, it is crucial that you also use two-factor authentication (2FA) along with an authentication app, like\nMicrosoft Authenticator\n,\nGoogle Authenticator\n, or\nAuthy\n, to manage your 2FA codes. Some password managers, like Bitwarden and 1Password, also include authentication functionality, allowing you to use one application for both.\nWith 2FA enabled, even if a password at a site is compromised, threat actors cannot access the account without your 2FA code.\nAs a general rule, you should avoid using SMS texts to receive 2FA codes, as threat actors can conduct SIM-swapping attacks to hijack your phone number and obtain them.\nAs for this leak, with this many credentials leaked, there is a chance one of the readers of this article will be listed in the compilation.\nHowever, don't panic and stress about it, running around changing all your passwords. Instead, take this opportunity to improve your cybersecurity habits.\nTo check if your credentials have appeared in known breaches, consider using services like\nHave I Been Pwned\n.\nAnd if you use the same password across multiple sites, now is the time to switch to unique ones.\nThat way, leaks like this become far less dangerous to you.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nThe North Face warns customers of April credential stuffing attack\nWebinar: Stolen credentials are the new front door to your network\nSpecial Webinar: Key Insights from Verizon’s 2025 DBIR\nKrispy Kreme says November data breach impacts over 160,000 people\nHealthcare SaaS firm says data breach impacts 5.4 million patients"
    },
    {
        "Title": "Godfather Android malware now uses virtualization to hijack banking apps",
        "Link": "https://www.bleepingcomputer.com/news/security/godfather-android-malware-now-uses-virtualization-to-hijack-banking-apps/",
        "Summary": "A new version of the Android malware \"Godfather\" creates isolated virtual environments on mobile devices to steal account data and transactions from legitimate banking apps. [...]",
        "Date": "2025-06-19",
        "Content": "A new version of the Android malware \"Godfather\" creates isolated virtual environments on mobile devices to steal account data and transactions from legitimate banking apps.\nThese malicious apps are executed inside a controlled virtual environment on the device, enabling real-time spying, credential theft, and transaction manipulation while maintaining perfect visual deception.\nThe tactic resembles that seen in the\nFjordPhantom\nAndroid malware in late 2023, which also used virtualization to execute SEA bank apps inside containers to evade detection.\nHowever, Godfather's targeting scope is much broader, targeting over 500 banking, cryptocurrency, and e-commerce apps worldwide using a full virtual filesystem, virtual Process ID, intent spoofing, and StubActivity.\nAccording\nto Zimperium\n, which analyzed it, the level of deception is very high. The user sees the real app UI, and the Android protections miss the malicious operation aspect, as only the host app's activities are declared in the manifest.\nVirtualized data theft\nGodfather comes in the form of an APK app containing an embedded virtualization framework, leveraging open-source tools such as the VirtualApp engine and Xposed for hooking.\nOnce active on the device, it checks for installed target apps, and if found, it places it inside its virtual environment and uses a StubActivity to launch it inside the host container.\nA StubActivity is a placeholder activity declared in the app running the virtualization engine (the malware) that acts as a shell or proxy for launching and running activities from virtualized apps.\nIt doesn't contain its own UI or logic and, instead, delegates behavior to the host app, tricking Android into thinking that a legitimate app is being run while actually intercepting and controlling it.\nCreating the virtualized environment\nSource: Zimperium\nWhen the victim launches the real banking app, Godfather's accessibility service permission intercepts the 'Intent' and redirects it to a StubActivity inside the host app, which initiates the virtual version of the banking app inside the container.\nThe user sees the real app interface, but all sensitive data involved in their interactions can be easily hijacked.\nBy using Xposed for API hooking, Godfather can record account credentials, passwords, PINs, touch events, and capture responses from the banking backend.\nNetwork hooks used by Godfather\nSource: Zimperium\nThe malware displays a fake lock screen overlay at key moments to trick the victim into entering their PIN/passwords.\nOnce it has collected and exfiltrated all that data, it awaits commands from the operators to unlock the device, perform UI navigation, open apps, and trigger payments/transfers from inside the real banking app.\nDuring this, the user sees a fake \"update\" screen or a black screen so as not to raise their suspicion.\nEvolving threat\nGodfather first appeared in the Android malware space in March 2021, as discovered by ThreatFabric, and followed an impressive evolutionary trajectory since then.\nThe latest Godfather version constitutes a significant evolution to the last sample\nanalyzed by Group-IB\nin December 2022, which targeted 400 apps and 16 countries using HTML login screen overlays on top of baking and crypto exchange apps.\nAlthough the campaign Zimperium spotted only targets a dozen Turkish bank apps, other Godfather operators may opt to activate other subsets of the 500 targeted apps to attack different regions.\nTo protect yourself from this malware, only download apps from Google Play or APKs from publishers you trust, ensure that Play Protect is active, and pay attention to the requested permissions.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nFBI: BADBOX 2.0 Android malware infects millions of consumer devices\nAndroid malware Crocodilus adds fake contacts to spoof trusted callers\nNorth Korean hackers deepfake execs in Zoom call to spread Mac malware\nThis $60 open box Android tablet deal is great for indoors and outdoors\nNew IOCONTROL malware used in critical infrastructure attacks"
    },
    {
        "Title": "Webinar: Stolen credentials are the new front door to your network",
        "Link": "https://www.bleepingcomputer.com/news/security/webinar-stolen-credentials-are-the-new-front-door-to-your-network/",
        "Summary": "Cybercriminals no longer need zero-days to breach your systems—these days, they just log in. Join BleepingComputer, SC Media, and Specops Software's Darren Siegel on July 9 at 2:00 PM ET for a live webinar on how attackers are using stolen credentials to infiltrate networks and how you can stop them. [...]",
        "Date": "2025-06-19",
        "Content": "Cybercriminals no longer need zero-day exploits or other vulnerabilities to breach your systems—these days, they just log in.\nOn July 9th at 2:00 PM ET, BleepingComputer and SC Media will co-host a live webinar with identity security expert Darren Siegel of Specops Software (part of Outpost24), exploring how threat actors are increasingly breaching networks by simply logging in with stolen credentials.\nThe webinar \"\nStolen credentials: The New Front Door to Your Network\n\" will unpack the real-world mechanics behind credential-based attacks and how to stop them before damage is done.\nSpecops Software, part of Outpost24, brings expertise in password security and authentication controls, helping organizations defend against modern identity threats and credential-based intrusions.\nIn this must-watch webinar, you will learn how attackers are shifting from exploiting vulnerabilities to simply logging in using large-scale credential abuse, with insights into the infostealer economy and how enterprises can defend against these increasingly effective threats.​\nInfostealer malware campaigns have\nexploded in recent years\n, stealing billions of credentials from infected systems and feeding a booming cybercrime marketplace.\nThese types of attacks are becoming the norm, with threat actors regularly buying stolen credentials for as little as a few dollars on Telegram and\ndark web marketplaces\n.\nIn other approaches, credentials are gathered using\npassword-spray attacks against Microsoft 365\n, weak MFA implementations using\nadversary-in-the-middle phishing kits\n, and\nbrute-force VPN portals\nfor initial access.\nThe upcoming webinar will cover:\nHow infostealers harvest and distribute login credentials\nMethods used to bypass MFA and hijack sessions\nTechniques to detect compromised accounts and recover from breaches\nStrategies to harden identity surfaces and prevent lateral movement\nThe event will be hosted by Lawrence Abrams (BleepingComputer), Adrian Sanabria (SC Media), and Darren Siegel from Outpost24, the parent company of Specops Software.\nDon't miss this opportunity to gain real-world insights and defense strategies directly from cybersecurity practitioners.\nRegister now to secure your spot!"
    },
    {
        "Title": "OpenAI’s Sam Altman discusses GPT-5 release date",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openais-sam-altman-discusses-gpt-5-release-date/",
        "Summary": "ChatGPT's next big upgrade, or the new foundational model \"GPT-5,\" is still being prepared for a release in the summer, but OpenAI won't share the specifics. [...]",
        "Date": "2025-06-19",
        "Content": "ChatGPT's next big upgrade, or the new foundational model 'GPT-5,' is being prepared for public release, but OpenAI won't share the specifics.\nIn a\nrecent interview\n, Sam Altman, CEO and co-founder of OpenAI, confirmed that ChatGPT's GPT-5 model release date is sometime in summer, but it depends on a number of factors.\nOpenAI has internal benchmarks and other standards set for GPT-5, and unless those are met, OpenAI might not release the model to the public.\nSam added that he doesn't know 'exactly when' GPT-5 will be rolled out, but there will be significant improvements.\n\"I don't know exactly when. One thing that we go back and forth on is how much are we supposed to, like, turn up the big number on new models versus what we did with GPT-4o, which is just better and better and better,\" he added.\nOpenAI previously confirmed that GPTs and\nOperator will be getting a big upgrade as well\n, and GPT-5 isn't the only model the company is cooking.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nOpenAI hints at a big upgrade for ChatGPT Operator Agent\nOpenAI is hopeful GPT-5 will compete a little more\nOpenAI plans to ship an interesting ChatGPT product by 2026\nOpenAI confirms Operator Agent is now more accurate with o3\nChatGPT will analyze Gmail emails, manage schedule on Google Calendar"
    },
    {
        "Title": "US recovers $225 million of crypto stolen in investment scams",
        "Link": "https://www.bleepingcomputer.com/news/legal/us-recovers-225-million-of-crypto-stolen-in-investment-scams/",
        "Summary": "The U.S. Department of Justice has seized more than $225 million in cryptocurrency linked to investment fraud and money laundering operations, the largest crypto seizure in the history of the U.S. Secret Service. [...]",
        "Date": "2025-06-19",
        "Content": "The U.S. Department of Justice has seized more than $225 million in cryptocurrency linked to investment fraud and money laundering operations, the largest crypto seizure in the history of the U.S. Secret Service.\nThe state's investigators used blockchain analysis to trace the funds stolen from over 400 victims, which were then laundered through a complex network of cryptocurrency addresses to obscure their origin.\n\"The complaint alleges that the cryptocurrency addresses that held the over $225.3 million in cryptocurrency were part of a sophisticated blockchain-based money laundering network that executed hundreds of thousands of transactions and was used to disperse proceeds of cryptocurrency investment fraud across many cryptocurrency addresses and accounts on the blockchain to conceal the source of the illegally obtained funds,\" reads\nan announcement\nby the Department of Justice.\nThe action, which involved the U.S. DOJ, the FBI, the Secret Service, and private partners Tether and TRM Labs, represents the largest cryptocurrency seizure (by amount) in USSS history.\nFunds were consolidated into seven final USDT wallet groups, each holding between $3M and $135M, triggering significant amounts of unnecessary gas fees (up to $125,000) to disrupt traceability.\nTRM found 144 OKX accounts used in the scheme, many tied to Vietnamese 'know your customer' documents where the photos were taken in the same location, strongly suggesting organized fraud ring operations.\nIn one of the seven cases highlighted in the legal complaint, there's the example of an OKX account receiving 3.1 million USDT from a Heartland Tri-State Bank CEO (\"S.H.\").\nThis was just one of the payments that person made to the scammers. In total, S.H. was tricked into wiring $47.1M from his own bank's assets, believing he was making legitimate crypto investments.\nRouting a payment through 16 addresses\nSource: TRM Labs\nDespite the complex obfuscation, the blockchain investigators could still map the laundering network by using LIFO (Last-In-First-Out) tracing to follow funds through 93 scam deposit addresses, then 35 intermediary wallets, and finally consolidated into seven groups.\nStablecoin Tether (USDT) froze the tokens linked to these groups, burned them, and reissued the equivalent amount to the U.S. government, enabling civil forfeiture recovery.\nThis important mechanism may only be used when legal groups for forfeiture exist.\nTo activate it, the U.S. DoJ invoked two federal statutes, namely 18 U.S.C. § 981(a)(1)(A) and 18 U.S.C. § 981(a)(1)(C), which allow forfeiture of property involved in money laundering and derived from wire fraud, respectively.\nThe next step in the process should be to identify victims through a claims process and use the seized amounts for restitution, although no specific announcements were made about this phase.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nFive plead guilty to laundering $36 million stolen in investment scams\nUS arrests suspects behind $73M ‘pig butchering’ laundering scheme\nGermany takes down eXch cryptocurrency exchange, seizes servers\nGrinex exchange suspected rebrand of sanctioned Garantex crypto firm\nPro-Israel hackers hit Iran's Nobitex exchange, burn $90M in crypto"
    },
    {
        "Title": "Special Webinar: Key Insights from Verizon’s 2025 DBIR",
        "Link": "https://www.bleepingcomputer.com/news/security/special-webinar-key-insights-from-verizons-2025-dbir/",
        "Summary": "GenAI, credential theft, third-party risks—Verizon's 2025 DBIR reveals what's putting your org at risk. Join DBIR author Alex Pinto & LayerX CEO Or Eshed as they break down this year's key insights and defense strategies. Don't miss the webinar—register now. [...]",
        "Date": "2025-06-19",
        "Content": "The Verizon Data Breach Investigations Report (DBIR) is one of cybersecurity's most authoritative annual reports. The 2025 DBIR highlights critical trends including rising GenAI-related risks, credential theft, and vulnerabilities from third-party partners.\nLayerX is hosting Alex Pinto, one of the lead authors of the 2025 DBIR for a special webinar to discuss the modern threat landscape and how enterprises should protect themselves.\nRegister directly for the webinar here.\nVerizon DBIR: Critical Stats Every Enterprise Should Know\nAccording to Verizon's DBIR, credential theft and phishing remain among the primary methods attackers use to breach enterprises, highlighting critical security gaps. Ransomware threats continue to escalate, underlining the urgent need for robust defensive measures.\nComplementing these insights, recent LayerX research sheds additional light on risks associated with emerging tools like GenAI:\nSource: Verizon 2025 Data Breach Investigations Report (DBIR)\n72% of GenAI logins occur via personal identities\n, circumventing established corporate security controls and presenting significant access-management challenges.\n60% of corporate account logins to GenAI tools lack single sign-on (SSO)\n, creating vulnerabilities that attackers could exploit.\nOnly 11% of GenAI connections utilize fully secured corporate identities with enforced SSO\n, highlighting a substantial area for security improvement.\nThese findings emphasize why enterprises need an updated, integrated approach to cybersecurity.\nInside the 2025 Verizon DBIR\nJoin Or Eshed, Co-Founder & CEO of LayerX, and Alex Pinto, Verizon DBIR Author, as they break down this year’s most urgent trends from the just-released 2025 Data Breach Investigations Report (DBIR).\nReserve Your Spot\nWhy Your Current Defenses Might Be Leaving You Exposed\nMany enterprises still rely heavily on legacy endpoint and network security solutions, which struggle to provide the necessary visibility and agility required to counter today's threats.\nCyber attackers have adapted, consistently bypassing static and outdated security measures, emphasizing the need for evolving strategies and comprehensive insights.\nHow Verizon’s DBIR Session Helps You to Stay Ahead\nLayerX's hosted session featuring Alex Pinto will offer security professionals direct, actionable insights, including:\nReal-world breach analysis\n: Gain clarity on how threats are evolving through insights from Verizon’s extensive investigative research.\nPractical defensive strategies\n: Learn immediate, implementable steps to strengthen your organization's security posture.\nExpert guidance from Alex Pinto\n: Receive in-depth analysis and expert recommendations from one of the cybersecurity industry's leading analysts.\nRegister Now to Learn Proven Defense Tactics\nGain essential insights from Verizon DBIR author Alex Pinto, joined by LayerX CEO Or Eshed, as they unpack what the 2025 report means for your security strategy.\nDon’t just read the DBIR,\njoin the webinar\nto hear what the latest threats and trends mean for your security strategy.\nSponsored and written by\nLayerX\n."
    },
    {
        "Title": "Microsoft unveils new security defaults for Windows 365 Cloud PCs",
        "Link": "https://www.bleepingcomputer.com/news/security/microsoft-unveils-new-security-defaults-for-windows-365-cloud-pcs/",
        "Summary": "Microsoft has announced new Windows 365 security defaults starting in the second half of 2025 and affecting newly provisioned and reprovisioned Cloud PCs. [...]",
        "Date": "2025-06-19",
        "Content": "Microsoft has announced new Windows 365 security defaults starting in the second half of 2025 and affecting newly provisioned and reprovisioned Cloud PCs.\nThe company said these changes include disabling the clipboard, drive, USB, and printer redirections by default to block users from copying files between Cloud PCs and physical devices through clipboard functions to reduce risks of data theft and block malware attacks.\nHowever, while USB redirections will be disabled by default, they only target low-level device access, which means that USB mice, keyboards, and webcams will not be affected since they're managed through high-level redirection. These new security defaults will also be applied to newly created host pools for Azure Virtual Desktop.\nStarting last month, Microsoft has also enabled virtualization-based security, Credential Guard, and hypervisor-protected code integrity (HVCI) by default on Windows 365 Cloud PCs running Windows 11 gallery images to create secure memory enclaves and prevent malicious code execution at the kernel level.\n\"Windows 365 is enhancing Cloud PC security by having clipboard, drive, USB, and printer redirections disabled by default for all newly provisioned and reprovisioned Cloud PCs,\"\nMicrosoft said\n.\n\"Since May 2025, all newly provisioned and reprovisioned Windows 365 Cloud PCs running a Windows 11 gallery image have VBS, Credential Guard, and HVCI enabled by default.\"\nMicrosoft will also display notification banners in the Intune Admin Center to alert IT administrators about the changes and allow them to override the new defaults using Intune device configuration policies or Group Policy Objects if their end-users require specific redirection capabilities.\nIntune admin center banner about new redirection defaults (Microsoft)\n​\"When new Cloud PCs are provisioned, the new defaults for disabling redirections will be applied,\" the company explained. \"Subsequently, Intune will sync and implement the IT admin's desired settings from the existing policies, overriding the default configurations. This process assumes that the new Cloud PC is being added to an existing group that has been assigned to the relevant policy.\"\nOn Tuesday, Microsoft announced it would begin\nupdating security defaults for all Microsoft 365 tenants\nin July to block access to SharePoint, OneDrive, and Office files via legacy authentication protocols.\nStarting next month, Microsoft 365 will automatically block legacy browser authentication to OneDrive and SharePoint using RPS (Relying Party Suite), together with FPRPC (FrontPage Remote Procedure Call) protocol for Office file opens.\nSince January, the company has also started\ndisabling all ActiveX controls\nin Windows versions of Microsoft 365 and Office 2024 apps and said it will begin rolling out a new Teams feature designed to\nblock screenshots during meetings\nin July.\nMicrosoft also\nannounced\nlast week that it will add .library-ms and .search-ms file types to the list of blocked Outlook attachments starting in July.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMicrosoft Outlook to block more risky attachments used in attacks\nNew Secure Boot flaw lets attackers install bootkit malware, patch now\nMicrosoft fixes unreachable Windows Server domain controllers\nMicrosoft June 2025 Patch Tuesday fixes exploited zero-day, 66 flaws\nMicrosoft unveils free EU cybersecurity program for governments"
    },
    {
        "Title": "ChatGPT will analyze Gmail emails, manage schedule on Google Calendar",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-will-analyze-gmail-emails-manage-schedule-on-google-calendar/",
        "Summary": "ChatGPT appears to be testing support for Gmail and Google Calendar integration. This will allow users to summarise emails and create events. [...]",
        "Date": "2025-06-19",
        "Content": "ChatGPT appears to be testing support for Gmail and Google Calendar integration. This will allow users to summarise emails and create events.\nChatGPT already supports Gmail integration, but it's tied to Deep Research.\nRight now, you can use information from Gmail in your Deep Research reports, but it's not possible to pull up emails from Gmail and summarise them.\nAs\nspotted\nby Tibor on X, ChatGPT is now actively testing support for integrating Gmail and Calendar, so you can stay \"organized.\"\nOnce the feature rolls out, you'll be able to use ChatGPT to analyze email, create a response to the email, turn emails into a story, and then make schedules directly from ChatGPT.\nAI researcher Tibor told me that the feature could be tied to ChatGPT Search feature, as indicated by one of the FAQ pages:\nChatGPT FAQ hints at Google services integration for Search\nOpenAI could formally announce the integration in the coming days.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nGoogle Gemini AI is getting ChatGPT-like Scheduled Actions feature\nOpenAI’s Sam Altman discusses GPT-5 release date\nOpenAI confirms threat actors use ChatGPT to write malware\nChatGPT's AI coder Codex now lets you choose the best solution\nChatGPT o3 API 80% price drop has no impact on performance"
    },
    {
        "Title": "DuckDuckGo beefs up scam defense to block fake stores, crypto sites",
        "Link": "https://www.bleepingcomputer.com/news/security/duckduckgo-beefs-up-scam-defense-to-block-fake-stores-crypto-sites/",
        "Summary": "The DuckDuckGo web browser has expanded its built-in Scam Blocker tool to protect against a broader range of online scams, including fake e-commerce, cryptocurrency exchanges, and \"scareware\" sites. [...]",
        "Date": "2025-06-19",
        "Content": "The DuckDuckGo web browser has expanded its built-in Scam Blocker tool to protect against a broader range of online scams, including fake e-commerce, cryptocurrency exchanges, and \"scareware\" sites.\nDuckDuckGo is a privacy-focused web browser and search engine that doesn't track users' searchers or browsing history.\nThe browser, which became available as a public beta for\nmacOS\nand\nWindows\nin October 2022 and June 2023, respectively, blocks all trackers by default, does not engage in personalized search profiling, and offers powerful anonymity tools.\nScam Blocker has been a component of the browser's privacy toolkit since its launch in 2018, protecting users attempting to visit known malware distribution and phishing URLs.\nAs part of the\nlatest update\n, in addition to blocking phishing sites and malware, Scam Blocker now also detect and block the following:\nFake e-commerce stores\nScam investment\nand crypto trading sites\nSurvey scams with false cash rewards\nScareware (fake virus alerts prompting\nbogus tech support\n)\nMalvertising\n(malicious tracker-powered ads)\nWhen the user attempts to load a webpage, the tool scans the URLs locally against a continually updated (every 20 minutes) threat list supplied by cybersecurity firm Netcraft.\nRare or unknown threats are checked against DuckDuckGo servers using an\nanonymous cryptographic process\n, ensuring that this process doesn't compromise user privacy.\nWhen a scam site is detected, users are served a prominent warning message giving them the option to leave or ignore it and proceed to the risky site.\nDuckDuckGo's Scam Blocker warning on the desktop (left) and on mobile (right)\nSource: DuckDuckGo\nDuckDuckGo notes that, unlike Chrome, Safari, or Firefox, which rely on Google Safe Browsing and hence share data with Google, Scam Blocker offers privacy-first protection with no external data sharing.\nScam Blocker is activated in the browser by default and requires no account to work effectively.\nPrivacy Pro subscribers get a significant perk, as Scam Blocker will work across any internet apps on their devices when the\nDuckDuckGo VPN\nis active, covering other browsers as well.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nInstagram ads mimicking BMO, EQ Bank are finance scams\nFive plead guilty to laundering $36 million stolen in investment scams\nFBI warns of NFT airdrop scams targeting Hedera Hashgraph wallets\nApple Safari exposes users to fullscreen browser-in-the-middle attacks\nGoogle Chrome to use on-device AI to detect tech support scams"
    },
    {
        "Title": "Telecom giant Viasat breached by China's Salt Typhoon hackers",
        "Link": "https://www.bleepingcomputer.com/news/security/telecom-giant-viasat-breached-by-chinas-salt-typhoon-hackers/",
        "Summary": "Satellite communications company Viasat is the latest victim of China's Salt Typhoon cyber-espionage group, which has previously hacked into the networks of multiple other telecom providers in the United States and worldwide. [...]",
        "Date": "2025-06-19",
        "Content": "Satellite communications company Viasat is the latest victim of China's Salt Typhoon cyber-espionage group, which has previously hacked into the networks of multiple other telecom providers in the United States and worldwide.\nViasat provides satellite broadband services to governments worldwide and aviation, military, energy, maritime, and enterprise customers. Last month, the telecom giant\ntold\nshareholders that it had approximately 189,000 broadband subscribers in the United States.\nThe company discovered the Salt Typhoon breach earlier this year and has been working with federal authorities to investigate the attack, as\nBloomberg\nfirst reported.\n\"Viasat and its independent third-party cybersecurity partner investigated a report of unauthorized access through a compromised device. Upon completing a thorough investigation, no evidence was found to suggest any impact to customers,\" Viasat told BleepingComputer.\n\"Viasat engaged with government partners as part of its investigation. Due to the sensitive nature of information sharing with government partners, we are unable to provide further details. Viasat believes that the incident has been remediated and has not detected any recent activity related to this event.\"\nBleepingComputer first contacted Viasat in February with questions regarding a potential breach, but received no reply at the time.\nRussian hackers also breached Viasat's KA-SAT consumer-oriented satellite broadband service in February 2022, wiping satellite modems\nusing AcidRain data wiper malware\nroughly one hour before Russia invaded Ukraine.\nThe 2022 cyberattack impacted tens of thousands of broadband customers in Ukraine and Europe, including modems controlling\nroughly 5,800 wind turbines in Germany\n.\nSalt Typhoon telecom breaches\nAs the FBI and CISA\nconfirmed\nin October, the Chinese Salt Typhoon state hackers had breached multiple telecom providers (including AT&T, Verizon, Lumen, Charter Communications, Consolidated Communications, and Windstream) and other telecom companies in\ndozens of countries\n.\nWhile inside U.S. telecom networks, the attackers also accessed the\nU.S. law enforcement's wiretapping platform\nand gained access to the \"private communications\" of a \"limited number\" of U.S. government officials.\nEarlier this month, NSA and CISA officials\nalso tagged\nComcast and Digital Realty as potentially compromised in Salt Typhoon's telecom attacks.\nSalt Typhoon has been breaching government organizations and telecom companies since at least 2019 and kept\nactively targeting telecoms\nbetween December 2024 and January 2025, breaching more telecommunications providers worldwide via unpatched Cisco IOS XE network devices.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nFBI seeks help to unmask Salt Typhoon hackers behind telecom breaches\nWashington Post's email system hacked, journalists' accounts compromised\nSentinelOne shares new details on China-linked breach attempt\nGermany fines Vodafone $51 million for privacy, security breaches\nCzechia blames China for Ministry of Foreign Affairs cyberattack"
    },
    {
        "Title": "Krispy Kreme says November data breach impacts over 160,000 people",
        "Link": "https://www.bleepingcomputer.com/news/security/krispy-kreme-says-november-data-breach-impacts-over-160-000-people/",
        "Summary": "U.S. doughnut chain Krispy Kreme confirmed that attackers stole the personal information of over 160,000 individuals in a November 2024 cyberattack. [...]",
        "Date": "2025-06-19",
        "Content": "U.S. doughnut chain Krispy Kreme confirmed that attackers stole the personal information of over 160,000 individuals in a November 2024 cyberattack.\nThe American multinational coffeehouse chain employed 22,800 people in 40 countries as of December 2023 and operates 1,521 shops and 15,800 points of access.\nIt also manages four \"Doughnut Factories\" in the United States and 37 others internationally, and it\npartners with McDonald's\nto have its products sold in thousands of McDonald's locations worldwide.\nThis week, in a\nfiling\nwith Maine's Office of the Attorney General, Krispy Kreme revealed that the November data breach had affected 161,676 individuals.\n\"On May 22, 2025, we determined that certain of your personal information was impacted by this incident,\" it told affected individuals in breach notification letters sent to impacted people. \"There is no evidence that your information has been misused, and we are not aware of any reports of identity theft or fraud as a direct result of this incident.\nWhile the company didn't reveal what data was exposed in the incident, a separate filing with Massachusetts' Attorney General discloses that stolen documents contained affected individuals' social security numbers, financial account information, and driver's license information.\nKrispy Kreme detected unauthorized activity on its IT systems on November 29 and\ndisclosed the incident\n, along with disruptions to its online ordering, in an SEC filing filed on December 11.\nThe company also took measures to contain the breach and hired external cybersecurity experts to assess the attack's full impact on its operations.\nBreach claimed by Play ransomware\nWhile Krispy Kreme has yet to share additional details regarding the November breach, the\nPlay ransomware gang claimed responsibility\nfor the attack in late December, saying they also stole data from the company's network.\nPlay ransomware claimed, without proof, that the allegedly stolen files contain \"private and personal confidential data, client documents, budget, payroll, accounting, contracts, taxes, IDs, finance information,\" and more.\nKrispy Kreme entry on Play ransomware's leak site (BleepingComputer)\nAfter negotiations with the company failed, the ransomware gang released multiple archives containing hundreds of GBs of documents on its dark web leak site on December 21.\nThe\nPlay ransomware operation\nemerged in June 2022, and its operators are known for stealing sensitive data from compromised systems and using double-extortion tactics to pressure victims into paying a ransom under the threat of leaking the stolen data online.\nNotable victims include cloud computing company\nRackspace\n, car retailer giant\nArnold Clark\n, the\nCity of Oakland\nin California,\nDallas County\n, the\nBelgian city of Antwerp\n, and, most recently, American semiconductor supplier\nMicrochip Technology\n.\nIn December, the FBI\nissued a joint advisory\nwith CISA and the Australian Cyber Security Centre, warning that the Play ransomware gang had breached around 300 organizations globally as of October 2023.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nBaltimore City Public Schools data breach affects over 31,000 people\nSensata Technologies says personal data stolen by ransomware gang\nKettering Health confirms Interlock ransomware behind cyberattack\nMedia giant Lee Enterprises says data breach affects 39,000 people\nFBI: Play ransomware breached 900 victims, including critical orgs"
    },
    {
        "Title": "Ryuk ransomware’s initial access expert extradited to the U.S.",
        "Link": "https://www.bleepingcomputer.com/news/security/ryuk-ransomwares-initial-access-expert-extradited-to-the-us/",
        "Summary": "A member of the notorious Ryuk ransomware operation who specialized in gaining initial access to corporate networks has been extradited to the United States. [...]",
        "Date": "2025-06-19",
        "Content": "A member of the notorious Ryuk ransomware operation who specialized in gaining initial access to corporate networks has been extradited to the United States.\nThe suspect is a 33-year-old foreign man who was arrested in April 2025 in his home in Kyiv at the request of the FBI. He was extradited to the United States yesterday, June 18.\nIn 2023, the Ukrainian cyber police, the National Police, and international law enforcement partners began investigating a ransomware operation whose members carried out attacks on companies in France, Norway, Germany, the Netherlands, Canada, and the USA.\nThis operation led to\nthe identification, seizure of devices, and arrest\nof multiple cybercriminals residing in Ukraine for their involvement in the LockerGoga, MegaCortex, Hive, and Dharma ransomware families.\nIn an announcement, Ukraine's National Police says the investigation also allowed them to identify a Ryuk ransomware member who specialized in gaining access to corporate networks and then handing it off to other members to steal data and deploy the ransomware.\n\"Through the analysis of the information obtained as a result of the investigative actions, it was possible to additionally identify a 33-year-old member of the group who was engaged in searching for vulnerabilities in the corporate networks of the victim companies,\" reads the\nannouncement\n.\n\"The data obtained by the hacker was used by his accomplices to plan and carry out cyberattacks.\"\nWhile the name of the 33-year-old man is currently unknown, Ukraine says that the suspect was previously placed on an international wanted list by the FBI and was charged with numerous crimes by the United States.\nThe Ryuk ransomware gang was active between 2018 and the middle of 2020, when it was responsible for numerous attacks on organizations across almost all sectors,\nincluding healthcare\nduring the Covid pandemic.\nIn 2020, the ransomware gang\nrebranded as the Conti ransomware operation\n, which became one of the most active gangs at the time.\nIn 2022, the\nConti ransomware gang shut down\n, splintering into numerous groups, with some still active today.\nResearchers previously tracked ransom payments to the cybercrime operation and estimate that\nRyuk earned $150 million\nwhile active.\nBleepingComputer contacted the Department of Justice with questions about the extradition and will update the story if we receive a response.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nPolice arrest Conti and LockBit ransomware crypter specialist\nOperation Secure disrupts global infostealer malware operations\nGermany doxxes Conti ransomware and TrickBot ring leader\nPolice takes down AVCheck site used by cybercriminals to scan malware\nMoldova arrests suspect linked to DoppelPaymer ransomware attacks"
    },
    {
        "Title": "Security Evolution: From Pothole Repair to Road Building",
        "Link": "https://www.darkreading.com/cloud-security/security-evolution-pothole-repair-road-building",
        "Summary": "Instead of constantly fixing security vulnerabilities, organizations should proactively build secure foundations that enable businesses to move faster while reducing risk.",
        "Date": "2025-06-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/security-evolution-pothole-repair-road-building"
    },
    {
        "Title": "Scammers Spread False Support Info Using Legitimate Websites",
        "Link": "https://www.darkreading.com/cloud-security/scammers-spread-false-support-info-legitimate-websites",
        "Summary": "In a new wrinkle on the tech support scam front, these search parameter injection attacks dupe victims into believing they are receiving technical help when they are actually speaking to fraudsters.",
        "Date": "2025-06-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/scammers-spread-false-support-info-legitimate-websites"
    },
    {
        "Title": "Paragon Commercial Spyware Infects Prominent Journalists",
        "Link": "https://www.darkreading.com/data-privacy/paragon-commercial-spyware-prominent-journalists",
        "Summary": "An unnamed customer of Paragon's Graphite product used the commercial spyware to target at least two prominent European journalists in recent months.",
        "Date": "2025-06-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/data-privacy/paragon-commercial-spyware-prominent-journalists"
    },
    {
        "Title": "Iran-Israel War Triggers a Maelstrom in Cyberspace",
        "Link": "https://www.darkreading.com/threat-intelligence/iran-israel-war-maelstrom-cyberspace",
        "Summary": "As Iran closes its cyberspace to the outside world, hacktivists are picking sides, while attacks against Israel surge and spread across the region.",
        "Date": "2025-06-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/iran-israel-war-maelstrom-cyberspace"
    },
    {
        "Title": "Predatory Sparrow Burns $90 Million on Iranian Crypto Exchange in Cyber Shadow War",
        "Link": "https://www.securityweek.com/predatory-sparrow-burns-90-million-on-iranian-crypto-exchange-in-cyber-shadow-war/",
        "Summary": "<p>Israel-linked Predatory Sparrow hackers torched more than $90 million at Iran’s largest cryptobank as Israel-Iran cyberwar escalates.</p>\n<p>The post <a href=\"https://www.securityweek.com/predatory-sparrow-burns-90-million-on-iranian-crypto-exchange-in-cyber-shadow-war/\">Predatory Sparrow Burns $90 Million on Iranian Crypto Exchange in Cyber Shadow War</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/predatory-sparrow-burns-90-million-on-iranian-crypto-exchange-in-cyber-shadow-war/"
    },
    {
        "Title": "New Campaigns Distribute Malware via Open Source Hacking Tools",
        "Link": "https://www.securityweek.com/new-campaigns-distribute-malware-via-open-source-hacking-tools/",
        "Summary": "<p>Trend Micro and ReversingLabs uncovered over 100 GitHub accounts distributing malware embedded in open source hacking tools.</p>\n<p>The post <a href=\"https://www.securityweek.com/new-campaigns-distribute-malware-via-open-source-hacking-tools/\">New Campaigns Distribute Malware via Open Source Hacking Tools</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/new-campaigns-distribute-malware-via-open-source-hacking-tools/"
    },
    {
        "Title": "Chain IQ, UBS Data Stolen in Ransomware Attack",
        "Link": "https://www.securityweek.com/chain-iq-ubs-data-stolen-in-ransomware-attack/",
        "Summary": "<p>A ransomware group has claimed the theft of millions of files from procurement service provider Chain IQ and 19 other companies.</p>\n<p>The post <a href=\"https://www.securityweek.com/chain-iq-ubs-data-stolen-in-ransomware-attack/\">Chain IQ, UBS Data Stolen in Ransomware Attack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chain-iq-ubs-data-stolen-in-ransomware-attack/"
    },
    {
        "Title": "Encryption Backdoors: The Security Practitioners’ View",
        "Link": "https://www.securityweek.com/encryption-backdoors-the-security-practitioners-view/",
        "Summary": "<p>After decades of failed attempts to access encrypted communications, governments are shifting from persuasion to coercion—security experts say the risks are too high.</p>\n<p>The post <a href=\"https://www.securityweek.com/encryption-backdoors-the-security-practitioners-view/\">Encryption Backdoors: The Security Practitioners’ View</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/encryption-backdoors-the-security-practitioners-view/"
    },
    {
        "Title": "Krispy Kreme Confirms Data Breach After Ransomware Attack",
        "Link": "https://www.securityweek.com/krispy-kreme-confirms-data-breach-after-ransomware-attack/",
        "Summary": "<p>Krispy Kreme is sending notifications to thousands of people impacted by the data breach that came to light at the end of 2024.</p>\n<p>The post <a href=\"https://www.securityweek.com/krispy-kreme-confirms-data-breach-after-ransomware-attack/\">Krispy Kreme Confirms Data Breach After Ransomware Attack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/krispy-kreme-confirms-data-breach-after-ransomware-attack/"
    },
    {
        "Title": "Choosing a Clear Direction in the Face of Growing Cybersecurity Demands",
        "Link": "https://www.securityweek.com/choosing-a-clear-direction-in-the-face-of-growing-cybersecurity-demands/",
        "Summary": "<p>In a rapidly changing AI environment, CISOs are worried about investing in the wrong solution or simply not investing because they can’t decide what the best option is.</p>\n<p>The post <a href=\"https://www.securityweek.com/choosing-a-clear-direction-in-the-face-of-growing-cybersecurity-demands/\">Choosing a Clear Direction in the Face of Growing Cybersecurity Demands</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/choosing-a-clear-direction-in-the-face-of-growing-cybersecurity-demands/"
    },
    {
        "Title": "High-Severity Vulnerabilities Patched by Cisco, Atlassian",
        "Link": "https://www.securityweek.com/high-severity-vulnerabilities-patched-by-cisco-atlassian/",
        "Summary": "<p>Cisco has resolved a high-severity vulnerability in Meraki MX and Meraki Z devices. Atlassian pushed patches for multiple third-party dependencies.</p>\n<p>The post <a href=\"https://www.securityweek.com/high-severity-vulnerabilities-patched-by-cisco-atlassian/\">High-Severity Vulnerabilities Patched by Cisco, Atlassian</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/high-severity-vulnerabilities-patched-by-cisco-atlassian/"
    },
    {
        "Title": "Swedish Truck Giant Scania Investigating Hack",
        "Link": "https://www.securityweek.com/swedish-truck-giant-scania-investigating-hack/",
        "Summary": "<p>A hacker is selling allegedly valuable data stolen from Scania, but the truck maker believes impact is very limited.</p>\n<p>The post <a href=\"https://www.securityweek.com/swedish-truck-giant-scania-investigating-hack/\">Swedish Truck Giant Scania Investigating Hack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/swedish-truck-giant-scania-investigating-hack/"
    }
]