[
    {
        "Title": "FBI Warns of Scattered Spider's Expanding Attacks on Airlines Using Social Engineering",
        "Link": "https://thehackernews.com/2025/06/fbi-warns-of-scattered-spiders.html",
        "Summary": "The U.S. Federal Bureau of Investigation (FBI) has revealed that it has observed the notorious cybercrime group Scattered Spider broadening its targeting footprint to strike the airline sector.\nTo that end, the agency said it's actively working with aviation and industry partners to combat the activity and help victims.\n\"These actors rely on social engineering techniques, often impersonating",
        "Date": "2025-06-28",
        "Content": "The U.S. Federal Bureau of Investigation (FBI) has revealed that it has observed the notorious cybercrime group\nScattered Spider\nbroadening its targeting footprint to strike the airline sector.\nTo that end, the agency said it's actively working with aviation and industry partners to combat the activity and help victims.\n\"These actors rely on social engineering techniques, often impersonating employees or contractors to deceive IT help desks into granting access,\" the FBI\nsaid\nin a post on X. \"These techniques frequently involve methods to bypass multi-factor authentication (MFA), such as convincing help desk services to add unauthorized MFA devices to compromised accounts.\"\nScattered Spider attacks are also known to target third-party IT providers to obtain access to large organizations, putting trusted vendors and contractors at risk of potential attacks. The attacks typically pave the way for data theft, extortion, and ransomware.\nIn a statement shared on LinkedIn, Palo Alto Networks Unit 42's Sam Rubin\nconfirmed\nthe threat actor's attacks against the aviation industry, urging organizations to be on \"high alert\" for advanced social engineering attempts and suspicious multi-factor authentication (MFA) reset requests\nGoogle-owned Mandiant, which\nrecently warned\nof Scattered Spider's targeting of the U.S. insurance sector, also echoed the warning, stating it's aware of multiple incidents in the airline and transportation verticals that resemble the modus operandi of the hacking crew.\n\"We recommend that the industry immediately take steps to tighten up their help desk identity verification processes prior to adding new phone numbers to employee/contractor accounts (which can be used by the threat actor to perform self-service password resets), reset passwords, add devices to MFA solutions, or provide employee information (e.g. employee IDs) that could be used for a subsequent social engineering attacks,\" Mandiant's Charles Carmakal\nsaid\n.\nOne reason Scattered Spider continues to succeed is how well it understands human workflows. Even when technical defenses like MFA are in place, the group focuses on the people behind the systems—knowing that help desk staff, like anyone else, can be caught off guard by a convincing story.\nThis isn't about brute-force hacking; it's about building trust just long enough to sneak in. And when time is short or pressure is high, it's easy to see how a fake employee request could slip through. That's why organizations should look beyond traditional endpoint security and rethink how identity verification happens in real time.\nThe activity tracked as Scattered Spider overlaps with threat clusters such as Muddled Libra, Octo Tempest, Oktapus, Scatter Swine, Star Fraud, and UNC3944. The group, originally known for its SIM swapping attacks, counts social engineering, helpdesk phishing, and insider access among its roster of initial access techniques to penetrate hybrid environments.\n\"Scattered Spider represents a major evolution in ransomware risk, combining deep social engineering, layered technical sophistication, and rapid double‑extortion capabilities,\" Halcyon\nsaid\n. \"In a matter of hours, the group can breach, establish persistent access, harvest sensitive data, disable recovery mechanisms, and detonate ransomware across both on‑premises and cloud environments.\"\nWhat makes this group especially dangerous is its mix of patient planning and sudden escalation. Scattered Spider doesn't just rely on stolen credentials—it spends time gathering intel on its targets, often combining social media research with public breach data to impersonate people with scary accuracy. This kind of hybrid threat, blending business email compromise (BEC) techniques with cloud infrastructure sabotage, can fly under the radar until it's too late.\nScattered Spider is part of an amorphous collective called the Com (aka Comm), which also counts other groups like\nLAPSUS$\n. It's assessed to be\nactive at least since 2021\n.\n\"This group evolved in the Discord and Telegram communication platforms, drawing in members from diverse backgrounds and interests,\" Unit 42\nsaid\n. \"The loose-knit and fluid nature of this group makes it inherently difficult to disrupt.\"\nIn a report published Friday, ReliaQuest detailed how Scattered Spider actors breached an unnamed organization late last month by targeting its chief financial officer (CFO), and abused their elevated access to conduct an extremely precise and calculated attack.\nThe threat actors have been found to carry out extensive reconnaissance to single out high-value individuals, especially impersonating the CFO in a call to the company's IT help desk and persuading them to reset the MFA device and credentials tied to their account.\nThe attackers also leveraged the information obtained during reconnaissance to enter the CFO's date of birth and the last four digits of their Social Security Number (SSN) into the company's public login portal as part of their login flow, ultimately confirming their employee ID and validating the gathered information.\n\"Scattered Spider favors C-Suite accounts for two key reasons: They're often over-privileged, and IT help-desk requests tied to these accounts are typically treated with urgency, increasing the likelihood of successful social engineering,\" the company\nsaid\n. \"Access to these accounts gives Scattered Spider a pathway into critical systems, making reconnaissance a cornerstone of its tailored attack plans.\"\nArmed with access to the CFO's account, Scattered Spider actors performed a series of actions on the target environment that demonstrated its ability to adapt and rapidly escalate their attack -\nConduct Entra ID enumeration on privileged accounts, privileged groups, and\nservice principals\nfor privilege escalation and persistence\nPerform SharePoint discovery to locate sensitive files and collaborative resources, and gain deeper insights about the organization's workflows and IT and cloud architectures so as to tailor their attack\nInfiltrate the Horizon Virtual Desktop Infrastructure (VDI) platform using the CFO's stolen credentials and compromising two additional accounts via social engineering, extract sensitive information, and establish a foothold in the virtual environment\nBreach the organization's VPN infrastructure to secure uninterrupted remote access to internal resources\nReinstate previously decommissioned virtual machines (VMs) and create new ones to access the VMware vCenter infrastructure, shut down a virtualized production domain controller, and extract the contents of the\nNTDS.dit database file\nUse their elevated access to crack open CyberArk password vault and obtain more than 1,400 secrets\nAdvance the intrusion further using the privileged accounts, including assigning administrator roles to compromised user accounts\nUse legitimate tools like ngrok to set up persistence to VMs under their control\nResort to a \"scorched-earth\" strategy after its presence was detected by the organization's security team, prioritizing \"speed over stealth\" to deliberately delete Azure Firewall policy rule collection groups, hampering regular business operations\nReliaQuest also described what was essentially a tug-of-war between the incident response team and the threat actors for the control of the\nGlobal Administrator role\nwithin the Entra ID tenant, a battle that only ended after Microsoft itself stepped in to restore control over the tenant.\nThe bigger picture here is that social engineering attacks are no longer just phishing emails—they've evolved into full-blown identity threat campaigns, where attackers follow detailed playbooks to bypass every layer of defense. From SIM swapping to vishing and privilege escalation, Scattered Spider shows how quickly attackers can move when the path is clear.\nFor most companies, the first step isn't buying new tools—it's tightening internal processes, especially for things like help desk approvals and account recovery. The more you rely on people for identity decisions, the more important it becomes to train them with real-world examples.\n\"Scattered Spider's initial access methods expose a critical weakness in many organizations: Reliance on human-centric workflows for identity verification,\" security researchers Alexa Feminella and James Xiang said.\n\"By weaponizing trust, the group bypassed strong technical defenses and demonstrated how easily attackers can manipulate established processes to achieve their goals. This vulnerability highlights the urgent need for businesses to reevaluate and strengthen ID verification protocols, reducing the risk of human error as a gateway for adversaries.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "GIFTEDCROOK Malware Evolves: From Browser Stealer to Intelligence-Gathering Tool",
        "Link": "https://thehackernews.com/2025/06/giftedcrook-malware-evolves-from.html",
        "Summary": "The threat actor behind the GIFTEDCROOK malware has made significant updates to turn the malicious program from a basic browser data stealer to a potent intelligence-gathering tool.\n\"Recent campaigns in June 2025 demonstrate GIFTEDCROOK's enhanced ability to exfiltrate a broad range of sensitive documents from the devices of targeted individuals, including potentially proprietary files and",
        "Date": "2025-06-28",
        "Content": "The threat actor behind the GIFTEDCROOK malware has made significant updates to turn the malicious program from a basic browser data stealer to a potent intelligence-gathering tool.\n\"Recent campaigns in June 2025 demonstrate GIFTEDCROOK's enhanced ability to exfiltrate a broad range of sensitive documents from the devices of targeted individuals, including potentially proprietary files and browser secrets,\" Arctic Wolf Labs\nsaid\nin a report published this week.\n\"This shift in functionality, combined with the content of its phishing lures, [...] suggests a strategic focus on intelligence gathering from Ukrainian governmental and military entities.\"\nGIFTEDCROOK was\nfirst documented\nby the Computer Emergency Response Team of Ukraine (CERT-UA) in early April 2025 in connection with a campaign targeting military entities, law enforcement agencies, and local self-government bodies.\nThe activity, attributed to a hacking group it tracks as UAC-0226, involves the use of phishing emails containing macro-laced Microsoft Excel documents that act as a conduit to deploy GIFTEDCROOK.\nAn information stealer at its core, the malware is designed to steal cookies, browsing history, and authentication data from popular web browsers such as Google Chrome, Microsoft Edge, and Mozilla Firefox.\nArctic Wolf's analysis of the artifacts has revealed that the stealer started off as a demo in February 2025, before gaining new features with versions 1.2 and 1.3.\nThese new iterations include the ability to harvest documents and files below 7 MB in size, specifically looking for files created or modified within the last 45 days. The malware specifically searches for the following extensions: .doc, .docx, .rtf, .pptx, .ppt, .csv, .xls, .xlsx, .jpeg, .jpg, .png, .pdf, .odt, .ods, .rar, .zip, .eml, .txt, .sqlite, and .ovpn.\nThe email campaigns leverage military-themed PDF lures to entice users into clicking on a Mega cloud storage link that hosts a macro-enabled Excel workbook (\"Список оповіщених військовозобов'язаних організації 609528.xlsm\"), causing GIFTEDCROOK to be downloaded when the recipient turns on macros. Many users don't realize how common macro-enabled Excel files are in phishing attacks. They slip past defenses because people often expect spreadsheets in work emails—especially ones that look official or government-related.\nThe captured information is bundled into a ZIP archive and exfiltrated to an attacker-controlled Telegram channel. If the total archive size exceeds 20 MB, it is broken down into multiple parts. By sending stolen ZIP archives in small chunks, GIFTEDCROOK avoids detection and skips around traditional network filters. In the final stage, a batch script is executed to erase traces of the stealer from the compromised host.\nThis isn't just about stealing passwords or tracking online behavior—it's targeted cyber espionage. The malware's new ability to sift through recent files and grab documents like PDFs, spreadsheets, and even VPN configs points to a bigger goal: collecting intelligence. For anyone working in public sector roles or handling sensitive internal reports, this kind of document stealer poses a real risk—not just to the individual, but to the entire network they're connected to.\n\"The timing of the campaigns discussed in this report demonstrates clear alignment with geopolitical events, particularly the recent negotiations between Ukraine and Russia in Istanbul,\" Arctic Wolf said.\n\"The progression from simple credential theft in GIFTEDCROOK version 1, to comprehensive document and data exfiltration in versions 1.2 and 1.3, reflects coordinated development efforts where malware capabilities followed geopolitical objectives to enhance data collection from compromised systems in Ukraine.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Facebook’s New AI Tool Asks to Upload Your Photos for Story Ideas, Sparking Privacy Concerns",
        "Link": "https://thehackernews.com/2025/06/facebooks-new-ai-tool-requests-photo.html",
        "Summary": "Facebook, the social network platform owned by Meta, is asking for users to upload pictures from their phones to suggest collages, recaps, and other ideas using artificial intelligence (AI), including those that have not been directly uploaded to the service.\nAccording to TechCrunch, which first reported the feature, users are being served a new pop-up message asking for permission to \"allow",
        "Date": "2025-06-28",
        "Content": "Facebook, the social network platform owned by Meta, is asking for users to upload pictures from their phones to suggest collages, recaps, and other ideas using artificial intelligence (AI), including those that have not been directly uploaded to the service.\nAccording to TechCrunch, which\nfirst reported\nthe feature, users are being served a new pop-up message asking for permission to \"allow cloud processing\" when they are attempting to create a new Story on Facebook.\n\"To create ideas for you, we'll select media from your camera roll and upload it to our cloud on an ongoing basis, based on info like time, location or themes,\" the company notes in the pop-up. \"Only you can see suggestions. Your media won't be used for ads targeting. We'll check it for safety and integrity purposes.\"\nShould users consent to their photos being processed on the cloud, Meta also states that they are agreeing to its\nAI terms\n, which allow it to analyze their media and facial features.\nOn a help page, Meta\nsays\n\"this feature isn't yet available for everyone,\" and that it's limited to users in the United States and Canada. It also pointed out to TechCrunch that these AI suggestions are opt-in and can be disabled at any time.\nThe development is yet another example of how companies are racing to integrate AI features into their products, oftentimes at the cost of user privacy.\nMeta says its new AI feature won't be used for targeted ads, but experts still have concerns. When people upload personal photos or videos—even if they agree to it—it's unclear how long that data is kept or who can see it. Since the processing happens in the cloud, there are risks, especially with things like facial recognition and hidden details such as time or location.\nEven if it's not used for ads, this kind of data could still end up in training datasets or be used to build user profiles. It's a bit like handing your photo album to an algorithm that quietly learns your habits, preferences, and patterns over time.\nLast month, Meta\nbegan\nto train its AI models using public data shared by adults across its platforms in the European Union after it\nreceived approval\nfrom the Irish Data Protection Commission (DPC). The company\nsuspended\nthe use of generative AI tools in Brazil in July 2024 in response to\nprivacy concerns\nraised by the government.\nThe social media giant has also added AI features to WhatsApp, the most recent being the ability to\nsummarize unread messages\nin chats using a privacy-focused approach it calls Private Processing.\nThis change is part of a bigger trend in generative AI, where tech companies mix convenience with tracking. Features like auto-made collages or smart story suggestions may seem helpful, but they rely on AI that watches how you use your devices—not just the app. That's why privacy settings, clear consent, and limiting data collection are more important than ever.\nFacebook's AI feature also comes as one of Germany's data protection watchdogs called on Apple and Google to remove DeepSeek's apps from their respective app stores due to unlawful user data transfers to China, following\nsimilar\nconcerns\nraised by\nseveral countries\nat the start of the year.\n\"The service processes extensive personal data of the users, including all text entries, chat histories and uploaded files as well as information about the location, the devices used and networks,\" according to a\nstatement\nreleased by the Berlin Commissioner for Data Protection and Freedom of Information. \"The service transmits the collected personal data of the users to Chinese processors and stores it on servers in China.\"\nThese transfers violate the General Data Protection Regulation (\nGDPR\n) of the European Union, given the lack of guarantees that the data of German users in China are protected at a level equivalent to the bloc.\nEarlier this week, Reuters\nreported\nthat the Chinese AI company is assisting the country's military and intelligence operations, and that it's sharing user information with Beijing, citing an anonymous U.S. Department of State official.\nA couple of weeks ago, OpenAI also\nlanded\na $200 million with the U.S. Department of Defense (DoD) to \"develop prototype frontier AI capabilities to address critical national security challenges in both warfighting and enterprise domains.\"\nThe company\nsaid\nit will help the Pentagon \"identify and prototype how frontier AI can transform its administrative operations, from improving how service members and their families get health care, to streamlining how they look at program and acquisition data, to supporting proactive cyber defense.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    }
]