[
    {
        "Title": "Over 70 Organizations Across Multiple Sectors Targeted by China-Linked Cyber Espionage Group",
        "Link": "https://thehackernews.com/2025/06/over-70-organizations-across-multiple.html",
        "Summary": "The reconnaissance activity targeting American cybersecurity company SentinelOne was part of a broader set of partially-related intrusions into several targets between July 2024 and March 2025.\n\"The victimology includes a South Asian government entity, a European media organization, and more than 70 organizations across a wide range of sectors,\" SentinelOne security researchers Aleksandar",
        "Date": "2025-06-09",
        "Content": "The reconnaissance activity targeting American cybersecurity company SentinelOne was part of a broader set of partially-related intrusions into several targets between July 2024 and March 2025.\n\"The victimology includes a South Asian government entity, a European media organization, and more than 70 organizations across a wide range of sectors,\" SentinelOne security researchers Aleksandar Milenkoski and Tom Hegel\nsaid\nin a report published today.\nSome of the targeted sectors include manufacturing, government, finance, telecommunications, and research. Also present among the victims was an IT services and logistics company that was managing hardware logistics for SentinelOne employees at the time of the breach in early 2025.\nThe malicious activity has been attributed with high confidence to China-nexus threat actors, with some of the attacks tied to a threat cluster dubbed\nPurpleHaze\n, which, in turn, overlaps with Chinese cyber espionage groups publicly reported as APT15 and UNC5174.\nIn late April 2024, SentinelOne\nfirst disclosed\nPurpleHaze-related reconnaissance activity targeting some of its servers that were deliberately accessible over the internet by \"virtue of their functionality.\"\n\"The threat actor's activities were limited to mapping and evaluating the availability of select internet-facing servers, likely in preparation for potential future actions,\" the researchers said.\nIt's currently not known if the attackers' intent was to just target the IT logistics organization or if they planned to expand their focus to downstream organizations as well. Further investigation into the attacks has uncovered six different activity clusters (named to A to F) that date back to June 2024 with the compromise of an unnamed South Asian government entity.\nThe clusters are listed below -\nActivity A:\nAn intrusion into a South Asian government entity (June 2024)\nActivity B:\nA set of intrusions targeting organizations globally (Between July 2024 and March 2025)\nActivity C:\nAn intrusion into an IT services and logistics company (at the beginning of 2025)\nActivity D:\nAn intrusion into the same South Asian government entity compromised (October 2024)\nActivity E:\nReconnaissance activity targeting SentinelOne servers (October 2024)\nActivity F:\nAn intrusion into a leading European media organization (late September 2024)\nThe June 2024 attack against the government entity, as previously detailed by SentinelOne, is said to have led to the deployment of ShadowPad that's obfuscated using ScatterBrain. The ShadowPad artifacts and infrastructure overlap with recent ShadowPad campaigns that have delivered a ransomware family codenamed\nNailaoLocker\nfollowing the exploitation of Check Point gateway devices.\nSubsequently in October 2024, the same organization was targeted to drop a Go-based\nreverse shell\ndubbed\nGoReShell\nthat uses SSH to connect to an infected host. The same backdoor, SentinelOne noted, has been used in connection with a September 2024 attack aimed at a leading European media organization.\nAlso common to these two activity clusters is the use of tools developed by a team of IT security experts who go by the name The Hacker's Choice (\nTHC\n). The development marks the first time THC's software programs have been abused by state-sponsored actors.\nSentinelOne has attributed Activity F to a China-nexus actor with loose affiliations to an \"initial access broker\" tracked by Google Mandiant under the name\nUNC5174\n(aka Uteus or Uetus). It's worth noting that the threat group was\nrecently linked\nto the active exploitation of SAP NetWeaver flaws to deliver GOREVERSE, a variant of GoReShell. The cybersecurity company is collectively tracking Activity D, E, and F as PurpleHaze.\n\"The threat actor leveraged\nORB\n[operational relay box] network infrastructure, which we assess to be operated from China, and exploited the\nCVE-2024-8963 vulnerability together with CVE-2024-8190\nto establish an initial foothold, a few days before the vulnerabilities were publicly disclosed,\" the researchers said. \"After compromising these systems, UNC5174 is suspected of transferring access to other threat actors.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Two Distinct Botnets Exploit Wazuh Server Vulnerability to Launch Mirai-Based Attacks",
        "Link": "https://thehackernews.com/2025/06/botnet-wazuh-server-vulnerability.html",
        "Summary": "A now-patched critical security flaw in the Wazur Server is being exploited by threat actors to drop two different Mirai botnet variants and use them to conduct distributed denial-of-service (DDoS) attacks.\nAkamai, which first discovered the exploitation efforts in late March 2025, said the malicious campaign targets CVE-2025-24016 (CVSS score: 9.9), an unsafe deserialization vulnerability that",
        "Date": "2025-06-09",
        "Content": "A now-patched critical security flaw in the Wazur Server is being exploited by threat actors to drop two different\nMirai\nbotnet variants and use them to conduct distributed denial-of-service (DDoS) attacks.\nAkamai, which first discovered the exploitation efforts in late March 2025, said the malicious campaign targets\nCVE-2025-24016\n(CVSS score: 9.9), an\nunsafe deserialization vulnerability\nthat allows for remote code execution on Wazuh servers.\nThe\nsecurity defect\n, which affects all versions of the server software including and above 4.4.0, was addressed in February 2025 with the release of 4.9.1. A proof-of-concept (PoC) exploit was\npublicly disclosed\naround the same time the patches were released.\nThe problem is rooted in the Wazuh API, where parameters in the DistributedAPI are serialized as JSON and deserialized using \"as_wazuh_object\" in the framework/wazuh/core/cluster/common.py file. A threat actor could weaponize the vulnerability by injecting malicious JSON payloads to execute arbitrary Python code remotely.\nThe web infrastructure company said it discovered attempts by two different botnets to exploit CVE-2025-24016 merely weeks after public disclosure of the flaw and the release of the PoC. The attacks were registered in early March and May 2025.\n\"This is the latest example of the ever-shrinking time-to-exploit timelines that botnet operators have adopted for newly published CVEs,\" security researchers Kyle Lefton and Daniel Messing\nsaid\nin a report shared with The Hacker News.\nIn the first instance, a successful exploit paves the way for the execution of a shell script that serves as a downloader for the Mirai botnet payload from an external server (\"176.65.134[.]62\") for different architectures. It's assessed that the malware samples are variants of LZRD Mirai, which has been around since 2023.\nIt's worth noting that LZRD was also\ndeployed\nrecently in attacks exploiting GeoVision end-of-life (EoL) Internet of Things (IoT) devices. However, Akamai told The Hacker News that there is no evidence that these two activity clusters are the work of the same threat actor given that LZRD is used by myriad botnet operators.\nFurther infrastructure analysis of \"176.65.134[.]62\" and its associated domains have led to the discovery of other Mirai botnet versions, including LZRD variants named \"neon\" and \"vision,\" and an updated version of\nV3G4\n.\nSome of the other security flaws exploited by the botnet include flaws in Hadoop YARN, TP-Link Archer AX21 (\nCVE-2023-1389\n), and a remote code execution bug in ZTE ZXV10 H108L routers.\nThe second botnet to abuse CVE-2025-24016 employs a similar strategy of using a malicious shell script to deliver another Mirai botnet variant referred to as Resbot (aka Resentual).\n\"One of the interesting things that we noticed about this botnet was the associated language. It was using a variety of domains to spread the malware that all had Italian nomenclature,\" the researchers said. \"The linguistic naming conventions could indicate a campaign to target devices owned and run by Italian-speaking users in particular.\"\nBesides attempting to spread via FTP over port 21 and conducting telnet scanning, the botnet has been found to leverage a wide range of exploits targeting Huawei HG532 router (\nCVE-2017-17215\n), Realtek SDK (\nCVE-2014-8361\n), and TrueOnline ZyXEL P660HN-T v1 router (\nCVE-2017-18368\n).\n\"The propagation of Mirai continues relatively unabated, as it remains rather straightforward to repurpose and reuse old source code to set up or create new botnets,\" the researchers said. \"And botnet operators can often find success with simply leveraging newly published exploits.\"\nCVE-2025-24016 is far from the only vulnerability to be abused by Mirai botnet variants. In recent attacks, threat actors have also taken advantage of\nCVE-2024-3721\n, a medium-severity\ncommand injection vulnerability\naffecting TBK DVR-4104 and DVR-4216 digital video recording devices, to enlist them into the botnet.\nThe vulnerability is used to trigger the execution of a shell script that's responsible for downloading the Mirai botnet from a remote server (\"42.112.26[.]36\") and executing it, but not before checking if it's currently running inside a virtual machine or QEMU.\nRussian cybersecurity company Kaspersky said the infections are concentrated around China, India, Egypt, Ukraine, Russia, Turkey, and Brazil, adding it identified over 50,000 exposed DVR devices online.\n\"Exploiting known security flaws in IoT devices and servers that haven't been patched, along with the widespread use of malware targeting Linux-based systems, leads to a significant number of bots constantly searching the internet for devices to infect,\" security researcher Anderson Leite\nsaid\n.\nThe disclosure comes as China, India, Taiwan, Singapore, Japan, Malaysia, Hong Kong, Indonesia, South Korea, and Bangladesh have emerged as the most targeted countries in the APAC region in the first quarter of 2025, according to statistics shared by StormWall.\n\"API floods and carpet bombing are growing faster than traditional volumetric TCP/UDP attacks, pushing companies to adopt smarter, more flexible defenses,\" the company\nsaid\n. \"At the same time, rising geopolitical tensions are driving a surge in attacks on government systems and Taiwan – highlighting increased activity from hacktivists and state-sponsored threat actors.\"\nIt also follows an advisory from the U.S. Federal Bureau of Investigation (FBI) that the\nBADBOX 2.0\nbotnet has infected millions of internet-connected devices, most of which are manufactured in China, in order to turn them into residential proxies to facilitate criminal activity.\n\"Cyber criminals gain unauthorized access to home networks by either configuring the product with malicious software prior to the user's purchase or infecting the device as it downloads required applications that contain backdoors, usually during the set-up process,\" the FBI\nsaid\n.\n\"The BADBOX 2.0 botnet consists of millions of infected devices and maintains numerous backdoors to proxy services that cyber criminal actors exploit by either selling or providing free access to compromised home networks to be used for various criminal activity.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "⚡ Weekly Recap: Chrome 0-Day, Data Wipers, Misused Tools and Zero-Click iPhone Attacks",
        "Link": "https://thehackernews.com/2025/06/weekly-recap-chrome-0-day-data-wipers.html",
        "Summary": "Behind every security alert is a bigger story. Sometimes it’s a system being tested. Sometimes it’s trust being lost in quiet ways—through delays, odd behavior, or subtle gaps in control.\nThis week, we’re looking beyond the surface to spot what really matters. Whether it’s poor design, hidden access, or silent misuse, knowing where to look can make all the difference.\nIf you're responsible for",
        "Date": "2025-06-09",
        "Content": "Behind every security alert is a bigger story. Sometimes it's a system being tested. Sometimes it's trust being lost in quiet ways—through delays, odd behavior, or subtle gaps in control.\nThis week, we're looking beyond the surface to spot what really matters. Whether it's poor design, hidden access, or silent misuse, knowing where to look can make all the difference.\nIf you're responsible for protecting systems, data, or people—these updates aren't optional. They're essential. These stories reveal how attackers think—and where we're still leaving doors open.\n⚡ Threat of the Week\nGoogle Releases Patches for Actively Exploited Chrome 0-Day\n— Google has released Google Chrome versions 137.0.7151.68/.69 for Windows and macOS, and version 137.0.7151.68 for Linux to address a high-severity out-of-bounds read and write vulnerability in the V8 JavaScript and WebAssembly engine that it said has been exploited in the wild. Google credited Clement Lecigne and Benoît Sevens of Google Threat Analysis Group (TAG) with discovering and reporting the flaw on May 27, 2025. \"Out-of-bounds read and write in V8 in Google Chrome prior to 137.0.7151.68 allowed a remote attacker to potentially exploit heap corruption via a crafted HTML page,\" according to a description of the flaw. It's currently not known how the flaw is being exploited in the wild, although it's likely to be highly targeted in nature.\nEach of Your Users Is Unique. Their Security Should be Too\nGravityZone PHASR (Proactive Hardening and Attack Surface Reduction) dynamically tailors hardening without slowing down business or burdening IT. Excess software access creates unnecessary risk. Uncover unused risky binaries and applications, restrict access to them, and cut your attack surface by up to 95%.\nLearn More ➝\n🔔 Top News\nPathWiper Used in Attack on Ukraine\n— An unnamed critical infrastructure entity within Ukraine was targeted by a previously unseen data wiper malware named PathWiper, which shares similarities with another wiper codenamed HermeticWiper that was used by the Russia-linked Sandworm hacking group at the outset of the Russo-Ukrainian war in early 2022. \"The attack was instrumented via a legitimate endpoint administration framework, indicating that the attackers likely had access to the administrative console, which was then used to issue malicious commands and deploy PathWiper across connected endpoints,\" Cisco Talos said.\nBladedFeline Targets Iraq with Whisper and Spearal Malware\n— An Iran-aligned hacking group dubbed BladedFeline has been attributed to a new set of cyber attacks targeting Kurdish and Iraqi government officials in early 2024. BladedFeline, believed to be active since at least September 2017, is suspected to be a sub-cluster within\nOilRig\n, a well-known state-sponsored threat actor that's assessed to be affiliated with Iran's Ministry of Intelligence and Security (\nMOIS\n) that's operational for over a decade. The attacks leverage an as-yet-undetermined initial access vector to deliver backdoors like Whisper (aka Veaty), Spearal, and Optimizer.\nVishing Group UNC6040 Targets Salesforce with Fake Data Loader App\n— A previously undocumented threat actor known as UNC6040 has leveraged voice phishing techniques reminiscent of Scattered Spider to breach targets of interest by posing as IT support personnel and trick employees into installing a modified version of Salesforce's Data Loader app in order to obtain unauthorized access to their Salesforce data and exfiltrate it. The attacks are said to overlap with a loose-knit cybercrime collective known as The Com, of which the Scattered Spider threat actor is a part. Salesforce said the observed incidents primarily relied on manipulating end users, and that it did not involve the exploitation of any security vulnerability in its systems.\nChrome to Distrust Certs Issued by Chunghwa Telecom and Netlock\n— Google's Chrome security team has announced plans to distrust digital certificates issued by Chunghwa Telecom and Netlock citing \"patterns of concerning behavior observed over the past year.\" The changes are expected to be introduced in Chrome 139, which is scheduled for public release in early August 2025. \"Over the past several months and years, we have observed a pattern of compliance failures, unmet improvement commitments, and the absence of tangible, measurable progress in response to publicly disclosed incident reports,\" Google said. \"When these factors are considered in the aggregate and considered against the inherent risk each publicly-trusted CA poses to the internet, continued public trust is no longer justified.\" It's worth noting that Apple has already moved to distrust root CA certificate \"NetLock Arany (Class Gold) Főtanúsítvány\" effective November 15, 2024.\nAndroid Trojan Crocodilus Broadens Focus Beyond Spain and Turkey\n— A nascent Android banking trojan called Crocodilus is stealthily spreading onto Android devices around the world via fake banking apps, phony browser updates, and malicious ads promising fake rewards. While early campaigns mainly targeted Android users in Turkey, the malware has surfaced on devices in Poland, Spain, South America, and parts of Asia, signaling a sharp uptick in both its reach and sophistication. The malware now includes the ability to create new contacts in the victim's address book, likely for social engineering, and to automatically harvest cryptocurrency wallet seed phrases from infected Android devices. Crocodilus is the latest reminder of malware authors continuing to adapt and trying to find new ways to get around Google's defenses and infect Android devices, even as Google has been constantly adding a steady stream of new security features to counter the rising tide of malware faced by the ecosystem. Intel 471, in a report last week, highlighted an increase in Android malware incorporating hidden virtual network computing (HVNC), keylogging, and remote control functionalities, and a decrease in web injects. \"While web injects remain at moderate levels, keyloggers that exploit Android's accessibility services have become increasingly popular for harvesting sensitive data,\" the company\nsaid\n. \"Once this information is collected, malware operators often deploy HVNC to reconstruct the infected device's screen on the server side, providing a real-time view of the victim's activity.\" This spike has also been complemented by a growing number of malware strains that are capable of bypassing Android 13 accessibility restrictions for sideloaded apps.\n‎️‍🔥 Trending CVEs\nAttackers love software vulnerabilities – they're easy doors into your systems. Every week brings fresh flaws, and waiting too long to patch can turn a minor oversight into a major breach. Below are this week's critical vulnerabilities you need to know about. Take a look, update your software promptly, and keep attackers locked out.\nThis week's list includes —\nCVE-2025-20286\n(Cisco Identity Services Engine),\nCVE-2025-49113\n(Roundcube),\nCVE-2025-5419\n(Google Chrome),\nCVE-2025-21479, CVE-2025-21480, CVE-2025-27038\n(Qualcomm),\nCVE-2025-37093\n(HPE StoreOnce),\nCVE-2025-48866\n(ModSecurity WAF),\nCVE-2025-25022\n(IBM QRadar Suite),\nCVE-2025-22243\n(VMware NSX Manager),\nCVE‑2025‑24364, CVE‑2025‑24365\n(Vaultwarden), and\nCVE-2024-53298\n(Dell PowerScale OneFS).\n📰 Around the Cyber World\nSentinelOne Blames Outage on Software Flaw\n— American cybersecurity company SentinelOne\nrevealed\nthat a massive outage that took place on May 29, 2025, and lasted about seven hours was triggered by a software flaw that caused network routes and DNS resolver rules to be deleted. The outage affected multiple customer-facing services in what the company described as a global service disruption. \"During this period, customer endpoints remained protected, but security teams were unable to access the management console and related services, which significantly impacted their ability to manage their security operations and access important data,\" it said. The root cause of the issue, it added, was a \"software flaw in an infrastructure control system that removed critical network routes, causing widespread loss of network connectivity within the SentinelOne platform.\"\nNigeria Jails 9 Chinese Nationals for Being Part of a Cybercrime Syndicate\n— The Federal High Court of Nigeria\nconvicted\nnine Chinese nationals and sentenced them each to a year in prison for their roles in a cybercrime syndicate that allegedly involved training and recruiting young Nigerians to commit online fraud such as\nromance baiting scams\n. The individuals were arrested in December 2024 as part of an operation codenamed Eagle Flush, which resulted in the arrest of 599 Nigerians and 193 other foreign nationals, many of them Chinese, on suspicion of being involved in a range of online crimes and frauds. In February 2025, several Chinese and Filipino nationals were\narraigned\non\ncharges\nof cyber-terrorism, possession of documents containing false pretense, and identity theft. They are said to be among the 792-member cryptocurrency investment and romance fraud suspects arrested in December 2024. China's ambassador to Nigeria, Yu Dunhai, has proposed sending a working group to Nigeria to work with the country's law enforcement agencies to dismantle Chinese cybercrime rings engaging in telecom frauds. \"I can assure you [...] that we have zero tolerance for this kind of crime. The Chinese government has always been committed to countering cybercrime and telecom frauds,\"\nsaid\nDunhai.\nBogus Airdrops Target Hashgraph Network Users\n— The U.S. Federal Bureau of Investigation (FBI) warned that scammers are targeting Hedera Hashgraph network users through the NFT airdrop feature embedded in non-custodial wallets to steal cryptocurrency using free rewards as lures. \"The Hedera Hashgraph is the distributed ledger used by Hedera. The airdrop feature was originally created by the Hedera Hashgraph network for marketing purposes; however, cybercriminals can exploit this tactic to collect victim data to steal cryptocurrency,\" the FBI\nsaid\n. The agency further noted that cyber criminals may advertise the malicious phishing URLs for fraudulent NFT airdrop rewards tokens on social media or through a third-party website. Alternatively, the threat actors may also send an email with a booby-trapped link that, when clicked, requests the victim to enter their credentials to collect the free tokens. However, this action allows them to gain unauthorized access to the wallets and drain the funds.\nThreat Actors Use Fake Caching Plugin to Steal WordPress Admin Credentials\n— Bad actors have been found to leveraging a bogus WordPress caching plugin named wp-runtime-cache to harvest admin credentials and exfiltrate them to an external server (\"woocommerce-check[.]com\") that masquerades as WooCommerce, an open-source e-commerce plugin for WordPress. While it's currently not clear how the attackers managed to compromise the site, typical methods involve exploitation of known security flaws in plugins and themes, or stolen admin credentials (which is unlikely the case in this attack, given it's exfiltrated to the attackers post infection). \"As demonstrated here, once an attacker has gained access to a site it can be quite easy to hide their malicious activities,\" Sucuri\nsaid\n. \"This attack highlights the importance of auditing your site's plugins and users, and maintaining updated admin passwords.\"\nChinese Hackers Breached U.S. Telecom Company in Summer 2023\n— Chinese hackers broke into the systems of an unnamed U.S. telecommunications company in the summer of 2023 and stayed there for seven months before the breach was discovered, Bloomberg\nreported\n. The intrusion has been attributed to the\nSalt Typhoon\n, which attracted attention late last year for its targeting of U.S. telecom firms. The incident indicates that Chinese attackers penetrated the U.S. communications system earlier than publicly known. China, however, denied the allegations, urging relevant parties to \"stop spreading all kinds of disinformation about the so-called Chinese hacking threats.\"\nGerman Data Protection Watchdog Fines Vodafone\n— Germany's Federal Commissioner for Data Protection and Freedom of Information (BfDI) imposed two fines totaling €45 million ($51.4 million) on Vodafone for privacy and security violations. \"Due to malicious employees in partner agencies who broker contracts to customers on behalf of Vodafone, there had been fraud cases due to fictitious contracts or contract changes at the expense of customers, among other things,\" BfDI\nsaid\n. Of the €45 million penalty, €30 million was imposed for security issues in the authentication process associated with MeinVodafone (\"My Vodafone\") and its Vodafone Hotline. \"The identified authentication vulnerabilities enabled, among other things, unauthorized third parties to access eSIM profiles,\" authorities said. Vodafone has updated its systems to mitigate such risks in the future, the BfDI added.\nNSO Group Appeals $168 Million Damages to WhatsApp\n— Spyware vendor NSO Group has appealed a jury's decision requiring it to\npay about $168 million in damages\nto WhatsApp, saying the award is unlawful. The order was announced last month, more than five years after a lawsuit was filed over NSO Group's alleged role in facilitating government spying on 1,400 mobile devices belonging to journalists, human rights activists, and political dissidents. According to NSO Group, WhatsApp should not be awarded more than $1.77 million. \"The most plausible explanation for the oddly specific amount of the punitive damages award is that the jury chose that amount in an attempt to bankrupt NSO,\" the Israeli company's filing said. \"The jury's award comes close to wiping out all of NSO's current 'assets.'\"\nMozilla Debuts New System to Flag Cryptocurrency Drainer Add-ons\n— Mozilla said it's developed an \"early detection system\" to detect and block scam crypto wallet extensions before they gain popularity among users and are used to steal users' assets by tricking them into entering their credentials. \"The first layer of defense involves automated indicators that determine a risk profile for wallet extensions submitted to AMO [addons.mozilla.org],\" Mozilla\nsaid\n. \"If a wallet extension reaches a certain risk threshold, human reviewers are alerted to take a deeper look. If found to be malicious, the scam extensions are blocked immediately.\"\niPhone Zero-Click Campaign Targets Users in Europe and the U.S.\n— Mobile research company iVerify\nrevealed\nthat it found evidence of anomalous activity on iPhones belonging to individuals affiliated with political campaigns, media organizations, A.I. companies, and governments operating in the European Union and the United States. It said it detected \"exceedingly rare crashes\" that are traditionally associated with sophisticated zero-click attacks via iMessage using a previously undocumented vulnerability in the \"\nimagent\n\" process to carry out post-exploitation actions. The vulnerability has been codenamed NICKNAME. The issue, observed in iOS versions up to 18.1.1, was patched in\nversion 18.3.1\nreleased in January 2025. \"The bug involves a race condition in how iOS processes 'Nickname Updates,' the feature that allows users to share personalized contact information with their iMessage contact,\" iVerify said. It's said that the shortcoming was exploited in targeted attacks as recently as March 2025, prompting Apple to send a threat notification to at least one device belonging to a senior government official in the E.U. on which the crash was observed. In total, a total of six devices are believed to have been targeted by the unknown threat actor, two of which exhibited \"clear signs of successful exploitation.\" What makes the activity notable is that all the identified victims were previously targeted by the China-linked Salt Typhoon hacking group. In a\nstatement\nshared with Axios, Apple acknowledged the fix, but disputed that it was ever used in a malicious context. It described it as a \"conventional software bug that we identified and fixed in iOS 18.3\" and that \"iVerify has not responded with meaningful technical evidence supporting their claims, and we are not currently aware of any credible indication that the bug points to an exploitation attempt or active attack.\"\nSouth Korea Targeted by ViperSoftX to Steal Crypto\n— Threat hunters have disclosed a new malware campaign that employs cracked software or key generators for legitimate software as lures to distribute a known stealer malware called\nViperSoftX\n, alongside other malware families such as Quasar RAT,\nPureCrypter\n, PureHVNC, and a cryptocurrency clipper. \"The ViperSoftX threat actor installs various PowerShell scripts in infected systems and uses them to download additional payloads,\" AhnLab\nsaid\n. \"This allows them to receive commands from the threat actor and perform various malicious behaviors.\"\nU.S. State Department Offers $10M for Info About RedLine Developers\n— The U.S. State Department has\nannounced\nrewards of up to $10 million for information on individuals affiliated with the RedLine information stealer, which suffered a law enforcement crackdown in October 2024. This could include foreign government-linked associates of Maxim Alexandrovich Rudometov, or their malicious cyber activities, or foreign government-linked use of the stealer. Rudometov was\ncharged\nby the U.S. Justice Department last year for his alleged role as the developer and for marketing the malware-as-a-service (MaaS) on underground forums such as Russian Market, which has emerged as one of the most popular platforms for buying and selling credentials stolen by information stealer malware. Also known by the aliases, \"dendimirror,\" \"alinchok,\" \"ghackihg,\" \"makc1901,\" \"navi_ghacking,\" and \"bloodzz.fenix,\" Rudometov is believed to have fled from the Luhansk region of Ukraine where he was born to Krasnodar, Russia, following the Russian invasion of Ukraine in February 2022. The development comes weeks after the\ndisruption\nof another notorious information stealer named Lumma last month by law enforcement and private-sector companies. According to ReliaQuest, Lumma accounted for nearly 92% of Russian Market credential log alerts in Q4 2024, putting it way ahead of its peers RedLine, StealC, Raccoon, Vidar, RisePro, and a new stealer referred to as\nAcreed\n. \"In Q1 2025, Acreed surpassed every established infostealer in terms of Russian Market alert attribution, ranking second only to giant Lumma,\" the company said. \"Since the law enforcement takedown of Lumma in mid-May 2025, Acreed is perfectly positioned to rapidly gain traction as cybercriminals seek alternatives.\"\nApple Allegedly Gave Governments Data on 1000s of Push Notifications\n— Apple provided governments around the world with data related to thousands of push notifications sent to its devices, according to a\nreport\npublished by 404 Media. The data for the first time puts a concrete figure on how many requests governments around the world are making for push notification data from Apple (and Google). The practice first\ncame to light\nin late 2023 when Senator Ron Wyden sent a letter to the U.S. Department of Justice, demanding more transparency into the practice. \"The data these two companies receive includes metadata, detailing which app received a notification and when, as well as the phone and associated Apple or Google account to which that notification was intended to be delivered,\" the letter read. \"In certain instances, they also might also receive unencrypted content, which could range from backend directives for the app to the actual text displayed to a user in an app notification.\"\nChina Accuses Taiwan of Running 5 APT Groups with U.S. Help\n— China's National Computer Virus Emergency Response Center (CVERC) has accused Taiwan's Democratic Progressive Party (DPP) of sponsoring five advanced persistent threat (APT) groups to conduct cyber espionage attacks against government and public service entities, research institutions, universities, defense technology and industry entities, and foreign affairs agencies located in mainland china. \"Their primary goal is to steal and sell sensitive intelligence, including important diplomatic policies, defense technology, cutting-edge scientific achievements, and economic data, to anti-China forces abroad,\" CVERC\nclaimed\nin a report titled Operation Futile. \"They even attempt to disrupt social order and create chaos.\" The groups, overseen by Taiwan's Information, Communications and Electronic Force Command (ICEFOM), include\nAPT-C-01\n(aka Poison Vine or GreenSpot), APT-C-62 (aka Viola Tricolor), APT-C-64 (aka Anonymous 64), APT-C-65 (aka Neon Pothos), and APT-C-67 (aka Ursa). It also claimed that APT-C-67's campaigns are geared towards collecting geographic intelligence, while stating APT-C-01 has \"close ties\" with the U.S. Cyber Command and that it focuses on \"hunt forward\" operations. The report coincided with China\nissuing\nwarrants for 20 Taiwanese people that it said carried out hacking missions in the Chinese mainland on behalf of the island's ruling party.\nColombian Cyber Criminals Linked to Vehicle Insurance Scams\n— Cybercriminals from Colombia have been attributed to a scam that involves creating a network of over 100 fake websites to deceive users seeking damage-precautionary and mandatory vehicle insurance. The intent is to lend the sites a veneer of legitimacy, exploit users' trust, and convince them to make payments to \"activate\" their insurance. The scheme employs ads on Facebook, urging users to engage with the threat actors on WhatsApp. \"The scammers redirect them to a fake website posing as a legitimate car insurance provider,\" Group-IB\nsaid\n. \"The site nudges users to enter their vehicle registration number, initiating a process that feels remarkably authentic. The scam's effectiveness lies in validating the vehicle's insurance status. The site denies the purchase if the insurance is still active, reinforcing its credibility as a legitimate service. However, if the insurance has expired, the site displays accurate vehicle details, making it almost impossible for users to suspect foul play.\" It's believed that the threat actors extract the vehicle status from public databases and government sites.\nGerman Authorities Dox Leader of TrickBot\n— Germany's Federal Criminal Police Office (aka Bundeskriminalamt or BKA) has\nouted\nRussian national Vitaly Nikolaevich Kovalev as the founder and leader of the\nTrickBot\n(aka Wizard Spider) cybercrime gang.\nKovalev\nwas\nrecently added\nto the E.U. Most Wanted list in connection with a law enforcement operation that led to the takedown of about 300 servers worldwide and neutralization of 650 domains last month. The development comes as a mysterious leaker calling themselves\nGangExposed\nrevealed the\nkey figures\nbehind the Conti and Trickbot ransomware crews, including Conti's lead negotiator Arkady Valentinovich Bondarenko. In a statement with The Register, the lecturer\nsaid\nthe actions are part of their \"fight against an organized society of criminals known worldwide.\"\n🎥 Cybersecurity Webinars\nHackers Are Hiding in Trusted Sites — Learn to Spot LOTS Attacks\n:\nHackers aren't breaking in—they're blending in. In this live webinar, Zscaler's top threat hunters will show how attackers are hiding inside trusted sites and tools to stay invisible. You'll hear real stories from the front lines, learn what threats are trending right now, and get clear, practical tips to spot and stop stealth attacks before they spread. If you care about catching what your security tools are missing, don't miss this.\nEvery AI Agent Has a Secret Identity — Learn How to Find It Before Attackers Do\n:\nAI agents are reshaping how businesses operate—but behind every agent is a hidden identity risk. From service accounts to API keys, these Non-Human Identities (NHIs) have deep access yet often go unmanaged and unmonitored. In this webinar, you'll uncover how attackers are targeting these invisible identities and learn practical steps to secure them before they become your biggest blind spot.\n🔧 Cybersecurity Tools\nInterceptSuite\n: A tool that intercepts and inspects encrypted traffic from any app—not just web browsers. Built for deep visibility into TLS traffic across protocols, it gives security pros the power to analyze what traditional HTTP-only tools can't see.\nMalware Detection System\nA multi-layered system that detects malicious websites using static analysis, dynamic behavior monitoring, and threat intelligence APIs. It flags threats like phishing, malware, obfuscated scripts, and hidden content for real-time, accurate detection.\nDisclaimer: These newly released tools are for educational use only and haven't been fully audited. Use at your own risk—review the code, test safely, and apply proper safeguards.\n🔒 Tip of the Week\nBlock Malware Tactics Before They Start — Turn On ASR Rules →\nMost modern malware doesn't rely on viruses—it abuses trusted tools like Word, Excel, and PowerShell to silently run in the background. Microsoft Defender's built-in Attack Surface Reduction (ASR) rules stop these attacks by blocking dangerous actions like macros launching scripts or unknown apps accessing sensitive system parts.\nHere's how you can enable ASR protection in minutes:\nHome & Power Users:\nDownload ConfigureDefender — a safe, free tool that lets you enable all key ASR rules with just a few clicks. Open the app, choose the \"High\" or \"Max\" profile, and click \"Apply Settings\". That's it—your system is now protected against many common malware techniques.\nAdvanced Users or IT Admins:\nUse this PowerShell command to enable a critical ASR rule:\nAdd-MpPreference -AttackSurfaceReductionRules_Ids D4F940AB-401B-4EFC-AADC-AD5F3C50688A -AttackSurfaceReductionRules_Actions Enabled\nThis one blocks Office apps from launching child processes—a common trick in ransomware delivery.\nASR rules don't just block known malware—they shut down entire categories of risky behavior. They're free, lightweight, and already built into Windows 10/11 Pro or Enterprise. Turning them on can prevent threats your antivirus may never catch.\nConclusion\nThis week's takeaways are a reminder: threats rarely knock—they slip in. Every missed patch, strange behavior, or failed control is a step closer to something worse. If anything here hits close to home, don't delay the fix. The next breach is often just a mistake left unchecked.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Think Your IdP or CASB Covers Shadow IT? These 5 Risks Prove Otherwise",
        "Link": "https://thehackernews.com/2025/06/think-your-idp-or-casb-covers-shadow-it.html",
        "Summary": "You don&rsquo;t need a rogue employee to suffer a breach.\nAll it takes is a free trial that someone forgot to cancel. An AI-powered note-taker quietly syncing with your Google Drive. A personal Gmail account tied to a business-critical tool. That&rsquo;s shadow IT. And today, it&rsquo;s not just about unsanctioned apps, but also dormant accounts, unmanaged identities, over-permissioned SaaS",
        "Date": "2025-06-09",
        "Content": "You don’t need a rogue employee to suffer a breach.\nAll it takes is a free trial that someone forgot to cancel. An AI-powered note-taker quietly syncing with your Google Drive. A personal Gmail account tied to a business-critical tool. That’s shadow IT. And today, it’s not just about unsanctioned apps, but also dormant accounts, unmanaged identities, over-permissioned SaaS tools, and orphaned access. Most of it slips past even the most mature security solutions.\nThink your CASB or IdP covers this? It doesn’t.\nThey weren’t built to catch what's happening inside SaaS: OAuth sprawl, shadow admins, GenAI access, or apps created directly in platforms like Google Workspace or Slack.\nShadow IT is no longer a visibility issue - it’s a full-blown attack surface.\nWing Security\nhelps security teams uncover these risks before they become incidents.\nHere are 5 real-world examples of shadow IT that could be quietly bleeding your data.\n1. Dormant access you can’t see, that attackers love to exploit\nThe risk\n: Employees sign up for tools using just a username and password, without SSO or centralized visibility. Over time, they stop using the apps, but access stays, and worse, it is unmanaged.\nThe impact\n: These zombie accounts become invisible entry points into your environment. You can’t enforce MFA, monitor usage, or revoke access during offboarding.\nExample:\nCISA and global cyber agencies issued a joint advisory warning in 2024 that Russian state-sponsored group APT29 (part of the SVR) actively targets dormant accounts to gain access to enterprise and government systems. These accounts often serve as ideal footholds since they go unnoticed, lack MFA, and remain accessible long after they're no longer in use.\n2. Generative AI quietly reading your emails, files, and strategy\nThe risk\n: SaaS apps powered by Generative AI usually request broad OAuth permissions with full access to read inboxes, files, calendars, and chats.\nThe impact\n: These SaaS apps often grant more access than required, exfiltrate sensitive data to third parties with unclear data retention and model training policies. Once access is granted, there’s no way to monitor how your data is stored, who has access internally, or what happens if the vendor is breached or misconfigures access.\nExample\n: In 2024, DeepSeek accidentally\nexposed internal LLM training files\ncontaining sensitive data due to a misconfigured storage bucket, highlighting the risk of giving third-party GenAI tools broad access without oversight around data security.\n3. Former employees still hold admin access, months after leaving\nThe risk\n: When employees onboard new SaaS tools (especially outside your IdP), they often are the sole admin. Even after they leave the company, their access remains.\nThe impact\n: These accounts can have persistent, privileged access to company tools, files, or environments, posing a long-term insider risk.\nReal-life example\n: A contractor set up a time-tracking app and linked it to the company’s HR system. Months after their contract ended, they still had admin access to employee logs.\nSee what Wing uncovers in your SaaS environment.\nTalk with a security expert and get a demo.\n4. Business-critical apps tied to personal accounts you don’t control\nThe risk\n: Employees sometimes use their personal Gmail, Apple ID, or other unmanaged accounts to sign up for business apps like Figma, Notion, or even Google Drive.\nThe impact\n: These accounts exist entirely outside of IT visibility. If they get compromised, you can’t revoke access or enforce security policies.\nExample\n: In the\n2023 Okta customer support breach\n, hackers exploited a service account without MFA that had access to Okta’s support system. The account was active, unmonitored, and not tied to a specific person. Even companies with mature identity systems can miss these blind spots.\n5. Shadow SaaS with app-to-app connectivity to your crown jewels\nThe risk\n: Employees connect unsanctioned SaaS apps directly to trusted platforms like Google Workspace, Salesforce, or Slack—without IT involvement or review. These app-to-app connections often request broad API access and stay active long after use.\nThe impact\n: These integrations create hidden pathways into critical systems. If compromised, they can enable lateral movement, allowing attackers to pivot across apps, exfiltrate data, or maintain persistence without triggering traditional alerts.\nExample\n: A product manager connected a roadmap tool to Jira and Google Drive. The integration requested broad access but was forgotten after the project ended. When the vendor was later breached, attackers used the lingering connection to pull files from Drive and pivot into Jira, accessing internal credentials and escalation paths. This type of lateral movement was seen in the\n2024 Microsoft breach\nby Midnight Blizzard, where attackers leveraged a legacy OAuth app with mailbox access to evade detection and maintain persistent access to internal systems.\nWhat are you doing about it?\nShadow IT isn’t just a governance problem—it’s a real security gap. And the longer it goes unnoticed, the bigger the risk and the more exposed your SaaS environment becomes.\nWing Security\nautomatically discovers SaaS apps, users, and integrations—mapping human and non-human identities, permissions, and MFA status—without agents or proxies. Once the unknown becomes known, Wing delivers multi-layered SaaS security in one platform, unifying misconfigurations, identity threats, and SaaS risks into a single source of truth. By correlating events across apps and identities, Wing cuts through the noise, prioritizes what matters, and enables proactive, continuous security.\n👉\nGet a demo\nand take control of your SaaS environment - before hackers do.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "OpenAI Bans ChatGPT Accounts Used by Russian, Iranian, and Chinese Hacker Groups",
        "Link": "https://thehackernews.com/2025/06/openai-bans-chatgpt-accounts-used-by.html",
        "Summary": "OpenAI has revealed that it banned a set of ChatGPT accounts that were likely operated by Russian-speaking threat actors and two Chinese nation-state hacking groups to assist with malware development, social media automation, and research about U.S. satellite communications technologies, among other things.\n\"The [Russian-speaking] actor used our models to assist with developing and refining",
        "Date": "2025-06-09",
        "Content": "OpenAI has\nrevealed\nthat it banned a set of ChatGPT accounts that were likely operated by Russian-speaking threat actors and two Chinese nation-state hacking groups to assist with malware development, social media automation, and research about U.S. satellite communications technologies, among other things.\n\"The [Russian-speaking] actor used our models to assist with developing and refining Windows malware, debugging code across multiple languages, and setting up their command-and-control infrastructure,\" OpenAI said in its threat intelligence report. \"The actor demonstrated knowledge of Windows internals and exhibited some operational security behaviors.\"\nThe Go-based malware campaign has been codenamed ScopeCreep by the artificial intelligence (AI) company. There is no evidence that the activity was widespread in nature.\nThe threat actor, per OpenAI, used temporary email accounts to sign up for ChatGPT, using each of the created accounts to have one conversation to make a single incremental improvement to their malicious software. They subsequently abandoned the account and moved on to the next.\nThis practice of using a network of accounts to fine-tune their code highlights the adversary's focus on operational security (OPSEC), OpenAI added.\nThe attackers then distributed the AI-assisted malware through a publicly available code repository that impersonated a legitimate video game crosshair overlay tool called\nCrosshair X\n. Users who ended up downloading the trojanized version of the software had their systems infected by a malware loader that would then proceed to retrieve additional payloads from an external server and execute them.\n\"From there, the malware was designed to initiate a multi-stage process to escalate privileges, establish stealthy persistence, notify the threat actor, and exfiltrate sensitive data while evading detection,\" OpenAI said.\n\"The malware is designed to escalate privileges by relaunching with ShellExecuteW and attempts to evade detection by using PowerShell to programmatically exclude itself from Windows Defender, suppressing console windows, and inserting timing delays.\"\nAmong other tactics incorporated by ScopeCreep include the use of Base64-encoding to obfuscate payloads, DLL side-loading techniques, and SOCKS5 proxies to conceal their source IP addresses.\nThe end goal of the malware is to harvest credentials, tokens, and cookies stored in web browsers, and exfiltrate them to the attacker. It's also capable of sending alerts to a Telegram channel operated by the threat actors when new victims are compromised.\nOpenAI noted that the threat actor asked its models to debug a Go code snippet related to an HTTPS request, as well as sought help with integrating Telegram API and using PowerShell commands via Go to modify Windows Defender settings, specifically when it comes to adding antivirus exclusions.\nThe second group of ChatGPT accounts disabled by OpenAI are said to be associated with two hacking groups attributed to China:\nAPT5\n(aka Bronze Fleetwood, Keyhole Panda, Manganese, and UNC2630) and\nAPT15\n(aka Flea, Nylon Typhoon, Playful Taurus, Royal APT, and Vixen Panda)\nWhile one subset engaged with the AI chatbot on matters related to open-source research into various entities of interest and technical topics, as well as to modify scripts or troubleshooting system configurations.\n\"Another subset of the threat actors appeared to be attempting to engage in development of support activities including Linux system administration, software development, and infrastructure setup,\" OpenAI said. \"For these activities, the threat actors used our models to troubleshoot configurations, modify software, and perform research on implementation details.\"\nThis consisted of asking for assistance building software packages for offline deployment and advice pertaining to configured firewalls and name servers. The threat actors engaged in both web and Android app development activities.\nIn addition, the China-linked clusters weaponized ChatGPT to work on a brute-force script that can break into FTP servers, research about using large-language models (LLMs) to automate penetration testing, and develop code to manage a fleet of Android devices to programmatically post or like content on social media platforms like Facebook, Instagram, TikTok, and X.\nSome of the other observed malicious activity clusters that harnessed ChatGPT in nefarious ways are listed below -\nA network, consistent with the\nNorth Korea IT worker scheme\n, that used OpenAI's models to drive deceptive employment campaigns by developing materials that could likely advance their fraudulent attempts to apply for IT, software engineering, and other remote jobs around the world\nSneer Review\n, a likely China-origin activity that used OpenAI's models to bulk generate social media posts in English, Chinese, and Urdu on topics of geopolitical relevance to the country for sharing on Facebook, Reddit, TikTok, and X\nOperation High Five\n, a Philippines-origin activity that used OpenAI's models to generate bulk volumes of short comments in English and Taglish on topics related to politics and current events in the Philippines for sharing on Facebook and TikTok\nOperation VAGue Focus\n, a China-origin activity that used OpenAI's models to generate social media posts for sharing on X by posing as journalists and geopolitical analysts, asking questions about computer network attack and exploitation tools, and translating emails and messages from Chinese to English as part of suspected social engineering attempts\nOperation Helgoland Bite\n, a likely Russia-origin activity that used OpenAI's models to generate Russian language content about the German 2025 election, and criticized the U.S. and NATO, for sharing on Telegram and X\nOperation Uncle Spam\n, a China-origin activity that used OpenAI's models to generate polarized social media content supporting both sides of divisive topics within U.S. political discourse for sharing on Bluesky and X\nStorm-2035\n, an Iranian influence operation that used OpenAI's models to generate short comments in English and Spanish that expressed support for Latino rights, Scottish independence, Irish reunification, and Palestinian rights, and praised Iran's military and diplomatic prowess for sharing on X by inauthentic accounts posing as residents of the U.S., U.K., Ireland, and Venezuela.\nOperation Wrong Number\n, a likely Cambodian-origin activity related to China-run task scam syndicates that used OpenAI's models to generate short recruitment-style messages in English, Spanish, Swahili, Kinyarwanda, German, and Haitian Creole that advertised high salaries for trivial tasks such as liking social media posts\n\"Some of these\ncompanies\noperated by charging new recruits substantial joining fees, then using a portion of those funds to pay existing 'employees' just enough to maintain their engagement,\" OpenAI's Ben Nimmo, Albert Zhang, Sophia Farquhar, Max Murphy, and Kimo Bumanglag said. \"This structure is characteristic of task scams.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Stolen Ticketmaster data from Snowflake attacks briefly for sale again",
        "Link": "https://www.bleepingcomputer.com/news/security/stolen-ticketmaster-data-from-snowflake-attacks-briefly-for-sale-again/",
        "Summary": "The Arkana Security extortion gang briefly listed over the weekend what appeared to be newly stolen Ticketmaster data but is instead the data stolen during the 2024 Snowflake data theft attacks. [...]",
        "Date": "2025-06-09",
        "Content": "The Arkana Security extortion gang briefly listed over the weekend what appeared to be newly stolen Ticketmaster data but is instead the data stolen during the 2024 Snowflake data theft attacks.\nThe extortion group\nposted screenshots\nof the allegedly stolen data, advertising over 569 GB of Ticketmaster data for sale, causing speculation that this was a new breach.\nListing of Ticketmaster data being sold by Arkana\nSource: BleepingComputer\nHowever, BleepingComputer has determined that the files shown in the Arkana post match samples of Ticketmaster data we previously saw during the\n2024 Snowflake data theft attacks\n.\nFurthermore, one of the images had the caption \"rapeflaked copy 4 quick sale 1 buyer,\" which is a reference to a tool named \"RapeFlake.\"\nRapeFlake is a custom tool created by the threat actors to perform reconnaissance and exfiltrate data from Snowflake's databases.\nAs previously reported, the\nSnowflake attacks\ntargeted many organizations, including Santander, Ticketmaster,\nAT&T\n,\nAdvance Auto Parts\n,\nNeiman Marcus\n,\nLos Angeles Unified\n,\nPure Storage\n, and\nCylance\n. These attacks were claimed by an extortion group known as ShinyHunters.\nThese attacks were conducted using compromised Snowflake credentials stolen by infostealers, which were then used to download company data for use in extortion schemes.\nTicketmaster was among the most widely extorted victims in the Snowflake attack, which led to the theft of personal and ticketing information. After the data was offered for sale online, the company\nconfirmed the breach\nat the end of May and began notifying affected customers.\nFollowing the initial leak, the threat actors ramped up their extortion attempts by releasing what they\nclaimed were print-at-home tickets\nand even\nalleged Taylor Swift tickets\nin a series of posts on a hacking forum.\nWhile Arkana did not specify the origin of the data, the use of Snowflake references and the file names matching previously leaked files indicates that the group was attempting to resell old stolen data.\nWhether or not Arkana previously purchased this data, whether the group is made up of threat actors who previously had the data, or whether they are working with ShinyHunters to sell it is unclear.\nOn June 9, the entry for the Ticketmaster data had been removed from the Arkana Security data leak site.\nThe name \"ShinyHunters\" has been linked to a large number of breaches over the years, including the massive\nPowerSchool data breach\nwhere data was stolen for 62.4 million students and 9.5 million teachers for 6,505 school districts across the U.S., Canada, and other countries.\nMore recently, Mandiant tied ShinyHunters to a recent campaign\ntargeting Salesforce accounts\n, where threat actors were breaching accounts to steal customer data and extort companies.\nAs numerous threat actors tied to ShinyHunters have been arrested over the past three years  [\n1\n,\n2\n,\n3\n], it is unclear if this is the original group or other threat actors claiming to be them to throw off law enforcement.\nBleepingComputer contacted Arkana and Ticketmaster regarding the listing but did not receive a response.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMedia giant Lee Enterprises says data breach affects 39,000 people\nM&S says customer data stolen in cyberattack, forces password resets\nAscension says recent data breach affects over 430,000 patients\nSensata Technologies says personal data stolen by ransomware gang\nTax resolution firm Optima Tax Relief hit by ransomware, data leaked"
    },
    {
        "Title": "Over 84,000 Roundcube instances vulnerable to actively exploited flaw",
        "Link": "https://www.bleepingcomputer.com/news/security/over-84-000-roundcube-instances-vulnerable-to-actively-exploited-flaw/",
        "Summary": "Over 84,000 instances of the Roundcube webmail software are vulnerable to CVE-2025-49113, a critical remote code execution (RCE) vulnerability with a publicly available exploit. [...]",
        "Date": "2025-06-09",
        "Content": "Over 84,000 Roundcube webmail installations are vulnerable to CVE-2025-49113, a critical remote code execution (RCE) flaw with a public exploit.\nThe flaw, which impacts Roundcube versions 1.1.0 through 1.6.10, spanning over a decade, was\npatched on June 1, 2025\n, following its discovery and reporting by security researcher Kirill Firsov.\nThe bug stems from unsanitized $_GET['_from'] input, enabling PHP object deserialization and session corruption when session keys begin with an exclamation mark.\nShortly after the patch was released, hackers reverse-engineered it to develop a working exploit, which they\nsold on underground forums\n.\nThough the exploitation of\nCVE-2025-49113\nrequires authentication, attackers claim that valid credentials can be obtained via CSRF, log scraping, or brute-forced.\nFirsov shared technical details about the flaw\non his blog\nto help defend against active exploitation attempts that are very likely to occur.\nMassive exposure\nRoundcube is widely used in shared hosting (GoDaddy, Hostinger, OVH) and government, education, and tech sectors, with over 1,200,000 instances visible online.\nThreat monitoring platform\nThe Shadowserver Foundation reports\nthat its internet scans return\n84,925 Roundcube instances\nvulnerable to CVE-2025-49113 as of June 8, 2025.\nMost of these instances are in the United States (19,500), India (15,500), Germany (13,600), France (3,600), Canada (3,500), and the United Kingdom (2,400).\nHeatmap of exposure to CVE-2025-49113\nSource: The Shadowserver Foundation\nConsidering the high risk of exploitation and the potential for data theft, the exposure of those instances is a significant cybersecurity risk.\nSystem administrators are recommended to update to version 1.6.11 and 1.5.10, which address CVE-2025-49113, as soon as possible.\nIt is unclear if the flaw is being leveraged in actual attacks and at what scale, but immediate action is advised nonetheless.\nIf upgrading is impossible, it is recommended to restrict access to webmail, turn off file uploads, add CSRF protection, block risky PHP functions, and monitor for exploit indicators.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nHacker selling critical Roundcube webmail exploit as tech info disclosed\nExploit details for max severity Cisco IOS XE flaw now public\nHackers are exploiting critical flaw in vBulletin forum software\nIvanti fixes EPMM zero-days chained in code execution attacks\nFortinet fixes critical zero-day exploited in FortiVoice attacks"
    },
    {
        "Title": "Google patched bug leaking phone numbers tied to accounts",
        "Link": "https://www.bleepingcomputer.com/news/security/google-patched-bug-leaking-phone-numbers-tied-to-accounts/",
        "Summary": "A vulnerability allowed researchers to brute-force any Google account's recovery phone number simply by knowing a their profile name and an easily retrieved partial phone number, creating a massive risk for phishing and SIM-swapping attacks. [...]",
        "Date": "2025-06-09",
        "Content": "A vulnerability allowed researchers to brute-force any Google account's recovery phone number simply by knowing a their profile name and an easily retrieved partial phone number, creating a massive risk for phishing and SIM-swapping attacks.\nThe attack method involves abusing a now-deprecated JavaScript-disabled version of the Google username recovery form, which lacked modern anti-abuse protections.\nThe flaw was discovered by\nsecurity researcher BruteCat\n, the same one who demonstrated in February that it's possible to expose the private\nemail addresses of YouTube accounts\n.\nBruteCat told BleepingComputer that while the attack retrieves the phone number users configured for the Google account recovery, this is the same as the account holder's primary phone number in the vast majority of cases.\nBrute-forcing Google numbers\nBruteCat discovered that he could access a legacy no-JavaScript username recovery form, which appeared to be working as expected.\nThe form allowed querying if a phone number was associated with a Google account based on a user's profile display name (\"John Smith\") via two POST requests.\nThe researcher bypassed the rudimentary rate-limiting defenses on the form by using IPv6 address rotation to generate trillions of unique source IPs via /64 subnets for these requests.\nThe CAPTCHAs displayed by many requests were bypassed by substituting the 'bgresponse=js_disabled' parameter with a valid BotGuard token from the JS-enabled form.\nCaptured BotGuard token from a Google JS-enabled username recovery form\nSource: BruteCat\nWith the technique set, BruteCat developed a brute-forcing tool (gpb) that iterates through number ranges using country-specific formats and filters false positives.\nThe researcher used Google's 'libphonenumber' to generate valid number formats, built a country mask database to identify phone formats by region, and wrote a script to generate BotGuard tokens via headless Chrome.\nOn a brute-forcing rate of 40,000 requests per second, US numbers would take about 20 minutes, UK 4 minutes, and the Netherlands less than 15 seconds.\nTime to brute-force phone numbers\nSource: BruteCat\nTo start an attack against someone, their email address is required for the form, but Google has set this to hidden since last year.\nBruteCat found he could retrieve it by creating a Looker Studio document and transferring ownership to the target's Gmail address.\nOnce ownership is transferred, the target's Google display name appears on the document creator's Looker Studio dashboard, requiring zero interaction with the target.\nArmed with this email address, they could perform repeated queries to determine all phone numbers associated with the profile name.\nHowever, as there can be thousands of accounts with the same profile name, the researcher narrowed it down using the target's partial number.\nTo get a partial phone number for the user, the researcher utilized Google's \"account recovery\" workflow, which will display two digits of a configured recovery phone number.\n\"This time can also be significantly reduced through phone number hints from password reset flows in other services such as PayPal, which provide several more digits (ex. +14•••••1779)\", explains BruteCat.\nThe leaking of phone numbers associated with a Google account can cause a massive security risk to users, who can then be targeted in targeted vishing attacks or SIM swap attacks.\nA demonstration of exploiting this flaw can be seen in the video below.\nBug fixed\nBruteCat reported his findings to Google via the tech giant's Vulnerability Reward Program (VRP) on April 14, 2025.\nGoogle initially considered the exploitability risk low, but on May 22, 2025, it upgraded the issue to \"medium severity,\" applying interim mitigations and paying the researcher a reward of $5,000 for the disclosure.\nOn June 6, 2025, Google confirmed that it had fully deprecated the vulnerable no-JS recovery endpoint.\nThe attack vector is no longer exploitable, but whether or not it was ever maliciously exploited remains unknown.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nGoogle’s upcoming Gemini Kingfall is allegedly a coding beast\nMicrosoft adds quick machine recovery to Windows 11 settings\nGoogle patches new Chrome zero-day bug exploited in attacks\nGoogle Chrome to distrust Chunghwa Telecom, Netlock certificates in August\nThreat actors abuse Google Apps Script in evasive phishing attacks"
    },
    {
        "Title": "SentinelOne shares new details on China-linked breach attempt",
        "Link": "https://www.bleepingcomputer.com/news/security/sentinelone-shares-new-details-on-china-linked-breach-attempt/",
        "Summary": "SentinelOne has shared more details on an attempted supply chain attack by Chinese hackers through an IT services and logistics firm that manages hardware logistics for the cybersecurity firm. [...]",
        "Date": "2025-06-09",
        "Content": "SentinelOne has shared more details on an attempted supply chain attack by Chinese hackers through an IT services and logistics firm that manages hardware logistics for the cybersecurity firm.\nSentinelOne is an American endpoint protection (EDR/XDR) solutions provider that protects critical infrastructure in the country and numerous large enterprises.\nIt is a high-value target for state actors as compromising could serve as a springboard to accessing downstream corporate networks and gaining insight into detection capabilities to develop evasion methods.\nSentinelLabs\nfirst reported\non the attempted attack in April, with a new report today describing the attack as part of a broader campaign targeting over 70 entities worldwide between June 2024 and March 2025.\nTargets of the campaign\nSource: SentinelLabs\nThe targets include organizations in government, telecommunications, media, finance, manufacturing, research, and IT sectors.\nThe campaign is separated into two clusters. The first is 'PurpleHaze,' attributed to APT15 and UNC5174, covering a timeframe between September and October 2024.\nSentinelOne was targeted by both clusters, once for reconnaissance and once for supply chain intrusion.\nPurpleHaze (left) and ShadowPad (right) attacks on SentinelOne\nSource: SentinelLabs\nSentinelOne suspects that the threat actors in both campaigns exploited vulnerabilities in exposed network devices, including Ivanti Cloud Service Appliances and Check Point gateways.\n\"We suspect that the most common initial access vector involved the exploitation of Check Point gateway devices, consistent with\nprevious research\non this topic,\"\nreports SentinelLabs\n.\n\"We also observed communication to ShadowPad C2 servers originating from Fortinet Fortigate, Microsoft IIS, SonicWall, and CrushFTP servers, suggesting potential exploitation of these systems as well.\"\nPurpleHaze and ShadowPad campaigns\nThe PurpleHaze attack wave attempted to breach SentinelOne in October 2024, where threat actors conducted scans on the company's internet-exposed servers over port 443, looking to map accessible services.\nThe threat actors registered domains masquerading as SentinelOne infrastructure, such as sentinelxdr[.]us and secmailbox[.]us.\nBased on evidence from other targets, including a South Asian government, successful attacks used the GOREshell backdoor, which was dropped on network-exposed endpoints using zero-day exploits.\nThe more recent activity cluster is 'ShadowPad,' conducted by APT41 between June 2024 and March 2025.\nThe threat actors attempted what is believed to be a supply chain attack on SentinelOne in early 2025, where APT41 used the ShadowPad malware, obfuscated via ScatterBrain, against an IT services and logistics company working with the cybersecurity company.\nThe attackers delivered the malware to the target via PowerShell, which used a 60-second delay to evade sandbox environments. The malware then scheduled a system reboot after 30 minutes to clear traces in memory.\nNext, the hackers deployed the open-source remote access framework 'Nimbo-C2' to provide a wide range of\nremote capabilities\n, including screenshot capturing, PowerShell command execution, file operations, UAC bypass, and more.\nThe attackers also used a PowerShell-based exfiltration script that performs a recursive search for sensitive user documents, archives them in a password-locked 7-Zip archive, and exfiltrates them.\nPowerShell data exfiltration script\nSource: SentinelLabs\nSentinelOne comments that the threat actors' goals remain unclear, but a supply chain compromise is the most likely scenario.\nThe cybersecurity company thoroughly examined its assets and reported that no compromise had been detected on SentinelOne software or hardware.\n\"This post highlights the persistent threat posed by China-nexus cyberespionage actors to a wide range of industries and public sector organizations, including cybersecurity vendors themselves,\" concludes SentinelOne.\n\"The activities detailed in this research reflect the strong interest these actors have in the very organizations tasked with defending digital infrastructure.\"\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nChinese hackers breach US local governments using Cityworks zero-day\nMagento supply chain attack compromises hundreds of e-stores\nChinese hackers target Russian govt with upgraded RAT malware\nDesigning Blue Team playbooks with Wazuh for proactive incident response\nHow to build a robust Windows Service to block malware and ransomware"
    },
    {
        "Title": "Linux Foundation unveils decentralized WordPress plugin manager",
        "Link": "https://www.bleepingcomputer.com/news/technology/linux-foundation-unveils-decentralized-wordpress-plugin-manager/",
        "Summary": "A collective of former WordPress developers and contributors backed by the Linux Foundation has launched the FAIR Package Manager, a new and independent distribution system for trusted WordPress plugins and themes. [...]",
        "Date": "2025-06-09",
        "Content": "A collective of former WordPress developers and contributors backed by the Linux Foundation has launched the FAIR Package Manager, a new and independent distribution system for trusted WordPress plugins and themes.\nThis is a response to recent controversy after a legal conflict between commercial WordPress hosting providers Automattic and WP Engine, after the former\nbanned the latter's access\nto the WordPress.org platform used by all WordPress sites to keep plugins and themes up-to-date.\nThe conflict stems from multiple issues, including brand usage disputes and disagreements over contributions to the WordPress open-source project.\nWP Engine\nsent a cease-and-desist letter to Automattic\nafter Matt Mullenweg, WordPress co-founder and Automattic CEO, publicly criticized them for profiting from WordPress without adequate contributions, calling WP Engine a \"cancer to WordPress.\"\nWP Engine also accused Mullenweg of trying to extort millions for trademark licensing by threatening with a \"scorched earth nuclear approach\" if they didn't comply. Automattic then countered\nwith its own cease-and-desist letter\n, claiming WP Engine generated $400 million in revenue through unauthorized use of the WordPress name and infringing on WordPress and WooCommerce trademarks.\nOpen-source WordPress plugin manager\nIn light of these issues, the Linux Foundation, a nonprofit organization that supports Linux development and open-source projects, unveiled the\nFAIR Package Manager\n, a vendor-neutral plugin distribution system that doesn't rely on a single source for plugin and theme delivery and updates.\n\"The FAIR Package Manager project paves the way for the stability and growth of open source content management, giving contributors and businesses additional options governed by a neutral community,\"\nsaid\nLinux Foundation executive director Jim Zemlin.\nThis decentralized alternative to the WordPress.org ecosystem returns control to WordPress developers and hosts via a drop-in plugin that replaces centralized services with a federated infrastructure.\nThe new platform \"brings together a fragmented ecosystem by bringing together plugins from any source\" and \"builds security into the supply chain, including improved cryptographic security measures, enhanced browser compatibility checking, and enabling reliance on trusted source security salts.\"\nIt also replaces communication via WordPress.org APIs with local or FAIR alternatives, introduces a new distribution model for plugins and themes (adding support for opt-in packages that use the FAIR protocol), and allows hosts to set up their own plugin and theme mirrors using AspirePress or their own domains.\n\"The FAIR Package Manager project gives the WordPress ecosystem a stronger, more independent foundation for delivering software. By decentralizing distribution, we're ensuring the long-term sustainability of this open source content management platform,\" said Carrie Dils, one of three FAIR Technical Steering Committee co-chairs.\n\"For anyone building on WordPress – whether as a product, a service or critical infrastructure – the FAIR Package Manager project offers a trustworthy, stable path forward.\"\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nPremium WordPress 'Motors' theme vulnerable to admin takeover attacks\nWordPress plugin disguised as a security tool injects backdoor\nWooCommerce admins targeted by fake security patches that hijack sites\nHackers exploit OttoKit WordPress plugin flaw to add admin accounts\nKali Linux warns of update failures after losing repo signing key"
    },
    {
        "Title": "Sensata Technologies says personal data stolen by ransomware gang",
        "Link": "https://www.bleepingcomputer.com/news/security/sensata-technologies-says-personal-data-stolen-by-ransomware-gang/",
        "Summary": "Sensata Technologies is warning former and current employees it suffered a data breach after concluding an investigation into an April ransomware attack. [...]",
        "Date": "2025-06-09",
        "Content": "Sensata Technologies is warning former and current employees it suffered a data breach after concluding an investigation into an April ransomware attack.\nSensata is a global industrial tech firm specializing in mission‑critical sensors, controls, and electrical protection systems. It serves the automotive, aerospace, and defense industries, among others, and has an annual revenue of over $4 billion.\nIn April, the company\nfiled an 8-K filing\nwith the U.S. Securities and Exchange Commission (SEC), disclosing that it suffered a ransomware attack on Sunday, April 6, which also included data theft.\nThe cybersecurity incident impacted Sensata's shipping, manufacturing, and other business operations.\nAlthough preliminary investigations confirmed data exfiltration, the exact data that had been stolen and the scope of the exposure weren't determined at the time.\nSubsequent investigations into the incident supported by an external expert showed that the ransomware actors breached Sensata's network on March 28, 2025.\n\"The evidence showed that there was unauthorized activity in our network between March 28, 2025, and April 6, 2025,\"\nreads the notice sent to impacted persons\n.\n\"During that time, an unauthorized actor viewed and obtained files from our network. We conducted a careful review of the files and, on May 23, 2025, determined that one or more of them may have contained your information.\"\nThe company is now notifying an undisclosed number of impacted individuals that the following data was stolen:\nFull name\nAddress\nSocial Security Number (SSN)\nDriver's license number\nState ID card number\nPassport number\nFinancial account information\nPayment card information\nMedical information\nHealth insurance information\nDate of birth\nThe breach impacts current and former Sensata employees and their dependents, with the exposed information varying per individual.\nThe firm enclosed instructions in the letter on enrolling in one year of credit monitoring and identity theft protection service.\nBleepingComputer has reached out to Sensata to specify the scope of the data breach and the number of impacted individuals, but we have not received a response by publication.\nAs of writing, no ransomware groups have taken responsibility for the attack at Sensata.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMedia giant Lee Enterprises says data breach affects 39,000 people\nM&S says customer data stolen in cyberattack, forces password resets\nBaltimore City Public Schools data breach affects over 31,000 people\nFrederick Health data breach impacts nearly 1 million patients\nEntertainment services giant Legends International discloses data breach"
    },
    {
        "Title": "Designing Blue Team playbooks with Wazuh for proactive incident response",
        "Link": "https://www.bleepingcomputer.com/news/security/designing-blue-team-playbooks-with-wazuh-for-proactive-incident-response/",
        "Summary": "Blue Team playbooks are essential—but tools like Wazuh take them to the next level. From credential dumping to web shells and brute-force attacks, see how Wazuh strengthens real-time detection and automated response. [...]",
        "Date": "2025-06-09",
        "Content": "In cybersecurity, Blue Teams are responsible for defending an organization’s IT environment, including networks, endpoints, applications, and data against various types of threats. Their role goes beyond protecting IT assets; they also ensure operational continuity, monitor for malicious activity, and respond to incidents in real-time. To operate effectively, these teams rely on structured processes known as playbooks.\nBlue Team playbook is a detailed guide outlining how to identify, contain, and remediate specific security incidents. These playbooks help ensure that incident responses are consistent, timely, and aligned with organizational policies and regulatory requirements, ultimately minimizing the impact of cyberattacks. They include specific prerequisites, workflows, checklists, and investigation steps for various incident scenarios.\nKey elements of Blue Team playbooks\nWhile every organization may customize its playbooks to suit its specific environment, certain procedures  are required to respond to incident use cases effectively:\nPrerequisites:\nThe foundational requirements that must be in place before launching an investigation. This includes having appropriate security tooling, defined roles, relevant detection rules, and alerting logic, among others.\nWorkflow:\nThe logical sequence of steps followed during incident response. It typically follows a model that shows how an incident is detected, escalated, triaged, contained, and resolved.\nChecklist:\nA list of tasks used to track and verify each step in the workflow, ensuring all necessary actions are taken to mitigate and remediate an incident effectively.\nInvestigation playcards:\nDetailed step-by-step instructions tailored to specific incident use cases and distinct attack vectors. Each playcard should include log sources, indicators of compromise (IoC), related MITRE ATT&CK techniques, containment, and recovery activities.\nAt the core of these playbooks is Incident Response (IR), the formalized process of detecting, investigating, and mitigating security incidents. Playbooks implement IR by translating high-level procedures into actionable steps for specific threats, making them essential tools for effective security operations.\nIncident use cases covered by Blue Team playbooks\nBlue Team playbooks are designed to respond to various threat attacks. Some of the common incident use cases include:\nBrute-force login attempts across SSH, RDP, or web portals.\nMalware infections and unauthorized file changes.\nInsider threats and anomalous user behaviors.\nPrivilege escalation and suspicious process executions on endpoints.\nData exfiltration attempts via abnormal network activity.\nWeb application attacks, including web shell uploads and exploitation attempts.\nBy mapping each use case to a predefined response strategy, Blue Teams can act quickly, reducing the mean time to respond (MTTR) and limiting potential damage.\nStrengthen Your Blue Team Playbooks with Wazuh\nUnlock the full potential of your Blue Team operations. Discover how Wazuh, an open-source security platform, empowers real-time threat detection, automated response, and comprehensive incident management for various attack scenarios.\nEnhance your cyber defenses today!\nLearn More About Wazuh\nUnderstanding the role of Wazuh in Blue Team playbooks\nEffective incident response requires tools that offer real-time security monitoring, automated response, and correlation-based threat detection.\nWazuh\n, a free and open source security platform, provides these capabilities, enabling security teams to detect, analyze, and respond to incidents efficiently.\nWazuh unifies Security Information and Event Management (SIEM) functionalities with Extended Detection and Response (XDR) capabilities. Its capabilities allow for the correlation and analysis of security data across diverse endpoints and environments, including on-premises, cloud, and hybrid infrastructures. Its real-time threat detection, log analysis, and file integrity monitoring capabilities make it an important asset for Blue Teams. These features make it invaluable during all four major phases of the incident response lifecycle.\nIncident response (IR) involves a structured approach that includes preparation, detection, analysis, containment, eradication, recovery, and post-incident activities to capture lessons learned. By integrating Wazuh into the incident response lifecycle, organizations can achieve the following:\nReal-time detection through centralized log analysis and file integrity monitoring.\nAutomated alerting based on customizable rules to trigger responses.\nBehavioral monitoring of endpoints, servers, and cloud environments.\nBuilt-in incident response actions to contain and isolate threats.\nCompliance and audit reporting features for post-incident documentation.\nIntegrating Wazuh into your Blue Team playbook\nThe following playbook examples demonstrate how Wazuh can be applied to real-world threat scenarios, showcasing its role in detection and response across diverse attack vectors:\nPlaybook 1: Credential dumping on a Windows endpoint\nCredential dumping is a common post-exploitation technique that attackers use to harvest account credentials stored in memory or registry hives. These credentials can be subsequently used for lateral movement and unauthorized access to restricted information. Wazuh helps detect this behavior on Windows endpoints by leveraging security event logs, Sysmon logs, and process monitoring modules.\nWazuh can be configured to monitor suspicious access to\nlsass.exe\n, registry queries to\nSAM\nor\nSECURITY\nhives, and abnormal execution of credential extraction tools such as Mimikatz. Alerts are generated using pre-defined rules correlating parent-child process relationships, command line arguments, and known IoC patterns.\nFor example, Wazuh out-of-the-box rules can\ndetect Impacket\nabuse against monitored Windows endpoints. Impacket is a collection of Python-based scripts designed for manipulating network protocols and exploiting Windows services.\nWhen Impacket attack tools such as\nsecretsdump.py\nare executed against a Wazuh agent, Wazuh immediately detects the activity. It then triggers alerts visible on the Wazuh dashboard for security analysts to review and respond.\nFigure 1: Alerts on a Wazuh dashboard from the execution of secretsdump.py\nPlaybook 2: Web shell on a compromised web server\nWeb shells are malicious scripts that enable threat actors to maintain persistent access on compromised web servers and launch additional attacks. Threat actors favor this technique to create backdoors within their victims’ environments.\nWazuh detects web shells using a combination of file integrity monitoring (FIM) and threat detection capabilities. Blue Teams can configure Wazuh to monitor high-risk directories and flag unauthorized file creations or modifications that may indicate the presence of a web shell.  Wazuh FIM generates alerts whenever changes occur in specified paths, enabling early tampering detection within monitored endpoints.\nIn addition to monitoring file changes, Wazuh includes built-in rules that help detect suspicious activity on web servers. These rules flag behaviors like executing non-standard scripts or using unexpected HTTP methods. Blue Teams can also create custom rules to detect specific malware behaviors.\nBelow is an additional rule written to trigger alerts when the Wazuh manager detects files modified within monitored directories with PHP web shell signatures:\n<group>\r\n<rule id=\"100502\" level=\"15\">\r\n    <if_sid>100501</if_sid>\r\n    <field name=\"changed_content\" type=\"pcre2\">(?i)passthru|exec|eval|shell_exec|assert|str_rot13|system|phpinfo|base64_decode|chmod|mkdir|fopen|fclose|readfile|show_source|proc_open|pcntl_exec|execute|WScript.Shell|WScript.Network|FileSystemObject|Adodb.stream</field>\r\n    <description>[File Modification]: File $(file) contains a web shell</description>\r\n    <mitre>\r\n      <id>T1105</id>\r\n      <id>T1505.003</id>\r\n    </mitre>\r\n  </rule>\r\n</group>\nThe following rule inspects modified files for suspicious PHP functions often used in web shells. The\nchanged_content\nfield represents the contents of the modified file, which Wazuh scans for patterns like\neval\n,\nexec\n, and\nbase64_decode\n. When matched, it triggers a high-severity alert and maps the behavior to relevant MITRE ATT&CK techniques.\nPlaybook 3: Suspicious data exfiltration\nData exfiltration can be hard to detect, especially when attackers leverage legitimate tools to move data and evade detection. This technique, known as Living Off the Land (LOTL), involves the misuse of native operating system utilities, making malicious activities blend with normal operations. Wazuh supports network activity monitoring, command execution tracking, and file access auditing to uncover abnormal outbound activity.\nBy monitoring shell history, large file transfers, or tools like\nscp\n,\ncurl\n, or\nnetcat\n, Wazuh alerts teams to high-volume transfers or unusual destinations. Wazuh also utilizes the  GeoIP feature to flag connections from and to suspicious locations, helping you detect and escalate potential exfiltration attempts in real-time.\nThe blog post on\ndetecting data exfiltration performed using LOTL tools\nsimulates various data exfiltration scenarios and how they can be detected using Wazuh.\nIt demonstrates how Wazuh can monitor commands executed via PowerShell, Command Prompt, and built-in Windows utilities to identify suspicious file transfers. By collecting and analyzing event logs, Wazuh agents can detect indicators like the use of\ncertutil\n,\nbitsadmin\n, and\ncurl\nfor unauthorized data movement.\nCustom rules and decoders can generate alerts when these tools are misused, helping Blue Teams respond quickly to exfiltration attempts.\nFigure 2: Wazuh uses custom rules to trigger alerts when the BITS service is abused\nPlaybook 4: Brute-force login attack\nBrute-forcing is a common attack vector that threat actors use to gain unauthorized access to endpoints and services. Services like SSH on Linux endpoints and RDP on Windows are usually prone to brute-force attacks. Wazuh detects brute-force attacks by correlating multiple authentication failure events across monitored endpoints. On Linux endpoints, it identifies these attacks out-of-the-box by parsing authentication logs such as\n/var/log/auth.log\nusing log data detection capabilities.\nWazuh decoders parse raw log data from authentication services to extract structured information about failed login attempts. This includes details like source IP address, username, and timestamp. Once decoded, Wazuh correlation rules analyze this data to detect patterns of rapid or repeated failures from the same IP address, triggering alerts for potential brute-force attacks. W\nhen the defined alert threshold is met, Wazuh uses its\nActive Response\ncapabilities to run scripts to take action on certain triggers. For example, Wazuh can trigger an active response to block the offending IP address using firewall rules like\niptables\n.\nThe blog post on monitoring\nRapid SCADA with Wazuh\nillustrates how brute-force login attempts against industrial control systems can be detected using log data analysis capability. Wazuh monitors authentication logs from Rapid SCADA systems, parsing events that indicate repeated failed login attempts. Custom rules identify abnormal patterns, such as multiple failures within a short time frame.\nThese rules generate alerts that highlight potential brute-force activity, allowing security teams to respond quickly. By analyzing log data from SCADA systems, Wazuh enables early detection of unauthorized access attempts and other anomalies within industrial control environments.\nFigure 3: Wazuh detects brute-force attempts after multiple failed authentication attempts\nIntegrating Wazuh with other security tools\nTo build effective Blue Team playbooks, organizations need tools that not only detect threats but also work seamlessly within a broader security ecosystem. Wazuh supports this by integrating with a range of external tools across the incident response lifecycle:\nSOAR platforms\nsuch as TheHive and Shuffle help automate case management and streamline the execution of incident response playbooks.\nThreat intelligence feeds\n, including VirusTotal, AlienVault OTX, and AbuseIPDB, enrich alert data with external context, enabling faster and more informed triage.\nTicketing systems\nlike Jira integrate with Wazuh to facilitate efficient incident tracking, assignment, and team communication.\nCloud platforms\nsuch as AWS, Azure, and GCP can be monitored by Wazuh to detect configuration issues, anomalous activity, and potential security breaches in cloud workloads.\nConclusion\nEach of these playbooks highlights the adaptability of Wazuh to support Blue Team operations. Whether responding to a credential-harvesting attack or detecting a persistent foothold through a web shell, Wazuh gives defenders the tools to act quickly, backed by a database of community-driven threat detection rules and open source integrations.\nLearn more about Wazuh by checking out their\ndocumentation\nand joining their\ncommunity\nof professionals for support.\nSponsored and written by\nWazuh\n."
    },
    {
        "Title": "Grocery wholesale giant United Natural Foods hit by cyberattack",
        "Link": "https://www.bleepingcomputer.com/news/security/grocery-wholesale-giant-united-natural-foods-hit-by-cyberattack/",
        "Summary": "United Natural Foods (UNFI), North America's largest publicly traded wholesale distributor, was forced to shut down some systems following a recent cyberattack. [...]",
        "Date": "2025-06-09",
        "Content": "United Natural Foods (UNFI), North America's largest publicly traded wholesale distributor, was forced to shut down some systems following a recent cyberattack.\nThe Rhode Island-based company operates 53 distribution centers and delivers fresh and frozen products to over 30,000 locations across the United States and Canada, including supermarket chains, e-commerce providers, natural product superstores, independent retailers, and food service customers.\nUNFI, a primary distributor for Amazon's Whole Foods, reported $31 billion in annual revenues in August 2024, works with more than 11,000 suppliers, and has over 28,000 employees.\nIn an\n8-K filing\nwith the U.S. Securities and Exchange Commission and a\npress release\non its website, the company disclosed that a cyberattack discovered on Thursday, June 5th, forced it to take some systems offline, which impacted customer orders.\n\"The Company promptly activated its incident response plan and implemented containment measures, including proactively taking certain systems offline, which has temporarily impacted the Company's ability to fulfill and distribute customer orders,\" UNFI said. \"The incident has caused, and is expected to continue to cause, temporary disruptions to the Company's business operations.\"\nSince the breach was discovered, the wholesaler giant has notified relevant law enforcement authorities and hired external cybersecurity experts to investigate the incident.\nUNFI has also taken measures to maintain customer service continuity, implementing workarounds until affected systems are restored.\n\"The Company is working actively to assess, mitigate, and remediate the incident with the assistance of third-party cybersecurity professionals and has notified law enforcement,\" it added. \"Pursuant to its business continuity plans, the Company has implemented workarounds for certain operations in order to continue servicing its customers where possible. The Company is continuing to work to restore its systems to safely bring them back online.\"\nThis disclosure follows\nwidespread\nreports\non\nsocial media\nsince Thursday that the company's systems were down and employees were having their shifts canceled.\nUNFI has not yet revealed the nature of the attack or whether the attackers stole any data from the company's network. Additionally, no ransomware operations have claimed responsibility for the breach. As announced on May 20, the company will\nrelease its financial results\nfor the fiscal 2025 third quarter this Tuesday.\n\"We are assessing the unauthorized activity and working to restore our systems to safely bring them back online. As we work through this issue, our customers, suppliers, and associates are our highest priority,\" UNFI spokesperson Inès de Miranda told BleepingComputer.\nUNFI is just the latest company in the food industry to have been breached in recent years. For instance, in March, ​Walmart-owned warehouse supermarket chain Sam's Club disclosed it was\ninvestigating\nclaims of a Clop ransomware breach. Food giant JBS Foods, the world's largest beef producer, also\npaid an $11 million ransom\nin 2021 after a\nREvil ransomware attack\nforced it to\nshut down production\nat multiple sites worldwide.\nOver the last months, attacks linked to\nScattered Spider\nthreat actors and the\nDragonForce\nransomware operation have also\ntargeted retailers\nacross the United Kingdom (including\nHarrods\n,\nCo-op\n, and\nMarks & Spencer\n) and recently switched their attention\nto U.S. companies\n.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nKettering Health confirms Interlock ransomware behind cyberattack\nHackers behind UK retail attacks now targeting US companies\nSteel giant Nucor Corporation facing disruptions after cyberattack\nFBI seeks help to unmask Salt Typhoon hackers behind telecom breaches\nWestern Sydney University discloses security breaches, data leak"
    },
    {
        "Title": "New Trump Cybersecurity Order Reverses Biden, Obama Priorities",
        "Link": "https://www.darkreading.com/cybersecurity-operations/trump-cybersecurity-order-reverses-biden-obama-priorities",
        "Summary": "The White House put limits on cyber sanctions, killed the digital ID program, and refocused the government's cyber activities to enabling AI, rolling out post-quantum cryptography, and promoting secure software design.",
        "Date": "2025-06-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/trump-cybersecurity-order-reverses-biden-obama-priorities"
    },
    {
        "Title": "OpenAI Bans ChatGPT Accounts Linked to Nation-State Threat Actors",
        "Link": "https://www.darkreading.com/threat-intelligence/openai-bans-chatgpt-accounts-nation-state-threat-actors",
        "Summary": "The AI company's investigative team found that many accounts were using the program to engage in malicious activity around the world, such as employment schemes, social engineering, and cyber espionage.",
        "Date": "2025-06-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/openai-bans-chatgpt-accounts-nation-state-threat-actors"
    },
    {
        "Title": "'Librarian Ghouls' Cyberattackers Strike at Night",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/librarian-ghouls-cyberattackers-strike",
        "Summary": "Since at least December, the advanced persistent threat (APT) group has been using legit tools to steal data, dodge detection, and drop cryptominers on systems belonging to organizations in Russia.",
        "Date": "2025-06-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/librarian-ghouls-cyberattackers-strike"
    },
    {
        "Title": "Gartner: How Security Teams Can Turn Hype Into Opportunity",
        "Link": "https://www.darkreading.com/application-security/gartner-security-teams-hype-opportunity",
        "Summary": "During the opening keynote at Gartner Security &amp; Risk Management Summit 2025, analysts weighed in on how CISOs and security teams can use security fervor around AI and other tech to the betterment of their security posture.",
        "Date": "2025-06-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/gartner-security-teams-hype-opportunity"
    },
    {
        "Title": "SIEMs Missing the Mark on MITRE ATT&amp;CK Techniques",
        "Link": "https://www.darkreading.com/cybersecurity-operations/siems-missing-mark-mitre-techniques",
        "Summary": "CardinalOps' report shows that organizations are struggling to keep up with the evolution of the latest threats while a significant number of detection rules remain non-functional.",
        "Date": "2025-06-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/siems-missing-mark-mitre-techniques"
    },
    {
        "Title": "Next-Gen Developers Are a Cybersecurity Powder Keg",
        "Link": "https://www.darkreading.com/application-security/next-gen-developers-cybersecurity-powder-keg",
        "Summary": "AI coding tools promise productivity but deliver security problems, too. As developers embrace &quot;vibe coding,&quot; enterprises face mounting risks from insecure code generation that security teams can't keep pace with.",
        "Date": "2025-06-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/next-gen-developers-cybersecurity-powder-keg"
    },
    {
        "Title": "China-Backed Hackers Target SentinelOne in 'PurpleHaze' Attack Spree",
        "Link": "https://www.darkreading.com/remote-workforce/china-hackers-target-sentinelone-purplehaze-attack",
        "Summary": "Known threat groups APT15 and UNC5174 unleashed attacks against SentinelOne and more than 70 other high-value targets, as part of ongoing cyber-espionage and other malicious activity involving ShadowPad malware.",
        "Date": "2025-06-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/china-hackers-target-sentinelone-purplehaze-attack"
    },
    {
        "Title": "Chinese Hackers and User Lapses Turn Smartphones Into a ‘Mobile Security Crisis’",
        "Link": "https://www.securityweek.com/chinese-hackers-and-user-lapses-turn-smartphones-into-a-mobile-security-crisis/",
        "Summary": "<p>Foreign hackers have increasingly identified smartphones, other mobile devices and the apps they use as a weak link in U.S. cyberdefenses.</p>\n<p>The post <a href=\"https://www.securityweek.com/chinese-hackers-and-user-lapses-turn-smartphones-into-a-mobile-security-crisis/\">Chinese Hackers and User Lapses Turn Smartphones Into a ‘Mobile Security Crisis’</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chinese-hackers-and-user-lapses-turn-smartphones-into-a-mobile-security-crisis/"
    },
    {
        "Title": "Chinese Espionage Crews Circle SentinelOne in Year-Long Reconnaissance Campaign",
        "Link": "https://www.securityweek.com/chinese-espionage-crews-circle-sentinelone-in-year-long-reconnaissance-campaign/",
        "Summary": "<p>Anti-malware vendor said it spent the past twelve months deflecting a stream of network reconnaissance probes from China-nexus threat actors</p>\n<p>The post <a href=\"https://www.securityweek.com/chinese-espionage-crews-circle-sentinelone-in-year-long-reconnaissance-campaign/\">Chinese Espionage Crews Circle SentinelOne in Year-Long Reconnaissance Campaign</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chinese-espionage-crews-circle-sentinelone-in-year-long-reconnaissance-campaign/"
    },
    {
        "Title": "Guardz Banks $56M Series B for All-in-One SMB Security",
        "Link": "https://www.securityweek.com/guardz-banks-56m-series-b-for-all-in-one-smb-security/",
        "Summary": "<p>The Israeli company said the Series B raise was led by ClearSky and included equity stakes for new backer Phoenix Financial.</p>\n<p>The post <a href=\"https://www.securityweek.com/guardz-banks-56m-series-b-for-all-in-one-smb-security/\">Guardz Banks $56M Series B for All-in-One SMB Security</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/guardz-banks-56m-series-b-for-all-in-one-smb-security/"
    },
    {
        "Title": "Mirai Botnets Exploiting Wazuh Security Platform Vulnerability",
        "Link": "https://www.securityweek.com/mirai-botnets-exploiting-wazuh-security-platform-vulnerability/",
        "Summary": "<p>CVE-2025-24016, a critical remote code execution vulnerability affecting Wazuh servers, has been exploited by Mirai botnets.</p>\n<p>The post <a href=\"https://www.securityweek.com/mirai-botnets-exploiting-wazuh-security-platform-vulnerability/\">Mirai Botnets Exploiting Wazuh Security Platform Vulnerability </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/mirai-botnets-exploiting-wazuh-security-platform-vulnerability/"
    },
    {
        "Title": "React Native Aria Packages Backdoored in Supply Chain Attack",
        "Link": "https://www.securityweek.com/react-native-aria-packages-backdoored-in-supply-chain-attack/",
        "Summary": "<p>A threat actor published backdoored versions of 17 NPM packages from GlueStack in a fresh supply chain attack.</p>\n<p>The post <a href=\"https://www.securityweek.com/react-native-aria-packages-backdoored-in-supply-chain-attack/\">React Native Aria Packages Backdoored in Supply Chain Attack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/react-native-aria-packages-backdoored-in-supply-chain-attack/"
    },
    {
        "Title": "Malicious NPM Packages Disguised as Express Utilities Allow Attackers to Wipe Systems",
        "Link": "https://www.securityweek.com/malicious-npm-packages-disguised-as-express-utilities-allow-attackers-to-wipe-systems/",
        "Summary": "<p>Two malicious NPM packages contain code that would delete production systems when triggered with the right credentials.</p>\n<p>The post <a href=\"https://www.securityweek.com/malicious-npm-packages-disguised-as-express-utilities-allow-attackers-to-wipe-systems/\">Malicious NPM Packages Disguised as Express Utilities Allow Attackers to Wipe Systems</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/malicious-npm-packages-disguised-as-express-utilities-allow-attackers-to-wipe-systems/"
    },
    {
        "Title": "iMessage Zero-Click Attacks Suspected in Targeting of High-Value Individuals",
        "Link": "https://www.securityweek.com/imessage-zero-click-attacks-suspected-in-targeting-of-high-value-eu-us-individuals/",
        "Summary": "<p>iVerify links iPhone crashes to sophisticated zero-click attacks via iMessage targeting individuals involved in politics in the EU and US.</p>\n<p>The post <a href=\"https://www.securityweek.com/imessage-zero-click-attacks-suspected-in-targeting-of-high-value-eu-us-individuals/\">iMessage Zero-Click Attacks Suspected in Targeting of High-Value Individuals</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/imessage-zero-click-attacks-suspected-in-targeting-of-high-value-eu-us-individuals/"
    },
    {
        "Title": "US Seeks Forfeiture of $7.74M in Cryptocurrency Tied to North Korean IT Workers",
        "Link": "https://www.securityweek.com/us-seeks-forfeiture-of-7-74m-in-cryptocurrency-tied-to-north-korean-it-workers/",
        "Summary": "<p>The US is seeking the forfeiture of $7.74 million in cryptocurrency in frozen wallets tied to North Korean fake IT workers schemes.</p>\n<p>The post <a href=\"https://www.securityweek.com/us-seeks-forfeiture-of-7-74m-in-cryptocurrency-tied-to-north-korean-it-workers/\">US Seeks Forfeiture of $7.74M in Cryptocurrency Tied to North Korean IT Workers</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/us-seeks-forfeiture-of-7-74m-in-cryptocurrency-tied-to-north-korean-it-workers/"
    },
    {
        "Title": "Nigerian Involved in Hacking US Tax Preparation Firms Sentenced to Prison",
        "Link": "https://www.securityweek.com/nigerian-involved-in-hacking-us-tax-preparation-firms-sentenced-to-prison/",
        "Summary": "<p>Kingsley Uchelue Utulu has been sentenced to more than 5 years in prison for his role in a scheme that involved hacking, fraud and identity theft.</p>\n<p>The post <a href=\"https://www.securityweek.com/nigerian-involved-in-hacking-us-tax-preparation-firms-sentenced-to-prison/\">Nigerian Involved in Hacking US Tax Preparation Firms Sentenced to Prison </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/nigerian-involved-in-hacking-us-tax-preparation-firms-sentenced-to-prison/"
    },
    {
        "Title": "Trump Cybersecurity Executive Order Targets Digital Identity, Sanctions Policies",
        "Link": "https://www.securityweek.com/trump-cybersecurity-executive-order-targets-digital-identity-sanctions-policies/",
        "Summary": "<p>President Trump says his new cybersecurity executive order amends problematic elements of Biden- and Obama-era executive orders.</p>\n<p>The post <a href=\"https://www.securityweek.com/trump-cybersecurity-executive-order-targets-digital-identity-sanctions-policies/\">Trump Cybersecurity Executive Order Targets Digital Identity, Sanctions Policies</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/trump-cybersecurity-executive-order-targets-digital-identity-sanctions-policies/"
    },
    {
        "Title": "Mexican Football Club Pachuca and Affiliated University Allegedly Hit by Massive 50 GB Data Breach",
        "Link": "https://dailydarkweb.net/mexican-football-club-pachuca-and-affiliated-university-allegedly-hit-by-massive-50-gb-data-breach/",
        "Summary": "Prominent Mexican soccer team Club de Fútbol Pachuca and its associated academic institution, Universidad del Futbol y Ciencias del Deporte (University of Football and Sports Sciences), have allegedly become the victims of a major data breach. An unknown threat actor has claimed on a popular hacking forum to have successfully infiltrated the organizations&#8217; servers, exfiltrating [&#8230;]",
        "Date": "2025-06-09",
        "Content": "Prominent Mexican soccer team Club de Fútbol Pachuca and its associated academic institution, Universidad del Futbol y Ciencias del Deporte (University of Football and Sports Sciences), have allegedly become the victims of a major data breach. An unknown threat actor has claimed on a popular hacking forum to have successfully infiltrated the organizations’ servers, exfiltrating a substantial 50 GB of sensitive data. Club Pachuca is one of the oldest and most successful teams in Mexico’s top football league, Liga MX, making this a high-profile incident with potentially widespread consequences for players, staff, and students.\nThe perpetrator posted evidence of the intrusion, which disturbingly points to a server running Microsoft Windows Server 2003, an obsolete and unsupported operating system that has not received security updates in many years. This critical vulnerability likely served as the entry point for the attack. The breach’s origin from a server with such outdated software highlights the severe risks associated with legacy systems in handling sensitive information. The actor claims the stolen database contains a wealth of personal and critical information, putting individuals connected to both the club and the university at significant risk of fraud and identity theft.\nThe compromised data allegedly includes a wide range of sensitive information. The threat actor listed the following categories of leaked data:\nTelephone numbers\nFull database and systems access\nPlayers’ addresses\nElectronic emails\nPasswords\nTags:\nCyberSecurity\ndata-breach\ndata-leak\nhacking\nLiga MX\nMexico\nPachuca\nvulnerability"
    },
    {
        "Title": "Patient Data from Russian Medical Group Universantal Allegedly Leaked",
        "Link": "https://dailydarkweb.net/patient-data-from-russian-medical-group-universantal-allegedly-leaked/",
        "Summary": "A threat actor has allegedly posted for sale the database of Universantal, a Russian entity that is part of the &#8220;CSM-Santal&#8221; group of companies operating medical clinics and professional education centers across Russia. The Santal group has a significant presence in the country&#8217;s healthcare and medical education sectors, with facilities in cities such as Tomsk, [&#8230;]",
        "Date": "2025-06-09",
        "Content": "A threat actor has allegedly posted for sale the database of Universantal, a Russian entity that is part of the “CSM-Santal” group of companies operating medical clinics and professional education centers across Russia. The Santal group has a significant presence in the country’s healthcare and medical education sectors, with facilities in cities such as Tomsk, Krasnodar, and Novosibirsk. This breach could potentially impact a large number of patients and medical professionals who have interacted with their services.\nThe data was advertised on a dark web forum and is said to contain 493,000 lines of sensitive information. The actor claims the database includes a wide range of personally identifiable information (PII) and protected health information (PHI). The leak of such detailed records, especially the inclusion of the SNILS (the Russian individual insurance account number), poses a severe risk of identity theft, fraud, and other malicious activities for the individuals affected.\nThe compromised data allegedly includes the following details:\nRegistration codes\nPatient full names\nGender and date of birth\nSNILS (Russian social security number)\nPhone numbers and email addresses\nDocument details\nHome and workplace addresses\nOther miscellaneous information\nTags:\ncybersecurity news\ndata-breach\nHealthcare\nPII\nRussia\nSantal Group\nUniversantal"
    },
    {
        "Title": "Vietnamese E-commerce Company Allegedly Breached",
        "Link": "https://dailydarkweb.net/vietnamese-e-commerce-company-allegedly-breached/",
        "Summary": "A company operating in Vietnam&#8217;s e-commerce sector is allegedly the victim of a data breach. A threat actor has posted on a messaging platform claiming to be in possession of a real-time shopping database belonging to an unnamed Vietnamese online retailer. A potential compromise of the platform&#8217;s data could be a serious concern for its [&#8230;]",
        "Date": "2025-06-09",
        "Content": "A company operating in Vietnam’s e-commerce sector is allegedly the victim of a data breach. A threat actor has posted on a messaging platform claiming to be in possession of a real-time shopping database belonging to an unnamed Vietnamese online retailer. A potential compromise of the platform’s data could be a serious concern for its users.\nThe seller of the database claims that the data is “fresh & verified,” and captured on a daily basis, which could suggest an ongoing breach of a live system. The advertisement for the sale describes the leak as “exclusive” and originating directly from the e-commerce source. The potential exposure of customer information is extensive, allegedly including a wide array of personal and transactional details. This incident highlights the persistent threats facing online businesses and the critical importance of cybersecurity measures to protect customer data.\nThe compromised information allegedly includes the following details:\nSales list\nCustomer name\nEmail\nPhone number\nAddress\nOrder code and date\nProduct information\nDiscounts and payment details\nTotal amount of purchase\nPayment method\nDelivery status and charges\nTags:\nCyberSecurity\ndata-breach\ndata-leak\ne-commerce\nVietnam"
    },
    {
        "Title": "Brazilian Preparatory Course for Dentists Allegedly Breached",
        "Link": "https://dailydarkweb.net/brazilian-preparatory-course-for-dentists-allegedly-breached/",
        "Summary": "A significant data breach has allegedly occurred, impacting Preparatório Bucomaxilo, a Brazilian educational platform that provides preparatory courses for dental professionals aspiring to specialize in Bucomaxillofacial Surgery (CTBMF). The institution is a key resource for dentistry students and practicing dentists across Brazil, offering specialized training and resources to help them pass residency entrance exams. The [&#8230;]",
        "Date": "2025-06-09",
        "Content": "A significant data breach has allegedly occurred, impacting Preparatório Bucomaxilo, a Brazilian educational platform that provides preparatory courses for dental professionals aspiring to specialize in Bucomaxillofacial Surgery (CTBMF). The institution is a key resource for dentistry students and practicing dentists across Brazil, offering specialized training and resources to help them pass residency entrance exams. The platform’s importance lies in its focused curriculum and its role in shaping the careers of future dental surgeons in the country. The alleged breach is said to have originated from a SQL database associated with the company’s website, preparatoriobucomaxilo.com.br.\nThe compromised data, reportedly contained in a 50MB zipped SQL file, is alleged to include a wide range of sensitive personal and user information. The breach, dated June 6, 2025, appears to have exposed the records of over 5,200 users. The leaked information allegedly contains detailed user data from the website’s WordPress database, potentially exposing users to various online threats, including phishing scams, identity theft, and other malicious activities.\nThe compromised database allegedly includes the following information:\nUser IDs\nUser login names and display names\nHashed passwords\nFull names\nEmail addresses\nUser registration dates and IP addresses\nContact form submissions with personal details such as RG (Brazilian ID), CPF (Brazilian individual taxpayer registry), phone numbers, and professional information.\nTags:\nBrazil\nCyberSecurity\ndata-breach\ndata-leak\nEducation\nHealthcare\nPreparatório Bucomaxilo\nSQL injection"
    },
    {
        "Title": "Al Tadawi Specialty Hospital Allegedly Breached by Nightspire Ransomware Group",
        "Link": "https://dailydarkweb.net/al-tadawi-specialty-hospital-allegedly-breached-by-nightspire-ransomware-group/",
        "Summary": "The Nightspire ransomware group has allegedly targeted Al Tadawi Specialty Hospital, a prominent healthcare provider based in Dubai, United Arab Emirates. The cybercriminal group has claimed responsibility for the attack, asserting that they have exfiltrated a significant 1.5 terabytes of data from the hospital&#8217;s systems. According to the group&#8217;s dark web post, the breach occurred [&#8230;]",
        "Date": "2025-06-09",
        "Content": "The Nightspire ransomware group has allegedly targeted Al Tadawi Specialty Hospital, a prominent healthcare provider based in Dubai, United Arab Emirates. The cybercriminal group has claimed responsibility for the attack, asserting that they have exfiltrated a significant 1.5 terabytes of data from the hospital’s systems. According to the group’s dark web post, the breach occurred on June 8, 2025, with a deadline for the data to be leaked set for June 13, 2025. This incident places highly sensitive patient and operational data at severe risk.\nAl Tadawi Specialty Hospital is a key institution in the UAE’s healthcare sector, offering a comprehensive range of medical services, including cardiology, neurosurgery, orthopedics, and pediatric care. The hospital is known for its advanced medical technology and serves a large number of patients, making the potential data leak particularly impactful. A breach of this magnitude could expose confidential patient records, financial information, and internal hospital documents, leading to serious privacy violations and potential identity theft for the individuals affected.\nThe full extent and nature of the compromised data have not been officially confirmed by the hospital. However, based on the claims made by the Nightspire group, the stolen information could include a vast array of sensitive details. The alleged exfiltrated data may contain:\nPatient medical records and history\nPersonal identification documents\nFinancial and insurance information\nInternal hospital administrative files\nEmployee data\nTags:\nAl Tadawi Specialty Hospital\nCyberSecurity\ndata-breach\nDubai\nHealthcare\nNightspire\nransomware\nUAE"
    },
    {
        "Title": "CookUnity, Origin PC, and OurBus Databases Allegedly for Sale on Hacker Forum",
        "Link": "https://dailydarkweb.net/cookunity-origin-pc-and-ourbus-databases-allegedly-for-sale-on-hacker-forum/",
        "Summary": "A threat actor is allegedly selling sensitive databases belonging to a trio of US-based companies on a popular hacking forum, placing the data of millions of individuals at risk. The origin of the alleged breaches has not been disclosed. The targeted companies span the meal-delivery, custom computer, and transportation industries. The allegedly compromised companies are: [&#8230;]",
        "Date": "2025-06-09",
        "Content": "A threat actor is allegedly selling sensitive databases belonging to a trio of US-based companies on a popular hacking forum, placing the data of millions of individuals at risk. The origin of the alleged breaches has not been disclosed. The targeted companies span the meal-delivery, custom computer, and transportation industries.\nThe allegedly compromised companies are:\nCookUnity:\nA major meal-delivery service with a reported annual revenue of over $500 million.\nOrigin PC:\nA well-known custom PC manufacturer and a subsidiary of the major tech hardware company Corsair, with revenues stated to be over $1.2 billion.\nOurBus:\nAn intercity bus booking service with a reported revenue of more than $24 million.\nThe seller is offering the vast datasets for prices ranging from $300 to $700 and claims they contain millions of records, including over 99 million for CookUnity alone. The potential exposure from this alleged leak is significant, potentially compromising the personal and financial information of both customers and employees. The data for sale allegedly includes:\nAll Customer Information (including full names, emails, phone numbers, and billing addresses)\nEmployee Data\nAll Orders\nAll Stripe Invoices\nTags:\nallegedly\nCookUnity\nCorsair\nCyberSecurity\ndata-breach\ndata-leak\nOrigin PC\nOurBus"
    }
]