[
    {
        "Title": "Popular Chrome Extensions Leak API Keys, User Data via HTTP and Hardcoded Credentials",
        "Link": "https://thehackernews.com/2025/06/popular-chrome-extensions-leak-api-keys.html",
        "Summary": "Cybersecurity researchers have flagged several popular Google Chrome extensions that have been found to transmit data in HTTP and hard-code secrets in their code, exposing users to privacy and security risks.\n\n\"Several widely used extensions [...] unintentionally transmit sensitive data over simple HTTP,\" Yuanjing Guo, a security researcher in the Symantec's Security Technology and Response",
        "Date": "2025-06-05",
        "Content": "Cybersecurity researchers have flagged several popular Google Chrome extensions that have been found to transmit data in HTTP and hard-code secrets in their code, exposing users to privacy and security risks.\n\"Several widely used extensions [...] unintentionally transmit sensitive data over simple HTTP,\" Yuanjing Guo, a security researcher in the Symantec's Security Technology and Response team,\nsaid\n. \"By doing so, they expose browsing domains, machine IDs, operating system details, usage analytics, and even uninstall information, in plaintext.\"\nThe fact that the network traffic is unencrypted also means that they are susceptible to adversary-in-the-middle (AitM) attacks, allowing malicious actors on the same network such as a public Wi-Fi to intercept and, even worse, modify this data, which could lead to far more serious consequences.\nThe list of identified extensions are below -\nSEMRush Rank\n(extension ID: idbhoeaiokcojcgappfigpifhpkjgmab) and PI Rank (ID: ccgdboldgdlngcgfdolahmiilojmfndl), which call the URL \"rank.trellian[.]com\" over plain HTTP\nBrowsec VPN (ID: omghfjlpggmjjaagoclmmobgdodcjboh), which uses HTTP to call an uninstall URL at \"browsec-uninstall.s3-website.eu-central-1.amazonaws[.]com\" when a user attempts to uninstall the extension\nMSN New Tab\n(ID: lklfbkdigihjaaeamncibechhgalldgl) and MSN Homepage, Bing Search & News (ID: midiombanaceofjhodpdibeppmnamfcj), which transmit a unique machine identifier and other details over HTTP to \"g.ceipmsn[.]com\"\nDualSafe Password Manager & Digital Vault\n(ID: lgbjhdkjmpgjgcbcdlhkokkckpjmedgc), which constructs an HTTP-based URL request to \"stats.itopupdate[.]com\" along with information about the extension version, user's browser language, and usage \"type\"\n\"Although credentials or passwords do not appear to be leaked, the fact that a password manager uses unencrypted requests for telemetry erodes trust in its overall security posture,\" Guo said.\nSymantec said it also\nidentified\nanother set of extensions with API keys, secrets, and tokens directly embedded in the JavaScript code, which an attacker could weaponize to craft malicious requests and carry out various malicious actions -\nOnline Security & Privacy extension\n(ID: gomekmidlodglbbmalcneegieacbdmki), AVG Online Security (ID: nbmoafcmbajniiapeidgficgifbfmjfo), Speed Dial [FVD] - New Tab Page, 3D, Sync (ID: llaficoajjainaijghjlofdfmbjpebpa), and SellerSprite - Amazon Research Tool (ID: lnbmbgocenenhhhdojdielgnmeflbnfb), which expose a hard-coded Google Analytics 4 (GA4) API secret that an attacker could use to bombard the GA4 endpoint and corrupt metrics\nEquatio – Math Made Digital\n(ID: hjngolefdpdnooamgdldlkjgmdcmcjnc), which embeds a Microsoft Azure API key used for speech recognition that an attacker could use to inflate the developer's costs or exhaust their usage limits\nAwesome Screen Recorder & Screenshot\n(ID: nlipoenfbbikpbjkfpfillcgkoblgpmj) and Scrolling Screenshot Tool & Screen Capture (ID: mfpiaehgjbbfednooihadalhehabhcjo), which expose the developer's Amazon Web Services (AWS) access key used to upload screenshots to the developer's S3 bucket\nMicrosoft Editor – Spelling & Grammar Checker\n(ID: gpaiobkfhnonedkhhfjpmhdalgeoebfa), which exposes a telemetry key named \"StatsApiKey\" to log user data for analytics\nAntidote Connector\n(ID: lmbopdiikkamfphhgcckcjhojnokgfeo), which incorporates a third-party library called InboxSDK that contains hard-coded credentials, including API keys.\nWatch2Gether\n(ID: cimpffimgeipdhnhjohpbehjkcdpjolg), which exposes a Tenor GIF search API key\nTrust Wallet\n(ID: egjidjbpglichdcondbcbdnbeeppgdph), which exposes an API key associated with the Ramp Network, a Web3 platform that offers wallet developers a way to let users buy or sell crypto directly from the app\nTravelArrow\n– Your Virtual Travel Agent (ID: coplmfnphahpcknbchcehdikbdieognn), which exposes a geolocation API key when making queries to \"ip-api[.]com\"\nAttackers who end up finding these keys could weaponize them to drive up API costs, host illegal content, send spoofed telemetry data, and mimic cryptocurrency transaction orders, some of which could see the developer's ban getting banned.\nAdding to the concern, Antidote Connector is just one of over 90 extensions that use InboxSDK, meaning the other extensions are susceptible to the same problem. The names of the other extensions were not disclosed by Symantec.\n\"From GA4 analytics secrets to Azure speech keys, and from AWS S3 credentials to Google-specific tokens, each of these snippets demonstrates how a few lines of code can jeopardize an entire service,\" Guo said. \"The solution: never store sensitive credentials on the client side.\"\nDevelopers are recommended to switch to HTTPS whenever they send or receive data, store credentials securely in a backend server using a credentials management service, and regularly rotate secrets to further minimize risk.\nThe findings show how even popular extensions with hundreds of thousands of installations can suffer from trivial misconfigurations and security blunders like hard-coded credentials, leaving users' data at risk.\n\"Users of these extensions should consider removing them until the developers address the insecure [HTTP] calls,\" the company said. \"The risk is not just theoretical; unencrypted traffic is simple to capture, and the data can be used for profiling, phishing, or other targeted attacks.\"\n\"The overarching lesson is that a large install base or a well-known brand does not necessarily ensure best practices around encryption. Extensions should be scrutinized for the protocols they use and the data they share, to ensure users' information remains truly safe.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Researchers Detail Bitter APT’s Evolving Tactics as Its Geographic Scope Expands",
        "Link": "https://thehackernews.com/2025/06/bitter-hacker-group-expands-cyber.html",
        "Summary": "The threat actor known as Bitter has been assessed to be a state-backed hacking group that's tasked with gathering intelligence that aligns with the interests of the Indian government.\nThat's according to new findings jointly published by Proofpoint and Threatray in an exhaustive two-part analysis.\n\"Their diverse toolset shows consistent coding patterns across malware families, particularly in",
        "Date": "2025-06-05",
        "Content": "The threat actor known as\nBitter\nhas been assessed to be a state-backed hacking group that's tasked with gathering intelligence that aligns with the interests of the Indian government.\nThat's according to new findings jointly published by Proofpoint and Threatray in an\nexhaustive\ntwo-part\nanalysis.\n\"Their diverse toolset shows consistent coding patterns across malware families, particularly in system information gathering and string obfuscation,\" researchers Abdallah Elshinbary, Jonas Wagner, Nick Attfield, and Konstantin Klinger said.\nBitter, also known as APT-C-08, APT-Q-37, Hazy Tiger, Orange Yali, T-APT-17, and TA397, has a\nhistory\nof\nfocusing\nprimarily on\nSouth Asian entities\n, with select intrusions also targeting China, Saudi Arabia, and South America.\nIn December 2024, evidence\nemerged\nof the threat actor's targeting of Turkey using malware families such as WmRAT and MiyaRAT, indicating a gradual geographical expansion.\nStating that Bitter frequently singles out an \"exceedingly small subset of targets,\" Proofpoint said the attacks are aimed at governments, diplomatic entities, and defense organizations so as to enable intelligence collection on foreign policy or current affairs.\nAttack chains mounted by the group typically leverage spear-phishing emails, with the messages sent from providers like 163[.]com, 126[.]com, and ProtonMail, as well as compromised accounts associated with the governments of Pakistan, Bangladesh, and Madagascar.\nThe threat actor has also been observed masquerading as government and diplomatic entities from China, Madagascar, Mauritius, and South Korea in these campaigns to entice recipients into malware-laced attachments that trigger the deployment of malware.\nOverview of Bitter's infection chains\n\"Based on the content and the decoy documents employed, it is clear that TA397 has no qualms with masquerading as other countries' governments, including Indian allies,\" the enterprise security company said.\n\"While TA397's targets in these campaigns were Turkish and Chinese entities with a presence in Europe, it signals that the group likely has knowledge and visibility into the legitimate affairs of Madagascar and Mauritius and uses the material in spearphishing operations.\"\nFurthermore, Bitter has been found to engage in hands-on-keyboard activity in two distinct campaigns targeting government organizations to conduct further enumeration activities on the targeted hosts and drop additional payloads like KugelBlitz and\nBDarkRAT\n, a .NET trojan that was first documented in 2019.\nIt features standard remote access trojan capabilities such as gathering system information, executing shell commands, downloading files, and managing files on the compromised host.\nBitter's Malware Families\nSome of the other known tools in its arsenal are below -\nArtraDownloader\n, a downloader written in C++ that collects system information and uses HTTP requests to download and execute a remote file\nKeylogger\n, a C++ module used in various campaigns to record keystrokes and clipboard content\nWSCSPL Backdoor\n, a backdoor that's delivered via ArtraDownloader and supports commands to get machine information, execute remote instructions, and download and run files\nMuuyDownloader\n(aka ZxxZ), a trojan that allows remote code execution of payloads received from a remote server\nAlmond RAT\n, a .NET trojan that offers basic data gathering functionality and the ability to execute arbitrary commands and transfer files\nORPCBackdoor\n, a backdoor that uses the RPC protocol to communicate with a command-and-control (C2) server and runs operator-issued instructions\nKiwiStealer\n, a stealer that searches for files matching a predefined set of extensions, are smaller than 50 MB, and have been modified within the past year, and exfiltrates them to a remote server\nKugelBlitz\n, a shellcode loader that's used to deploy the Havoc C2 framework\nIt's worth noting that ORPCBackdoor has been attributed by the Knownsec 404 Team to a threat actor called\nMysterious Elephant\n, which it said overlaps with other India-aligned threat clusters, including SideWinder, Patchwork, Confucius, and Bitter.\nAnalysis of the hands-on-keyboards activity highlights a \"Monday to Friday working hours schedule in Indian Standard Timezone (IST),\" which is also consistent with the time when WHOIS domain registrations and TLS certificate issuances take place.\n\"TA397 is an espionage-focused threat actor that highly likely operates on behalf of an Indian intelligence organization,\" the researchers said. \"There is a clear indication that most infrastructure-related activity occurs during standard business hours in the IST timezone.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Redefining Cyber Value: Why Business Impact Should Lead the Security Conversation",
        "Link": "https://thehackernews.com/2025/06/redefining-cyber-value-why-business.html",
        "Summary": "Security teams face growing demands with more tools, more data, and higher expectations than ever. Boards approve large security budgets, yet still ask the same question: what is the business getting in return? CISOs respond with reports on controls and vulnerability counts – but executives want to understand risk in terms of financial exposure, operational impact, and avoiding loss.\nThe",
        "Date": "2025-06-05",
        "Content": "Security teams face growing demands with more tools, more data, and higher expectations than ever. Boards approve large security budgets, yet still ask the same question: what is the business getting in return? CISOs respond with reports on controls and vulnerability counts – but executives want to understand risk in terms of financial exposure, operational impact, and avoiding loss.\nThe disconnect has become difficult to ignore. The average cost of a breach has reached $4.88 million, according to\nrecent IBM data\n. That figure reflects not just incident response but also downtime, lost productivity, customer attrition, and the extended effort required to restore operations and trust. The fallout is rarely confined to security.\nSecurity leaders need a model that brings those consequences into view before they surface. A Business Value Assessment (BVA) offers that model. It links exposures to cost, prioritization to return, and prevention to tangible value.\nThis article will explain how a BVA works, what it measures, and why it is becoming essential for organizations that understand that cybersecurity is a key business function, not just an IT issue.\nWhy Security Metrics No Longer Translate\nMost security metrics were built for operational teams, not business leaders. CVE counts, patch rates and tool coverage help track progress, but they don't answer the questions that matter to the board: What would a breach actually cost us? How much risk have we taken off the table? Where does this investment make a difference?\nTraditional metrics fall short for a few key reasons:\nThey show activity, not impact.\nSaying 3,000 vulnerabilities were fixed last quarter doesn't explain whether any of them were tied to systems that matter. It tells you what got done - not what got safer. (if you want to learn more about this topic, check out our\nrecent webinar\non it – it's filled with can't-miss insights into how vanity metrics will throw off your understanding of your security posture, and what to do about it. )\nThey miss how exposures connect.\nA single misconfiguration might look minor until it combines with an identity issue or a flat network segment. Most metrics don't reflect how attackers chain weaknesses to reach critical assets.\nThey leave out financial consequences.\nBreach costs aren't one-size-fits-all. They depend on everything from detection time and data type to cloud complexity and staffing gaps - factors most dashboards never touch.\nA BVA helps bridge the gap between technical findings and what the business actually needs to understand. It connects exposure data to financial impact, using breach cost modeling grounded in real-world research. Assessments should be based on inputs from sources like the IBM Cost of a Data Breach Report, which outlines factors that shape the cost of an incident - from how quickly a breach is detected to how complex the IT environment is. IBM uses those factors to analyze what a breach costs after the fact – but they can also be used to project what it could cost\nahead of time\n, based on the organization's actual posture.\nThat's where a BVA comes in. Rather than tracking surface-level metrics, it reframes cybersecurity in terms of outcomes. It shifts the conversation. It moves from counting remediations to showing outcomes. It offers a clear picture of how exposures lead to impact, what's at stake, and where security investments can deliver measurable value. That gives security leaders the context they need to support decisions with confidence.\nThe Business Value Assessment: What It Measures\nIt's one thing to say a risk has been reduced. It's another to show what that means in dollars, time, or business impact. That's what a BVA is purpose-built to do. It connects the dots between security work and outcomes that the rest of the business actually cares about. A BVA should focus on three things:\nCost Avoidance\n– What would a breach likely cost based on the risks in your environment, and how much of that can be prevented by fixing the right exposures?\nCost Reduction\n– Where can security efforts help cut spending? That might include shrinking the scope of manual testing, reducing patching overhead, or improving your insurance profile by showing better risk posture.\nEfficiency Gains\n– How much time and effort can you save by giving your team better priorities and automating what doesn't need a human touch?\nThese real-world numbers help security leaders plan better, spend smarter, and make the case when decisions or budgets are on the line.\nWhy Delay and Inaction Cost More Than You Think\nThe financial impact of a breach increases with every day of delay. Incidents involving identity-based exposures or shadow data now take over 290 days to contain. During that time, businesses experience loss of revenue, stalled operations, and prolonged reputational harm. What's more, the IBM report shows that 70% of breaches lead to major operational disruption - many of those never fully recover.\nA BVA brings clarity to that timeline. It identifies the exposures most likely to prolong an incident and estimates the cost of that delay based on both your industry and organizational profile. It also helps evaluate the return of preemptive controls. For example, IBM found that companies that deploy effective automation and AI-based remediation see breach costs drop by as much as $2.2 million.\nSome organizations hesitate to act when the value isn't clearly defined. That delay has a cost. A BVA should include a \"cost of doing nothing\" model that estimates the monthly loss a company takes on by leaving exposures unaddressed. We've found that for a large enterprise, that cost can exceed half a million dollars.\nBut understanding the cost of inaction is only half the battle. To truly change outcomes, security leaders need to use that understanding to guide strategy and build cross-functional support.\nThe Bottom Line: From Spend to Strategy, BVA Builds Alignment\nThere's no question about how well security teams are doing the work. The issue is that traditional metrics don't always show what their work\nmeans\n. Patch counts and tool coverage aren't what boards care about. They want to know what's actually being protected. A BVA helps connect the dots – showing how day-to-day security efforts help the business avoid losses, save time, and stay more resilient.\nIt also makes hard conversations easier. Whether it's justifying a budget, walking the board through risk, or answering questions from insurers, a BVA gives security leaders something solid to point to. It shows where the team is making a difference – cutting down on busywork, reducing third-party testing, and improving how the organization handles risk.\nAnd most importantly, it gets everyone on the same page. Security, IT, and finance don't have to guess at each other's priorities. They can work from the same numbers, focus on what really matters, and move faster when it counts.\nIt's this shift that makes the real difference. Security stops being the team that says \"no\" and starts being the team that helps the business move forward. With a BVA, leadership finally has a clear way to see progress, make smarter decisions, and deal with risk before it turns into something bigger.\n*****\nWant to see what a BVA can tell you about risk in your organization? Check out the\nXM Cyber ROI Calculator\nand start understanding how to avoid losses, save time, and stay more resilient.\nNote: This expert article was contributed by David Lettvin, Inside Channel Account Manager, XM Cyber.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Iran-Linked BladedFeline Hits Iraqi and Kurdish Targets with Whisper and Spearal Malware",
        "Link": "https://thehackernews.com/2025/06/iran-linked-bladedfeline-hits-iraqi-and.html",
        "Summary": "An Iran-aligned hacking group has been attributed to a new set of cyber attacks targeting Kurdish and Iraqi government officials in early 2024.\nThe activity is tied to a threat group ESET tracks as BladedFeline, which is assessed with medium confidence to be a sub-cluster within OilRig, a known Iranian nation-state cyber actor. It's said to be active since September 2017, when it targeted",
        "Date": "2025-06-05",
        "Content": "An Iran-aligned hacking group has been attributed to a new set of cyber attacks targeting Kurdish and Iraqi government officials in early 2024.\nThe activity is tied to a threat group ESET tracks as\nBladedFeline\n, which is assessed with medium confidence to be a sub-cluster within\nOilRig\n, a known Iranian nation-state cyber actor. It's said to be active since September 2017, when it targeted officials associated with the Kurdistan Regional Government (KRG).\n\"This group develops malware for maintaining and expanding access within organizations in Iraq and the KRG,\" the Slovak cybersecurity company\nsaid\nin a technical report shared with The Hacker News.\n\"BladedFeline has worked consistently to maintain illicit access to Kurdish diplomatic officials, while simultaneously exploiting a regional telecommunications provider in Uzbekistan, and developing and maintaining access to officials in the government of Iraq.\"\nBladedFeline was\nfirst documented\nby ESET in May 2024 as part of its APT Activity Report Q4 2023–Q1 2024, detailing the adversary's attack on a governmental organization from the Kurdistan region of Iraq and its targeting of the Uzbekistan telecom provider that may have been compromised as early as May 2022.\nThe group was discovered in 2023 following attacks aimed at Kurdish diplomatic officials with Shahmaran, a simple backdoor that checks in with a remote server and executes any operator-provided commands on the infected host to upload or download files, request specific file attributes, and provide a file and directory manipulation API.\nThen last November, the cybersecurity firm\nsaid\nit observed the hacking crew orchestrating attacks against Iran's neighbors, particularly regional and government entities in Iraq and diplomatic envoys from Iraq to various countries, using bespoke backdoors like Whisper (aka Veaty), Spearal, and Optimizer.\n\"BladedFeline has invested heavily in gathering diplomatic and financial information from Iraqi organizations, indicating that Iraq plays a large part in the strategic objectives of the Iranian government,\" ESET noted in November 2024. \"Additionally, governmental organizations in Azerbaijan have been another focus of BladedFeline.\"\nWhile the exact initial access vector used to get into KRG victims is unclear, it's suspected that the threat actors likely leveraged a vulnerability in an internet-facing application to break into Iraqi government networks and deploy the Flog web shell to maintain persistent remote access.\nThe inner workings of the Whisper backdoor\nThe wide range of backdoors highlights BladedFeline's commitment to refining its malware arsenal. Whisper is a C#/.NET backdoor that logs into a compromised webmail account on a Microsoft Exchange server and uses it to communicate with the attackers via email attachments. Spearal is a .NET backdoor that utilizes DNS tunneling for command-and-control communication.\n\"Optimizer is an iterative update on the Spearal backdoor. It uses the same workflow and offers the same features. The main differences between Spearal and Optimizer are largely cosmetic,\" the ESET research team told The Hacker News.\nSelect attacks observed in December 2023 have also involved the deployment of a Python implant referred to as Slippery Snakelet that comes with limited capabilities to execute commands via \"cmd.exe,\" download files from an external URL, and upload files.\nThe backdoors notwithstanding, BladedFeline is notable for the use of various tunneling tools Laret and Pinar to maintain access to target networks. Also put to use is a malicious IIS module dubbed PrimeCache, which ESET said bears similarities to the\nRDAT\nbackdoor used by OilRig APT.\nA passive backdoor, PrimeCache works by keeping an eye out for incoming HTTP requests matching a predefined cookie header structure in order to process commands issued by the attacker and exfiltrate files.\nIt's this aspect, coupled with the fact that two of OilRig's tools – RDAT and a reverse shell codenamed VideoSRV – were discovered on a compromised KRG system in September 2017 and January 2018, respectively, has led to the possibility that BladedFeline may be a subgroup within OilRig, but also different from\nLyceum\n– a moniker assigned to a different sub-cluster.\nThe OilRig connection is also\nreinforced\nby a September 2024 report from Check Point, which pointed fingers at the Iranian hacking group for infiltrating the networks of Iraqi government networks and infecting them with Whisper and Spearal using likely social engineering efforts.\nESET said it identified a malicious artifact named Hawking Listener that was uploaded to the VirusTotal platform in March 2024 by the same party that uploaded Flog. Hawking Listener is an early-stage implant that listens on a specified port to run commands through \"cmd.exe.\"\n\"BladedFeline is targeting the KRG and the GOI for cyber espionage purposes, with an eye toward maintaining strategic access to high-ranking officials in both governmental entities,\" the company concluded.\n\"The KRG's diplomatic relationship with Western nations, coupled with the oil reserves in the Kurdistan region, makes it an enticing target for Iran-aligned threat actors to spy on and potentially manipulate. In Iraq, these threat actors are most probably trying to counter the influence of Western governments following the U.S. invasion and occupation of the country.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "DoJ Seizes 145 Domains Tied to BidenCash Carding Marketplace in Global Takedown",
        "Link": "https://thehackernews.com/2025/06/doj-seizes-145-domains-tied-to.html",
        "Summary": "The U.S. Department of Justice (DoJ) on Wednesday announced the seizure of cryptocurrency funds and about 145 clearnet and dark web domains associated with an illicit carding marketplace called BidenCash.\n\"The operators of the BidenCash marketplace use the platform to simplify the process of buying and selling stolen credit cards and associated personal information,\" the DoJ said. \"BidenCash",
        "Date": "2025-06-05",
        "Content": "The U.S. Department of Justice (DoJ) on Wednesday announced the seizure of cryptocurrency funds and about 145 clearnet and dark web domains associated with an illicit carding marketplace called BidenCash.\n\"The operators of the BidenCash marketplace use the platform to simplify the process of buying and selling stolen credit cards and associated personal information,\" the DoJ\nsaid\n. \"BidenCash administrators charged a fee for every transaction conducted on the website.\"\nBidenCash launched in March 2022 to fill the void left by the shutdown of\nJoker's Stash\na year earlier and several other carding forums like\nUniCC\n.\nSince the time it went operational, the illegal bazaar (\"bidencash[.]asia,\" \"bidencash[.]bd,\" and \"bidencash[.]ws\") is estimated to have supported more than 117,000 customers, facilitated the trafficking of over 15 million payment card numbers and personally identifiable information, and generated no less than $17 million in revenue.\nSpecifically, the platform published 3.3 million individual stolen credit cards for free to promote the use of their services between October 2022 and February 2023. The stolen data contained credit card numbers, expiration dates, Card Verification Value (CVV) numbers, account holder names, addresses, email addresses, and phone numbers.\nOf the 2.1 million compromised credit cards released in February 2023, 50% of the cards belonged to U.S.-based people or entities, according to\nFlashpoint\n.\nBidenCash also specialized in the sale of compromised credentials that could then be purchased by other criminal actors to obtain access to computers without authorization.\nIn a report published in May 2023, CloudSEK revealed that BidenCash had begun to offer to advertise SSH services to buyers for as low as $2, alongside offering a package of services to check the target server for the presence of shell, as well as information about its processing power, location, and security vulnerabilities, if any.\n\"This poses a significant risk as threat actors can leverage this power to conduct a wide range of malicious activities, such as data exfiltration, brute force and ransomware attacks, and cryptocurrency mining,\" the cybersecurity company\nsaid\nat the time.\nHowever, authorities did not disclose the value of the confiscated cryptocurrency funds, or identify the operators of BidenCash and their physical locations.\nThe crackdown on BidenCash, according to the seizure banner, is part of an international effort led by the U.S. Secret Service and the Federal Bureau of Investigation (FBI), in partnership with the Dutch Politie, the Shadowserver Foundation, and\nSearchlight Cyber\n.\nThe development comes days after a multinational law enforcement operation\nconfiscated\nfour domains that offered counter-antivirus (CAV) and crypting services to threat actors to ensure that their malicious software stayed undetected from security software.\nIt also follows the\narrest\nof a 35-year-old Ukrainian national who is alleged to have broken into more than 5,000 customer accounts at an unnamed hosting company to illicitly mine cryptocurrency on the hacked servers. The unnamed individual faces up to 15 years in prison.\nThe defendant is said to have used open-source intelligence to find and breach the vulnerable infrastructure of various international organizations and then deploy virtual machines to conduct unauthorized cryptojacking, resulting in $4.5 million in damages. The threat actor is believed to have been active since at least 2018.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Critical Cisco ISE Auth Bypass Flaw Impacts Cloud Deployments on AWS, Azure, and OCI",
        "Link": "https://thehackernews.com/2025/06/critical-cisco-ise-auth-bypass-flaw.html",
        "Summary": "Cisco has released security patches to address a critical security flaw impacting the Identity Services Engine (ISE) that, if successfully exploited, could allow unauthenticated actors to carry out malicious actions on susceptible systems.\nThe security defect, tracked as CVE-2025-20286, carries a CVSS score of 9.9 out of 10.0. It has been described as a static credential vulnerability.\n\"A",
        "Date": "2025-06-05",
        "Content": "Cisco has released security patches to address a critical security flaw impacting the Identity Services Engine (ISE) that, if successfully exploited, could allow unauthenticated actors to carry out malicious actions on susceptible systems.\nThe security defect, tracked as\nCVE-2025-20286\n, carries a CVSS score of 9.9 out of 10.0. It has been described as a static credential vulnerability.\n\"A vulnerability in Amazon Web Services (AWS), Microsoft Azure, and Oracle Cloud Infrastructure (OCI) cloud deployments of Cisco Identity Services Engine (ISE) could allow an unauthenticated, remote attacker to access sensitive data, execute limited administrative operations, modify system configurations, or disrupt services within the impacted systems,\" the company\nsaid\nin an advisory.\nThe networking equipment maker, which credited Kentaro Kawane of GMO Cybersecurity for reporting the flaw, noted it's aware of the existence of a proof-of-concept (PoC) exploit. There is no evidence that it has been maliciously exploited in the wild.\nCisco said the issue stems from the fact that credentials are improperly generated when Cisco ISE is being deployed on cloud platforms, causing different deployments to share the same credentials as long as the software release and cloud platform are the same.\nPut differently, the static credentials are specific to each release and platform, but are not valid across platforms. As the company highlights, all instances of Cisco ISE release 3.1 on AWS will have the same static credentials.\nHowever, credentials that are valid for access to a release 3.1 deployment would not be valid to access a release 3.2 deployment on the same platform. Furthermore, Release 3.2 on AWS would not have the same credentials as Release 3.2 on Azure.\nSuccessful exploitation of the vulnerability could permit an attacker to extract the user credentials from the Cisco ISE cloud deployment and then use it to access Cisco ISE deployed in other cloud environments through unsecured ports.\nThis could ultimately allow unauthorized access to sensitive data, execution of limited administrative operations, changes to system configurations, or service disruptions. That said, Cisco ISE is only affected in cases where the Primary Administration node is deployed in the cloud. Primary Administration nodes that are on-premises are not impacted.\nThe following versions are affected -\nAWS - Cisco ISE 3.1, 3.2, 3.3, and 3.4\nAzure - Cisco ISE 3.2, 3.3, and 3.4\nOCI - Cisco ISE 3.2, 3.3, and 3.4\nWhile there are no workarounds to address CVE-2025-20286, Cisco is recommending that users restrict traffic to authorized administrators or run the \"application reset-config ise\" command to reset user passwords to a new value. However, it bears noting that running the command will reset Cisco ISE to the factory configuration.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "ChatGPT prepares o3-pro model for $200 Pro subscribers",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-prepares-o3-pro-model-for-200-pro-subscribers/",
        "Summary": "OpenAI is planning to ship an update to ChatGPT that will turn on the new o3 Pro model, which has more compute to think harder. [...]",
        "Date": "2025-06-05",
        "Content": "OpenAI is planning to ship an update to ChatGPT that will turn on the new o3 Pro model, which has more compute to think harder.\nChatGPT currently offers o4-mini, o4-mini-high, GPT-4.5, GPT-4.1, GPT-4.1-mini, and o3 for $20 Plus subscribers.\nChatGPT $200 Pro subscription has all of those plus an o1 Pro model, which offers more compute to think harder.\no1 Pro is powerful, but feels outdated since we have a better o3 model in the lineup. However, this could change soon with the o3 Pro model.\no3-pro in ChatGPT model selector\nAs\nhinted\nat an event in New Delhi, OpenAI will soon swap out o1 Pro for o3 Pro, giving Pro users more power to solve tough problems.\nWhile o3 already outperforms o1 on benchmarks, o1 Pro provides extra compute for improved reliability on harder tasks.\nPreviously, o1 Pro outperformed both o1-preview and o1 on tougher benchmarks, including math contests, coding challenges, and PhD-level science questions.\no3 Pro is expected to combine o3’s stronger baseline reasoning with those reliability gains. It will increase the thinking capabilities of the existing o3 model and allow Pro users to do more.\nOpenAI could announce o3 Pro for $200 Pro subscribers as early as next week or later this month.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nResearchers claim ChatGPT o3 bypassed shutdown in controlled test\nOpenAI document explains when to use each ChatGPT model\nOpenAI is hopeful GPT-5 will compete a little more\nChatGPT rolls out Memory upgrade for free users\nOpenAI confirms Operator Agent is now more accurate with o3"
    },
    {
        "Title": "FBI: BADBOX 2.0 Android malware infects millions of consumer devices",
        "Link": "https://www.bleepingcomputer.com/news/security/fbi-badbox-20-android-malware-infects-millions-of-consumer-devices/",
        "Summary": "The FBI is warning that the BADBOX 2.0 malware campaign has infected over 1 million home Internet-connected devices, converting consumer electronics into residential proxies that are used for malicious activity. [...]",
        "Date": "2025-06-05",
        "Content": "The FBI is warning that the BADBOX 2.0 malware campaign has infected over 1 million home Internet-connected devices, converting consumer electronics into residential proxies that are used for malicious activity.\nThe BADBOX botnet is commonly found on Chinese Android-based smart TVs, streaming boxes, projectors, tablets, and other Internet of Things (IoT) devices.\n\"The BADBOX 2.0 botnet consists of millions of infected devices and maintains numerous backdoors to proxy services that cyber criminal actors exploit by either selling or providing free access to compromised home networks to be used for various criminal activity,\"\nwarns the FBI\n.\nThese devices come preloaded with the BADBOX 2.0 malware botnet or become infected after installing firmware updates and through malicious Android applications that sneak onto Google Play and third-party app stores.\n\"Cyber criminals gain unauthorized access to home networks by either configuring the product with malicious software prior to the users purchase or infecting the device as it downloads required applications that contain backdoors, usually during the set-up process,\" explains the FBI.\n\"Once these compromised IoT devices are connected to home networks, the infected devices are susceptible to becoming part of the BADBOX 2.0 botnet and residential proxy services4 known to be used for malicious activity.\"\nOnce infected, the devices connect to the attacker's command and control (C2) servers, where they receive commands to execute on the compromised devices, such as:\nResidential Proxy Networks:\nThe malware routes traffic from other cybercriminals through victims' home IP addresses, masking malicious activity.\nAd Fraud:\nBADBOX can load and click ads in the background, generating ad revenue for the threat actors.\nCredential Stuffing:\nBy leveraging victim IPs, attackers attempt to access other people's accounts using stolen credentials.\nBADBOX 2.0 evolved from the original BADBOX malware, which was\nfirst identified in 2023\nafter it was found pre-installed in cheap, no-name Android TV boxes like the T95.\nOver the years, the malware botnet continued expanding until 2024, when Germany's cybersecurity agency\ndisrupted the botnet\nin the country by sinkholing the communication between infected devices and the attacker's infrastructure, effectively rendering the malware useless.\nHowever, that did not stop the threat actors,\nwith researchers saying\nthey found the malware installed on 192,000 devices a week later. Even more concerning, the malware was found on more mainstream brands, like Yandex TVs and Hisense smartphones.\nUnfortunately, despite the previous disruption, the botnet continued to grow, with HUMAN's Satori Threat Intelligence stating that\nover 1 million consumer devices had become infected\nby March 2025.\nThis new larger botnet is now being called BADBOX 2.0 to indicate a new tracking of the malware campaign.\n\"This scheme impacted\nmore than 1 million consumer devices\n. Devices connected to the BADBOX 2.0 operation included lower-price-point, \"off brand\", uncertified tablets, connected TV (CTV) boxes, digital projectors, and more,\"\nexplains HUMAN\n.\n\"The infected devices are Android Open Source Project devices, not Android TV OS devices or\nPlay Protect certified Android devices\n. All of these devices are manufactured in mainland China and shipped globally; indeed, HUMAN observed BADBOX 2.0-associated traffic from\n222 countries and territories worldwide\n.\"\nResearchers at HUMAN estimate that the BADBOX 2.0 botnet spans 222 countries, with the highest number of compromised devices in Brazil (37.6%), the United States (18.2%), Mexico (6.3%), and Argentina (5.3%).\nBADBOX 2.0 Global Distribution\nSource: HUMAN Satori\nIn a joint operation led by HUMAN's Satori team and Google, Trend Micro, The Shadowserver Foundation, and other partners, the BADBOX 2.0 botnet was disrupted again to prevent over 500,000 infected devices from communicating with the attacker's servers.\nHowever, even with that disruption, the botnet continues to grow as consumers purchase more compromised products and connect them to the Internet.\nA list of devices known to be impacted by the BADBOX malware are listed below:\nDevice Model\nDevice Model\nDevice Model\nDevice Model\nTV98\nX96Q_Max_P\nQ96L2\nX96Q2\nX96mini\nS168\nums512_1h10_Natv\nX96_S400\nX96mini_RP\nTX3mini\nHY-001\nMX10PRO\nX96mini_Plus1\nLongTV_GN7501E\nXtv77\nNETBOX_B68\nX96Q_PR01\nAV-M9\nADT-3\nOCBN\nX96MATE_PLUS\nKM1\nX96Q_PRO\nProjector_T6P\nX96QPRO-TM\nsp7731e_1h10_native\nM8SPROW\nTV008\nX96Mini_5G\nQ96MAX\nOrbsmart_TR43\nZ6\nTVBOX\nSmart\nKM9PRO\nA15\nTranspeed\nKM7\niSinbox\nI96\nSMART_TV\nFujicom-SmartTV\nMXQ9PRO\nMBOX\nX96Q\nisinbox\nMbox\nR11\nGameBox\nKM6\nX96Max_Plus2\nTV007\nQ9 Stick\nSP7731E\nH6\nX88\nX98K\nTXCZ\nSymptoms of a BADBOX 2.0 infection include suspicious app marketplaces, disabled Google Play Protect settings, TV streaming devices advertised as being unlocked or able to access free content, devices from unknown brands, and suspicious Internet traffic.\nFurthermore, this malware is commonly found on devices not Google Play Protect certified.\nThe FBI strongly advises consumers to protect themselves from the botnet by following these steps:\nAssess all IoT devices connected to home networks for suspicious activity.\nNever download apps from unofficial marketplaces offering \"free streaming\" apps.\nMonitor Internet traffic to and from home networks.\nKeep all devices in your home updated with the latest patches and updates.\nFinally, if you suspect your device is compromised, you should isolate it from the rest of the network and restrict its Internet access, effectively disrupting the malware.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nAndroid malware Crocodilus adds fake contacts to spoof trusted callers\nYour kids will love this $75 Android tablet in this open-box deal\nFBI: End-of-life routers hacked for cybercrime proxy networks\nDesigning a Windows Service for Security\nUS offers $10M for tips on state hackers tied to RedLine malware"
    },
    {
        "Title": "Old AT&T data leak repackaged to link SSNs, DOBs to 49M phone numbers",
        "Link": "https://www.bleepingcomputer.com/news/security/old-atandt-data-leak-repackaged-to-link-ssns-dobs-to-49m-phone-numbers/",
        "Summary": "A threat actor has re-released data from a 2021 AT&amp;T breach affecting 70 million customers, this time combining previously separate files to directly link Social Security numbers and birth dates to individual users. [...]",
        "Date": "2025-06-05",
        "Content": "A threat actor has re-released data from a 2021 AT&T breach affecting 70 million customers, this time combining previously separate files to directly link Social Security numbers and birth dates to individual users.\nAT&T told BleepingComputer that they are investigating the data but also believe it originates from the known breach and was repackaged into a new leak.\n\"It is not uncommon for cybercriminals to repackage previously disclosed data for financial gain. We just learned about claims that AT&T data is being made available for sale on dark web forums, and we are conducting a full investigation,\" AT&T told BleepingComputer.\nAs first spotted by\nHackRead\n, the AT&T data was released on a popular Russian-speaking hacking forum, where a threat actor claimed it was stolen during the 2024\nAT&T Snowflake data theft attack\n, which exposed the call logs of 109 million customers.\n\"Originally one of the database from the snowflake breach here is my backup I created which has bogus numbers such as 00000 (I think federal agents...?) removed and I have also decrypted the SSNs and DOBs,\" reads the forum post.\nForum post leaking the 2021 AT&T data\nSource: BleepingComputer\nHowever, BleepingComputer's analysis of the leak indicates that the data actually originates from an\nAT&T data breach in 2021\nconducted by a well-known threat actor named ShinyHunters, who attempted to sell it for $200,000.\nThree years later, in March 2024, another threat actor\nleaked the entire AT&T data on a cybercrime forum\nfor free, stating it was from ShinyHunter's 2021 AT&T breach.\nThis data included names, addresses, mobile phone numbers, encrypted date of birth, encrypted social security numbers, and other internal information. However, included in the leak were individual files that mapped the encrypted SSNs and DOBs with their unencrypted plain text strings.\nAt the time, AT&T first denied that the data was theirs but eventually\nconfirmed that the data was stolen from their systems\nand impacted 73 million customers.\nAnalysis of the current leak by BleepingComputer shows it's the same data leaked in 2024 but cleaned up to remove internal AT&T data and add the unencrypted Social Security number and date of birth to each customer record.\nIn total, there are 88,320,017 lines of data in the leak, but when you remove duplicates, it goes down to 86,017,088 unique records.\nFurther processing of the data shows that it contains 48,896,044 unique phone numbers with associated customer information.\nThis significant drop is caused by many customers having multiple records with the same phone number used at different addresses.\nTo reiterate, this is not a new AT&T leak or the stolen Snowflake data but rather a repackaged version of the 2021 data breach.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nCartier discloses data breach amid fashion brand cyberattacks\nCoinbase breach tied to bribed TaskUs support agents in India\nAustralian Human Rights Commission leaks docs to search engines\nHacker 'NullBulge' pleads guilty to stealing Disney's Slack data\nInterlock ransomware claims DaVita attack, leaks stolen data"
    },
    {
        "Title": "Hacker selling critical Roundcube webmail exploit as tech info disclosed",
        "Link": "https://www.bleepingcomputer.com/news/security/hacker-selling-critical-roundcube-webmail-exploit-as-tech-info-disclosed/",
        "Summary": "Hackers are actively exploiting CVE-2025-49113, a critical vulnerability in the widely used Roundcube open-source webmail application that allows remote execution. [...]",
        "Date": "2025-06-05",
        "Content": "Hackers are likely starting to exploit CVE-2025-49113, a critical vulnerability in the widely used Roundcube open-source webmail application that allows remote execution.\nThe security issue has been present in Roundcube for over a decade and impacts versions of Roundcube webmail 1.1.0 through 1.6.10. It received a patch on June 1st.\nIt took attackers just a couple of days to reverse engineer the fix, weaponize the vulnerability, and start selling a working exploit on at least one hacker forum.\nRoundcube is one of the most popular webmail solutions as the product is included in offers from well-known hosting providers such as GoDaddy, Hostinger, Dreamhost, or OVH.\n\"Email armageddon\"\nCVE-2025-49113 is a post-authentication remote code execution (RCE) vulnerability that received a critical severity score of 9.9 out of 10 and is described as “email armageddon.”\nIt was discovered and reported by Kirill Firsov, the CEO of the cybersecurity company\nFearsOff\n, who decided to publish the technical details before the end of the responsible disclosure period because an exploit had become available.\n“Given the active exploitation and evidence of the exploit being sold in underground forums, I believe it is in the best interest of defenders, blue teams, and the broader security community to publish a full technical breakdown but without complete PoC for now” -\nKirill Firsov\nAt the root of the security problem is the lack of sanitization of the\n$_GET['_from']\nparameter, which leads to PHP Object deserialization.\nIn the technical report, Firsov explains that when an exclamation mark initiates a session variable name, the session becomes corrupted and object injection becomes possible.\nAfter Roundcube received a patch, attackers analyzed the modifications it introduced, developed an exploit, and advertised it on a hacker forum, noting that a working login is required.\nHowever, the need for login credentials does not seem like a deterrent, since the threat actor offering the exploit says that they can extract it from the logs, or it can be brute forced.\nFirsov says that the credential combination could also be obtained through cross-site request forgery (CSRF).\nRoundcube exploit for CVE-2025-49113 available on hacker forum\nsource:\nKirill Firsov\nAccording to Firsov, at least one vulnerability broker\npays up to $50,000\nfor an RCE exploit in Roundcube.\nThe researcher published a video to demonstrate how the vulnerability can be exploited. It should be noted that the researcher uses the vulnerability identifier CVE-2025-48745 in the demonstration, which is currently rejected as a\nduplicate candidate\nfor CVE-2025-49113.\nDespite being a less-known application among consumers, Roundcube is very popular, mostly because it is highly customizable with more than 200 options, and it is freely available.\nApart from being offered by hosting providers and bundled in web hosting control panels (cPanel, Plesk), numerous organizations in the government, academic, and tech sectors use Roundcube.\nFirsov also says that this webmail app has such a wide presence that a pentester is more likely to find a Roundcube instance than an SSL misconfiguration.\nConsidering the ubiquity of the application, the researcher says that “the attack surface isn’t big  -  it’s industrial.”\nIndeed, a quick look on search engines for discovering internet-connected devices and services shows at least 1.2 million Roundcube hosts.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nExploit details for max severity Cisco IOS XE flaw now public\nHackers are exploiting critical flaw in vBulletin forum software\nIvanti fixes EPMM zero-days chained in code execution attacks\nFortinet fixes critical zero-day exploited in FortiVoice attacks\nChinese hackers behind attacks targeting SAP NetWeaver servers"
    },
    {
        "Title": "Designing a Windows Service for Security",
        "Link": "https://www.bleepingcomputer.com/news/security/designing-a-windows-service-for-security/",
        "Summary": "Designing a security-focused Windows Service? Learn more from ThreatLocker about the core components for real-time monitoring, threat detection, and system hardening to defend against malware and ransomware. [...]",
        "Date": "2025-06-05",
        "Content": "Article written by Farid Mustafayev, Windows Service Developer Development.\nKey Design Principles for Security Services\nWhen designing a security-focused Windows Service, several principles are essential to ensure effectiveness and reliability:\nMinimal Attack Surface:\nDesign the service with the least privilege principle, granting it only the permissions necessary to perform its tasks. This reduces potential vulnerabilities that could be exploited by attackers.\nReal-Time Monitoring and Response:\nThe service should continuously monitor system activities and be capable of responding to threats in real-time. This involves detecting suspicious behavior, isolating threats, and taking corrective actions without user intervention.\nRobustness and Resilience:\nThe service must be resilient against crashes and attacks. It should include mechanisms for self-protection, ensuring that it remains operational even under hostile conditions.\nScalability and Performance:\nThe design should ensure that the service can handle various system loads efficiently without degrading overall system performance.\nArchitectural Overview of a Robust Security Service\nA robust security service typically comprises several components working together:\nMonitoring Engine:\nContinuously observes system activities such as process execution, file access, and network connections. It leverages event tracing, file system filters, and network monitoring tools to gather data.\nAnalysis and Detection Module:\nAnalyzes monitored data using predefined rules, behavior analysis, and machine learning models to identify potential threats. It distinguishes between normal and malicious activities based on patterns and anomalies.\nResponse and Mitigation Unit:\nOnce a threat is detected, this component takes immediate action, such as isolating the affected process, blocking file access, or alerting the user. It may also initiate automated remediation steps.\nLogging and Reporting:\nMaintains detailed logs of all activities and detected threats for audit and analysis purposes. This component ensures compliance with security policies and aids in post-incident investigation.\nCommunication Interface:\nProvides a secure communication channel for interacting with other components, such as a centralized management console or alerting system. It ensures encrypted and authenticated data exchange.\nSecure Windows Servers with Five Easy Strategies\nDiscover five practical strategies to harden your Windows Servers against modern cyber threats.\nThis eBook by ThreatLocker provides actionable steps to enhance your server security using a Zero Trust approach.\nDownload Now\nSelecting the Right Development Tools and Frameworks\nChoosing the right tools and frameworks is crucial for developing an effective Windows Service:\nDevelopment Environment:\nUsing Visual Studio with .NET offers robust support for creating Windows Services. .NET provides libraries for system monitoring, event handling, and network communication, which are essential for building security services.\nWindows APIs and Libraries:\nLeveraging Windows APIs like Windows Management Instrumentation (WMI), Event Tracing for Windows (ETW), and Windows Filtering Platform (WFP) is key to accessing low-level system information and events.\nNative Driver\n: Implementing a Windows Driver allows the service to intercept and monitor all system operations at a granular level. By integrating with the Windows kernel, the driver can observe various states and lifecycle events of the operating system. This approach provides comprehensive visibility into core operations, enabling the service to detect malicious activities that might bypass user-mode defenses.\nMachine Learning Libraries:\nFor advanced threat detection, integrating machine learning models using libraries like ML.NET or TensorFlow can enhance the service’s ability to identify sophisticated threats through behavior analysis.\nTesting and Debugging Tools:\nTools like WinDbg, Process Monitor, and Sysinternals Suite are invaluable for testing and debugging the service, ensuring it operates correctly under various conditions and threats.\nDesigning a security Windows Service involves careful planning and a deep understanding of both the system environment and potential threat vectors.\nBy adhering to key design principles, creating a robust architecture, and selecting appropriate development tools, you can build a service that effectively protects against malware and ransomware.\nCore components of the Windows Service\nReal-Time Monitoring and Threat Detection\nReal-time monitoring is crucial for identifying and responding to threats as they occur. This component involves continuously observing system activities, such as process creation, file access, and network connections.\nIt uses various techniques, like event tracing and hooks into system APIs, to gather data in real-time.\nThe goal is to detect any abnormal or suspicious behavior that could indicate the presence of malware or ransomware, enabling the service to take immediate action before significant damage occurs.\nProcess and File System Monitoring\nThis component focuses on monitoring the system’s processes and file system activities:\nProcess Monitoring:\nTracks the creation, modification, and termination of processes. It looks for unusual behaviors such as unknown processes attempting to execute, processes trying to modify system files, or unauthorized access to sensitive directories. This helps in identifying potentially malicious software that is trying to run or alter system operations.\nFile System Monitoring:\nObserves file access and modifications. It detects unauthorized changes to important files, attempts to encrypt files (a common behavior of ransomware), or the creation of hidden files. The service can block or quarantine suspicious file operations to prevent further damage.\nNetwork Activity Analysis\nMonitoring network activity is essential for identifying potential threats that rely on communication with external servers or other infected devices:\nOutbound Connections:\nWatches for unauthorized or unusual outbound connections, which could indicate data exfiltration or communication with a command-and-control server.\nInbound Traffic:\nMonitors incoming traffic to detect potential intrusion attempts or malicious payloads being delivered to the system.\nTraffic Patterns:\nAnalyzes the nature of network traffic, looking for patterns commonly associated with malware, such as sudden spikes in network usage or connections to known malicious IP addresses.\nBy integrating real-time monitoring, process and file system analysis, and network activity monitoring, the Windows Service can provide comprehensive protection against various threats.\nThese core components work together to detect and mitigate malware and ransomware effectively, ensuring the security and integrity of the system.\nSponsored and written by\nThreatLocker\n."
    },
    {
        "Title": "Germany fines Vodafone $51 million for privacy, security breaches",
        "Link": "https://www.bleepingcomputer.com/news/security/germany-fines-vodafone-51-million-for-privacy-security-breaches/",
        "Summary": "The German data protection authority (BfDI) has fined Vodafone GmbH, the telecommunications company's German subsidiary, €45 million ($51.4 million) for privacy and security violations. [...]",
        "Date": "2025-06-05",
        "Content": "The German data protection authority (BfDI) has fined Vodafone GmbH, the telecommunications company's German subsidiary, €45 million ($51.4 million) for privacy and security violations.\n\"Due to malicious employees in partner agencies who broker contracts to customers on behalf of Vodafone, there had been fraud cases due to fictitious contracts or contract changes at the expense of customers, among other things,\" BfDI said on Thursday.\nBfDI imposed a €15 million fine on Vodafone GmbH for failing to monitor partner agencies whose employees made unauthorized contract changes or tricked customers into signing fictitious contracts.\nThe British multinational telecommunications company was hit with a second €30 million fine for authentication vulnerabilities of its MeinVodafone (\"My Vodafone\") and the company's hotline, which allowed attackers to access customer eSIM profiles.\n\"Where data breaches take place, sanctions must be imposed. However, with my work, I also want to ensure that data breaches do not occur in the first place. Companies that want to comply with data protection law must be empowered to do so,\"\nadded\nProf. Dr. Louisa Specht-Riemenschneider, the Federal Commissioner for Data Protection and Freedom of Information.\n\"I would like to point out that Vodafone has cooperated with me continuously and without restriction throughout the entire proceedings and has also disclosed circumstances that have incriminated the company.\"\nVodafone has updated its processes and systems, replacing some of them to mitigate future risks. The company has also updated procedures for selecting and auditing partner agencies, and it has severed ties with partners linked to fraudulent activities.\nThe telecom giant has already paid the fines and donated several million euros to organizations that promote data protection, media literacy, and combating cyberbullying, the BfDI said.\nVodafone offers mobile and fixed services to over 330 million customers in 15 countries across Europe, Asia, Africa, and Oceania. Its financial technology businesses also serve nearly 83 million customers in seven African countries.\nA Vodafone spokesperson was not immediately available for comment when contacted by BleepingComputer today.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nO2 UK patches bug leaking mobile user location from call metadata\nTikTok fined €530 million for sending European user data to China\nGermany doxxes Conti ransomware and TrickBot ring leader\nEuropol identifies 8 cybercriminals tied to malware loader botnets\nSignal now blocks Microsoft Recall screenshots on Windows 11"
    },
    {
        "Title": "ViLE gang members sentenced for DEA portal breach, extortion",
        "Link": "https://www.bleepingcomputer.com/news/security/vile-gang-members-sentenced-for-breaching-law-enforcement-portal/",
        "Summary": "Two members of a group of cybercriminals named ViLE were sentenced this week for hacking into a federal law enforcement web portal in an extortion scheme. [...]",
        "Date": "2025-06-05",
        "Content": "Two members of a group of cybercriminals named ViLE were sentenced this week for hacking into a federal law enforcement web portal in an extortion scheme.\nAccording to\ncourt documents\n, ViLE specializes in obtaining personal information about targets to harass, threaten, or extort them, a practice known as \"doxing.\"\nTo collect sensitive information on their victims, they use methods such as tricking customer service employees, submitting fraudulent legal requests to social media companies, bribing corporate insiders, and searching public and private online databases.\n\"The defendants impersonated law enforcement, illegally accessed government databases, and even faked life-threatening situations to bypass criminal procedures through which they could obtain sensitive personal information,\"\nsaid\nMichael Alfonso, an Acting Special Agent in Charge with Homeland Security Investigations (HSI).\n\"They threatened innocent victims' livelihoods and were found to have joked about their deceptive, exploitative, and calculated scheme in messages with each other.\"\n21-year-old Sagar Steven Singh (also known as Weep) from Pawtucket, Rhode Island, was sentenced to 27 months for aggravated identity theft and conspiracy to commit computer intrusion.\nThe second defendant, 26-year-old Nicholas Ceraolo (also known as 'Convict,' 'Anon,' and 'Ominous') from Queens, New York, received a 25-month sentence for the same charges.\nWeep and Ominous listed on ViLE's website (DOJ)\nDEA online portal breach​\nOne year ago, the two ViLE members\npleaded guilty\nto stealing personal information belonging to multiple individuals whom they had blackmailed.\nOn May 7, 2022, with the help of an officer's stolen credentials, they gained access to an online portal maintained by a federal law enforcement agency, which was used to share intelligence with state and local law enforcement, including \"detailed nonpublic records of narcotics and currency seizures.\"\nWhile the U.S. Department of Justice (DOJ) didn't reveal which law enforcement portal they breached, investigative journalist Brian Krebs\nsays\nthey hacked into a U.S. Drug Enforcement Agency (DEA) online portal with information from 16 federal law enforcement databases.\nThey used personal information stolen from the hacked portal, such as social security numbers, to extort victims by threatening to leak the sensitive data online unless they were paid.\n\"ViLE then threatened to 'dox' victims by posting that information on a public website administered by a ViLE member. Victims could pay to have their information removed from or kept off the website,\" the DOJ said.\nIn one blackmail attempt, Singh forced one victim to hand over control of their Instagram accounts after messaging their security number, driver's license number, home address, and other personal details and saying, \"you're gonna comply to me if you don't want anything negative to happen to your parents.\nMessages between Ceraolo and Singh show they fully understood the seriousness of their malicious activities and feared police raids. The U.S. Justice Department has yet to share information regarding other investigations to identify and prosecute the other four ViLE members.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nUkraine claims it hacked Tupolev, Russia’s strategic warplane maker\nFBI seeks help to unmask Salt Typhoon hackers behind telecom breaches\nInfamous message board 4chan taken down following major hack\nHacker jailed for extortion, selling stolen data on RaidForums\nHackers lurked in Treasury OCC’s systems since June 2023 breach"
    },
    {
        "Title": "Interlock ransomware claims Kettering Health breach, leaks stolen data",
        "Link": "https://www.bleepingcomputer.com/news/security/interlock-ransomware-claims-kettering-health-breach-leaks-stolen-data/",
        "Summary": "The Interlock ransomware gang has claimed a recent cyberattack on the Kettering Health healthcare network and leaked data allegedly stolen from breached systems. [...]",
        "Date": "2025-06-05",
        "Content": "The Interlock ransomware gang has claimed a recent cyberattack on the Kettering Health healthcare network and leaked data allegedly stolen from breached systems.\nKettering Health employs over 15,000 people, including more than 1,800 physicians, and it manages 14 medical centers and over 120 outpatient facilities in western Ohio.\nThe nonprofit organization\ndisclosed a cyberattack on May 20\nthat triggered an outage affecting its call center and some patient care systems, leaving staff without access to computerized charting systems and forcing care teams\nback to pen and paper\n. The incident also led to canceled elective inpatient and outpatient procedures, while emergency rooms and clinics remained open and continued seeing patients.\nOn Monday, Kettering Health\nissued an update\nsaying it restored access to its electronic health record (EHR) system, with additional work being needed to bring back online the MyChart medical record application system for patients and call centers at affected facilities and practices.\nUntil phone systems are restored, Kettering Health\nprovides\na temporary phone line staffed by registered nurses for patients with urgent clinical questions.\nWhile the healthcare network has yet to attribute the breach to a specific threat group, the Interlock ransomware operation claimed responsibility for the attack this week and published samples of allegedly stolen data, confirming previous reporting that Interlock was likely behind the attack.\nKettering Health entry on Interlock's leak site (BleepingComputer)\n​The ransomware group claims they stole 941 GB of data, including over 20,000 folders containing 732,489 documents with sensitive information.\nThis data allegedly includes bank reports, payroll information, patients' data, pharmacy and blood bank documents, Kettering Health police personnel files, and scans of identity documents, including passports.\nInterlock is a newer ransomware operation that\nsurfaced in September\n2024 and has claimed responsibility for dozens of victims worldwide, many of them from healthcare organizations.\nThis cybercrime gang has also been linked to\nClickFix attacks\n, impersonating IT tools to gain initial access to the targets' networks, and a previously unknown remote access trojan (RAT) named NodeSnake deployed in\nattacks against U.K. universities\nearlier this year.\nMost recently, Interlock has claimed\nthe breach of DaVita\n, a Fortune 500 kidney care provider with over 2,600 U.S. dialysis centers, and released 1.5 terabytes of data allegedly stolen from the organization's network.\nA Kettering Health spokesperson didn't share additional details regarding the incident when contacted by BleepingComputer after the attack.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nKettering Health hit by system-wide outage after ransomware attack\nMedia giant Lee Enterprises says data breach affects 39,000 people\nInterlock ransomware gang deploys new NodeSnake RAT on universities\nDragonForce ransomware abuses SimpleHelp in MSP supply chain attack\nVanHelsing ransomware builder leaked on hacking forum"
    },
    {
        "Title": "US offers $10M for tips on state hackers tied to RedLine malware",
        "Link": "https://www.bleepingcomputer.com/news/security/us-offers-10m-for-tips-on-state-hackers-tied-to-redline-malware/",
        "Summary": "The U.S. Department of State has announced a reward of up to $10 million for any information on government-sponsored hackers with ties to the RedLine infostealer malware operation and its suspected creator, Russian national Maxim Alexandrovich Rudometov. [...]",
        "Date": "2025-06-05",
        "Content": "The U.S. Department of State has announced a reward of up to $10 million for any information on government-sponsored hackers with ties to the RedLine infostealer malware operation and its suspected creator, Russian national Maxim Alexandrovich Rudometov.\nThe same bounty covers leads on state hackers' use of this malware in cyber operations targeting critical infrastructure organizations in the United States.\nThis bounty is posted as part of the Department of State's\nRewards for Justice program\nestablished by the 1984 Act to Combat International Terrorism, which rewards informants for tips that help identify or locate foreign government threat actors behind cyberattacks against U.S. entities.\n\"Rewards for Justice is offering a reward of up to $10 million for information leading to the identification or location of any person who, while acting at the direction or under the control of a foreign government, participates in malicious cyber activities against U.S. critical infrastructure in violation of the Computer Fraud and Abuse Act (CFAA),\" the State Department\nsaid\n.\n\"Anyone with information on foreign government linked associates of Rudometov, or their malicious cyber activities, or foreign government-linked use of RedLine malware, should contact Rewards for Justice via the\nTor-based tips-reporting channel\n.\"\nSince its inception, over $250 million has been paid through this program to more than 125 individuals who provided leads that helped protect U.S. national security.\nRedLine Rewards for Justice poster (U.S. State Department)\n​Maxim Alexandrovich Rudometov, the suspected developer and administrator of the RedLine infostealer malware operation, was\ncharged in October\nin the United States following a joint international law enforcement action codenamed 'Operation Magnus.'\n\"Rudometov regularly accessed and managed the infrastructure of RedLine Infostealer, was associated with various cryptocurrency accounts used to receive and launder payments, and was in possession of RedLine malware,\" the Justice Department\nsaid\nat the time.\nThe Dutch police, working with international partners, disrupted the RedLine and META malware-as-a-service (MaaS) platforms linked to the theft of millions of account credentials. Law enforcement also disrupted their sales channels by seizing RedLine and META Telegram accounts used to promote malware to buyers.\nAdditionally,\nEurojust\nand the\nDutch police\nrevealed that the authorities arrested two suspects in Belgium and seized three servers and two web domains used for command and control operations by the two malware platforms.\nIt's unclear if Rudometov was also arrested, but he could face up to 35 years in prison if convicted on counts of access device fraud, conspiracy to commit computer intrusion, and money laundering.\nCybersecurity firm ESET, which was also involved in the crackdown operation as a technical advisor and helped map a network of over 1,200 servers linked to the two malware operations,\nreleased an online scanner\nthat helps potential victims check if they are infected by Redline or META malware.\nWhy IT teams are ditching manual patch management\nManual patching is outdated. It's slow, error-prone, and tough to scale.\nJoin Kandji + Tines on June 4 to see why old methods fall short. See real-world examples of how modern teams use automation to patch faster, cut risk, stay compliant, and skip the complex scripts.\nSave your spot\nRelated Articles:\nLumma infostealer malware operation disrupted, 2,300 domains seized\nStealC malware enhanced with stealth upgrades and data theft tools\nDesigning a Windows Service for Security\nHacker targets other hackers and gamers with backdoored GitHub code\nAndroid malware Crocodilus adds fake contacts to spoof trusted callers"
    },
    {
        "Title": "SecOps Need to Tackle AI Hallucinations to Improve Accuracy",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/secops-tackle-ai-hallucinations-improve-accuracy",
        "Summary": "AI is increasingly embedded into threat detection and response tools, but hallucinations can lead to false positive and inaccurate guidance. The AI-associated risk can't be completely eradicated, but SecOps teams can take steps to at least limit the effects.",
        "Date": "2025-06-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/secops-tackle-ai-hallucinations-improve-accuracy"
    },
    {
        "Title": "Digital Forensics Firm Cellebrite to Acquire Corellium",
        "Link": "https://www.darkreading.com/mobile-security/digital-forensics-firm-cellebrite-acquire-corellium",
        "Summary": "Cellebrite, a controversial digital forensics firm, is set to acquire virtualization vendor Corellium in a $170 million deal.",
        "Date": "2025-06-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/mobile-security/digital-forensics-firm-cellebrite-acquire-corellium"
    },
    {
        "Title": "'PathWiper' Attack Hits Critical Infrastructure In Ukraine",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/pathwiper-attack-critical-infrastructure-ukraine",
        "Summary": "Cisco Talos researchers observed the new wiper malware in a destructive attack against an unnamed critical infrastructure organization.",
        "Date": "2025-06-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/pathwiper-attack-critical-infrastructure-ukraine"
    },
    {
        "Title": "Cisco Warns of Credential Vuln on AWS, Azure, Oracle Cloud",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/cisco-warns-critical-static-credential-vulnerability",
        "Summary": "The vulnerability, with a 9.9 CVSS score on a 10-point scale, results in different Cisco ISE deployments all sharing the same credentials as long as the software release and cloud platform remain the same.",
        "Date": "2025-06-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/cisco-warns-critical-static-credential-vulnerability"
    },
    {
        "Title": "Backdoored Malware Reels in Newbie Cybercriminals",
        "Link": "https://www.darkreading.com/threat-intelligence/backdoored-malware-new-cybercriminals",
        "Summary": "Sophos researchers found this operation has similarities or connections to many other campaigns targeting GitHub repositories dating back to August 2022.",
        "Date": "2025-06-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/backdoored-malware-new-cybercriminals"
    },
    {
        "Title": "Questions Swirl Around ConnectWise Flaw Used in Attacks",
        "Link": "https://www.darkreading.com/remote-workforce/questions-swirl-connectwise-flaw-attacks",
        "Summary": "ConnectWise issued a patch to stave off attacks on ScreenConnect customers, but the company's disclosures don't explain what the vulnerability is and when it was first exploited.",
        "Date": "2025-06-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/questions-swirl-connectwise-flaw-attacks"
    },
    {
        "Title": "Finding Balance in US AI Regulation",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/finding-balance-us-ai-regulation",
        "Summary": "The US can't afford to wait for political consensus to catch up to technological change.",
        "Date": "2025-06-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/finding-balance-us-ai-regulation"
    },
    {
        "Title": "Iranian APT 'BladedFeline' Hides in Network for 8 Years",
        "Link": "https://www.darkreading.com/threat-intelligence/iranian-apt-bladedfeline-hides-network-8-years",
        "Summary": "ESET published research on the Iranian APT &quot;BladedFeline,&quot; which researchers believe is a subgroup of the cyber-espionage entity APT34.",
        "Date": "2025-06-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/iranian-apt-bladedfeline-hides-network-8-years"
    },
    {
        "Title": "Cybersecurity Training in Africa Aims to Bolster Professionals' Ranks",
        "Link": "https://www.darkreading.com/cybersecurity-operations/cybersecurity-training-africa-professionals-ranks",
        "Summary": "The United Nations, Carnegie Mellon University, and private organizations are all aiming to train the next generation of cybersecurity experts, boost economies, and disrupt pipelines to armed groups.",
        "Date": "2025-06-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/cybersecurity-training-africa-professionals-ranks"
    },
    {
        "Title": "Proxy Services Feast on Ukraine’s IP Address Exodus",
        "Link": "https://krebsonsecurity.com/2025/06/proxy-services-feast-on-ukraines-ip-address-exodus/",
        "Summary": "Ukraine has seen nearly one-fifth of its Internet space come under Russian control or sold to Internet address brokers since February 2022, a new study finds. The analysis indicates large chunks of Ukrainian Internet address space are now in the hands of proxy and anonymity services nested at some of America's largest Internet service providers (ISPs).",
        "Date": "2025-06-05",
        "Content": "Image: Mark Rademaker, via Shutterstock.\nUkraine has seen nearly one-fifth of its Internet space come under Russian control or sold to Internet address brokers since February 2022, a new study finds. The analysis indicates large chunks of Ukrainian Internet address space are now in the hands of shadowy proxy and anonymity services that are nested at some of America’s largest Internet service providers (ISPs).\nThe findings come in a report that examines how the Russian invasion has affected Ukraine’s domestic supply of Internet Protocol Version 4 (IPv4) addresses. Researchers at Kentik, a company that measures the performance of Internet networks, found that while a majority of ISPs in Ukraine haven’t changed their infrastructure much since the war began in 2022, others have resorted to selling swathes of their valuable IPv4 address space just to keep the lights on.\nFor example, Ukraine’s incumbent ISP Ukrtelecom is now routing just 29 percent of the IPv4 address ranges that the company controlled at the start of the war, Kentik found. Although much of that former IP space remains dormant, Ukrtelecom told Kentik’s Doug Madory they were forced to sell many of their address blocks “to secure financial stability and continue delivering essential services.”\n“Leasing out a portion of our IPv4 resources allowed us to mitigate some of the extraordinary challenges we have been facing since the full-scale invasion began,” Ukrtelecom told Madory.\nMadory found much of the IPv4 space previously allocated to Ukrtelecom is now scattered to more than 100 providers globally, particularly at three large American ISPs — Amazon (AS16509), AT&T (AS7018), and Cogent (AS174).\nAnother Ukrainian Internet provider — LVS (AS43310) — in 2022 was routing approximately 6,000 IPv4 addresses across the nation. Kentik learned that by November 2022, much of that address space had been parceled out to over a dozen different locations, with the bulk of it being announced at AT&T.\nIP addresses routed over time by Ukrainian provider LVS (AS43310) shows a large chunk of it being routed by AT&T (AS7018). Image: Kentik.\nDitto for the Ukrainian ISP TVCOM, which currently routes nearly 15,000 fewer IPv4 addresses than it did at the start of the war. Madory said most of those addresses have been scattered to 37 other networks outside of Eastern Europe, including Amazon, AT&T, and Microsoft.\nThe Ukrainian ISP Trinity (AS43554) went offline in early March 2022 during the bloody siege of Mariupol, but its address space eventually began showing up in more than 50 different networks worldwide. Madory found more than 1,000 of Trinity’s IPv4 addresses suddenly appeared on AT&T’s network.\nWhy are all these former Ukrainian IP addresses being routed by U.S.-based networks like AT&T? According to spur.us, a company that tracks VPN and proxy services, nearly all of the address ranges identified by Kentik now map to commercial proxy services that allow customers to anonymously route their Internet traffic through someone else’s computer.\n\nFrom a website’s perspective, the traffic from a proxy network user appears to originate from the rented IP address, not from the proxy service customer. These services can be used for several business purposes, such as price comparisons, sales intelligence, web crawlers and content-scraping bots. However, proxy services also are massively abused for hiding cybercrime activity because they can make it difficult to trace malicious traffic to its original source.\nIPv4 address ranges are always in high demand, which means they are also quite valuable. There are now multiple companies that will pay ISPs to lease out their unwanted or unused IPv4 address space. Madory said these IPv4 brokers will pay between $100-$500 per month to lease a block of 256 IPv4 addresses, and very often the entities most willing to pay those rental rates are proxy and VPN providers.\nA cursory review of all Internet address blocks currently routed through AT&T — as seen in public records maintained by the Internet backbone provider Hurricane Electric — shows a preponderance of country flags other than the United States, including networks originating in Hungary, Lithuania, Moldova, Mauritius, Palestine, Seychelles, Slovenia, and Ukraine.\nAT&T’s IPv4 address space seems to be routing a great deal of proxy traffic, including a large number of IP address ranges that were until recently routed by ISPs in Ukraine.\nAsked about the apparent high incidence of proxy services routing foreign address blocks through AT&T, the telecommunications giant said it recently changed its policy about originating routes for network blocks that are not owned and managed by AT&T. That new policy, spelled out in a February 2025 update to AT&T’s terms of service, gives those customers until Sept. 1, 2025 to originate their own IP space from their own autonomous system number (ASN), a unique number assigned to each ISP (AT&T’s is AS7018).\n“To ensure our customers receive the best quality of service, we changed our terms for dedicated internet in February 2025,” an AT&T spokesperson said in an emailed reply. “We no longer permit static routes with IP addresses that we have not provided. We have been in the process of identifying and notifying affected customers that they have 90 days to transition to Border Gateway Protocol routing using their own autonomous system number.”\nIronically, the co-mingling of Ukrainian IP address space with proxy providers has resulted in many of these addresses being used in cyberattacks against Ukraine and other enemies of Russia. Earlier this month, the European Union sanctioned Stark Industries Solutions Inc., an ISP that surfaced two weeks before the Russian invasion and quickly became the source of large-scale DDoS attacks and spear-phishing attempts by Russian state-sponsored hacking groups. A deep dive into Stark’s considerable address space showed some of it was sourced from Ukrainian ISPs, and most of it was connected to Russia-based proxy and anonymity services.\nAccording to Spur, the proxy service IPRoyal is the current beneficiary of IP address blocks from several Ukrainian ISPs profiled in Kentik’s report. Customers can chose proxies by specifying the city and country they would to proxy their traffic through. Image: Trend Micro.\nSpur’s Chief Technology Officer Riley Kilmer said AT&T’s policy change will likely force many proxy services to migrate to other U.S. providers that have less stringent policies.\n“AT&T is the first one of the big ISPs that seems to be actually doing something about this,” Kilmer said. “We track several services that explicitly sell AT&T IP addresses, and it will be very interesting to see what happens to those services come September.”\nStill, Kilmer said, there are several other large U.S. ISPs that continue to make it easy for proxy services to bring their own IP addresses and host them in ranges that give the appearance of residential customers. For example, Kentik’s report identified former Ukrainian IP ranges showing up as proxy services routed by Cogent Communications (AS174), a tier-one Internet backbone provider based in Washington, D.C.\nKilmer said Cogent has become an attractive home base for proxy services because it is relatively easy to get Cogent to route an address block.\n“In fairness, they transit a lot of traffic,” Kilmer said of Cogent. “But there’s a reason a lot of this proxy stuff shows up as Cogent: Because it’s super easy to get something routed there.”\nCogent declined a request to comment on Kentik’s findings.\n\r\n         This entry was posted on Thursday 5th of June 2025 06:44 PM \r\n         \nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "Misconfigured HMIs Expose US Water Systems to Anyone with a Browser",
        "Link": "https://www.securityweek.com/misconfigured-hmis-expose-us-water-systems-to-anyone-with-a-browser/",
        "Summary": "<p>Censys researchers follow some clues and find hundreds of control-room dashboards for US water utilities  on the public internet.</p>\n<p>The post <a href=\"https://www.securityweek.com/misconfigured-hmis-expose-us-water-systems-to-anyone-with-a-browser/\">Misconfigured HMIs Expose US Water Systems to Anyone with a Browser</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/misconfigured-hmis-expose-us-water-systems-to-anyone-with-a-browser/"
    },
    {
        "Title": "Backdoored Open Source Malware Repositories Target Novice Cybercriminals",
        "Link": "https://www.securityweek.com/backdoored-open-source-malware-repositories-target-novice-cybercriminals/",
        "Summary": "<p>A threat actor has been creating backdoored open source malware repositories to target novice cybercriminals and game cheaters.</p>\n<p>The post <a href=\"https://www.securityweek.com/backdoored-open-source-malware-repositories-target-novice-cybercriminals/\">Backdoored Open Source Malware Repositories Target Novice Cybercriminals</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/backdoored-open-source-malware-repositories-target-novice-cybercriminals/"
    },
    {
        "Title": "Controversial Firms Cellebrite and Corellium Announce $200 Million Acquisition Deal",
        "Link": "https://www.securityweek.com/controversial-firms-cellebrite-and-corellium-announce-200-million-acquisition-deal/",
        "Summary": "<p>Cellebrite and Corellium, whose names have been mentioned in spyware stories, are joining forces to provide advanced investigative solutions.</p>\n<p>The post <a href=\"https://www.securityweek.com/controversial-firms-cellebrite-and-corellium-announce-200-million-acquisition-deal/\">Controversial Firms Cellebrite and Corellium Announce $200 Million Acquisition Deal</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/controversial-firms-cellebrite-and-corellium-announce-200-million-acquisition-deal/"
    },
    {
        "Title": "Men Who Hacked Law Enforcement Database for Doxing Sentenced to Prison",
        "Link": "https://www.securityweek.com/men-who-hacked-law-enforcement-database-for-doxing-sentenced-to-prison/",
        "Summary": "<p>Sagar Steven Singh and Nicholas Ceraolo, members of the Vile group, get prison sentences for identity theft and hacking.</p>\n<p>The post <a href=\"https://www.securityweek.com/men-who-hacked-law-enforcement-database-for-doxing-sentenced-to-prison/\">Men Who Hacked Law Enforcement Database for Doxing Sentenced to Prison</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/men-who-hacked-law-enforcement-database-for-doxing-sentenced-to-prison/"
    },
    {
        "Title": "ClickFix Attack Exploits Fake Cloudflare Turnstile to Deliver Malware",
        "Link": "https://www.securityweek.com/clickfix-attack-exploits-fake-cloudflare-turnstile-to-deliver-malware/",
        "Summary": "<p>Researchers have discovered and analyzed a ClickFix attack that uses a fake Cloudflare ‘humanness’ check. </p>\n<p>The post <a href=\"https://www.securityweek.com/clickfix-attack-exploits-fake-cloudflare-turnstile-to-deliver-malware/\">ClickFix Attack Exploits Fake Cloudflare Turnstile to Deliver Malware</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/clickfix-attack-exploits-fake-cloudflare-turnstile-to-deliver-malware/"
    },
    {
        "Title": "FBI Aware of 900 Organizations Hit by Play Ransomware",
        "Link": "https://www.securityweek.com/fbi-aware-of-900-organizations-hit-by-play-ransomware/",
        "Summary": "<p>Play ransomware attacks have hit roughly 900 organizations and recently involved the exploitation of SimpleHelp vulnerabilities.</p>\n<p>The post <a href=\"https://www.securityweek.com/fbi-aware-of-900-organizations-hit-by-play-ransomware/\">FBI Aware of 900 Organizations Hit by Play Ransomware</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/fbi-aware-of-900-organizations-hit-by-play-ransomware/"
    },
    {
        "Title": "Carding Marketplace BidenCash Shut Down by Authorities",
        "Link": "https://www.securityweek.com/carding-marketplace-bidencash-shut-down-by-authorities/",
        "Summary": "<p>Authorities seized 145 domains associated with BidenCash, a marketplace for stolen credit cards and personal information.</p>\n<p>The post <a href=\"https://www.securityweek.com/carding-marketplace-bidencash-shut-down-by-authorities/\">Carding Marketplace BidenCash Shut Down by Authorities </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/carding-marketplace-bidencash-shut-down-by-authorities/"
    },
    {
        "Title": "Lee Enterprises Says 40,000 Hit by Ransomware-Caused Data Breach",
        "Link": "https://www.securityweek.com/lee-enterprises-says-40000-hit-by-ransomware-caused-data-breach/",
        "Summary": "<p>Lee Enterprises has completed its investigation into the recent ransomware attack and confirmed that a data breach occurred.</p>\n<p>The post <a href=\"https://www.securityweek.com/lee-enterprises-says-40000-hit-by-ransomware-caused-data-breach/\">Lee Enterprises Says 40,000 Hit by Ransomware-Caused Data Breach</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/lee-enterprises-says-40000-hit-by-ransomware-caused-data-breach/"
    },
    {
        "Title": "Ransomware Gang Leaks Alleged Kettering Health Data",
        "Link": "https://www.securityweek.com/ransomware-gang-leaks-alleged-kettering-health-data/",
        "Summary": "<p>The Interlock ransomware group has leaked data allegedly stolen from Kettering Health in a recent cyberattack.</p>\n<p>The post <a href=\"https://www.securityweek.com/ransomware-gang-leaks-alleged-kettering-health-data/\">Ransomware Gang Leaks Alleged Kettering Health Data</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/ransomware-gang-leaks-alleged-kettering-health-data/"
    },
    {
        "Title": "China Issues Warrants for Alleged Taiwanese Hackers and Bans a Business for Pro-Independence Links",
        "Link": "https://www.securityweek.com/china-issues-warrants-for-alleged-taiwanese-hackers-and-bans-a-business-for-pro-independence-links/",
        "Summary": "<p>China issued warrants for 20 Taiwanese people it said carried out hacking missions in the Chinese mainland on behalf of the island’s ruling party.</p>\n<p>The post <a href=\"https://www.securityweek.com/china-issues-warrants-for-alleged-taiwanese-hackers-and-bans-a-business-for-pro-independence-links/\">China Issues Warrants for Alleged Taiwanese Hackers and Bans a Business for Pro-Independence Links</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/china-issues-warrants-for-alleged-taiwanese-hackers-and-bans-a-business-for-pro-independence-links/"
    },
    {
        "Title": "Everest Ransomware Group Allegedly Publishes Full Data Leak of Jordan Kuwait Bank",
        "Link": "https://dailydarkweb.net/everest-ransomware-group-allegedly-publishes-full-data-leak-of-jordan-kuwait-bank/",
        "Summary": "The Everest ransomware group has allegedly published a full cache of data purportedly belonging to Jordan Kuwait Bank (JKB), following an initial attack reportedly occurring on April 26, 2025. Jordan Kuwait Bank is a financial institution offering a comprehensive suite of banking services. As a significant entity in the financial sector, the bank is responsible [&#8230;]",
        "Date": "2025-06-05",
        "Content": "The Everest ransomware group has allegedly published a full cache of data purportedly belonging to Jordan Kuwait Bank (JKB), following an initial attack reportedly occurring on April 26, 2025. Jordan Kuwait Bank is a financial institution offering a comprehensive suite of banking services. As a significant entity in the financial sector, the bank is responsible for vast quantities of sensitive customer and proprietary information. The ransomware group claims to have released the data now because a set deadline for negotiations expired.\nThe attackers assert that the published data trove contains highly sensitive information. The compromised files allegedly include employees’ personal data, with a total of 1003 personal records exposed. Furthermore, the group contends that 11.7 GB of internal company data, encompassing internal and confidential information, has been made public. The full repercussions of this alleged breach, stemming from the April incident, are still unfolding.\nLeaked data allegedly includes:\nEmployees Personal data\nInternal and confidential information\nTotal personal records: 1003\n11.7 GB internal company data\nTags:\nallegedly\nCyberSecurity\ndata-breach\ndata-leak\nEverest ransomware\nfinancial institution\nJKB\nJordan Kuwait Bank\nransomware"
    },
    {
        "Title": "Spanish Government Network Access Allegedly Compromised",
        "Link": "https://dailydarkweb.net/spanish-government-network-access-allegedly-compromised/",
        "Summary": "A threat actor has allegedly claimed to possess administrative-level access to the Remote Desktop Protocol (RDP) of &#8220;gob.es,&#8221; the official domain of the Spanish government. This domain is a critical piece of national infrastructure, hosting various governmental services and information. The alleged breach, if confirmed, could represent a significant cybersecurity incident with far-reaching implications for [&#8230;]",
        "Date": "2025-06-05",
        "Content": "A threat actor has allegedly claimed to possess administrative-level access to the Remote Desktop Protocol (RDP) of “gob.es,” the official domain of the Spanish government. This domain is a critical piece of national infrastructure, hosting various governmental services and information. The alleged breach, if confirmed, could represent a significant cybersecurity incident with far-reaching implications for the security of government data and operations.\nAccording to a post on a hacking forum, the individual claims to have admin credentials and visibility over numerous computers within the Spanish government’s network. The actor is reportedly seeking assistance from other individuals with experience in escalating privileges to gain access to all computers on the network. This development raises serious concerns about the potential for unauthorized access to sensitive information and the possible disruption of governmental functions. The investigation into these claims is likely to be a high priority for Spanish authorities.\nAllegedly Compromised Data/Access:\nAdministrative RDP access to gob.es\nVisibility into multiple computers on the government network\nPotential for full network access and privilege escalation (as sought by the actor)\nTags:\nAlleged\nCyberSecurity\ndata-breach\nEspaña\ngovernment\nnetwork security\nRDP\nSpain\nthreat actor"
    },
    {
        "Title": "Bank Syariah Indonesia Customer Credentials Allegedly Leaked via Stealer Logs",
        "Link": "https://dailydarkweb.net/bank-syariah-indonesia-customer-credentials-allegedly-leaked-via-stealer-logs/",
        "Summary": "Customer credentials for Bank Syariah Indonesia (BSI), a major state-owned Islamic bank, have allegedly surfaced on a dark web forum. A threat actor claims to be in possession of &#8220;stealer logs&#8221; containing sensitive login information apparently belonging to BSI customers. This type of compromise typically results from malware on users&#8217; personal devices capturing their usernames [&#8230;]",
        "Date": "2025-06-05",
        "Content": "Customer credentials for Bank Syariah Indonesia (BSI), a major state-owned Islamic bank, have allegedly surfaced on a dark web forum. A threat actor claims to be in possession of “stealer logs” containing sensitive login information apparently belonging to BSI customers. This type of compromise typically results from malware on users’ personal devices capturing their usernames and passwords, which are then compiled and shared or sold by malicious actors.\nBank Syariah Indonesia is the largest Sharia bank in the country, playing a significant role in Indonesia’s financial landscape. While the appearance of stealer logs does not necessarily indicate a direct breach of the bank’s core infrastructure, it signifies a serious risk to affected customers. The exposed credentials could allegedly be used to gain unauthorized access to customer accounts, potentially leading to financial loss and identity theft.\nThe data purportedly exposed in these stealer logs allegedly includes:\nUsernames / Login Names\nPasswords\nAssociated Links to bank systems (primarily CMS login pages)\nPhone Numbers (in some cases)\nTags:\nalleged leak\nBank Syariah Indonesia\nBSI\ncustomer credentials\nCyberSecurity\ndark web\ndata-leak\nIndonesia\nStealer Logs"
    },
    {
        "Title": "Odoo Employee Database Allegedly Leaked by Insider, For Sale on Dark Web",
        "Link": "https://dailydarkweb.net/odoo-employee-database-allegedly-leaked-by-insider-for-sale-on-dark-web/",
        "Summary": "A 63.4MB database, purportedly containing sensitive employee information from the business management software company Odoo, is allegedly being offered for sale on a dark web forum. The seller claims the data was obtained via a &#8220;collaborative effort with a senior insider&#8221; from Odoo. Odoo is a prominent Belgian company that provides a suite of open-source [&#8230;]",
        "Date": "2025-06-05",
        "Content": "A 63.4MB database, purportedly containing sensitive employee information from the business management software company Odoo, is allegedly being offered for sale on a dark web forum. The seller claims the data was obtained via a “collaborative effort with a senior insider” from Odoo.\nOdoo is a prominent Belgian company that provides a suite of open-source business applications, including customer relationship management (CRM), e-commerce, accounting, inventory management, project management, and human resources software. Their products are utilized by millions of users worldwide, ranging from small businesses to large enterprises, making employee data a valuable target. The alleged breach, if confirmed, could expose a significant amount of personal and professional information belonging to Odoo’s workforce.\nThe cybercriminal is asking for $25,000 in Monero (XMR) or Bitcoin (BTC) for the database. The advertisement details the types of information allegedly included in the compromised data:\nUnique identifiers (id, odoo_id, odoo_employee_id, emp_number, uniq_id)\nEmployee profiles (full_name, email, password, mobile, image)\nJob roles and hierarchies (position_id, role_id, odoo_leave_manager_id, attendance_type_id, status_id, user_type_id)\nAuthentication details (remember_t)\nGeolocation data (longitude_check_in, latitude_check_in, check_in_location_from_google_map, check_out_location_from_google_map)\nAdditional attributes (email_verified_at, mobile_verified_at, is_time_off_hr, work_time_type, send_auth_code_first_time, work_phone, leave_manager_id)\nThe authenticity of the data and the seller’s claims are yet to be officially verified. However, the detailed nature of the listed data points raises serious concerns about the potential exposure of Odoo employees’ sensitive information.\nTags:\nalleged leak\nCyberSecurity\ndark web\ndata-breach\nemployee data\nERP software\ninsider threat\nOdoo"
    }
]