[
    {
        "Title": "Google rolls out Veo 3 video generator, try it for free using credits",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/google-rolls-out-veo-3-video-generator-try-it-for-free-using-credits/",
        "Summary": "Google is rolling out Veo 3 to everyone using Vertex AI, which is an ML-testing platform provided by Google Cloud. [...]",
        "Date": "2025-06-29",
        "Content": "Google is\nrolling\nout Veo 3 to everyone using Vertex AI, which is an ML-testing platform provided by Google Cloud.\nUnlike Sora and other generative video AI models, Veo 3 is a state-of-the-art video generator trained on millions of YouTube videos, and it can generate realistic videos, but great quality comes at a high cost.\nVeo 3 isn't free, but since it's part of Google Cloud, you can use it for free by subscribing to the $300 trial offered by Google.\nTo get started, you can sign up for a\nGoogle Cloud trial credit\n, which applies to all Google Cloud services, including Vertex AI.\nYour Google Cloud trial, which requires a credit or debit card for human verification, offers $300 of Cloud Billing credits, valid for 90 days. You will not be charged until you exhaust the limit and upgrade to a regular account.\n$300 is more than enough to generate several clips, but remember that Vertex AI can generate Veo 3 clips of 8 seconds only.\nA basic prompt is more than enough to generate video clips with audio, which can even match the native accent of several languages.\nGoogle's YouTube channel has\nseveral\nunlisted\nvideos that show off the quality of Veo 3.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nGoogle releases Gemini CLI with free Gemini 2.5 Pro\nGoogle rolls out text-to-image model Imagen 4 for free\nGoogle Cloud donates A2A AI protocol to the Linux Foundation\nChatGPT will analyze Gmail emails, manage schedule on Google Calendar\nGoogle’s upcoming Gemini Kingfall is allegedly a coding beast"
    },
    {
        "Title": "Bluetooth flaws could let hackers spy through your microphone",
        "Link": "https://www.bleepingcomputer.com/news/security/bluetooth-flaws-could-let-hackers-spy-through-your-microphone/",
        "Summary": "Vulnerabilities affecting a Bluetooth chipset present in more than two dozen audio devices from ten vendors can be exploited for eavesdropping or stealing sensitive information. [...]",
        "Date": "2025-06-29",
        "Content": "Vulnerabilities affecting a Bluetooth chipset present in more than two dozen audio devices from ten vendors can be exploited for eavesdropping or stealing sensitive information.\nResearchers confirmed that 29 devices from Beyerdynamic, Bose, Sony, Marshall, Jabra, JBL, Jlab, EarisMax, MoerLabs, and Teufel are affected.\nThe list of impacted products includes speakers, earbuds, headphones, and wireless microphones.\nThe security problems could be leveraged to take over a vulnerable product and on some phones, an attacker within connection range may be able to extract call history and contacts.\nSnooping over a Bluetooth connection\nAt the\nTROOPERS\nsecurity conference in Germany, researchers at cybersecurity company ERNW disclosed three vulnerabilities in the Airoha systems on a chip (SoCs), which are widely used in True Wireless Stereo (TWS) earbuds.\nThe issues are not critical and besides close physical proximity (Bluetooth range), their exploitation also requires “a high technical skill set.” They received the following identifiers:\nCVE-2025-20700 (6.7, medium severity score) - missing authentication for GATT services\nCVE-2025-20701 (6.7, medium severity score) -  missing authentication for Bluetooth BR/EDR\nCVE-2025-20702 (7.5, high severity score) - critical capabilities of a custom protocol\nERNW researchers say they created a proof-of-concept exploit code that allowed them to read the currently playing media from the targeted headphones.\nReading currently played song from a vulnerable Airoha device\nsource: ERWN\nWhile such an attack may not present a great risk, other scenarios leveraging the three bugs could let a threat actor hijack the connection between the mobile phone and an audio Bluetooth device and use the Bluetooth Hands-Free Profile (HFP) to issue commands to the phone.\n“The range of available commands depends on the mobile operating system, but all major platforms support at least initiating and receiving calls” -\nERNW\nThe researchers were able to trigger a call to an arbitrary number by extracting the Bluetooth link keys from a vulnerable device’s memory.\nThey say that depending on the phone’s configuration, an attacker could also retrieve the call history and contacts.\nThey were also able to initiate a call and \"successfully eavesdrop on conversations or sounds within earshot of the phone.\"\nFurthermore, the vulnerable device’s firmware could potentially be rewritten to enable remote code execution, thereby facilitating the deployment of a wormable exploit capable of propagating across multiple devices.\nAttack restrictions apply\nAlthough the ERNW researchers present serious attack scenarios, practical implementation at scale is constrained by certain limitations.\n“Yes — the idea that someone could hijack your headphones, impersonate them towards your phone, and potentially make calls or spy on you, sounds pretty alarming.”\n“Yes — technically, it is serious,” the researchers say, adding that “real attacks are complex to perform.”\nThe necessity of both technical sophistication and physical proximity confines these attacks to high-value targets, such as those in diplomacy, journalism, activism, or sensitive industries.\nAiroha has released an updated SDK incorporating necessary mitigations, and device manufacturers have started patch development and distribution.\nNevertheless, German publication\nHeise says\nthat the most recent firmware updates for more than half of the affected devices are from May 27 or earlier, which is before Airoha delivered the updated SDK to its customers.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nBluetooth 6.1 enhances privacy with randomized RPA timing"
    },
    {
        "Title": "Cloudflare open-sources Orange Meets with End-to-End encryption",
        "Link": "https://www.bleepingcomputer.com/news/security/cloudflare-open-sources-orange-meets-with-end-to-end-encryption/",
        "Summary": "Cloudflare has implemented end-to-end encryption (E2EE) to its video calling app Orange Meets and open-sourced the solution for transparency. [...]",
        "Date": "2025-06-29",
        "Content": "Cloudflare has implemented end-to-end encryption (E2EE) to its video calling app Orange Meets and open-sourced the solution for transparency.\nThe application has been available since last year when the internet giant launched it as a demo for Cloudflare Calls (now Realtime).\nWith the\nintroduction of E2EE\nand the resolution of various trust and verification issues, users interested in strong cryptographic assurances can explore Orange Meets as a foundation for secure video calling in research or prototyping contexts.\nE2EE encryption design\nOrange Meets implements end-to-end encryption using Messaging Layer Security (MLS), an IETF-standardized group key exchange protocol.\nThe Rust-based implementation of MLS on Orange Meets enables continuous group key agreement, which supports secure group key exchange, forward secrecy, post-compromise security, and scalability.\nThe encryption is handled entirely on the client side using WebRTC, so Cloudflare or the Selective Forwarding Unit (SFU) acts as forwarding intermediaries that do not have access to sensitive communication data.\nOrange Meet topology\nSource: Cloudflare\nCloudflare has\nalso introduced\na \"Designated Committer Algorithm\" that handles dynamic group membership changes (user joins/leaves a video call) securely.\nThis system practically designates a specific member as the party that governs MLS updates in a fully client-side fashion, automatically selecting a new designated committer based on the group's state.\nDesignated committer handling a new user join action\nSource: Cloudflare\nFinally, each video conferencing session displays a \"safety number\" representing the group's cryptographic state, which participants are encouraged to verify outside the platform.\nThis prevents \"Monster-in-the-Middle\" (MitM) attacks where a malicious server substitutes key material.\nCloudflare formally modeled the Designated Committer Algorithm in TLA+, a specification language used to mathematically verify that the protocol behaves correctly under all possible conditions, thereby catching subtle edge-case bugs.\nAll that being said, it is essential to emphasize that Orange Meets is more of a technical showcase and open-source prototype than a polished consumer product.\nIt is not as feature-rich and user-friendly as Zoom, Google Meet, Signal, or Microsoft Teams and hasn't been thoroughly audited or battle-tested yet.\nCloudflare's tool is more geared towards developers with an interest in MLS integration and cryptography, as well as privacy enthusiasts and curious users who want to tinker with open-source E2EE video calling. It is also suitable for researchers or engineers evaluating MLS implementations.\nOrange Meets does not require installation to test or use, as a live demo is\navailable online\n.\nAlternatively, users may set up their own instance by using the source code available on this\nGitHub repository\n.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nRussia’s throttling of Cloudflare makes sites inaccessible\nGoogle Cloud donates A2A AI protocol to the Linux Foundation\nCloudflare blocks record 7.3 Tbps DDoS attack against hosting provider\nCloudflare: Outage not caused by security incident, data is safe\nGoogle Cloud and Cloudflare hit by widespread service outages"
    }
]