[
    {
        "Title": "New Atomic macOS Stealer Campaign Exploits ClickFix to Target Apple Users",
        "Link": "https://thehackernews.com/2025/06/new-atomic-macos-stealer-campaign.html",
        "Summary": "Cybersecurity researchers are alerting to a new malware campaign that employs the ClickFix social engineering tactic to trick users into downloading an information stealer malware known as Atomic macOS Stealer (AMOS) on Apple macOS systems.\nThe campaign, according to CloudSEK, has been found to leverage typosquat domains mimicking U.S.-based telecom provider Spectrum.\n\"macOS users are served a",
        "Date": "2025-06-06",
        "Content": "Cybersecurity researchers are alerting to a new malware campaign that employs the\nClickFix\nsocial engineering tactic to trick users into downloading an information stealer malware known as Atomic macOS Stealer (\nAMOS\n) on Apple macOS systems.\nThe campaign, according to CloudSEK, has been found to leverage typosquat domains mimicking U.S.-based telecom provider Spectrum.\n\"macOS users are served a malicious shell script designed to steal system passwords and download an AMOS variant for further exploitation,\" security researcher Koushik Pal\nsaid\nin a report published this week. \"The script uses native macOS commands to harvest credentials, bypass security mechanisms, and execute malicious binaries.\"\nIt's believed that the activity is the work of Russian-speaking cybercriminals owing to the presence of Russian language comments in the malware's source code.\nThe starting point of the attack is a web page that impersonates Spectrum (\"panel-spectrum[.]net\" or \"spectrum-ticket[.]net\"). Visitors to the sites in question are served a message that instructs them to complete a hCaptcha verification check to in order to \"review the security\" of their connection before proceeding further.\nHowever, when the user clicks the \"I am human\" checkbox for evaluation, they are displayed an error message stating \"CAPTCHA verification failed,\" urging them to click a button to go ahead with an \"Alternative Verification.\"\nDoing so causes a command to be copied to the users' clipboard and the victim is shown a set of instructions depending on their operating system. While they are guided to run a PowerShell command on Windows by opening the Windows Run dialog, it's substituted by a shell script that's executed by launching the Terminal app on macOS.\nThe shell script, for its part, prompts users to enter their system password and downloads a next-stage payload, in this case, a known stealer called Atomic Stealer.\n\"Poorly implemented logic in the delivery sites, such as mismatched instructions across platforms, points to hastily assembled infrastructure,\" Pal said.\n\"The delivery pages in question for this AMOS variant campaign contained inaccuracies in both its programming and front-end logic. For Linux user agents, a PowerShell command was copied. Furthermore, the instruction 'Press & hold the Windows Key + R' was displayed to both Windows and Mac users.\"\nThe disclosure comes amid a surge in campaigns using the ClickFix tactic to deliver a wide range of malware families over the past year.\n\"Actors carrying out these targeted attacks typically utilize similar techniques, tools, and procedures (TTPs) to gain initial access,\" Darktrace\nsaid\n. \"These include spear phishing attacks, drive-by compromises, or exploiting trust in familiar online platforms, such as GitHub, to deliver malicious payloads.\"\nThe links distributed using these vectors typically redirect the end user to a malicious URL that displays a fake CAPTCHA verification check and completes it in an attempt to deceive users into thinking that they are carrying out something innocuous, when, in reality, they are guided to execute malicious commands to fix a non-existent issue.\nThe end result of this effective social engineering method is that users end up compromising their own systems, effectively bypassing security controls.\nIn one April 2025 incident analyzed by Darktrace, unknown threat actors were found to utilize ClickFix as an attack vector to download nondescript payloads to burrow deeper into the target environment, conduct lateral movement, send system-related information to an external server via an HTTP POST request, and ultimately exfiltrate data.\n\"ClickFix baiting is a widely used tactic in which threat actors exploit human error to bypass security defenses,\" Darktrace said. \"By tricking endpoint users into performing seemingly harmless, everyday actions, attackers gain initial access to systems where they can access and exfiltrate sensitive data.\"\nOther ClickFix attacks have employed phony versions of other popular CAPTCHA services like Google reCAPTCHA and Cloudflare Turnstile for malware delivery under the guise of routine security checks.\nThese fake pages are \"pixel-perfect copies\" of their legitimate counterparts, sometimes even injected into real-but-hacked websites to trick unsuspecting users. Stealers such as\nLumma\nand\nStealC\n, as well as full-fledged remote access trojans (RATs) like\nNetSupport RAT\nare some of the payloads distributed via bogus Turnstile pages.\n\"Modern internet users are inundated with spam checks, CAPTCHAs, and security prompts on websites, and they've been conditioned to click through these as quickly as possible,\" SlashNext's Daniel Kelley\nsaid\n. \"Attackers exploit this 'verification fatigue,' knowing that many users will comply with whatever steps are presented if it looks routine.\"\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Empower Users and Protect Against GenAI Data Loss",
        "Link": "https://thehackernews.com/2025/06/empower-users-and-protect-against-genai.html",
        "Summary": "When generative AI tools became widely available in late 2022, it wasn’t just technologists who paid attention. Employees across all industries immediately recognized the potential of generative AI to boost productivity, streamline communication and accelerate work. Like so many waves of consumer-first IT innovation before it—file sharing, cloud storage and collaboration platforms—AI landed in",
        "Date": "2025-06-06",
        "Content": "When generative AI tools became widely available in late 2022, it wasn't just technologists who paid attention. Employees across all industries immediately recognized the potential of generative AI to boost productivity, streamline communication and accelerate work. Like so many waves of consumer-first IT innovation before it—file sharing, cloud storage and collaboration platforms—AI landed in the enterprise not through official channels, but through the hands of employees eager to work smarter.\nFaced with the risk of sensitive data being fed into public AI interfaces, many organizations responded with urgency and force: They blocked access. While understandable as an initial defensive measure, blocking public AI apps is not a long-term strategy—it's a stopgap. And in most cases, it's not even effective.\nShadow AI: The Unseen Risk\nThe Zscaler ThreatLabz team has been tracking\nAI and machine learning (ML) traffic\nacross enterprises, and the numbers tell a compelling story. In 2024 alone, ThreatLabz analyzed 36 times more AI and ML traffic than in the previous year, identifying over 800 different AI applications in use.\nBlocking has not stopped employees from using AI. They email files to personal accounts, use their phones or home devices, and capture screenshots to input into AI systems. These workarounds move sensitive interactions into the shadows, out of view from enterprise monitoring and protections. The result? A growing blind spot is known as Shadow AI.\nBlocking unapproved AI apps may make usage appear to drop to zero on reporting dashboards, but in reality, your organization isn't protected; it's just blind to what's actually happening.\nLessons From SaaS Adoption\nWe've been here before. When early software as a service tool emerged, IT teams scrambled to control the unsanctioned use of cloud-based file storage applications. The answer wasn't to ban file sharing though; rather it was to offer a secure, seamless, single-sign-on alternative that matched employee expectations for convenience, usability, and speed.\nHowever, this time around the stakes are even higher. With SaaS, data leakage often means a misplaced file. With AI, it could mean inadvertently training a public model on your intellectual property with no way to delete or retrieve that data once it's gone. There's no \"undo\" button on a large language model's memory.\nVisibility First, Then Policy\nBefore an organization can intelligently govern AI usage, it needs to understand what's actually happening. Blocking traffic without visibility is like building a fence without knowing where the property lines are.\nWe've solved problems like these before. Zscaler's position in the traffic flow gives us an unparalleled vantage point. We see what apps are being accessed, by whom and how often. This real-time visibility is essential for assessing risk, shaping policy and enabling smarter, safer AI adoption.\nNext, we've evolved how we deal with policy. Lots of providers will simply give the black-and-white options of \"allow\" or \"block.\" The better approach is context-aware, policy-driven governance that aligns with zero-trust principles that assume no implicit trust and demand continuous, contextual evaluation. Not every use of AI presents the same level of risk and policies should reflect that.\nFor example, we can provide access to an AI application with caution for the user or allow the transaction only in browser-isolation mode, which means users aren't able to paste potentially sensitive data into the app. Another approach that works well is redirecting users to a corporate-approved alternative app which is managed on-premise. This lets employees reap productivity benefits without risking data exposure. If your users have a secure, fast, and sanctioned way to use AI, they won't need to go around you.\nLast, Zscaler's data protection tools mean we can allow employees to use certain public AI apps, but prevent them from inadvertently sending out sensitive information. Our research shows over 4 million data loss prevention (DLP) violations in the Zscaler cloud, representing instances where sensitive enterprise data—such as financial data, personally identifiable information, source code, and medical data—was intended to be sent to an AI application, and that transaction was blocked by Zscaler policy. Real data loss would have occurred in these AI apps without Zscaler's DLP enforcement.\nBalancing Enablement With Protection\nThis isn't about stopping AI adoption—it's about shaping it responsibly. Security and productivity don't have to be at odds. With the right tools and mindset, organizations can achieve both: empowering users and protecting data.\nLearn more at\nzscaler.com/security\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft Helps CBI Dismantle Indian Call Centers Behind Japanese Tech Support Scam",
        "Link": "https://thehackernews.com/2025/06/microsoft-helps-cbi-dismantle-indian.html",
        "Summary": "India's Central Bureau of Investigation (CBI) has revealed that it has arrested six individuals and dismantled two illegal call centers that were found to be engaging in a sophisticated transnational tech support scam targeting Japanese citizens.\nThe law enforcement agency said it conducted coordinated searches at 19 locations across Delhi, Haryana, and Uttar Pradesh on May 28, 2025, as part of",
        "Date": "2025-06-06",
        "Content": "India's Central Bureau of Investigation (CBI) has revealed that it has arrested six individuals and dismantled two illegal call centers that were found to be engaging in a sophisticated transnational tech support scam targeting Japanese citizens.\nThe law enforcement agency said it conducted coordinated searches at 19 locations across Delhi, Haryana, and Uttar Pradesh on May 28, 2025, as part of an initiative called Operation Chakra V, which aims to combat cyber-enabled financial crimes.\nThe cybercrime syndicates, per the CBI, defrauded foreign nationals, mainly Japanese citizens, by masquerading as technical support personnel from various multinational corporations, including Microsoft.\n\"The syndicate operated call centers designed to appear as legitimate customer service centers, through which victims were deceived into believing that their electronic devices were compromised,\" the agency\nsaid\n. \"Under this pretext, victims were coerced into transferring funds into mule accounts.\"\nAuthorities said they worked together with the National Police Agency of Japan and Microsoft, allowing them to track down the perpetrators of the scheme and its operational structure. In addition, valuable evidence in the form of computers, storage devices, digital video recorders, and phones has been seized.\nThe CBI said the operation criminal enterprise leveraged advanced social engineering techniques and \"technical subterfuge\" to deceive victims and extract money under false pretenses.\n\"With the growth of cybercrime-as-a-service, connectivity among cybercriminals has increased and become more global,\" Microsoft's Steven Masada\nsaid\n. \"We must continue to look at the full ecosystem in which these actors operate and coordinate with multiple international partners to meaningfully address cybercrime.\"\nThe tech giant further said it has been closely working with the Japan Cybercrime Control Center (JC3) to uncover the fake technical support scam, enabling it to take down approximately 66,000 malicious domains and URLs globally since May 2024.\nThe cross-sector collaboration, Redmond added, made it possible to identify the broader network behind these operations, which includes pop-up creators, search-engine optimizers, lead generators, logistics and technology providers, payment processors, and talent providers.\n\"These actors used generative AI to scale their operations, including to identify potential victims, automate the creation of malicious pop-up windows, and perform language translations to target Japanese victims,\" Masada said.\n\"This activity highlights the increasingly sophisticated tactics employed by cybercriminals and underscores the importance of proactive global collaboration to protect victims. \"\nThe action comes shortly after Reuters\nreported\nthat the recently disclosed\ndata breach at Coinbase\nhas links to India-based customer support representatives TaskUs, who the threat actors bribed to steal customer data from the cryptocurrency exchange.\nThe breach is said to have been first identified in January 2025, with TaskUs stating that it had fired two employees after they illegally accessed information from a Coinbase around the same time. Coinbase has since terminated its contract with the company.\nThe developments also follow the arrest of 20 suspects across 12 countries between March and May 2025 in an international operation on charges of creating and distributing child sexual abuse material (CSAM).\n\"Spanish authorities arrested seven suspects, including a healthcare worker and a teacher,\" INTERPOL\nsaid\n. \"The healthcare worker allegedly paid minors from Eastern Europe for explicit images, while the teacher is accused of possessing and sharing child sexual abuse material via various online platforms.\"\nAnother 10 suspects have been arrested from different Latin American countries, including three in El Salvador and a teacher in Panama. The remaining arrests took place in Europe and the United States. INTERPOL said that 68 additional suspects have been identified and further investigations are currently ongoing globally.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Inside the Mind of the Adversary: Why More Security Leaders Are Selecting AEV",
        "Link": "https://thehackernews.com/2025/06/inside-mind-of-adversary-why-more.html",
        "Summary": "Cybersecurity involves both playing the good guy and the bad guy. Diving deep into advanced technologies and yet also going rogue in the Dark Web. Defining technical policies and also profiling attacker behavior. Security teams cannot be focused on just ticking boxes, they need to inhabit the attacker’s mindset.\nThis is where AEV comes in.\nAEV (Adversarial Exposure Validation) is an advanced",
        "Date": "2025-06-06",
        "Content": "Cybersecurity involves both playing the good guy and the bad guy. Diving deep into advanced technologies and yet also going rogue in the Dark Web. Defining technical policies and also profiling attacker behavior. Security teams cannot be focused on just ticking boxes, they need to inhabit the attacker's mindset.\nThis is where AEV comes in.\nAEV (Adversarial Exposure Validation) is an advanced offense technology that mimics how adversaries will attack your system, while providing remediation strategies. It lets you discover and address how your environment can be exploited and what the impact of the exploitation could be, in a dynamic and ongoing way.\nIn this article, we'll share everything you need to know about AEV, and how your team can leverage it to build continuous resilience against attacks.\nWhat is AEV?\nAccording to the\nGartner® Market Guide for Adversarial Exposure Validation\n(March 2025), AEV is defined as \"technologies that deliver consistent, continuous, and automated evidence of the feasibility of an attack.\" AEV operates by emulating cyber-attacks, providing organizations with an understanding of how attackers can infiltrate their networks. This allows organizations to take relevant security measures to effectively remediate security gaps.\nAEV technologies effectively consolidate previously isolated security testing methods, like\nAutomated Penetration Testing\nand\nBAS (Breach and Attack Simulation)\n. Gartner says \"As the two markets developed and overlapping capabilities increased, the two functions converged to unite offensive technologies\".\nAEV's focus is on replicating an actual adversary's mindset. By combining the breadth of automated pentesting and the impact-driven focus of BAS, AEV enables continuous testing that mirrors how real attackers adapt over time. Organizations can continuously emulate how attackers operate, providing a more insightful confirmation of vulnerabilities and how to best fix them.\nHow AEV Supports Exposure Management\nAEV emerged as a technological solution to support\nCTEM (Continuous Threat Exposure Management)\npractices. CTEM is an all-encompassing program that helps organizations identify vulnerabilities and exposures, determine the risk profiles of digital assets, prioritize their risk mitigation, and then monitor remediation.\nHere's how AEV facilitates CTEM:\nFiltering Mechanism\n- Instead of generating massive lists of generic findings, AEV narrows down the vulnerabilities found to be actually exploitable. A process that confirms the legitimacy of security issues and assesses how easily they can be accessed by threat actors. This approach is far more efficient than traditional patch-everything methods as it only flags the highest-risk issues, and in the process identifies exposures that are benign and don't actually warrant remediation.\nContinuous Nature\n- Rather than a one-time event or a brief engagement, AEV's ongoing and frequent automated tests support CTEM's continuous feedback loop of discovery, testing, and remediation. This helps to ensure a perpetual state of attack readiness even in the face of new threat techniques and as the IT environment changes and new software misconfigurations develop.\nReal Testing -\nStaging environments often fail to accurately represent the actual conditions in which attackers would exploit an environment. These include misconfigurations, dormant user accounts, data anomalies, and complex integrations. Some best-of-breed AEV tools address this by testing safely in production environments, making them far more accurate and effective at identifying vulnerabilities that could lead to a disastrous impact.\nRemediation Beyond Patching -\nBeyond just patching exploitable CVEs, AEV identifies non-patchable vulnerabilities for remediation, like replacing exposed credentials, implementing the principle of least privilege, fixing misconfigurations, replacing insecure third-party software, and more. This is aligned with CTEM's remediation guidance, which holistically seeks to reduce exposure to potential threats and risks.\nAEV for Red Teams\nAEV automatically identifies how an attacker might chain together multiple vulnerabilities across different environments. This makes it a staple in any red teamer's toolkit.\nWith AEV, red teams can more easily model attack scenarios. This includes complex ones like attackers hopping between cloud infrastructure and on-prem systems or pivoting through different network segments, while overcoming existing controls and combining low-scoring exposures into a full-scale breach.\nEquipped with information provided by AEV, red teams gain a clear view of how a determined attacker might move laterally, allowing them to scale their efforts and fast-track mitigation. For the organization, AEV ensures cost-effective red-teaming and even allows for entry-level red-teamers to provide quality results. GenAI is expected to augment this even further by providing ideas and explanations for complex attack scenarios.\nAEV for Blue Teams\nFor blue teamers, AEV provides a strong head start. With AEV, defenders can see in the face of an attack which protections are really robust, which require strengthening, and which controls are in fact redundant. This helps defenders ensure that their security posture is working at its best using a trending analysis to show that the program works as expected.\nBlue teams can use insights and data from AEVs for:\nDetection stack tuning\nPreventive posture changes\nExposure prioritization\nService provider performance validation\nSecurity vendor performance scorecards\nOther operations or controls improvements\nAEV for Security Resilience\nAEV is designed to provide continuous, automated, and realistic simulations of how attackers could exploit weaknesses in an organization's defenses. No wonder it is quickly emerging as a pivotal technology in cybersecurity. With AEV, security teams are getting that proven validation of how exposures in their environment could be exploited and to what end, enabling smarter prioritization and effective remediation at a faster pace. This necessary clarity is key to fostering cyber resilience.\nTo learn more about how to implement AEV, and its role within a wider CTEM practice,\nregister to\nattend Xposure\n, Pentera's Exposure Management Summit.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "New PathWiper Data Wiper Malware Disrupts Ukrainian Critical Infrastructure in 2025 Attack",
        "Link": "https://thehackernews.com/2025/06/new-pathwiper-data-wiper-malware.html",
        "Summary": "A critical infrastructure entity within Ukraine was targeted by a previously unseen data wiper malware named PathWiper, according to new findings from Cisco Talos.\n\"The attack was instrumented via a legitimate endpoint administration framework, indicating that the attackers likely had access to the administrative console, that was then used to issue malicious commands and deploy PathWiper across",
        "Date": "2025-06-06",
        "Content": "A critical infrastructure entity within Ukraine was targeted by a previously unseen data wiper malware named PathWiper, according to new findings from Cisco Talos.\n\"The attack was instrumented via a legitimate endpoint administration framework, indicating that the attackers likely had access to the administrative console, that was then used to issue malicious commands and deploy PathWiper across connected endpoints,\" researchers Jacob Finn, Dmytro Korzhevin, and Asheer Malhotra\nsaid\nin an analysis published Thursday.\nThe attack is assessed to be the work of a Russia-nexus advanced persistent threat (APT) actor based on the tradecraft observed and the overlapping capabilities with destructive malware used in attacks against Ukraine.\nTalos said the commands issued by the administrative tool's console were received by its client running on the victim endpoints and then executed as a batch (BAT) file.\nThe BAT file, in turn, consisted of a command to run a malicious Visual Basic Script (VBScript) file in the Windows TEMP folder called \"uacinstall.vbs,\" that was also pushed to the machines via the administrative console. The VBScript, for its part, dropped the wiper binary under the name \"sha256sum.exe\" in the same folder and executed it.\n\"Throughout the course of the attack, filenames and actions used were intended to mimic those deployed by the administrative utility's console, indicating that the attackers had prior knowledge of the console and possibly its functionality within the victim enterprise's environment,\" Talos said.\nOnce launched, PathWiper is designed to gather a list of connected storage media, including physical drive names, volume names and paths, and network drive paths. The wiper then proceeds to create one thread per drive and volume for every path recorded and overwrites the contents of the artifacts with randomly generated bytes.\nSpecifically, it targets: Master Boot Record (MBR), $MFT, $MFTMirr, $LogFile, $Boot, $Bitmap, $TxfLog, $Tops, and $AttrDef. In addition, PathWiper irrevocably destroys files on disk by overwriting them with randomized bytes and attempts to dismount volumes.\nPathWiper has been found to share some level of similarity with\nHermeticWiper\n(aka FoxBlade, KillDisk, or NEARMISS), which was detected coinciding with Russia's full-scale military invasion of Ukraine in February 2024. The HermeticWiper malware is attributed to the Russia-linked\nSandworm\ngroup.\nWhile both wipers attempt to corrupt the MBR and NTFS-related artifacts, it bears noting that HermeticWiper and PathWiper differ in the manner the data corruption mechanism is used against identified drives and volumes.\n\"The continued evolution of wiper malware variants highlights the ongoing threat to Ukrainian critical infrastructure despite the longevity of the Russia-Ukraine war,\" the researchers said.\nSilent Werewolf Targets Russia and Moldova\nThe discovery of a new breed of wiper malware against Ukraine comes as Russian cybersecurity company BI.ZONE uncovered two new campaigns undertaken by Silent Werewolf in March 2025 to infect Moldovan and Russian companies with malware.\n\"The attackers employed two separate loader instances to retrieve the malicious payload from their C2 server,\" the company\nsaid\n. \"Unfortunately, the payload itself was not available at the time of this research. However, a retrospective analysis of similar Silent Werewolf campaigns suggests that the threat actor used XDigo malware.\"\nSome of the targets of the attacks include nuclear, aircraft, instrumentation, and mechanical engineering sectors in Russia. The starting point is a phishing email containing a ZIP file attachment that, in turn, includes an LNK file and a nested ZIP archive. The second ZIP file consists of a legitimate binary, a malicious DLL, and a decoy PDF.\nUnpacking and launching the Windows shortcut file triggers the extraction of the nested archive and ultimately causes the rogue DLL to be sideloaded via the legitimate executable (\"DeviceMetadataWizard.exe\"). The DLL is a C# loader (\"d3d9.dll\") that's designed to retrieve the next-stage payload from a remote server and display the lure document to the victim.\n\"The adversaries appear to run checks on target systems,\" BI.ZONE said. \"If a target host does not meet certain criteria, the Llama 2 large language model (LLM) in GGUF format is downloaded from hxxps://huggingface[.]co/TheBloke/Llama-2-70B-GGUF/resolve/main/llama-2-70b.Q5_K_M.gguf.\"\n\"This hinders the comprehensive analysis of the entire attack and allows the threat actor to bypass defenses such as sandboxes.\"\nThe cybersecurity firm said it observed a second campaign that same month targeting unknown sectors in Moldova and, likely, Russia using the same C# loader, but via phishing lures related to official vacation schedules and recommendations for protecting corporate information infrastructure against ransomware attacks.\nThe cyber espionage group, per BI.ZONE, is believed to be active at least since 2011, targeting a wide range of companies in Russia, Belarus, Ukraine, Moldova and Serbia. The attacks are characterized by the use of phishing lures to deliver\nmalware\nsuch as XDSpy, XDigo, and DSDownloader.\nPro-Ukrainian Hacktivist Group BO Team Targets Russia\nIn recent months, Russian state-owned companies and organizations spanning technology, telecommunications, and production verticals are also said to have come under cyber assaults from a pro-Ukrainian hacktivist group codenamed BO Team (aka Black Owl, Hoody Hyena, and Lifting Zmiy).\n\"BO Team is a serious threat aimed both at causing maximum damage to the victim and at extracting financial benefits,\" Kaspersky researchers\nsaid\nin a report last week, detailing the threat actor's ability to sabotage victim's infrastructure and, in some instances, even resorts to data encryption and extortion.\nActive since at least January 2024, attacks mounted by the hacktivist cluster are known to leverage post-exploitation frameworks, including Mythic and Cobalt Strike, as well as legitimate remote access and tunneling tools. The group also has a history of accessing confidential data and publishing information about successful attacks in its Telegram channel BO Team.\nInitial access to target networks is accomplished by sending phishing emails containing booby-trapped attachments that, when opened, activate an infection chain designed to deploy known commodity malware families like DarkGate,\nBrockenDoor\n, and Remcos RAT. Also used are tools such as HandleKatz and NanoDump for dumping LSASS and creating LSASS dumps, respectively.\nArmed with the remote access, BO Team has been observed destroying file backups, deleting files using the SDelete utility, and additionally dropping the Windows version of the\nBabuk\nencryptor to demand a ransom in exchange for regaining access.\nSome of the other activities carried out by the threat actor are listed below -\nSetting up persistence using scheduled tasks\nAssigning malicious component names similar to system or well-known executable files to evade detection\nExtracting the Active Directory database using ntdsutil\nRunning various commands to collect information about Telegram, running processes, current users, remote RDP sessions, and antivirus software installed on the endpoints\nUsing RDP and SSH protocols to perform lateral movement within Windows and Linux infrastructures\nDropping legitimate remote access software like AnyDesk for command-and-control\n\"The BO Team group poses a significant threat to Russian organizations due to its unconventional approach to conducting attacks,\" Kaspersky said. \"Unlike most pro-Ukrainian hacktivist groups, BO Team actively uses a wide arsenal of malware, including backdoors such as BrockenDoor, Remcos, and DarkGate.\"\n\"These features confirm the high level of autonomy of the group and the absence of stable connections with other representatives of the pro-Ukrainian hacktivist cluster. In the public activity of BO Team, there are practically no signs of interaction, coordination or exchange of tools with other groups. This once again emphasizes its unique profile within the current hacktivist landscape in Russia.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft shares script to restore inetpub folder you shouldn’t delete",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-shares-script-to-restore-inetpub-folder-you-shouldnt-delete/",
        "Summary": "Microsoft has released a PowerShell script to help restore an empty 'inetpub' folder created by the April 2025 Windows security updates if deleted. As Microsoft previously warned, this folder helps mitigate a high-severity Windows Process Activation privilege escalation vulnerability. [...]",
        "Date": "2025-06-06",
        "Content": "Microsoft has released a PowerShell script to help restore an empty 'inetpub' folder created by the April 2025 Windows security updates if deleted. As Microsoft previously warned, this folder helps mitigate a high-severity Windows Process Activation privilege escalation vulnerability.\nIn April, after installing the new security updates, Windows users\nsuddenly found\nthat an empty C:\\Inetpub folder was created. As this folder is associated with Microsoft's Internet Information Server, users found it confusing that it was created when the web server was not installed.\nThis caused some people to remove the folder, making them vulnerable again to the patched vulnerability. Microsoft said that users who removed it\ncan manually recreate it\nby installing Internet Information Services from the Windows \"Turn Windows Features on or off\" control panel.\nOnce IIS is installed, a new inetpub folder will be added to the root of the C:\\ drive, with files and the same SYSTEM ownership as the directory created by the April Windows security updates. Also, if you don't use IIS, you can uninstall it using the same Windows Features control panel to remove it, leaving the C:\\inetpub folder behind.\nOn Wednesday, in a new update to the CVE-2025-21204 advisory, the company also shared a\nremediation script\nthat helps admins re-create this folder from a PowerShell shell using the following commands:\nInstall-Script -Name Set-InetpubFolderAcl\r\n\r\nC:\\Program` Files\\WindowsPowerShell\\Scripts\\Set-InetpubFolderAcl.ps1\nAs Redmond explains, the script will set the correct IIS permissions to prevent unauthorized access and potential vulnerabilities related to CVE-2025-21204.\nIt will also update access control list (ACL) entries for the DeviceHealthAttestation directory on Windows Server systems to ensure it is secure if created by the February 2025 security updates.\nExecuting the script in Windows PowerShell (BleepingComputer)\n​Microsoft: \"Don't delete it.\"\nThe security flaw (\nCVE-2025-21204\n) mitigated by this inetpub folder (automatically created by April's security updates even on systems where the IIS web server platform was not previously installed) is caused by an improper link resolution issue in the Windows Update Stack.\nThis likely means that Windows Update may follow symbolic links on unpatched devices in a way that can let local attackers trick the OS into accessing or modifying unintended files or folders.\nMicrosoft says successful exploitation allows attackers with low privileges to escalate permissions and manipulate or perform file management operations in the context of the NT AUTHORITY\\SYSTEM account.\nWhile removing the folder did not cause issues using Windows in our tests, Microsoft\ntold BleepingComputer\nit was intentionally created and should not be deleted. Redmond issued the same warning in an updated advisory for the CVE-2025-21204 security flaw to warn users not to delete the empty %systemdrive%\\inetpub folder.\n\"This folder should not be deleted regardless of whether Internet Information Services (IIS) is active on the target device. This behavior is part of changes that increase protection and does not require any action from IT admins and end users,\" the company cautioned.\nCybersecurity expert Kevin Beaumont also demonstrated that non-admin users can abuse this folder\nto block Windows updates\nfrom being installed by creating a junction between C:\\inetpub and any Windows file.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMicrosoft: Windows 'inetpub' folder created by security fix, don’t delete\nMicrosoft introduces new Windows backup tool for businesses\nWindows \"inetpub\" security fix can be abused to block future updates\nWindows 11 April update unexpectedly creates new 'inetpub' folder\nMicrosoft warns of blue screen crashes caused by April updates"
    },
    {
        "Title": "Tax resolution firm Optima Tax Relief hit by ransomware, data leaked",
        "Link": "https://www.bleepingcomputer.com/news/security/tax-resolution-firm-optima-tax-relief-hit-by-ransomware-data-leaked/",
        "Summary": "U.S. tax resolution firm Optima Tax Relief suffered a Chaos ransomware attack, with the threat actors now leaking data stolen from the company. [...]",
        "Date": "2025-06-06",
        "Content": "U.S. tax resolution firm Optima Tax Relief suffered a Chaos ransomware attack, with the threat actors now leaking data stolen from the company.\nOptima Tax Relief is a well-known U.S. tax resolution and settlement firm that helps individuals and businesses in addressing and fixing federal and state tax issues. The company claims to be the nation’s leading tax resolution firm, having resolved over $3 billion in tax liabilities for clients.\nToday, the Chaos ransomware gang added Optima Tax Relief to its data leak site, claiming to have stolen 69 GB of data.\nOptima Tax Relief entry on Chaos data leak site\nSource: BleepingComputer\nThis data contains what appears to be corporate data and customer case files. Tax documents commonly contain sensitive personal information, such as Social Security numbers, phone numbers, and home addresses, which can be used for malicious activity by other threat actors or identity theft.\nSources with knowledge of the attack told BleepingComputer that this was a double-extortion attack, with the threat actors not only stealing data from the company but also encrypting servers.\nChaos ransomware is a relatively new ransomware operation that\nlaunched in March 2025\n, when it claimed five victims on its data leak site.\nThe ransomware gang should not be confused with The Chaos ransomware builder, which has been around\nsince 2021\nand used to create a myriad of branded encryptors used in phishing and malware campaigns.\nChaos ransomware also claimed to have breached the Salvation Army, which did not respond to our queries last week.\nBleepingComputer contacted Optima Tax Relief with questions about the attack and will update the story if we receive a response.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nM&S says customer data stolen in cyberattack, forces password resets\nGovtech giant Conduent confirms client data stolen in January cyberattack\nKettering Health confirms Interlock ransomware behind cyberattack\nInterlock ransomware claims Kettering Health breach, leaks stolen data\nMedia giant Lee Enterprises says data breach affects 39,000 people"
    },
    {
        "Title": "Kettering Health confirms Interlock ransomware behind cyberattack",
        "Link": "https://www.bleepingcomputer.com/news/security/kettering-health-confirms-interlock-ransomware-behind-cyberattack/",
        "Summary": "Healthcare giant Kettering Health, which manages 14 medical centers in Ohio, confirmed that the Interlock ransomware group breached its network and stole data in a May cyberattack. [...]",
        "Date": "2025-06-06",
        "Content": "Healthcare giant Kettering Health, which manages 14 medical centers in Ohio, confirmed that the Interlock ransomware group breached its network and stole data in a May cyberattack.\nKettering Health operates over 120 outpatient facilities and employs over 15,000 people, including over 1,800 physicians.\nThe healthcare network\nnoted in a Thursday statement\nthat its network devices have been secured, and its team is now working on re-establishing communication channels with patients disrupted by the outage triggered by last month's ransomware attack.\n\"The tools and persistence mechanisms used by the third-party group have been eradicated, and all affected systems have been secured,\" it said. \"A thorough review of all systems was conducted by external partners and our internal team, and all necessary security protocols, including network segmentation, enhanced monitoring, and updated access controls, are in place.\"\nKettering Health\ndisclosed a cyberattack on May 20\n, saying the resulting outage left medical staff without access to computerized charting systems and forced its care teams\nback to pen and paper\n. While the cyberattack also impacted its call center and some patient care systems, leading to canceled elective procedures, the health giant's emergency rooms and clinics remained open.\nOn Monday, the health network said it\nrestored access to its electronic health record (EHR) system\nand is working to bring the MyChart medical record application system for patients and call centers back online.\nThe Interlock ransomware gang\nclaimed responsibility\nfor the attack this week and published samples of allegedly stolen data, saying they exfiltrated 941 GB of files, including over 20,000 folders with 732,489 documents containing sensitive information.\nKettering Health on Interlock's leak site (BleepingComputer)\nThe stolen information allegedly includes patients' data, pharmacy and blood bank documents, bank reports, payroll information, Kettering Health police personnel files, and scans of identity documents, including passports.\nInterlock is a relatively new ransomware operation that\nemerged in September\nand has taken responsibility for numerous attacks on victims worldwide, many of whom were against healthcare organizations.\nThis cybercrime gang has also been\nassociated with ClickFix attacks\n, which involved impersonating IT tools to gain initial access to their targets' networks. Interlock operators have also deployed a previously unknown remote access trojan (RAT) named NodeSnake in\nattacks against U.K. universities\nearlier this year.\nMost recently, Interlock claimed\nthe breach of DaVita\n, a Fortune 500 kidney care provider operating over 2,600 dialysis centers across the United States, leaking 1.5 terabytes of data allegedly stolen from the victim's compromised systems.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nKettering Health hit by system-wide outage after ransomware attack\nInterlock ransomware claims Kettering Health breach, leaks stolen data\nTax resolution firm Optima Tax Relief hit by ransomware, data leaked\nInterlock ransomware gang deploys new NodeSnake RAT on universities\nMATLAB dev confirms ransomware attack behind service outage"
    },
    {
        "Title": "New PathWiper data wiper malware hits critical infrastructure in Ukraine",
        "Link": "https://www.bleepingcomputer.com/news/security/new-pathwiper-data-wiper-malware-hits-critical-infrastructure-in-ukraine/",
        "Summary": "A new data wiper malware named 'PathWiper' is being used in targeted attacks against critical infrastructure in Ukraine, aimed at disrupting operations in the country. [...]",
        "Date": "2025-06-06",
        "Content": "A new data wiper malware named 'PathWiper' is being used in targeted attacks against critical infrastructure in Ukraine, aimed at disrupting operations in the country.\nThe payload was deployed through a legitimate endpoint administration tool, indicating that attackers had achieved administrative access to the system through a prior compromise.\nCisco Talos researchers who\ndiscovered the attack\nattributed it with high confidence to a Russia-linked advanced persistent threat (APT).\nThe researchers compare PathWiper to\nHermeticWiper\n, previously deployed in Ukraine by the 'Sandworm' threat group, which had similar functionality.\nHence, PathWiper may be an evolution of HermeticWiper, used in attacks by the same or overlapping threat clusters.\nPathWiper's destructive capabilities\nPathWiper executes on target systems via a Windows batch file that launches a malicious VBScript (uacinstall.vbs), that in turn drops and executes the primary payload (sha256sum.exe) [\nVirusTotal\n].\nThe execution mimics the behavior and names associated with a legitimate admin tool to evade detection.\nInstead of simply enumerating physical drives like HermeticWiper, PathWiper programmatically identifies all connected drives (local, network, dismounted) on the system.\nNext, it abuses Windows APIs to dismount volumes to prepare them for corruption and then creates threads for each volume to overwrite critical NTFS structures.\nAmong the targeted system files in the root directory of the NTFS are:\nMBR\n(Master Boot Record): The first sector of a physical disk holding the bootloader and partition table.\n$MFT\n(Master File Table): Core NTFS system file that catalogs all files and directories, including their metadata and locations on the disk.\n$LogFile\n: Journal is used for NTFS transaction logging, tracking file changes, and helping with integrity checking and recovery.\n$Boot\n: File containing boot sector and filesystem layout information.\nPathWiper overwrites the above and another five critical NTFS files with random bytes, rendering impacted systems completely inoperable.\nThe observed attacks do not involve extortion or any form of financial demands, so their sole aim is destruction and operational disruption.\nCisco Talos published file hashes and snort rules to help detect the threat and stop it before it corrupts the drives.\nData wipers have become a powerful tool in attacks on Ukraine since the war began, with Russian threat actors commonly using them to disrupt critical operations in the country.\nThis includes wipers named\nDoubleZero\n,\nCaddyWiper\n,\nHermeticWiper\n,\nIsaacWiper\n,\nWhisperKill\n,\nWhisperGate\n, and\nAcidRain\n.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nUkraine claims it hacked Tupolev, Russia’s strategic warplane maker\nRussian Laundry Bear cyberspies linked to Dutch Police hack\nDozens of malicious packages on NPM collect host and network data\nRussian hackers breach orgs to track aid routes to Ukraine\nGoogle links new LostKeys data theft malware to Russian cyberspies"
    },
    {
        "Title": "Critical Fortinet flaws now exploited in Qilin ransomware attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/critical-fortinet-flaws-now-exploited-in-qilin-ransomware-attacks/",
        "Summary": "The Qilin ransomware operation has recently joined attacks exploiting two Fortinet vulnerabilities that allow bypassing authentication on vulnerable devices and executing malicious code remotely. [...]",
        "Date": "2025-06-06",
        "Content": "The Qilin ransomware operation has recently joined attacks exploiting two Fortinet vulnerabilities that allow bypassing authentication on vulnerable devices and executing malicious code remotely.\nQilin (also tracked as Phantom Mantis) surfaced in August 2022 as a Ransomware-as-a-Service (RaaS) operation under the \"Agenda\" name and has since claimed responsibility for over 310 victims on its dark web leak site.\nIts victim list also includes high-profile organizations, such as automotive giant\nYangfeng\n, publishing giant\nLee Enterprises\n,\nAustralia's Court Services Victoria\n, and\npathology services provider Synnovis\n. The Synnovis incident impacted\nseveral major NHS hospitals\nin London, which forced them to\ncancel hundreds of appointments and operations\n.\nThreat intelligence company PRODAFT, which spotted these new and partially automated Qilin ransomware attacks targeting several Fortinet flaws, also revealed that the threat actors are currently focusing on organizations from Spanish-speaking countries, but they expect the campaign to expand worldwide.\n\"Phantom Mantis recently launched a coordinated intrusion campaign targeting multiple organizations between May and June 2025. We assess with moderate confidence that initial access are being achieved by exploiting several FortiGate vulnerabilities, including CVE-2024-21762, CVE-2024-55591, and others,\"\nPRODAFT says\nin a private flash alert shared with BleepingComputer.\n\"Our observations indicate a particular interest in Spanish-speaking countries, as reflected in the data presented in the table below. However, despite this regional focus, we assess that the group continues to select its targets opportunistically, rather than following a strict geographical or sector-based targeting pattern.\"\nOne of the flaws abused in this campaign, tracked as CVE-2024-55591, was also exploited\nas a zero-day\nby other threat groups to\nbreach FortiGate firewalls\nas far back as November 2024. The Mora_001 ransomware operator has also used it to\ndeploy the SuperBlack ransomware strain\nlinked to the infamous LockBit cybercrime gang by Forescout researchers.\nThe second Fortinet vulnerability exploited in these Qilin ransomware attacks (CVE-2024-21762) was patched in February, with CISA adding it to its catalog of actively exploited security flaws and\nordering federal agencies\nto secure their FortiOS and FortiProxy devices by February 16.\nAlmost a month later, the Shadowserver Foundation announced that it had\nfound that nearly 150,000 devices\nwere still vulnerable to CVE-2024-21762 attacks.\nFortinet security vulnerabilities are often exploited (frequently as zero days) in\ncyber espionage\ncampaigns and for breaching corporate networks in\nransomware attacks\n.\nFor instance, in February, Fortinet\ndisclosed\nthat the\nChinese Volt Typhoon hacking group\nused two FortiOS SSL VPN flaws (CVE-2022-42475 and CVE-2023-27997) to deploy the Coathanger custom remote access trojan (RAT) malware, which had been previously used to backdoor a\nDutch Ministry of Defence\nmilitary network.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nUnpatched critical bugs in Versa Concerto lead to auth bypass, RCE\nIvanti fixes EPMM zero-days chained in code execution attacks\nFortinet fixes critical zero-day exploited in FortiVoice attacks\nApple 'AirBorne' flaws can lead to zero-click AirPlay RCE attacks\nOver 1,200 SAP NetWeaver servers vulnerable to actively exploited flaw"
    },
    {
        "Title": "Police arrests 20 suspects for distributing child sexual abuse content",
        "Link": "https://www.bleepingcomputer.com/news/security/police-arrests-20-suspects-for-distributing-child-sexual-abuse-content/",
        "Summary": "Law enforcement authorities from over a dozen countries have arrested 20 suspects in an international operation targeting the production and distribution of child sexual abuse material. [...]",
        "Date": "2025-06-06",
        "Content": "Law enforcement authorities from over a dozen countries have arrested 20 suspects in an international operation targeting the production and distribution of child sexual abuse material.\nStarting in late 2024, the Spanish National Police discovered multiple instant messaging groups dedicated to the circulation of child sexual exploitation images and alerted authorities in other countries through INTERPOL and Europol after identifying 88 suspects in the Americas, Europe, Asia, and Oceania.\n\"In December 2024, INTERPOL invited Spanish investigators to Chile to attend the Latin America Victim Identification Task Force meeting,\" the international police organization\nsaid\n.\n\"There, they presented Operation Vibora to specialized officers from across Latin America, allowing them to exchange on cases, provide concrete leads and launch coordinated actions.\"\nSpanish authorities\narrested\nseven suspects in Barcelona, Valladolid, Sevilla, Murcia, and Jaén, including a teacher charged with sharing child sexual abuse material online and a healthcare worker accused of paying minors from Eastern Europe for CSAM content. The operation also resulted in the seizure of computers, mobile phones, and other devices.\nIn Latin America, INTERPOL assisted in the arrest of ten more suspects across seven countries, including three in El Salvador and a teacher in Panama, with additional arrests made in Europe and the United States.\nPrevious operations targeting CSAM platforms\nEarlier this year, another joint international investigation led by the State Criminal Police of Bavaria and Bavarian cybercrime prosecutors\ntook down Kidflix\n, one of the largest child sexual abuse material (CSAM) platforms on the dark web.\nDubbed Operation Stream, the action led to 79 arrests, 1,393 suspects identified, and more than 3,000 electronic devices seized between March 10 and March 23, 2025\nIn February, law enforcement agencies from 19 countries\nalso arrested 25 suspects\nlinked to a large criminal ring distributing AI-generated CSAM, identifying 273 suspected criminal network members and seizing 173 devices.\nThousands of pedophiles who shared and downloaded CSAM were also\nidentified last year by Recorded Future's Insikt Group\nusing information-stealing malware logs leaked on the dark web.\nInsikt Group provided this information to law enforcement to identify and apprehend these individuals.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nPolice seize over 100 malware loader servers, arrest four cybercriminals\nPolice arrests 270 dark web vendors, buyers in global crackdown\nSix arrested for AI-powered investment scams that stole $20 million\nPolice arrest Conti and LockBit ransomware crypter specialist\nMoldova arrests suspect linked to DoppelPaymer ransomware attacks"
    },
    {
        "Title": "Cutting-Edge ClickFix Tactics Snowball, Pushing Phishing Forward",
        "Link": "https://www.darkreading.com/remote-workforce/cutting-edge-clickfix-snowball-phishing",
        "Summary": "Several widespread ClickFix campaigns are underway, bent on delivering malware to business targets, and they represent a new level of phishing sophistication that defenders need to be prepared for, researchers warn.",
        "Date": "2025-06-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/cutting-edge-clickfix-snowball-phishing"
    },
    {
        "Title": "F5 Acquires Agentic AI Security Startup Fletch",
        "Link": "https://www.darkreading.com/application-security/f5-acquires-agentic-ai-security-startup-fletch",
        "Summary": "Agentic AI technology will be integrated into the recently launched F5 Application Delivery and Security Platform.",
        "Date": "2025-06-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/f5-acquires-agentic-ai-security-startup-fletch"
    },
    {
        "Title": "BADBOX 2.0 Targets Home Networks in Botnet Campaign, FBI Warns",
        "Link": "https://www.darkreading.com/threat-intelligence/badbox-home-networks-botnet-campaign-fbi",
        "Summary": "Though the operation was partially disrupted earlier this year, the botnet remains active and continues to target connected Android devices.",
        "Date": "2025-06-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/badbox-home-networks-botnet-campaign-fbi"
    },
    {
        "Title": "Docuseries Explores Mental, Physical Hardships of CISOs",
        "Link": "https://www.darkreading.com/cybersecurity-careers/docuseries-explores-mental-physical-hardships-ciso",
        "Summary": "During &quot;CISO: The Worst Job I Ever Wanted,&quot; several chief information security officers reveal how difficult it is to be in a role that, despite being around for decades, remains undefined.",
        "Date": "2025-06-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-careers/docuseries-explores-mental-physical-hardships-ciso"
    },
    {
        "Title": "Synthetic Data Is Here to Stay, but How Secure Is It?",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/synthetic-data-security",
        "Summary": "Synthetic data offers organizations a way to develop AI while maintaining privacy compliance but requires careful management to prevent re-identification risks and ensure model accuracy.",
        "Date": "2025-06-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/synthetic-data-security"
    },
    {
        "Title": "MSFT-CrowdStrike 'Rosetta Stone' for Naming APTs: Meh?",
        "Link": "https://www.darkreading.com/threat-intelligence/microsoft-crowdstrike-rosetta-stone-apt",
        "Summary": "Microsoft and CrowdStrike announced an effort to deconflict the overlapping names of threat groups and reduce confusion for companies, but we've been here before.",
        "Date": "2025-06-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/microsoft-crowdstrike-rosetta-stone-apt"
    },
    {
        "Title": "Prep for Layoffs Before They Compromise Security",
        "Link": "https://www.darkreading.com/cybersecurity-operations/prep-layoffs-before-compromise-security",
        "Summary": "Mass layoffs create cybersecurity vulnerabilities through dormant accounts and disgruntled employees.",
        "Date": "2025-06-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/prep-layoffs-before-compromise-security"
    },
    {
        "Title": "In Other News: FBI Warns of BadBox 2, NSO Disputes WhatsApp Fine, 1,000 Leave CISA",
        "Link": "https://www.securityweek.com/in-other-news-fbi-warns-of-badbox-2-nso-disputes-whatsapp-fine-1000-leave-cisa/",
        "Summary": "<p>Noteworthy stories that might have slipped under the radar: FBI issues an alert on BadBox 2 botnet, NSO disputing the $168 million WhatsApp fine, 1,000 people left CISA since Trump took office.</p>\n<p>The post <a href=\"https://www.securityweek.com/in-other-news-fbi-warns-of-badbox-2-nso-disputes-whatsapp-fine-1000-leave-cisa/\">In Other News: FBI Warns of BadBox 2, NSO Disputes WhatsApp Fine, 1,000 Leave CISA</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/in-other-news-fbi-warns-of-badbox-2-nso-disputes-whatsapp-fine-1000-leave-cisa/"
    },
    {
        "Title": "Cybersecurity M&A Roundup: 42 Deals Announced in May 2025",
        "Link": "https://www.securityweek.com/cybersecurity-ma-roundup-42-deals-announced-in-may-2025/",
        "Summary": "<p>The number of cybersecurity-related merger and acquisition (M&#038;A) announcements surged in May 2025.</p>\n<p>The post <a href=\"https://www.securityweek.com/cybersecurity-ma-roundup-42-deals-announced-in-may-2025/\">Cybersecurity M&#038;A Roundup: 42 Deals Announced in May 2025</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cybersecurity-ma-roundup-42-deals-announced-in-may-2025/"
    },
    {
        "Title": "MIND Raises $30 Million for Data Loss Prevention",
        "Link": "https://www.securityweek.com/mind-raises-30-million-for-data-loss-prevention-platform/",
        "Summary": "<p>Data security firm MIND has raised $30 million in Series A funding to expand its R&#038;D and go-to-market teams.</p>\n<p>The post <a href=\"https://www.securityweek.com/mind-raises-30-million-for-data-loss-prevention-platform/\">MIND Raises $30 Million for Data Loss Prevention</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/mind-raises-30-million-for-data-loss-prevention-platform/"
    },
    {
        "Title": "Destructive ‘PathWiper’ Targeting Ukraine’s Critical Infrastructure",
        "Link": "https://www.securityweek.com/destructive-pathwiper-targeting-ukraines-critical-infrastructure/",
        "Summary": "<p>A Russia-linked threat actor has used the destructive malware dubbed PathWiper against a critical infrastructure organization in Ukraine.</p>\n<p>The post <a href=\"https://www.securityweek.com/destructive-pathwiper-targeting-ukraines-critical-infrastructure/\">Destructive &#8216;PathWiper&#8217; Targeting Ukraine&#8217;s Critical Infrastructure</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/destructive-pathwiper-targeting-ukraines-critical-infrastructure/"
    },
    {
        "Title": "Cisco Patches Critical ISE Vulnerability With Public PoC",
        "Link": "https://www.securityweek.com/cisco-patches-critical-ise-vulnerability-with-public-poc/",
        "Summary": "<p>Cisco has released patches for a critical vulnerability impacting cloud deployments of Identity Services Engine (ISE).</p>\n<p>The post <a href=\"https://www.securityweek.com/cisco-patches-critical-ise-vulnerability-with-public-poc/\">Cisco Patches Critical ISE Vulnerability With Public PoC</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cisco-patches-critical-ise-vulnerability-with-public-poc/"
    },
    {
        "Title": "HPE Patches Critical Vulnerability in StoreOnce",
        "Link": "https://www.securityweek.com/hpe-patches-critical-vulnerability-in-storeonce/",
        "Summary": "<p>An HPE StoreOnce vulnerability allows attackers to bypass authentication, potentially leading to remote code execution.</p>\n<p>The post <a href=\"https://www.securityweek.com/hpe-patches-critical-vulnerability-in-storeonce/\">HPE Patches Critical Vulnerability in StoreOnce</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/hpe-patches-critical-vulnerability-in-storeonce/"
    },
    {
        "Title": "US Offering $10 Million Reward for RedLine Malware Developer",
        "Link": "https://www.securityweek.com/us-offering-10-million-reward-for-redline-malware-developer/",
        "Summary": "<p>A reward is being offered for Maxim Alexandrovich Rudometov, who is accused of developing and managing the RedLine malware.</p>\n<p>The post <a href=\"https://www.securityweek.com/us-offering-10-million-reward-for-redline-malware-developer/\">US Offering $10 Million Reward for RedLine Malware Developer</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/us-offering-10-million-reward-for-redline-malware-developer/"
    },
    {
        "Title": "Qilin Ransomware Allegedly Targets 11 International Organizations",
        "Link": "https://dailydarkweb.net/qilin-ransomware-allegedly-targets-11-international-organizations/",
        "Summary": "The ransomware group known as Qilin has allegedly updated its dark web leak site, claiming responsibility for attacks on 11 new victims spanning various sectors, including healthcare, government, technology, and manufacturing. The group has published the allegedly stolen data for each entity. The diverse list of targets underscores the opportunistic and far-reaching nature of modern [&#8230;]",
        "Date": "2025-06-06",
        "Content": "The ransomware group known as Qilin has allegedly updated its dark web leak site, claiming responsibility for attacks on 11 new victims spanning various sectors, including healthcare, government, technology, and manufacturing. The group has published the allegedly stolen data for each entity. The diverse list of targets underscores the opportunistic and far-reaching nature of modern ransomware-as-a-service (RaaS) operations, which impact organizations globally.\nAmong the more prominent victims is The Health Trust, a vital non-profit operating foundation serving Silicon Valley since 1996 by providing health-related grants and services. The attackers claim to have exfiltrated sensitive information that could severely impact the organization and its partners. Another significant target is the City of Belvedere, a small but affluent municipality in Marin County, California. An attack on a government body is particularly alarming, as the compromised data often contains confidential citizen and administrative information. Also listed is AccuVein, a global leader in medical vein imaging technology used in over 4,000 healthcare institutions worldwide.\nThe perpetrators have listed samples of the allegedly stolen data to validate their claims and pressure the victims into paying a ransom. For The Health Trust, the leak allegedly includes community support agreements and employee pay stubs. In the case of the City of Belvedere, the breach allegedly exposed police bulletins containing personal details and confidential legal correspondence. Data from AccuVein allegedly includes financial documents, patents, and bank statements. Other listed victims include technology integrators, commercial finance firms, and automotive suppliers from North America and Europe.\nAllegedly Leaked Data Includes:\n🇺🇸\nThe Health Trust:\nCommunity support agreements, itemized payment receipts, employee pay stubs, and FY 2025 budget summaries.\n🇺🇸\nCity of Belvedere:\nPolice bulletins with suspect information, confidential legal correspondence, and financial reconciliation reports.\n🇺🇸\nAccuVein Inc.:\nCompany balance sheets, U.S. patent filings, bank statements, and service agreements.\n🇺🇸\nBruckner’s Truck & Equipment:\nVehicle transfer agreements, employee health insurance forms, and court-issued notices.\n🇭🇰\nAppoTech:\nDetails not specified.\n🇺🇸\nBritten Inc.:\nCity permits, equipment rental contracts, and certificates of liability insurance.\n🇺🇸\nMicroman:\nConsolidated income statements, bank statements, and aged trial balances.\n🇺🇸\nRegents Capital:\nClient bank statements, share repurchase agreements, and solar power purchase agreements.\n🇺🇸\nReGenerating Solutions:\nA U.S. passport, business correspondence, and personal financial statements.\n🇮🇪\nFrylite:\nInvoices, currency account revaluations, passports, and profit and loss statements.\n🇨🇭\nGolf & Country Club Schönenberg:\nSigned contracts, safety audit plans, and cooperation agreements.\nTags:\nAccuVein\nCity of Belvedere\ncyberattack\nCyberSecurity\ndata-breach\nQilin\nransomware\nThe Health Trust"
    },
    {
        "Title": "STC Kuwait Allegedly Breached, Sensitive Employee Data For Sale Online",
        "Link": "https://dailydarkweb.net/stc-kuwait-allegedly-breached-sensitive-employee-data-for-sale-online/",
        "Summary": "STC Kuwait, a major telecommunications provider in the country, has allegedly suffered a significant data breach. A threat actor has posted on a dark web forum claiming to be in possession of sensitive personal information belonging to over 300 employees of the company. STC Kuwait, a subsidiary of the stc Group, is a key player [&#8230;]",
        "Date": "2025-06-06",
        "Content": "STC Kuwait, a major telecommunications provider in the country, has allegedly suffered a significant data breach. A threat actor has posted on a dark web forum claiming to be in possession of sensitive personal information belonging to over 300 employees of the company. STC Kuwait, a subsidiary of the stc Group, is a key player in the nation’s digital infrastructure, providing mobile, internet, and integrated ICT solutions to a wide range of customers since its establishment in 2008.\nThe seller on the forum claims the stolen database is particularly useful for “Know Your Customer” (KYC) verification processes, suggesting the data could be exploited for identity theft and other fraudulent activities. To substantiate their claims, the individual posted several samples of the compromised information, including screenshots of internal documents and a partial list of the affected employees. The leak allegedly exposes highly sensitive and personal employee records.\nThe compromised data allegedly includes the following:\nEmployee Civil ID numbers and pictures\nFull names\nEmployee phone numbers\nJob titles\nTags:\nCyberSecurity\ndata-breach\ndata-leak\nKuwait\nSTC\nSTC Kuwait\ntelecommunications"
    },
    {
        "Title": "MoSeeker Allegedly Hit by Massive Data Breach, 40 Million Records for Sale Online",
        "Link": "https://dailydarkweb.net/moseeker-allegedly-hit-by-massive-data-breach-40-million-records-for-sale-online/",
        "Summary": "The Chinese AI-powered recruiting platform, MoSeeker, has allegedly been compromised, with a threat actor claiming to sell a full database dump containing 40 million records for $1200. The sale was announced on a dark web forum, putting the sensitive information of millions of job seekers and companies at risk. MoSeeker, based in Shanghai, is a [&#8230;]",
        "Date": "2025-06-06",
        "Content": "The Chinese AI-powered recruiting platform, MoSeeker, has allegedly been compromised, with a threat actor claiming to sell a full database dump containing 40 million records for $1200. The sale was announced on a dark web forum, putting the sensitive information of millions of job seekers and companies at risk. MoSeeker, based in Shanghai, is a significant player in the recruitment technology sector, providing tools for talent acquisition teams to identify, attract, and engage with potential candidates since its launch in 2014.\nThe threat actor advertised the sale of both user and company information. The compromised data allegedly includes a vast amount of personally identifiable information (PII) and corporate details. While the authenticity of the data is yet to be confirmed, the detailed nature of the listed data fields suggests a significant and damaging breach if verified. The following data categories were listed for sale:\nUser Information:\nID, country code, username, password, mobile number, email, registration and last login IPs, login history, full name, WeChat ID, company, and position.\nCompany Information:\nID, company ID, email, mobile number, nickname, and user ID.\nTags:\nAI\nChina\ndark web\nMoSeeker\nrecruiting"
    },
    {
        "Title": "South Korean Mobile Coupon Giant Zlgoon Allegedly Breached; 1.1 Million Customer Records for Sale Online",
        "Link": "https://dailydarkweb.net/south-korean-mobile-coupon-giant-zlgoon-allegedly-breached-1-1-million-customer-records-for-sale-online/",
        "Summary": "Zlgoon Inc., a prominent Online-to-Offline (O2O) company in South Korea, has allegedly suffered a significant data breach. The company, known as a leading provider of mobile coupons for the popular messaging app KakaoTalk, is at the center of a security incident after a threat actor advertised a database containing the records of 1.1 million customers [&#8230;]",
        "Date": "2025-06-06",
        "Content": "Zlgoon Inc., a prominent Online-to-Offline (O2O) company in South Korea, has allegedly suffered a significant data breach. The company, known as a leading provider of mobile coupons for the popular messaging app KakaoTalk, is at the center of a security incident after a threat actor advertised a database containing the records of 1.1 million customers for sale on a hacking forum. Zlgoon plays a crucial role in the digital commerce ecosystem, processing customer, store, and brand information for its integrated mobile coupon platform used across various channels.\nThe threat actor claims the database was “dumped this week” and is being offered as an exclusive sale for $1500. The compromised information allegedly contains a wide range of personally identifiable information (PII) that could expose users to various online threats, including identity theft and phishing attacks. The seller provided a sample of the data to prove the authenticity of the leak.\nThe leaked data allegedly includes the following:\nMember ID\nPhone numbers\nOperating system code\nRegistration path\nSocial media ID\nNickname\nEmail addresses\nBirthdate\nGender\nPasswords\nProfile photo URL\nGreeting message\nJoin date\nTags:\ndata-leak\nPII\nSouth Korea\nZlgoon"
    }
]