[
    {
        "Title": "U.S. Seizes $7.74M in Crypto Tied to North Korea’s Global Fake IT Worker Network",
        "Link": "https://thehackernews.com/2025/06/us-seizes-774m-in-crypto-tied-to-north.html",
        "Summary": "The U.S. Department of Justice (DoJ) said it has filed a civil forfeiture complaint in federal court that targets over $7.74 million in cryptocurrency, non-fungible tokens (NFTs), and other digital assets allegedly linked to a global IT worker scheme orchestrated by North Korea.\n\"For years, North Korea has exploited global remote IT contracting and cryptocurrency ecosystems to evade U.S.",
        "Date": "2025-06-16",
        "Content": "The U.S. Department of Justice (DoJ) said it has filed a civil forfeiture complaint in federal court that targets over $7.74 million in cryptocurrency, non-fungible tokens (NFTs), and other digital assets allegedly linked to a\nglobal IT worker scheme\norchestrated by North Korea.\n\"For years, North Korea has exploited global remote IT contracting and cryptocurrency ecosystems to evade U.S. sanctions and bankroll its weapons programs,\"\nsaid\nSue J. Bai, Head of the Justice Department's National Security Division.\nThe Justice Department said the funds were\noriginally restrained\nin connection with an April 2023 indictment against Sim Hyon-Sop, a North Korean Foreign Trade Bank (FTB) representative who is believed to have conspired with the IT workers.\nThe IT workers, the department added, gained employment at U.S. cryptocurrency companies using fake identities and then laundered their ill-gotten gains through Sim to further Pyongyang's strategic objectives in violation of the sanctions imposed by the U.S. Treasury's Office of Foreign Assets Control (OFAC) and the United Nations.\nThe fraudulent scheme has\nevolved\ninto a\nmassive operation\nsince its origins way back in 2017. The illegal employment operation leverages a combination of stolen and fictitious identities, aided with the help of artificial intelligence (AI) tools like\nOpenAI ChatGPT\n, to bypass due diligence checks and secure freelance jobs.\nTracked under the monikers Wagmole and UNC5267, the activity is assessed to be affiliated with the Workers' Party of Korea and is viewed as a methodically engineered strategy to embed IT workers inside legitimate companies to draw a steady source of revenue for North Korea.\nBesides misrepresenting identities and locations, a core aspect of the operation involves recruiting facilitators to run laptop farms across the world, enable video interview stages, as well as launder the proceeds back through various accounts.\nOne such laptop farm facilitator was\nChristina Marie Chapman\n, who pleaded guilty earlier this February for her involvement in the illicit revenue regeneration scheme. In a report published last month, The Wall Street Journal\nrevealed\nhow a LinkedIn message in March 2020 drew Chapman, a former waitress and massage therapist with over 100,000 followers on TikTok, into the intricate scam. She is scheduled to be sentenced on July 16.\n\"After laundering these funds, the North Korean IT workers allegedly sent them back to the North Korean government, at times via Sim and Kim Sang Man,\" the DoJ said. \"Kim is a North Korean national who is the chief executive officer of 'Chinyong,' also known as 'Jinyong IT Cooperation Company.'\"\nAn analysis of Sim's cryptocurrency wallet by TRM Labs has revealed that it has received more than $24 million in cryptocurrency from August 2021 to March 2023.\nNorth Korea Organizational assessment\n\"Most of these funds were traced back to Kim's accounts, which were opened using forged Russian identity documents and accessed from Korean-language devices operating from the U.A.E. and Russia,\" TRM Labs\nsaid\n. \"Sim, a North Korean official, operated out of Dubai and maintained a self-hosted wallet that received laundered funds from dozens of sources.\"\nKim, from his base in Vladivostok, Russia, acted as an intermediary between the IT workers and FTB, using two accounts to collect funds from them and re-distribute the proceeds to Sim and to other wallets connected to North Korea.\nCybersecurity company DTEX has\ncharacterized\nthe IT worker threat as a state-sponsored crime syndicate that's mainly geared towards sanctions evasion and generating profits, with the threat actors gradually shifting from laptop farms to using their own machines as part of companies' Bring Your Own Device (BYOD) policies.\n\"Opportunity is really their only tactic and everything is treated as a tool of some sort,\" Michael Barnhart, DTEX Principal i3 Insider Risk Investigator at DTEX Systems, told The Hacker News.\n\"If the focus is on laptop farms, which has been very good in getting that word out there, then naturally this opportunistic nation wants to gravitate to where the path is much easier if it is impacting operations. Until laptop farms are no longer effective at all, then that will still be an option, but abuse of BYOD was something that DTEX had seen in investigations and wasn't publicized as much as the farms were.\"\nDTEX further pointed out that these IT workers could fall under either of the two categories: Revenue IT workers (R-ITW) or malicious IT workers (M-ITW), each of which has their own function within North Korea's cyber structure.\nWhile R-ITW personnel are said to be less privileged and primarily motivated to make money for the regime, M-ITW actors go beyond revenue generation by extorting a victim client, sabotaging a cryptocurrency server, stealing valuable intellectual property, or executing malicious code in an environment.\nChinyong, per the insider risk management firm, is one of the many IT companies that has deployed its workers in a combination of freelance IT work and cryptocurrency theft by leveraging their insider access to blockchain projects. It operates out of China, Laos, and Russia.\nTwo individuals associated with Chinyong-related IT worker efforts have been unmasked as having used the personas Naoki Murano and Jenson Collins to raise funds for North Korea, with Murano previously linked to a\n$6 million heist\nat crypto firm DeltaPrime in September 2024.\n\"Ultimately, the detection of DPRK-linked laptop farms and remote worker schemes requires defenders to look beyond traditional indicators of compromise and start asking different questions – about infrastructure, behavior, and access,\" security researcher Matt Ryan\nsaid\n. \"These campaigns aren't just about malware or phishing; they're about deception at scale, often executed in ways that blend seamlessly with legitimate remote work.\"\nFurther investigation into the sprawling multi-million dollar fraud has uncovered several accounts tied to fake domains set up for the various front companies used to provide fake references to the IT workers. These accounts were infected with information-stealing malware, Flashpoint\nnoted\n, enabling it to flag some aspects of their tradecraft.\nThe company said it identified a compromised host located in Lahore, Pakistan, that contained a saved credential for an email account that was used as a point of contact when registering the domains associated with Baby Box Info, Helix US, and Cubix Tech US.\nOn top of that, browser history captured by the stealer malware in another instance has captured Google Translate URLs related to dozens of translations between English and Korean, including those related to providing falsified job references and shipping electronic devices.\nThat's not all. Recent research has also laid bare a \"covert, multi-layered remote-control system\" used by North Korean IT workers to establish persistent access to company-issued laptops in a laptop farm while being physically located in Asia.\n\"The operation leveraged a combination of low-level protocol signaling and legitimate collaboration tools to maintain remote access and enable data visibility and control using Zoom,\" Sygnia\nsaid\nin a report published in April 2025. \"The attack chain [...] involved the abuse of ARP packets to trigger event-based actions, a custom WebSocket-based command-and-control (C2) channel, and automation of Zoom's remote-control features.\"\n\"To further enhance stealth and automation, specific Zoom client configurations were required. Settings were meticulously adjusted to prevent user-facing indicators and audio-visual disturbances. Users were persistently signed in, video and audio were automatically muted upon joining, participant names were hidden, screen sharing initiated without visible indicators, and preview windows disabled.\"\nRunning complementary to Wagemole is another campaign referred to as\nContagious Interview\n(aka DeceptiveDevelopment, Famous Chollima, Gwisin Gang, Tenacious Pungsan, UNC5342, and Void Dokkaebi) which primarily conducts\nmalicious activity\ntargeting developers to gain unauthorized company access as opposed to gaining employment.\n\"Gwisin Gang frankly are IT workers that instead of taking the long process of applying for a job, they target someone who already had the job,\" Barnhart said. \"They do appear elevated and unique in that they have malware usage that echoes this notion as well. IT workers is an overarching term though and there are many styles, varieties, and skill levels amongst them.\"\nAs for how the IT worker scheme could evolve in the coming years, Barnhart points to the traditional financial sector as the target.\n\"With the implementation of blockchain and Web3 technologies into traditional financial institutions, I think all the DPRK cyber assets in that space are going to be aiming to have a run on these companies the way it was happening in years past,\" Barnhart pointed out. \"The more we integrate with those technologies, the more careful we have to be as DPRK is very entrenched.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Anubis Ransomware Encrypts and Wipes Files, Making Recovery Impossible Even After Payment",
        "Link": "https://thehackernews.com/2025/06/anubis-ransomware-encrypts-and-wipes.html",
        "Summary": "An emerging ransomware strain has been discovered incorporating capabilities to encrypt files as well as permanently erase them, a development that has been described as a \"rare dual-threat.\"\n\"The ransomware features a 'wipe mode,' which permanently erases files, rendering recovery impossible even if the ransom is paid,\" Trend Micro researchers Maristel Policarpio, Sarah Pearl Camiling, and",
        "Date": "2025-06-16",
        "Content": "An emerging ransomware strain has been discovered incorporating capabilities to encrypt files as well as permanently erase them, a development that has been described as a \"rare dual-threat.\"\n\"The ransomware features a 'wipe mode,' which permanently erases files, rendering recovery impossible even if the ransom is paid,\" Trend Micro researchers Maristel Policarpio, Sarah Pearl Camiling, and Sophia Nilette Robles\nsaid\nin a report published last week.\nThe ransomware-as-a-service (RaaS) operation in question is named Anubis, which\nbecame active\nin December 2024, claiming victims across\nhealthcare, hospitality, and construction sectors\nin Australia, Canada, Peru, and the U.S. Analysis of early, trial samples of the ransomware suggests that the developers initially named it Sphinx, before tweaking the brand name in the final version.\nIt's worth noting that the e-crime crew has no ties to an\nAndroid banking trojan\nand a\nPython-based backdoor\nof the same name, the latter of which is attributed to the financially-motivated FIN7 (aka GrayAlpha) group.\n\"Anubis runs a flexible affiliate program, offering negotiable revenue splits and supporting additional monetization paths like data extortion and access sales,\" the cybersecurity company said.\nThe affiliate program follows an 80-20 split, allowing affiliate actors to take 80% of the ransom paid. On the other hand, data extortion and access monetization schemes offer a 60-40 and 50-50 split, respectively.\nAttack chains mounted by Anubis involve the use of phishing emails as the initial access vector, with the threat actors leveraging the foothold to escalate privileges, conduct reconnaissance, and take steps to delete volume shadow copies, before encrypting files and, if necessary, wipe their contents.\nThis means that the file sizes are reduced to 0 KB while leaving the file names or their extensions untouched, making recovery impossible and, therefore, exerting more pressure on victims to pay up.\n\"The ransomware includes a wiper feature using /WIPEMODE parameter, which can permanently delete the contents of a file, preventing any recovery attempt,\" the researchers said.\n\"Its ability to both encrypt and permanently destroy data significantly raises the stakes for victims, amplifying the pressure to comply -- just as strong ransomware operations aim to do.\"\nThe discovery of Anubis' destructive behavior comes as Recorded Future detailed new infrastructure associated with the FIN7 group that's being used to impersonate legitimate software products and services as part of a campaign designed to\ndeliver NetSupport RAT\n.\nThe Mastercard-owned threat intelligence firm said it identified three unique distribution vectors over the past year that have employed bogus browser update pages, fake 7-Zip download sites, and\nTAG-124\n(aka 404 TDS, Chaya_002, Kongtuke, and LandUpdate808) to deliver the malware.\nWhile the fake browser update method loads a custom loader dubbed MaskBat to execute the remote access trojan, the remaining two infection vectors employ another custom PowerShell loader dubbed PowerNet that decompresses and executes it.\n\"[MaskBat] has similarities to\nFakeBat\nbut is obfuscated and contains strings linked to GrayAlpha,\" Recorded Future's Insikt Group\nsaid\n. \"Although all three infection vectors were observed being used simultaneously, only the fake 7-Zip download pages were still active at the time of writing, with newly registered domains appearing as recently as April 2025.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "⚡ Weekly Recap: iPhone Spyware, Microsoft 0-Day, TokenBreak Hack, AI Data Leaks and More",
        "Link": "https://thehackernews.com/2025/06/weekly-recap-iphone-spyware-microsoft-0.html",
        "Summary": "Some of the biggest security problems start quietly. No alerts. No warnings. Just small actions that seem normal but aren't. Attackers now know how to stay hidden by blending in, and that makes it hard to tell when something’s wrong.\nThis week’s stories aren’t just about what was attacked—but how easily it happened. If we’re only looking for the obvious signs, what are we missing right in front",
        "Date": "2025-06-16",
        "Content": "Some of the biggest security problems start quietly. No alerts. No warnings. Just small actions that seem normal but aren't. Attackers now know how to stay hidden by blending in, and that makes it hard to tell when something's wrong.\nThis week's stories aren't just about what was attacked—but how easily it happened. If we're only looking for the obvious signs, what are we missing right in front of us?\nHere's a look at the tactics and mistakes that show how much can go unnoticed.\n⚡ Threat of the Week\nApple Zero-Click Flaw in Messages Exploited to Deliver Paragon Spyware\n— Apple disclosed that a security flaw in its Messages app was actively exploited in the wild to target civil society members in sophisticated cyber attacks. The vulnerability, CVE-2025-43200, was addressed by the company in February as part of iOS 18.3.1, iPadOS 18.3.1, iPadOS 17.7.5, macOS Sequoia 15.3.1, macOS Sonoma 14.7.4, macOS Ventura 13.7.4, watchOS 11.3.1, and visionOS 2.3.1. The Citizen Lab said it uncovered forensic evidence that the flaw was weaponized to target Italian journalist Ciro Pellegrino and an unnamed prominent European journalist and infect them with Paragon's Graphite mercenary spyware.\nData Security ROI: Key Metrics That Matter Most\nSensitive data moves fast in the cloud. If you can't see it, you can't protect it. This guide shows how top teams use DSPM to reduce risk, improve compliance, and boost efficiency—backed by real metrics that drive measurable impact.\nDownload Now ➝\n🔔 Top News\nMicrosoft Fixes WebDAV 0-Day Exploited in Targeted Attacks\n— Microsoft addressed a zero-day bug in Web Distributed Authoring and Versioning (WebDAV) that was exploited by a threat actor known as Stealth Falcon (aka FruityArmor) as part of highly targeted attacks to deliver Horus Agent, a custom implant built for the Mythic command-and-control (C2) framework. Horus Agent is believed to be an evolution of the customized Apollo implant, an open-source .NET agent for Mythic framework, that was previously put to use by Stealth Falcon between 2022 and 2023. \"The new Horus Agent appears to be written from scratch,\" according to Check Point. \"In addition to adding custom commands, the threat actors placed additional emphasis on the agent's and its loader's anti-analysis protections and counter-defensive measures. This suggests that they have deep knowledge of both their victims and/or the security solutions in use.\"\nTokenBreak Attack Bypasses AI Moderation With a Single Character Change\n— Cybersecurity researchers disclosed an attack technique called TokenBreak that can be used to bypass a large language model's (LLM) safety and content moderation guardrails with just a single character change. \"The TokenBreak attack targets a text classification model's tokenization strategy to induce false negatives, leaving end targets vulnerable to attacks that the implemented protection model was put in place to prevent,\" HiddenLayer said.\nGoogle Addresses Flaw Leaking Phone Numbers Linked to Accounts\n— Google has fixed a security flaw that could have made it possible to brute-force an account's recovery phone number by taking advantage of a legacy username recovery form and combining it with an exposure path Looker Studio that serves as an unintended oracle by leaking a user's full name. Google has since deprecated the username recovery form.\nRare Werewolf and DarkGaboon Leverage Readymade Tooling to Target Russia\n— Two threat actors tracked as Rare Werewolf and DarkGaboon have been observed employing legitimate tools, living-off-the-land (LotL) tactics, and off-the-shelf malware to target Russian entities. While adversaries are known to adopt such tactics, the complete abstinence of bespoke malware speaks to the effectiveness of the approach in helping them evade detection triggers and endpoint detection systems. Because these techniques are also commonly used by administrators, distinguishing between malicious and benign activity becomes significantly more challenging for defenders.\nZero-Click AI Flaw Allows Data Exfiltration Without User Interaction\n— The first known zero-click artificial intelligence vulnerability in Microsoft 365 could have allowed attackers to exfiltrate sensitive internal data without any user interaction. The flaw, dubbed EchoLeak, involved what's described as an LLM Scope Violation, referring to scenarios where a large language model (LLM) can be manipulated into leaking information beyond its intended context. In this case, an attacker can craft a malicious email containing specific markdown syntax that could slip past Microsoft's Cross-Prompt Injection Attack (XPIA) defenses, causing the AI assistant to process the malicious payload and exfiltrate data using Microsoft's own trusted domains, including SharePoint and Teams, which are allowlisted under Copilot's content security policies. These domains can be used to embed external links or images that, when rendered by Copilot, automatically issue outbound requests to redirect stolen data to an attacker-controlled server. The most important aspect of this attack is that it all happens behind the scenes and users don't even have to open the email message or click on any link. All it requires is for a victim to ask Microsoft 365 Copilot a business-related question that triggers the whole attack chain automatically. Microsoft, which is tracking the issue as CVE-2025-32711, has resolved it and emphasized it found no evidence of the vulnerability being exploited in the wild.\nVexTrio Runs a Massive Affiliate Program to Propagate Malware, Scams\n— The threat actors behind the VexTrio Viper Traffic Distribution Service (TDS) have been linked to a far-reaching campaign that hijacks WordPress sites to funnel victims into malware and scam networks. The malicious operation is designed to monetize compromised infrastructure, transforming legitimate websites into unwitting participants in a massive criminal advertising ecosystem. The scale of VexTrio's activities came to light in November 2024 when Qurium revealed that Los Pollos, a Swiss-Czech adtech company, was part of the illicit TDS scheme. A new analysis from Infoblox has found that Los Pollos is one of the many companies controlled by VexTrio, including Taco Loco and Adtrafico, each overseeing different functions within the commercial affiliate network. These companies are in charge of recruiting publishing affiliates, who compromise websites with JavaScript injects, and advertising affiliates, who are the operators behind scams, malware, and other forms of fraud, turning VexTrio into an Uber-like intermediary for a criminal model that has generated substantial profits for the enterprise. Furthermore, when Los Pollos announced the cessation of their push monetization services in November 2024, many of these malware operations simultaneously migrated to TDSs called Help TDS and Disposable TDS, which are one and the same, and enjoyed an \"exclusive relationship with VexTrio\" until around the same time.\n‎️‍🔥 Trending CVEs\nAttackers love software vulnerabilities – they're easy doors into your systems. Every week brings fresh flaws, and waiting too long to patch can turn a minor oversight into a major breach. Below are this week's critical vulnerabilities you need to know about. Take a look, update your software promptly, and keep attackers locked out.\nThis week's list includes —\nCVE-2025-43200\n(Apple),\nCVE-2025-32711\n(Microsoft 365 Copilot),\nCVE-2025-33053\n(Microsoft Windows),\nCVE-2025-47110\n(Adobe Commerce and Magento Open Source),\nCVE-2025-43697, CVE-2025-43698, CVE-2025-43699, CVE-2025-43700, CVE-2025-43701\n(Salesforce),\nCVE-2025-24016\n(Wazuh),\nCVE-2025-5484, CVE-2025-5485\n(SinoTrack),\nCVE-2025-31022\n(PayU CommercePro plugin),\nCVE-2025-3835\n(ManageEngine Exchange Reporter Plus),\nCVE-2025-42989\n(SAP NetWeaver),\nCVE-2025-5353\n,\nCVE-2025-22463\n,\nCVE-2025-22455\n(Ivanti Workspace Control),\nCVE-2025-5958\n(Google Chrome),\nCVE-2025-3052\n(DT Research DTBios and BiosFlashShell),\nCVE-2025-2884\n(TCG TPM2.0 reference implementation),\nCVE-2025-26521\n(Apache CloudStack),\nCVE-2025-47950\n(CoreDNS),\nCVE-2025-4230\n,\nCVE-2025-4232\n(Palo Alto Networks PAN-OS),\nCVE-2025-4278, CVE-2025-2254, CVE-2025-5121, CVE-2025-0673\n(GitLab),\nCVE-2025-47934\n(OpenPGP.js),\nCVE-2025-49219\n,\nCVE-2025-49220\n(Trend Micro Apex Central),\nCVE-2025-49212\n,\nCVE-2025-49213\n,\nCVE-2025-49216\n,\nCVE-2025-49217\n(Trend Micro Endpoint Encryption PolicyServer),\nCVE-2025-4922\n(HashiCorp Nomad),\nCVE-2025-36631\n,\nCVE-2025-36632\n,\nCVE-2025-36633\n(Tenable Nessus Agent),\nCVE-2025-33108\n(IBM Backup, Recovery, and Media Services),\nCVE-2025-6029\n(KIA-branded Aftermarket Generic Smart Keyless Entry System), and a\npatch bypass for CVE-2024-41713\n(Mitel MiCollab).\n📰 Around the Cyber World\nKazakh and Singapore Authorities Disrupt Criminal Networks\n— Kazakh authorities\nsaid\nthey dismantled a network that was using Telegram to illegally sell citizens' personal data extracted from government databases. More than 140 suspects were arrested in connection with the scheme, including business owners and alleged administrators of Telegram channels used to peddle the stolen information, according to officials. If convicted, the suspects could face up to five years in prison and a fine. The development came as the Singapore Police Force (SPF), in partnership with authorities from Hong Kong, Macao, Malaysia, Maldives, South Korea, and Thailand, announced the arrests of 1,800 subjects between April 28 and May 28 for their involvement in\nvarious online scams\n. The cross-border anti-scam initiative has been codenamed Operation FRONTIER+. \"The subjects, aged between 14 and 81, are believed to be involved in more than 9,200 scam cases, comprising mainly government official impersonation scams, investment scams, rental scams, internet love scams, friend impersonation scams, job scams, and e-commerce scams, where victims reportedly lost over S$289 million (approximately USD225 million),\" the SPF\nsaid\n. \"More than 32,600 bank accounts suspected to be linked to scams were detected and frozen by the participating law enforcement agencies, with more than S$26.2 million (approximately USD20 million) seized in these bank accounts.\" Singapore officials said they arrested 106 people locally who were responsible for 1,300 scams that netted them about $30 million.\nMicrosoft to Block .library-ms and .search-ms File Types in Outlook\n— Microsoft announced it will expand the\nlist of blocked attachments\nin Outlook Web and the new Outlook for Windows starting next month, to include .library-ms and .search-ms file types. Both file types have been\nrepeatedly\nexploited\nby bad actors in phishing and malware attacks. \"The newly blocked file types are rarely used, so most organizations will not be affected by the change. However, if your users are sending and receiving affected attachments, they will report that they are no longer able to open or download them in Outlook Web or the New Outlook for Windows,\" Microsoft said.\nMeta and Yandex Caught Using Tracking Code to Leak Unique Identifiers to Installed Native Apps on Android\n— Meta and Yandex misused Android's\nlocalhost\nports to stealthily pass tracking data from mobile browsers into native apps like Facebook, Instagram, and Yandex services. This behavior allowed them to bypass browser sandboxing and Android's permission system, likely making it possible to attach persistent identifiers to detailed browsing histories. The tracking worked even in private browsing modes across major browsers like Chrome and Firefox. Put differently, the loophole lets the apps detect any websites that Android device users visit and integrate the\ntracking scripts\n, and gather web cookie data via the device's loopback interface. It takes advantage of the fact that the Android operating system allows any installed app with the INTERNET permission to open a listening socket on localhost (127.0.0.1) and browsers running on the same device can also access this interface without user consent or platform mediation. This opens the door to a scenario where JavaScript embedded on web pages can communicate with native Android apps and share identifiers and browsing habits over standard Web APIs. Evidence of Meta using the technique first emerged in September 2024, but Yandex is said to have adopted the technique in February 2017. Meta Pixel is embedded on over\n6 million websites\n, while Yandex Metrica is present on close to\n3 million websites\n. \"These native Android apps receive browsers' metadata, cookies, and commands from the Meta Pixel and Yandex Metrica scripts embedded on thousands of websites,\" a group of academics from IMDEA Networks, Radboud University, and KU Leuven\nsaid\n. \"These JavaScripts load on users' mobile browsers and silently connect with native apps running on the same device through localhost sockets. As native apps access programmatically device identifiers like the Android Advertising ID (AAID) or handle user identities as in the case of Meta apps, this method effectively allows these organizations to link mobile browsing sessions and web cookies to user identities, hence de-anonymizing users' visiting sites embedding their scripts.\" As of June 3, 2025, the Meta/Facebook Pixel script is no longer sending any packets or requests to localhost, and the code responsible for sending\n_fbp cookie\nhas been removed. Yandex claimed the feature in question did not collect any sensitive information and was solely meant to improve personalization. However, it has discontinued its use, citing privacy concerns. Google and Mozilla have\nreleased\ncountermeasures\nto plug the eavesdropping scheme.\nReplay Attacks as a Way to Bypass Deepfake Detection\n— New research has found that replay attacks are an effective method to bypass deepfake detection. \"By playing and re-recording deepfake audio through various speakers and microphones, we make spoofed samples appear authentic to the detection model,\" a team of researchers\nsaid\n. The development heralds new cyber risks as voice cloning technology has become a major driver of\nvishing attacks\n, allowing attackers to use artificial intelligence (AI) tools to generate synthetic audio that impersonate executives or IT personnel in an effort to gain privileged access to corporate systems.\nLinux Malware Families Receive Steady Code Updates\n— A new analysis of known Linux malware such as\nNoodleRAT\n,\nWinnti\n,\nSSHdInjector\n,\nPygmy Goat\n, and\nAcidRain\nhas found that \"they had at least two significant code updates within the last year, meaning threat actors are actively updating and supporting them,\" Palo Alto Networks unit 42\nsaid\n. \"Additionally, each of the malware strains accounted for at least 20 unique sightings of samples in the wild over the last year. This means that threat actors are actively using them.\" The activities indicate that these malware families are highly likely to be used in future attacks aimed at cloud environments.\nMicrosoft Defender Flaw Disclosed\n— Cybersecurity researchers have detailed a now-patched security flaw in Microsoft Defender for Identity that allows an unauthorized attacker to perform spoofing over an adjacent network by taking advantage of an improper authentication bug. The vulnerability, tracked as\nCVE-2025-26685\n(CVSS score: 6.5), was\npatched\nby Microsoft in May 2025. NetSPI, which\ndiscovered\nand reported the flaw, said the issue \"abused the Lateral Movement Paths (LMPs) feature and allowed an unauthenticated attacker on the local network to coerce and capture the Net-NTLM hash of the associated Directory Service Account (DSA), under specific conditions.\" Once the Net-NTLM hash is captured, it can be taken offline for password cracking using tools like Hashcat or exploited in conjunction with other vulnerabilities to elevate privileges to the DSA account and obtain a foothold in the Active Directory environment.\nApple Updates Passwords App with New Features\n— Apple has previewed new features in its Passwords app with iOS 26 and macOS 26 Tahoe that allow users to view the complete version history for stored logins, including the timestamps when a particular password was saved or changed. Another useful addition is the ability to import and export\npasskeys\nbetween participating credential manager apps across iOS, iPadOS, macOS, and visionOS 26. \"This user-initiated process, secured by local authentication like Face ID, reduces the risk of credential leaks,\" Apple\nsaid\n. \"The transfer uses a standardized data schema developed by the FIDO Alliance, ensuring compatibility between apps.\" A similar feature is\nalready in the works\nfor Google Password Manager. Last October, the FIDO Alliance\nunveiled\nthe Credential Exchange Protocol (CXP) and Credential Exchange Format (\nCXF\n) to facilitate interoperability.\nCyberEYE RAT Exposed\n— Cybersecurity researchers have shed light on the inner workings of CyberEYE RAT (aka TelegramRAT, a modular, .NET-based trojan that provides surveillance and data theft capabilities. Its various modules harvest browser history and passwords, Wi-Fi passwords, gaming profiles, files matching configured extensions, FileZilla FPT credentials, and session data from applications like Telegram and Discord. \"Its use of Telegram for Command and Control (C2) eliminates the need for attackers to maintain their own infrastructure, making it more evasive and accessible,\" CYFIRMA\nsaid\n. \"The malware is deployed through a builder GUI that allows attackers to customize payloads by injecting credentials, modifying metadata, and bundling features such as keyloggers, file grabbers, clipboard hijackers, and persistence mechanisms.\" The malware also acts as a\nclipper\nto redirect cryptocurrency transactions and employs defense evasion techniques by disabling Windows Defender through PowerShell and registry manipulations.\nWhatsApp Joins Apple's Encryption Fight With U.K.\n— Meta-owned WhatsApp said it's backing Apple in its legal fight against the U.K. Home Office's demands for backdoor access to encrypted iCloud data worldwide under the Investigatory Powers Act. The move, the company\ntold\nBBC, \"could set a dangerous precedent\" by \"emboldening\" other nations to put forth similar requests to break encryption. In response to the government notice, Apple\npulled\nthe Advanced Data Protection (\nADP\n) feature for iCloud from U.K. users' devices and\ntook legal action\nto appeal to the Investigatory Powers Tribunal to overturn the secret Technical Capability Notice (TCN) issued by the Home Office. In April 2025, the tribunal\nruled\nthe details of the\nlegal row\ncannot be kept secret. The existence of the TCN was first reported by The Washington Post in January. Governments across the U.S., U.K., and the European Union (E.U.) have sought to push back against end-to-end encryption, arguing it enables criminals, terrorists, and sex offenders to conceal illicit activity. Europol, in its 2025 Internet Organised Crime Threat Assessment (IOCTA) released last week,\nsaid\n: \"While encryption protects users' privacy, the criminal abuse of end-to-end encrypted (E2EE) apps is increasingly hampering investigations. Cybercriminals hide behind anonymity while coordinating sales of stolen data, often with no visibility for investigators.\"\nDanaBot C2 Server Suffers From DanaBleed\n— Last month, a coordinated law enforcement operation\nfelled\nDanaBot, a Delphi malware that allowed its operators to remotely commandeer the infected machines, steal data, and deliver additional payloads like ransomware. According to Zscaler ThreatLabz, a bug\nintroduced\nin its C2 server in June 2022 inadvertently caused it to \"leak snippets of its process memory in responses to infected victims,\" giving more visibility into the malware. The leaked information included threat actor usernames, threat actor IP addresses, backend C2 server IP addresses and domains, infection and exfiltration statistics, malware version updates, private cryptographic keys, victim IP addresses, victim credentials, and other exfiltrated victim data. The June 2022 update introduced a new C2 protocol to exchange command data and responses. \"The memory leak allowed up to 1,792 bytes per C2 server response to be exposed,\" Zscaler said. \"The content of the leaked data was arbitrary and depended on the code being executed and the data being manipulated in the C2 server process at a given time.\"\nLures for OpenAI Sora and DeepSeek Lead to Malware\n— A bogus site impersonating DeepSeek (\"deepseek-platform[.]com\") is distributing installers for a malware called BrowserVenom, a Windows implant that reconfigures Chromium- and Gecko-based browsing instances to force traffic through a proxy controlled by the threat actors by adding a hard-coded proxy server address. \"This enables them to sniff sensitive data and monitor the victim's browsing activity while decrypting their traffic,\" Kaspersky\nsaid\n. The phishing sites are promoted in the search results via Google Ads when users search for \"deepseek r1.\" The installer is designed to run a PowerShell command that retrieves the malware from an external server. The attacks are characterized by the use of CAPTCHA challenges to ward off bots. To date, BrowserVenom has infected \"multiple\" computers across Brazil, Cuba, Mexico, India, Nepal, South Africa, and Egypt. The disclosure comes as phony installers for OpenAI Sora have been\nfound\nto distribute a Windows information stealer dubbed SoraAI.lnk that's hosted on GitHub. The\nGitHub account\nhosting the malware is no longer accessible.\nCyber Partisans Targets Belarus and Russia\n— A Belarusian hacktivist group called Cyber Partisans has been\nobserved\ntargeting industrial enterprises and government agencies in Russia and Belarus with a backdoor known as Vasilek that uses Telegram for C2 and data exfiltration. The phishing attacks are notable for the deployment of another backdoor called DNSCat2 that enables attackers to remotely manage an infected system and a wiper referred to as Pryanik. \"The first thing that draws attention is that the viper acts as a logic bomb: its functionality is activated on a certain date and time,\" Kaspersky said. Other tools used as part of the attacks include Gost for proxying and tunneling network traffic, and Evlx for removing events from Windows event logs. In a statement to Recorded Future News, the collective stated that Kaspersky's attention to its operations may have stemmed from the fact that the attacks relied on the company's products and had failed to prevent intrusions. \"Such attacks make Kaspersky's technologies appear outdated, and perhaps this is why they are trying to justify themselves or counter us with these publications,\" the group was\nquoted\nas saying.\n2 ViLE Members Sentenced to Prison\n— The U.S. Department of Justice (DoJ)\nannounced\nthe sentencing of two members of the ViLE hacking group – Sagar Steven Singh, 21, and Nicholas Ceraolo, 27, – nearly a year after they\npleaded guilty\nto aggravated identity theft and computer hacking crimes. Singh and Ceraolo have been sentenced to 27 and 25 months' imprisonment respectively for conspiracy to commit computer intrusion and aggravated identity theft. \"Singh and Ceraolo unlawfully used a law enforcement officer's stolen password to access a nonpublic, password-protected web portal (the 'Portal') maintained by a U.S. federal law enforcement agency for the purpose of sharing intelligence with state and local law enforcement,\" the DoJ said. \"The defendants used their access to the Portal to extort their victims.\" The sentencing came as\nfive men pleaded guilty\nfor their involvement in laundering more than $36.9 million from victims of an international digital asset investment scam conspiracy (aka\nromance baiting\n) that was carried out from scam centers in Cambodia. The defendants\ninclude\nJoseph Wong, 33, of Alhambra, California; Yicheng Zhang, 39, of China; Jose Somarriba, 55, of Los Angeles; Shengsheng He, 39, of La Puente, California; and Jingliang Su, 44, of China and Turkey. They are said to be \"part of an international criminal network that induced U.S. victims, believing they were investing in digital assets, to transfer funds to accounts controlled by co-conspirators and that laundered victim money through U.S. shell companies, international bank accounts, and digital asset wallets.\" So far, eight people have pleaded guilty to participating in the criminal scheme, counting Chinese nationals\nDaren Li and Yicheng Zhang\n.\nKimsuky Targets Facebook, email, and Telegram Users in South Korea\n— The North Korean-affiliated threat actor known as\nKimusky\ntargeted Facebook, email, and Telegram users in its southern counterpart between March and April 2025 as part of a campaign codenamed Triple Combo. \"The threat actor used an account named 'Transitional Justice Mission' to send friend requests and direct messages to multiple individuals involved in North Korea-related activities,\" Genians\nsaid\n. \"The attacker also hijacked another Facebook account for their operation.\" Subsequently, the attackers attempted to approach the targets via email by using the email address obtained through Facebook Messenger conversations. Alternately, the Kimsuky actors leveraged the victims' phone numbers to contact them again via Telegram. Regardless of the channel used, these trust-building exercises triggered a multi-stage infection sequence to deliver a known malware called\nAppleSeed\n.\n🎥 Cybersecurity Webinars\nAI Agents Are Leaking Data — Learn How to Fix It Fast\n➝\nAI tools often connect to platforms like Google Drive and SharePoint—but without the right settings, they can accidentally expose sensitive data. In this webinar, experts from Sentra will show simple, real-world ways these leaks happen and how to stop them. If you're using AI in your business, don't miss this fast, clear guide to securing it before something goes wrong.\nThey're Faking Your Brand—Stop AI Impersonation Before It Spreads\n➝\nAI-driven attackers are mimicking brands, execs, and employees in real-time. Join this session to see how Doppel detects and blocks impersonation across email, social media, and deepfakes—before damage is done. Fast, adaptive protection for your reputation.\n🔧 Cybersecurity Tools\nCRADLE\n➝\nIt is an open-source web platform built for cyber threat intelligence (CTI) analysts. It simplifies threat investigation workflows by enabling teams to collaborate in real-time, map relationships between threat actors and indicators, and generate detailed intelligence reports. Designed with modular architecture, CRADLE is easy to extend and runs locally using Docker for quick setup and testing.\nNewtowner\n➝\nIt is a security testing tool that helps identify weaknesses in network trust boundaries by simulating traffic from different global cloud providers and CI/CD environments. It allows you to detect misconfigurations—such as overly permissive access from specific data centers—by comparing HTTP responses from multiple sources like GitHub Actions, AWS, and EC2. This is especially useful in modern cloud setups where implicit trust between internal services can lead to serious security gaps.\nDisclaimer: These newly released tools are for educational use only and haven't been fully audited. Use at your own risk—review the code, test safely, and apply proper safeguards.\n🔒 Tip of the Week\n4 Hidden Ways You're Tracked (and How to Fight Back) ➝\nMost people know about cookies and ads, but companies now use sneaky technical tricks to track you—even if you're using a VPN, private mode, or a hardened browser. One method gaining attention is\nlocalhost tracking\n: apps like Facebook and Instagram silently run a web server inside your phone. When you visit a website with a hidden code, it can ping this server to see if the app is installed—leaking your activity back to the app, without your permission.\nAnother trick is\nport probing\n. Some websites scan your device to check if developer tools or apps are running on certain ports (like 3000 or 9222). This reveals what software you use or whether you're running a specific company's tool—leaking clues about your job, device, or activity. Sites may even detect browser extensions this way.\nOn mobile, some websites silently test if apps like Twitter, PayPal, or your banking app are installed by triggering\ninvisible deep links\n. If the app opens or responds, they learn what apps you use. That's often used for profiling or targeted phishing. Also, browser cache abuse (using things like ETags or service workers) can fingerprint your browser—even across private tabs—keeping you identifiable even when you think you're clean.\nHow to protect yourself:\nUninstall apps you rarely use, especially ones from big platforms.\nUse browsers like Firefox with uBlock Origin and enable \"Block outsider intrusion into LAN.\"\nOn mobile, use hardened browsers like Bromite or Firefox Focus, and block background data for apps using tools like NetGuard.\nClear browser storage often, and use temporary containers or incognito containers to isolate sessions.\nThese aren't tinfoil hat ideas—they're real-world methods used by major tech firms and trackers today. Staying private means going beyond ad blockers and learning how the web really works behind the scenes.\nConclusion\nWhat goes undetected often isn't invisible—it's just misclassified, minimized, or misunderstood. Human error isn't always a technical failure. Sometimes it's a story we tell ourselves about what shouldn't happen.\nReview your recent alerts. Which ones were ignored because they didn't \"feel right\" for the threat profile? The cost of dismissal is rising—especially when adversaries bank on it.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Playbook: Transforming Your Cybersecurity Practice Into An MRR Machine",
        "Link": "https://thehackernews.com/2025/06/playbook-transforming-your.html",
        "Summary": "Introduction\nThe cybersecurity landscape is evolving rapidly, and so are the cyber needs of organizations worldwide. While businesses face mounting pressure from regulators, insurers, and rising threats, many still treat cybersecurity as an afterthought. As a result, providers may struggle to move beyond tactical services like one-off assessments or compliance checklists, and demonstrate",
        "Date": "2025-06-16",
        "Content": "Introduction\nThe cybersecurity landscape is evolving rapidly, and so are the cyber needs of organizations worldwide. While businesses face mounting pressure from regulators, insurers, and rising threats, many still treat cybersecurity as an afterthought. As a result, providers may struggle to move beyond tactical services like one-off assessments or compliance checklists, and demonstrate long-term security value.\nTo stay competitive and drive lasting impact, leading service providers are repositioning cybersecurity as a strategic business enabler, and transitioning from reactive, risk-based services to ongoing cybersecurity management aligned with business goals.\nFor service providers, this shift opens a clear opportunity to move beyond tactical projects and become long-term security partners, while unlocking new streams of recurring revenue.\nMany MSPs, MSSPs, and consultancies already provide valuable point solutions, from identifying vulnerabilities to supporting audits and meeting compliance needs. These one-off services often serve as a strong foundation and can be expanded into broader, recurring offerings.\nThat's why we created the\nplaybook: Transforming Your Cybersecurity Practice Into an MRR Machine.\nThis playbook will guide you how to build on the services you already provide and expand them into a scalable, recurring, and strategic offering, one that delivers deeper client value and more predictable, high-margin revenue for your business.\nWhat End-to-End Cybersecurity Programs Include\nCybersecurity services vary widely, but short-term fixes like patching or assessments often leave clients vulnerable to evolving threats. End-to-end programs offer a better path: continuous oversight, proactive risk management, and ongoing compliance support. They turn cybersecurity into a strategic business function, not just a technical task.\nFor clients, this means stronger resilience. For providers, it means predictable revenue and a deeper, more strategic role. These programs require closer collaboration with leadership, elevating the provider from a project vendor to a trusted advisor.\nStrategic providers typically offer services like:\nRisk assessment and ongoing risk management\nLong-term cybersecurity roadmaps aligned to business goals\nContinuous compliance management\nBusiness continuity and disaster recovery (BC/DR) planning\nSecurity awareness and training programs\nIncident response planning and testing\nThird-party risk management\nJust as important, they also need to communicate effectively with executive leadership, translating security insights into business terms and providing reporting that supports strategic decision-making.\nService Tiers: Structuring Your Offering\nOne of the most impactful and lucrative services a provider can offer is Fractional CISO or Virtual CISO (vCISO) services, but delivering it effectively goes beyond technical expertise. It requires strategic leadership, business fluency, and a repeatable delivery model. That's why many successful providers structure their services into clear tiers that align with client needs and maturity levels. This approach not only simplifies packaging and pricing but also makes it easier for clients to understand the value and grow into more advanced offerings over time.\nA typical tiered model starts with Governance, Risk & Advisory services, which are ideal for smaller, non-regulated organizations. This includes core offerings like risk assessments, cybersecurity roadmaps, and foundational policy development.\nThe next tier, Governance, Risk, Advisory & Compliance, is built for mid-sized, regulated organizations that need support aligning with frameworks like CMMC, ISO, or HIPAA. In addition to foundational services, this level includes compliance management and ongoing framework alignment.\nAt the top is the Fractional CISO tier, suited for larger or highly regulated organizations. These engagements require deeper involvement, more rigorous reporting, and closer integration with business leadership, positioning the provider as a true strategic advisor.\nTo help providers confidently scale into these higher-value tiers, Cynomi offers free online\nvCISO Academy Courses\n. The courses cover essential frameworks, client management strategies, and proven methods for delivering high-impact, recurring security services.\nWhat's Holding You Back? Common Barriers and How to Overcome Them\nMany providers hesitate to expand into strategic services because the path forward seems overwhelming. Some worry they lack the expertise to act as a virtual CISO. Others fear that serving more than a few clients will stretch their teams too thin. Still others feel lost trying to navigate compliance frameworks or define service packages.\nThe truth? You don't need to make a massive leap, most providers are already closer than they think. If you're doing risk assessments or helping clients prepare for audits, you're halfway there. What's needed is a structured, phased approach.\nRead the full playbook\nto learn how to build on what you're already doing, introduce strategic value in phases, and unlock long-term growth through standardization, automation, and smart service design.\nAutomation and Standardization: The Secret to Scale\nStrategic services demand consistency, speed, and repeatability. That's where automation comes in. Platforms like Cynomi enable providers to:\nStandardize workflows and client engagement\nCut assessment times\nContinuously monitor risk and compliance\nGenerate audit-ready reports automatically\nOperate with leaner teams\nReal-World Example: Burwood Group:\nBurwood, a technology consulting firm, expanded its business by evolving from offering smaller cybersecurity engagements to delivering ongoing strategic offerings and vCISO services that provide greater scale and recurring revenue. By standardizing delivery with Cynomi and clearly demonstrating the value of ongoing support, they boosted upsells by 50%. Read the full case study in the Playbook.\nFinal Thoughts\nThe shift from reactive to strategic cybersecurity is becoming a key differentiator for service providers. Whether you're already delivering risk assessments or just starting to think about scaling your business, Cynomi's\nplaybook\noffers actionable guidance to build a scalable, future-proof security practice.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "PyPI, npm, and AI Tools Exploited in Malware Surge Targeting DevOps and Cloud Environments",
        "Link": "https://thehackernews.com/2025/06/malicious-pypi-package-masquerades-as.html",
        "Summary": "Cybersecurity researchers from&nbsp;SafeDep and Veracode detailed a number of malware-laced npm packages that are designed to execute remote code and download additional payloads.\nThe packages in question are listed below -\n\neslint-config-airbnb-compat (676 Downloads)\nts-runtime-compat-check (1,588 Downloads)\nsolders (983 Downloads)\n@mediawave/lib (386 Downloads)\n\nAll the identified npm",
        "Date": "2025-06-16",
        "Content": "Cybersecurity researchers from\nSafeDep\nand\nVeracode\ndetailed a number of malware-laced npm packages that are designed to execute remote code and download additional payloads.\nThe packages in question are listed below -\neslint-config-airbnb-compat (676 Downloads)\nts-runtime-compat-check (1,588 Downloads)\nsolders (983 Downloads)\n@mediawave/lib (386 Downloads)\nAll the identified npm packages have since been taken down from npm, but not before they were downloaded hundreds of times from the package registry.\nSafeDep's analysis of eslint-config-airbnb-compat found that the JavaScript library has ts-runtime-compat-check listed as a dependency, which, in turn, contacts an external server defined in the former package (\"proxy.eslint-proxy[.]site\") to retrieve and execute a Base64-encoded string. The exact nature of the payload is unknown.\n\"It implements a multi-stage remote code execution attack using a transitive dependency to hide the malicious code,\" SafeDep researcher Kunal Singh said.\nSolders, on the other hand, has been found to incorporate a post-install script in its package.json, causing the malicious code to be automatically executed as soon as the package is installed.\n\"At first glance, it's hard to believe that this is actually valid JavaScript,\" the Veracode Threat Research team said. \"It looks like a seemingly random collection of Japanese symbols. It turns out that this particular obfuscation scheme uses the Unicode characters as variable names and a sophisticated chain of dynamic code generation to work.\"\nDecoding the script reveals an extra layer of obfuscation, unpacking which reveals its main function: Check if the compromised machine is Windows, and if so, run a PowerShell command to retrieve a next-stage payload from a remote server (\"firewall[.]tel\").\nThis second-stage PowerShell script, also obscured, is designed to fetch a Windows batch script from another domain (\"cdn.audiowave[.]org\") and\nconfigures\na Windows Defender Antivirus exclusion list to avoid detection. The batch script then paves the way for the execution of a .NET DLL that reaches out to a PNG image hosted on ImgBB (\"i.ibb[.]co\").\n\"[The DLL] is grabbing the last two pixels from this image and then looping through some data contained elsewhere in it,\" Veracode said. \"It ultimately builds up in memory YET ANOTHER .NET DLL.\"\nFurthermore, the DLL is equipped to create task scheduler entries and features the ability to\nbypass user account control\n(\nUAC\n) using a combination of\nFodHelper.exe\nand programmatic identifiers (\nProgIDs\n) to evade defenses and avoid triggering any security alerts to the user.\nThe\nnewly-downloaded DLL\nis\nPulsar RAT\n, a \"free, open-source Remote Administration Tool for Windows\" and a variant of the Quasar RAT malware.\n\"From a wall of Japanese characters to a RAT hidden within the pixels of a PNG file, the attacker went to extraordinary lengths to conceal their payload, nesting it a dozen layers deep to evade detection,\" Veracode said. \"While the attacker's ultimate objective for deploying the Pulsar RAT remains unclear, the sheer complexity of this delivery mechanism is a powerful indicator of malicious intent.\"\nCrypto Malware in the Open-Source Supply Chain\nThe findings also coincide with a report from Socket that identified credential stealers, cryptocurrency drainers, cryptojackers, and clippers as the main types of threats targeting the cryptocurrency and blockchain development ecosystem.\nSome of the examples of these packages include -\nexpress-dompurify and pumptoolforvolumeandcomment, which are capable of harvesting browser credentials and cryptocurrency wallet keys\nbs58js, which drains a victim's wallet and uses multi-hop transfers to obscure theft and frustrate forensic tracing.\nlsjglsjdv, asyncaiosignal, and raydium-sdk-liquidity-init, which functions as a clipper to monitor the system clipboard for cryptocurrency wallet strings and replace them with threat actor‑controlled addresses to reroute transactions to the attackers\n\"As Web3 development converges with mainstream software engineering, the attack surface for blockchain-focused projects is expanding in both scale and complexity,\" Socket security researcher Kirill Boychenko\nsaid\n.\n\"Financially motivated threat actors and state-sponsored groups are rapidly evolving their tactics to exploit systemic weaknesses in the software supply chain. These campaigns are iterative, persistent, and increasingly tailored to high-value targets.\"\nAI and Slopsquatting\nThe rise of artificial intelligence (AI)-assisted coding, also called vibe coding, has unleashed another novel threat in the form of\nslopsquatting\n, where large language models (LLMs) can hallucinate non-existent but plausible package names that bad actors can weaponize to conduct supply chain attacks.\nTrend Micro, in a report last week, said it observed an unnamed advanced agent \"confidently\" cooking up a phantom Python package named starlette-reverse-proxy, only for the build process to crash with the error \"module not found.\" However, should an adversary upload a package with the same name on the repository, it can have serious security consequences.\nFurthermore, the cybersecurity company noted that advanced coding agents and workflows such as Claude Code CLI, OpenAI Codex CLI, and Cursor AI with Model Context Protocol (MCP)-backed validation can help reduce, but not completely eliminate, the risk of slopsquatting.\n\"When agents hallucinate dependencies or install unverified packages, they create an opportunity for slopsquatting attacks, in which malicious actors pre-register those same hallucinated names on public registries,\" security researcher Sean Park\nsaid\n.\n\"While reasoning-enhanced agents can reduce the rate of phantom suggestions by approximately half, they do not eliminate them entirely. Even the vibe-coding workflow augmented with live MCP validations achieves the lowest rates of slip-through, but still misses edge cases.\"\nchimera-sandbox-extensions Published as a Red Teaming Exercise\nLastly, a new package discovered on the Python Package Index (PyPI) repository with capabilities to capture sensitive developer-related information, such as credentials, configuration data, and environment variables, has been identified as a red teaming effort.\nThe package, named chimera-sandbox-extensions, attracted 143 downloads and likely targeted users of a service called\nChimera Sandbox\n, which was released by Singaporean tech company Grab last August to facilitate \"experimentation and development of [machine learning] solutions.\"\nThe package masquerades as a helper module for Chimera Sandbox, but \"aims to steal credentials and other sensitive information such as Jamf configuration, CI/CD environment variables, AWS tokens, and more,\" JFrog security researcher Guy Korolevski\nsaid\nin a report published last week.\nOnce installed, it attempts to connect to an external domain whose domain name is generated using a domain generation algorithm (\nDGA\n) in order to download and execute a next-stage payload.\nSpecifically, the malware acquires from the domain an authentication token, which is then used to send a request to the same domain and retrieve the Python-based information stealer.\nThe stealer is equipped to siphon a wide range of data from infected machines. This includes -\nJAMF receipts, which are records of software packages installed by Jamf Pro on managed computers\nPod sandbox environment authentication tokens and git information\nCI/CD information from environment variables\nZscaler host configuration\nAmazon Web Services account information and tokens\nPublic IP address\nGeneral platform, user, and host information\nThe kind of data gathered by the malware shows that it's mainly geared towards corporate and cloud infrastructure. In addition, the extraction of\nJAMF receipts\nindicates that it's also capable of targeting Apple macOS systems.\nThe collected information is sent via a POST request back to the same domain, after which the server assesses if the machine is a worthy target for further exploitation. However, JFrog said it was unable to obtain the payload at the time of analysis.\n\"The targeted approach employed by this malware, along with the complexity of its multi-stage targeted payload, distinguishes it from the more generic open-source malware threats we have encountered thus far, highlighting the advancements that malicious packages have made recently,\" Jonathan Sar Shalom, director of threat research at JFrog Security Research team, said.\n\"This new sophistication of malware underscores why development teams remain vigilant with updates – alongside proactive security research – to defend against emerging threats and maintain software integrity.\"\nIn a statement shared with The Hacker News, Grab said that the package chimera-sandbox-extensions was published to PyPI as part of a red teaming exercise conducted by its cybersecurity team.\n\"The PyPI package [...] was not created with malicious intent and Grab was not targeted by unknown threat actors,\" Vincent Wong, head of cyber defense at Grab, told the publication. \"The purpose of this simulation was to test and improve our own internal security detection and response capabilities.\"\nStating that the activity was \"planned, authorized, and controlled,\" Wong said \"the package itself was not set up to steal credentials or tokens and would not have executed on any non-Grab systems. We understand that from an external perspective, this activity could be misinterpreted as a genuine threat.\"\n(The story was updated after publication to include a response from Grab.)\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Hackers switch to targeting U.S. insurance companies",
        "Link": "https://www.bleepingcomputer.com/news/security/google-warns-scattered-spider-hackers-now-target-us-insurance-companies/",
        "Summary": "Threat intelligence researchers are warning of hackers breaching multiple U.S. companies in the insurance industry using all the tactics observed with Scattered Spider activity. [...]",
        "Date": "2025-06-16",
        "Content": "Threat intelligence researchers are warning of hackers breaching multiple U.S. companies in the insurance industry using all the tactics observed with Scattered Spider activity.\nTypically, the threat group has a sector-by-sector focus. Previously, they targeted retail organizations in the United Kingdom and then switched to targets in the same sector in the United States.\n“Google Threat Intelligence Group is now aware of multiple intrusions in the US which bear all the hallmarks of Scattered Spider activity. We are now seeing incidents in the insurance industry,” John Hultquist, Chief Analyst at Google Threat Intelligence Group (GTIG), told BleepingComputer.\nHultquist warns that because the group approaches one sector at a time, “the insurance industry should be on high alert.”\nGTIG’s chief researcher says that companies should pay particular attention to potential social engineering attempts on help desk and call centers.\nScattered Spider tactics\nScattered Spider is the name given to a fluid coalition of threat actors that employ sophisticated social engineering attacks to bypass mature security programs.\nThe group is also tracked as 0ktapus, UNC3944, Scatter Swine, Starfraud, and Muddled Libra, and has been linked to breaches at multiple high-profile organizations that mixed phishing, SIM-swapping, and MFA fatigue/MFA bombing for initial access.\nIn a later stage of the attack, the group has been observed dropping ransomware like\nRansomHub\n,\nQilin\n, and DragonForce.\nDefending against Scattered Spider attacks\nOrganizations defending against this type of threat actor should start with gaining complete visibility across the entire infrastructure, identity systems, and critical management services.\nGTIG\nrecommends\nsegregating identities and using strong authentication criteria along with rigorous identity controls for password resets and MFA registration.\nSince Scattered Spider relies on social engineering, organizations should educate employees and internal security teams on impersonation attempts via various channels (SMS, phone calls, messaging platforms) that may sometimes include aggressive language to scare the target into compliance.\nAfter hackers breached\nMarks & Spencer\n,\nCo-op\n, and\nHarrods\nretailers in the U.K. this year, the country’s National Cyber Security Centre (NCSC) shared tips for organizations to improve their cybersecurity defenses.\nIn all three attacks, the threat actor used the same social engineering tactics associated with Scattered Spired and dropped DragonForce ransomware in the final stage.\nNCSC’s recommendations include activating two-factor or multi-factor authentication, monitoring for unauthorized logins, and checking if access to Domain Admin, Enterprise Admin, and Cloud Admin accounts is legitimate.\nAdditionally, the U.K. agency advises that organizations review how the helpdesk service authenticates credentials before resetting them, especially for employees with elevated privileges.\nThe ability to identify logins from unusual sources (e.g. VPN services from residential ranges) could also help identify a potential attack.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nHackers behind UK retail attacks now targeting US companies\nErie Insurance confirms cyberattack behind business disruptions\nGrocery wholesale giant United Natural Foods hit by cyberattack\nWestJet investigates cyberattack disrupting internal systems\nGoogle links massive cloud outage to API management issue"
    },
    {
        "Title": "ASUS Armoury Crate bug lets attackers get Windows admin privileges",
        "Link": "https://www.bleepingcomputer.com/news/security/asus-armoury-crate-bug-lets-attackers-get-windows-admin-privileges/",
        "Summary": "A high-severity vulnerability in ASUS Armoury Crate software could allow threat actors to escalate their privileges to SYSTEM level on Windows machines. [...]",
        "Date": "2025-06-16",
        "Content": "A high-severity vulnerability in ASUS Armoury Crate software could allow threat actors to escalate their privileges to SYSTEM level on Windows machines.\nThe security issue is tracked as\nCVE-2025-3464\nand received a severity score of 8.8 out of 10.\nIt could be exploited to bypass authorization and affects the AsIO3.sys of the Armoury Crate system management software.\nArmoury Crate is the official system control software for Windows from ASUS, providing a centralized interface to control RGB lighting (Aura Sync), adjust fan curves, manage performance profiles and ASUS peripherals, as well as download drivers and firmware updates.\nTo perform all these functions and provide low-level system monitoring, the software suite uses the kernel driver to access and control hardware features.\nCisco Talos' researcher Marcin \"Icewall\" Noga reported CVE-2025-3464 to the tech company.\nAccording to a\nTalos advisory\n, the issue lies in the driver verifying callers based on a hardcoded SHA-256 hash of AsusCertService.exe and a PID allowlist, instead of using proper OS-level access controls.\nExploiting the flaw involves creating a hard link from a benign test app to a fake executable. The attacker launches the app, pauses it, and then swaps the hard link to point to AsusCertService.exe.\nWhen the driver checks the file's SHA-256 hash, it reads the now-linked trusted binary, allowing the test app to bypass authorization and gain access to the driver.\nThis grants the attacker low-level system privileges, giving them direct access to physical memory, I/O ports, and model-specific registers (MSRs), opening the path to full OS compromise.\nIt is important to note that the attacker must already be on the system (malware infection, phishing, compromised unprivileged account) to exploit CVE-2025-3464.\nHowever, the extensive deployment of the software on computers worldwide may represent an attack surface large enough for exploitation to become attractive.\nCisco Talos validated that CVE-2025-3464 impacts Armoury Crate version 5.9.13.0, but\nASUS' bulletin\nnotes that the flaw impacts all versions between 5.9.9.0 and 6.1.18.0.\nTo mitigate the security problem, it is recommended to apply the latest update by opening the Armoury Crate app and going to \"Settings\"> \"Update Center\"> \"Check for Updates\"> \"Update.\"\nCisco reported the flaw to ASUS in February but no exploitation in the wild has been observed so far. However, \"ASUS strongly recommends that users update their Armoury Crate installation to the latest version.\"\nWindows kernel driver bugs that lead to local privilege escalation are\npopular among hackers\n, including\nransomware actors\n,\nmalware operations\n, and\nthreats to government agencies\n.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nPremium WordPress 'Motors' theme vulnerable to admin takeover attacks\nASUS DriverHub flaw let malicious sites run commands with admin rights\nASUS releases fix for AMI bug that lets hackers brick servers\nASUS warns of critical auth bypass flaw in routers using AiCloud\nOver 46,000 Grafana instances exposed to account takeover bug"
    },
    {
        "Title": "Washington Post's email system hacked, journalists' accounts compromised",
        "Link": "https://www.bleepingcomputer.com/news/security/washington-posts-email-system-hacked-journalists-accounts-compromised/",
        "Summary": "Email accounts of several Washington Post journalists were compromised in a cyberattack believed to have been carried out by a foreign government. [...]",
        "Date": "2025-06-16",
        "Content": "Email accounts of several Washington Post journalists were compromised in a cyberattack believed to have been carried out by a foreign government.\nThe incident was discovered on Thursday evening and the publication started an investigation. On Sunday, June 15, an internal memo was sent to employees, informing them of a “possible targeted unauthorized intrusion into their email system.”\nAccording to\nThe Wall Street Journal\n, the memo was signed by Executive Editor Matt Murray and informed that Microsoft accounts of a limited number of journalists were affected.\nOwned by Amazon founder Jeff Bezos, The Washington Post is one of the most influential newspaper publications in the United States.\nInternal sources told The Wall Street Journal that the attack targeted journalists writing on national security and economic policy topics, as well as some who write about China.\nAdvanced persistent threats (APTs), or state-sponsored actors,\noften target\nemail systems like Microsoft Exchange. Two years ago, Chinese hackers leveraged insecure Exchange endpoints to breach email accounts of\ntwo dozen government agencies\nglobally, accessing extremely sensitive and confidential data.\nBut Chinese threat groups have a long history of exploiting Exchange vulnerabilities in highly organized campaigns. They targeted U.S. government agencies\nin 2020\n, and multiple NATO members\nin 2021\n.\nLast year,\nMicrosoft warned\nthat hackers were exploiting a critical privilege elevation bug in Exchange as a zero-day to perform NTLM relay attacks.\nESET cybersecurity company also discovered in 2021 multiple Chinese threat groups, including\nAPT27, Bronze Butler, and Calypso\n, exploiting zero-day vulnerabilities in Microsoft Exchange.\nWashington Post has not shared publicly any details about the attack.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nGovernment webmail hacked via XSS bugs in global spy campaign\nMicrosoft shares temp fix for Outlook crashes when opening emails\nHackers exploited Windows WebDav zero-day to drop malware\nSentinelOne shares new details on China-linked breach attempt\nCzechia blames China for Ministry of Foreign Affairs cyberattack"
    },
    {
        "Title": "Kali Linux 2025.2 released with 13 new tools, car hacking updates",
        "Link": "https://www.bleepingcomputer.com/news/security/kali-linux-20252-released-with-13-new-tools-car-hacking-updates/",
        "Summary": "Kali Linux 2025.2, the second release of the year, is now available for download with 13 new tools and an expanded car hacking toolkit. [...]",
        "Date": "2025-06-16",
        "Content": "Kali Linux 2025.2, the second release of the year, is now available for download with 13 new tools and an expanded car hacking toolkit.\nDesigned for cybersecurity professionals and ethical hackers, the Kali Linux distribution facilitates security audits, penetration testing, and network research.\nThe Kali Team has added many new features and refined the distro's user interface. Notable changes include:\nRenamed and updated car hacking toolset\nKali Menu and UI refresh\nUpdates to Kali NetHunter\nAdditional hacking tools\nRenamed and expanded car hacking toolkit\nIn this release, the CAN Arsenal was renamed CARsenal to better reflect its purpose as a car hacking toolset and now has a more user-friendly interface.\nThe Kali Team has also added new tools, including:\nhlcand\n: Modified slcand for ELM327 use\nVIN Info\n: Decode your VIN identifier\nCaringCaribou\n: Actually provide Listener, Dump, Fuzzer, Send, UDS and XCP modules\nICSim\n: Provide a great simulator to play with VCAN and test CARsenal toolset without hardware needed\nKali Menu and UI refresh\nThe Kali Menu was also reorganized to align with the MITRE ATT&CK framework, making it easier for both red and blue teams to find the right tools.\nThe menu structure was previously based on older systems like WHAX and BackTrack, which unfortunately lacked proper design planning and made it difficult to scale and add new tools, resulting in confusion when trying to locate similar tools.\n\"Now, we have created a new system and automated many aspects, making it easier for us to manage, and easier for you to discover items. Win win. Over time, we hope to start to add this to kali.org/tools/,\" the Kali Team said.\n\"Currently Kali Purple still follows NIST CSF (National Institute of Standards and Technology Critical Infrastructure Cybersecurity), rather than MITRE D3FEND.\"\nNew Kali Menu (Kali Team)\nGNOME has been updated to version 48, featuring notification stacking, performance improvements, dynamic triple buffering, and an enhanced image viewer. It also includes digital well-being tools for battery health preservation and HDR support.\nThe user interface has been refined for a sharper look with improved themes, and the document reader Evince has been replaced with the new Papers app.\nKDE Plasma has now reached version 6.3, which packs a massive overhaul of fractional scaling, accurate screen colors when using the Night Light, more accurate CPU usage in the system monitor, Info Center with more information, like GPU data or battery cycle counts, and many more customization features.\nNew tools in Kali Linux 2025.2\nThis new Kali Linux release also adds 23 new toys to test:\nazurehound\n- BloodHound data collector for Microsoft Azure\nbinwalk3\n- Firmware Analysis Tool\nbloodhound-ce-python\n- Python based ingestor for BloodHound CE\nbopscrk\n- Generate smart and powerful wordlists\nchisel-common-binaries\n- Prebuilt binaries for chisel\ncrlfuzz\n- Fast tool to scan CRLF vulnerability written in Go (Submitted by\n@Arszilla\n)\ndonut-shellcode\n- Generates position-independent shellcode from memory and runs them\ngitxray\n- Scan GitHub repositories and contributors to collect data (Submitted by\n@weirdlantern\n)\nldeep\n- In-depth LDAP enumeration utility\nligolo-ng-common-binaries\n- Prebuilt binaries for Advanced ligolo-ng\nrubeus\n- Raw Kerberos interaction and abuses\nsharphound\n- BloodHound CE collector\ntinja\n- CLI tool for testing web pages for template injection\nKali NetHunter Updates\nBesides a revamped car hacking toolset, Kali Linux 2025.2 introduces wireless injection, de-authentication, and WPA2 handshake capture support for the first smartwatch, the TicWatch Pro 3 (all variants with bcm43436b0 chipset).\nKali Team also\nshared a teaser\nfeaturing Kali NetHunter KeX running on Android Auto head units and introduced new and updated Kali NetHunter Kernels, including:\n(New)\nXiaomi Redmi 4/4X\n(A13) (by\n@MomboteQ\n)\n(New)\nXiaomi Redmi Note 11\n(A15) (by\n@Madara273\n)\n(Updated)\nRealme C15\n(A10) (by\n@Frostleaft07\n)\n(Updated)\nSamsung Galaxy S10\n(A14,A15/exynos9820) (by\n@V0lk3n\n)\n(Updated)\nSamsung Galaxy S9\n(A13/exynos9810) (by\n@V0lk3n\n)\nHow to get Kali Linux 2025.2\nTo start using Kali Linux 2025.2, upgrade your existing installation,\nselect a platform\n, or\ndirectly download ISO images\nfor new installs and live distributions.\nKali users updating from a previous version can use the following commands to upgrade to the latest version.\necho \"deb http://http.kali.org/kali kali-rolling main contrib non-free non-free-firmware\" | sudo tee /etc/apt/sources.list\r\n\r\nsudo apt update && sudo apt -y full-upgrade\r\n\r\ncp -vrbi /etc/skel/. ~/\r\n\r\n[ -f /var/run/reboot-required ] && sudo reboot -f\nIf you're using Kali on WSL, consider upgrading to WSL 2 for better support of graphical applications. To check your WSL version, run 'wsl -l -v' in a Windows command prompt.\nOnce upgraded, you can check if the upgrade was successful using the following command:\ngrep VERSION /etc/os-release\n.\nYou can check the complete changelog for Kali Linux 2025.2\non Kali's website\n.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nStart learning cybersecurity skills with this $35 course bundle deal\nWindows 11 and Red Hat Linux hacked on first day of Pwn2Own\nThis 130-hour ethical hacking training bundle is only $35\nKali Linux warns of update failures after losing repo signing key\nGet started as an ethical hacker with this $35 course bundle deal"
    },
    {
        "Title": "Zoomcar discloses security breach impacting 8.4 million users",
        "Link": "https://www.bleepingcomputer.com/news/security/zoomcar-discloses-security-breach-impacting-84-million-users/",
        "Summary": "Zoomcar Holdings (Zoomcar) has disclosed via an 8-K form filing with the U.S. Securities and Exchange Commission (SEC) a data breach incident impacting 8.4 million users. [...]",
        "Date": "2025-06-16",
        "Content": "Zoomcar Holdings (Zoomcar) has disclosed that unauthorized accessed its system led to a data breach impacting 8.4 million users.\nThe incident was detected on June 9, after a threat actor emailed company employees alerting them of a cyberattack.\nAlthough there has been no material disruption to services, the company’s internal investigation confirmed that sensitive data belonging to a subset of its customers has been compromised.\nZoomcar is an Indian peer-to-peer car-sharing marketplace that connects car owners with renters across emerging markets in Asia, offering short and medium-term vehicle rentals.\nThe company became a U.S.‑listed, Delaware‑registered public company in late 2023, following a merger with an American blank-check firm IOAC, and its shares are now traded in Nasdaq (ZCAR).\nAdhering to U.S. financial reporting standards, the company is required report the incident to the U.S. Securities and Exchange Commission (SEC).\n“On June 9, 2025, Zoomcar Holdings, Inc. identified a cybersecurity incident involving unauthorized access to its information systems,” the company\ninforms\n.\n“The Company became aware of the incident after certain employees received external communications from a threat actor alleging unauthorized access to Company data.”\nThe results of its preliminary investigation show that the following data for 8.4 million customers has been exposed to an unauthorized party:\nFull name\nPhone number\nCar registration number\nHome address\nEmail address\nZoomcar says that there is no evidence of exposing users’ financial information, plaintext passwords, or any other sensitive data that could lead to the identification of individuals.\nThe company underlined that it is still evaluating of the exact scope and potential impact of the security incident.\nAt this time, the type of the attack hasn’t been determined and no ransomware group has assumed responsibility for the attack at Zoomcar.\nBleepingComputer has asked Zoomcar about the nature of the incident but we received no response.\nIn 2018, Zoomcar suffered another major data breach that exposed records of more than 3.5 million customers, including names, email and IP addresses, phone numbers, and passwords stored as bcrypt hashes.\nThat data was eventually\noffered for sale\non an undeground marketplace in 2020, exposing Zoomcar customers to elevated risks.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nAI is a data-breach time bomb, reveals new report\nOld AT&T data leak repackaged to link SSNs, DOBs to 49M phone numbers\nCartier discloses data breach amid fashion brand cyberattacks\nThe North Face warns customers of April credential stuffing attack\nAdidas warns of data breach after customer service provider hack"
    },
    {
        "Title": "Microsoft shares temp fix for Outlook crashes when opening emails",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-shares-workaround-for-classic-outlook-crashes/",
        "Summary": "Microsoft has shared a workaround for a known issue that causes the classic Outlook email client to crash when opening or starting a new message. [...]",
        "Date": "2025-06-16",
        "Content": "Microsoft has shared a workaround for a known issue that causes the classic Outlook email client to crash when opening or starting a new message.\nThese problems affect users in the Monthly Enterprise Channel who updated Outlook for Microsoft 365 earlier this month, starting with Version 2504 (Build 18730.20122).\n\"When you open or start a new email, classic Outlook crashes. This issue occurs because Outlook cannot open the Forms Library,\" the Outlook team\nsays\nin a support document published on Friday.\n\"The emerging cases for this issue are on virtual desktop infrastructure (VDI). This issue has been escalated for investigation. We will update this topic when we know more.\"\nUntil a fix is rolled out to impacted customers, Redmond advises those affected to manually create the missing FORMS2 folder at C:\\Users\\<username>\\AppData\\Local\\Microsoft\\FORMS2 as a temporary fix.\nTo do that, you have to go through the following steps:\nClose Outlook and other Office applications.\nSelect\nStart\n>\nRun\nand enter the path %localappdata%\\Microsoft and select\nOK\n.\nIn the\nFile Explorer\nmenu, select\nNew\n>\nFolder\nand name it FORMS2.\nMicrosoft is also\ninvestigating a known Outlook issue\nthat causes mailbox folders to flicker and move around when moving items to the folders, starting with version 2505 (Build 18827.20128).\nThose affected are advised to toggle off caching of the shared mailbox by disabling Download Shared Folders as a workaround. However, this will likely cause performance problems since it forces Outlook to work with the shared mailbox offline.\nLast week, the company\npushed a service update\nto fix a bug that triggered Outlook LTSC 2019 crashes when opening Viva Engage, Yammer, Power Automate, and other emails.\nEarlier this year, Microsoft\nshared another temporary fix\nfor crashes affecting classic Outlook when writing, replying to, or forwarding emails and\nrolled out a fix for another known issue\ncausing classic Outlook and Microsoft 365 apps to crash on Windows Server systems.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMicrosoft fixes Outlook paste, blank calendar rendering issues\nMicrosoft announces fix for CPU spikes when typing in Outlook\nWindows 11 24H2 emergency update fixes Easy Anti-Cheat BSOD issue\nMicrosoft: April 2025 updates break Windows Hello on some PCs\nHackers abuse OAuth 2.0 workflows to hijack Microsoft 365 accounts"
    },
    {
        "Title": "Police seizes Archetyp Market drug marketplace, arrests admin",
        "Link": "https://www.bleepingcomputer.com/news/security/police-seizes-archetyp-market-drug-marketplace-arrests-admin/",
        "Summary": "Law enforcement authorities from six countries took down the Archetyp Market, an infamous darknet drug marketplace that has been operating since May 2020. [...]",
        "Date": "2025-06-16",
        "Content": "Law enforcement authorities from six countries took down the Archetyp Market, an infamous darknet drug marketplace that has been operating since May 2020.\nArchetyp Market sellers provided the market's customers with access to high volumes of drugs, including cocaine, amphetamines, heroin, cannabis, MDMA, and synthetic opioids like fentanyl through more than 3,200 registered vendors and over 17,000 listings.\nOver its five years of activity, the marketplace amassed over 612,000 users with a total transaction volume of over €250 million (approximately $289 million) in Monero cryptocurrency transactions.\nAs part of this joint action codenamed '\nOperation Deep Sentinel\n' (led by German police and supported by\nEuropol\nand\nEurojust\n), investigators in the Netherlands took down the marketplace's infrastructure, while a 30-year-old German national suspected of being Archetyp Market's administrator was apprehended in Barcelona, Spain.\nOne Archetyp Market moderator and six of the marketplace's highest vendors were also arrested in Germany and Sweden.\nIn total,\nlaw enforcement officers seized\n47 smartphones, 45 computers, narcotics, and assets worth €7.8 million from all suspects during Operation Deep Sentinel.\nArchetyp Market seizure banner (BleepingComputer)\n​\"Between 11 and 13 June, a series of coordinated actions took place across Germany, the Netherlands, Romania, Spain, Sweden, targeting the platform's administrator, moderators, key vendors, and technical infrastructure. Around 300 officers were deployed to carry out enforcement actions and secure critical evidence,\" Europol said.\n\"With this takedown, law enforcement has taken out one of the dark web's longest-running drug markets, cutting off a major supply line for some of the world's most dangerous substances,\" said Jean-Philippe Lecouffe, Europol's Deputy Executive Director of Operations, on Monday.\nIn May, law enforcement\narrested another 270 suspects\nfollowing an international joint action known as 'Operation RapTor' that targeted dark web vendors and their customers from ten countries.\nDuring the same operation, police officers in Europe, South America, Asia, and the United States also seized more than 2 tonnes of drugs (including amphetamines, cocaine, ketamine, opioids, and cannabis), over €184 million ($207 million) in cash and cryptocurrency, and over 180 firearms.\nThe investigators identified the suspects (many behind thousands of sales on illicit online marketplaces) using intelligence collected following takedowns of multiple dark web markets, including\nNemesis\n,\nBohemia\n, Tor2Door, and\nKingdom Market\n.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nPolice arrests 270 dark web vendors, buyers in global crackdown\n‘Russian Market’ emerges as a go-to shop for stolen credentials\nOperation Secure disrupts global infostealer malware operations\nPolice arrests 20 suspects for distributing child sexual abuse content\nViLE gang members sentenced for DEA portal breach, extortion"
    },
    {
        "Title": "Microsoft: June Windows Server security updates cause DHCP issues",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-june-windows-server-security-updates-cause-dhcp-issues/",
        "Summary": "Microsoft acknowledged a new issue caused by the June 2025 security updates, causing the DHCP service to freeze on some Windows Server systems. [...]",
        "Date": "2025-06-16",
        "Content": "Microsoft acknowledged a new issue caused by the June 2025 security updates, causing the DHCP service to freeze on some Windows Server systems.\nOn Windows Server systems, the Dynamic Host Configuration Protocol (DHCP) Server service automates assigning IP addresses and other network configurations, reducing network administration and ensuring reliable IP address configuration in Windows networks.\nIn affected environments, the new DHCP known issue confirmed by Microsoft over the weekend prevents renewals of unicast IP addresses from applying correctly across network devices.\n\"The DHCP Server service might intermittently stop responding after installing this security update. This issue affects IP renewal for clients,\" the company says in updates added to security advisories issued during this month's Patch Tuesday.\nThe list of affected Windows versions and the updates causing this issue includes:\nWindows Server 2016 (\nKB5061010\n)\nWindows Server 2019 (\nKB5060531\n)\nWindows Server 2022 (\nKB5060526\n)\nWindows Server 2025 (\nKB5060842\n)\n\"We are working on releasing a resolution in the coming days and will provide more information when it is available,\" Microsoft added.\nDuring this month's Patch Tuesday, Redmond addressed another known Windows Server issue that\ntriggered app or service failures\nafter causing some Windows Server 2025 domain controllers to become unreachable after restarts.\nThe June 2025 cumulative updates also\nfixed authentication problems\non Windows Server domain controllers triggered after deploying the April 2025 security updates.\nIn May, Microsoft also\nissued out-of-band updates\nto address a bug causing some Hyper-V virtual machines with Windows 10, Windows 11, and Windows Server to restart or freeze unexpectedly.\nOne month earlier, the company\nreleased another set of emergency updates\nthat resolved a known issue preventing Windows containers from launching on Windows Server 2019, Windows Server 2022, and Windows Server 2025 systems.\nThese launch problems affected only containers under Hyper-V isolation mode, allowing multiple containers to run simultaneously on a single Windows host inside separate virtual machines.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMicrosoft fixes unreachable Windows Server domain controllers\nMicrosoft fixes Windows Server auth issues caused by April updates\nMicrosoft fixes bug causing incorrect Windows Recovery errors\nMicrosoft fixes Windows Server 2025 blue screen, install issues\nWindows 11 24H2 emergency update fixes Easy Anti-Cheat BSOD issue"
    },
    {
        "Title": "Malicious Chimera Turns Larcenous on Python Package Index",
        "Link": "https://www.darkreading.com/application-security/malicious-chimera-pypi",
        "Summary": "Unlike typical data-stealing malware, this attack tool targets data specific to corporate and cloud infrastructures in order to execute supply chain attacks.",
        "Date": "2025-06-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/malicious-chimera-pypi"
    },
    {
        "Title": "Anubis Ransomware-as-a-Service Kit Adds Data Wiper",
        "Link": "https://www.darkreading.com/data-privacy/anubis-ransomware-as-a-service-kit-adds-data-wiper",
        "Summary": "The threat of wiping files and servers clean gives Anubis affiliates yet another way to leverage ransomware victims who may be hesitant to pay to get their data back, Trend Micro said.",
        "Date": "2025-06-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/data-privacy/anubis-ransomware-as-a-service-kit-adds-data-wiper"
    },
    {
        "Title": "Washington Post Staffer Emails Targeted in Cyber Breach",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/washington-post-staffer-emails-targeted-cyber-breach",
        "Summary": "Journalists' Microsoft accounts were breached, which would have given attackers access to emails of staff reporters covering national security, economic policy, and China.",
        "Date": "2025-06-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/washington-post-staffer-emails-targeted-cyber-breach"
    },
    {
        "Title": "'Water Curse' Targets Infosec Pros via Poisoned GitHub Repositories",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/water-curse-targets-cybersecurity-pros-github-repos",
        "Summary": "The emerging threat group attacks the supply chain via weaponized repositories posing as legitimate pen-testing suites and other tools that are poisoned with malware.",
        "Date": "2025-06-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/water-curse-targets-cybersecurity-pros-github-repos"
    },
    {
        "Title": "Security Is Only as Strong as the Weakest Third-Party Link",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/security-strong-weakest-third-party-link",
        "Summary": "Third-party risks are increasing dramatically, requiring CISOs to evolve from periodic assessments to continuous monitoring and treating partner vulnerabilities as their own to enhance organizational resilience.",
        "Date": "2025-06-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/security-strong-weakest-third-party-link"
    },
    {
        "Title": "NIST Outlines Real-World Zero-Trust Examples",
        "Link": "https://www.darkreading.com/endpoint-security/nist-outlines-real-world-zero-trust-examples",
        "Summary": "SP 1800-35 offers 19 examples of how to implement zero-trust architecture (ZTA) using off-the-shelf commercial technologies.",
        "Date": "2025-06-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/nist-outlines-real-world-zero-trust-examples"
    },
    {
        "Title": "Google’s $32 Billion Wiz Deal Draws DOJ Antitrust Scrutiny: Report",
        "Link": "https://www.securityweek.com/googles-32-billion-wiz-deal-draws-doj-antitrust-scrutiny-report/",
        "Summary": "<p>According to reports, the US Department of Justice will assess whether the deal would harm competition in the cybersecurity market.</p>\n<p>The post <a href=\"https://www.securityweek.com/googles-32-billion-wiz-deal-draws-doj-antitrust-scrutiny-report/\">Google’s $32 Billion Wiz Deal Draws DOJ Antitrust Scrutiny: Report</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/googles-32-billion-wiz-deal-draws-doj-antitrust-scrutiny-report/"
    },
    {
        "Title": "Archetyp Dark Web Market Shut Down by Law Enforcement",
        "Link": "https://www.securityweek.com/archetyp-dark-web-market-shut-down-by-law-enforcement/",
        "Summary": "<p>The Archetyp Market drug marketplace has been targeted by law enforcement in an operation involving takedowns and arrests. </p>\n<p>The post <a href=\"https://www.securityweek.com/archetyp-dark-web-market-shut-down-by-law-enforcement/\">Archetyp Dark Web Market Shut Down by Law Enforcement</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/archetyp-dark-web-market-shut-down-by-law-enforcement/"
    },
    {
        "Title": "Asheville Eye Associates Says 147,000 Impacted by Data Breach",
        "Link": "https://www.securityweek.com/asheville-eye-associates-says-147000-impacted-by-data-breach/",
        "Summary": "<p>Asheville Eye Associates says the personal information of 147,000 individuals was stolen in a November 2024 data breach.</p>\n<p>The post <a href=\"https://www.securityweek.com/asheville-eye-associates-says-147000-impacted-by-data-breach/\">Asheville Eye Associates Says 147,000 Impacted by Data Breach</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/asheville-eye-associates-says-147000-impacted-by-data-breach/"
    },
    {
        "Title": "Zoomcar Says Hackers Accessed Data of 8.4 Million Users",
        "Link": "https://www.securityweek.com/zoomcar-says-hackers-accessed-data-of-8-4-million-users/",
        "Summary": "<p>The Indian car sharing marketplace Zoomcar learned that its systems were hacked after a threat actor contacted employees. </p>\n<p>The post <a href=\"https://www.securityweek.com/zoomcar-says-hackers-accessed-data-of-8-4-million-users/\">Zoomcar Says Hackers Accessed Data of 8.4 Million Users</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/zoomcar-says-hackers-accessed-data-of-8-4-million-users/"
    },
    {
        "Title": "240,000 Impacted by Data Breach at Eyecare Tech Firm Ocuco",
        "Link": "https://www.securityweek.com/240000-impacted-by-data-breach-at-eyecare-tech-firm-ocuco/",
        "Summary": "<p>The KillSec ransomware group has stolen hundreds of gigabytes of data from Ireland-based eyecare technology company Ocuco.</p>\n<p>The post <a href=\"https://www.securityweek.com/240000-impacted-by-data-breach-at-eyecare-tech-firm-ocuco/\">240,000 Impacted by Data Breach at Eyecare Tech Firm Ocuco</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/240000-impacted-by-data-breach-at-eyecare-tech-firm-ocuco/"
    },
    {
        "Title": "Anubis Ransomware Packs a Wiper to Permanently Delete Files",
        "Link": "https://www.securityweek.com/anubis-ransomware-packs-a-wiper-to-permanently-delete-files/",
        "Summary": "<p>The emerging Anubis ransomware becomes a major threat, permanently deleting user files and making recovery impossible.</p>\n<p>The post <a href=\"https://www.securityweek.com/anubis-ransomware-packs-a-wiper-to-permanently-delete-files/\">Anubis Ransomware Packs a Wiper to Permanently Delete Files</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/anubis-ransomware-packs-a-wiper-to-permanently-delete-files/"
    },
    {
        "Title": "Red Teaming AI: The Build Vs Buy Debate",
        "Link": "https://www.securityweek.com/red-teaming-ai-the-build-vs-buy-debate/",
        "Summary": "<p>A strong AI deployment starts with asking the right questions, mapping your risks, and thinking like an adversary — before it’s too late.</p>\n<p>The post <a href=\"https://www.securityweek.com/red-teaming-ai-the-build-vs-buy-debate/\">Red Teaming AI: The Build Vs Buy Debate</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/red-teaming-ai-the-build-vs-buy-debate/"
    },
    {
        "Title": "High-Severity Vulnerabilities Patched in Tenable Nessus Agent",
        "Link": "https://www.securityweek.com/high-severity-vulnerabilities-patched-in-tenable-nessus-agent/",
        "Summary": "<p>Three high-severity Tenable Agent vulnerabilities could allow users to overwrite and delete files, or execute arbitrary code, with System privileges.</p>\n<p>The post <a href=\"https://www.securityweek.com/high-severity-vulnerabilities-patched-in-tenable-nessus-agent/\">High-Severity Vulnerabilities Patched in Tenable Nessus Agent</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/high-severity-vulnerabilities-patched-in-tenable-nessus-agent/"
    },
    {
        "Title": "Canadian Airline WestJet Hit by Cyberattack",
        "Link": "https://www.securityweek.com/canadian-airline-westjet-hit-by-cyberattack/",
        "Summary": "<p>A cybersecurity incident at WestJet resulted in users experiencing interruptions when accessing the company’s application and website.</p>\n<p>The post <a href=\"https://www.securityweek.com/canadian-airline-westjet-hit-by-cyberattack/\">Canadian Airline WestJet Hit by Cyberattack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/canadian-airline-westjet-hit-by-cyberattack/"
    },
    {
        "Title": "Moser Engineering and SPG Construction Allegedly Targeted by Qilin Ransomware",
        "Link": "https://dailydarkweb.net/moser-engineering-and-spg-construction-allegedly-targeted-by-qilin-ransomware/",
        "Summary": "The Qilin ransomware group has allegedly targeted two American companies, Moser Engineering and SPG Construction LLC, adding them to its dark web leak site. The group has threatened to release the full cache of stolen data unless the companies establish contact. This double attack highlights the persistent and indiscriminate nature of ransomware gangs, targeting vital [&#8230;]",
        "Date": "2025-06-16",
        "Content": "The Qilin ransomware group has allegedly targeted two American companies, Moser Engineering and SPG Construction LLC, adding them to its dark web leak site. The group has threatened to release the full cache of stolen data unless the companies establish contact. This double attack highlights the persistent and indiscriminate nature of ransomware gangs, targeting vital players in both the manufacturing and industrial construction sectors. The initial leaks include sensitive documents from both companies, suggesting a significant data breach.\nMoser Engineering, a prominent manufacturer of high-performance rear-ends, drive-line components, and braking systems for the automotive aftermarket industry, is one of the victims. The company is a key supplier for racers and car enthusiasts. SPG Construction LLC, the second victim, specializes in heavy industrial construction and the implementation of process systems for capital-intensive projects across the United States. They serve major clients in critical sectors such as minerals, food and beverage, and industrial water treatment. The alleged breach could expose proprietary and financial information, posing a risk to the companies’ operations and their clients.\nThe threat actors have published a sample of the data allegedly exfiltrated from both companies. For Moser Engineering, the leaked files appear to include:\nFinancial spreadsheets detailing sales and assets\nTechnical drawings and CAD files of components\nInternal merchant billing statements\nInventory and parts management documents\nFor SPG Construction LLC, the initial data leak allegedly contains:\nCertificates of liability insurance\nDetailed project blueprints and technical diagrams\nPurchase orders and other financial agreements\nBank reconciliation statements\nSpreadsheets with project hours and labor costs\nTags:\nCyberSecurity\ndata-breach\ndata-leak\nindustrial construction\nManufacturing\nMoser Engineering\nQilin\nransomware\nSPG Construction"
    },
    {
        "Title": "Major Darknet Marketplace Archetyp Seized Administrator Arrested",
        "Link": "https://dailydarkweb.net/major-darknet-marketplace-archetyp-seized-administrator-arrested/",
        "Summary": "A significant blow has been dealt to the online narcotics trade as international law enforcement agencies have seized the Archetyp darknet market and arrested its alleged administrator. The operation, a coordinated effort led by German authorities with support from Europol and Eurojust, saw the takedown of one of the world&#8217;s largest and longest-running illegal online marketplaces. [&#8230;]",
        "Date": "2025-06-16",
        "Content": "A significant blow has been dealt to the online narcotics trade as international law enforcement agencies have seized the Archetyp darknet market and arrested its alleged administrator. The operation, a coordinated effort led by German authorities with support from Europol and Eurojust, saw the takedown of one of the world’s largest and longest-running illegal online marketplaces. The alleged administrator, a 30-year-old German national, was apprehended in Spain, while the market’s servers, hosted in the Netherlands, were taken offline. This action effectively shutters a platform that boasted over 600,000 user accounts and more than 3,200 vendor shops.\nArchetyp was a prominent hub for the sale of illicit goods, primarily narcotics, with an estimated turnover of at least €250 million. The marketplace was particularly notorious for being one of the few that permitted the sale of dangerous substances like fentanyl, contributing significantly to the online drug trade. The platform’s extensive user base and long operational history since its inception in 2021 made it a key target for law enforcement. The seizure of Archetyp’s infrastructure means that a vast amount of data has allegedly fallen into the hands of investigators, which could lead to further arrests and disruption of criminal networks.\nAs a result of the international operation, authorities now allegedly possess a trove of data from the marketplace’s servers. The information seized is believed to include:\nUser account details, including usernames and encrypted passwords\nVendor profiles and sales histories\nDetailed cryptocurrency transaction records\nPrivate messages between buyers and sellers\nListings for illicit goods and services\nTags:\nArchetyp\ncybercrime\nCyberSecurity\ndarknet\nEurojust\nEuropol\nlaw enforcement\nmarketplace\nnarcotics\nseizure"
    },
    {
        "Title": "TBN Israel Allegedly Hacked by Handala Hacking Group",
        "Link": "https://dailydarkweb.net/tbn-israel-allegedly-hacked-by-handala-hacking-group/",
        "Summary": "Handala Hacking group has claimed responsibility for a significant data breach allegedly targeting TBN Israel, a media organization describing itself as a faith-based network. The group announced the breach, alleging to have exfiltrated 542GB of data from the company&#8217;s internal systems. TBN Israel is a prominent religious media entity that broadcasts content to both local [&#8230;]",
        "Date": "2025-06-16",
        "Content": "Handala Hacking group has claimed responsibility for a significant data breach allegedly targeting TBN Israel, a media organization describing itself as a faith-based network. The group announced the breach, alleging to have exfiltrated 542GB of data from the company’s internal systems. TBN Israel is a prominent religious media entity that broadcasts content to both local and international audiences.\nThe hackers claim the compromised data reveals sensitive information. The group alleges the leaked materials show the organization’s purported role in coordinating censorship, disseminating state-approved narratives, and engaging in information warfare. They contend that the breach exposes the true nature of the network’s operations.\nThe allegedly leaked data is said to include:\nInternal documents\nPrivate communications\nTags:\nallegedly\ncyber-attack\ndata-breach\nHandala Group\nTBN Israel"
    },
    {
        "Title": "Major Israeli Energy Companies Delkol and Delek Allegedly Breached by Handala Hacker Group",
        "Link": "https://dailydarkweb.net/major-israeli-energy-companies-delkol-and-delek-allegedly-breached-by-handala-hacker-group/",
        "Summary": "A hacker group calling itself &#8220;Handala&#8221; has allegedly breached the systems of two major players in Israel&#8217;s energy sector, Delkol and Delek Group. The group claims to have exfiltrated a massive trove of sensitive data, raising concerns about the security of the nation&#8217;s critical infrastructure. The alleged attack, which was announced on June 15, 2025, [&#8230;]",
        "Date": "2025-06-16",
        "Content": "A hacker group calling itself “Handala” has allegedly breached the systems of two major players in Israel’s energy sector, Delkol and Delek Group. The group claims to have exfiltrated a massive trove of sensitive data, raising concerns about the security of the nation’s critical infrastructure. The alleged attack, which was announced on June 15, 2025, purportedly targeted what the hackers referred to as “Israel’s fuel supply system,” threatening to expose confidential information and disrupt fuel availability.\nDelkol is a veteran Israeli company specializing in the manufacturing of lubricants and oils for a wide range of vehicular and industrial applications, making it a key supplier for the country’s transportation and industrial sectors. Delek Group is a dominant force in the Israeli energy market, with its subsidiary, Delek Israel, operating one of the largest chains of fuel stations in the country. The conglomerate also has extensive interests in oil and gas exploration and production, positioning it as a cornerstone of Israel’s energy independence. The alleged breach of these two entities could therefore have significant ramifications for the Israeli economy and its security.\nThe “Handala” hack team, a group with pro-Palestinian affiliations known for its cyberattacks against Israeli targets, claimed responsibility for the intrusion. In their announcement, the hackers alleged the theft of over two terabytes of data, including 300,000 classified documents. They warned of the vulnerability of Israel’s fuel stations and hinted at extensive collaboration between the Delek Group and the Israeli military. The group has threatened to leak the stolen data, which allegedly includes:\nClassified documents\nDetailed fuel supply contracts with the Israeli military\nAccess to updated internal databases\nThis incident follows a pattern of cyberattacks by “Handala” against various Israeli organizations. While the full extent and validity of the claims are yet to be officially confirmed, the alleged breach of two such prominent companies in the energy sector has drawn significant attention.\nTags:\nCritical Infrastructure\nCyberSecurity\ndata-breach\nDelek Group\nDelkol\nenergy sector\nHandala\nIsrael"
    },
    {
        "Title": "Almarai, Leading Saudi Food Giant, Allegedly Hit by Massive Data Breach",
        "Link": "https://dailydarkweb.net/almarai-leading-saudi-food-giant-allegedly-hit-by-massive-data-breach/",
        "Summary": "A major cybersecurity incident has allegedly struck Almarai, one of the largest food and beverage manufacturers in the Middle East. A threat actor has claimed to have breached the database of the Saudi-based multinational dairy company and has put the data up for sale online. Almarai, a publicly traded company on the Tadawul stock exchange [&#8230;]",
        "Date": "2025-06-16",
        "Content": "A major cybersecurity incident has allegedly struck Almarai, one of the largest food and beverage manufacturers in the Middle East. A threat actor has claimed to have breached the database of the Saudi-based multinational dairy company and has put the data up for sale online. Almarai, a publicly traded company on the Tadawul stock exchange with a reported revenue of over $5 billion in 2023, is a household name in Saudi Arabia and a critical part of the region’s food supply chain. The breach was announced on an online forum on June 16, 2025, with the seller claiming to possess live access to the company’s database.\nThe perpetrator of the alleged breach is offering the data for a single sale, suggesting the information is comprehensive and valuable. According to samples provided by the seller, the compromised database contains a vast amount of sensitive customer and corporate information. The potential exposure of this data could pose significant risks to Almarai’s customers, partners, and business operations, potentially leading to financial fraud, identity theft, and targeted corporate espionage.\nThe allegedly leaked data includes a wide array of sensitive details, such as:\nFull customer personal and contact information (Name, mobile, email, address)\nDetailed location data including GPS coordinates (latitude and longitude)\nCustomer financial and credit information (Credit limit, credit days, payment mode)\nCommercial registration numbers and VAT registration details\nBusiness owner and shopkeeper names\nInternal route, depot, and service information\nTags:\nAlmarai\nCyberSecurity\ndatabreach\ninfosec\nSaudi Arabia"
    },
    {
        "Title": "French Hospital Hôpital Privé de la Miotte Allegedly Breached, Data of Over 100K Patients for Sale",
        "Link": "https://dailydarkweb.net/french-hospital-hopital-prive-de-la-miotte-allegedly-breached-data-of-over-100k-patients-for-sale/",
        "Summary": "A threat actor has allegedly posted a database containing the sensitive information of more than 103,000 patients from Hôpital Privé de la Miotte for sale on a dark web forum. The hospital is part of the Vivalto Santé group, one of the largest private hospital providers in France, highlighting the significance of the potential breach. [&#8230;]",
        "Date": "2025-06-16",
        "Content": "A threat actor has allegedly posted a database containing the sensitive information of more than 103,000 patients from Hôpital Privé de la Miotte for sale on a dark web forum. The hospital is part of the Vivalto Santé group, one of the largest private hospital providers in France, highlighting the significance of the potential breach. The compromised data, if authentic, could expose a large number of individuals to various cyber threats, including identity theft, phishing scams, and other fraudulent activities.\nThe post, made on a notorious hacking forum, claims to be selling the entire patient database in a single transaction. The seller provided samples of the data to prove the legitimacy of their claims. The exposure of such detailed personal and medical-adjacent information is a severe privacy violation and poses a significant risk to the affected patients. This incident underscores the ongoing trend of cybercriminals targeting the healthcare sector, which holds highly valuable and sensitive data.\nThe compromised database allegedly includes a wide range of personally identifiable information (PII). The types of leaked data listed by the threat actor include:\nFirst Name\nLast Name\nBirthdate\nPhone Number\nEmail Address\nPhysical Address\nCity\nZipcode\nData creation and update timestamps\nTags:\nCyberSecurity\ndata-breach\nFrance\nHealthcare\npatient data\nPII\nVivalto Santé"
    },
    {
        "Title": "APTiran Allegedly Hits Israeli Critical Infrastructure with Ransomware",
        "Link": "https://dailydarkweb.net/aptiran-allegedly-hits-israeli-critical-infrastructure-with-ransomware/",
        "Summary": "A hacking collective identifying as APTiran has allegedly launched a significant cyber campaign against Israel, claiming to have breached government, academic, and other critical infrastructure. In a series of online posts, the group cited the ongoing geopolitical conflict as their motive, stating the attacks are retaliation for Israeli military actions. The targeted entities, including government [&#8230;]",
        "Date": "2025-06-16",
        "Content": "A hacking collective identifying as APTiran has allegedly launched a significant cyber campaign against Israel, claiming to have breached government, academic, and other critical infrastructure. In a series of online posts, the group cited the ongoing geopolitical conflict as their motive, stating the attacks are retaliation for Israeli military actions. The targeted entities, including government ministries and universities, are fundamental to Israel’s national security and civil society, making the alleged breaches a serious national concern.\nThe group claims to be using destructive, “one-way” ransomware attacks with strains like ALPHV and LockBit, suggesting their goal is to cause widespread disruption rather than seek a payout. The attackers have also allegedly targeted hospital servers and financial sector systems. As part of their campaign, the hackers have threatened to turn infected devices belonging to government entities and ordinary citizens into a large-scale “zombie” network.\nThe group allegedly leaked vast amounts of sensitive data to substantiate their claims, including:\nOver 350,000 login credentials for Israeli government (\n.gov.il\n) systems.\nApproximately 300 databases allegedly exfiltrated from Israeli servers.\nNumerous login credentials for various Israeli academic (\n.ac.il\n) institutions.\nTags:\nALPHV\nAPTiran\nCritical Infrastructure\nCyber War\nCyberSecurity\ndata-breach\nIran\nIsrael\nLockBit\nransomware"
    }
]