[
    {
        "Title": "Qilin Ransomware Adds \"Call Lawyer\" Feature to Pressure Victims for Larger Ransoms",
        "Link": "https://thehackernews.com/2025/06/qilin-ransomware-adds-call-lawyer.html",
        "Summary": "The threat actors behind the Qilin ransomware-as-a-service (RaaS) scheme are now offering legal counsel for affiliates to put more pressure on victims to pay up, as the cybercrime group intensifies its activity and tries to fill the void left by its rivals.\nThe new feature takes the form of a \"Call Lawyer\" feature on the affiliate panel, per Israeli cybersecurity company Cybereason.\nThe",
        "Date": "2025-06-20",
        "Content": "The threat actors behind the Qilin ransomware-as-a-service (RaaS) scheme are now offering legal counsel for affiliates to put more pressure on victims to pay up, as the cybercrime group intensifies its activity and tries to fill the void left by its rivals.\nThe new feature takes the form of a \"Call Lawyer\" feature on the affiliate panel, per Israeli cybersecurity company Cybereason.\nThe development represents a\nnewfound resurgence\nof the e-crime group as once-popular ransomware groups like LockBit, Black Cat, RansomHub, Everest, and BlackLock have suffered abrupt cessations, operational failures, and defacements. The group, also tracked as Gold Feather and Water Galura, has been active since October 2022.\nData compiled from the dark web leak sites run by ransomware groups shows that Qilin led with 72 victims in April 2025. In May, it is estimated to be behind\n55 attacks\n, putting it behind\nSafepay\n(72) and\nLuna Moth\n(67). It's also the third most active group after Cl0p and Akira since the start of the year, claiming a total of\n304 victims\n.\n\"Qilin stands above the rest with its rapidly rising marketplace due to a mature ecosystem, extensive support options for clients, and robust solutions to ensure highly targeted, high-impact ransomware attacks designed to demand substantial payouts,\" Qualys\nsaid\nin an analysis of the group this week.\nThere is evidence to suggest that affiliates working for RansomHub have migrated to Qilin, contributing to the spike in Qilin ransomware activity in recent months.\n\"With a growing presence across forums and ransomware activity trackers, Qilin operates a technically mature infrastructure: payloads built in Rust and C, loaders with advanced evasion features, and an affiliate panel offering Safe Mode execution, network spreading, log cleanup, and automated negotiation tools,\" researchers Mark Tsipershtein and Evgeny Ananin\nsaid\n.\n\"Beyond the malware itself, Qilin offers spam services, PB-scale data storage, legal guidance, and a full set of operational features—positioning itself not just as a ransomware group, but as a full-service cybercrime platform.\"\nThe decline and demise of other groups have been complemented by new updates to the Qilin affiliate panel, incorporating a new legal assistance function, a team of in-house journalists, and the ability to conduct distributed denial-of-service (DDoS) attacks. Another notable addition is a tool for spamming corporate email addresses and phone numbers.\nThe feature expansion indicates an attempt on the part of the threat actors to market themselves as a full-fledged cybercrime service that goes beyond just ransomware.\n\"If you need legal consultation regarding your target, simply click the 'Call lawyer' button located within the target interface, and our legal team will contact you privately to provide qualified legal support,\" reads a translated version of a forum post announcing the new capabilities.\n\"The mere appearance of a lawyer in the chat can exert indirect pressure on the company and increase the ransom amount, as companies want to avoid legal proceedings.\"\nThe development comes as Intrinsec\nassessed\nthat at least one affiliate of Rhysida has started using an\nopen-source utility\nnamed\nEye Pyramid C2\nlikely as a post-compromise tool to maintain access to compromised endpoints and deliver additional payloads.\nIt's worth noting that the\nEye Pyramid C2\nrefers to the same\nPython-based backdoor\nthat was deployed by threat actors linked to the RansomHub crew in Q4 2024.\nIt also follows a fresh analysis of the\nleaked Black Basta chat logs\n, which has shed light on a threat actor who went by the online alias \"tinker.\" Their real-world identity is presently unknown.\nTinker, per Intel 471, is said to be one of the trusted aides of tramp, the group's leader, and joined the criminal enterprise as a \"creative director\" after having prior experience running call centers, including for the now-defunct Conti group, and as a negotiator for BlackSuit (aka Royal).\n\"The actor tinker played an important role in securing initial access to organizations,\" the cybersecurity company\nsaid\n. \"The leaked conversations reveal tinker would analyze the financial data and evaluate a victim's situation before direct negotiations.\"\nThe threat actor, besides conducting open-source research to obtain contact information for the company's senior staff in order to extort them either via phone calls or messages, was tasked with writing phishing emails designed to breach organizations.\nTinker, notably, also came up with the\nMicrosoft Teams-based phishing scenario\n, wherein the attackers would masquerade as an IT department employee, warning victims that they are at the receiving end of a spam attack and urging the employees to install remote desktop tools like AnyDesk and grant them access to purportedly secure their systems.\n\"After the RMM software was installed, the caller would contact one of Black Basta's penetration testers, who would then move to secure persistent access to the system and domain,\" Intel 471 said.\nThe leaked messages also reveal that tinker received no less than $105,000 in cryptocurrency for their efforts between December 18, 2023, and June 16, 2024. That said, it's currently not clear what group they may be working for.\nThe findings coincide with the\nextradition\nof an unnamed 33-year-old foreign member of the\nRyuk\nransomware group to the United States for their alleged role as an initial access broker (IAB) and facilitating access to corporate networks. The suspect was arrested from Kyiv earlier this April at the request of U.S. law enforcement.\nThe\nmember\n\"was engaged in the search for vulnerabilities in the corporate networks of the victim enterprises,\" the National Police of Ukraine\nsaid\nin a statement. \"The data obtained by the hacker was used by his accomplices to plan and carry out cyber attacks.\"\nAuthorities said they were able to trace the suspect following a forensic analysis of equipment seized in a previous raid that\ntook place in November 2023\ntargeting members of the LockerGoga, MegaCortex, and Dharma ransomware families.\nElsewhere, police officials in Thailand have apprehended several Chinese nationals and other Southeast Asian suspects after raiding a hotel in Pattaya that was used as a gambling den and as an offices to conduct ransomware operations.\nThe ransomware scheme is said to have been run by six Chinese nationals, who sent malicious links to companies in order to infect them with ransomware. Local media reports\nsay\nthey were employees of a cybercrime gang, who were paid to distribute the booby-trapped links to Chinese firms.\nThailand's Central Investigation Bureau (CIB), this week, also\nannounced\nthe arrest of more than a dozen foreigners as part of Operation Firestorm for allegedly running an online investment scam that defrauded several victims in Australia by calling them and deceiving them into investing their money in long-term bonds with a promise of high returns.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Iran's State TV Hijacked Mid-Broadcast Amid Geopolitical Tensions; $90M Stolen in Crypto Heist",
        "Link": "https://thehackernews.com/2025/06/irans-state-tv-hijacked-mid-broadcast.html",
        "Summary": "Iran's state-owned TV broadcaster was hacked Wednesday night to interrupt regular programming and air videos calling for street protests against the Iranian government, according to multiple reports.\nIt's currently not known who is behind the attack, although Iran pointed fingers at Israel, per Iran International.\n\"If you experience disruptions or irrelevant messages while watching various TV",
        "Date": "2025-06-20",
        "Content": "Iran's state-owned TV broadcaster was hacked Wednesday night to interrupt regular programming and air videos calling for street protests against the Iranian government, according to multiple reports.\nIt's currently not known who is behind the attack, although Iran pointed fingers at Israel, per Iran International.\n\"If you experience disruptions or irrelevant messages while watching various TV channels, it is due to enemy interference with satellite signals,\" the broadcaster was\nquoted\nas saying.\nThe breach of state television is the latest in a\nstring of cyber attacks\ninside Iran that have been attributed to Israel-linked actors. It also coincides with the hack of Bank Sepah and Nobitex, Iran's largest cryptocurrency exchange.\nThe Nobitex breach led to the theft of more than $90 million, a brazen escalation in the cyber war that has simmered between Israel and Iran for more than a decade.\n\"Iranian entities have experimented with virtual assets as both a financial workaround and as a strategic asset to support broader geopolitical ambitions — including the proliferation of advanced weapons technology,\" TRM Labs\nsaid\n. \"This latest incident highlights how crypto exchanges, once peripheral to conflict, are increasingly becoming strategic targets for geopolitical actors.\"\nThe latest development also follows the revelation from Israeli officials that Iran is hijacking private security cameras installed in Israel to gather real-time intelligence, mirroring a similar tactic used by Russia after its invasion of Ukraine in 2022.\n\"We know that in the past two or three days, the Iranians have been trying to connect to cameras to understand what happened and where their missiles hit to improve their precision,\" Refael Franco, the former deputy director general of the Israel National Cyber Directorate,\nsaid\n.\nGroups claiming DDoS attacks targeting Israel between June 13 and June 18, 2025 | Source: Radware\nCybersecurity firm Radware\nsaid\nnearly 40% of all hacktivist DDoS activity has been directed against Israel since the onset of the latest flare-up. On June 17, the hacktivist group DieNet warned it would launch cyber-attacks at the United States should it join the conflict against Iran.\nThe message has since been amplified by other groups like Arabian Ghosts, Sylhet Gang, and Team Fearless, suggesting that these entities are forming a potential collaboration in cyberspace as battle rages on the ground.\n\"Companies are urged to take maximum vigilance. The warning signs are clear. Critical infrastructure, supply chains, and even global businesses could become collateral targets if the cyber crossfire intensifies,\" said Pascal Geenens, director of threat intelligence at Radware.\n\"The Israel-Iran conflict of 2025 is a stark illustration of modern hybrid warfare, where bytes and narratives are as much a part of the fight as bombs and missiles.\"\nIn a\ntwo-part\nanalysis\n, CloudSEK said more than 35 distinct pro-Iranian groups have launched coordinated attacks against Israeli infrastructure, as opposed to only less than half-a-dozen pro-Israeli groups engaging in hacktivist activity.\n\"The attacks predominantly consisted of DDoS assaults, website defacements, and claimed data breaches targeting government sites, military systems, and critical infrastructure,\" security researcher Pagilla Manohar Reddy said.\n\"Most significantly, these recent attacks maintain the same pattern of exaggeration and disinformation that has characterized the broader hacktivist ecosystem, with groups continuing to take credit for unrelated service outages, recycle old data leaks, and inflate damage claims for media attention rather than achieving substantial operational impact.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "6 Steps to 24/7 In-House SOC Success",
        "Link": "https://thehackernews.com/2025/06/6-steps-to-247-in-house-soc-success.html",
        "Summary": "Hackers never sleep, so why should enterprise defenses? Threat actors prefer to target businesses during off-hours. That’s when they can count on fewer security personnel monitoring systems, delaying response and remediation.\nWhen retail giant Marks &amp; Spencer experienced a security event over Easter weekend, they were forced to shut down their online operations, which account for",
        "Date": "2025-06-20",
        "Content": "Hackers never sleep, so why should enterprise defenses? Threat actors prefer to target businesses during off-hours. That's when they can count on fewer security personnel monitoring systems, delaying response and remediation.\nWhen retail giant\nMarks & Spencer\nexperienced a security event over Easter weekend, they were forced to shut down their online operations, which account for approximately a third of the retailer's clothing and home sales.\nAs most staff are away during off-hours and holidays, it takes time to assemble an incident response team and initiate countermeasures. This gives attackers more time to move laterally within the network and wreak havoc before the security team reacts.\nWhile not every organization may be ready to staff an in-house team around the clock, building a 24/7 SOC remains one of the most robust and proactive ways to protect against off-hours attacks. In the rest of this post, we'll explore why 24/7 vigilance is so important, the challenges of achieving it, and six practical steps 24/7 SOC success.\nImportance and challenges of a 24/7 SOC\nA SOC is central to an organization's cyber defense. It plays a key role in detecting, investigating, and responding to potential threats around the clock, providing real-time threat detection and resolution. Add in automation, and it only gets better, especially when everyone is away celebrating or concentrating on their weekend chores.\nBut running a 24/7 SOC isn't straightforward. It requires a perfect balance of proven processes, advanced tools, and skilled professionals.\nProper planning and automation is key\nWherever security professionals can't keep up with the demands of a changing attack surface, AI can make a difference. Together with the right people and processes in place, AI enables efficiency by automating threat detection, resulting in faster response times and enhancing your overall security posture. Let's look at building the right processes and where AI fits in.\n6 step approach for building a 24/7 SOC\nRunning a successful SOC comes down to the following six measures your organization will need to realize.\n1. Build a foundation specific to your organization\nEstablishing a robust 24/7 SOC starts with defining a clear mission and scope that's aligned with overall business goals. Having a clear strategy helps determine security coverage requirements.\nAs budgets will dictate who gets hired and what security tools are integrated, making a strong case for 24/7 security monitoring is critical. Given recent examples of cyberattacks with devastating consequences, this shouldn't be difficult.\nThe best SOC model for your business will depend on its risk profile, compliance and industry requirements, and available resources.\nThe SOC's scope and objectives will also be business- and industry-specific.\nFor example, a healthcare provider will prioritize protecting patient data to ensure compliance with HIPAA, while a retailer will concentrate on PCI DSS.\nAlso, whether you choose an in-house, hybrid, or outsourced model, security teams should leverage AI. It can scale your model to optimize security operations and help defend against rapidly evolving threats. For example, a hybrid SOC with AI-powered SOC analysis can be highly efficient.\n2. Build the right team and train them well\nOrganizations have to create a team that's up to the task of facing security challenges. Hiring managers should focus on a mix of junior analysts and seasoned responders, as diversity helps foster collaboration.\nSOC teams often follow a three-tiered structure of\nTier 1 analysts\nfor alert triage;\nTier 2 analysts\nresponsible for investigation and response; and\nTier 3 analysts\nfor strategy, advanced threat hunting, proactive detection, and AI tool optimization. If resources are limited, a two-tier model can also be effective—Tier 1 handles triage and initial investigation, while Tier 2 takes on deeper analysis, response, and strategic functions. This approach can still deliver strong coverage with the right tooling and processes in place.\nIt's also better to hire internally whenever possible. Develop an internal talent pipeline and budget for ongoing training and certification for those who want to upskill. For example, team members can learn to use AI tools to overcome SIEM's costly log management and SOAR's complex configuration challenges.\n3. Be smart about shift rotations to avoid burnout\nSOC teams are known to\nburn out quickly\n. Developing sustainable shift rotations with 8- or 12-hour shifts is important. For example, a SOC team can work on a 4-on, 4-off schedule to stay alert, while multinationals can spread shifts across time zones to reduce the risk of fatigue.\nHire more analysts than you think you'll need\n—many are paid per shift, and having a bench ensures you can rotate effectively, cover unexpected absences, and reduce pressure on your core team. This approach gives you flexibility without overextending your staff.\nSecurity professionals also need variety to keep things interesting and stay engaged. So, regularly rotate responsibilities like alert triage, playbook review, and threat hunting.\nNote:\nMake sure to establish clear handoff protocols to encourage overlapping handover periods. This helps nurture an environment of context sharing between teams.\nAs fatigue often leads to a staffing exodus, automation can play a vital role in retaining top security talent. Use AI to reduce the team's workload, automating repetitive tasks like log analysis or phishing triage.\nWellness programs can offer a big boost, too. Encouraging work/life balance and establishing anonymous feedback channels will improve retention. Also, schedule downtime and encourage actual breaks. Make sure to emphasize that there's no reason to work through scheduled breaks unless there's an active incident.\nLastly, rewarding team members and recognizing wins are important. These boost job satisfaction, helping you retain talent.\n4. Choose the right tools\nThoroughly research and choose AI-driven security tools that fit your specific business needs and security requirements. It's also imperative to consider different variables like cost and complexity before settling on a tool.\nFor example, SIEMs like Splunk are known to have scaling challenges and high log management costs. This can be unsustainable in multi-cloud environments. Elastic's Attack Discovery is also known to have a lot of false positives, forcing analysts to manually validate outputs.\nAlthough many AI-powered tools minimize manual effort, they still require significant setup, rule tuning, data onboarding, and dashboard customization. Some features may also require analysts to configure data sources and interpret results. Many SOC tools are static, with pre-trained models for just a handful of use cases.\nExisting SOARs additionally require considerable configuration and maintenance, while their static playbooks can't adaptively learn to deal with new threats.\nRadiant\nis one alternative. Its adaptive AI SOC platform ingests, triages, and escalates when an alert is deemed a true positive. It will then respond fast to actual threats and various security use cases.\nAside from being cost-effective and requiring no maintenance, Radiant integrates back into customers' environments for 1-click or fully automatic remediation (once the SOC team is confident with Radiant's recommendations). Plus, it doesn't require audits or retraining to stay on top of the latest malware.\n5. Cultivate a culture of continuous learning\nWhile security leadership should encourage post-mortems, they need to avoid assigning blame. Every security event has much to teach us, and organizations need to actively store this information in a knowledge base.\nContinuous learning is your ticket to staying ahead of threats. So, make sure to offer seamless access to research and training, and sponsor certifications like GIAC Intrusion Analyst certification (GCIA) and Offensive Security Certified Professional (OSCP).\nCreate a team culture where members cross-pollinate knowledge and build trust. Hold regular threat briefings and security drills (e.g., red team vs. blue team simulations) to identify process gaps and improve escalation paths.\nThese drills will help each team member quickly act if the organization comes under attack. It's also important to practice coordination with Legal, PR, and IT teams. Tabletop exercises for executives, i.e., testing the decision-making process under pressure, are also a great idea.\n6. Governance, metrics, and reporting\nDefine success metrics, including MTTD/MTTR, AI accuracy, and false positive rate. Faster detection limits damage, and rapid response minimizes the impact of an incident. If the AI is highly accurate, it helps build trust in automation. At the same time, low false positives reduce analysts' workload.\nEquitable workload distribution and alert volume across SOC shifts ensure balance and lower the risk of burnout. Tracking incident statistics isn't enough. You also have to continuously monitor employee well-being: A healthy SOC team means high morale and consistent performance.\nFor all the above, real-time dashboards and monthly reviews are a must. Provide visuals whenever possible and include deep dives for team leads. SOC managers and T3 analysts need comprehensive insights to optimize tools, better align compliance and business risk, and manage team health.\nConclusion\nThe synergy of skilled personnel, streamlined processes, advanced AI, and integrated tools is the underlying force that keeps your company name out of the headlines.\nA 24/7 AI-powered SOC protects organizations from rapidly evolving, advanced, persistent threats. It will help you successfully address the limitations of SIEMs, SOARs, EDRs, and SOC co-pilots through the seamless integration of automation, people, processes, and tools.\nRadiant's unique\nadaptive AI SOC platform\nstreamlines processes and empowers analysts, threat hunters, and security specialists. The platform's no-retrain automation and >95% accuracy help SOC teams overcome a variety of hurdles: EDR's limited scope, co-pilots' analyst dependency, SIEM's costly complexity, and SOAR's manual playbooks, to name a few.\nIt's also scalable and cost-effective with a wide range of integrations.\nIf you want to see Radiant in action, it's just a click away.\nBook a demo\ntoday.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Massive 7.3 Tbps DDoS Attack Delivers 37.4 TB in 45 Seconds, Targeting Hosting Provider",
        "Link": "https://thehackernews.com/2025/06/massive-73-tbps-ddos-attack-delivers.html",
        "Summary": "Cloudflare on Thursday said it autonomously blocked the largest distributed denial-of-service (DDoS) attack ever recorded, which hit a peak of 7.3 terabits per second (Tbps).\nThe attack, which was detected in mid-May 2025, targeted an unnamed hosting provider.\n\"Hosting providers and critical Internet infrastructure have increasingly become targets of DDoS attacks,\" Cloudflare's Omer Yoachimik",
        "Date": "2025-06-20",
        "Content": "Cloudflare on Thursday said it autonomously blocked the largest distributed denial-of-service (DDoS) attack ever recorded, which hit a peak of 7.3 terabits per second (Tbps).\nThe attack, which was detected in mid-May 2025, targeted an unnamed hosting provider.\n\"Hosting providers and critical Internet infrastructure have increasingly become targets of DDoS attacks,\" Cloudflare's Omer Yoachimik\nsaid\n. \"The 7.3 Tbps attack delivered 37.4 terabytes in 45 seconds.\"\nEarlier this January, the web infrastructure and security company\nsaid\nit had mitigated a 5.6 Tbps DDoS attack aimed at an unnamed internet service provider (ISP) from Eastern Asia. The attack originated from a Mirai-variant botnet in October 2024.\nThen in April 2025, Cloudflare\nrevealed\nit defended against a massive 6.5 Tbps flood that likely emanated from Eleven11bot, a botnet comprising roughly 30,000 webcams and video recorders. The hyper-volumetric attack lasted about 49 seconds.\nThe 7.3 Tbps DDoS attack, in comparison, carpet-bombed an average of 21,925 destination ports of a single IP address owned and used by the hosting provider, hitting a crest of 34,517 destination ports per second.\nThe multi-vector attack originated from a similar distribution of source ports and has been identified as a combination of UDP flood, QOTD reflection attack, echo reflection attack, NTP reflection attack, Mirai UDP flood attack, portmap flood, and RIPv1 amplification attack. The UDP flood accounted for 99.996% of the attack traffic.\nCloudflare also pointed out that the attack came from over 122,145 source IP addresses spanning 5,433 Autonomous Systems (AS) across 161 countries. The top sources of attack traffic included Brazil, Vietnam, Taiwan, China, Indonesia, Ukraine, Ecuador, Thailand, the United States, and Saudi Arabia.\n\"The average number of unique source IP addresses per second was 26,855 with a peak of 45,097,\" Yoachimik said.\n\"Telefonica Brazil (AS27699) accounted for the largest portion of the DDoS attack traffic, responsible for 10.5% of the total. Viettel Group (AS7552) follows closely with 9.8%, while China Unicom (AS4837) and Chunghwa Telecom (AS3462) contributed 3.9% and 2.9% respectively. China Telecom (AS4134) accounted for 2.8% of the traffic.\"\nThe disclosure comes as the QiAnXin XLab team\nsaid\nthe DDoS botnet tracked as RapperBot was behind an attack aimed at artificial intelligence (AI) company\nDeepSeek\nin February 2025, and that the latest samples of the malware attempt to extort victims, demanding they pay \"protection fees\" to avoid being targeted by DDoS attacks in the future.\nChina, the United States, Israel, Mexico, the United Kingdom, Greece, Iran, Australia, Malaysia, and Thailand are the primary countries where devices infected by RapperBot are located. The botnet is known to be\nactive since 2022\n.\nRapperBot campaigns are known to target routers, network-attached storage devices, and video recorders with default weak passwords or firmware vulnerabilities to obtain initial access, and drop malware that can establish contact with a remote server over\nDNS TXT records\nto fetch DDoS attack commands.\nThe malware also makes use of custom encryption algorithms to encrypt the TXT records and command-and-control (C2) domain names used.\n\"Since March, its attack behavior has been significantly active, with an average of more than 100 attack targets per day and more than 50,000 bots observed,\" the Chinese security vendor said.\n\"RapperBot's attack targets are all over the fields of various industries, including public management, social security and social organizations, Internet platforms, manufacturing, financial services, etc.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "200+ Trojanized GitHub Repositories Found in Campaign Targeting Gamers and Developers",
        "Link": "https://thehackernews.com/2025/06/67-trojanized-github-repositories-found.html",
        "Summary": "Cybersecurity researchers have uncovered a new campaign in which the threat actors have published more than 67 GitHub repositories that claim to offer Python-based hacking tools, but deliver trojanized payloads instead.\nThe activity, codenamed Banana Squad by ReversingLabs, is assessed to be a continuation of a rogue Python campaign that was identified in 2023 as targeting the Python Package",
        "Date": "2025-06-20",
        "Content": "Cybersecurity researchers have\nuncovered\na new campaign in which the threat actors have published more than 67 GitHub repositories that claim to offer Python-based hacking tools, but deliver trojanized payloads instead.\nThe activity, codenamed Banana Squad by ReversingLabs, is assessed to be a continuation of a rogue Python campaign that was\nidentified\nin 2023 as targeting the Python Package Index (PyPI) repository with bogus packages that were downloaded over 75,000 times and came with information-stealing capabilities on Windows systems.\nThe findings build on a\nprevious report\nfrom the SANS's Internet Storm Center in November 2024 that detailed a supposed \"steam-account-checker\" tool hosted on GitHub, which incorporated stealthy features to download additional Python payloads that can inject malicious code into the Exodus cryptocurrency wallet app and harvest sensitive data to an external server (\"dieserbenni[.]ru\").\nFurther analysis of the repository and the attacker-controlled infrastructure has led to the discovery of 67 trojanized GitHub repositories that impersonate benign repositories with the same name.\nThere is evidence to suggest that users searching for software such as account cleaning tools and game cheats such as Discord account cleaner, Fortnite External Cheat, TikTok username checker, and PayPal bulk account checker are the targets of the campaign. All the identified repositories have since been taken down by GitHub.\n\"Backdoors and trojanized code in publicly available source code repositories like GitHub are becoming more prevalent and represent a growing software supply chain attack vector,\" ReversingLabs researcher Robert Simmons said.\n\"For developers relying on these open-source platforms, it's essential to always double check that the repository you're using actually contains what you expect.\"\nGitHub as a Malware Distribution Service\nThe development comes as GitHub is\nincreasingly\nbecoming\nthe focus of several campaigns as a malware distribution vector. Earlier this week, Trend Micro\nsaid\nit uncovered 76 malicious GitHub repositories operated by a threat actor it calls Water Curse to deliver multi-stage malware.\nThese payloads are designed to siphon credentials, browser data, and session tokens, as well as to provide the threat actors with persistent remote access to the compromised systems.\nThen Check Point\nshed light\non another campaign that's using a criminal service known as the Stargazers Ghost Network to target Minecraft users with Java-based malware. The Stargazers Ghost Network refers to a collection of GitHub accounts that propagate malware or malicious links via phishing repositories.\n\"The network consists of multiple accounts that distribute malicious links and malware and perform other actions such as starring, forking, and subscribing to malicious repositories to make them appear legitimate,\" Check Point said.\nThe cybersecurity company has also assessed that such \"GitHub 'Ghost' accounts are only one part of the grand picture, with other 'Ghost' accounts operating on different platforms as an integral part of an even larger Distribution-as-a-Service universe.\"\nSome aspects of the Stargazers Ghost Network were\nexposed\nby Checkmarx in April 2024, calling out the threat actor's pattern of using fake stars and pushing out frequent updates to artificially inflate the popularity of the repositories and make sure they surfaced on top of GitHub search results.\nThese repositories are ingeniously disguised as legitimate projects, typically related to popular games, cheats, or tools like cryptocurrency price trackers and multiplier prediction for crash-betting games.\nThese campaigns also dovetail with another attack wave that has targeted novice cybercriminals on the lookout for readily available malware and attack tools on GitHub with backdoored repositories to infect them with information stealers.\nIn one instance highlighted by Sophos this month, the trojanized Sakura-RAT repository has been found to incorporate malicious code that compromised those who compiled the malware on their systems with information stealers and other remote access trojans (RATs).\nThe identified repositories act as a conduit for four different kinds of backdoors that are embedded within Visual Studio\nPreBuild events\n, Python scripts, screensaver files, and JavaScript to steal data, take screenshots, communicate via Telegram, as well as fetch more payloads, including AsyncRAT, Remcos RAT, and Lumma Stealer.\nIn all, the cybersecurity company said it detected no less than 133 backdoored repositories as part of the campaign, with 111 containing the PreBuild backdoor, and the others hosting Python, screensaver, and JavaScript backdoors.\nSophos further noted that these activities are likely linked to a distribution-as-a-service (DaaS) operation that has been operational since\nAugust 2022\n, and which has used thousands of GitHub accounts to distribute malware embedded within trojanized repositories themed around gaming cheats, exploits, and attack tools.\nWhile the exact distribution method used in the campaign is unclear, it's believed that the threat actors are also relying on Discord servers and YouTube channels to spread links to the trojanized repositories.\n\"It remains unclear if this campaign is directly linked to some or all of the previous campaigns reported on, but the approach does seem to be popular and effective, and is likely to continue in one form or another,\" Sophos\nsaid\n. \"In the future, it's possible that the focus may change, and threat actors may target other groups besides inexperienced cybercriminals and gamers who use cheats.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "BitoPro exchange links Lazarus hackers to $11 million crypto heist",
        "Link": "https://www.bleepingcomputer.com/news/security/bitopro-exchange-links-lazarus-hackers-to-11-million-crypto-heist/",
        "Summary": "The Taiwanese cryptocurrency exchange BitoPro claims the North Korean hacking group Lazarus is behind a cyberattack that led to the theft of $11,000,000 worth of cryptocurrency on May 8, 2025. [...]",
        "Date": "2025-06-20",
        "Content": "The Taiwanese cryptocurrency exchange BitoPro claims the North Korean hacking group Lazarus is behind a cyberattack that led to the theft of $11,000,000 worth of cryptocurrency on May 8, 2025.\nThe company has attributed the attack to Lazarus based on the evidence recovered from its internal investigations. It notes that the attack patterns and methodology closely resemble those used in past cyberattacks.\n\"The attack methodology bears resemblance to patterns observed in multiple past international major incidents, including illicit transfers from global bank SWIFT systems and asset theft incidents from major international cryptocurrency exchanges,\"\nreads the announcement\n.\n\"These attacks are attributed to the North Korean hacking organization Lazarus Group.\"\nBitoPro is a cryptocurrency exchange that caters primarily to Taiwanese users, supporting fiat deposits and withdrawals in TWD and a selection of crypto assets.\nIt has over 800,000 registered users and a daily trading volume of roughly $30 million.\nOn May 8, 2025, during a hot wallet system update, hackers performed unauthorized withdrawals from an old hot wallet across multiple blockchains, including Ethereum, Tron, Solana, and Polygon.\nAfter the theft, stolen funds were laundered through DEXs and mixers like Tornado Cash, ThorChain, and Wasabi Wallet.\nBitoPro was slow in admitting the incident, only\nconfirming it publicly on June 2\n, noting that all operations were unaffected and impacted hot wallets were replenished by available reserves.\nThe investigation into the hack now confirmed that there was no internal involvement, even though the attackers launched a social engineering attack and implanted malware on the device of an employee managing cloud operations.\nThrough this infection, the attackers hijacked AWS session tokens to bypass multi-factor authentication (MFA) and gain control over BitPro's cloud infrastructure.\nNext, the command-and-control (C2) server delivered commands to the implant that injected scripts into the hot wallet host as the attack was being prepared.\nWhen the wallet was upgraded and assets transferred, the attackers stole crypto while simulating normal operational behavior to evade immediate detection.\nOnce BitoPro detected the compromise, they shut down the hot wallet system and rotated the cryptographic keys. However, roughly $11 million worth of cryptocurrency had already been stolen.\nThe company informed the applicable authorities and engaged with an external cybersecurity expert to investigate the incident, a process completed on June 11.\nThe North Korean Lazarus group is\nnotorious for targeting\ncryptocurrency and decentralized finance entities. The hacking group is believed to be responsible for record-breaking digital asset heists, most recently, the\n$1.5 billion theft from Bybit\n.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nIsrael arrests new suspect behind Nomad Bridge $190M crypto hack\nNorth Korean hackers deepfake execs in Zoom call to spread Mac malware\nHacker steals $223 million in Cetus Protocol cryptocurrency heist\nUS charges 12 more suspects linked to $230 million crypto theft\nGermany takes down eXch cryptocurrency exchange, seizes servers"
    },
    {
        "Title": "Microsoft investigates OneDrive bug that breaks file search",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-investigates-onedrive-bug-that-breaks-file-search/",
        "Summary": "​Microsoft is investigating a known OneDrive issue that is causing searches to appear blank for some users or return no results even when searching for files they know they've already uploaded. [...]",
        "Date": "2025-06-20",
        "Content": "​Microsoft is investigating a known OneDrive issue that is causing searches to appear blank for some users or return no results even when searching for files they know they've already uploaded.\nIn a\nsupport document\nupdated this week, the company shared that this bug impacts Windows, Android, iOS, and web users.\n\"Some OneDrive personal account users may notice that search results appear blank or don't return files they know exist. While the files are still present and accessible, they don't appear in search results,\" Microsoft explains in a\nsupport document\npublished this week.\n\"We're actively investigating the root cause. The issue appears to affect a subset of users, and we're working closely with support teams to better understand the scope.\"\nRedmond is working to discover the root cause of these ongoing search problems that are impacting users across most OneDrive platforms. Microsoft added that there's no known workaround for those affected and no estimated timeline for a fix.\n\"We recognize the impact this issue is having and want to reassure you that we're working with urgency to resolve it as quickly as possible. Thank you for your patience as we work to resolve it,\" the company added.\nMicrosoft is also investigating a separate issue affecting iOS users and causing slo-mo videos uploaded to OneDrive to play at normal speed.\nThe company suggests that those experiencing this share the video from their iOS gallery to OneDrive instead of manually uploading it or adding it to OneDrive through automatic Camera Roll backup.\nEarlier this year, in January, Redmond\nfixed another known issue\ncausing macOS apps to freeze when opening or saving files in OneDrive.\nAs Redmond explained when it\nacknowledged the bug in November\n, it only affected systems running Apple's macOS 15 Sequoia operating system.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMicrosoft: June Windows Server security updates cause DHCP issues\nWindows 11 24H2 emergency update fixes Easy Anti-Cheat BSOD issue\nMicrosoft creates separate Windows 11 24H2 update for incompatible PCs\nMicrosoft fixes unreachable Windows Server domain controllers\nMicrosoft fixes Windows Server auth issues caused by April updates"
    },
    {
        "Title": "Cloudflare blocks record 7.3 Tbps DDoS attack against hosting provider",
        "Link": "https://www.bleepingcomputer.com/news/security/cloudflare-blocks-record-73-tbps-ddos-attack-against-hosting-provider/",
        "Summary": "Cloudflare says it mitigated a record-breaking distributed denial of service (DDoS) attack in May 2025 that peaked at 7.3 Tbps, targeting a hosting provider. [...]",
        "Date": "2025-06-20",
        "Content": "Cloudflare says it mitigated a record-breaking distributed denial of service (DDoS) attack in May 2025 that peaked at 7.3 Tbps, targeting a hosting provider.\nDDoS attacks flood targets with massive amounts of traffic with the sole aim to overwhelm servers and create service slowdowns, disruptions, or outages.\nThis new attack, which is 12% larger than the previous record, delivered\na massive data volume of 37.4 TB\nin just 45 seconds. This is the equivalent of about 7,500 hours of HD streaming or 12,500,000 jpeg photos.\nThe record-breaking DDoS attack\nSource: Cloudflare\nCloudflare, a web infrastructure and cybersecurity giant specializing in DDoS mitigation, offers a network-layer protection service called 'Magic Transit,' which was used by the targeted customer.\nThe attack came from 122,145 source IP addresses spread across 161 countries, with the majority based in Brazil, Vietnam, Taiwan, China, Indonesia, and Ukraine.\nThe \"garbage\" data packages were delivered across multiple destination ports on the victim's system, averaging 21,925 ports per second and peaking at 34,517 ports/second.\nThis tactic of scattering traffic helps overwhelm firewall or intrusion detection systems, but Cloudflare claims to have ultimately been able to mitigate the attack without human intervention.\nSource IP addresses\nSource: Cloudflare\nCloudflare's anycast network dispersed attack traffic to 477 data centers in 293 locations, leveraging key technologies such as real-time fingerprinting and intra-data center gossiping for real-time intelligence sharing and automated rule compilation.\nThough nearly the entire attack volume came from UDP floods, accounting for 99.996% of the total traffic, there were multiple other vectors involved, including:\nQOTD reflection\nEcho reflection\nNTP amplification\nMirai botnet UDP flood\nPortmap flood\nRIPv1 amplification\nEach vector exploited legacy or poorly configured services. While this was only a tiny percentage of the attack, it served as part of the attackers' evasion and effectiveness strategy and could also help probe for weaknesses and misconfigurations.\nCloudflare says valuable IoCs from this attack were timely included in its\nDDoS Botnet Threat Feed\n, a free service that helps organizations block malicious IP addresses preemptively.\nOver 600 organizations have subscribed to this feed, and the internet giant calls any others at risk of massive DDoS attacks to do the same and block the attacks before they reach their infrastructure.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nCloudflare mitigates record number of DDoS attacks in 2025\nPolice takes down six DDoS-for-hire services, arrests admins\nPro-Russia hacktivists bombard Dutch public orgs with DDoS attacks\nHackers switch to targeting U.S. insurance companies\nLockBit ransomware gang gets aggressive with triple-extortion tactic"
    },
    {
        "Title": "Aflac discloses breach amidst Scattered Spider insurance attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/aflac-discloses-breach-amidst-scattered-spider-insurance-attacks/",
        "Summary": "On Friday, American insurance giant Aflac disclosed that its systems were breached in a broader campaign targeting insurance companies across the United States by attackers who may have stolen personal and health information. [...]",
        "Date": "2025-06-20",
        "Content": "On Friday, American insurance giant Aflac disclosed that its systems were breached in a broader campaign targeting insurance companies across the United States by attackers who may have stolen personal and health information.\nAflac (short for American Family Life Assurance Company) is the largest supplemental insurance provider in the U.S. and a Fortune 500 company that provides insurance services to millions of customers in the U.S. and Japan.\nIn a press release earlier today, the insurance company added that its network was not affected by ransomware. It is unclear, though, if ransomware was deployed and blocked or if this was just a data theft attack.\n\"We promptly initiated our cyber incident response protocols and stopped the intrusion within hours. Importantly, our business remains operational, and our systems were not affected by ransomware,\"\nAflac stated\n.\n\"We continue to serve our customers as we respond to this incident and can underwrite policies, review claims, and otherwise service our customers as usual. This attack, like many insurance companies are currently experiencing, was caused by a sophisticated cybercrime group. This was part of a cybercrime campaign against the insurance industry.\"\nAfter detecting the breach, Aflac hired external cybersecurity experts to investigate the incident and review the contents of files potentially exposed during the attack.\nAs the company\nexplained in a filing\nwith the U.S. Securities and Exchange Commission (SEC), these documents contain a wide range of sensitive information related to customers, beneficiaries, employees, agents, and other individuals, ranging from claims and health information to social security numbers and/or other personal information.\nScattered Spider attacks targeting insurance firms\nWhile an Aflac spokesperson couldn't attribute the breach to a specific cybercrime group, the breach exhibits all the signs of a Scattered Spider attack.\nScattered Spider\n(also tracked as\n0ktapus\n,\nUNC3944\n,\nScatter Swine\n, Starfraud, and\nMuddled Libra\n) is a group of threat actors known for their sophisticated social engineering attacks against high-profile organizations worldwide, with tactics that include phishing, SIM swapping, and multi-factor authentication (MFA) bombing.\nIn September 2023, they escalated their attacks by breaching\nMGM Resorts\nand encrypting over 100 VMware ESXi hypervisors using BlackCat ransomware after gaining access by impersonating an employee. They've also partnered with other ransomware operations, such as\nRansomHub\n,\nQilin\n, and\nDragonForce\n. Other organizations targeted by Scattered Spider include\nTwilio\n,\nCoinbase\n,\nDoorDash\n,\nCaesars\n,\nMailChimp\n,\nRiot Games\n, and\nReddit\n.\nAs John Hultquist, Chief Analyst at Google Threat Intelligence Group (GTIG), told BleepingComputer earlier this week, Scattered Spider has recently been\ntargeting and breaching U.S. insurance companies\n.\nHultquist also told BleepingComputer today that \"the insurance industry should be on high alert\" and pay particular attention to potential social engineering attempts on help desks and call centers, \"given this actor's history of focusing on a sector at a time.\"\nThe most recent examples are Philadelphia Insurance Companies (PHLY) and\nErie Insurance\n, which experienced outages and disruptions after detecting unauthorized network access.\nIn May, GTIG's chief analyst also warned that\nScattered Spider switched\nfrom targeting retail chains in the United Kingdom to targeting retailers in the United States. \"The actor, which has reportedly targeted retail in the UK following a long hiatus, has a history of focusing their efforts on a single sector at a time,\" he added\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nHackers switch to targeting U.S. insurance companies\nHackers behind UK retail attacks now targeting US companies\nService desks are under attack: What can you do about it?\nUK shares security tips after major retail cyberattacks\nMicrosoft: Octo Tempest is one of the most dangerous financial hacking groups"
    },
    {
        "Title": "Can users reset their own passwords without sacrificing security?",
        "Link": "https://www.bleepingcomputer.com/news/security/can-users-reset-their-own-passwords-without-sacrificing-security/",
        "Summary": "Self-service password resets (SSPR) reduce helpdesk strain—but without strong security, they can open the door to attackers. Learn why phishing-resistant MFA, context-aware verification, and risk-based detection are critical to secure SSPR implementation. [...]",
        "Date": "2025-06-20",
        "Content": "Like it or not, passwords aren’t going away anytime soon. While many organizations are\nexploring passwordless authentication\n, passwords still serve as the main line of defense for most public-facing online services.\nThat said, they come with a heavy management burden. Gartner estimates that\n40% of all service desk calls\nare tied to password issues like expirations, changes, and resets. Some of these issues (like forgotten passwords, routine expirations, or security-driven updates) are unavoidable, yet they still consume valuable time and resources.\nForrester puts the\ncost of each reset at around $70\n, which can quickly add up. Given these figures, the case for a\nself-service password reset solution\nis highly compelling: by enabling users to handle resets on their own, organizations can reduce helpdesk load and cut costs – without compromising security.\nAbout self-service password resets\nSelf-service password resets (SSPRs) enable users to securely reset their own passwords without involving IT support. By allowing users to handle these routine but essential tasks independently, SSPRs significantly reduce help desk ticket volumes, lower costs, and boost productivity by empowering users to regain access quickly or perform regular passphrase refreshes.\nWith SSPRs, this can all happen without manual human IT helpdesk intervention. And the benefits are quantifiable, down to dollars saved: in 2022, an\naverage organization saved $65K\nwith self-service password resets.\nCore security considerations\nAt its core, SSPR shifts the responsibility of password recovery from IT to the end user. For this reason, security teams should prioritize the proper security considerations when implementing an SSPR solution, such as including strong identity verification measures.\nWithout proper safeguards, SSPR can become an attractive target for attackers looking to exploit weak reset processes and gain unauthorized access to user accounts.\nA secure SSPR process must rely on identity verification methods that are resistant to common attack vectors like phishing and\nprompt bombing\n.\nFor example, the use of authenticator apps or hardware tokens provides a much higher level of assurance than traditional methods such as SMS messages or security questions, which can be easily intercepted or guessed.\nOrganizations should prioritize multi-factor authentication (MFA)\nthat incorporates phishing-resistant technologies\nto validate users before allowing any password reset action.\nBy hardening the verification process, organizations can realize the benefits of SSPR without introducing new vulnerabilities into their security framework.\nSecure your Active Directory passwords with Specops Password Policy\nVerizon’s Data Breach Investigation Report found stolen credentials are involved in 44.7% of breaches.\nEffortlessly secure Active Directory with compliant password policies, blocking 4+ billion compromised passwords, boosting security, and slashing support hassles!\nTry it for free\nSSPR for remote access users\nSupporting remote and off-VPN users is a critical aspect of any effective SSPR solution. When users are outside the corporate network (such as working from home, traveling, or using personal devices), they must still be able to recover access to their accounts without relying on helpdesk intervention.\nThis makes a web-based SSPR portal essential for supporting remote access users.\nUnlike traditional, on-premises-only solutions, a cloud-accessible portal ensures users can initiate password resets from anywhere, regardless of their physical location and where they initiate\nconnections to the organization’s VPN\n.\nTo maintain both accessibility and security, the SSPR portal should require identity verification through pre-registered MFA methods. These could include authenticator apps, hardware keys, or\nbiometric options\n, which provide stronger protection than insecure methods like SMS or email links.\nBy ensuring users can securely authenticate and reset their passwords from any location, organizations not only reduce support overhead, but also enhance business continuity by keeping employees productive and secure, no matter where they work.\nMitigating social engineering risks\nSecurity teams planning to implement an SSPR solution should take proactive steps to minimize the risk of social engineering attacks. For example, traditional challenge-response questions (e.g., \"What’s your mother’s maiden name?”) are easily bypassed through phishing or publicly available data.\nInstead, organizations should implement dynamic challenge-response mechanisms that reference recent user activity or contextual data, such as the last file accessed, recent login history, or known usage patterns.\nThese context-aware prompts make it significantly harder for attackers to impersonate legitimate users, as the required information is both time-sensitive and personalized.\nIn addition to smarter challenge-response prompts, security teams can integrate risk-based authentication into the SSPR workflow to detect and block suspicious behavior. Techniques like geolocation analysis, device fingerprinting, and login velocity checks can flag anomalous reset attempts originating from unfamiliar locations or devices.\nIf a reset request comes from a country where the user has never logged in before, or from a new browser not associated with their profile, the system can prompt for additional verification or deny the request entirely.\nBy layering intelligent detection with contextual authentication, organizations can reduce the risk of social engineering attacks without undermining the convenience of SSPRs.\nBest practices when adopting SSPRs\nWhen implementing SSPRs, security teams should also prioritize user experience, as high levels of user friction can undermine the SSPR solution’s successful adoption and the realization of its long-term value. A clunky or confusing reset process can frustrate users, resulting in repeated support requests—ultimately undermine the very purpose of self-service.\nTo promote adoption and minimize abandonment, organizations should design the reset flow with clarity and simplicity in mind. This includes using step-by-step instructions, inline tips, and visual aids (e.g., password-strength meters) to guide users through the process confidently and correctly.\nReducing friction during the reset experience also helps lower error rates and ensures that users complete the process on the first attempt. For example, offering real-time feedback on password requirements or flagging common mistakes can prevent failed submissions and re-entry issues. The more intuitive and supportive the SSPR experience is, the more likely users are to embrace it.\nIn short, SSPR solutions lighten the load on IT teams and improve security posture across the organization, but their effectiveness depends on more than just core functionality. A smooth, intuitive user experience is critical to adoption and long-term success.\nSolutions like\nSpecops uReset\nare built with this in mind, integrating seamlessly with Active Directory and supporting customizable verification flows. Specops uReset ensures cached credentials are updated and deliver detailed audit logs, all without requiring a VPN.\nBook a live demo today.\nSponsored and written by\nSpecops Software\n."
    },
    {
        "Title": "Microsoft to remove legacy drivers from Windows Update for security boost",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-to-remove-legacy-drivers-from-windows-update-for-security-boost/",
        "Summary": "Microsoft has announced plans to periodically remove legacy drivers from the Windows Update catalog to mitigate security and compatibility risks. [...]",
        "Date": "2025-06-20",
        "Content": "Microsoft has announced plans to periodically remove legacy drivers from the Windows Update catalog to mitigate security and compatibility risks.\n\"The rationale behind this initiative is to ensure that we have the optimal set of drivers on Windows Update that cater to a variety of hardware devices across the windows ecosystem, while making sure that Microsoft Windows security posture is not compromised,\"\nMicrosoft said\n.\n\"This initiative involves periodic cleanup of drivers from Windows Update, thereby resulting in some drivers not being offered to any systems in the ecosystem.\"\nAs the company explained on Thursday, the first phase of this \"cleaning up\" procedure will involve drivers with newer replacements already published on Windows Update.\nIn this context, cleanup refers to expiring drivers by removing their association with an audience in Windows Update and thus preventing them from being offered to any Windows system. This will be done by deleting the expired driver's audience assignments in the Hardware Development Center.\nMicrosoft will start by removing legacy drivers and will later expand to include more categories that can be removed to increase security. However, partners may still republish drivers removed by Microsoft during this periodic clean-up process if they can provide a justifiable business reason.\n\"Microsoft removing legacy drivers from Windows Update is a proactive measure to safeguard security and improve driver quality for Windows users,\" Redmond added.\n\"Moving forward, expect this cleanup to be a routine practice, and prepare for the introduction of new publishing guidelines that will help all windows users keep their systems in a secure and reliable state.\"\nIn May, Microsoft also announced\nchanges to pre-production driver signing\nprompted by certificate authorities (CAs) set to expire in July and the\nretirement of Windows Metadata and Internet Services (WMIS)\nand device metadata.\nAdditionally, earlier this week, the company unveiled\nnew security defaults\nfor Windows 365 Cloud PCs and\nupdated security defaults\nfor all Microsoft 365 tenants in July to block access to SharePoint, OneDrive, and Office files using legacy authentication protocols.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMicrosoft unveils new security defaults for Windows 365 Cloud PCs\nWindows 11 users want these five features back\nMicrosoft June 2025 Patch Tuesday fixes exploited zero-day, 66 flaws\nWindows 10 KB5060533 cumulative update released with 7 changes, fixes\nWindows 11 KB5060842 and KB5060999 cumulative updates released"
    },
    {
        "Title": "Hackers Post Dozens of Malicious Copycat Repos to GitHub",
        "Link": "https://www.darkreading.com/threat-intelligence/dozens-malicious-copycat-repos-github",
        "Summary": "As package registries find better ways to combat cyberattacks, threat actors are finding other methods for spreading their malware to developers.",
        "Date": "2025-06-20",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/dozens-malicious-copycat-repos-github"
    },
    {
        "Title": "Telecom Giant Viasat Is Latest Salt Typhoon Victim",
        "Link": "https://www.darkreading.com/cloud-security/viasat-salt-typhoon-victim",
        "Summary": "The communications company shared the discoveries of its investigation with government partners, but there is little information they can publicly disclose other than that there seems to be no impact on customers.",
        "Date": "2025-06-20",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/viasat-salt-typhoon-victim"
    },
    {
        "Title": "How Cyber Warfare Changes the Face of Geopolitical Conflict",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/cyberwarfare-changes-geopolitical-conflict",
        "Summary": "As geopolitical tensions rise, the use of cyber operations and hacktivists continues to grow, with the current conflict between Israel and Iran showing the new face of cyber-augmented war.",
        "Date": "2025-06-20",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/cyberwarfare-changes-geopolitical-conflict"
    },
    {
        "Title": "How to Lock Down the No-Code Supply Chain Attack Surface",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/how-lock-down-no-code-supply-chain-attack-surface",
        "Summary": "Securing the no-code supply chain isn't just about mitigating risks — it's about enabling the business to innovate with confidence.",
        "Date": "2025-06-20",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/how-lock-down-no-code-supply-chain-attack-surface"
    },
    {
        "Title": "In Other News: Viasat Hacked by China, Washington Post Cyberattack, Crowhammer",
        "Link": "https://www.securityweek.com/in-other-news-viasat-hacked-by-china-washington-post-cyberattack-crowhammer/",
        "Summary": "<p>Noteworthy stories that might have slipped under the radar: China’s Salt Typhoon targeted Viasat, Washington Post emails compromised in hack, Rowhammer attack named Crowhammer.</p>\n<p>The post <a href=\"https://www.securityweek.com/in-other-news-viasat-hacked-by-china-washington-post-cyberattack-crowhammer/\">In Other News: Viasat Hacked by China, Washington Post Cyberattack, Crowhammer</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-20",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/in-other-news-viasat-hacked-by-china-washington-post-cyberattack-crowhammer/"
    },
    {
        "Title": "Record-Breaking 7.3 Tbps DDoS Attack Targets Hosting Provider",
        "Link": "https://www.securityweek.com/record-breaking-ddos-attack-peaked-at-7-3-tbps/",
        "Summary": "<p>Cloudflare has blocked yet another record-breaking DDoS attack, which delivered the equivalent of 9,000 HD movies in just 45 seconds.</p>\n<p>The post <a href=\"https://www.securityweek.com/record-breaking-ddos-attack-peaked-at-7-3-tbps/\">Record-Breaking 7.3 Tbps DDoS Attack Targets Hosting Provider</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-20",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/record-breaking-ddos-attack-peaked-at-7-3-tbps/"
    },
    {
        "Title": "Godfather Android Trojan Creates Sandbox on Infected Devices",
        "Link": "https://www.securityweek.com/godfather-android-trojan-creates-sandbox-on-infected-devices/",
        "Summary": "<p>The Godfather Android trojan uses on-device virtualization to hijack legitimate applications and steal users’ funds.</p>\n<p>The post <a href=\"https://www.securityweek.com/godfather-android-trojan-creates-sandbox-on-infected-devices/\">Godfather Android Trojan Creates Sandbox on Infected Devices</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-20",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/godfather-android-trojan-creates-sandbox-on-infected-devices/"
    },
    {
        "Title": "Motors Theme Vulnerability Exploited to Hack WordPress Websites",
        "Link": "https://www.securityweek.com/motors-theme-vulnerability-exploited-to-hack-wordpress-websites/",
        "Summary": "<p>Threat actors are exploiting a critical-severity vulnerability in Motors theme for WordPress to change arbitrary user passwords.</p>\n<p>The post <a href=\"https://www.securityweek.com/motors-theme-vulnerability-exploited-to-hack-wordpress-websites/\">Motors Theme Vulnerability Exploited to Hack WordPress Websites</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-20",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/motors-theme-vulnerability-exploited-to-hack-wordpress-websites/"
    },
    {
        "Title": "FreeType Zero-Day Found by Meta Exploited in Paragon Spyware Attacks",
        "Link": "https://www.securityweek.com/freetype-zero-day-found-by-meta-exploited-in-paragon-spyware-attacks/",
        "Summary": "<p>WhatsApp told SecurityWeek that it linked the exploited FreeType vulnerability CVE-2025-27363 to a Paragon exploit.</p>\n<p>The post <a href=\"https://www.securityweek.com/freetype-zero-day-found-by-meta-exploited-in-paragon-spyware-attacks/\">FreeType Zero-Day Found by Meta Exploited in Paragon Spyware Attacks</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-20",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/freetype-zero-day-found-by-meta-exploited-in-paragon-spyware-attacks/"
    },
    {
        "Title": "Cloudflare Tunnels Abused in New Malware Campaign",
        "Link": "https://www.securityweek.com/cloudflare-tunnels-abused-in-new-malware-campaign/",
        "Summary": "<p>A threat actor is abusing Cloudflare Tunnels for the delivery of a Python loader as part of a complex infection chain.</p>\n<p>The post <a href=\"https://www.securityweek.com/cloudflare-tunnels-abused-in-new-malware-campaign/\">Cloudflare Tunnels Abused in New Malware Campaign</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-20",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cloudflare-tunnels-abused-in-new-malware-campaign/"
    },
    {
        "Title": "161,000 People Impacted by Krispy Kreme Data Breach",
        "Link": "https://www.securityweek.com/161000-people-impacted-by-krispy-kreme-data-breach/",
        "Summary": "<p>Krispy Kreme is sharing more information on the data breach resulting from the ransomware attack targeting the company in 2024. </p>\n<p>The post <a href=\"https://www.securityweek.com/161000-people-impacted-by-krispy-kreme-data-breach/\">161,000 People Impacted by Krispy Kreme Data Breach</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-20",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/161000-people-impacted-by-krispy-kreme-data-breach/"
    },
    {
        "Title": "Hackers Access Legacy Systems in Oxford City Council Cyberattack",
        "Link": "https://www.securityweek.com/hackers-access-legacy-systems-in-oxford-city-council-cyberattack/",
        "Summary": "<p>Personal data of former and current council workers, including election staff, may have been accessed by hackers.</p>\n<p>The post <a href=\"https://www.securityweek.com/hackers-access-legacy-systems-in-oxford-city-council-cyberattack/\">Hackers Access Legacy Systems in Oxford City Council Cyberattack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-20",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/hackers-access-legacy-systems-in-oxford-city-council-cyberattack/"
    }
]