[
    {
        "Title": "Scattered Spider Behind Cyberattacks on M&S and Co-op, Causing Up to $592M in Damages",
        "Link": "https://thehackernews.com/2025/06/scattered-spider-behind-cyberattacks-on.html",
        "Summary": "The April 2025 cyber attacks targeting U.K. retailers Marks &amp; Spencer and Co-op have been classified as a \"single combined cyber event.\"\nThat's according to an assessment from the Cyber Monitoring Centre (CMC), a U.K.-based independent, non-profit body set up by the insurance industry to categorize major cyber events.\n\"Given that one threat actor claimed responsibility for both M&amp;S and",
        "Date": "2025-06-21",
        "Content": "The April 2025 cyber attacks targeting\nU.K. retailers Marks & Spencer and Co-op\nhave been classified as a \"single combined cyber event.\"\nThat's according to an assessment from the Cyber Monitoring Centre (CMC), a U.K.-based independent, non-profit body set up by the insurance industry to categorize major cyber events.\n\"Given that one threat actor claimed responsibility for both M&S and Co-op, the close timing, and the similar tactics, techniques, and procedures (TTPs), CMC has assessed the incidents as a single combined cyber event,\" the CMC\nsaid\n.\nThe organization has categorized the disruption of the retailers as a \"Category 2 systemic event.\" It's estimated that the security breaches will have a total financial impact of £270 million ($363 million) to £440 million ($592 million).\nHowever, the\ncyber attack on Harrods\naround the same time has not been included at this stage, citing a lack of adequate information about the cause and impact.\nThe initial access vector employed in the attacks targeting Marks & Spencer and Co-op revolved around the use of social engineering tactics, particularly targeting IT help desks.\nThe CMC further noted that its attribution efforts are still ongoing. That said, the notorious cybercrime group known as Scattered Spider (aka UNC3944) is believed to be behind the intrusions.\nThe group, an offshoot of the larger cybercrime community known as The Com, has a track record of leveraging its English-speaking members to carry out advanced social engineering attacks where they impersonate members of a company's IT department to obtain unauthorized access.\n\"The impact from this event is 'narrow and deep,' having significant implications for two companies, and knock-on effects for suppliers, partners, and service providers,\" the CMC said.\nEarlier this week, Google Threat Intelligence Group (GTIG)\nrevealed\nthat Scattered Spider actors have begun to target major insurance companies in the United States.\n\"Given this actor's history of focusing on a sector at a time, the insurance industry should be on high alert, especially for social engineering schemes which target their help desks and call centers,\" John Hultquist, Chief Analyst at GTIG, said.\n\"The anticipated threat of\nIranian cyber capability to U.S. organizations\nhas been the focus of many discussions lately, but these actors are already targeting critical infrastructure. We expect more high-profile incidents in the near term as they move from sector to sector.\"\nThe development comes as Indian consulting giant Tata Consultancy Services (TCS)\ndisclosed\nthat its systems or users were not compromised as part of the attack against Marks & Spencer. Last month, the Financial Times\nreported\nthat TCS is\ninternally probing\nwhether its systems were used as a launchpad for the attack.\nIt also follows a new strategy from the Qilin ransomware operation that\ninvolves\noffering legal assistance to ramp up pressure during ransom negotiations. The threat actors also claim to have an in-house team of journalists who can work together with the legal department to craft blog posts and assist with victim negotiations.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "AWS Enhances Cloud Security With Better Visibility Features",
        "Link": "https://www.darkreading.com/cloud-security/aws-enhances-cloud-security-better-visibility",
        "Summary": "At this week's re:Inforce 2025 conference, the cloud giant introduced new capabilities to several core security products to provide customers with better visibility and more context on potential threats.",
        "Date": "2025-06-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/aws-enhances-cloud-security-better-visibility"
    },
    {
        "Title": "Aflac Finds Suspicious Activity on US Network That May Impact Social Security Numbers, Other Data",
        "Link": "https://www.securityweek.com/aflac-finds-suspicious-activity-on-us-network-that-may-impact-social-security-numbers-other-data/",
        "Summary": "<p>Aflac said that it’s in the early stages of a review of the incident, and so far is unable to determine the total number of affected individuals.</p>\n<p>The post <a href=\"https://www.securityweek.com/aflac-finds-suspicious-activity-on-us-network-that-may-impact-social-security-numbers-other-data/\">Aflac Finds Suspicious Activity on US Network That May Impact Social Security Numbers, Other Data</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/aflac-finds-suspicious-activity-on-us-network-that-may-impact-social-security-numbers-other-data/"
    }
]