[
    {
        "Title": "Critical Open VSX Registry Flaw Exposes Millions of Developers to Supply Chain Attacks",
        "Link": "https://thehackernews.com/2025/06/critical-open-vsx-registry-flaw-exposes.html",
        "Summary": "Cybersecurity researchers have disclosed a critical vulnerability in the Open VSX Registry (\"open-vsx[.]org\") that, if successfully exploited, could have enabled attackers to take control of the entire Visual Studio Code extensions marketplace, posing a severe supply chain risk.\n\"This vulnerability provides attackers full control over the entire extensions marketplace, and in turn, full control",
        "Date": "2025-06-26",
        "Content": "Cybersecurity researchers have disclosed a critical vulnerability in the Open VSX Registry (\"open-vsx[.]org\") that, if successfully exploited, could have enabled attackers to take control of the entire Visual Studio Code extensions marketplace, posing a severe supply chain risk.\n\"This vulnerability provides attackers full control over the entire extensions marketplace, and in turn, full control over millions of developer machines,\" Koi Security researcher Oren Yomtov\nsaid\n. \"By exploiting a CI issue a malicious actor could publish malicious updates to every extension on Open VSX.\"\nFollowing responsible disclosure on May 4, 2025, the multiple rounds of fixes were proposed by the maintainers, before it was finally deployed on June 25.\nOpen VSX Registry is an open-source project and alternative to the Visual Studio Marketplace. It's\nmaintained\nby the Eclipse Foundation. Several code editors like Cursor, Windsurf, Google Cloud Shell Editor, Gitpod, and others integrate it into their services.\n\"This widespread adoption means that a compromise of Open VSX is a supply-chain nightmare scenario,\" Yomtov said. \"Every single time an extension is installed, or an extension update fetched silently in the background, these actions go through Open VSX.\"\nThe vulnerability discovered by Koi Security is rooted in the\npublish-extensions repository\n, which includes scripts to publish open-source VS Code extensions to open-vsx.org.\nDevelopers can\nrequest\ntheir extension to be auto-published by submitting a pull request to add it to the extensions.json file present in the repository, after which it's approved and merged.\nIn the backend, this plays out in the form of a\nGitHub Actions workflow\nthat's\ndaily run\nat 03:03 a.m. UTC that takes as input a list of comma-separated extensions from the JSON file and publishes them to the registry using the\nvsce npm package\n.\n\"This workflow runs with privileged credentials including a secret token (OVSX_PAT) of the @open-vsx service account that has the power to publish (or overwrite) any extension in the marketplace,\" Yomtov said. \"In theory, only trusted code should ever see that token.\"\n\"The root of the vulnerability is that npm install runs the arbitrary build scripts of all the auto-published extensions, and their dependencies, while providing them with access to the OVSX_PAT environment variable.\"\nThis means that it's possible to obtain access to the @open-vsx account's token, enabling privileged access to the Open VSX Registry, and providing an attacker with the ability to publish new extensions and tamper with existing ones to insert malicious code.\nThe risk posed by extensions has not gone unnoticed by MITRE, which has introduced a new \"\nIDE Extensions\n\" technique in its ATT&CK framework\nas of April 2025\n, stating it could be abused by malicious actors to establish persistent access to victim systems.\n\"Every marketplace item is a potential backdoor,\" Yomtov said. \"They're unvetted software dependencies with privileged access, and they deserve the same diligence as any package from PyPI, npm, Hugginface, or GitHub. If left unchecked, they create a sprawling, invisible supply chain that attackers are increasingly exploiting.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Critical RCE Flaws in Cisco ISE and ISE-PIC Allow Unauthenticated Attackers to Gain Root Access",
        "Link": "https://thehackernews.com/2025/06/critical-rce-flaws-in-cisco-ise-and-ise.html",
        "Summary": "Cisco has released updates to address two maximum-severity security flaws in Identity Services Engine (ISE) and ISE Passive Identity Connector (ISE-PIC) that could permit an unauthenticated attacker to execute arbitrary commands as the root user.\nThe vulnerabilities, assigned the CVE identifiers CVE-2025-20281 and CVE-2025-20282, carry a CVSS score of 10.0 each. A description of the defects is",
        "Date": "2025-06-26",
        "Content": "Cisco has\nreleased\nupdates to address two maximum-severity security flaws in Identity Services Engine (ISE) and ISE Passive Identity Connector (ISE-PIC) that could permit an unauthenticated attacker to execute arbitrary commands as the root user.\nThe vulnerabilities, assigned the CVE identifiers CVE-2025-20281 and CVE-2025-20282, carry a CVSS score of 10.0 each. A description of the defects is below -\nCVE-2025-20281\n- An unauthenticated remote code execution vulnerability affecting Cisco ISE and ISE-PIC releases 3.3 and later that could allow an unauthenticated, remote attacker to execute arbitrary code on the underlying operating system as root\nCVE-2025-20282\n- An unauthenticated remote code execution vulnerability affecting Cisco ISE and ISE-PIC release 3.4 that could allow an unauthenticated, remote attacker to upload arbitrary files to an affected device and execute those files on the underlying operating system as root\nCisco said CVE-2025-20281 is the result of insufficient validation of user-supplied input, which an attacker could exploit by sending a crafted API request to obtain elevated privileges and run commands.\nIn contrast, CVE-2025-20282 stems from a lack of file validation checks that would otherwise prevent the uploaded files from being placed in privileged directories.\n\"A successful exploit could allow the attacker to store malicious files on the affected system and then execute arbitrary code or obtain root privileges on the system,\" Cisco said.\nThe networking equipment vendor said there are no workarounds that address the issues. The shortcomings have been addressed in the below versions -\nCVE-2025-20281\n- Cisco ISE or ISE-PIC 3.3 Patch 6 (ise-apply-CSCwo99449_3.3.0.430_patch4-SPA.tar.gz), 3.4 Patch 2 (ise-apply-CSCwo99449_3.4.0.608_patch1-SPA.tar.gz)\nCVE-2025-20282\n- Cisco ISE or ISE-PIC 3.4 Patch 2 (ise-apply-CSCwo99449_3.4.0.608_patch1-SPA.tar.gz)\nThe company credited Bobby Gould of Trend Micro Zero Day Initiative and Kentaro Kawane of GMO Cybersecurity for reporting CVE-2025-20281. Kawane, who previously reported\nCVE-2025-20286\n(CVSS score: 9.9), has also been acknowledged for reporting CVE-2025-20282.\nWhile there is no evidence that the vulnerabilities have been exploited in the wild, it's essential that users move quickly to apply the fixes to safeguard against potential threats.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "New FileFix Method Emerges as a Threat Following 517% Rise in ClickFix Attacks",
        "Link": "https://thehackernews.com/2025/06/new-filefix-method-emerges-as-threat.html",
        "Summary": "The ClickFix social engineering tactic as an initial access vector using fake CAPTCHA verifications increased by 517% between the second half of 2024 and the first half of this year, according to data from ESET.\n\"The list of threats that ClickFix attacks lead to is growing by the day, including infostealers, ransomware, remote access trojans, cryptominers, post-exploitation tools, and even",
        "Date": "2025-06-26",
        "Content": "The ClickFix social engineering tactic as an initial access vector using fake CAPTCHA verifications increased by 517% between the second half of 2024 and the first half of this year, according to data from ESET.\n\"The list of threats that ClickFix attacks lead to is growing by the day, including infostealers, ransomware, remote access trojans, cryptominers, post-exploitation tools, and even custom malware from nation-state-aligned threat actors,\" Jiří Kropáč, Director of Threat Prevention Labs at ESET,\nsaid\n.\nClickFix has\nbecome\na\nwidely popular\nand\ndeceptive method\nthat employs bogus error messages or CAPTCHA verification checks to deceive victims into copying and pasting a malicious script into either the Windows Run dialog or the Apple macOS Terminal app, and running it.\nThe Slovak cybersecurity company said the highest volume of ClickFix detections is concentrated around Japan, Peru, Poland, Spain, and Slovakia.\nThe prevalence and effectiveness of this attack method have led to threat actors\nadvertising\nbuilders that provide other attackers with ClickFix-weaponized landing pages, ESET added.\nFrom ClickFix to FileFix\nThe development comes as security researcher\nmrd0x\ndemonstrated\na proof-of-concept (PoC) alternative to ClickFix named FileFix that works by tricking users into copying and pasting a file path into Windows File Explorer.\nThe technique essentially involves achieving the same as ClickFix but in a different manner by combining File Explorer's ability to execute operating system commands through the address bar with a web browser's file upload feature.\nIn the attack scenario devised by the researcher, a threat actor may devise a phishing page that, instead of displaying a fake CAPTCHA check to the prospective target, presents a message stating a document has been shared with them and that they need to copy and paste the file path on the address bar by pressing CTRL + L.\nThe phishing page also includes a prominent \"Open File Explorer\" that, upon clicking, opens the File Explorer and copies a malicious PowerShell command to the user's clipboard. Thus, when the victim pastes the \"file path,\" the attacker's command is executed instead.\nThis, in turn, is achieved by altering the copied file path to prepend the PowerShell command before it followed by adding spaces to hide it from view and a pound sign (\"#\") to treat the fake file path as a comment: \"\nPowershell.exe -c ping example.com<space># C:\\\\<path_to_file>\\\\decoy.doc\n\"\n\"Additionally, our PowerShell command will concatenate the dummy file path after a comment in order to hide the command and show the file path instead,\" mrd0x said.\nPhishing Campaigns Galore\nThe surge in ClickFix campaigns also coincides with the discovery of various phishing campaigns in recent weeks that -\nLeverage a .gov domain to\nsend phishing emails\nthat masquerade as unpaid toll to take users to bogus pages that are designed to collect their personal and financial information\nMake use of long-lived domains (LLDs), a technique called\nstrategic domain aging\n, to\neither host or use them to redirect users\nto custom CAPTCHA check pages, completing which they are led to spoofed Microsoft Teams pages to steal their Microsoft account credentials\nDistribute\nmalicious Windows shortcut (LNK) files\nwithin ZIP archives to launch PowerShell code responsible for deploying Remcos RAT\nEmploy lures which supposedly\nwarn users that their mailbox is almost full\nand that they need to \"clear storage\" by clicking a button embedded in the message, performing which takes the user to a phishing page hosted on\nIPFS\nthat steals users email credentials. Interestingly, the emails also include a RAR archive attachment that, once extracted and executed, drops the XWorm malware.\nIncorporate a\nURL that lets to a PDF document\n, which, in turn, contains another URL that drops a ZIP archive, which includes an executable responsible for launching an AutoIT-based Lumma Stealer\nWeaponize a\nlegitimate front-end platform called Vercel\nto host bogus sites that propagate a malicious version of LogMeIn to gain full control over victims' machines\nImpersonate U.S. state Departments of Motor Vehicles (DMVs) to\nsend SMS messages about unpaid toll violations\nand redirect recipients to\ndeceptive sites\nthat harvest personal information and credit card details\nUtilize SharePoint-themed emails to\nredirect users to credential harvesting pages\nhosted on \"*.sharepoint[.]com\" domains that siphon users' Microsoft account passwords.\n\"Emails containing SharePoint links are less likely to be flagged as malicious or phishing by EDR or antivirus software. Users also tend to be less suspicious, believing Microsoft links are inherently safer,\" CyberProof said.\n\"Since phishing pages are hosted on SharePoint, they are often dynamic and accessible only through a specific link for a limited time, making them harder for automated crawlers, scanners, and sandboxes to detect.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "The Hidden Risks of SaaS: Why Built-In Protections Aren't Enough for Modern Data Resilience",
        "Link": "https://thehackernews.com/2025/06/the-hidden-risks-of-saas-why-built-in.html",
        "Summary": "SaaS Adoption is Skyrocketing, Resilience Hasn’t Kept Pace\nSaaS platforms have revolutionized how businesses operate. They simplify collaboration, accelerate deployment, and reduce the overhead of managing infrastructure. But with their rise comes a subtle, dangerous assumption: that the convenience of SaaS extends to resilience.\nIt doesn’t.\nThese platforms weren’t built with full-scale data",
        "Date": "2025-06-26",
        "Content": "SaaS Adoption is Skyrocketing, Resilience Hasn't Kept Pace\nSaaS platforms have revolutionized how businesses operate. They simplify collaboration, accelerate deployment, and reduce the overhead of managing infrastructure. But with their rise comes a subtle, dangerous assumption: that the convenience of SaaS extends to resilience.\nIt doesn't.\nThese platforms weren't built with full-scale data protection in mind\n. Most follow a shared responsibility model — wherein the provider ensures uptime and application security, but the data inside is your responsibility. In a world of hybrid architectures, global teams, and relentless cyber threats, that responsibility is harder than ever to manage.\nModern organizations are being stretched across:\nHybrid and multi-cloud environments with decentralized data sprawl\nComplex integration layers between IaaS, SaaS, and legacy systems\nExpanding regulatory pressure with steeper penalties for noncompliance\nEscalating ransomware threats and insider risk\nShrinking recovery windows and rising expectations for uptime\nBuilt-in protections were never meant to handle this level of complexity, and they rarely do. By the time you realize the gap, the damage is already done.\nWhy Traditional Protection Falls Short\nToo many businesses still rely on outdated, fragmented, or overly simplistic backup strategies. They assume that cloud equals safe; or worse, that native features like recycle bins or version history are \"good enough.\" But most built-in tools are shallow by design. They prioritize collaboration and performance, not resilience.\nAnd while that's great for getting work done, it's not enough to keep your business running when the unexpected hits. Let's break down the risks.\n1. Human Error Is Ubiquitous\nStart with a question: What's the most common reason for data loss in SaaS environments? Simple mistakes. Data loss goes beyond cyberthreats and natural disasters. Files are deleted, syncs are misconfigured, records are overwritten in bulk by well-meaning users, rushed decisions, or miscommunication. These are everyday mistakes caused by trusted employees whose intentions are aligned with yours.\nSo, data risk is inherently part of owning data. But most SaaS platforms offer limited rollback options, and some don't cover the specific types of data you actually lost. If you don't catch the mistake in time, or if the data bypasses the recycle bin entirely, it's gone; for many mistakes, recovery isn't as simple as clicking \"undo.\"\nAs organizations lean more heavily on SaaS tools for business-critical operations, the cost of these errors rises. One wrong deletion shouldn't derail a product launch, delay an audit, or disrupt customer service. But without a recovery plan that goes deeper than native tools, that's exactly what can happen.\n2. Legal, Compliance, and Regulatory Risks\nCompliance is about proving you can find your data, restore it, and report on it quickly. In 2024, new regulations and smarter attackers raised the stakes even higher. Frameworks like GDPR, HIPAA, SOX, and NIS2 come with real teeth: heavy fines, operational disruption, and reputational damage.\nNow, organizations can't afford to rely on good intentions. They need tools built for full accountability. Unfortunately, most native SaaS platforms don't give you that level of control or visibility, meaning they don't meet most regulatory requirements. Retention policies are too short, recovery options too limited, and auditing capabilities too shallow.\nMany industries require organizations to retain records for years, not weeks. Staying compliant (and staying in control) requires a real strategy and the right tools to back it up.\n3. The True Cost of Data Loss\nFor some large enterprises, the importance of compliance is understood, but not necessarily prioritized. But, importantly, understand that fines you pay for data loss or noncompliance are just the\nminimum, mandatory\ncost\n. Even for the largest organizations with the heaviest checkbooks, downtime hits hard.\nData loss rarely stays in the IT department. Amid a crisis or serious incident, teams are pulled away from critical projects. Customers grow frustrated with lack of service. Revenue takes a hit as your business simply cannot continue operations. And beyond it all, trust with investors, partners, or the public begins to erode.\nToo often, businesses treat data loss as hypothetical. But this landslide can start with a single missing file, record, or user. Ask any team that's been through it, and you'll hear, \"once is enough.\" Whether it was ransomware, accidental deletion, or a failed recovery, the damage is rarely isolated, and the true costs are never foreseen.\n4. Internal Threats\nInternal threats are some of the most underestimated risks out there, and some of the most damaging. Employees, contractors, and vendors with access to sensitive systems can expose data, whether by mistake or on purpose. With teams spread out and systems more open than ever, oversight is tougher, and internal threats can slip past traditional defenses. These aren't headline-making attacks from the outside, but rather quiet breaches from within. By the time you catch them, critical data may already be gone.\nWhether malicious or accidental, insider threats are one of the most underestimated risks in SaaS. With teams working across locations, systems, and devices, visibility is limited — and oversight is tougher than ever.\nAccess mismanagement, privilege creep, and poor Role-Based Access Control (RBAC) hygiene can expose sensitive data in ways external actors never could. Most SaaS platforms weren't built to detect or respond to these kinds of quiet, internal failures.\n5. Cyberthreats Are Evolving Faster Than Defense\nToday's attacks steal data, corrupt environments, and pressure businesses through multi-phase extortion. Groups like Akira have shown how easily attackers can pivot into SaaS environments, exploiting token misconfigurations and shared credentials,\nleading the charge on ransomware for 18 consecutive months\n. If something as quiet, indiscriminate, and devastating as Akira is ransomware's most common form, it's impossible to foresee the true danger of cyberthreats in coming years.\nWhat we do know is that, in 2024, the average ransom payment exceeded half a million dollars, and targeted organizations of every size, type, and industry. Even when data isn't encrypted directly, business operations still grind to a halt. And in a multi-cloud world, one compromised app can cascade across others.\nSaaS providers aren't built to defend your business against these threats. They'll keep the lights on. They won't get your data back.\n6. Recovery Speed Defines Success\nDisruptions come in many forms — ransomware, outages, natural disasters — and when they hit, the clock starts ticking. Most teams aren't set up to recover quickly enough. According to Gartner, ransomware recovery often drags on for weeks. Downtime cuts into revenue, frustrates customers, and drains internal resources. In sectors like healthcare, finance, and government, where every minute counts, the cost can escalate fast.\nCustomers expect availability. When systems go dark, patience wears thin, and brand trust takes a hit. But in many organizations, recovery is still manual, clunky, or all-or-nothing. You're forced to choose between waiting hours to restore everything — or giving up on what's lost.\nThe Lesson is Clear\nThe shift to SaaS has reshaped how organizations approach data management, revealing crucial lessons about efficiency, agility, and resource optimization. Modern businesses have the potential to thrive when they adopt a SaaS data solution, which remains the clear, strategic choice for future-ready IT operations. But as we've seen, the bar is set high.\nWhat Modern SaaS Data Resilience Looks Like\nSaaS applications are incredibly powerful — but they also introduce real risk to your data. Protecting that data isn't easy, but it's essential. Doing it right means having the ability to:\nRestore data quickly and precisely — even down to a single object or record\nRun automated, policy-driven backups without constant oversight\nBuild in security from the start with features like immutability, encryption, and RBAC\nAlign retention policies with your compliance obligations\nManage everything — SaaS, IaaS, hybrid — from a single, unified interface\nIt's a long list. And a complex one. But modern resilience isn't just a checklist — it's a mindset. And it demands a platform built to keep up. For everything you need to know, read this e-book:\n6 Essential Traits of Modern SaaS Data Resilience\nSaaS Data Resilience with Veeam Data Cloud\nProtecting your data shouldn't be complicated. With\nVeeam Data Cloud\n, you're empowered by a unified cloud platform, integrating industry-leading innovation, modern cloud-native technologies, and powerful AI acceleration to secure, protect, and manage your data wherever it resides.\nRealize True Resilience\n: Ensure uninterrupted business operations through intelligent automation, policy-driven protection, and precise, rapid recoveries.\nEmbed Security at Every Level\n: Safeguard your sensitive data proactively with integrated Zero Trust architecture, robust encryption, immutability, and intelligent threat detection.\nDrive Operational Excellence\n: Streamline operations, significantly reduce total cost of ownership (TCO), and boost efficiency with an intuitive, AI-accelerated interface.\nDon't wait for disruption to test your readiness. Choose\nVeeam Data Cloud\nand confidently embrace a future where your data resilience strategy actively drives efficiency, compliance, and business continuity.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Iranian APT35 Hackers Targeting Israeli Tech Experts with AI-Powered Phishing Attacks",
        "Link": "https://thehackernews.com/2025/06/iranian-apt35-hackers-targeting-israeli.html",
        "Summary": "An Iranian state-sponsored hacking group associated with the Islamic Revolutionary Guard Corps (IRGC) has been linked to a spear-phishing campaign targeting journalists, high-profile cyber security experts, and computer science professors in Israel.\n\"In some of those campaigns, Israeli technology and cyber security professionals were approached by attackers who posed as fictitious assistants to",
        "Date": "2025-06-26",
        "Content": "An Iranian state-sponsored hacking group associated with the Islamic Revolutionary Guard Corps (IRGC) has been linked to a spear-phishing campaign targeting journalists, high-profile cyber security experts, and computer science professors in Israel.\n\"In some of those campaigns, Israeli technology and cyber security professionals were approached by attackers who posed as fictitious assistants to technology executives or researchers through emails and WhatsApp messages,\" Check Point\nsaid\nin a report published Wednesday. \"The threat actors directed victims who engaged with them to fake Gmail login pages or Google Meet invitations.\"\nThe cybersecurity company attributed the activity to a threat cluster it tracks as\nEducated Manticore\n, which overlaps with APT35 (and its sub-cluster\nAPT42\n), CALANQUE, Charming Kitten, CharmingCypress, Cobalt Illusion, ITG18, Magic Hound, Mint Sandstorm (formerly Phosphorus), Newscaster, TA453, and Yellow Garuda.\nThe advanced persistent threat (APT) group has a\nlong\nhistory\nof\norchestrating social engineering attacks\nusing elaborate lures, approaching targets on various platforms like Facebook and LinkedIn using fictitious personas to trick victims into deploying malware on their systems.\nCheck Point said it observed a new wave of attacks starting mid-June 2025 following the\noutbreak of the Iran-Israel war\nthat targeted Israeli individuals using fake meeting decoys, either via emails or WhatsApp messages tailored to the targets. It's believed that the messages are crafted using artificial intelligence (AI) tools due to the structured layout and the absence of any grammatical errors.\nOne of the WhatsApp messages flagged by the company took advantage of the current geopolitical tensions between the two countries to coax the victim into joining a meeting, claiming they needed their immediate assistance on an AI-based threat detection system to counter a surge in cyber attacks targeting Israel since June 12.\nThe initial messages, like those observed in previous Charming Kitten campaigns, are devoid of any malicious artifacts and are primarily designed to gain the trust of their targets. Once the threat actors build rapport over the course of the conversation, the attack moves to the next phase by sharing links that direct the victims to fake landing pages capable of harvesting their Google account credentials.\n\"Before sending the phishing link, threat actors ask the victim for their email address,\" Check Point said. \"This address is then pre-filled on the credential phishing page to increase credibility and mimic the appearance of a legitimate Google authentication flow.\"\n\"The custom phishing kit [...] closely imitates familiar login pages, like those from Google, using modern web technologies such as React-based Single Page Applications (SPA) and dynamic page routing. It also uses real-time WebSocket connections to send stolen data, and the design allows it to hide its code from additional scrutiny.\"\nThe fake page is part of a custom phishing kit that can not only capture their credentials, but also two-factor authentication (2FA) codes, effectively facilitating 2FA relay attacks. The kit also incorporates a passive keylogger to record all keystrokes entered by the victim and exfiltrate them in the event the user abandons the process midway.\nSome of the social engineering efforts have also involved the use of Google Sites domains to host bogus Google Meet pages with an image that mimics the legitimate meeting page. Clicking anywhere on the image directs the victim to phishing pages that trigger the authentication process.\n\"Educated Manticore continues to pose a persistent and high-impact threat, particularly to individuals in Israel during the escalation phase of the Iran-Israel conflict,\" Check Point said.\n\"The group continues to operate steadily, characterized by aggressive spear-phishing, rapid setup of domains, subdomains, and infrastructure, and fast-paced takedowns when identified. This agility allows them to remain effective under heightened scrutiny.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Cyber Criminals Exploit Open-Source Tools to Compromise Financial Institutions Across Africa",
        "Link": "https://thehackernews.com/2025/06/cyber-criminals-exploit-open-source.html",
        "Summary": "Cybersecurity researchers are calling attention to a series of cyber attacks targeting financial organizations across Africa since at least July 2023 using a mix of open-source and publicly available tools to maintain access.\nPalo Alto Networks Unit 42 is tracking the activity under the moniker CL-CRI-1014, where \"CL\" refers to \"cluster\" and \"CRI\" stands for \"criminal motivation.\"\nIt's suspected",
        "Date": "2025-06-26",
        "Content": "Cybersecurity researchers are calling attention to a series of cyber attacks targeting financial organizations across Africa since at least July 2023 using a mix of open-source and publicly available tools to maintain access.\nPalo Alto Networks Unit 42 is tracking the activity under the\nmoniker\nCL-CRI-1014\n, where \"CL\" refers to \"cluster\" and \"CRI\" stands for \"criminal motivation.\"\nIt's suspected that the end goal of the attacks is to obtain initial access and then sell it to other criminal actors on underground forums, making the threat actor an initial access broker (IAB).\n\"The threat actor copies\nsignatures\nfrom legitimate applications to\nforge file signatures\n, to disguise their toolset and mask their malicious activities,\" researchers Tom Fakterman and Guy Levi\nsaid\n. \"Threat actors often spoof legitimate products for malicious purposes.\"\nThe attacks are characterized by the deployment of tools like\nPoshC2\nfor command-and-control (C2),\nChisel\nfor tunneling malicious network traffic, and\nClassroom Spy\nfor remote administration.\nThe exact method the threat actors use to breach target networks is not clear. Once a foothold is obtained, the attack chains have been found to deploy\nMeshCentral Agent\nand later Classroom Spy to commandeer the machines, and then drop Chisel to bypass firewalls and spread PoshC2 to other Windows hosts on the compromised network.\nTo sidestep detection efforts, the payloads are passed off as legitimate software, using the icons of Microsoft Teams, Palo Alto Networks Cortex, and Broadcom VMware Tools. PoshC2 is persisted on the systems using three different methods -\nSetting up a service\nSaving a Windows shortcut (LNK) file to the tool in the Startup folder\nUsing a scheduled task under the name \"Palo Alto Cortex Services\"\nIn some incidents observed by the cybersecurity company, the threat actors are said to have stolen user credentials and used them to set up a proxy using PoshC2.\n\"PoshC2 can use a proxy to communicate with a command-and-control (C2) server, and it appears that the threat actor tailored some of the PoshC2 implants specifically for the targeted environment,\" the researchers noted.\nThis is not the first time PoshC2 has been used in attacks aimed at financial services in Africa. In September 2022, Check Point\ndetailed\na spear-phishing campaign dubbed DangerousSavanna that targeted financial and insurance companies located in Ivory Coast, Morocco, Cameroon, Senegal, and Togo to deliver Metasploit, PoshC2, DWservice, and AsyncRAT.\nThe disclosure comes as Trustwave SpiderLabs shed light on a new ransomware group called Dire Wolf that has already claimed 16 victims across the U.S., Thailand, Taiwan, Australia, Bahrain, Canada, India, Italy, Peru, and Singapore since its emergence last month. The top targeted sectors are technology, manufacturing, and financial services.\nAnalysis of the Dire Wolf locker has revealed that it's written in Golang, and comes with capabilities to disable system logging, terminate a hard-coded list of 75 services and 59 applications, and inhibit recovery efforts by deleting shadow copies.\n\"Although no initial access, reconnaissance or lateral movement techniques used by Dire Wolf are known at this point, organizations shall follow good security practices as well as enable monitoring for the techniques revealed in this analysis,\" the company\nsaid\n.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "CISA Adds 3 Flaws to KEV Catalog, Impacting AMI MegaRAC, D-Link, Fortinet",
        "Link": "https://thehackernews.com/2025/06/cisa-adds-3-flaws-to-kev-catalog.html",
        "Summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday added three security flaws, each impacting AMI MegaRAC, D-Link DIR-859 router, and Fortinet FortiOS, to its Known Exploited Vulnerabilities (KEV) catalog, based on evidence of active exploitation.\nThe list of vulnerabilities is as follows -\n\nCVE-2024-54085 (CVSS score: 10.0) - An authentication bypass by spoofing",
        "Date": "2025-06-26",
        "Content": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday\nadded\nthree security flaws, each impacting AMI MegaRAC, D-Link DIR-859 router, and Fortinet FortiOS, to its Known Exploited Vulnerabilities (\nKEV\n) catalog, based on evidence of active exploitation.\nThe list of vulnerabilities is as follows -\nCVE-2024-54085\n(CVSS score: 10.0) - An authentication bypass by spoofing vulnerability in the Redfish Host Interface of AMI MegaRAC SPx that could allow a remote attacker to take control\nCVE-2024-0769\n(CVSS score: 5.3) - A path traversal vulnerability in D-Link DIR-859 routers that allows for privilege escalation and unauthorized control (Unpatched)\nCVE-2019-6693\n(CVSS score: 4.2) - A hard-coded cryptographic key vulnerability in FortiOS, FortiManager and FortiAnalyzer that's used to encrypt password data in CLI configuration, potentially allowing an attacker with access to the CLI configuration or the CLI backup file to decrypt the sensitive data\nFirmware security company Eclypsium, which\ndisclosed\nCVE-2024-54085 earlier this year, said the flaw could be exploited to carry out a wide-range of malicious actions, including deploying malware and tampering with device firmware.\nThere are currently no details on how the shortcoming is being weaponized in the wild, who may be exploiting it, and the scale of the attacks. The Hacker News has reached out to Eclypsium for comment, and we will update the story if we get a response.\nThe exploitation of CVE-2024-0769 was\nrevealed\nby threat intelligence firm GreyNoise exactly a year ago as part of a campaign designed to dump account names, passwords, groups, and descriptions for all users of the device.\nIt's worth noting that D-Link DIR-859 routers have\nreached end-of-life (EoL)\nas of December 2020, meaning the vulnerability will remain unpatched on these devices. Users are advised to retire and replace the product.\nAs for the abuse of CVE-2019-6693,\nmultiple\nsecurity vendors\nhave reported that threat actors linked to the Akira ransomware scheme have leveraged the vulnerability to obtain initial access to target networks.\nIn light of the active exploitation of these flaws, Federal Civilian Executive Branch (FCEB) agencies are required to apply the necessary mitigations by July 16, 2025, to secure their networks.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "WhatsApp Adds AI-Powered Message Summaries for Faster Chat Previews",
        "Link": "https://thehackernews.com/2025/06/whatsapp-adds-ai-powered-message.html",
        "Summary": "Popular messaging platform WhatsApp has added a new artificial intelligence (AI)-powered feature that leverages its in-house solution Meta AI to summarize unread messages in chats.\nThe feature, called Message Summaries, is currently rolling out in the English language to users in the United States, with plans to bring it to other regions and languages later this year.\nIt \"uses Meta AI to",
        "Date": "2025-06-26",
        "Content": "Popular messaging platform WhatsApp has added a new artificial intelligence (AI)-powered feature that leverages its in-house solution Meta AI to summarize unread messages in chats.\nThe feature, called Message Summaries, is currently rolling out in the English language to users in the United States, with plans to bring it to other regions and languages later this year.\nIt \"uses Meta AI to privately and quickly summarize unread messages in a chat, so you can get an idea of what is happening, before reading the details in your unread messages,\" WhatsApp\nsaid\nin a post.\nMessage Summaries is optional and is disabled by default. The Meta-owned service said users can also enable \"\nAdvanced Chat Privacy\n\" to choose which chats can be shared for providing AI-related features.\nMost importantly, it's made possible by\nPrivate Processing\n, which WhatsApp launched back in April as a way to enable AI capabilities in a privacy-preserving manner.\nPrivate Processing is designed to process AI requests within a secure environment called the confidential virtual machine (CVM) on the cloud by establishing a secure application session between a user's device and the Trusted Execution Environment (TEE) over an Oblivious HTTP (OHTTP) connection.\nThe company reiterated that the technology prevents any third-party, including Meta and WhatsApp, from having to see the actual message contents to generate the summaries.\n\"No one else in the chat can see that you summarized unread messages either,\" it said. \"This means your privacy is protected at all times.\"\nThe development comes as the U.S. House of Representatives\nadded\nWhatsApp to a list of apps banned from government-issued devices, citing security concerns.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "FTC approves $126 million in Fortnite refunds over ‘dark patterns’",
        "Link": "https://www.bleepingcomputer.com/news/legal/ftc-approves-126-million-in-fortnite-refunds-over-dark-patterns/",
        "Summary": "The Federal Trade Commission (FTC) has approved $126,000,000 in refunds to be sent to 969,173 Fortnite players as part of a settlement over allegations that Epic Games tricked users into making unwanted purchases. [...]",
        "Date": "2025-06-26",
        "Content": "The Federal Trade Commission (FTC) has approved $126,000,000 in refunds to be sent to 969,173 Fortnite players as part of a settlement over allegations that Epic Games tricked users into making unwanted purchases.\nAt the same time, the agency has reopened the claims portal for eligible Fortnite players to submit refund claims, which will be examined for the third round of refunds.\nThis\nlatest development\nmarks the second phase of the settlement the FTC reached with Epic Games in December 2022, in which the company\nagreed to pay $520 million\nto settle allegations of violating children's privacy laws and using dark patterns to trick millions into making unintentional in-game purchases.\nThese so-called patterns included:\nDisplaying confusing purchase prompts\nPromoting misleading offers\nAllowing underage account holders to make purchases without parental consent\nCharging players unintentionally by waking the game from sleep mode, during the loading screen, or while they attempted to preview an in-game items\nThese charges occurred without additional confirmation, and those attempting to dispute and reverse them had to go through a complex process that made it likely for them to give up prematurely.\nIn some cases, these users were blocked from accessing their very accounts before the payment was reversed.\nThe first round of refunds occurred in December 2024, during which\n$72,000,000 was distributed\namong 629,344 eligible Fortnite players.\nThe average reimbursement in the first round was $114, while in the second, the figure has been raised to $130.\nAs previously happened, consumers whose reimbursement claims have been approved will be given 90 days to cash their checks or 30 days if they opt to use PayPal as the redemption method.\nA dedicated phone line and support email were also set up by Rust Consulting Inc., which handles the refund process.\nIf you have performed Fortnite purchases between January 2017 and September 2022 that fall into the category of 'dark patterns' as those were defined by the FTC, you are invited to submit a claim\nthrough this portal\nuntil July 9, 2025.\nClaimants must be at least 18 years old to complete a claim form. However, parents or guardians can do it on their behalf.\nMore information about FTC refunds in general is available on\nthis FAQ page\n.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nPaddle settles for $5 million over facilitating tech support scams\nUS House bans WhatsApp on staff devices over security concerns\nRyuk ransomware’s initial access expert extradited to the U.S.\n'Stargazers' use fake Minecraft mods to steal player passwords\nOperation Secure disrupts global infostealer malware operations"
    },
    {
        "Title": "Brother printer bug in 689 models exposes default admin passwords",
        "Link": "https://www.bleepingcomputer.com/news/security/brother-printer-bug-in-689-models-exposes-default-admin-passwords/",
        "Summary": "A total of 689 printer models from Brother, along with 53 other models from Fujifilm, Toshiba, and Konica Minolta, come with a default administrator password that remote attackers can generate. Even worse, there is no way to fix the flaw via firmware in existing printers. [...]",
        "Date": "2025-06-26",
        "Content": "A total of 689 printer models from Brother, along with 53 other models from Fujifilm, Toshiba, and Konica Minolta, come with a default administrator password that remote attackers can generate. Even worse, there is no way to fix the flaw via firmware in existing printers.\nThe flaw, tracked under\nCVE-2024-51978\n, is part of a set of eight vulnerabilities\ndiscovered by Rapid7 researchers\nduring a lengthy examination of Brother hardware.\nCVE\nDescription\nAffected Service\nCVSS\nCVE-2024-51977\nAn unauthenticated attacker can leak sensitive information.\nHTTP (Port 80), HTTPS (Port 443), IPP (Port 631)\n5.3 (Medium)\nCVE-2024-51978\nAn unauthenticated attacker can generate the device's default administrator password.\nHTTP (Port 80), HTTPS (Port 443), IPP (Port 631)\n9.8 (Critical)\nCVE-2024-51979\nAn authenticated attacker can trigger a stack based buffer overflow.\nHTTP (Port 80), HTTPS (Port 443), IPP (Port 631)\n7.2 (High)\nCVE-2024-51980\nAn unauthenticated attacker can force the device to open a TCP connection.\nWeb Services over HTTP (Port 80)\n5.3 (Medium)\nCVE-2024-51981\nAn unauthenticated attacker can force the device to perform an arbitrary HTTP request.\nWeb Services over HTTP (Port 80)\n5.3 (Medium)\nCVE-2024-51982\nAn unauthenticated attacker can crash the device.\nPJL (Port 9100)\n7.5 (High)\nCVE-2024-51983\nAn unauthenticated attacker can crash the device.\nWeb Services over HTTP (Port 80)\n7.5 (High)\nCVE-2024-51984\nAn authenticated attacker can disclose the password of a configured external service.\nLDAP, FTP\n6.8 (Medium)\nThis crucial vulnerability can be chained with other vulnerabilities discovered by Rapid7 to determine the admin password, take control of devices, perform remote code execution, crash them, or pivot within the networks they're connected to.\nNot all of the flaws affect every one of the 689 Brother printer models, but other manufacturers, including Fujifilm (46 models), Konica Minolta (6), Ricoh (5), and Toshiba (2), are impacted as well.\nNumber of impacted models for each of the eight flaws\nSource: Rapid7\nInsecure password generation\nThe default password in the impacted printers is generated during manufacturing using a custom alogirthm based on the device's serial number.\nAccording to a\ndetailed technical analysis\nby Rapid7, the password generation algorithm follows an easily reversible process:\nTake the first 16 characters of the serial number.\nAppend 8 bytes derived from a static \"salt\" table.\nHash the result with SHA256.\nBase64-encode the hash.\nTake the first eight characters and substitute some letters with special characters.\nAttackers can leak the serial number of the target printer using various methods or by exploiting\nCVE-2024-51977\n. They can then use the algorithm to generate the default admin password and log in as admin.\nFrom there, they may reconfigure the printer, access stored scans, read address books, exploit\nCVE-2024-51979\nfor remote code execution, or exploit\nCVE-2024-51984\nto harvest credentials.\nRapid7 began its disclosure process in May 2024 and was aided by JPCERT/CC in coordinating disclosures to other manufacturers.\nAlthough all flaws have been fixed in firmware updates made available by impacted manufacturers, the case with CVE-2024-51978 is complicated in terms of risk management.\nThe vulnerability is rooted in the password generation logic used in hardware manufacturing, and hence, any devices made before its discovery will have predictable passwords unless users change them.\n\"Brother has indicated that this vulnerability cannot be fully remediated in firmware, and has required a change to the manufacturing process of all affected models,\" explains Rapid7 regarding CVE-2024-51978.\nUsers of existing Brother printers listed in the impacted models should consider their devices vulnerable and immediately change the default admin password, followed by applying the firmware updates.\nIn general, it is recommended to restrict access to the printer's admin interfaces over unsecured protocols and external networks.\nSecurity bulletins with instructions on what users should do are available for\nBrother\n,\nKonica Minolta\n,\nFujifilm\n,\nRicoh\n, and\nToshiba\n.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nPrinter maker Procolored offered malware-laced drivers for months\nCisco fixes max severity IOS XE flaw letting attackers hijack devices"
    },
    {
        "Title": "Ex-student charged over hacking university for cheap parking, data breaches",
        "Link": "https://www.bleepingcomputer.com/news/security/ex-student-charged-over-hacking-university-for-cheap-parking-data-breaches/",
        "Summary": "New South Wales police in Australia have arrested a 27-year-old former Western Sydney University (WSU) student for allegedly hacking into the University's systems on multiple occasions, starting with a scheme to obtain cheaper parking. [...]",
        "Date": "2025-06-26",
        "Content": "New South Wales police in Australia have arrested a 27-year-old former Western Sydney University (WSU) student for allegedly hacking into the University's systems on multiple occasions, starting with a scheme to obtain cheaper parking.\nSpecifically, the woman, identified by\nlocal media reports\nas Birdie Kingston, is accused of unauthorized access, data theft, and compromising university infrastructure since 2021, affecting hundreds of staff and students.\n\"Since 2021, Western Sydney University experienced a series of cyber hacks involving unauthorized access, data exfiltration, system compromise, and misuse of university infrastructure – including threatening the sale of student information on the dark web,\"\nreads the NSW Police press release\n.\n\"It is estimated that hundreds of university staff and students were affected by these incidents.\"\nWSU is a major educational institute in Australia offering a wide range of undergraduate, postgraduate, and research programs to 47,000 students. It employs over 4,500 regular and seasonal staff members and operates on a budget of $600 million (USD).\nThe educational institute disclosed multiple security breaches since last year. In May 2024, it\nconfirmed unauthorized access\nto its Microsoft Office 365 environment that had started in May 2023, exposing 7,500 individuals.\nIn April 2025, WSU announced that it had\nsuffered two more security incidents\n. The first incident involved the compromise of one of the University's single sign-on (SSO) systems between January and February 2025, exposing approximately 10,000 students.\nThe second incident involved the leak of stolen data belonging to members of the WSU community on the dark web, which began on November 1, 2024.\nThe NSW police suspect that Kingston is behind those incidents and others, charging her with 20 offenses.\nDuring the raid and arrest at her residence in Kingswood, police investigators found and seized computer equipment and mobile devices that may contain incriminating evidence.\nHer actions allegedly escalated from manipulating parking access and academic records to threatening the sale of student data on the dark web.\nAustralian media claim that the police officially warned Kingston in September 2023, when she lived on the WSU campus, but she reportedly wasn't deterred and continued her hacking activities against the University.\nBased on the same reports, the hacker stole over 100GB of confidential data from WSU systems over the years, altered academic results, secured discounted parking at the University, threatened to sell stolen student data on darknet forums, and demanded a ransom payment in cryptocurrency worth $40,000.\nBleepingComputer has contacted WSU for a comment on the hacker's arrest, but we have not received a response yet.\nH/T Sick Codes\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nBreachForums hacking forum operators reportedly arrested in France\nRyuk ransomware’s initial access expert extradited to the U.S.\nPolice seizes Archetyp Market drug marketplace, arrests admin\nOperation Secure disrupts global infostealer malware operations\nPolice arrests 20 suspects for distributing child sexual abuse content"
    },
    {
        "Title": "Cisco warns of max severity RCE flaws in Identity Services Engine",
        "Link": "https://www.bleepingcomputer.com/news/security/cisco-warns-of-max-severity-rce-flaws-in-identity-services-engine/",
        "Summary": "Cisco has published a bulletin to warn about two critical, unauthenticated remote code execution (RCE) vulnerabilities affecting Cisco Identity Services Engine (ISE) and the Passive Identity Connector (ISE-PIC). [...]",
        "Date": "2025-06-26",
        "Content": "Cisco has published a bulletin to warn about two critical, unauthenticated remote code execution (RCE) vulnerabilities affecting Cisco Identity Services Engine (ISE) and the Passive Identity Connector (ISE-PIC).\nThe flaws, tracked under\nCVE-2025-20281\nand\nCVE-2025-20282\n, are rated with max severity (CVSS score: 10.0). The first impacts ISE and ISE-PIC versions 3.4 and 3.3, while the second affects only version 3.4.\nThe root cause of CVE-2025-20281 is an insufficient validation of user-supplied input in a specific exposed API. This allows an unauthenticated, remote attacker to send a specially crafted API request to execute arbitrary operating system commands as the root user.\nThe second issue, CVE-2025-20282, is caused by poor file validation in an internal API, allowing files to be written to privileged directories. The flaw allows unauthenticated, remote attackers to upload arbitrary files to the target system and execute them with root privileges.\nCisco Identity Services Engine (ISE) is a network security policy management and access control platform used by organizations to manage their network connections, serving as a network access control (NAC), identity management, and policy enforcement tool.\nThe product is typically used by large enterprises, government organizations, universities, and service providers, sitting at the core of the enterprise network.\nThe two flaws impacting it could enable complete compromise and full remote takeover of the target device without any authentication or user interaction.\nCisco\nnoted in the bulletin\nthat it is not aware of any cases of active exploitation for the two flaws, but installing the new updates should be prioritized.\nUsers are recommended to upgrade to 3.3 Patch 6 (ise-apply-CSCwo99449_3.3.0.430_patch4) and 3.4 Patch 2 (ise-apply-CSCwo99449_3.4.0.608_patch1) or later. No workarounds were provided to mitigate the flaws, so applying the security updates is the recommended solution.\nCisco also\npublished a separate bulletin\nregarding a medium-severity authentication bypass flaw, tracked as\nCVE-2025-20264\n, which also impacts ISE.\nThe flaw is caused by the inadequate enforcement of authorization for users created via SAML SSO integration with an external identity provider. An attacker with valid SSO-authenticated credentials can send a specific sequence of commands to modify system settings or perform a system restart.\nCVE-2025-20264 impacts all versions of ISE up to the 3.4 branch. Fixes were made available in 3.4 Patch 2 and 3.3 Patch 5. The vendor promised to fix the flaw for 3.2 with the release of 3.2 Patch 8, planned for November 2025.\nISE 3.1 and earlier are also impacted but are no longer supported, and users are recommended to migrate to a newer release branch.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nTrend Micro fixes critical vulnerabilities in multiple products\nHewlett Packard Enterprise warns of critical StoreOnce auth bypass\nExploit details for max severity Cisco IOS XE flaw now public\nUnpatched critical bugs in Versa Concerto lead to auth bypass, RCE\nCisco fixes max severity IOS XE flaw letting attackers hijack devices"
    },
    {
        "Title": "Man pleads guilty to hacking networks to pitch security services",
        "Link": "https://www.bleepingcomputer.com/news/security/man-pleads-guilty-to-hacking-networks-to-pitch-security-services/",
        "Summary": "A Kansas City man has pleaded guilty to hacking multiple organizations to advertise his cybersecurity services, the U.S. Department of Justice announced on Wednesday. [...]",
        "Date": "2025-06-26",
        "Content": "A Kansas City man has pleaded guilty to hacking multiple organizations to advertise his cybersecurity services, the U.S. Department of Justice announced on Wednesday.\n32-year-old Nicholas Michael Kloster was\nindicted last year\nfor hacking into the networks of three organizations in 2024, including a health club and a Missouri nonprofit corporation.\nAccording to\ncourt documents\n, Kloster accessed the systems of a health club that operates multiple gyms in Missouri after breaching a restricted area. Next, he sent an email to one of the gym chain's owners, claiming he had hacked their network and offering his services in the same message, seemingly seeking to secure a cybersecurity consulting contract with the company.\n\"I managed to circumvent the login for the security cameras by using their visible IP addresses. I also gained access to the GoogleFiber Router settings, which allowed me to use [redacted] to explore user accounts associated with the domain,\" Kloster said in the email. \"If I can reach the files on a user's computer, it indicates potential for deeper system access.\"\nHe also said in that email that he had \"assisted over 30 small to medium-sized industrial businesses in the Kansas City, Missouri area.\"\nBesides submitting a contracting proposal to the gym owner, Kloster removed his photograph from the gym's database, reduced his monthly gym membership fee to only $1, and stole a staff member's name tag.\nWeeks later, the defendant posted a screenshot on social media that displayed the gym's security camera system and indicated that he had gained control over it.\nOn May 20, Kloster also allegedly breached the restricted premises of a nonprofit organization, where he used a boot disk to bypass authentication requirements and stole sensitive information from a \"protected computer,\" a system \"used in or affecting interstate or foreign commerce or communication\" as described by the DOJ.\nKloster used his access to the nonprofit's computer to install a virtual private network (VPN) and change the passwords of multiple user accounts.\nThe defendant is also accused of using stolen credit card information from a third company, a former employer who fired Kloster on April 30, 2024, after he used the stolen company credit cards to purchase 'hacking thumb drives' designed to exploit vulnerable systems.\nIf found guilty, Kloster is facing a\npotential sentence of up to five years\nin federal prison without parole, along with a fine of up to $250,000, three years of supervised release, and an order of restitution.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nUnofficial Signal app used by Trump officials investigates hack\nUS House bans WhatsApp on staff devices over security concerns\nUS Homeland Security warns of escalating Iranian cyberattack risks\nAflac discloses breach amidst Scattered Spider insurance attacks\nHackers switch to targeting U.S. insurance companies"
    },
    {
        "Title": "3 key takeaways from the Scattered Spider attacks on insurance firms",
        "Link": "https://www.bleepingcomputer.com/news/security/3-key-takeaways-from-the-scattered-spider-attacks-on-insurance-firms/",
        "Summary": "Scattered Spider recently pivoted from targeting worldwide retailers to U.S. based insurance firms, with no signs of slowing down. Learn about Scattered Spider TTPs and how to defend your organization against MFA bypass, help desk scams, and more. [...]",
        "Date": "2025-06-26",
        "Content": "Scattered Spider continues to dominate the headlines, with the latest news linking the hackers to attacks on U.S. insurance giant\nAflac\n,\nPhiladelphia Insurance Companies\n, and\nErie Insurance\n, disclosed through SEC Form 8-K filings which indicate the theft of sensitive customer data and operational disruption.\nThis comes at the same time that Google Threat Intelligence Group shared that it “is now aware of multiple intrusions in the U.S. which bear the hallmarks of Scattered Spider activity”, specifically impacting the insurance industry.\nBut what exactly does this mean? To answer this, let’s quickly recap how we got here and what a Scattered Spider attack looks like.\nHow did we get here?\nThe criminal collective tracked by analysts as Scattered Spider has been active since 2022 and have been linked to a range of high-profile breaches, for example the attacks on Caesars and MGM Resorts in 2023, and Transport for London in 2024.\nCaesars:\nhackers impersonated an IT user and convinced an outsourced help desk to reset credentials, after which the attacker stole the customer loyalty program database and secured a $15m ransom payment.\nMGM Resorts:\nhackers used LinkedIn information to impersonate an employee and reset the employee’s credentials, resulting in a 6TB data theft. After MGM refused to pay, the attack eventually resulted in a 36-hour outage, a $100m hit, and a class-action lawsuit settled for $45m.\nTransport for London:\nresulted in 5,000 users’ bank details exposed, 30,000 staff required to attend in-person appointments to verify their identities and reset passwords, and significant disruption to online services lasting for months.\nThe calling card in these attacks was the abuse of help desk processes to reset passwords and/or MFA factors used to access an account.\nThe attacker simply calls up the help desk with enough information to impersonate an employee, asks them to send an MFA enrollment link for their new mobile device, and can then utilize self-service password reset functionality to take control of the account. Scarily simple.\nLearn about Scattered Spider’s evolving TTPs and how to defend your organization\nScattered Spider has dominated the news in recent weeks following high-profile breaches impacting UK retailers. But with a long history of high-profile ransomware attacks, this is just one example of their identity-based approach.\nJoin Push Security as they go beyond the breaches and learn how to defend your organization against Scattered Spider’s growing arsenal of TTPs.\nWatch the webinar on-demand\nScattered Spider’s resurgence in 2025\nThis technique was reprised in a series of high-profile attacks in 2025, with major breaches of UK retailers\nMarks and Spencer\nand\nCo-op\ndominating the headlines.\nBoth resulted in the loss of sensitive data and prolonged disruption to in-store and digital services, with M&S feeling the pain of £300m in lost profits and a share value hit approaching £1b, and a multimillion-pound class action lawsuit and possible ICO fines looming.\nA series of attacks against retailers worldwide soon followed, at an unprecedented rate.\nDior\n,\nThe North Face\n,\nCartier\n,\nVictoria’s Secret\n,\nAdidas\n,\nCoca-Cola\n, and\nUnited Natural Foods\nwere among the retailers to suffer a breach between May-June 2025.\nUnlike the\nmass Snowflake breaches in 2024\n(which targeted a single platform used by many organizations), these attacks are notable in that they are seemingly unrelated — they simply represent a concerted effort by attackers to target the retail sector.\nLess details have been provided about these attacks compared to the M&S and Co-op breaches, but a number of them specifically point to the use of\nidentity-based techniques\nas opposed to more traditional software exploits — another hallmark of Scattered Spider.\nThis leads us to our first key takeaway…\nTakeaway #1:\nIdentity-based TTPs are the new normal\nScattered Spider’s attacks are the latest in a growing number of identity-based breaches. When we look back at Scattered Spider’s TTP evolution, we can see that they have consistently exploited identity-based weaknesses in order to gain access to victim environments.\nScattered Spider initial access vectors in public breaches where the attack vector was disclosed.\nSource:\nPush Security\n.\nTaking a step back, it’s worth thinking about how help desk scams fit into the wider toolkit of tactics, techniques and procedures (TTPs) used by threat actors like Scattered Spider.\nScattered Spider has heavily relied on identity-based TTPs since they first emerged in 2022, following a repeatable path of bypassing MFA, achieving account takeover on privileged accounts, stealing data from cloud services, and deploying ransomware (principally in VMware environments). TTPs used by Scattered Spider include:\nCredential phishing via email and SMS (smishing) to harvest passwords en masse\nUsing SIM swapping (where you get the carrier to transfer a number to your attacker-controlled SIM card) to bypass SMS-based MFA\nUsing\nMFA fatigue\n(aka. push bombing) to bypass app-based push authentication\nUsing vishing (i.e. directly calling a victim to social engineer their MFA code, as opposed to a help desk attack)\nSocial engineering domain registrars to take control of the target organization’s DNS, hijacking their MX records and inbound mail, and using this to take over the company’s business app environments\nAnd latterly, using\nMFA-bypass AiTM phishing kits like Evilginx\nto steal live user sessions\nSo, help desk scams are an important part of their toolkit, but it’s not the whole picture. Methods like AiTM phishing in particular have spiked in popularity this year as a reliable and scalable way of bypassing MFA and achieving account takeover.\nIt’s important not to think about these techniques as just a Scattered Spider trait either. After all, Scattered Spider is not a self-identified group — it’s a name given by analysts to patterns of activity. Given the series of arrests in 2024, it’s unlikely that the current incarnation of Scattered Spider is the same individuals behind the attacks in 2022-2024.\nAnd these identity-based attack patterns are shared across various self-named criminal groups like,\nLapsus$, Yanluowang, Karakurt\n, and\nShinyHunters\n. Even Russian state-sponsored actors are\nincreasingly using the kinds of techniques popularised by criminal groups\n.\nSimply, identity-based techniques are the new normal for attackers in 2025.\nTakeaway #2:\nHelp desk scams aren’t new, but they’re here to stay\nAs we established earlier, help desk scams are nothing new (we saw them in the Caesars, MGM Resorts, and Transport for London breaches to name a few). But they’re likely to become increasingly prevalent as Scattered Spider continues to demonstrate just how effective help desk scams are.\nOne of the reasons they’re so effective is that most help desks have the same process for every account — it doesn’t matter who you’re impersonating or which account you’re trying to reset.\nSo, attackers are specifically targeting accounts likely to have top tier admin privileges — meaning once they get in, progressing the attack is trivial and much of the typical privilege escalation and lateral movement is removed from the attack path.\nHelp desks are a target for a reason. They’re “helpful” by nature. This is usually reflected in how they’re operated and performance measured — delays won’t help you to hit those SLAs!\nUltimately, a process only works if employees are willing to adhere to it — and can’t be socially engineered to break it. Help desks that are removed from day-to-day operations (especially when outsourced or offshored) are also inherently susceptible to attacks where employees are impersonated.\nBut, the attacks that organizations are experiencing at the moment should give security stakeholders plenty of ammunition as to why help desk reforms are vital to securing the business (and what can happen if you don’t make changes).\nTakeaway #3:\nScattered Spider are consciously evading established security controls\nSo, there’s more to Scattered Spider’s toolkit than just help desk scams. In fact, their approach can be broadly classified as\nconsciously evading established controls at the endpoint and network layer by targeting identities\n.\nFrom the point of account takeover, they also follow repeatable patterns:\nHarvesting and exfiltrating data from cloud and SaaS services, where monitoring is typically less consistent than traditional on-premise environments, and exfiltration often blends in with normal activity. Many organizations simply don’t have the logs or visibility to detect malicious activity in the cloud anyway, and Scattered Spider have also been seen tampering with cloud logs (e.g. filtering risky AWS CloudTrail logs, but not disabling it entirely so as not to raise suspicion).\nTargeting VMware environments for ransomware deployment. They do this by adding their compromised user account to the VMware admins group in VCentre (if needed — they are going after accounts with top tier privileges by default). From here, they can access the VMware environment via the ESXi hypervisor layer, where security software is nonexistent — thereby bypassing EDR and other typical endpoint and host based controls you rely on to prevent ransomware execution.\nThe key theme? Getting around your established security controls.\nStop identity attacks with Push Security\nModern attacks no longer take place on the endpoint or network — they target identities created and used via the web browser. This means that attacks increasingly take place in the browser (or rather, on resources your employees access through the browser).\nPush Security’s browser-based security platform provides comprehensive identity attack detection and response capabilities against techniques like AiTM phishing, credential stuffing, password spraying and session hijacking using stolen session tokens.\nYou can also use Push to find and fix identity vulnerabilities across every app that your employees use, like: ghost logins; SSO coverage gaps; MFA gaps; weak, breached and reused passwords; risky OAuth integrations; and more.\nPush Security contributes to a layered defense against known Scattered Spider TTPs.\nSource: Push\nTo help combat help desk scams, Push recently released\nEmployee Identity Verification Codes\n— a simple, browser-based identity check that gives your help desk a reliable way to confirm they’re talking to someone from your organization.\nPush provides a lightweight verification feature in every user’s browser — no additional apps or devices required.\nIt enables legitimate help desk callers to quickly verify that they’re in possession of their primary device (i.e. laptop) by relaying a rotating 6-digit verification code in their browser via the Push extension.\nThis is a great way to securely confirm caller identity and sniff out fraudulent callers, and can be used as part of a phishing-resistant help desk process.\nEric Rubin — a Senior Manager in GitLab’s Corporate Security team — has already rolled out Employee Identity Verification Codes across his workforce. Here’s what he had to say:\nGet started today!\nYou can use Employee Verification Codes as a free tool by installing the Push browser extension. Simply\nsign up for a trial account and you can deploy the extension organization-wide to make use of this feature\n.\nWhile you’re at it, you can trial Push’s full features for up to 10 users for free.\nOr if you want to learn more about how Push helps you to detect and defeat common identity attack techniques,\nbook some time with one of our team for a live demo\n.\nSponsored and written by\nPush Security\n."
    },
    {
        "Title": "Microsoft 365 'Direct Send' abused to send phishing as internal users",
        "Link": "https://www.bleepingcomputer.com/news/security/microsoft-365-direct-send-abused-to-send-phishing-as-internal-users/",
        "Summary": "An ongoing phishing campaign abuses a little‑known feature in Microsoft 365 called \"Direct Send\" to evade detection by email security and steal credentials. [...]",
        "Date": "2025-06-26",
        "Content": "An ongoing phishing campaign abuses a little‑known feature in Microsoft 365 called \"Direct Send\" to evade detection by email security and steal credentials.\nDirect Send is a Microsoft 365 feature that allows on‑premises devices, applications, or cloud services to send emails through a tenant's smart host as if they originated from the organization's domain. It’s designed for use by printers, scanners, and other devices that need to send messages on behalf of the company.\nHowever, the feature is a\nknown security risk\n, as it doesn't require any authentication, allowing remote users to send internal‑looking emails from the company's domain.\nMicrosoft recommends that only advanced customers utilize the feature, as its safety depends on whether Microsoft 365 is configured correctly and the smart host is properly locked down.\n\"We recommend Direct Send only for advanced customers willing to take on the responsibilities of email server admins,\"\nexplains Microsoft\n.\n\"You need to be familiar with setting up and following best practices for sending email over the internet. When correctly configured and managed, Direct Send is a secure and viable option. But customers run the risk of misconfiguration that disrupts mail flow or threatens the security of their communication.\"\nThe company has shared ways to disable the feature, which are explained later in the article, and says they are working on a way to deprecate the feature.\nDirect Send abused in a phishing campaign\nThe phishing campaign was discovered by the Varonis Managed Data Detection and Response (MDDR) team, who told BleepingComputer that it is targeting more than 70 organizations across all industries, with 95% of the victims based in the United States.\nVaronis says the campaign started in May 2025, with over 95% of the targeted companies based in the United States.\n\"Victims occupy a wide variety of business verticals but over 90% of identified targets operate within the Financial Services, Construction, Engineering, Manufacturing, Healthcare, and Insurance space,\" Joseph Avanzato, Security Operations and Forensics Group Leader, told BleepingComputer.\n\"Financial Services were the most common target followed by Manufacturing, Construction/Engineering and Healthcare/Insurance.\"\nThe\nVaronis report explains\nthat the attacks are delivered via PowerShell using a targeted company's smart host (company-com.mail.protection.outlook.com), making it possible for an attacker to send internal‑looking messages from external IP addresses.\nAn example PowerShell command that can send emails via the Direct Send feature is:\nSend‑MailMessage -SmtpServer company‑com.mail.protection.outlook.com -To joe@company.com -From joe@company.com -Subject \"New Missed Fax‑msg\" -Body \"You have received a call! Click on the link to listen to it. Listen Now\" -BodyAsHtml\nThis method works because using Direct Send with the smart host doesn't require authentication and treats the sender as internal, allowing threat actors to bypass SPF, DKIM, DMARC, and other filtering rules.\nThe email campaigns impersonate voicemail or fax notifications with email subjects of \"Caller Left VM Message.\" Attached to the emails are PDF attachments titled 'Fax-msg', 'Caller left VM Message', 'Play_VM-Now', or 'Listen'.\nExample phishing email from the campaign\nSource: Varonis\nWhat is unusual about the campaign is that PDF attachments do not contain links to the phishing pages.\nInstead, the documents instruct targets to scan a QR code with their smartphone camera to listen to the voicemail. The PDF documents are also branded with the company logo to make them appear more legitimate.\nPDF document with QR codes\nSource: BleepingComputer\nScanning the QR code and opening the link brings you to a phishing site that displays a fake Microsoft login form, which will be used to steal the employee's credentials.\nIn one case seen by Varonis, where a company received abnormal behavior alerts, the threat actors used PowerShell to send emails through the smart host from a Ukrainian IP address of 139.28.36[.]230 and others in the same range.\nThese messages failed SPF and DMARC checks, but they were treated as trusted internal traffic because they came through the internal smart host.\nIn another email from this campaign seen by BleepingComputer, the email appeared to come from an internal email address and was delivered via the organization's smart host despite also failing SPF, DKIM, and DMARC. This email originated from the IP address 51.89.86[.]105.\nVaronis shared further indicators of compromise (IOCs) in their report, including domains that are used in the campaign.\nMitigating Direct Send phishing attacks\nTo mitigate this threat, Varonis recommends enabling the \"\nReject Direct Send\n\" setting in the Exchange Admin Center, which Microsoft introduced in April 2025.\nMicrosoft introduced this feature as they typically suggest companies enable SPF soft-fail to prevent potential routing errors. However, this made it impossible to block email sent via Direct Send.\n\"While SPF provides protection from spoofing of your domains, we recommend customers use a Soft Fail SPF configuration due to the possibility of valid routing scenarios falling foul of SPF failures,\" explains Microsoft.\n\"As such, no feature existed to block Direct Send traffic for the many customers who have no need to use it. To this end we have developed the Reject Direct Send setting for Exchange Online and are announcing the Public Preview for this feature today.\"\nVaronis also recommends implementing a strict DMARC policy (p=reject), flagging unauthenticated internal messages for review or quarantine, enforcing SPF hardfail within Exchange Online Protection, enabling Anti‑Spoofing policies, and training employees to spot QR phishing attempts.\n\"Direct Send is a powerful feature, but in the wrong hands it becomes a dangerous attack vector,\" concludes Varonis.\n\"If you're not actively monitoring spoofed internal emails or haven't enabled these protections, now is the time. Don't assume internal means safe.\"\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nChainLink Phishing: How Trusted Domains Become Threat Vectors\nMicrosoft fixes Outlook bug causing crashes when opening emails\nTrezor’s support platform abused in crypto theft phishing attacks\nMicrosoft 365 to block file access via legacy auth protocols by default\nMicrosoft blocks ActiveX by default in Microsoft 365, Office 2024"
    },
    {
        "Title": "Microsoft fixes Outlook bug causing crashes when opening emails",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-outlook-bug-causing-crashes-when-opening-emails/",
        "Summary": "Microsoft has fixed a known issue that will cause the classic Outlook email client to crash when opening emails or starting a new message. [...]",
        "Date": "2025-06-26",
        "Content": "Microsoft has fixed a known issue that will cause the classic Outlook email client to crash when opening emails or starting a new message.\nThe bug impacts users across all Microsoft 365 Office channels who updated Outlook for Microsoft 365 earlier this month.\n\"When you open or start a new email, classic Outlook crashes. This issue occurs because Outlook cannot open the Forms Library. The emerging cases for this issue are on virtual desktop infrastructure (VDI),\" the Outlook team\nsaid\nwhen it acknowledged the issue last week.\nThe company says the bug has been addressed across multiple channels, with fixed versions released earlier this week for Current Channel Preview, Monthly Enterprise Channel, Semi-Annual Enterprise Channel, Outlook 2021, and Outlook 2024 users.\nRedmond will also release non-security updates to fix the issue for Outlook 2016 and Outlook 2019 on July 1st and July 8th, respectively.\nThose who can't immediately update or are still waiting for a fixed version can manually create the missing FORMS2 folder at C:\\Users\\<username>\\AppData\\Local\\Microsoft\\FORMS2 as a temporary workaround.\nTo do that, you have to follow these steps:\nClose Outlook and other Office applications.\nSelect\nStart\n>\nRun\nand enter the path %localappdata%\\Microsoft and select\nOK\n.\nIn the\nFile Explorer\nmenu, select\nNew\n>\nFolder\nand name it FORMS2.\nMicrosoft has also\nresolved an Outlook issue\naffecting users in the Current and Beta channels that caused mailbox folders to flicker and move around when items were moved to the folders after updating to Outlook version 2505 (Build 18827.20128).\nAffected users who can't apply the fix are advised to revert to version 2504 or toggle off caching of the shared mailbox by disabling Download Shared Folders as a workaround.\nIn recent weeks, Redmond has also\npushed a service update\nto address a bug that triggered Outlook LTSC 2019 crashes when opening Viva Engage, Yammer, Power Automate, and other emails.\nEarlier this year, Microsoft\nreleased a fix for another known issue\ncausing classic Outlook and Microsoft 365 apps to crash on Windows Server systems. Additionally, the company\nshared a temporary fix\nfor crashes impacting classic Outlook when writing, replying to, or forwarding emails.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMicrosoft shares temp fix for Outlook crashes when opening emails\nMicrosoft fixes Outlook paste, blank calendar rendering issues\nMicrosoft 365 'Direct Send' abused to send phishing as internal users\nWindows 11 24H2 emergency update fixes Easy Anti-Cheat BSOD issue\nMicrosoft confirms Family Safety blocks Google Chrome from launching"
    },
    {
        "Title": "Microsoft confirms Family Safety blocks Google Chrome from launching",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-confirms-family-safety-blocks-google-chrome-from-launching/",
        "Summary": "Microsoft has confirmed that its Family Safety parental control service is blocking users from launching Google Chrome and other web browsers on Windows systems. [...]",
        "Date": "2025-06-26",
        "Content": "Microsoft has confirmed that its Family Safety parental control service is blocking users from launching Google Chrome and other web browsers on Windows systems.\nMicrosoft Family Safety helps parents monitor their children's activity across desktop and mobile devices, providing screen time management, content filtering, app controls, location tracking, communication monitoring, and activity reports.\nRedmond acknowledged the bug after\nwidespread\nuser\nreports\nsince\nearly June\nthat they were unable to launch Google Chrome on their PCs or\nexperienced the web browser randomly crashing, as\nfirst reported\nby The Verge.\nAs the company explained this week, the known issue is caused by the web filtering tool, which prompts children to ask for their parents' approval to use other browsers.\nHowever, because of this bug, Family Safety will also block new versions of previously approved web browsers, preventing them from launching or causing them to shut down unexpectedly on affected devices.\n\"The blocking behavior continues to work, however, when a browser updates to a new version, the latest version of the browser cannot be blocked until we add it to the block list. Microsoft is currently adding the latest versions of Chrome and other browsers to the block list,\" the company\nsaid\nin a Windows release health update.\n\"As Microsoft continues to update the block list, we've received reports of a new issue affecting Google Chrome and some browsers. When children try to open these browsers, they shut down unexpectedly.\n\"However, the standard workflow is to prompt a parental approval message stating, 'You'll need to ask to use this app.' Once the approval is consented, the browser operates as intended. This issue is only observed when the Activity reporting feature is turned off.\"\nThis known issue affects devices running Windows 10 22H2 and Windows 11 22H2 or later, and Microsoft is currently working to find a fix for this issue.\nUntil a fix is available, affected users are advised to turn on the 'Activity reporting' feature under Windows settings in Microsoft Family Safety, which will allow parents to receive approval requests as expected.\n\"We are actively working on a resolution for the two key issues: the missing parental consent prompts and the unintended temporary unblocking of the latest versions of Google Chrome and other browsers after a browser update with a version change,\" Redmond added.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nWindows 10 users can get extended security updates using Microsoft points\nWindows Snipping Tool now lets you create animated GIF recordings\nWindows 11 24H2 emergency update fixes Easy Anti-Cheat BSOD issue\nMicrosoft creates separate Windows 11 24H2 update for incompatible PCs\nMicrosoft fixes unreachable Windows Server domain controllers"
    },
    {
        "Title": "CISA: AMI MegaRAC bug enabling server hijacks exploited in attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/cisa-ami-megarac-bug-that-lets-hackers-brick-servers-now-actively-exploited/",
        "Summary": "CISA says a maximum severity vulnerability in AMI's MegaRAC Baseboard Management Controller (BMC) software, which enables attackers to hijack and brick servers, is currently under active exploitation. [...]",
        "Date": "2025-06-26",
        "Content": "CISA has confirmed that a maximum severity vulnerability in AMI's MegaRAC Baseboard Management Controller (BMC) software is now actively exploited in attacks.\nThe MegaRAC BMC firmware provides remote system management capabilities for troubleshooting servers without being physically present, and it's used by several vendors (including HPE, Asus, and ASRock) that supply equipment to cloud service providers and data centers.\nThis authentication bypass security flaw (tracked as\nCVE-2024-54085\n) can be exploited by remote unauthenticated attackers in low-complexity attacks that don't require user interaction to hijack and potentially brick unpatched servers.\n\"Exploitation of this vulnerability allows an attacker to remotely control the compromised server, remotely deploy malware, ransomware, firmware tampering, bricking motherboard components (BMC or potentially BIOS/UEFI), potential server physical damage (over-voltage / bricking), and indefinite reboot loops that a victim cannot stop,\"\nexplained\nsupply chain security company Eclypsium who discovered the vulnerability.\nEclypsium researchers discovered CVE-2024-54085 while analyzing patches issued by AMI for another authentication bypass bug (CVE-2023-34329)\ndisclosed in July 2023\n.\nIn March, when the AMI released security updates to fix CVE-2024-54085, Eclypsium found more than 1,000 servers online that were potentially exposed to attacks and said that creating an exploit is \"not challenging,\" seeing that MegaRAC BMC firmware binaries are not encrypted.\nExposed AMI MegaRAC instances (Eclypsium)\n​\"To our knowledge, the vulnerability only affects AMI's BMC software stack. However, since AMI is at the top of the BIOS supply chain, the downstream impact affects over a dozen manufacturers,\" Eclypsium added.\nCISA confirmed on Wednesday that the\nvulnerability is now exploited in the wild\nand added it to the\nKnown Exploited Vulnerabilities catalog\n, which lists security flaws flagged by the cybersecurity agency as actively exploited in attacks.\nAs mandated by the November 2021 Binding Operational Directive (BOD) 22-01, Federal Civilian Executive Branch (FCEB) agencies now have three weeks, until July 16th, to patch their servers against these ongoing attacks.\nAlthough BOD 22-01 only applies to federal agencies, all network defenders are advised to prioritize patching this vulnerability as soon as possible to block potential breaches.\n\"These types of vulnerabilities are frequent attack vectors for malicious cyber actors and pose significant risks to the federal enterprise,\" CISA warned.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nCISA warns of attackers exploiting Linux flaw with PoC exploit\nCISA warns of ConnectWise ScreenConnect bug exploited in attacks\nCISA tags recently patched Chrome bug as actively exploited\nIvanti fixes EPMM zero-days chained in code execution attacks\nHackers exploit OttoKit WordPress plugin flaw to add admin accounts"
    },
    {
        "Title": "'IntelBroker' Suspect Arrested, Charged in High-Profile Breaches",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/intebroker-suspect-arrested-charged-breaches",
        "Summary": "A British national arrested earlier this year in France was charged by the US Department of Justice in connection with a string of major cyberattacks.",
        "Date": "2025-06-26",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/intebroker-suspect-arrested-charged-breaches"
    },
    {
        "Title": "How Geopolitical Tensions Are Shaping Cyber Warfare",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/geopolitical-tensions-shape-cyber-warfare",
        "Summary": "In today's cyber battlefield, resilience starts with readiness, and the cost of falling short increases by the day.",
        "Date": "2025-06-26",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/geopolitical-tensions-shape-cyber-warfare"
    },
    {
        "Title": "Charming Kitten APT Tries Spying on Israeli Cybersecurity Experts",
        "Link": "https://www.darkreading.com/threat-intelligence/iran-apt-spying-israeli-cybersecurity-experts",
        "Summary": "Israel's cyber pros are having to put theory into practice, as a notorious nation-state APT sponsored by Iran targets them with spear-phishing attacks.",
        "Date": "2025-06-26",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/iran-apt-spying-israeli-cybersecurity-experts"
    },
    {
        "Title": "Bipartisan Bill Aims to Block Chinese AI From Federal Agencies",
        "Link": "https://www.securityweek.com/bipartisan-bill-aims-to-block-chinese-ai-from-federal-agencies/",
        "Summary": "<p>The proposal seeks to ban all use of the technology in the U.S. government, with exceptions for use in research and counterterrorism efforts.</p>\n<p>The post <a href=\"https://www.securityweek.com/bipartisan-bill-aims-to-block-chinese-ai-from-federal-agencies/\">Bipartisan Bill Aims to Block Chinese AI From Federal Agencies</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-26",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/bipartisan-bill-aims-to-block-chinese-ai-from-federal-agencies/"
    },
    {
        "Title": "Man Who Hacked Organizations to Advertise Security Services Pleads Guilty",
        "Link": "https://www.securityweek.com/man-who-hacked-organizations-to-advertise-security-services-pleads-guilty/",
        "Summary": "<p>Nicholas Michael Kloster has pleaded guilty to computer hacking after targeting at least two organizations.</p>\n<p>The post <a href=\"https://www.securityweek.com/man-who-hacked-organizations-to-advertise-security-services-pleads-guilty/\">Man Who Hacked Organizations to Advertise Security Services Pleads Guilty</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-26",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/man-who-hacked-organizations-to-advertise-security-services-pleads-guilty/"
    },
    {
        "Title": "Bonfy.AI Raises $9.5 Million for Adaptive Content Security Platform",
        "Link": "https://www.securityweek.com/bonfy-ai-raises-9-5-million-for-adaptive-content-security-platform/",
        "Summary": "<p>Bonfy.AI has emerged from stealth mode to help organizations prevent cybersecurity, privacy and compliance risks.</p>\n<p>The post <a href=\"https://www.securityweek.com/bonfy-ai-raises-9-5-million-for-adaptive-content-security-platform/\">Bonfy.AI Raises $9.5 Million for Adaptive Content Security Platform</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-26",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/bonfy-ai-raises-9-5-million-for-adaptive-content-security-platform/"
    },
    {
        "Title": "CISA Warns AMI BMC Vulnerability Exploited in the Wild",
        "Link": "https://www.securityweek.com/cisa-warns-ami-bmc-vulnerability-exploited-in-the-wild/",
        "Summary": "<p>CISA is urging federal agencies to patch a recent AMI BMC vulnerability and a half-a-decade-old bug in FortiOS by July 17.</p>\n<p>The post <a href=\"https://www.securityweek.com/cisa-warns-ami-bmc-vulnerability-exploited-in-the-wild/\">CISA Warns AMI BMC Vulnerability Exploited in the Wild</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-26",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cisa-warns-ami-bmc-vulnerability-exploited-in-the-wild/"
    },
    {
        "Title": "Central Kentucky Radiology Data Breach Impacts 167,000",
        "Link": "https://www.securityweek.com/central-kentucky-radiology-data-breach-impacts-167000/",
        "Summary": "<p>The personal information of 167,000 individuals was compromised in an October 2024 data breach at Central Kentucky Radiology.</p>\n<p>The post <a href=\"https://www.securityweek.com/central-kentucky-radiology-data-breach-impacts-167000/\">Central Kentucky Radiology Data Breach Impacts 167,000</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-26",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/central-kentucky-radiology-data-breach-impacts-167000/"
    },
    {
        "Title": "Critical Cisco ISE Vulnerabilities Allow Remote Code Execution",
        "Link": "https://www.securityweek.com/critical-cisco-ise-vulnerabilities-allow-remote-code-execution/",
        "Summary": "<p>Two critical vulnerabilities in Cisco ISE could allow remote attackers to execute arbitrary code with root privileges.</p>\n<p>The post <a href=\"https://www.securityweek.com/critical-cisco-ise-vulnerabilities-allow-remote-code-execution/\">Critical Cisco ISE Vulnerabilities Allow Remote Code Execution </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-26",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/critical-cisco-ise-vulnerabilities-allow-remote-code-execution/"
    },
    {
        "Title": "British Man Suspected of Being the Hacker IntelBroker Arrested, Charged",
        "Link": "https://www.securityweek.com/british-man-suspected-of-being-the-hacker-intelbroker-arrested-charged/",
        "Summary": "<p>25-year-old Kai West, believed to be the hacker IntelBroker, was arrested in France and charged by the United States.</p>\n<p>The post <a href=\"https://www.securityweek.com/british-man-suspected-of-being-the-hacker-intelbroker-arrested-charged/\">British Man Suspected of Being the Hacker IntelBroker Arrested, Charged</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-26",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/british-man-suspected-of-being-the-hacker-intelbroker-arrested-charged/"
    },
    {
        "Title": "Critical Citrix NetScaler Flaw Exploited as Zero-Day",
        "Link": "https://www.securityweek.com/critical-citrix-netscaler-flaw-exploited-as-zero-day/",
        "Summary": "<p>Citrix has released patches for a critical vulnerability in NetScaler ADC and NetScaler Gateway exploited as a zero-day.</p>\n<p>The post <a href=\"https://www.securityweek.com/critical-citrix-netscaler-flaw-exploited-as-zero-day/\">Critical Citrix NetScaler Flaw Exploited as Zero-Day</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-26",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/critical-citrix-netscaler-flaw-exploited-as-zero-day/"
    },
    {
        "Title": "Qilin Ransomware Allegedly Hits Five Companies Including Tecore Networks, CMI, and Habitat for Humanity",
        "Link": "https://dailydarkweb.net/qilin-ransomware-allegedly-hits-five-companies-including-tecore-networks-cmi-and-habitat-for-humanity/",
        "Summary": "The Qilin ransomware group has once again updated its dark web leak portal, allegedly adding five new victims from a wide array of business sectors. The targeted organizations, whose data was posted on June 25, 2025, span telecommunications, finance, electronics, blockchain technology, and the non-profit sector. This attack highlights the group&#8217;s continued and indiscriminate campaign [&#8230;]",
        "Date": "2025-06-26",
        "Content": "The Qilin ransomware group has once again updated its dark web leak portal, allegedly adding five new victims from a wide array of business sectors. The targeted organizations, whose data was posted on June 25, 2025, span telecommunications, finance, electronics, blockchain technology, and the non-profit sector. This attack highlights the group’s continued and indiscriminate campaign against global entities, demonstrating that no industry is safe from its operations.\nThe organizations allegedly breached by the threat actors include:\nTecore Networks:\nA Hanover, Maryland-based global supplier of critical 2G, 3G, 4G, and 5G-ready mobile network infrastructure.\nCredit Mediators Inc. (CMI):\nA U.S. firm with over 40 years of experience in commercial B2B debt recovery and collection services, handling sensitive financial data for a diverse client base.\nGudeco Elektronik:\nA German electronics company that has been a key distributor and contractual partner for leading electronics manufacturers for more than four decades.\nAeroblox:\nA technology platform focused on optimizing tokenized assets through smart contracts.\nHabitat for Humanity of Greater Sioux Falls, Inc.:\nA non-profit organization committed to building and advocating for affordable housing, working with community members, donors, and volunteers.\nAs proof of the breaches, the ransomware group has allegedly published a significant number of sensitive internal files from each victim. The exposed information underscores the severity of the intrusions, with the leak containing everything from internal financial reports to client data and personal identification documents. This incident serves as a stark reminder of the pervasive threat of ransomware. The allegedly leaked data includes:\nCredit Mediators Inc.:\nBank account information, client data, and internal forms.\nTecore Networks:\nInternal documents, network infrastructure files, and FCC-related filings.\nGudeco Elektronik:\nConfidential non-disclosure agreements and internal reports.\nAeroblox:\nMicrosoft SQL server database file listings.\nHabitat for Humanity:\nInternal financial spreadsheets, applications, and personal identification documents.\nTags:\nAeroblox\nCMI\nCredit Mediators Inc\nCyberSecurity\ndata-breach\ndata-leak\nGudeco Elektronik\nHabitat for Humanity\nQilin\nransomware\nTecore"
    },
    {
        "Title": "Major Israeli Staffing Firms JobPlace and QHR Allegedly Breached by Handala Group",
        "Link": "https://dailydarkweb.net/major-israeli-staffing-firms-jobplace-and-qhr-allegedly-breached-by-handala-group/",
        "Summary": "A hacktivist group has allegedly breached the systems of two major Israeli employment and staffing companies, JobPlace Ltd and QHR Ltd. The group, calling itself Handala, claimed responsibility for the attacks, stating they have exfiltrated massive amounts of sensitive data. JobPlace is described as one of the largest employment and staffing companies in Israel, working [&#8230;]",
        "Date": "2025-06-26",
        "Content": "A hacktivist group has allegedly breached the systems of two major Israeli employment and staffing companies, JobPlace Ltd and QHR Ltd. The group, calling itself Handala, claimed responsibility for the attacks, stating they have exfiltrated massive amounts of sensitive data. JobPlace is described as one of the largest employment and staffing companies in Israel, working with sensitive governmental and security institutions, while QHR is another significant recruitment firm in the region. The attackers have framed the operation as a politically motivated act.\nThe group behind the attack claims to have compromised all internal systems of JobPlace, allegedly making off with over 621 GB of data. They further assert that they have acquired 403 GB of data from QHR Ltd. According to the hacktivist group’s statement, the breach was comprehensive, and the stolen information has been transferred to other intelligence services aligned with their cause. The attackers declared they are not seeking a ransom and that this is part of a larger campaign.\nThe data allegedly stolen from JobPlace is said to be extensive and includes a wide range of sensitive information. The compromised files reportedly contain:\nEmployee details\nClient information\nRecruitment documents\nInternal communications\nInfrastructure configurations\nPersonal and classified data of hundreds of thousands of individuals\nTags:\nCyberSecurity\ndata-breach\nhacktivist\nHandala\nIsrael\nJobPlace\nQHR Ltd\nrecruitment"
    },
    {
        "Title": "Spanish Insurer Asemas Allegedly Breached – 11 Million Records for Sale Online",
        "Link": "https://dailydarkweb.net/spanish-insurer-asemas-allegedly-breached-11-million-records-for-sale-online/",
        "Summary": "Asemas, a prominent Spanish mutual insurance company, has allegedly become the victim of a significant data breach. A threat actor has posted on a dark web forum claiming to be in possession of a database containing 11 million records belonging to the insurer. The post, which appeared on June 26, 2025, offers the entire database [&#8230;]",
        "Date": "2025-06-26",
        "Content": "Asemas, a prominent Spanish mutual insurance company, has allegedly become the victim of a significant data breach. A threat actor has posted on a dark web forum claiming to be in possession of a database containing 11 million records belonging to the insurer. The post, which appeared on June 26, 2025, offers the entire database for sale and includes a sample of the data to seemingly validate their claims.\nFounded in 1983, Asemas is a key provider of professional civil liability insurance for architects and other professionals within the Spanish construction sector. The company insures both individuals and businesses, making the scope of the alleged breach particularly concerning for this professional community. The origin of the data appears to be a direct compromise of the company’s customer and company databases.\nThe compromised data allegedly contains a vast amount of sensitive personal and financial information. If the claims are verified, this incident could expose the victims to a high risk of fraud, identity theft, and targeted phishing attacks. The following information is allegedly included in the leaked database:\nCustomer ID\nFull Name\nDate of Birth\nNational ID\nCustomer Type\nAddress\nPostal Code and City\nPhone Number\nEmail Address\nIBAN (International Bank Account Number)\nPayment Method\nTags:\nAsemas\nCyberSecurity\ndark web\ndata-breach\nInsurance\nSpain"
    },
    {
        "Title": "Thai Conglomerate BTS Group Holdings Allegedly Breached",
        "Link": "https://dailydarkweb.net/thai-conglomerate-bts-group-holdings-allegedly-breached/",
        "Summary": "A threat actor has allegedly breached BTS Group Holdings, a major conglomerate in Thailand, and is now selling the company&#8217;s data on a popular hacking forum. The seller claims to have the full database from ewet.bts.co.th, a website that appears to be an internal training or learning management portal for the company. The data dump [&#8230;]",
        "Date": "2025-06-26",
        "Content": "A threat actor has allegedly breached BTS Group Holdings, a major conglomerate in Thailand, and is now selling the company’s data on a popular hacking forum. The seller claims to have the full database from\newet.bts.co.th\n, a website that appears to be an internal training or learning management portal for the company. The data dump is being sold for $350, with the actor also offering “super admin access” to the website and a PHP reverse shell, which could potentially allow for deeper network infiltration.\nBTS Group Holdings is a significant player in Thailand’s economy, best known as the operator of the Bangkok Mass Transit System (BTS Skytrain) and the Bangkok BRT. The company’s interests also extend across media, property development, and other services, making it a high-profile target. The compromised system, according to screenshots, contains records for 6,277 users. The leaked information allegedly includes a wide range of personally identifiable information (PII) that could be leveraged for phishing, identity theft, and other malicious activities.\nThe threat actor provided screenshots showing the website’s administration panel and a large spreadsheet containing user data. An analysis of the images indicates the following information has allegedly been compromised:\nFull names\nUsernames and hashed passwords\nEmail addresses\nPhone numbers\nInstitutional and departmental details\nIP addresses\nPhysical addresses\nA range of other system-related user data\nThe vulnerability that led to the breach is reportedly still undiscovered, posing an ongoing risk to the company and its employees whose data is now exposed.\nTags:\nBTS Group\nconglomerate\ncyberattack\nCyberSecurity\ndata-breach\nhacking forum\nPII Leak\nThailand"
    },
    {
        "Title": "The Unmasking of IntelBroker: Inside the Global Manhunt that Toppled a Cybercrime Kingpin",
        "Link": "https://dailydarkweb.net/the-unmasking-of-intelbroker-inside-the-global-manhunt-that-toppled-a-cybercrime-kingpin/",
        "Summary": "In a major victory for international law enforcement, U.S. federal authorities have unsealed a criminal indictment identifying 25-year-old British national Kai West as the notorious hacker &#8220;IntelBroker.&#8221; The announcement follows West&#8217;s arrest in France in February, which was part of a sprawling investigation that also saw French police detain four other alleged administrators of BreachForums, [&#8230;]",
        "Date": "2025-06-26",
        "Content": "In a major victory for international law enforcement, U.S. federal authorities have unsealed a criminal indictment identifying 25-year-old British national Kai West as the notorious hacker “IntelBroker.” The announcement follows West’s arrest in France in February, which was part of a sprawling investigation that also saw French police detain four other alleged administrators of BreachForums, one of the world’s most infamous online marketplaces for stolen data. The four-count indictment from the Southern District of New York charges West with conspiracy to commit computer intrusions and wire fraud. If convicted, he faces a potential prison sentence of up to 50 years, reflecting the gravity of his alleged crimes.\nBefore his capture, IntelBroker was one of the most feared figures in the digital underground, leading a hacking collective known as “CyberNiggers.” He orchestrated a years-long campaign of digital theft that caused more than $25 million in damages to dozens of victims globally. His list of targets included corporate giants and government entities, such as Hewlett-Packard Enterprises, Cisco, General Electric, and Advanced Micro Devices (AMD). He gained particular notoriety for hacking DC Health Link, the health insurance marketplace for the U.S. capital, and selling the sensitive personal data of members of Congress. His influence grew to the point that he took over as the owner and administrator of BreachForums, placing him at the center of the illicit data trade.\nThe myth of IntelBroker’s anonymity was shattered by a series of critical operational security (OPSEC) failures. The investigation turned a corner when an undercover officer purchased stolen data from him using Bitcoin. Investigators successfully traced the cryptocurrency transaction to the Ramp trading platform, a regulated service where West made a catastrophic error. To verify his account, he submitted a copy of his authentic driver’s license, providing the “smoking gun” that linked the digital alias to his real-world identity. This breakthrough was compounded by further mistakes, including using the same email address for the crypto platform, a personal social media account, and a VPN service, and accessing personal accounts from the same IP address used for his hacking activities.\nThe successful takedown, a product of meticulous coordination between the FBI and law enforcement in France, Spain, and the United Kingdom, has sent shockwaves through the cybercrime world. While experts call the arrests a “pivotal moment” that has significantly disrupted the data marketplace, they also warn of the “hydra effect,” where new criminals will inevitably rise to fill the power vacuum. In the short term, the operation has sown paranoia and mistrust among threat actors. However, the public detailing of West’s mistakes serves as a lesson for other criminals, who will likely evolve their methods to become more secure and harder to track, presenting a greater challenge for law enforcement in the future.\nTags:\nArrest\nbreachforums\ncyber-attack\ncybercrime\nCyberSecurity\ndata-breach\ndepartment of justice\nFBI\nFrench Police\nhacker\nhacking\nIndictment\nIntelBroker\nInternational Cooperation\nKai West\nlaw enforcement"
    }
]