[
    {
        "Title": "ChatGPT's AI coder Codex now lets you choose the best solution",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpts-ai-coder-codex-now-lets-you-choose-the-best-solution/",
        "Summary": "ChatGPT's Codex, which is an AI agent that lets you code and delegate programming tasks, is now testing a new feature that lets you choose the best solution. [...]",
        "Date": "2025-06-15",
        "Content": "ChatGPT's Codex, which is an AI agent that lets you code and delegate programming tasks, is now testing a new feature that lets you choose the best solution.\nOpenAI\nlaunched\nCodex in April, and it's a great tool, but it's nowhere close to replacing entry-level engineers.\nOpenAI insists Codex could help developers achieve more by delegating their tasks to different agents, and a new update brings it closer to the expectations set by the company.\nAs per the\nrelease notes\n, ChatGPT Codex can now generate multiple responses simultaneously for a single task.\nThis means users can now explore multiple solutions, and pick the best approach instead of asking OpenAI to give another approach.\nIn addition, OpenAI has added some keyboard shortcuts and a page to explore them.\nFor example, you can now open Codex by pressing ⌘-/ on macOS and Ctrl+/ on other platforms. The update has added a “branch” query parameter in addition to the existing “environment”, “prompt” and “tab=archived” parameters.\nHere's the complete changelog:\nAdded a loading indicator when downloading a repo during container setup.\nAdded support for cancelling tasks.\nFixed issues causing tasks to fail during setup.\nFixed issues running followups in environments where the setup script changes files that are gitignored.\nImproved how the agent understands and reacts to network access restrictions.\nIncreased the update rate of text describing what Codex is doing.\nIncreased the limit for setup script duration to 20 minutes for Pro, Team, and Business users.\nPolished code diffs: You can now option-click a code diff header to expand/collapse all of them.\nCodex is based on codex-1, which is a new version of ChatGPT based on the existing o3 model, but it has been optimized for coding, which results in increased accuracy.\nCodex in ChatGPT\nCodex pulls codebase from GitHub, and it can write new code, propose pull requests, and run each task in its own sandbox.\nCodex is available with $20 Plus subscription.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nOpenAI plans to combine multiple models into GPT-5\nChatGPT o3 API 80% price drop has no impact on performance\nChatGPT prepares o3-pro model for $200 Pro subscribers\nOpenAI is hopeful GPT-5 will compete a little more\nChatGPT rolls out Memory upgrade for free users"
    },
    {
        "Title": "ChatGPT Search gets an upgrade as OpenAI takes aim at Google",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-search-gets-an-upgrade-as-openai-takes-aim-at-google/",
        "Summary": "On June 13, OpenAI began rolling out a new ChatGPT Search update to improve quality as the AI startup challenges Google's dominance. [...]",
        "Date": "2025-06-15",
        "Content": "On June 13, OpenAI began rolling out a new ChatGPT Search update to improve quality as the AI startup challenges Google’s dominance.\nChatGPT Search has been around for about a year and allows users to search the web more effectively than Google.\nIt tries to summarize content from websites to provide quick answers and includes links to sources so you can fact-check everything.\n“This blends the benefits of a natural language interface with the value of up-to-date sports scores, news, stock quotes, and more,” OpenAI\nnoted\nin the original ChatGPT Search announcement post.\nAccording to updated\nrelease notes\nspotted by BleepingComputer, ChatGPT Search can now provide more comprehensive, up-to-date responses.\nChatGPT is now better at surfacing news items\nOpenAI won’t say how it improved ChatGPT Search, but the company found that users prefer these changes over the previous search experience.\nAfter the June 13 update, you can expect ChatGPT Search to give smarter responses, understand your queries better, and provide more comprehensive answers.\nIt can also remember longer conversations, which helps improve search results.\n“More robust ability to follow instructions, especially in longer conversations, significantly reducing repetitive responses,” OpenAI noted.\nHowever, like every other AI model, including Google Search’s AI Overviews, OpenAI warns that ChatGPT may still make occasional mistakes and asks you to double-check responses.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nChatGPT's AI coder Codex now lets you choose the best solution\nChatGPT o3 API 80% price drop has no impact on performance\nOpenAI working to fix ChatGPT outage affecting users worldwide\nChatGPT prepares o3-pro model for $200 Pro subscribers\nOpenAI is hopeful GPT-5 will compete a little more"
    },
    {
        "Title": "Over 46,000 Grafana instances exposed to account takeover bug",
        "Link": "https://www.bleepingcomputer.com/news/security/over-46-000-grafana-instances-exposed-to-account-takeover-bug/",
        "Summary": "More than 46,000 internet-facing Grafana instances remain unpatched and exposed to a client-side open redirect vulnerability that allows executing a malicious plugin and account takeover. [...]",
        "Date": "2025-06-15",
        "Content": "More than 46,000 internet-facing Grafana instances remain unpatched and exposed to a client-side open redirect vulnerability that allows executing a malicious plugin and account takeover.\nThe flaw is tracked as\nCVE-2025-4123\nand impacts multiple versions of the open-source platform used for monitoring and visualizing infrastructure and application metrics.\nThe vulnerability was discovered by bug bounty hunter\nAlvaro Balada\nand was addressed in\nsecurity updates\nthat Grafana Labs released on May 21.\nHowever, as of writing this, more than a third of all Grafana instances reachable over the public internet have not been patched, according to researchers at aplication security company OX Security, who refer to the bug as ‘The Grafana Ghost’.\nThe analysts told BleepingComputer that their work focused on demonstrating the ability to weaponize Balada's finding.\nAfter identifying versions vulnerable to the attack, they assesed the exposure by correlating the data with the platform's distribution across the ecosystem.\nThey found 128,864 instances exposed online, with 46,506 still running vulnerable versions that can still be exploited. This corresponds to a percentage of about 36%.\nVulnerable Grafana endpoints\nSource: BleepingComputer\nOX Security’s in-depth analysis of CVE-2025-4123 uncovered that, through a series of exploitation steps combining client-side path traversal with open redirect mechanics, attackers can lure victims into clicking URLs that lead to loading a malicious Grafana plugin from a site controlled by the threat actor.\nThe malicious links could be used to execute arbitrary JavaScript in the user’s browser, the\nresearchers say\n.\nThe exploitation process\nSource: OX Security\nThe exploit does not require elevated privileges and can function even if anonymous access is enabled.\nThe flaw permits attackers to hijack user sessions, change account credentials, and, in cases where the Grafana Image Renderer plugin is installed, perform server-side request forgery (SSRF) to read internal resources.\nWhile the default Content Security Policy (CSP) in Grafana provides some protection, it does not prevent exploitation due to limitations in client-side enforcement.\nOX Security’s exploit demonstrates that CVE-2025-4123 can be exploited client-side and could be leveraged to bypass modern browser normalization mechanisms by through JavaScript routing logic native to Grafana.\nThis allows attackers to exploit URL handling inconsistencies to serve malicious plugins, which in turn modify user email addresses, making account hijacking via password resets trivial.\nAlthough CVE-2025-4123 has several exploitation requirements, like user interaction, an active user session when the victim clicks the link, and having the plugin feature enabled (is enabled by default), the large number of exposed instances and the lack for need of authentication create a significant attack surface.\nTo mitigate the risk of exploitation, it is recommended that Grafana administrators upgrade to versions 10.4.18+security-01, 11.2.9+security-01, 11.3.6+security-01, 11.4.4+security-01, 11.5.4+security-01, 11.6.1+security-01, and 12.0.0+security-01.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nGitLab patches high severity account takeover, missing auth issues\nTrend Micro fixes critical vulnerabilities in multiple products\nGraphite spyware used in Apple iOS zero-click attacks on journalists\nPassword-spraying attacks target 80,000 Microsoft Entra ID accounts\nHackers exploited Windows WebDav zero-day to drop malware"
    }
]