[
    {
        "Title": "WordPress Sites Turned Weapon: How VexTrio and Affiliates Run a Global Scam Network",
        "Link": "https://thehackernews.com/2025/06/wordpress-sites-turned-weapon-how.html",
        "Summary": "The threat actors behind the VexTrio Viper Traffic Distribution Service (TDS) have been linked to other TDS services like Help TDS and Disposable TDS, indicating that the sophisticated cybercriminal operation is a sprawling enterprise of its own that's designed to distribute malicious content.\n\"VexTrio is a group of malicious adtech companies that distribute scams and harmful software via",
        "Date": "2025-06-12",
        "Content": "The threat actors behind the\nVexTrio Viper\nTraffic Distribution Service (TDS) have been linked to other TDS services like Help TDS and Disposable TDS, indicating that the sophisticated cybercriminal operation is a sprawling enterprise of its own that's designed to distribute malicious content.\n\"VexTrio is a group of malicious adtech companies that distribute scams and harmful software via different advertising formats, including smartlinks and push notifications,\" Infoblox\nsaid\nin a deep-dive report shared with The Hacker News.\nSome of the malicious adtech companies under VexTrio Viper include Los Pollos, Taco Loco, and Adtrafico. These companies operate what's called a commercial affiliate network that connects malware actors whose websites unsuspecting users land on and so-called \"advertising affiliates\" who offer various forms of illicit schemes like gift card fraud, malicious apps, phishing sites, and scams.\nPut differently, these malicious traffic distribution systems are\ndesigned\nto redirect victims to their destinations through a SmartLink or direct offer. Los Pollos, per the DNS threat intelligence firm, enlists malware distributors (aka publishing affiliates) with promises of high-paying offers, whereas Taco Loco specializes in push monetization and recruits advertising affiliates.\nAnother notable component of these attacks is the compromise of WordPress websites to inject malicious code that's responsible for initiating the redirection chain, ultimately leading visitors to VexTrio scam infrastructure. Examples of such injections include\nBalada\n,\nDollyWay\n,\nSign1\n, and\nDNS TXT record campaigns\n.\n\"These scripts redirect site visitors to various scam pages through traffic broker networks associated with VexTrio, one of the largest known cybercriminal affiliate networks that leverages sophisticated DNS techniques, traffic distribution systems, and domain generation algorithms to deliver malware and scams across global networks,\" GoDaddy\nnoted\nin a report published in March 2025.\nVexTrio's operations suffered a blow around mid-November 2024 after Qurium\nrevealed\nthat the Swiss-Czech adtech company Los Pollos was part of VexTrio, causing Los Pollos to cease their push link monetization. This, in turn, triggered an exodus, causing threat actors that relied heavily on the Los Pollos network to move to alternate redirect destinations such as Help TDS and Disposable TDS.\nChanges in behavior over time from the two independent C2 sets\nInfoblox's analysis of 4.5 million DNS TXT record responses from compromised websites over a six-month period has revealed that the domains that were part of the DNS TXT record campaigns could be classified into two sets, each with its own distinct command-and-control (C2) server.\n\"Both servers were hosted in Russian-connected infrastructure, but neither their hosting nor their TXT responses overlapped,\" the company said. \"Each set maintained different redirect URL structures, even though they both originally led to VexTrio and subsequently to the Help TDS.\"\nFurther evidence has uncovered that both Help TDS and Disposable TDS are one and the same, and that the services enjoyed an \"exclusive relationship\" with VexTrio until November 2024. Help TDS, which historically redirected traffic to VexTrio domains, has since shifted to Monetizer, a monetization platform that uses TDS technology to connect web traffic from publisher affiliates to advertisers.\n\"The Help TDS has a strong Russian nexus, with hosting and domain registration frequently done via Russian entities,\" Infoblox said, describing the operators as possibly independent. \"It does not have the full-blown functionality of the VexTrio TDSs and has no obvious commercial ties beyond its eerie connections with VexTrio.\"\nVexTrio is one among the many TDSs that have been outed as commercial adtech firms, the others being Partners House, BroPush, RichAds, Admeking, and RexPush. Many of these are geared towards push notification services by making use of Google Firebase Cloud Messaging (FCM) or Push API-based custom-developed scripts to distribute links to malicious content via push notifications.\n\"Hundreds of thousands of compromised websites around the world every year redirect victims to the tangled web of VexTrio and VexTrio-affiliate TDSs,\" the company said.\n\"VexTrio and the other affiliate advertising companies know who the malware actors are, or they at least have enough information to track them down. Many of the companies are registered in countries that require some degree of 'know your customer' (KYC), but even without these requirements, publishing affiliates are vetted by their customer managers.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "New TokenBreak Attack Bypasses AI Moderation with Single-Character Text Changes",
        "Link": "https://thehackernews.com/2025/06/new-tokenbreak-attack-bypasses-ai.html",
        "Summary": "Cybersecurity researchers have discovered a novel attack technique called TokenBreak that can be used to bypass a large language model's (LLM) safety and content moderation guardrails with just a single character change.\n\"The TokenBreak attack targets a text classification model's tokenization strategy to induce false negatives, leaving end targets vulnerable to attacks that the implemented",
        "Date": "2025-06-12",
        "Content": "Cybersecurity researchers have discovered a novel attack technique called\nTokenBreak\nthat can be used to bypass a large language model's (LLM) safety and content moderation guardrails with just a single character change.\n\"The TokenBreak attack targets a text classification model's tokenization strategy to induce false negatives, leaving end targets vulnerable to attacks that the implemented protection model was put in place to prevent,\" Kieran Evans, Kasimir Schulz, and Kenneth Yeung\nsaid\nin a report shared with The Hacker News.\nTokenization\nis a\nfundamental step\nthat LLMs use to break down raw text into their atomic units – i.e., tokens – which are common sequences of characters found in a set of text. To that end, the text input is converted into their numerical representation and fed to the model.\nLLMs work by understanding the statistical relationships between these tokens, and produce the next token in a sequence of tokens. The output tokens are detokenized to human-readable text by mapping them to their corresponding words using the tokenizer's vocabulary.\nThe attack technique devised by HiddenLayer targets the tokenization strategy to bypass a text classification model's ability to detect malicious input and flag safety, spam, or content moderation-related issues in the textual input.\nSpecifically, the artificial intelligence (AI) security firm found that altering input words by adding letters in certain ways caused a text classification model to break.\nExamples include changing \"instructions\" to \"finstructions,\" \"announcement\" to \"aannouncement,\" or \"idiot\" to \"hidiot.\" These subtle changes cause different tokenizers to split the text in different ways, while still preserving their meaning for the intended target.\nWhat makes the attack notable is that the manipulated text remains fully understandable to both the LLM and the human reader, causing the model to elicit the same response as what would have been the case if the unmodified text had been passed as input.\nBy introducing the manipulations in a way without affecting the model's ability to comprehend it, TokenBreak increases its potential for prompt injection attacks.\n\"This attack technique manipulates input text in such a way that certain models give an incorrect classification,\" the researchers\nsaid\nin an accompanying paper. \"Importantly, the end target (LLM or email recipient) can still understand and respond to the manipulated text and therefore be vulnerable to the very attack the protection model was put in place to prevent.\"\nThe attack has been found to be successful against text classification models using BPE (Byte Pair Encoding) or WordPiece tokenization strategies, but not against those using Unigram.\n\"The TokenBreak attack technique demonstrates that these protection models can be bypassed by manipulating the input text, leaving production systems vulnerable,\" the researchers said. \"Knowing the family of the underlying protection model and its tokenization strategy is critical for understanding your susceptibility to this attack.\"\n\"Because tokenization strategy typically correlates with model family, a straightforward mitigation exists: Select models that use Unigram tokenizers.\"\nTo defend against TokenBreak, the researchers suggest using Unigram tokenizers when possible, training models with examples of bypass tricks, and checking that tokenization and model logic stays aligned. It also helps to log misclassifications and look for patterns that hint at manipulation.\nThe study comes less than a month after HiddenLayer revealed how it's possible to exploit Model Context Protocol (\nMCP\n) tools to extract sensitive data: \"By inserting specific parameter names within a tool's function, sensitive data, including the full system prompt, can be extracted and exfiltrated,\" the company\nsaid\n.\nThe finding also comes as the Straiker AI Research (STAR) team found that backronyms can be used to jailbreak AI chatbots and trick them into generating an undesirable response, including swearing, promoting violence, and producing sexually explicit content.\nThe technique, called the Yearbook Attack, has proven to be effective against various models from Anthropic, DeepSeek, Google, Meta, Microsoft, Mistral AI, and OpenAI.\n\"They blend in with the noise of everyday prompts — a quirky riddle here, a motivational acronym there – and because of that, they often bypass the blunt heuristics that models use to spot dangerous intent,\" security researcher Aarushi Banerjee\nsaid\n.\n\"A phrase like 'Friendship, unity, care, kindness' doesn't raise any flags. But by the time the model has completed the pattern, it has already served the payload, which is the key to successfully executing this trick.\"\n\"These methods succeed not by overpowering the model's filters, but by slipping beneath them. They exploit completion bias and pattern continuation, as well as the way models weigh contextual coherence over intent analysis.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "AI Agents Run on Secret Accounts — Learn How to Secure Them in This Webinar",
        "Link": "https://thehackernews.com/2025/06/ai-agents-run-on-secret-accounts-learn.html",
        "Summary": "AI is changing everything — from how we code, to how we sell, to how we secure. But while most conversations focus on what AI can do, this one focuses on what AI can break — if you’re not paying attention.\nBehind every AI agent, chatbot, or automation script lies a growing number of non-human identities — API keys, service accounts, OAuth tokens — silently operating in the background.\nAnd here’s",
        "Date": "2025-06-12",
        "Content": "AI is changing everything — from how we code, to how we sell, to how we secure. But while most conversations focus on what AI\ncan\ndo, this one focuses on what AI\ncan break\n— if you're not paying attention.\nBehind every AI agent, chatbot, or automation script lies a growing number of\nnon-human identities\n— API keys, service accounts, OAuth tokens — silently operating in the background.\nAnd here's the problem:\n🔐\nThey're invisible\n🧠\nThey're powerful\n🚨\nThey're unsecured\nIn traditional identity security, we protect users. With AI, we've quietly handed over control to software that impersonates users — often with more access, fewer guardrails, and no oversight.\nThis isn't theoretical. Attackers are already exploiting these identities to:\nMove laterally through cloud infrastructure\nDeploy malware via automation pipelines\nExfiltrate data — without triggering a single alert\nOnce compromised, these identities can silently unlock critical systems. You don't get a second chance to fix what you can't see.\nIf you're building AI tools, deploying LLMs, or integrating automation into your SaaS stack — you're already depending on NHIs. And chances are, they're not secured. Traditional IAM tools aren't built for this. You need new strategies — fast.\nThis upcoming webinar, \"\nUncovering the Invisible Identities Behind AI Agents — and Securing Them\n,\" led by\nJonathan Sander\n, Field CTO at\nAstrix Security\n, is not another \"AI hype\" talk. It's a wake-up call — and a roadmap.\nWhat You'll Learn (and Actually Use)\nHow AI agents create\nunseen identity sprawl\nReal-world attack stories that never made the news\nWhy traditional IAM tools can't protect NHIs\nSimple, scalable ways to\nsee\n,\nsecure\n, and\nmonitor\nthese identities\nMost organizations don't realize how exposed they are — until it's too late.\nWatch this Webinar\nThis session is essential for security leaders, CTOs, DevOps leads, and AI teams who can't afford silent failure.\nThe sooner you recognize the risk, the faster you can fix it.\nSeats are limited. And attackers aren't waiting.\nReserve Your Spot Now\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Zero-Click AI Vulnerability Exposes Microsoft 365 Copilot Data Without User Interaction",
        "Link": "https://thehackernews.com/2025/06/zero-click-ai-vulnerability-exposes.html",
        "Summary": "A novel attack technique named EchoLeak has been characterized as a \"zero-click\" artificial intelligence (AI) vulnerability that allows bad actors to exfiltrate sensitive data from Microsoft 365 Copilot's context sans any user interaction.\nThe critical-rated vulnerability has been assigned the CVE identifier CVE-2025-32711 (CVSS score: 9.3). It requires no customer action and has been already",
        "Date": "2025-06-12",
        "Content": "A novel attack technique named EchoLeak has been characterized as a \"zero-click\" artificial intelligence (AI) vulnerability that allows bad actors to exfiltrate sensitive data from Microsoft 365 Copilot's context sans any user interaction.\nThe critical-rated vulnerability has been assigned the CVE identifier CVE-2025-32711 (CVSS score: 9.3). It requires no customer action and has been already addressed by Microsoft. There is no evidence that the shortcoming was exploited maliciously in the wild.\n\"AI command injection in M365 Copilot allows an unauthorized attacker to disclose information over a network,\" the company\nsaid\nin an advisory released Wednesday. It has since been added to\nMicrosoft's Patch Tuesday list\nfor June 2025, taking the total number of fixed flaws to 68.\nAim Security, which discovered and reported the issue,\nsaid\nit's instance of a large language model (LLM) Scope Violation that paves the way for\nindirect prompt injection\n, leading to unintended behavior.\nLLM Scope Violation occurs when an attacker's instructions embedded in untrusted content, e.g., an email sent from outside an organization, successfully tricks the AI system into accessing and processing privileged internal data without explicit user intent or interaction.\n\"The chains allow attackers to automatically exfiltrate sensitive and proprietary information from M365 Copilot context, without the user's awareness, or relying on any specific victim behavior,\" the Israeli cybersecurity company said. \"The result is achieved despite M365 Copilot's interface being open only to organization employees.\"\nIn EchoLeak's case, the attacker embeds a malicious prompt payload inside markdown-formatted content, like an email, which is then parsed by the AI system's retrieval-augmented generation (RAG) engine. The payload silently triggers the LLM to extract and return private information from the user's current context.\nThe attack sequence unfolds as follows -\nInjection\n: Attacker sends an innocuous-looking email to an employee's Outlook inbox, which includes the LLM scope violation exploit\nUser asks\nMicrosoft 365 Copilot a business-related question (e.g., summarize and analyze their earnings report)\nScope Violation:\nCopilot mixes untrusted attacked input with sensitive data to LLM context by the Retrieval-Augmented Generation (\nRAG\n) engine\nRetrieval:\nCopilot leaks the sensitive data to the attacker via Microsoft Teams and SharePoint URLs\nImportantly, no user clicks are required to trigger EchoLeak. The attacker relies on Copilot's default behavior to combine and process content from Outlook and SharePoint without isolating trust boundaries – turning helpful automation into a silent leak vector.\n\"As a zero-click AI vulnerability, EchoLeak opens up extensive opportunities for data exfiltration and extortion attacks for motivated threat actors,\" Aim Security said. \"In an ever-evolving agentic world, it showcases the potential risks that are inherent in the design of agents and chatbots.\"\n\"The attack results in allowing the attacker to exfiltrate the most sensitive data from the current LLM context - and the LLM is being used against itself in making sure that the MOST sensitive data from the LLM context is being leaked, does not rely on specific user behavior, and can be executed both in single-turn conversations and multi-turn conversations.\"\nEchoLeak is especially dangerous because it exploits how Copilot retrieves and ranks data – using internal document access privileges – which attackers can influence indirectly via payload prompts embedded in seemingly benign sources like meeting notes or email chains.\nMCP and Advanced Tool Poisoning\nThe disclosure comes as CyberArk disclosed a tool poisoning attack (\nTPA\n) that affects the Model Context Protocol (\nMCP\n) standard and goes beyond the tool description to extend it across the entire tool schema. The attack technique has been codenamed Full-Schema Poisoning (FSP).\n\"While most of the attention around tool poisoning attacks has focused on the description field, this vastly underestimates the other potential attack surface,\" security researcher Simcha Kosman\nsaid\n. \"Every part of the tool schema is a potential injection point, not just the description.\"\nMCP tool poisoning attacks (Credit: Invariant Labs)\nThe cybersecurity company said the problem is rooted in MCP's \"fundamentally optimistic trust model\" that equates syntactic correctness to semantic safety and assumes that LLMs only reason over explicitly documented behaviors.\nWhat's more, TPA and FSP could be weaponized to stage advanced tool poisoning attacks (ATPA), wherein the attacker designs a tool with a benign description but displays a fake error message that tricks the LLM into accessing sensitive data (e.g., SSH keys) in order to address the purported issue.\n\"As LLM agents become more capable and autonomous, their interaction with external tools through protocols like MCP will define how safely and reliably they operate,\" Kosman said. \"Tool poisoning attacks — especially advanced forms like ATPA — expose critical blind spots in current implementations.\"\nThat's not all. Given that MCP enables AI agents (or assistants) to interact with various tools, services, and data sources in a consistent manner, any vulnerability in the MCP client-server architecture could pose serious security risks, including manipulating an agent into leaking data or executing malicious code.\nThis is evidenced in a recently disclosed critical security flaw in the popular\nGitHub MCP integration\n, which, if successfully exploited, could allow an attacker to hijack a user's agent via a malicious GitHub issue, and coerce it into leaking data from private repositories when the user prompts the model to \"take a look at the issues.\"\n\"The issue contains a payload that will be executed by the agent as soon as it queries the public repository's list of issues,\" Invariant Labs researchers Marco Milanta and Luca Beurer-Kellner\nsaid\n, categorizing it as a case of a toxic agent flow.\nThat said, the vulnerability cannot be addressed by GitHub alone through server-side patches, as it's more of a \"fundamental architectural issue,\" necessitating that users implement granular permission controls to ensure that the agent has access to only those repositories it needs to interact with and continuously audit interactions between agents and MCP systems.\nMake Way for the MCP Rebinding Attack\nThe rapid ascent of MCP as the \"connective tissue for enterprise automation and agentic applications\" has also opened up new attack avenues, such as Domain Name System (DNS) rebinding, to access sensitive data by exploiting Server-Sent Events (\nSSE\n), a protocol used by MCP servers for real-time streaming communication to the MCP clients.\nDNS rebinding attacks\nentail\ntricking a victim's browser into treating an external domain as if it belongs to the internal network (i.e., localhost). These attacks, which are engineered to circumvent same-origin policy (\nSOP\n) restrictions, are triggered when a user visits a malicious site set up by the attacker via phishing or social engineering.\n\"There is a disconnect between the browser security mechanism and networking protocols,\" GitHub's Jaroslav Lobacevski\nsaid\nin an explainer on DNS rebinding published this week. \"If the resolved IP address of the web page host changes, the browser doesn't take it into account and treats the webpage as if its origin didn't change. This can be abused by attackers.\"\nThis behavior essentially allows client-side JavaScript from a malicious site to bypass security controls and target other devices on the victim's private network that are not exposed to the public internet.\nMCP rebinding attack\nThe MCP rebinding attack takes advantage of an adversary-controlled website's ability to access internal resources on the victim's local network so as to interact with the MCP server running on localhost over SSE and ultimately exfiltrate confidential data.\n\"By abusing SSE's long-lived connections, attackers can pivot from an external phishing domain to target internal MCP servers,\" the Straiker AI Research (STAR) team\nsaid\nin an analysis published last month.\nIt's worth noting that SSE has been deprecated as of November 2024 in favor of\nStreamable HTTP\nowing to the risks posed by DNS rebinding attacks. To mitigate the threat of such attacks, it's advised to enforce authentication on MCP Servers and validate the \"Origin\" header on all incoming connections to the MCP server to ensure that the requests are coming from trusted sources.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Non-Human Identities: How to Address the Expanding Security Risk",
        "Link": "https://thehackernews.com/2025/06/non-human-identities-how-to-address.html",
        "Summary": "Human identities management and control is pretty well done with its set of dedicated tools, frameworks, and best practices. This is a very different world when it comes to Non-human identities also referred to as machine identities. GitGuardian’s end-to-end NHI security platform is here to close the gap.\nEnterprises are Losing Track of Their Machine Identities\nMachine identities–service",
        "Date": "2025-06-12",
        "Content": "Human identities management and control is pretty well done with its set of dedicated tools, frameworks, and best practices. This is a very different world when it comes to Non-human identities also referred to as machine identities. GitGuardian's end-to-end NHI security platform is here to close the gap.\nEnterprises are Losing Track of Their Machine Identities\nMachine identities–service accounts, API keys, bots, automation, and workload identities–that now outnumber humans by up to 100:1 are in fact a massive blind spot in companies' security landscape:\nWithout robust governance, NHIs become a prime target for attackers. Orphaned credentials, over-privileged accounts, and \"zombie\" secrets are proliferating—especially as\norganizations accelerate cloud adoption, integrate AI-powered agents, and automate their infrastructure\n.\nSecrets Sprawl: The New Attack Surface\nGitGuardian's research shows that 70% of valid secrets detected in public repositories in 2022 remained active in 2025—a three-year window of vulnerability. These aren't just theoretical risks. Breaches at organizations like the U.S. Department of the Treasury, Toyota, and The New York Times all began with a leaked or unmanaged machine identity.\nThe problem isn't just about volume. Secrets and credentials are scattered across code, CI/CD pipelines, cloud environments, and ticketing systems— environments outside traditional security perimeters.\nThis proliferation of unmanaged secrets has caught the attention of security frameworks worldwide. The newly released\nOWASP Top 10 Non-Human Identity Risks for 2025\nspecifically calls out 'Secret Leakage' as the #2 risk, noting that compromised credentials are implicated in over 80% of breaches.\nWhy Secrets Managers Alone Aren't Enough\nTraditional secrets managers (like HashiCorp Vault, CyberArk, AWS Secrets Manager, and Azure Key Vault) are essential for secure storage—but they don't address the full lifecycle of NHI governance. They can't discover secrets outside the vault, lack context around permissions, and don't automate remediation when secrets are leaked or misused.\nGitGuardian's own analysis found that organizations using secrets managers are in fact more prone to secrets leakage. The secrets leakage incidence of repositories leveraging secrets managers is 5.1% compared with 4.6% for public repositories without secrets managers in place. And to add to this point, repositories with secret managers are more likely to handle sensitive information, increasing the risk of exposure.\nThe Platform Filling the NHI Security Gap\nTo address these challenges, organizations must adopt a unified IAM strategy that\nempowers DevOps and SRE teams to effectively govern and secure NHIs, on top of the deployment of secrets management solutions (vaults and or secrets managers). This requires investing in solutions that provide comprehensive secrets discovery, centralized visibility, and automated governance capabilities. By leveraging tools that can map relationships between secrets, enforce consistent policies, and streamline rotation and remediation processes, DevOps and SRE teams can reduce the burden of secrets lifecycle management and focus on delivering value to the business.\nGitGuardian's\nNHI Security Platform\nis designed to address these exact blind spots and risks. Here's how:\n1. Discovery and Inventory: Finding the Invisible\nManual discovery of machine identities is a lost battle. Secrets exist across repositories, CI/CD pipelines, ticketing systems, messengers, and cloud environments—often in places security teams don't monitor. Traditional approaches can't keep pace with the dynamic nature of modern infrastructure, leading to incomplete inventories.\nGitGuardian's automated discovery continuously scans these environments, maintaining a real-time inventory enriched with contextual metadata. This centralized view serves as the foundation for effective governance.\n2. Onboarding and Provisioning: Securing from Day One\nInconsistent provisioning processes create immediate risks—misconfigurations, over-permissioned identities, and manual errors. Organizations need standardized workflows that enforce the least privilege access and integrate with centralized secrets management.\nA unified platform ensures consistency across teams and provides real-time visibility into permissions, maintaining a secure and compliant ecosystem from the start.\n3. Continuous Monitoring: Staying Ahead of Threats\nModern enterprises face a monitoring nightmare: machine identities interact across dozens of systems, each with separate logging mechanisms. With organizations averaging six different secret management instances (according to \"Voice of Practitioners: The State of Secrets in AppSec\"), maintaining consistent policies becomes nearly impossible.\nGitGuardian aggregates and normalizes usage data from multiple sources, providing centralized visibility. Advanced analytics and anomaly detection enable rapid response to high-risk events and policy violations.\n4. Rotation and Remediation: Keeping Credentials Fresh\nThe stakes are high: CyberArk reports that 72% of organizations experienced certificate-related outages in the past year, with 34% suffering multiple incidents. Managing rotation at scale is complex, especially with system dependencies and inconsistent schedules.\nGitGuardian integrates with popular secrets managers, providing contextual insights to identify owners and streamline remediation, minimizing security incident impact.\n5. Decommissioning: Eliminating Zombie Credentials\nUnused or stale identities accumulate as \"zombie\" credentials—prime targets for attackers. Fragmented tooling and inconsistent processes make proper offboarding difficult, leading to persistent security gaps.\nGitGuardian's continuous monitoring identifies candidates for decommissioning.\nSee GitGuardian's NHI Security Platform in action\nwith our interactive demo. Discover key features that security teams and IAM leaders love ⬇️\nCompliance and Zero Trust: A Modern Mandate\nFrameworks like PCI DSS 4.0 and NIST now explicitly demand strong controls for machine identities—enforcing least privilege, secure onboarding, and continuous monitoring. GitGuardian's platform is built with these requirements in mind, helping organizations stay compliant as regulations evolve.\nConclusion: Don't Wait for a Breach\nThe stakes are high: financial loss, reputational damage, compliance failure, and—most critically—loss of control over the digital infrastructure that powers your business.\nForward-thinking CISOs are bringing NHIs into their IAM strategy now. GitGuardian's platform is the comprehensive, automated solution for discovering, managing, and securing all your machine identities—before attackers do.\nJoin us on June 25 for a\n20-minute live demo of GitGuardian NHI Security\nto see how GitGuardian can help you:\nGet visibility over all NHI secrets across your infrastructure\nImprove your security hygiene\nReduce breaches resulting from mismanaged identities\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "ConnectWise to Rotate ScreenConnect Code Signing Certificates Due to Security Risks",
        "Link": "https://thehackernews.com/2025/06/connectwise-to-rotate-screenconnect.html",
        "Summary": "ConnectWise has disclosed that it's planning to rotate the digital code signing certificates used to sign ScreenConnect, ConnectWise Automate, and ConnectWise remote monitoring and management (RMM) executables due to security concerns.\nThe company said it's doing so \"due to concerns raised by a third-party researcher about how ScreenConnect handled certain configuration data in earlier versions.",
        "Date": "2025-06-12",
        "Content": "ConnectWise has disclosed that it's planning to rotate the digital code signing certificates used to sign ScreenConnect, ConnectWise Automate, and ConnectWise remote monitoring and management (RMM) executables due to security concerns.\nThe company\nsaid\nit's doing so \"due to concerns raised by a third-party researcher about how ScreenConnect handled certain configuration data in earlier versions.\"\nWhile the company did not publicly elaborate on the nature of the problem, it has shed more light in a non-public FAQ accessible only to its customers (and later\nshared on Reddit\n) -\nThe concern stems from ScreenConnect using the ability to store configuration data in an available area of the installer that is not signed but is part of the installer. We are using this ability to pass down configuration information for the connection (between the agent and server) such as the URL where the agent should call back without invalidating the signature. The unsigned area is used by our software and others for customization, however, when coupled with the capabilities of a remote control solution, it could create an insecure design pattern by today's security standards.\nBesides issuing new certificates, the company said it's releasing an update that's designed to improve how the aforementioned configuration data is managed in ScreenConnect.\nThe revocation of digital certificates is expected to take place by June 13 at 8 p.m. ET (June 14, 12 a.m. UTC). ConnectWise has emphasized that the issue does not involve a compromise of its systems or certificates.\nIt's worth noting that automatically ConnectWise is already in the process of updating certificates and agents across all its cloud instances of Automate and RMM.\nHowever, those using on-premise versions of ScreenConnect or Automate are required to update to the latest build and validate that all agents are updated before the cutoff date to avoid any possible service disruptions.\n\"We had already planned enhancements to certificate management and product hardening, but these efforts are now being implemented on an accelerated timeline,\" ConnectWise said. \"We understand this may create challenges and are committed to supporting you through the transition.\"\nThe development comes merely days after the company\ndisclosed\nthat a suspected nation-state threat actor breached its systems and affected a small number of its customers by exploiting CVE-2025-3935 to conduct ViewState code injection attacks.\nIt also comes as attackers are increasingly relying on legitimate RMM software like ScreenConnect and others to\nobtain stealthy, persistent remote access\n, effectively allowing them to blend in with normal activity and fly under the radar.\nThis attack methodology, called living-off-the-land (LotL), makes it possible to hijack the software's inherent capabilities for remote access, file transfer, and command execution.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Over 80,000 Microsoft Entra ID Accounts Targeted Using Open-Source TeamFiltration Tool",
        "Link": "https://thehackernews.com/2025/06/over-80000-microsoft-entra-id-accounts.html",
        "Summary": "Cybersecurity researchers have uncovered a new account takeover (ATO) campaign that leverages an open-source penetration testing framework called TeamFiltration to breach Microsoft Entra ID (formerly Azure Active Directory) user accounts.\nThe activity, codenamed UNK_SneakyStrike by Proofpoint, has targeted over 80,000 user accounts across hundreds of organizations' cloud tenants since a surge in",
        "Date": "2025-06-12",
        "Content": "Cybersecurity researchers have uncovered a new account takeover (ATO) campaign that leverages an open-source penetration testing framework called TeamFiltration to breach Microsoft Entra ID (formerly Azure Active Directory) user accounts.\nThe activity, codenamed\nUNK_SneakyStrike\nby Proofpoint, has targeted over 80,000 user accounts across hundreds of organizations' cloud tenants since a surge in login attempts was observed in December 2024, leading to successful account takeovers.\n\"Attackers leverage Microsoft Teams API and Amazon Web Services (AWS) servers located in various geographical regions to launch user-enumeration and password-spraying attempts,\" the enterprise security company\nsaid\n. \"Attackers exploited access to specific resources and native applications, such as Microsoft Teams, OneDrive, Outlook, and others.\"\nTeamFiltration,\npublicly released\nby researcher Melvin \"Flangvik\" Langvik, in August 2022 at the\nDEF CON security conference\n, is described as a\ncross-platform framework\nfor \"enumerating, spraying, exfiltrating, and backdooring\" Entra ID accounts.\nThe tool offers extensive capabilities to facilitate account takeover using password spraying attacks, data exfiltration, and persistent access by uploading malicious files to the target's Microsoft OneDrive account.\nWhile the tool requires an Amazon Web Services (AWS) account and a disposable Microsoft 365 account to facilitate password spraying and account enumeration functions, Proofpoint said it observed evidence of malicious activity leveraging TeamFiltration to conduct these activities such that each password spraying wave originates from a different server in a new geographic location.\nAt its peak, the campaign targeted 16,500 accounts in a single day in early January 2025. The three primary source geographies linked to malicious activity based on the number of IP addresses include the United States (42%), Ireland (11%), and Great Britain (8%).\nThe UNK_SneakyStrike activity has been described as \"large-scale user enumeration and password spraying attempts,\" with the unauthorized access efforts occurring in \"highly concentrated bursts\" targeting several users within a single cloud environment. This is followed by a lull that lasts for four to five days.\nThe findings once again highlight how tools designed to assist cybersecurity professionals can be misused by threat actors to carry out a wide range of nefarious actions that allow them to breach user accounts, harvest sensitive data, and establish persistent footholds.\n\"UNK_SneakyStrike's targeting strategy suggests they attempt to access all user accounts within smaller cloud tenants while focusing only on a subset of users in larger tenants,\" Proofpoint said. \"This behaviour matches the tool's advanced target acquisition features, designed to filter out less desirable accounts.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Trend Micro fixes critical vulnerabilities in multiple products",
        "Link": "https://www.bleepingcomputer.com/news/security/trend-micro-fixes-six-critical-flaws-on-apex-central-endpoint-encryption-policyserver/",
        "Summary": "Trend Micro has released security updates to address multiple critical-severity remote code execution and authentication bypass vulnerabilities that impact its Apex Central and Endpoint Encryption (TMEE) PolicyServer products. [...]",
        "Date": "2025-06-12",
        "Content": "Trend Micro has released security updates to address multiple critical-severity remote code execution and authentication bypass vulnerabilities that impact its Apex Central and Endpoint Encryption (TMEE) PolicyServer products.\nThe security vendor underlines that it has seen no evidence of active exploitation in the wild for any of them. However, immediate application of the security updates is recommended to address the risks.\nTrend Micro Endpoint Encryption PolicyServer is a central management server for Trend Micro Endpoint Encryption (TMEE), providing full disk encryption and removable media encryption for Windows-based endpoints.\nThe product is used in enterprise environments in regulated industries where compliance with data protection standards is critical.\nWith the latest update, Trend Micro addressed the following high-severity and critical flaws:\nCVE-2025-49212\n-\nA pre-authentication remote code execution flaw caused by insecure deserialization in the PolicyValueTableSerializationBinder class. Remote attackers can exploit it to execute arbitrary code as SYSTEM without requiring login\nCVE-2025-49213\n-\nA pre-authentication remote code execution vulnerability in the PolicyServerWindowsService class, stemming from deserialization of untrusted data. Attackers can run arbitrary code as SYSTEM with no authentication required\nCVE-2025-49216\n-\nAn authentication bypass flaw in the DbAppDomain service due to a broken auth implementation. Remote attackers can fully bypass login and perform admin-level actions without credentials\nCVE-2025-49217\n-\nA pre-authentication RCE vulnerability in the ValidateToken method, triggered by unsafe deserialization. While slightly harder to exploit, it still allows unauthenticated attackers to run code as SYSTEM\nIt should be noted that while Trend Micro's\nsecurity bulletin\nfor Endpoint Encryption PolicyServer lists all four vulnerabilities above as critical, ZDI's advisory asessed CVE-2025-49217 as being a high-severity vulnerability.\nAdditional issues addressed by the latest version of Endpoint Encryption PolicyServer inlcude four more high-severity vulnerabilities (e.g. SQL injection and privileges escalation issues).\nAll of the vulnerabilities were addressed in version 6.0.0.4013 (Patch 1 Update 6). The flaws impact all versions up to the latest, and there are no mitigations or workarounds for them.\nA second\nset of problems\nthat Trend Micro addressed impacts Apex Central, a centralized security management console used for monitoring, configuring, and managing multiple Trend Micro products and security agents across an organization.\nBoth issues are critical-severity, pre-authentication remote code execution flaws:\nCVE-2025-49219\n– A pre-authentication RCE flaw in the GetReportDetailView method of Apex Central caused by insecure deserialization. Exploiting this allows unauthenticated attackers to execute code in the context of NETWORK SERVICE. (CVSS 9.8)\nCVE-2025-49220\n– A pre-auth RCE in Apex Central in the ConvertFromJson method. Improper input validation during deserialization lets attackers execute arbitrary code remotely without authentication. (CVSS 9.8)\nThe issues were fixed in Patch B7007 for Apex Central 2019 (on premise), while they are automatically applied on backend for Apex Central as a Service.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nUnpatched critical bugs in Versa Concerto lead to auth bypass, RCE\nSAP fixes suspected NetWeaver zero-day exploited in attacks\nCritical Fortinet flaws now exploited in Qilin ransomware attacks\nHewlett Packard Enterprise warns of critical StoreOnce auth bypass\nExploit details for max severity Cisco IOS XE flaw now public"
    },
    {
        "Title": "Google Cloud and Cloudflare hit by widespread service outages",
        "Link": "https://www.bleepingcomputer.com/news/technology/google-cloud-and-cloudflare-hit-by-widespread-service-outages/",
        "Summary": "Google Cloud and Cloudflare are investigating ongoing outages impacting access to sites and various services across multiple regions. [...]",
        "Date": "2025-06-12",
        "Content": "Update June 12, 17:41 EDT:\nIn new updates, Cloudflare said that all services have been restored and are now fully operational, while Google stated it expects \"recovery to complete in less than an hour.\"\nUpdate June 12, 15:29 EDT:\nCloudflare says its services were impacted by Google Cloud's outage.\n\"This is a Google Cloud outage. A limited number of services at Cloudflare use Google Cloud and were impacted. We expect them to come back shortly. The core Cloudflare services were not impacted,\" a Cloudflare spokesperson told BleepingComputer.\n\"Cloudflare services are recovering quickly around the globe. WARP and Turnstile are operational, though a small residual impact remains and we’re working to eliminate it. The core KV service is restored, bringing dependent products back online. We expect further recovery over the next few minutes and a steady drop in impact,\" the company\nadded\nin a new status page update.\nGoogle also said in a recent update that it identified the root cause and its infrastructure has recovered in all regions except us-central1 after applying mitigations.\n\"Google Cloud products that rely on the affected infrastructure are seeing recovery in multiple locations,\" it\nsaid\n.\nUpdate June 12, 15:20 EDT:\nGoogle now warns that multiple Workspace and Search services are also affected by this massive outage.\n\"We're investigating reports of an issue with Gmail, Google Calendar, Google Chat, Google Cloud Search, Google Docs, Google Drive, Google Meet, Google Tasks, and Google Voice,\" the company\nnoted\n.\n\"Multiple Workspace products beginning on Thursday, at 2025-06-12 10:58 PDT may be experiencing service issues. Our engineers are currently investigating the issue. We apologize to all who are affected by the disruption.\"\n\"There's an ongoing issue with serving Google Lens, Discover, and Voice Search results that's affecting some users. We're working on identifying the root cause. The next update will be within 12 hours,\" it added.\nOriginal story below.\nGoogle Cloud and Cloudflare are investigating ongoing outages impacting access to sites and various services across multiple regions.\nCloudflare first acknowledged these issues less than 30 minutes ago when it reported Access authentication failures and Cloudflare Zero Trust WARP connectivity issues.\n\"We are seeing a number of services suffer intermittent failures. We are continuing to investigate this and we will update this list as we assess the impact on a per-service level,\" it\nadded\nin a subsequent update to its official status page.\nThe complete list of impacted Cloudflare services includes:\nAccess\nWARP\nDurable Objects (SQLite-backed Durable Objects only)\nWorkers KV\nRealtime\nWorkers AI\nStream\nWaiting Room\nParts of the Cloudflare dashboard\nAI Gateway\nAutoRAG\nGoogle Cloud also published an incident report regarding an incident that affects multiple Google Cloud Platform services, including Bigtable, Console, Dataproc, Storage, Cloud Data Fusion, Cloud Memorystore, Cloud Shell, Cloud Workstations, Identity Platform, Memorystore for Memcached, Memorystore for Redis, Memorystore for Redis Cluster, Vertex AI Search, and Identity and Access Management.\n\"We are experiencing service issues with multiple GCP products beginning at Thursday, 2025-06-12 10:51 PDT. Our engineering team continues to investigate the issue,\" the company\nsaid\n.\nOutage monitoring service Downdetector has received tens of thousands of reports since these widespread issues started, with impacted users experiencing\nCloudflare\nand\nGoogle Cloud\nserver connection, website, and hosting problems.\nWhile not necessarily connected to these two ongoing incidents, hundreds of thousands of other Downdetector users\nalso report access issues\nwhen trying to use and connect to many other online services and platforms, including Spotify, Discord, Snapchat, NPM, Firebase Studio, and more.\nThis is a developing story...\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nOpenAI working to fix ChatGPT outage affecting users worldwide\nMassive Heroku outage impacts web platforms worldwide\nKettering Health hit by system-wide outage after ransomware attack\nSentinelOne: Last week’s 7-hour outage caused by software flaw\nMATLAB dev confirms ransomware attack behind service outage"
    },
    {
        "Title": "Graphite spyware used in Apple iOS zero-click attacks on journalists",
        "Link": "https://www.bleepingcomputer.com/news/security/graphite-spyware-used-in-apple-ios-zero-click-attacks-on-journalists/",
        "Summary": "Forensic investigation has confirmed the use of Paragon's Graphite spyware platform in zero-click attacks that targeted Apple iOS devices of at least two journalists in Europe. [...]",
        "Date": "2025-06-12",
        "Content": "Forensic investigation has confirmed the use of Paragon's Graphite spyware platform in zero-click attacks that targeted Apple iOS devices of at least two journalists in Europe.\nResearchers at Citizen Lab say that the victims were a prominent European journalists who requested anonimity and Ciro Pellegrino, a journalist at Italian publication Fanpage.it.\n“Our analysis finds forensic evidence confirming with high confidence that both a prominent European journalist (who requests anonymity), and Italian journalist Ciro Pellegrino, were targeted with Paragon’s Graphite mercenary spyware,”\nreports Citizen Lab\n.\nThe attacks occurred in early 2025, and Apple sent a notification to the two victims on April 29 informing that they had been targeted by “advanced spyware.”\nThe threat actor used Paragon's Graphite spyware platform to target the victims' iPhone devices running iOS 18.2.1 and exploit CVE-2025-43200, which was a zero-day vulnerability at the time.\nApple describes the flaw as “a logic issue that existed when processing a maliciously crafted photo or video shared via an iCloud Link.”\nThe vendor addressed the vulnerability in the next iOS release, 18.3.1, on February 10, by adding improved checks. However, the CVE identifier was\nadded earlier today to the security bulletin\n.\nBleepingComputer has reached out to Apple to clarify the date of fixing the vulnerability but have not received a response at publishing time.\nAccording to Citizen Lab's analysis, Graphite’s delivery vector was iMessage. The attacker used an account, generically labeled ‘ATTACKER1’  in the research, to send specially crafted messages that exploited CVE-2025-43200 for remote code execution.\nThis achieved the delivery of the spyware without any interaction from the target, in what is called a zero-click attack, and without producing any visible signs to alert the victim.\nOnce active, the spyware contacts a command-and-control (C2) server to receive further instructions. In the case confirmed by Citizen Lab, the infected phone connected to https://46.183.184[.]91, a VPS linked to Paragon's infrastructure.\nThis IP address was hosted on EDIS Global and was active at least until April 12.\nAttribution diagram\nSource: CitizenLabs\nAlthough little trace was left on the devices, Citizen Lab was able to recover some logs that contained enough evidence to attribute the attacks to Paragon’s Graphite spyware with high confidence.\nThe same spyware family was “caught” earlier this year in another zero-click attack exploiting a zero-day vulnerability\nin WhatsApp\nthat targeted other Italian victims.\nItalian authorities have\nconfirmed earlier this month\nmultiple attacks against individuals in the country, including journalist Francesco Cancellato and activists Luca Casarini and Dr. Giuseppe “Beppe” Caccia. However, the parties responsible for those attacks are not publicly known at this time.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nApple fixes two zero-days exploited in targeted iPhone attacks\nGitLab patches high severity account takeover, missing auth issues\nHackers exploited Windows WebDav zero-day to drop malware\nDanaBot malware operators exposed via C2 bug added in 2022\nMicrosoft June 2025 Patch Tuesday fixes exploited zero-day, 66 flaws"
    },
    {
        "Title": "Password-spraying attacks target 80,000 Microsoft Entra ID accounts",
        "Link": "https://www.bleepingcomputer.com/news/security/password-spraying-attacks-target-80-000-microsoft-entra-id-accounts/",
        "Summary": "Hackers have been using the TeamFiltration pentesting framework to target more than 80,000 Microsoft Entra ID accounts at hundreds of organizations worldwide. [...]",
        "Date": "2025-06-12",
        "Content": "Hackers have been using the TeamFiltration pentesting framework to target more than 80,000 Microsoft Entra ID accounts at hundreds of organizations worldwide.\nThe campaign started last December and has successfully hijacked multiple accounts, say researchers at cybersecurity company Proofpoint, who attribute the activity to a threat actor called UNK_SneakyStrike.\nAccording to the researchers, the peak of the campaign happened on January 8, when it targeted 16,500 accounts in a single day. Such sharp bursts were followed by several days of inactivity.\nVolume of attacks launched by UNK_SneakyStrike\nSource: Proofpoint\nTeamFiltration\nis a cross-platform framework for enumerating, spraying, exfiltrating, and backdooring O365 EntraID accounts. It was published in 2022 by TrustedSec red-team researcher Melvin Langvik.\nIn the UNK_SneakyStrike campaign that Proofpoint observed, TeamFiltration plays a central role in facilitating large-scale intrusion attempts.\nThe researchers report that the threat actor targets all users in small tenants, while in the case of larger one UNK_SneakyStrike selects only users from a subset.\n\"Since December 2024, UNK_SneakyStrike activity has affected over 80,000 targeted user accounts across hundreds of organizations, resulting in several cases of successful account takeover,\"\nProofpoint\nexplains\n.\nThe researchers linked the malicious activity to TeamFiltration after identifying a rare user agent the tool uses, as well as matching OAuth client IDs hardcoded in the tool's logic.\nOther telltale signs include access patterns to incompatible applications and the presence of an outdated snapshot of Secureworks' FOCI project embedded in TeamFiltration code.\nThe attackers used AWS servers across multiple regions to launch the attacks, and used a 'sacrificial' Office 365 account with a Business Basic license to abuse Microsoft Teams API for account enumeration.\nVolume of attacks launched by UNK_SneakyStrike\nSource: Proofpoint\nMost of the attacks originate from IP addresses located in the United States (42%), followed by Ireland (11%) and the UK (8%).\nOrganizations should block all IPs listed in Proofpoint's indicators of compromise section, and create detection rules for the TeamFiltration user agent string.\nApart from that, it is recommended to enable multi-factor authentication for all users, enforce OAuth 2.0, and use conditional access policies in Microsoft Entra ID.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nGitLab patches high severity account takeover, missing auth issues\nTexas Dept. of Transportation breached, 300k crash records stolen\nGoogle: Hackers target Salesforce accounts in data extortion attacks\nThe North Face warns customers of April credential stuffing attack\nThreat actors abuse Google Apps Script in evasive phishing attacks"
    },
    {
        "Title": "Microsoft Edge now offers secure password deployment for businesses",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-edge-now-offers-secure-password-deployment-for-businesses/",
        "Summary": "Microsoft announced that a new Edge feature allowing employees to share passwords more securely in enterprise environments has reached general availability. [...]",
        "Date": "2025-06-12",
        "Content": "Microsoft announced that a new Edge feature allowing employees to share passwords more securely in enterprise environments has reached general availability.\nKnown as secure password deployment, this feature will be available to Microsoft Edge for Business users starting this week, minimizing the risk of unauthorized access by ensuring that employees don't accidentally share passwords with unintended recipients.\nThe feature is available for Microsoft 365 Business Premium, E3, and E5 subscriptions and requires the Edge admin or Global admin role.\n\"In many organizations today, employees often resort to sharing passwords via sticky notes or emails. This not only exposes sensitive credentials to unintended recipients, but also increases the risk of those passwords being forwarded or misused,\"\nMicrosoft said\n.\n\"Secure password deployment allows administrators to deploy encrypted shared passwords to a set of users within their organization. With this feature, users will receive the deployed passwords on their device and can seamlessly log into websites.\"\nSecure password deployment is part of the Microsoft Edge management service within the Microsoft 365 admin center, allowing administrators to configure browser settings using policies to deploy encrypted passwords to specific user groups.\nSecure password deployment in M365 admin center (Microsoft)\nThis feature expands on the built-in Autofill experience with an intuitive interface that allows admins to add, update, and revoke credentials.\nOnce deployed by admins, the passwords will automatically appear in the users' Edge work profiles on managed Windows devices, ready for autofill on the corresponding websites and allowing for a secure login experience.\nAlthough accessible in Edge, these passwords cannot be viewed, edited, deleted (unless allowed by the website), or exported from the password manager.\nWhile there are still ways to gain access to the passwords using the web browser's developer tools, admins can restrict access to them using the\nDeveloperToolsAvailability policy\n.\nEdge password manager (Microsoft)\nThe passwords are encrypted using the Microsoft Information Protection SDK, and this encryption is linked with Entra identities, ensuring that access is automatically enforced based on organizational policies without requiring manual key management.\n\"This integration brings the power of Microsoft's data protection platform directly into the Edge Management experience, giving administrators a seamless way to deploy credentials securely while aligning with Zero Trust principles and compliance requirements,\" Microsoft added.\n\"By embedding the Protection SDK directly into Edge for Business, we extend Microsoft's data protection capabilities all the way to the endpoint—ensuring that sensitive information is safeguarded from configuration to consumption.\"\nTo begin using secure password deployment, administrators must first access the\nEdge management service\nwithin the Microsoft 365 admin center and then select an existing configuration policy or create a new one.\nAfter selecting the policy, click the Customization Settings tab and then go to the Secure Password Deployment page.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMicrosoft Authenticator now warns to export passwords before July cutoff\nMicrosoft ends Authenticator password autofill, moves users to Edge\nGoogle patches new Chrome zero-day bug exploited in attacks\nGoogle Chrome to distrust Chunghwa Telecom, Netlock certificates in August\nMajority of Browser Extensions Pose Critical Security Risk, A New Report Reveals"
    },
    {
        "Title": "GitLab patches high severity account takeover, missing auth issues",
        "Link": "https://www.bleepingcomputer.com/news/security/gitlab-patches-high-severity-account-takeover-missing-auth-issues/",
        "Summary": "GitLab has released security updates to address multiple vulnerabilities in the company's DevSecOps platform, including ones enabling attackers to take over accounts and inject malicious jobs in future pipelines. [...]",
        "Date": "2025-06-12",
        "Content": "GitLab has released security updates to address multiple vulnerabilities in the company's DevSecOps platform, including ones enabling attackers to take over accounts and inject malicious jobs in future pipelines.\nThe company released GitLab Community and Enterprise versions 18.0.2, 17.11.4, and 17.10.8 to address these security flaws and urged all admins to upgrade immediately.\n\"These versions contain important bug and security fixes, and we strongly recommend that all self-managed GitLab installations be upgraded to one of these versions immediately,\" the company\nwarned\n. \"GitLab.com is already running the patched version. GitLab Dedicated customers do not need to take action.\"\nOn Wednesday, GitLab patched an HTML injection issue tracked as\nCVE-2025-4278\nthat can let remote attackers take over accounts by injecting malicious code into the search page.\nIt also released patches for a missing authorization issue (\nCVE-2025-5121\n) that impacts GitLab Ultimate EE and allows remote threat actors to inject malicious CI/CD jobs into any project's future CI/CD pipelines.\nGitLab pipelines are a Continuous Integration/Continuous Deployment (CI/CD) system feature that lets users sequentially build, test, or deploy code changes or automatically run processes and tasks in parallel.\nHowever, successful exploitation requires attackers to have authenticated access to GitLab instances with a GitLab Ultimate license.\nThe company also patched a cross-site scripting vulnerability (\nCVE-2025-2254\n) that could let successful attackers act in the context of a legitimate user and a denial of service (DoS) flaw (\nCVE-2025-0673\n) that can allow malicious actors to trigger infinite redirect loops, causing memory exhaustion and denying access to legitimate users.\nGitLab repositories are often targeted in attacks because of the sensitive information and data they contain, as proven by recent breaches reported by multinational car-rental company\nEuropcar Mobility Group\nand education giant\nPearson\n, which had their GitLab repos compromised since the start of the year.\nGitLab's DevSecOps platform has over 30 million registered users and is utilized by more than 50% of Fortune 100 companies, including Goldman Sachs, Airbus, T-Mobile, Lockheed Martin, Nvidia, and UBS.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nGraphite spyware used in Apple iOS zero-click attacks on journalists\nPassword-spraying attacks target 80,000 Microsoft Entra ID accounts\nHackers exploited Windows WebDav zero-day to drop malware\nBrute-force attacks target Apache Tomcat management panels\nDanaBot malware operators exposed via C2 bug added in 2022"
    },
    {
        "Title": "Windows 11 24H2 emergency update fixes Easy Anti-Cheat BSOD issue",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-24h2-emergency-update-fixes-easy-anti-cheat-bsod-issue/",
        "Summary": "Microsoft has released an emergency Windows 11 24H2 update to address an incompatibility issue triggering restarts with blue screen of death (BSOD) errors on systems with Easy Anti-Cheat. [...]",
        "Date": "2025-06-12",
        "Content": "Microsoft has released an emergency Windows 11 24H2 update to address an incompatibility issue triggering restarts with blue screen of death (BSOD) errors on systems with Easy Anti-Cheat.\nThe out-of-band update (\nKB5063060\n) is a revised version of the Windows 11 KB5060842 cumulative update released during this month's Patch Tuesday after many customers\nreported\nexperiencing system reboots and IRQL_NOT_LESS_OR_EQUAL BSODs tied to ntoskrnl.exe or EasyAntiCheat_EOS.exe crashing on computers running various games,\nincluding Fortnite\n.\nMicrosoft\nsaid on Tuesday\nthat the emergency update addressed a compatibility issue and rolled out to \"a limited set of these devices\" running Windows 11, version 24H2.\nHowever, the company didn't initially share what hardware or software configurations were affected and what impact KB5060842 had after being installed on incompatible PCs.\nOne day later, Redmond revealed that the issues only impacted devices running\nEasy Anti-Cheat\n, a massively popular anti-cheating service installed with hundreds of multiplayer games (including Apex Legends, War Thunder, Dead by Daylight, ELDEN RING, Rust, Squad, NBA 2K25, and many others) to prevent cheating while playing online.\n\"This update addresses an incompatibility issue where Windows might restart unexpectedly when opening games that use the Easy Anti-Cheat service,\" Microsoft\nsaid\n.\n\"This update downloads and installs automatically from Windows Update and Microsoft Update on devices with Easy Anti-Cheat installed and on devices that have not installed KB506842 yet,\" it\nadded\n.\nIf you can't install the KB5063060 out-of-band cumulative update via Windows Update, you can install it manually on x64 and arm64 systems after downloading it from the\nMicrosoft Update Catalog\n.\nMicrosoft\nalso placed a compatibility hold\nin October to block Windows 24H2 upgrades on Intel Alder Lake+ and vPro systems because of known issues causing Easy Anti-Cheat blue screens with \"MEMORY_MANAGEMENT\" errors.\n​On Tuesday, Redmond\nreleased\nsecurity updates (\nKB5060842 and KB5060999\n) for 66 vulnerabilities in Windows 11, including a publicly disclosed Windows SMB privilege escalation flaw (\nCVE-2025-33073\n) and an actively exploited Web Distributed Authoring and Versioning (WebDAV) zero-day (\nCVE-2025-33053\n).\nThe July 2025 Patch Tuesday Windows updates addressed ten critical vulnerabilities, eight allowing attackers to gain remote code execution on unpatched devices, and the other two enabling them to escalate privileges.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMicrosoft warns of blue screen crashes caused by April updates\nWindows Server emergency update fixes Hyper-V VM freezes, restart issues\nWindows 11 24H2 blocked on PCs with code-obfuscation driver BSODs\nMicrosoft creates separate Windows 11 24H2 update for incompatible PCs\nWindows 11 upgrade block lifted after Safe Exam Browser fix"
    },
    {
        "Title": "Fog ransomware attack uses unusual mix of legitimate and open-source tools",
        "Link": "https://www.bleepingcomputer.com/news/security/fog-ransomware-attack-uses-unusual-mix-of-legitimate-and-open-source-tools/",
        "Summary": "Fog ransomware hackers are using an uncommon toolset, which includes open-source pentesting utilities and a legitimate employee monitoring software called Syteca. [...]",
        "Date": "2025-06-12",
        "Content": "Fog ransomware hackers are using an uncommon toolset, which includes open-source pentesting utilities and a legitimate employee monitoring software called Syteca.\nThe Fog ransomware operation was\nfirst observed last year\nin May leveraging compromised VPN credentials to access victims’ networks.\nPost-compromise, they used “pass-the-hash” attacks to gain admin privileges, disabled Windows Defender, and encrypted all files, including virtual machine storage.\nLater, the threat group was observed exploiting n-day flaws impacting\nVeeam Backup & Replication\n(VBR) servers, as well as\nSonicWall SSL VPN\nendpoints.\nNew attack toolset\nResearchers at Symantec and the Carbon Black Threat Hunter team discovered the unusual attack toolset during an incident response last month on a financial institution in Asia.\nSymantec couldn’t determine the initial infection vector but documented the use of multiple new tools that have not been previously seen in such attacks.\nThe most unusual and interesting of those is Syteca (formerly known as Ekran), a legitimate employee monitoring software that records screen activity and keystrokes.\nThe attackers could use the tool to collect information like account credentials employees type in unaware that they are monitored remotely.\nSyteca was stealthily delivered to the system by Stowaway, an open-source proxy tool for covert communication and file transfers, and executed by SMBExec, the PsExec equivalent in the Impacket open-source framework used for lateral movement.\nThe attack also involved GC2, an open-source post-exploitation backdoor that uses Google Sheets or Microsoft SharePoint for command-and-control (C2) and data exfiltration.\nGC2 has been rarely seen in ransomware attacks, previously used in attacks attributed to the\nAPT41 Chinese threat group\n.\nApart from these tools, Symantec also lists the following as part of Fog ransomware’s latest arsenal:\nAdapt2x C2 – open-source alternative to Cobalt Strike supporting post-exploitation actions\nProcess Watchdog – system monitoring utility that can restart key processes\nPsExec – Microsoft Sysinternals tool for remote execution across networked machines\nImpacket SMB – Python library with low-level programmatic access to SMB, likely used for deploying the ransomware payload on the victim’s machine.\nTo prepare data for exfiltration and deliver it to their infrastructure, Fog ransomware also used 7-Zip, MegaSync, and FreeFileSync utilities.\n“The toolset deployed by the attackers is quite atypical for a ransomware attack,”\ncomments Symantec in the report\n.\n“The Syteca client and GC2 tool are not tools we have seen deployed in ransomware attacks before, while the Stowaway proxy tool and Adap2x C2 Agent Beacon are also unusual tools to see being used in a ransomware attack,” the researchers say.\nUnusual sets like the one Symantec spotted in the recent Fog ransomware attack can help threat actors evade detection. The researchers' report provides indicators of compromise that can help organizations protect against such incidents.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nTax resolution firm Optima Tax Relief hit by ransomware, data leaked\nKettering Health confirms Interlock ransomware behind cyberattack\nKettering Health hit by system-wide outage after ransomware attack\nHitachi Vantara takes servers offline after Akira ransomware attack\nErie Insurance confirms cyberattack behind business disruptions"
    },
    {
        "Title": "ChatGPT o3 API 80% price drop has no impact on performance",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-o3-api-80-percent-price-drop-has-no-impact-on-performance/",
        "Summary": "ChatGPT o3, which has been available via API, is now 80% cheaper for developers, and there's no visible impact on performance. [...]",
        "Date": "2025-06-12",
        "Content": "ChatGPT o3 API is now cheaper for developers, and there's no visible impact on performance.\nOn Wednesday, OpenAI announced it's cutting the price of its best reasoning model, o3, by 80%.\nChatGPT price reduction\nThis means o3’s input price is now just $2 per million tokens, while the output price has dropped to $8 per million tokens.\n\"We optimized our inference stack that serves o3. Same exact model—just cheaper,\" OpenAI\nnoted\nin a post on X.\nWhile regular users typically don't use ChatGPT models via API, the price drop makes tools relying on the API much cheaper, such as Cursor and Windsurf.\nIn a\npost\non X, the independent benchmark community ARC Prize confirmed that the o3-2025-04-16 model’s performance didn’t change after the price reduction.\n\"We compared the retest results with the original results and observed no difference in performance,\" the company said.\nThis confirms that OpenAI did not swap out the o3 model to reduce the price. Instead, the company truly optimized the inference stack that powers the model.\nIn addition, OpenAI rolled out o3-pro model in the API, which uses more compute to deliver better results.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nChatGPT prepares o3-pro model for $200 Pro subscribers\nResearchers claim ChatGPT o3 bypassed shutdown in controlled test\nOpenAI plans to ship an interesting ChatGPT product by 2026\nOpenAI confirms Operator Agent is now more accurate with o3\nOpenAI plans to combine multiple models into GPT-5"
    },
    {
        "Title": "Researchers Detail Zero-Click Copilot Exploit 'EchoLeak'",
        "Link": "https://www.darkreading.com/application-security/researchers-detail-zero-click-copilot-exploit-echoleak",
        "Summary": "Researchers at Aim Security disclosed a Microsoft Copilot vulnerability of critical severity this week that could have enabled sensitive data exfiltration via prompt injection attacks.",
        "Date": "2025-06-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/researchers-detail-zero-click-copilot-exploit-echoleak"
    },
    {
        "Title": "Hacking the Hackers: When Bad Guys Let Their Guard Down",
        "Link": "https://www.darkreading.com/threat-intelligence/hacking-hackers-bad-guys-guard-down",
        "Summary": "A string of threat-actor OpSec failures have yielded unexpected windfalls for security researchers and defenders.",
        "Date": "2025-06-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/hacking-hackers-bad-guys-guard-down"
    },
    {
        "Title": "Foundations of Cybersecurity: Reassessing What Matters",
        "Link": "https://www.darkreading.com/cyber-risk/foundations-cybersecurity-reassessing-what-matters",
        "Summary": "To truly future-proof your cybersecurity approach, it's vital to ensure that your security program is flexible and adaptable to both current and future business demands.",
        "Date": "2025-06-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/foundations-cybersecurity-reassessing-what-matters"
    },
    {
        "Title": "Inside a Dark Adtech Empire Fed by Fake CAPTCHAs",
        "Link": "https://krebsonsecurity.com/2025/06/inside-a-dark-adtech-empire-fed-by-fake-captchas/",
        "Summary": "Late last year, security researchers made a startling discovery: Kremlin-backed disinformation campaigns were bypassing moderation on social media platforms by leveraging the same malicious advertising technology that powers a sprawling ecosystem of online hucksters and website hackers. A new report on the fallout from that investigation finds this dark ad tech industry is far more resilient and incestuous than previously known.",
        "Date": "2025-06-12",
        "Content": "Late last year, security researchers made a startling discovery: Kremlin-backed disinformation campaigns were bypassing moderation on social media platforms by leveraging the same malicious advertising technology that powers a sprawling ecosystem of online hucksters and website hackers. A new report on the fallout from that investigation finds this dark ad tech industry is far more resilient and incestuous than previously known.\nImage: Infoblox.\nIn November 2024, researchers at the security firm Qurium published an investigation into “Doppelganger,” a disinformation network that promotes pro-Russian narratives and infiltrates Europe’s media landscape by pushing fake news through a network of cloned websites.\nDoppelganger campaigns use specialized links that bounce the visitor’s browser through a long series of domains before the fake news content is served. Qurium found Doppelganger relies on a sophisticated “domain cloaking” service, a technology that allows websites to present different content to search engines compared to what regular visitors see. The use of cloaking services helps the disinformation sites remain online longer than they otherwise would, while ensuring that only the targeted audience gets to view the intended content.\nQurium discovered that Doppelganger’s cloaking service also promoted online dating sites, and shared much of the same infrastructure with VexTrio, which is thought to be the oldest malicious traffic distribution system (TDS) in existence. While TDSs are commonly used by legitimate advertising networks to manage traffic from disparate sources and to track who or what is behind each click, VexTrio’s TDS largely manages web traffic from victims of phishing, malware, and social engineering scams.\nDigging deeper, Qurium noticed Doppelganger’s cloaking service used an Internet provider in Switzerland as the first entry point in a chain of domain redirections. They also noticed the same infrastructure hosted a pair of co-branded affiliate marketing services that were driving traffic to sketchy adult dating sites: LosPollos[.]com and TacoLoco[.]co.\nThe LosPollos ad network incorporates many elements and references from the hit HBO series “Breaking Bad,” mirroring the fictional “Los Pollos Hermanos” restaurant chain that served as a money laundering operation for a violent methamphetamine cartel.\nThe LosPollos advertising network invokes characters and themes from the hit show Breaking Bad. The logo for LosPollos (upper left) is the image of Gustavo Fring, the fictional chicken restaurant chain owner in the show.\nAffiliates who sign up with LosPollos are given JavaScript-heavy “smartlinks” that drive traffic into the VexTrio TDS, which in turn distributes the traffic among a variety of advertising partners, including dating services, sweepstakes offers, bait-and-switch mobile apps, financial scams and malware download sites.\nLosPollos affiliates typically stitch these smart links into WordPress websites that have been hacked via known vulnerabilities, and those affiliates will earn a small commission each time an Internet user referred by any of their hacked sites falls for one of these lures.\nThe Los Pollos advertising network promoting itself on LinkedIn.\nAccording to Qurium, TacoLoco is a traffic monetization network that uses deceptive tactics to trick Internet users into enabling “push notifications,” a cross-platform browser standard that allows websites to show pop-up messages which appear outside of the browser. For example, on Microsoft Windows systems these notifications typically show up in the bottom right corner of the screen — just above the system clock.\nIn the case of VexTrio and TacoLoco, the notification approval requests themselves are deceptive — disguised as “CAPTCHA” challenges designed to distinguish automated bot traffic from real visitors. For years, VexTrio and its partners have successfully tricked countless users into enabling these site notifications, which are then used to continuously pepper the victim’s device with a variety of phony virus alerts and misleading pop-up messages.\nExamples of VexTrio landing pages that lead users to accept push notifications on their device.\nAccording to a December 2024 annual report from GoDaddy, nearly 40 percent of compromised websites in 2024 redirected visitors to VexTrio via LosPollos smartlinks.\nOn November 14, 2024, Qurium published research to support its findings that LosPollos and TacoLoco were services operated by Adspro Group, a company registered in the Czech Republic and Russia, and that Adspro runs its infrastructure at the Swiss hosting providers C41 and Teknology SA.\nQurium noted the LosPollos and TacoLoco sites state that their content is copyrighted by ByteCore AG and SkyForge Digital AG, both Swiss firms that are run by the owner of Teknology SA, Guilio Vitorrio Leonardo Cerutti. Further investigation revealed LosPollos and TacoLoco were apps developed by a company called Holacode, which lists Cerutti as its CEO.\nThe apps marketed by Holacode include numerous VPN services, as well as one called Spamshield that claims to stop unwanted push notifications. But in January, Infoblox said they tested the app on their own mobile devices, and found it hides the user’s notifications, and then after 24 hours stops hiding them and demands payment. Spamshield subsequently changed its developer name from Holacode to ApLabz, although Infoblox noted that the Terms of Service for several of the rebranded ApLabz apps still referenced Holacode in their terms of service.\nIncredibly, Cerutti threatened to sue me for defamation before I’d even uttered his name or sent him a request for comment (Cerutti sent the unsolicited legal threat back in January after his company and my name were merely tagged in an Infoblox post on LinkedIn about VexTrio).\nAsked to comment on the findings by Qurium and Infoblox, Cerutti vehemently denied being associated with VexTrio. Cerutti asserted that his companies all strictly adhere to the regulations of the countries in which they operate, and that they have been completely transparent about all of their operations.\n“We are a group operating in the advertising and marketing space, with an affiliate network program,” Cerutti responded. “I am not [going] to say we are perfect, but I strongly declare we have no connection with VexTrio at all.”\n“Unfortunately, as a big player in this space we also get to deal with plenty of publisher fraud, sketchy traffic, fake clicks, bots, hacked, listed and resold publisher accounts, etc, etc.,” Cerutti continued. “We bleed lots of money to such malpractices and conduct regular internal screenings and audits in a constant battle to remove bad traffic sources. It is also a highly competitive space, where some upstarts will often play dirty against more established mainstream players like us.”\nWorking with Qurium, researchers at the security firm Infoblox released details about VexTrio’s infrastructure to their industry partners. Just four days after Qurium published its findings, LosPollos announced it was suspending its push monetization service. Less than a month later, Adspro had rebranded to Aimed Global.\nA mind map illustrating some of the key findings and connections in the Infoblox and Qurium investigations. Click to enlarge.\nIn March 2025, researchers at GoDaddy chronicled how DollyWay — a malware strain that has consistently redirected victims to VexTrio throughout its eight years of activity — suddenly stopped doing that on November 20, 2024. Virtually overnight, DollyWay and several other malware families that had previously used VexTrio began pushing their traffic through another TDS called Help TDS.\nDigging further into historical DNS records and the unique code scripts used by the Help TDS, Infoblox determined it has long enjoyed an exclusive relationship with VexTrio (at least until LosPollos ended its push monetization service in November).\nIn a report released today, Infoblox said an exhaustive analysis of the JavaScript code, website lures, smartlinks and DNS patterns used by VexTrio and Help TDS linked them with at least four other TDS operators (not counting TacoLoco). Those four entities — Partners House, BroPush, RichAds and RexPush — are all Russia-based push monetization programs that pay affiliates to drive signups for a variety of schemes, but mostly online dating services.\n“As Los Pollos push monetization ended, we’ve seen an increase in fake CAPTCHAs that drive user acceptance of push notifications, particularly from Partners House,” the Infoblox report reads. “The relationship of these commercial entities remains a mystery; while they are certainly long-time partners redirecting traffic to one another, and they all have a Russian nexus, there is no overt common ownership.”\nRenee Burton, vice president of threat intelligence at Infoblox, said the security industry generally treats the deceptive methods used by VexTrio and other malicious TDSs as a kind of legally grey area that is mostly associated with less dangerous security threats, such as adware and scareware.\nBut Burton argues that this view is myopic, and helps perpetuate a dark adtech industry that also pushes plenty of straight-up malware, noting that hundreds of thousands of compromised websites around the world every year redirect victims to the tangled web of VexTrio and VexTrio-affiliate TDSs.\n“These TDSs are a nefarious threat, because they’re the ones you can connect to the delivery of things like information stealers and scams that cost consumers billions of dollars a year,” Burton said. “From a larger strategic perspective, my takeaway is that Russian organized crime has control of malicious adtech, and these are just some of the many groups involved.”\nAs KrebsOnSecurity warned way back in 2020, it’s a good idea to be very sparing in approving notifications when browsing the Web. In many cases these notifications are benign, but as we’ve seen there are numerous dodgy firms that are paying site owners to install their notification scripts, and then reselling that communications pathway to scammers and online hucksters.\nIf you’d like to prevent sites from ever presenting notification requests, all of the major browser makers let you do this — either across the board or on a per-website basis. While it is true that blocking notifications entirely can break the functionality of some websites, doing this for any devices you manage on behalf of your less tech-savvy friends or family members might end up saving everyone a lot of headache down the road.\nTo modify site notification settings in Mozilla Firefox, navigate to Settings, Privacy & Security, Permissions, and click the “Settings” tab next to “Notifications.” That page will display any notifications already permitted and allow you to edit or delete any entries. Tick the box next to “Block new requests asking to allow notifications” to stop them altogether.\n\nIn Google Chrome, click the icon with the three dots to the right of the address bar, scroll all the way down to Settings, Privacy and Security, Site Settings, and Notifications. Select the “Don’t allow sites to send notifications” button if you want to banish notification requests forever.\n\nIn Apple’s Safari browser, go to Settings, Websites, and click on Notifications in the sidebar. Uncheck the option to “allow websites to ask for permission to send notifications” if you wish to turn off notification requests entirely.\n\n\r\n         This entry was posted on Thursday 12th of June 2025 06:14 PM \r\n         \nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "Paragon ‘Graphite’ Spyware Linked to Zero-Click Hacks on Newest iPhones",
        "Link": "https://www.securityweek.com/paragon-graphite-spyware-linked-to-zero-click-hacks-on-newest-iphones/",
        "Summary": "<p>Citizen Lab publishes forensic proof that spyware maker Paragon can compromise up-to-date iPhones. Journalists in Europe among victims.</p>\n<p>The post <a href=\"https://www.securityweek.com/paragon-graphite-spyware-linked-to-zero-click-hacks-on-newest-iphones/\">Paragon ‘Graphite’ Spyware Linked to Zero-Click Hacks on Newest iPhones</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/paragon-graphite-spyware-linked-to-zero-click-hacks-on-newest-iphones/"
    },
    {
        "Title": "The AI Arms Race: Deepfake Generation vs. Detection",
        "Link": "https://www.securityweek.com/deepfakes-and-the-ai-battle-between-generation-and-detection/",
        "Summary": "<p>AI-generated voice deepfakes have crossed the uncanny valley, fueling a surge in fraud that outpaces traditional security measures. Detection technology is racing to keep up.</p>\n<p>The post <a href=\"https://www.securityweek.com/deepfakes-and-the-ai-battle-between-generation-and-detection/\">The AI Arms Race: Deepfake Generation vs. Detection</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/deepfakes-and-the-ai-battle-between-generation-and-detection/"
    },
    {
        "Title": "Hirundo Raises $8 Million to Eliminate AI’s Bad Behavior",
        "Link": "https://www.securityweek.com/hirundo-raises-8-million-to-eliminate-ais-bad-behavior/",
        "Summary": "<p>Hirundo tackles AI hallucinations and bias by making trained models “forget” poisoned, malicious, and confidential data.</p>\n<p>The post <a href=\"https://www.securityweek.com/hirundo-raises-8-million-to-eliminate-ais-bad-behavior/\">Hirundo Raises $8 Million to Eliminate AI&#8217;s Bad Behavior</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/hirundo-raises-8-million-to-eliminate-ais-bad-behavior/"
    },
    {
        "Title": "New ‘SmartAttack’ Steals Air-Gapped Data Using Smartwatches",
        "Link": "https://www.securityweek.com/new-smartattack-steals-air-gapped-data-using-smartwatches/",
        "Summary": "<p>The new attack technique uses smartwatches to capture ultrasonic covert communication in air-gapped environments and exfiltrate data.</p>\n<p>The post <a href=\"https://www.securityweek.com/new-smartattack-steals-air-gapped-data-using-smartwatches/\">New &#8216;SmartAttack&#8217; Steals Air-Gapped Data Using Smartwatches</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/new-smartattack-steals-air-gapped-data-using-smartwatches/"
    },
    {
        "Title": "Webcast Video: Rethinking Endpoint Hardening for Today’s Attack Landscape",
        "Link": "https://www.securityweek.com/webinar-today-rethinking-endpoint-hardening-for-todays-attack-landscape/",
        "Summary": "<p>Learn how attackers hide in plain sight—and what you can do to stop them without slowing down your business.</p>\n<p>The post <a href=\"https://www.securityweek.com/webinar-today-rethinking-endpoint-hardening-for-todays-attack-landscape/\">Webcast Video: Rethinking Endpoint Hardening for Today’s Attack Landscape</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/webinar-today-rethinking-endpoint-hardening-for-todays-attack-landscape/"
    },
    {
        "Title": "‘EchoLeak’ AI Attack Enabled Theft of Sensitive Data via Microsoft 365 Copilot",
        "Link": "https://www.securityweek.com/echoleak-ai-attack-enabled-theft-of-sensitive-data-via-microsoft-365-copilot/",
        "Summary": "<p>Microsoft recently patched CVE-2025-32711, a vulnerability that could have been used for zero-click attacks to steal data from Copilot.</p>\n<p>The post <a href=\"https://www.securityweek.com/echoleak-ai-attack-enabled-theft-of-sensitive-data-via-microsoft-365-copilot/\">&#8216;EchoLeak&#8217; AI Attack Enabled Theft of Sensitive Data via Microsoft 365 Copilot</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/echoleak-ai-attack-enabled-theft-of-sensitive-data-via-microsoft-365-copilot/"
    },
    {
        "Title": "The ZTNA Blind Spot: Why Unmanaged Devices Threaten Your Hybrid Workforce",
        "Link": "https://www.securityweek.com/the-ztna-blind-spot-why-unmanaged-devices-threaten-your-hybrid-workforce/",
        "Summary": "<p>It’s time for enterprises to stop treating unmanaged devices as an edge case and start securing them as part of a unified Zero Trust strategy.</p>\n<p>The post <a href=\"https://www.securityweek.com/the-ztna-blind-spot-why-unmanaged-devices-threaten-your-hybrid-workforce/\">The ZTNA Blind Spot: Why Unmanaged Devices Threaten Your Hybrid Workforce</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/the-ztna-blind-spot-why-unmanaged-devices-threaten-your-hybrid-workforce/"
    },
    {
        "Title": "Surge in Cyberattacks Targeting Journalists: Cloudflare",
        "Link": "https://www.securityweek.com/surge-in-cyberattacks-targeting-journalists-cloudflare/",
        "Summary": "<p>Between May 2024 and April 2025, Cloudflare blocked 109 billion malicious requests targeting organizations protected under Project Galileo.</p>\n<p>The post <a href=\"https://www.securityweek.com/surge-in-cyberattacks-targeting-journalists-cloudflare/\">Surge in Cyberattacks Targeting Journalists: Cloudflare</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/surge-in-cyberattacks-targeting-journalists-cloudflare/"
    },
    {
        "Title": "Palo Alto Networks Patches Privilege Escalation Vulnerabilities",
        "Link": "https://www.securityweek.com/palo-alto-networks-patches-privilege-escalation-vulnerabilities/",
        "Summary": "<p>Palo Alto Networks has released patches for seven vulnerabilities and incorporated the latest Chrome fixes in its products.</p>\n<p>The post <a href=\"https://www.securityweek.com/palo-alto-networks-patches-privilege-escalation-vulnerabilities/\">Palo Alto Networks Patches Privilege Escalation Vulnerabilities</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/palo-alto-networks-patches-privilege-escalation-vulnerabilities/"
    },
    {
        "Title": "Interpol Targets Infostealers: 20,000 IPs Taken Down, 32 Arrested, 216,000 Victims Notified",
        "Link": "https://www.securityweek.com/interpol-targets-infostealers-20000-ips-taken-down-32-arrested-216000-victims-notified/",
        "Summary": "<p>Interpol has announced a crackdown on infostealer malware in Asia as part of an effort called Operation Secure.</p>\n<p>The post <a href=\"https://www.securityweek.com/interpol-targets-infostealers-20000-ips-taken-down-32-arrested-216000-victims-notified/\">Interpol Targets Infostealers: 20,000 IPs Taken Down, 32 Arrested, 216,000 Victims Notified</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/interpol-targets-infostealers-20000-ips-taken-down-32-arrested-216000-victims-notified/"
    },
    {
        "Title": "Goship Data Breach Allegedly Exposes 255,000 Vietnamese Customers",
        "Link": "https://dailydarkweb.net/goship-data-breach-allegedly-exposes-255000-vietnamese-customers/",
        "Summary": "A threat actor has allegedly leaked the database of Goship, a prominent shipping assistance service that provides fast delivery services throughout Vietnam. The database, which was posted on a popular dark web forum, reportedly contains the sensitive information of 255,929 customers. Goship is a key player in the Vietnamese logistics and e-commerce sector, connecting online [&#8230;]",
        "Date": "2025-06-12",
        "Content": "A threat actor has allegedly leaked the database of Goship, a prominent shipping assistance service that provides fast delivery services throughout Vietnam. The database, which was posted on a popular dark web forum, reportedly contains the sensitive information of 255,929 customers. Goship is a key player in the Vietnamese logistics and e-commerce sector, connecting online shops with various shipping carriers to streamline the delivery process. The breach could impact a significant number of online businesses and their clients who rely on the service for their daily operations.\nThe individual who published the post provided samples of the data to substantiate their claims. The alleged leak contains a wide range of personally identifiable information (PII) and client details, which could be exploited by malicious actors for phishing campaigns, identity theft, and other fraudulent activities. The exposure of both client (shop) and receiver (customer) information creates a complex risk for all parties involved in transactions handled by Goship.\nThe allegedly leaked data includes the following information:\nclient_id\nsale_id\ncarrier_id\nreceiver_id\npicker.name\npicker.company\nreceiver.name\nreceiver.phone\nclient.uuid\nclient.shop_name\nclient.name\nclient.phone\nclient.email\ntags: Goship, data breach, data leak, Vietnam, cybersecurity, logistics, PII, dark web"
    },
    {
        "Title": "Scania the Major Truck Manufacturer Allegedly Breached; Insurance Data for Sale",
        "Link": "https://dailydarkweb.net/scania-the-major-truck-manufacturer-allegedly-breached-insurance-data-for-sale/",
        "Summary": "A threat actor has allegedly breached Scania, a world-leading Swedish manufacturer of commercial vehicles, including heavy trucks and buses. In a post on a dark web forum, a cybercriminal claimed to have hacked the company&#8217;s insurance division, insurance.scania.com, and is now offering the stolen data for sale. Scania is a crucial player in the global [&#8230;]",
        "Date": "2025-06-12",
        "Content": "A threat actor has allegedly breached\nScania\n, a world-leading Swedish manufacturer of commercial vehicles, including heavy trucks and buses. In a post on a dark web forum, a cybercriminal claimed to have hacked the company’s insurance division, insurance.scania.com, and is now offering the stolen data for sale. Scania is a crucial player in the global logistics and transportation industry, and a breach of its insurance arm could have significant consequences for the company and its clientele.\nThe threat actor claims to be selling a database containing 34,000 files, offering the entire dataset exclusively to a single buyer to maximize its value and impact. While the exact contents of the files were not detailed in the post, the compromised domain suggests the data is highly sensitive. The data allegedly for sale could potentially include:\nInsurance policy details\nCustomer personal and contact information\nVehicle identification numbers (VINs) and details\nFinancial information related to insurance services\nClaims history and documentation\nThis incident highlights the growing trend of cyberattacks targeting large corporations’ specialized divisions, which can often hold valuable and specific datasets. An investigation will be needed to confirm the validity of the threat actor’s claims and to assess the full scope of the alleged breach.\nTags:\nAutomotive\ncyberattack\nCyberSecurity\ndata for sale\ndata-breach\nInsurance\nScania"
    },
    {
        "Title": "Infinox Customer Data Emerges For Sale on Dark Web After Failed Ransom Negotiation",
        "Link": "https://dailydarkweb.net/infinox-customer-data-emerges-for-sale-on-dark-web-after-failed-ransom-negotiation/",
        "Summary": "The cyberattack against the global brokerage firm Infinox has entered a critical new phase, as the Arkana ransomware group has put the entirety of the allegedly stolen data up for sale. After the ransom payment deadline expired, the attackers not only listed the data for purchase but also leaked a significant portion of it online. [&#8230;]",
        "Date": "2025-06-12",
        "Content": "The cyberattack against the global brokerage firm Infinox has entered a critical new phase, as the Arkana ransomware group has put the entirety of the allegedly stolen data up for sale. After the ransom payment deadline expired, the attackers not only listed the data for purchase but also leaked a significant portion of it online. The move confirms the breach of highly sensitive information belonging to tens of thousands of the firm’s clients.\nIn a dramatic escalation, the Arkana group released what it claims is 7% of the stolen “Know Your Customer” (KYC) data, amounting to over 14,000 individual records out of a total of more than 202,000 allegedly compromised. This partial leak was shared via a link on a dark web forum and serves as proof of the breach to entice potential buyers for the full 50GB dataset. The attackers claim the full set contains information on over 163,000 Infinox customers.\nThe leaked data includes extremely sensitive personal information, such as full names, dates of birth, and images of official government-issued documents, including passports and driver’s licenses. Screenshots shared by the group show detailed customer information and file directories of the exfiltrated data. Furthermore, the attackers alleged that Infinox refused to negotiate a deal to secure the data, claiming the firm “wasted time serving NDAs and threats” instead of engaging in dialogue, leading to the public leak and sale. The full data dump now being for sale places all affected customers at an immediate and severe risk of identity theft, targeted phishing campaigns, and financial fraud.\nTags:\nArkana\nCyberSecurity\ndark web\ndata-breach\ndata-leak\nFor Sale\nInfinox\nKYC\nPII Leak\nransomware"
    },
    {
        "Title": "Saudi Automotive Platform Karage Allegedly Suffers Full Data Leak After Ignoring Ransom",
        "Link": "https://dailydarkweb.net/saudi-automotive-platform-karage-allegedly-suffers-full-data-leak-after-ignoring-ransom/",
        "Summary": "A threat actor has allegedly published a massive dataset belonging to Karage, a major automotive service platform in Saudi Arabia. Karage is a significant entity in the region&#8217;s automotive sector, with mobile applications on both iOS and Android, over 15,000 monthly active users, and a reported transaction volume exceeding 209 billion Saudi Riyals. The release [&#8230;]",
        "Date": "2025-06-12",
        "Content": "A threat actor has allegedly published a massive dataset belonging to Karage, a major automotive service platform in Saudi Arabia. Karage is a significant entity in the region’s automotive sector, with mobile applications on both iOS and Android, over 15,000 monthly active users, and a reported transaction volume exceeding 209 billion Saudi Riyals. The release of data allegedly follows a 30-day period during which the company ignored a ransom demand of $3,000 in Bitcoin.\nThe compromised information, now allegedly circulating on a dark web forum, poses a significant risk to the company, its employees, and its customers. The threat actor claims the dump contains a wide array of sensitive information that could be exploited for malicious purposes. The full extent of the damage is still being assessed, but the initial claims point to a comprehensive breach of the company’s digital assets.\nThe leaked data allegedly includes:\nFull customer database with names, phone numbers, vehicle license plates, and car models.\nComplete transaction history from 2016 to 2025.\nInternal workshop documents.\nEmployee records.\nUnreleased application source code.\nTags:\nAutomotive\ncyber-attack\nCyberSecurity\ndata-breach\ndata-leak\nKarage\nransom\nSaudi Arabia"
    },
    {
        "Title": "Indian Defense Manufacturer AWEIL Allegedly Breached, Sensitive Military Data for Sale",
        "Link": "https://dailydarkweb.net/indian-defense-manufacturer-aweil-allegedly-breached-sensitive-military-data-for-sale/",
        "Summary": "Advanced Weapons and Equipment India Limited (AWEIL), a major Indian public sector defense company, has allegedly suffered a significant data breach. A threat actor has posted on a dark web forum claiming to be selling sensitive documents belonging to the company. AWEIL is a critical entity within India&#8217;s defense infrastructure, responsible for manufacturing and supplying [&#8230;]",
        "Date": "2025-06-12",
        "Content": "Advanced Weapons and Equipment India Limited (AWEIL), a major Indian public sector defense company, has allegedly suffered a significant data breach. A threat actor has posted on a dark web forum claiming to be selling sensitive documents belonging to the company. AWEIL is a critical entity within India’s defense infrastructure, responsible for manufacturing and supplying small arms, artillery, and other armaments to the Indian Armed Forces, foreign militaries, and for domestic civilian use. The company operates under the administrative control of the Department of Defence Production, Ministry of Defence, Government of India.\nThe alleged breach could expose highly confidential information with serious national security implications. According to the forum post, the data for sale could be used by “enemies and competitors of India.” The threat actor has listed several types of information allegedly contained within the leaked documents, suggesting a deep compromise of the company’s internal files. The potential leak of such data could jeopardize ongoing military projects, compromise weapon capabilities, and create diplomatic tensions.\nThe data allegedly for sale includes:\nCritical weapon technical specifications, including range, caliber, and night firing capabilities.\nDetails on secret R&D projects like the 155mm Mounted Gun System and Anti-Material Rifle.\nArms export contracts to the Middle East and Europe, reportedly worth ₹581 crore.\nA list of importing countries that could potentially be used to create diplomatic pressure.\nTags:\nalleged leak\nAWEIL\nCyberSecurity\ndark web\ndata-breach\nDefense Industry\ngovernment\nIndia"
    }
]