[
    {
        "Title": "Echo Chamber Jailbreak Tricks LLMs Like OpenAI and Google into Generating Harmful Content",
        "Link": "https://thehackernews.com/2025/06/echo-chamber-jailbreak-tricks-llms-like.html",
        "Summary": "Cybersecurity researchers are calling attention to a new jailbreaking method called Echo Chamber that could be leveraged to trick popular large language models (LLMs) into generating undesirable responses, irrespective of the safeguards put in place.\n\"Unlike traditional jailbreaks that rely on adversarial phrasing or character obfuscation, Echo Chamber weaponizes indirect references, semantic",
        "Date": "2025-06-23",
        "Content": "Cybersecurity researchers are calling attention to a new jailbreaking method called Echo Chamber that could be leveraged to trick popular large language models (LLMs) into generating undesirable responses, irrespective of the safeguards put in place.\n\"Unlike traditional jailbreaks that rely on adversarial phrasing or character obfuscation, Echo Chamber weaponizes indirect references, semantic steering, and multi-step inference,\" NeuralTrust researcher Ahmad Alobaid\nsaid\nin a report shared with The Hacker News.\n\"The result is a subtle yet powerful manipulation of the model's internal state, gradually leading it to produce policy-violating responses.\"\nWhile LLMs have steadily\nincorporated various guardrails\nto combat\nprompt injections and jailbreaks\n, the latest research shows that there exist techniques that can yield high success rates with little to no technical expertise.\nIt also serves to highlight a persistent challenge associated with developing ethical LLMs that enforce clear demarcation between what topics are acceptable and not acceptable.\nWhile widely-used LLMs are designed to refuse user prompts that revolve around prohibited topics, they can be nudged towards eliciting unethical responses as part of what's called a multi-turn jailbreaking.\nIn these attacks, the attacker starts with something innocuous and then progressively asks a model a series of increasingly malicious questions that ultimately trick it into producing harmful content. This attack is referred to as\nCrescendo\n.\nLLMs are also susceptible to\nmany-shot jailbreaks\n, which take advantage of their large context window (i.e., the maximum amount of text that can fit within a prompt) to flood the AI system with several questions (and answers) that exhibit jailbroken behavior preceding the final harmful question. This, in turn, causes the LLM to continue the same pattern and produce harmful content.\nEcho Chamber, per NeuralTrust, leverages a combination of context poisoning and multi-turn reasoning to defeat a model's safety mechanisms.\nEcho Chamber Attack\n\"The main difference is that Crescendo is the one steering the conversation from the start while the Echo Chamber is kind of asking the LLM to fill in the gaps and then we steer the model accordingly using only the LLM responses,\" Alobaid said in a statement shared with The Hacker News.\nSpecifically, this plays out as a multi-stage adversarial prompting technique that starts with a seemingly-innocuous input, while gradually and indirectly steering it towards generating dangerous content without giving away the end goal of the attack (e.g., generating hate speech).\n\"Early planted prompts influence the model's responses, which are then leveraged in later turns to reinforce the original objective,\" NeuralTrust said. \"This creates a feedback loop where the model begins to amplify the harmful subtext embedded in the conversation, gradually eroding its own safety resistances.\"\nIn a controlled evaluation environment using OpenAI and Google's models, the Echo Chamber attack achieved a success rate of over 90% on topics related to sexism, violence, hate speech, and pornography. It also achieved nearly 80% success in the misinformation and self-harm categories.\n\"The Echo Chamber Attack reveals a critical blind spot in LLM alignment efforts,\" the company said. \"As models become more capable of sustained inference, they also become more vulnerable to indirect exploitation.\"\nThe disclosure comes as Cato Networks demonstrated a proof-of-concept (PoC) attack that targets\nAtlassian's model context protocol (MCP) server\nand its integration with Jira Service Management (JSM) to trigger prompt injection attacks when a malicious support ticket submitted by an external threat actor is processed by a support engineer using\nMCP tools\n.\nThe cybersecurity company has coined the term \"Living off AI\" to describe these attacks, where an AI system that executes untrusted input without adequate isolation guarantees can be abused by adversaries to gain privileged access without having to authenticate themselves.\n\"The threat actor never accessed the Atlassian MCP directly,\" security researchers Guy Waizel, Dolev Moshe Attiya, and Shlomo Bamberger\nsaid\n. \"Instead, the support engineer acted as a proxy, unknowingly executing malicious instructions through Atlassian MCP.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "DHS Warns Pro-Iranian Hackers Likely to Target U.S. Networks After Iranian Nuclear Strikes",
        "Link": "https://thehackernews.com/2025/06/dhs-warns-pro-iranian-hackers-likely-to.html",
        "Summary": "The United States government has warned of cyber attacks mounted by pro-Iranian groups after it launched airstrikes on Iranian nuclear sites as part of the Iran–Israel war that commenced on June 13, 2025.\nStating that the ongoing conflict has created a \"heightened threat environment\" in the country, the Department of Homeland Security (DHS) said in a bulletin that cyber actors are likely to",
        "Date": "2025-06-23",
        "Content": "The United States government has warned of cyber attacks mounted by pro-Iranian groups after it launched airstrikes on Iranian nuclear sites as part of the Iran–Israel war that commenced on June 13, 2025.\nStating that the ongoing conflict has created a \"heightened threat environment\" in the country, the Department of Homeland Security (DHS) said in a bulletin that cyber actors are likely to target U.S. networks.\n\"Low-level cyber attacks against U.S. networks by pro-Iranian hacktivists are likely, and cyber actors affiliated with the Iranian government may conduct attacks against U.S. networks,\" the DHS\nsaid\n.\n\"Both hacktivists and Iranian government-affiliated actors routinely target poorly secured U.S. networks and Internet-connected devices for disruptive cyber attacks.\"\nThe development comes after U.S. President Donald Trump\nannounced\nthat the U.S. military had conducted a\nbombing attack\non three Iranian nuclear facilities at Fordo, Natanz, and Isfahan. Trump described the strikes as a \"spectacular military success\" and warned of \"far greater\" attacks if Tehran does not make peace.\nThe Iran-Israel war of 2025 has\ntriggered\na maelstrom in cyberspace, what with hacktivist groups aligned with the two nations targeting the other.\nIn response to the U.S. military strikes, a pro-Iranian group named Team 313\nclaimed\nit took down Trump's Truth Social platform in a distributed denial-of-service (DDoS) attack.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "XDigo Malware Exploits Windows LNK Flaw in Eastern European Government Attacks",
        "Link": "https://thehackernews.com/2025/06/xdigo-malware-exploits-windows-lnk-flaw.html",
        "Summary": "Cybersecurity researchers have uncovered a Go-based malware called XDigo that has been used in attacks targeting Eastern European governmental entities in March 2025.\nThe attack chains are said to have leveraged a collection of Windows shortcut (LNK) files as part of a multi-stage procedure to deploy the malware, French cybersecurity company HarfangLab said.\nXDSpy is the name assigned to a cyber",
        "Date": "2025-06-23",
        "Content": "Cybersecurity researchers have uncovered a Go-based malware called XDigo that has been used in attacks targeting Eastern European governmental entities in March 2025.\nThe attack chains are said to have leveraged a collection of Windows shortcut (\nLNK\n) files as part of a multi-stage procedure to deploy the malware, French cybersecurity company HarfangLab\nsaid\n.\nXDSpy is the name\nassigned\nto a cyber espionage that's known to target government agencies in Eastern Europe and the Balkans since 2011. It was first documented by the Belarusian CERT in early 2020.\nIn recent years, companies in Russia and Moldova have been targeted by various campaigns to deliver malware families like UTask, XDDown, and DSDownloader that can download additional payloads and steal sensitive information from compromised hosts.\nHarfangLab said it observed the threat actor leveraging a remote code execution flaw in Microsoft Windows that's triggered when processing specially crafted LNK files. The vulnerability (\nZDI-CAN-25373\n) was publicly disclosed by Trend Micro earlier this March.\n\"Crafted data in an LNK file can cause hazardous content in the file to be invisible to a user who inspects the file via the Windows-provided user interface,\" Trend Micro's Zero Day Initiative (ZDI) said at the time. \"An attacker can leverage this vulnerability to execute code in the context of the current user.\"\nFurther analysis of the LNK file artifacts that exploit ZDI-CAN-25373 has uncovered a smaller subset comprising nine samples, which take advantage of an LNK parsing confusion flaw stemming as a result of Microsoft not implementing its own\nMS-SHLLINK\nspecification (version 8.0).\nAccording to the spec, the maximum theoretical limit for the length of a string within LNK files is the greatest integer value that can be encoded within\ntwo bytes\n(i.e., 65,535 characters). However, the actual Windows 11 implementation limits the total stored text content to 259 characters with the exception of command-line arguments.\n\"This leads to confusing situations, where some LNK files are parsed differently per specification and in Windows, or even that some LNK files which should be invalid per specification are actually valid to Microsoft Windows,\" HarfangLab said.\n\"Because of this deviation from the specification, one can specifically craft an LNK file which seemingly executes a certain command line or even be invalid according to third-party parsers implementing the specification, while executing another command line in Windows.\"\nA consequence of combining the whitespace padding issue with the LNK parsing confusion is that it can be leveraged by attackers to hide the command that's being executed on both Windows UI and third-party parsers.\nThe nine LNK files are said to have been distributed within ZIP archives, with each of the latter containing a second ZIP archive that includes a decoy PDF file, a legitimate but renamed executable, and a rogue DLL that's sideloaded via the binary.\nIt's worth noting this attack chain was documented by BI.ZONE late last month as conducted by a threat actor it tracks as\nSilent Werewolf\nto infect Moldovan and Russian companies with malware.\nThe DLL is a first-stage downloader dubbed ETDownloader that, in turn, is likely meant to deploy a data collection implant referred to as XDigo based on infrastructure, victimology, timing, tactics, and tooling overlaps. XDigo is assessed to be a newer version of malware (\"UsrRunVGA.exe\") that was\ndetailed\nby Kaspersky in October 2023.\nXDigo is a\nstealer\nthat can harvest files, extract clipboard content, and capture screenshots. It also supports commands to execute a command or binary retrieved from a remote server over HTTP GET requests. Data exfiltration occurs via HTTP POST requests.\nAt least one confirmed target has been identified in the Minsk region, with other artifacts suggesting the targeting of Russian retail groups, financial institutions, large insurance companies, and governmental postal services.\n\"This targeting profile aligns with XDSpy's historical pursuit of government entities in Eastern Europe and Belarus in particular,\" HarfangLab said.\n\"XDSpy's focus is also demonstrated by its customized evasion capabilities, as their malware was reported as the first malware attempting to evade detection from PT Security's\nSandbox solution\n, a Russian cybersecurity company providing service to public and financial organizations in the Russian Federation.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "How AI-Enabled Workflow Automation Can Help SOCs Reduce Burnout",
        "Link": "https://thehackernews.com/2025/06/how-ai-enabled-workflow-automation-can.html",
        "Summary": "It sure is a hard time to be a SOC analyst. \nEvery day, they are expected to solve high-consequence problems with half the data and twice the pressure. Analysts are overwhelmed—not just by threats, but by the systems and processes in place that are meant to help them respond. Tooling is fragmented. Workflows are heavy. Context lives in five places, and alerts never slow down. What started as a",
        "Date": "2025-06-23",
        "Content": "It sure is a hard time to be a SOC analyst.\nEvery day, they are expected to solve high-consequence problems with half the data and twice the pressure. Analysts are overwhelmed—not just by threats, but by the systems and processes in place that are meant to help them respond. Tooling is fragmented. Workflows are heavy. Context lives in five places, and alerts never slow down. What started as a fast-paced, high-impact role has, for many analysts, become a repetitive loop of alert triage and data wrangling that offers little room for strategy or growth.\nMost SOC teams also run lean. Last year,\nour annual SANS SOC Survey\nfound that a majority of SOCs only consist of just 2–10 full-time analysts\n,\na number unchanged since the survey began tracking in 2017. Meanwhile, the scope of coverage has exploded, ranging from on-prem infrastructure to cloud environments, remote endpoints, SaaS platforms, and beyond. Compounded at scale, this has led to systemic burnout across SOC environments—a legitimate business risk that hinders your organization's ability to defend itself.\nAddressing the issue isn't a matter of simply increasing headcount. The longer we treat burnout as a people problem, the longer we ignore what's really going wrong inside the SOC. The challenge at hand demands a shift in how SOC work is designed and executed, as well as how analysts are positioned for success.\nEnter artificial intelligence (AI). AI implementation at scale offers a practical path forward here by optimizing parts of the job that push analysts toward the door: the repetitive steps, the cognitive overhead, and the lack of visible progress. From streamlining inefficient workflows and supporting skill development to facilitating more impactful team-wide oversight, AI can open wider avenues for making SOC work more sustainable.\nReducing Alert Fatigue and Repetitive Load with Smarter Automation\nA constant stream of low-context alerts is one of the fastest ways to drain a SOC team. In the SANS SOC Survey, 38% of organizations reported ingesting all available data into their SIEM. While that may expand visibility, it also floods analysts with low-priority noise. And without strong correlation logic or cross-platform integration, assembling a full picture still falls on the analyst. They're left chasing indicators across disjointed systems, piecing together context manually, and deciding whether escalation is even necessary. It's inefficient, exhausting, and unsustainable.\nSOC teams have been automating tasks for years, but most of that automation has relied on brittle logic like rigid playbooks and static SOAR flows that break down as soon as the scenario deviates from the expected. AI changes that. AI-powered automation can relieve that pressure by acting as a uniquely powerful contextual aggregator and investigative assistant. When paired with capabilities like those enabled by the new Model Context Protocol (MCP), language models can integrate telemetry, threat intelligence, asset metadata, and user history into a single view, tailoring it to each unique situation the analyst faces. This gives analysts enriched, case-specific summaries instead of raw events. Clarity replaces guesswork. Response decisions happen faster and with greater confidence—two things that directly reduce burnout.\nThe key here is that, unlike SOAR, AI enables adaptive automation and even makes it easily accessible via an LLM interface. With AI agents and new standards like MCP and Agent2Agent protocol, a future is now here where analysts can describe what needs to happen in plain language, and the system can dynamically build the automation, deciding which tasks need to be performed and the best way to complete them. Whether it's retrieving data, correlating signals, or coordinating a response, AI can adjust in real time based on context. That flexibility matters, especially when investigation paths aren't always clear or linear.\nBuilding Analyst Confidence Through Smarter Feedback\nBurnout doesn't only come from long hours. Sometimes it stems from stagnation—doing the same work without growing or getting meaningful feedback. If an analyst doesn't see progress, frustration takes root quickly. This is an area where AI can offer real support. It allows analysts to refine their own work on the fly—tuning detection logic, troubleshooting false positives, and generating better queries with fast, targeted suggestions. Real-time feedback like this is especially valuable for newer analysts, but even experienced team members benefit from the ability to pressure-test their approach without waiting for peer review.\nThese interactions support what researchers call deliberate practice: focused repetition paired with immediate, actionable feedback. That is worth its weight in gold when it comes to retention. According to the SANS SOC Survey, \"meaningful work\" and \"career progression\" were ranked as the top two factors in analyst retention—above compensation. Teams that embed growth into the day-to-day workflow are more likely to keep their people. AI can't replace human mentorship, but it can help replicate some of its most meaningful effects at scale.\nHelping SOC Leaders Manage and Strengthen Their Teams\nSOC leaders have a direct influence on reducing burnout. However, a lack of time and visibility is often their biggest obstacle for making a positive impact. Performance data such as case load, note quality, investigation depth, and response times is scattered across platforms and investigations. Without a way to synthesize it, managers are left guessing who's struggling and why.\nAI makes that analysis possible. With access to case management and workflow data, models can surface performance trends: which analysts consistently handle certain threat types well, where errors cluster, or when quality is starting to dip. That insight allows managers to coach more effectively and assign work based on capability, not just availability. It also gives them the chance to intervene early. Burnout doesn't announce itself. It builds slowly, often out of sight. But with the right signals—flagging overload, spotting skill gaps, noticing drop-offs in case quality—leaders can take action before problems become exits.\nOver time, that kind of targeted support reshapes team culture. Performance improves, retention stabilizes, and analysts are more likely to stay and grow in roles where they feel seen, supported, and set up to succeed.\nLet's Continue the Conversation at SANS Network Security 2025\nSOC burnout rarely shows up all at once. It builds through repetition without learning, pressure without progress, and effort without impact. AI won't remove every stressor in the SOC, but it can help alleviate friction where it matters most.\nIf this topic resonates, join me at SANS Network Security 2025 this September in Las Vegas. I'll be leading sessions on building healthier, more effective SOCs—including how to apply AI to reduce burnout, streamline workflows, and support analyst growth in real-world environments.\nRegister for SANS Network Security 2025 (Sept. 22-27, 2025) here\n.\nNote:\nThis article was expertly written and contributed by John Hubbard, SANS Senior Instructor.\nLearn more about his background and courses here\n.\nNote:\nThis article was written and contributed by John Hubbard, Senior Instructor at the SANS Institute.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Google Adds Multi-Layered Defenses to Secure GenAI from Prompt Injection Attacks",
        "Link": "https://thehackernews.com/2025/06/google-adds-multi-layered-defenses-to.html",
        "Summary": "Google has revealed the various safety measures that are being incorporated into its generative artificial intelligence (AI) systems to mitigate emerging attack vectors like indirect prompt injections and improve the overall security posture for agentic AI systems.\n\"Unlike direct prompt injections, where an attacker directly inputs malicious commands into a prompt, indirect prompt injections",
        "Date": "2025-06-23",
        "Content": "Google has revealed the various safety measures that are being incorporated into its generative artificial intelligence (AI) systems to mitigate emerging attack vectors like indirect prompt injections and improve the overall security posture for agentic AI systems.\n\"Unlike direct prompt injections, where an attacker directly inputs malicious commands into a prompt,\nindirect prompt injections\ninvolve hidden malicious instructions within external data sources,\" Google's GenAI security team\nsaid\n.\nThese external sources can take the form of email messages, documents, or even calendar invites that trick the AI systems into exfiltrating sensitive data or performing other malicious actions.\nThe tech giant said it has\nimplemented\nwhat it described as a \"layered\" defense strategy that is designed to increase the difficulty, expense, and complexity required to pull off an attack against its systems.\nThese efforts span model hardening, introducing purpose-built machine learning (ML) models to flag malicious instructions and system-level safeguards. Furthermore, the model resilience capabilities are complemented by an array of additional guardrails that have been built into Gemini, the company's flagship GenAI model.\nThese include -\nPrompt injection content classifiers, which are capable of filtering out malicious instructions to generate a safe response\nSecurity thought reinforcement, which inserts special markers into untrusted data (e.g., email) to ensure that the model steers away from adversarial instructions, if any, present in the content, a technique called spotlighting.\nMarkdown sanitization and suspicious URL redaction, which uses Google Safe Browsing to remove potentially malicious URLs and employs a markdown sanitizer to prevent external image URLs from being rendered, thereby preventing flaws like\nEchoLeak\nUser confirmation framework, which requires user confirmation to complete risky actions\nEnd-user security mitigation notifications, which involve\nalerting users\nabout prompt injections\nHowever, Google pointed out that malicious actors are increasingly using adaptive attacks that are specifically designed to evolve and adapt with automated red teaming (ART) to bypass the defenses being tested, rendering baseline mitigations ineffective.\n\"Indirect prompt injection presents a real cybersecurity challenge where AI models sometimes struggle to differentiate between genuine user instructions and manipulative commands embedded within the data they retrieve,\" Google DeepMind\nnoted\nlast month.\n\"We believe robustness to indirect prompt injection, in general, will require defenses in depth – defenses imposed at each layer of an AI system stack, from how a model natively can understand when it is being attacked, through the application layer, down into hardware defenses on the serving infrastructure.\"\nThe development comes as new research has continued to find\nvarious techniques\nto bypass a large language model's (LLM) safety protections and generate undesirable content. These\ninclude\ncharacter injections and methods that \"perturb the model's interpretation of prompt context, exploiting over-reliance on learned features in the model's classification process.\"\nAnother study published by a team of researchers from Anthropic, Google DeepMind, ETH Zurich, and Carnegie Mellon University last month also found that LLMs can \"unlock new paths to monetizing exploits\" in the \"near future,\" not only extracting passwords and credit cards with higher precision than traditional tools, but also to devise polymorphic malware and launch tailored attacks on a user-by-user basis.\nThe study noted that LLMs can open up new attack avenues for adversaries, allowing them to leverage a model's multi-modal capabilities to extract personally identifiable information and analyze network devices within compromised environments to generate highly convincing, targeted fake web pages.\nAt the same time, one area where language models are lacking is their ability to find novel zero-day exploits in widely used software applications. That said, LLMs can be used to automate the process of identifying trivial vulnerabilities in programs that have never been audited, the research pointed out.\nAccording to\nDreadnode's\nred teaming benchmark\nAIRTBench\n, frontier models from Anthropic, Google, and OpenAI outperformed their open-source counterparts when it comes to solving AI Capture the Flag (CTF) challenges, excelling at prompt injection attacks but struggled when dealing with system exploitation and model inversion tasks.\n\"AIRTBench results indicate that although models are effective at certain vulnerability types, notably prompt injection, they remain limited in others, including model inversion and system exploitation – pointing to uneven progress across security-relevant capabilities,\" the researchers said.\n\"Furthermore, the remarkable efficiency advantage of AI agents over human operators – solving challenges in minutes versus hours while maintaining comparable success rates – indicates the transformative potential of these systems for security workflows.\"\nThat's not all. A new report from Anthropic last week revealed how a stress-test of 16 leading AI models found that they resorted to malicious insider behaviors like blackmailing and leaking sensitive information to competitors to avoid replacement or to achieve their goals.\n\"Models that would normally refuse harmful requests sometimes chose to blackmail, assist with corporate espionage, and even take some more extreme actions, when these behaviors were necessary to pursue their goals,\" Anthropic\nsaid\n, calling the phenomenon agentic misalignment.\n\"The consistency across models from different providers suggests this is not a quirk of any particular company's approach but a sign of a more fundamental risk from agentic large language models.\"\nThese disturbing patterns demonstrate that LLMs, despite the various kinds of defenses built into them, are willing to evade those very safeguards in high-stakes scenarios, causing them to consistently choose \"harm over failure.\" However, it's worth pointing out that there are no signs of such agentic misalignment in the real world.\n\"Models three years ago could accomplish none of the tasks laid out in this paper, and in three years models may have even more harmful capabilities if used for ill,\" the researchers\nsaid\n. \"We believe that better understanding the evolving threat landscape, developing stronger defenses, and applying language models towards defenses, are important areas of research.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "⚡ Weekly Recap: Chrome 0-Day, 7.3 Tbps DDoS, MFA Bypass Tricks, Banking Trojan and More",
        "Link": "https://thehackernews.com/2025/06/weekly-recap-chrome-0-day-73-tbps-ddos.html",
        "Summary": "Not every risk looks like an attack. Some problems start as small glitches, strange logs, or quiet delays that don’t seem urgent—until they are. What if your environment is already being tested, just not in ways you expected?\nSome of the most dangerous moves are hidden in plain sight. It’s worth asking: what patterns are we missing, and what signals are we ignoring because they don’t match old",
        "Date": "2025-06-23",
        "Content": "Not every risk looks like an attack. Some problems start as small glitches, strange logs, or quiet delays that don't seem urgent—until they are. What if your environment is already being tested, just not in ways you expected?\nSome of the most dangerous moves are hidden in plain sight. It's worth asking: what patterns are we missing, and what signals are we ignoring because they don't match old playbooks?\nThis week's reports bring those quiet signals into focus—from attacks that bypassed MFA using trusted tools, to supply chain compromises hiding behind everyday interfaces. Here's what stood out across the cybersecurity landscape:\n⚡ Threat of the Week\nCloudflare Blocks Massive 7.3 Tbps DDoS Attack\n— Cloudflare said it autonomously blocked the largest distributed denial-of-service (DDoS) attack ever recorded, which hit a peak of 7.3 terabits per second (Tbps). The attack, the company said, targeted an unnamed hosting provider and delivered 37.4 terabytes in 45 seconds. It originated from over 122,145 source IP addresses spanning 5,433 Autonomous Systems (AS) across 161 countries. The top sources of attack traffic included Brazil, Vietnam, Taiwan, China, Indonesia, Ukraine, Ecuador, Thailand, the United States, and Saudi Arabia.\nEssential Guide to Unlocking IT Agility with Automation: Patch Management\nManual patch management slows down teams and increases risk. Unlock IT agility with automation with this new Tines guide. Inside:\n5 steps to a scalable patching strategy\nHow Reddit, MyFitnessPal, and BCM One automate updates across systems and apps\nPre-built workflows to jumpstart your strategy\nGet the Guide ➝\n🔔 Top News\nPatched Google Chrome Flaw Exploited by TaxOff\n— A threat actor known as TaxOff exploited CVE-2025-2783, a now-patched security flaw in Google Chrome, as a zero-day in mid-March 2025 to target Russian organizations with a backdoor codenamed Trinper. The attacks share overlaps with another threat activity cluster dubbed Team46, which is believed to have been active since early 2024 and has leveraged another zero-day vulnerability in Yandex Browser for Windows in the past to deliver unspecified payloads.\nNorth Korea Employs Deepfakes in New Fake Zoom Scam\n— Threat actors with ties to North Korea targeted an unnamed employee of a cryptocurrency foundation with deceptive Zoom calls featuring deepfaked company executives to trick them into downloading malware. Cybersecurity company Huntress, which responded to the incident, said it discovered eight distinct malicious binaries on the victim host that are capable of running commands, dropping additional payloads, logging keystrokes, and stealing cryptocurrency-related files.\nRussian Threat Actors Use App Passwords to Bypass MFA\n— Russian threat actors tracked as UNC6293 have been found to bypass multi-factor authentication (MFA) and access Gmail accounts of targeted individuals by leveraging app-specific passwords in skilfully-crafted social engineering attacks that impersonate U.S. Department of State officials. The attacks, which started in at least April and continued through the beginning of June, are notable for their efforts to build trust with victims over weeks, instead of inducing a false sense of urgency and rushing them into taking unintended actions. The end goal of the attacks is to persuade the recipients to create and share app-specific passwords that would provide access to their Gmail accounts.\nGodfather Trojan Creates Sandbox on Infected Android Devices\n— A new version of the Godfather banking trojan has been found to create isolated virtual environments on Android devices to steal account data and transactions from legitimate banking apps. While the malware has been active since June 2021, the latest iteration takes its information-stealing capabilities to a whole new level through the deployment of a malicious app containing an embedded virtualization framework on infected devices, which is used to run copies of the targeted applications. Thus, when a user launches a banking app, they are redirected to the virtualized instance, from where sensitive data is stolen. The malware also displays a fake lock screen overlay to trick the victim into entering their PIN.\nIsrael-Iran Conflict Sparks Surge in Cyber Warfare\n— The Israel-Iran conflict that started with Israeli attacks on Iranian nuclear and military targets on June 13 has triggered a wider cyber conflict in the region, with hacktivist groups and ideologically motivated actors targeting both nations. Notable among them, the pro-Israel threat group known as\nPredatory Sparrow\nbreached Bank Sepah and Nobitex, claiming they have been used to circumvent international sanctions. Predatory Sparrow has been publicly linked to attacks targeting an Iranian steel production facility in 2022 and for causing outages at gas station payment systems across the country in 2021. Furthermore, Iran's state-owned TV broadcaster was hacked to interrupt regular programming and air videos calling for street protests against the Iranian government. Nearly three dozen pro-Iranian groups are estimated to have launched coordinated attacks against Israeli infrastructure. These acts represent another escalation of the use of cyber attacks during (and\nas a precursor\nto) geopolitical conflicts, while also underscoring the growing importance of cyber-augmented warfare.\n‎️‍🔥 Trending CVEs\nAttackers love software vulnerabilities – they're easy doors into your systems. Every week brings fresh flaws, and waiting too long to patch can turn a minor oversight into a major breach. Below are this week's critical vulnerabilities you need to know about. Take a look, update your software promptly, and keep attackers locked out.\nThis week's list includes —\nCVE-2025-34509, CVE-2025-34510, CVE-2025-34511\n(Sitecore XP),\nCVE-2025-6018, CVE-2025-6019, CVE-2025-6020\n(Linux),\nCVE-2025-23121\n(Veeam Backup & Replication),\nCVE-2025-3600\n(Progress Telerik UI for AJAX),\nCVE-2025-3464\n(ASUS Armoury Crate),\nCVE-2025-5309\n(BeyondTrust Remote Support and Privileged Remote Access),\nCVE-2025-5349\n,\nCVE-2025-5777\n(Citrix ADC and Gateway),\nCVE-2025-5071\n(AI Engine plugin),\nCVE-2025-4322\n(Motors theme),\nCVE-2025-1087\n(Insomnia API Client),\nCVE-2025-20260\n(ClamAV),\nCVE-2025-32896\n(Apache SeaTunnel),\nCVE-2025-50054\n(OpenVPN), and\nCVE-2025-1907\n(Instantel Micromate).\n📰 Around the Cyber World\nPrometei Botnet Resurgence in March 2025\n— The botnet known as Prometei has been observed in renewed attacks in March 2025, while also incorporating new features. \"The latest Prometei versions feature a backdoor that enables a variety of malicious activities. Threat actors employ a domain generation algorithm (DGA) for their command-and-control (C2) infrastructure and integrate self-updating features for stealth and evasion,\" Palo Alto Networks Unit 42\nsaid\n. Prometei,\nfirst spotted\nin July 2020, is capable of striking both Windows and\nLinux systems\nfor cryptocurrency mining, credential theft, and data exfiltration. It can also deploy additional malware payloads. In recent years, it has\nexploited\nWindows systems unpatched against ProxyLogon flaws. As of March 2023, it was\nestimated\nto have compromised more than 10,000 systems since November 2022. \"This modular design makes Prometei highly adaptable, as individual components can be updated or replaced without affecting the overall botnet functionality,\" Unit 42 said.\nBitoPro Hack Linked to Lazarus Group\n— Taiwanese cryptocurrency exchange BitoPro claimed the North Korean hacking group Lazarus is behind a cyber attack that led to the theft of $11,000,000 worth of cryptocurrency on May 9, 2025. \"The attack methodology bears resemblance to patterns observed in multiple past international major incidents, including illicit transfers from global bank SWIFT systems and asset theft incidents from major international cryptocurrency exchanges. These attacks are attributed to the North Korean hacking organization 'Lazarus Group,'\" the company\nsaid\n. BitPro also revealed the attackers conducted a social engineering attack on a team member responsible for cloud operations to implant malware and remotely access their computer, while evading security monitoring. \"They subsequently hijacked AWS Session Tokens to bypass Multi-Factor Authentication (MFA),\" it added. \"From the AWS environment, they delivered commands via a C2 server to discreetly transfer malicious scripts to the hot wallet host, awaiting an opportunity to launch the attack. After prolonged observation, the hackers specifically targeted the platform during its wallet system upgrade and asset transfer period, simulating normal operational behaviors to launch the attack.\" On May 9, the malicious script was executed to transfer cryptocurrency from the hot wallet. BitPro said it shut down its hot wallet system, rotated all cryptographic keys, and isolated and rebuilt affected systems after discovering unusual wallet activity. The heist is the latest to be attributed to the notorious Lazarus Group, which was implicated in the record-breaking $1.5 billion theft from\nBybit\n.\nMicrosoft Plans to Clean Up Legacy Drivers\n— Microsoft said it's launching a \"strategic initiative\" to periodically clean up legacy drivers published on Windows Update to reduce security and compatibility risks. \"The rationale behind this initiative is to ensure that we have the optimal set of drivers on Windows Update that cater to a variety of hardware devices across the Windows ecosystem, while making sure that Microsoft Windows security posture is not compromised,\" the company\nsaid\n. \"This initiative involves periodic cleanup of drivers from Windows Update, thereby resulting in some drivers not being offered to any systems in the ecosystem.\"\nMocha Manakin Uses ClickFix to Deliver Node.js Backdoor\n— A previously undocumented threat actor known as Mocha Manakin has been linked to a new set of attacks that leverage the well-known\nClickFix\n(aka Paste and run or fakeCAPTCHA) as an initial access technique to drop a bespoke Node.js backdoor codenamed NodeInitRAT. \"NodeInitRAT allows the adversary to establish persistence and perform reconnaissance activities, such as enumerating principal names and gathering domain details,\" Red Canary\nsaid\n. \"NodeInitRAT communicates with adversary-controlled servers over HTTP, often through Cloudflare tunnels acting as intermediary infrastructure.\" The backdoor comes with capabilities to execute arbitrary commands and deploy additional payloads on compromised systems. The threat actor was first observed by the cybersecurity company in January 2025. It's assessed that the backdoor overlaps with a Node.js executable used in\nInterlock ransomware attacks\n.\nChina Targets Russia to Seek War Secrets\n— State-sponsored hackers from China have repeatedly broken into Russian companies and government agencies to likely look for military secrets since the country's invasion of Ukraine in 2022. According to The New York Times, intrusions\naccelerated\nin May 2022, with one group known as Sanyo impersonating the email addresses of a major Russian engineering firm to gather information on nuclear submarines. In a classified document prepared by the domestic security agency, Russia is said to have claimed that \"China is seeking Russian defense expertise and technology and is trying to learn from Russia's military experience in Ukraine,\" calling China an \"enemy.\" Another threat actor of interest is Mustang Panda, which has expanded its scope to target governmental organizations in Russia and the European Union post the Russo-Ukrainian war.\nCoinMarketCap Website Hacked With Fake \"Verify Wallet\" Pop-up\n— CoinMarketCap (CMC), a popular platform for cryptocurrency tracking,\ndisclosed\nthat its website was hacked to serve a \"malicious pop-up prompting users to 'Verify Wallet'\" with the goal of draining users digital assets. While it's currently not clear how the attackers carried out the attack, the company said it has since\nidentified and removed the malicious code\nfrom its site. According to Coinspect Security, the drainer was injected via CoinMarketCap's rotating \"Doodles\" feature that's served from the domain api.coinmarketcap[.]com. \"CoinMarketCap's backend API serves manipulated JSON data that injects malicious JavaScript through the rotating 'doodles' feature,\" the company said. \"Not all users see it, since the doodle shown varies per visit. The injected wallet drainer always loads if you visit /doodles/.\" Specifically, this involves loading the drainer from the \"CoinmarketCLAP\" doodle's JSON file, exploiting a code injection vulnerability that exploits Lottie animation JSON files to inject arbitrary JavaScript from an external site named static.cdnkit[.]io. \"On June 20, 2025, our security team identified a vulnerability related to a doodle image displayed on our homepage,\" CoinMarketCap\nsaid\n. \"This doodle image contained a link that triggered malicious code through an API call, resulting in an unexpected pop-up for some users when visited (sic) our homepage.\" CoinMarketCap did not reveal how many users encountered the pop-up or whether any wallets were compromised. However, according to screenshots shared by a threat actor named\nReyXBF\non X, about $43,266 was\nsiphoned\nfrom 110 victims who interacted with the fake wallet verification pop-up. \"This was a supply chain attack, meaning the breach didn't target CMC's own servers but a third-party tool or resource used by CMC,\" c/side\nsaid\n.\nMalicious JavaScript Served via Corrupted Version of jQuery Migrate\n— In another supply chain threat, cybersecurity researchers discovered a malware infection chain that employed a malicious version of a version of the jQuery Migrate library that had been altered to remotely insert and execute arbitrary JavaScript into the victim's browser. The first step in the attack was the compromise of a legitimate WordPress site (\"tabukchamber[.]sa\"), likely either via a vulnerable plugin or compromised credentials, to inject obfuscated logic related to\nParrot TDS\n, which is designed to fingerprint the browser and selectively serve malware to qualifying users based on certain criteria. In this case, one of the tailored JavaScript responses included a dropper script disguised as jquery-migrate-3.4.1.min.js. The attack, per Trellix, unfolded when a senior executive from one of its enterprise clients accessed the WordPress website. \"This method of infection shows a well-planned, covert operation focused on blending malware into normal website behavior, leveraging the weakest link – unverified third-party frontend pipelines,\" the company\nsaid\n.\nTesla Wall Connector Hacked to Carry Out Downgrade Attacks\n— Researchers demonstrated an attack technique that exploited the\nTesla Wall Connector\n, a\ncharger\nfor electric vehicles, to install vulnerable firmware on the device and ultimately execute arbitrary code on the device. The attack takes advantage of the fact that Tesla vehicles can update the charging connector through a charging cable using a proprietary protocol. Synacktiv said it pulled off a successful exploit in approximately 18 minutes due to the \"low bandwidth of the SWCAN [Single-Wire Controller Area Network] bus.\" To achieve this, a Tesla car simulator was built to communicate with the charger in SWCAN communication mode, enabling them to run the downgrade logic, use Unified Diagnostic Services (\nUDS\n) to extract Wi-Fi credentials, and obtain a debug shell. Furthermore, a buffer overflow in the debug shell's command parsing logic could be exploited to achieve code execution on the device. \"Since the Wall Connector is typically connected to a home, hotel, or business network, gaining access to the device could provide a foothold into the private network, potentially allowing lateral movement to other devices,\" the company\nsaid\n. Tesla has addressed the issue by implementing an anti-downgrade mechanism, preventing the firmware rollback used in the attack.\nASRJam Devised to Block Automated Phone Scams\n— A group of academics from Ben Gurion University of the Negev and Amrita Vishwa Vidyapeetham has developed a new framework called ASRJam that injects adversarial perturbations into a victim's audio to disrupt an attacker's Automatic Speech Recognition (ASR) system. Powered by a jamming algorithm dubbed EchoGuard, it leverages natural distortions, such as reverberation and echo, to counter speech recognition systems that are used by attackers to conduct vishing attacks and elicit sensitive information from victims or trick them into performing a malicious action. ASRJam \"targets the weakest link in the attacker's pipeline, speech recognition, disrupting LLM-driven vishing attacks without affecting human intelligibility,\" according to the\nstudy\n.\nAnonSecKh Targets Thai Entities After Border Flare-Up\n— A Cambodian hacktivist group has ramped up cyber attacks against Thai entities following a border skirmish between the two countries late last month that led to the death of a Cambodian soldier. The AnonsecKh group (aka ANON-KH or Bl4ckCyb3r) claimed at least 73 attacks on Thai organizations between May 28 and June 10, 2025. Targets included government websites, followed by entities in the military, manufacturing, and finance sectors. \"Their attacks are tightly linked to political incidents and demonstrate a reactive pattern,\" Radware\nsaid\n. \"The group has shown the ability to launch rapid and intense attack waves.\"\nDoJ Seizes Record $225 Million in Crypto Tied to Romance Baiting Scams\n— The U.S. Department of Justice (DoJ) said it has filed a civil forfeiture complaint seeking to recover over $225 million in cryptocurrency linked to\ncryptocurrency confidence (aka romance baiting) scams\nrunning out of Vietnam and the Philippines, the largest crypto seizure by the U.S. government to date. \"The cryptocurrency addresses that held over $225.3 million in cryptocurrency were part of a sophisticated blockchain-based money laundering network that executed hundreds of thousands of transactions and was used to disperse proceeds of cryptocurrency investment fraud across many cryptocurrency addresses and accounts on the blockchain to conceal the source of the illegally obtained funds,\" the DoJ\nsaid\n. More than 430 suspected victims are believed to have lost their funds after being duped into believing that they were making legitimate cryptocurrency investments. According to TRM Labs, the scheme involved directing victims to fake investment platforms that impersonated legitimate trading environments, luring them with the promise of high returns. While these services enabled smaller withdrawals, they blocked access or imposed fake tax or fee requirements when victims initiated larger withdrawal requests. As many as 144 accounts at the virtual currency exchange OKX were used for laundering the proceeds of the operation. \"These accounts exhibited patterns of coordinated activity, including the use of Vietnamese KYC documents, overlapping IP addresses geolocated in the Philippines, and KYC photographs taken in the same physical setting,\" the company\nsaid\n.\nNigerian National Sent to U.S. Prison for Cyber Scams\n— Ridwan Adeleke Adepoju, a 33-year-old from Lagos, Nigeria, has been sentenced to three and a half years in federal prison for conducting a variety of cyber fraud schemes that targeted U.S. citizens and businesses, including phishing scams, romance scams, and submitting fraudulent tax returns. \"The scams involved multiple spoofed email addresses, fictional social media personas, and unwitting money mules,\" the DoJ\nsaid\n. Adepoju was arrested last year in the U.K. and later extradited to the U.S.\nMalicious Firefox Browser Add-ons Spotted\n— Cybersecurity researchers have\nuncovered\nseveral add-ons in the official extensions marketplace for Mozilla Firefox that is capable of leading users to tech support scam websites through pop-ups related to fake virus alerts and system errors (Shell Shockers io), redirecting Wikipedia traffic to an alternative domain that advertises a proxy service (wikipedia engelsiz giris), and manipulating user engagement metrics on platforms like Facebook by artificially inflating likes and views.\nSmartphones in North Korea Take Screenshots Every 5 Minutes\n— A smartphone smuggled out of North Korea in late 2024 had been programmed such that it takes a screenshot every five minutes and saves it in a folder, highlighting the extent to which the regime tries to exert its control over citizens, censor information, and indoctrinate people. BBC, which\nobtained\nthe phone, said the device is engineered to automatically replace forbidden words with their North Korean equivalents, such as substituting the word \"South Korea\" with the term \"Puppet state.\"\nU.K. Fines 23andMe for 2023 Data Breach\n— The U.K. data protection watchdog, the Information Commissioner's Office (ICO),\nsaid\nit's fining\nembattled genomics company 23andMe\n$3.1 million over its 2023 breach and for failing to implement appropriate security measures to protect the personal information of U.K. users. The 2023 hack allowed unidentified threat actors to conduct a credential stuffing attack between April and September 2023 to gain unauthorized access to personal information belonging to 155,592 U.K. residents, likely revealing names, birth years, self-reported city or postcode-level location, profile images, race, ethnicity, family trees, and health reports in the process. The exact nature of the exposed information varied on a per-user basis. The ICO faulted 23andMe for not implementing appropriate authentication and verification measures and for not enforcing controls over access to raw genetic data. It also said the company did not have effective systems in place to \"monitor, detect, or respond to cyber threats targeting its customers' sensitive information.\" The ICO further said 23andMe took until the end of 2024 to sufficiently address the security issues that underpinned the credential-stuffing attack.\nMore than 46K Grafana Instances Vulnerable to CVE-2025-4123\n— More than 46,000 internet-facing Grafana instances are susceptible to a recently disclosed security flaw (\nCVE-2025-4123\naka The Grafana Ghost) that could permit an attacker to run arbitrary code and take control the victims' accounts by luring them into clicking URLs that lead to loading a rogue Grafana plugin from a site controlled by the threat actor without requiring any elevated permissions. \"The vulnerability also affects Grafana instances running locally by crafting a payload that takes advantage of the locally used domain name and port for the local service,\" OX Security\nsaid\n. The disclosure comes as Censys\nrevealed\nthat there are nearly 400 web-based human-machine interfaces (HMIs) exposed to the internet, out of which 40 were fully unauthenticated and controllable by anyone with a browser. A majority of these systems have since been secured. On top of that,\nalmost 35,000 solar power systems\nfrom 42 vendors have been detected as publicly exposing their management interfaces over the internet.\nViasat Hacked by Salt Typhoon\n— U.S. satellite communications company Viasat has acknowledged that it was targeted by China-linked\nSalt Typhoon\nhackers. According to Bloomberg, the breach was\ndiscovered\nearlier this year. Viasat confirmed that it had detected unauthorized access through a compromised device, but said it had found no evidence of impact to customers.\nFreeType Zero-Day Exploited in Paragon Spyware Attacks\n— A security flaw in FreeType (\nCVE-2025-27363\n) was exploited as a zero-day in connection with a\nParagon Graphite\nspyware attack that leveraged WhatsApp as a delivery vector, according to a\nreport\nfrom SecurityWeek. In March, WhatsApp\nrevealed\nthat it disrupted a campaign that involved the use of Graphite spyware to target around 90 journalists and civil society members. The vulnerability was\naddressed\nby Google last month in Android.\nVADER to Detect and Neutralize Dead Drops\n— Threat actors are known to leverage legitimate and trusted platforms like Dropbox, Google Drive, and Pastebin as dead drop resolvers (\nDDRs\n) to host information that points to the actual command-and-control (C2) servers in a likely effort to sidestep detection and blend in with regular activity within enterprise networks. This also makes the malicious infrastructure more resilient, since the attackers can dynamically change the list of C2 servers, in case the original one is taken down. Enter\nVADER\n, short for Vulnerability Analysis for Dead Drop Endpoint Resolution, which\naims\nto improve web application security through proactive Dead Drop Resolver remediation. \"Analyzing a dataset of 100,000 malware samples collected in the wild, VADER identified 8,906 DDR malware samples from 110 families that leverage 273 dead drops across seven web applications,\" academics from the Georgia Institute of Technology said. \"Additionally, it proactively uncovered 57.1% more dead drops spanning 11 web applications.\"\n🎥 Cybersecurity Webinars\nThey're Faking Your Brand — Stop AI Impersonation Before It Spreads\n—\nAI attackers are pretending to be your company, your execs—even your employees. From fake emails to deepfakes, it's happening fast. In this webinar, Doppel will show how to detect and stop impersonation across the platforms that matter most—before customers or partners are fooled. Join to protect your brand in the age of AI threats.\nAI Agents Are Leaking Data — Learn How to Fix It Fast\n—\nAI tools like ChatGPT and Copilot are often linked to Google Drive or SharePoint—but without the right settings, they can leak private files. In this webinar, experts from Sentra break down real examples of how data exposure happens—and what you can do right now to stop it. If your team is using AI, this is a must-watch before something slips through.\n🔧 Cybersecurity Tools\nglpwnme\n—\nIt is a simple, powerful tool to find and exploit known vulnerabilities in GLPI, a widely used IT asset management platform. It helps security teams and pen-testers detect issues like RCEs, plugin flaws, and default credentials across multiple GLPI versions. Ideal for red teaming, bug bounty, or internal audits, glpwnme also supports safe cleanup and plugin enumeration—making it perfect for fast, focused GLPI security checks.\nDebloat\n—\nIt is a simple tool that removes junk data from bloated executables—often 100–800MB added to evade sandboxing. With both GUI and CLI support, it cleans inflated binaries in seconds using automated detection of common packing tricks. Used by platforms like AssemblyLine and MWDB, it's ideal for malware analysts and CERT teams who need fast, reliable cleanup before deeper analysis.\nDisclaimer: These newly released tools are for educational use only and haven't been fully audited. Use at your own risk—review the code, test safely, and apply proper safeguards.\n🔒 Tip of the Week\nSCCM Can Be a Silent Domain Takeover Tool — Here's How to Secure It ➝\nMicrosoft's System Center Configuration Manager (SCCM) is a powerful tool for managing software and devices across an organization. But because it touches so many systems, it's also a big security risk if not set up carefully. Attackers who get access to just one user or machine can use SCCM's Client Push feature to run code remotely on other systems. This often works because SCCM uses service accounts (like Distribution Point or Network Access accounts) that have admin rights on many machines. And if your environment still allows NTLM authentication or unsigned SMB traffic, attackers can quietly hijack these connections using tools like ntlmrelayx or PetitPotam—without triggering alerts.\nMany IT teams miss the fact that SCCM setups often rely on shared local admin accounts, allow automatic client installs, and still support outdated security protocols. These common missteps make it easy for attackers to move through your network without being seen. What's worse, the SCCM database and SMS Provider server, which are central to pushing software and storing credentials, are rarely locked down properly—leaving attackers a clear path to take control.\nTo protect your network, start by turning off NTLM fallback and turning on SMB signing through Group Policy. Then check which accounts SCCM uses to install clients—remove admin rights where not needed, and rotate those credentials regularly. Make sure the SCCM database uses dedicated service accounts, limits who can connect to it, and monitors logs like ClientPushInstallation.log for anything suspicious. Use tools like LAPS or gMSA to manage local passwords safely, and place SCCM servers in their own network group behind a firewall.\nFinally, be careful where you run the SCCM admin console. Avoid using it on everyday laptops or general-use machines. Instead, use a secure, locked-down system just for admin work, and add protections like Credential Guard or use the RunAs /netonly command to keep admin credentials safe. When SCCM is secured properly, it blocks one of the easiest paths attackers use to spread through your network. But if it's left wide open, it can give them quiet access to almost everything.\nConclusion\nIf the signals feel louder lately, it's because they are. Attackers are refining their moves, not reinventing them—and they're counting on defenders being too busy to notice. Don't give them that edge. Sharpen your controls, simplify where you can, and keep moving faster than the threat.\nSecurity isn't just a solo effort—it's a shared responsibility. If this recap helped you spot something worth a second look, chances are someone else in your network needs to see it too. Share it with your team, peers, or anyone responsible for keeping systems safe. A single overlooked detail in one environment can become the blueprint for risk in another.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "APT28 hackers use Signal chats to launch new malware attacks on Ukraine",
        "Link": "https://www.bleepingcomputer.com/news/security/apt28-hackers-use-signal-chats-to-launch-new-malware-attacks-on-ukraine/",
        "Summary": "The Russian state-sponsored threat group APT28 is using Signal chats to target government targets in Ukraine with two previously undocumented malware families named BeardShell and SlimAgent. [...]",
        "Date": "2025-06-23",
        "Content": "The Russian state-sponsored threat group APT28 is using Signal chats to target government targets in Ukraine with two previously undocumented malware families named BeardShell and SlimAgent.\nTo be clear, this is not a security issue in Signal. Instead, threat actors are more commonly utilizing the messaging platform as part of their phishing attacks due to its increased usage by governments worldwide.\nThe attacks were first discovered by Ukraine's Computer and Emergency Response (\nCERT-UA\n) in March 2024, though limited details about the infection vector were uncovered at the time.\nOver a year later, in May 2025, ESET notified CERT-UA of unauthorized access to a gov.ua email account, prompting a new incident response.\nDuring this new investigation, CERT-UA discovered that messages sent via the encrypted messenger app Signal were used to deliver a malicious document to targets (Акт.doc), which uses macros to load a memory-resident backdoor called Covenant.\nAPT28 attack via Signal\nSource: CERT-UA\nCovenant acts as a malware loader, downloading a DLL (PlaySndSrv.dll) and a shellcode-ridden WAV file (sample-03.wav) that loads BeardShell, a previously undocumented C++ malware.\nFor both the loader and the primary malware payload, persistence is secured via COM-hijacking in the Windows registry.\nEstablishing persistence for BeardShell\nSource: CERT-UA\nBeardShell's main functionality is to download PowerShell scripts, decrypt them using 'chacha20-poly1305', and execute them. The execution results are exfiltrated to the command-and-control (C2) server, the communication with which is facilitated by Icedrive API.\nIn the 2024 attacks, CERT-UA also spotted a screenshot grabber named SlimAgent, which captures screenshots using an array of Windows API functions (EnumDisplayMonitors, CreateCompatibleDC,  CreateCompatibleBitmap, BitBlt, GdipSaveImageToStream).\nThose images are encrypted using AES and RSA, and stored locally, presumably to be exfiltrated by a separate payload/tool to APT28's C2 server.\nCERT-UA attributes this activity to APT28, which they track as UAC-0001, and recommends that potential targets monitor network interactions with app.koofr.net and api.icedrive.net.\nAPT28 has a long history of\ntargeting Ukraine\nas well as other key organizations in the U.S. and\nEurope\n, primarily for cyberespionage.\nThey are one of Russia's most advanced threat groups, exposed by Volexity in November 2024 for using a novel\n\"nearest neighbor\" technique\n, which remotely breached targets by exploiting nearby Wi-Fi networks.\nIn 2025, Signal unexpectedly became central to cyberattacks linked to Russia and Ukraine.\nThe popular communications platform has been abused in\nspear-phishing attacks\nthat abused the platform's device-linking feature to hijack accounts and in\nDark Crystal RAT distribution\nagainst key targets in Ukraine.\nAt some point, representatives of Ukraine's government\nexpressed disappointment\nthat Signal allegedly stopped collaborating with them in their effort to block Russian attacks. Ukrainian officials later voiced frustration over Signal's lack of cooperation in blocking Russian operations.\nHowever, Signal president Meredith Whittaker\nmet that claim with surprise\n, saying the platform has never shared communication data with Ukraine or any other government.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nRussian hackers breach orgs to track aid routes to Ukraine\nNew PathWiper data wiper malware hits critical infrastructure in Ukraine\nUkraine claims it hacked Tupolev, Russia’s strategic warplane maker\nRussian Laundry Bear cyberspies linked to Dutch Police hack\nGovernment webmail hacked via XSS bugs in global spy campaign"
    },
    {
        "Title": "Malware on Google Play, Apple App Store stole your photos—and crypto",
        "Link": "https://www.bleepingcomputer.com/news/security/malware-on-google-play-app-store-stole-your-photos-and-crypto/",
        "Summary": "A new mobile crypto-stealing malware called SparkKitty was found in apps on Google Play and the Apple App Store, targeting Android and iOS devices. [...]",
        "Date": "2025-06-23",
        "Content": "A new mobile crypto-stealing malware called SparkKitty was found in apps on Google Play and the Apple App Store, targeting Android and iOS devices.\nThe malware is a possible evolution of\nSparkCat\n, which Kaspersky discovered in January. SparkCat used optical character recognition (OCR) to steal cryptocurrency wallet recovery phrases from images saved on infected devices.\nWhen installing crypto wallets, the installation process tells users to write down the wallet's recovery phrase and store it in a secure, offline location.\nAccess to this seed phrase can be used to restore a crypto wallet and its stored assets on another device, making them a valuable target for threat actors.\nWhile taking a screenshot of your seed phrase is never a good idea, some people do so for convenience.\nA\nreport by Kaspersky\nsays that the new SparkKitty malware indiscriminately steals all images from an infected device's photo gallery.\nWhile Kaspersky believes that the malware is targeting crypto wallet seed phrases, the stolen data could also be used for other malicious purposes, like extortion, if the images contain sensitive content.\nThe SparkKitty malware\nThe SparkKitty campaign has been active since at least February 2024, spreading through both official Google and Apple app stores and unofficial platforms.\nSparkKitty on Apple App Store\nSource: Kaspersky\nThe malicious apps Kaspersky identified are 币coin on the Apple App Store and SOEX on Google Play, both having been removed by the time of this writing.\nSOEX is a messaging app with cryptocurrency exchange features, downloaded over 10,000 times via Android's official app store.\nThe malware app on Google Play\nSource: Kaspersky\nKaspersky also discovered modded TikTok clones embedding fake online cryptocurrency stores, gambling apps, adult-themed games, and casino apps containing SparkKitty, distributed via unofficial channels.\nTikTok clone app installed via an iOS profile\nSource: Kaspersky\nOn iOS, SparkKitty is embedded as fake frameworks (AFNetworking.framework, libswiftDarwin.dylib) and sometimes delivered via enterprise provisioning profiles.\nOn Android, the malware is embedded in Java/Kotlin apps, some of which use malicious Xposed/LSPosed modules.\nThe malicious framework uses the Objective-C '+load' method to automatically execute its code when the app starts on iOS. A configuration check is performed by reading keys from the app's Info.plist; execution proceeds only if values match expected strings.\nOn Android, the malware is triggered on app launch or at specific user-driven actions like opening a specified screen type. Upon activation, it retrieves and decrypts a remote configuration file using AES-256 (ECB mode) to get C2 URLs.\nOn iOS, the malware requests access to the photo gallery, while on Android, the malicious app requests the user to grant storage permissions to access images.\nIf permission is granted on iOS, the malware monitors the gallery for changes and exfiltrates any new or previously unuploaded images.\nImage exfiltration code on the iOS variant\nSource: Kaspersky\nOn Android, the malware uploads images from the gallery, along with device identifiers and metadata. Kaspersky found some SparkKitty versions that use Google ML Kit OCR to detect and only upload images containing text.\nImage exfiltration logic on Android\nSource: Kaspersky\nSparkKitty is another example of malware slipping into official app stores, highlighting once more that users shouldn't blindly trust software on vetted distribution channels.\nAll apps should be scrutinized for signs of fraud, such as fake reviews, publishers with doubtful backgrounds or histories, low downloads combined with a high number of positive reviews, etc.\nDuring installation, requests for storage of gallery access should be treated with suspicion and denied if they're not related to the app's core functionality.\nOn iOS, avoid installing configuration profiles or certificates unless they come from a trusted source. On Android, enable Google Play Protect in settings and perform regular full-device scans.\nUltimately, cryptocurrency holders should not keep images of their wallet seed phrases on their mobile devices, as these are now actively targeted by malware. Instead, store them offline in a secure location.\nBleepingComputer has contacted both Apple and Google to ask for a comment on how these apps slipped through the cracks and into their app stores.\n\"The reported app has been removed from Google Play and the developer has been banned,\" Google told BleepingComputer.\n\"Android users are automatically protected against this app regardless of download source by Google Play Protect, which is on by default on Android devices with Google Play Services.\"\nBleepingComputer also contacted Apple about the apps and will update the story if we receive a response.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nAndroid malware Crocodilus adds fake contacts to spoof trusted callers\nMicrosoft investigates OneDrive bug that breaks file search\nGodfather Android malware now uses virtualization to hijack banking apps\nNorth Korean hackers deepfake execs in Zoom call to spread Mac malware\nFBI: BADBOX 2.0 Android malware infects millions of consumer devices"
    },
    {
        "Title": "US Homeland Security warns of escalating Iranian cyberattack risks",
        "Link": "https://www.bleepingcomputer.com/news/security/us-homeland-security-warns-of-escalating-iranian-cyberattack-risks/",
        "Summary": "The U.S. Department of Homeland Security (DHS) warned over the weekend of escalating cyberattack risks by Iran-backed hacking groups and pro-Iranian hacktivists. [...]",
        "Date": "2025-06-23",
        "Content": "The U.S. Department of Homeland Security (DHS) warned over the weekend of escalating cyberattack risks by Iran-backed hacking groups and pro-Iranian hacktivists.\nThis warning was issued as a National Terrorism Advisory System bulletin on Sunday and cautions that the Iranian conflict is causing a \"heightened threat environment\" in the United States, with \"low-level\" cyberattacks targeting networks in the U.S. likely.\n\"The likelihood of violent extremists in the Homeland independently mobilizing to violence in response to the conflict would likely increase if Iranian leadership issued a religious ruling calling for retaliatory violence against targets in the Homeland,\" the advisory\nreads\n.\n\"Multiple recent Homeland terrorist attacks have been motivated by anti-Semitic or anti-Israel sentiment, and the ongoing Israel-Iran conflict could contribute to US-based individuals plotting additional attacks.\"\nIn its Sunday bulletin, the DHS also cautioned about previous cyberattacks coordinated by both hacktivists and Iranian government-affiliated hackers that have previously targeted poorly secured U.S. networks.\nIn October, authorities in the U.S., Canada, and Australia\nalso cautioned\nthat Iranian hackers are acting as initial access brokers and breaching organizations in the healthcare, government, information technology, engineering, and energy sectors in brute-force, password spraying, and multifactor authentication (MFA) fatigue (or push bombing) attacks.\nIn a separate\nAugust advisory\n, CISA, the FBI, and the Defense Department's Cyber Crime Center (DC3) also warned of an Iranian-based threat group tracked as Br0k3r (or Pioneer Kitten, Fox Kitten, UNC757, Parisite, RUBIDIUM, and Lemon Sandstorm).\nBr0k3r is believed to be state-sponsored and involved in selling initial access to breached networks to ransomware affiliates for a share of the profits obtained from ransomware payments.\nWhile the DHS didn't mention it in the NTAS bulletin, the warning was likely promoted by the\nUnited States attacks\non the Fordow, Natanz, and Isfahan key Iranian nuclear facilities on Saturday, just over a week after Israel also\nhit\nmultiple Iranian nuclear and military targets on June 13.\nIran's Foreign Minister Abbas Araghchi\nresponded\nto the attack, warning of \"everlasting consequences\" and saying, \"Iran reserves all options to defend its sovereignty, interest, and people.\"\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nHackers switch to targeting U.S. insurance companies\nGrocery wholesale giant United Natural Foods hit by cyberattack\nHackers behind UK retail attacks now targeting US companies\nUK NCSC: Cyberattacks impacting UK retailers are a wake-up call\nSteel giant Nucor confirms hackers stole data in recent breach"
    },
    {
        "Title": "Canada says Salt Typhoon hacked telecom firm via Cisco flaw",
        "Link": "https://www.bleepingcomputer.com/news/security/canada-says-salt-typhoon-hacked-telecom-firm-via-cisco-flaw/",
        "Summary": "The Canadian Centre for Cyber Security and the FBI confirm that the Chinese state-sponsored 'Salt Typhoon' hacking group is also targeting Canadian telecommunication firms, breaching a telecom provider in February. [...]",
        "Date": "2025-06-23",
        "Content": "The Canadian Centre for Cyber Security and the FBI confirm that the Chinese state-sponsored 'Salt Typhoon' hacking group is also targeting Canadian telecommunication firms, breaching a telecom provider in February.\nDuring the February 2025 incident, Salt Typhoon exploited the\nCVE-2023-20198\nflaw, a critical Cisco IOS XE vulnerability allowing remote, unauthenticated attackers to create arbitrary accounts and gain admin-level privileges.\nThe flaw was first disclosed in October 2023, when it was reported that threat actors had exploited it as a zero-day to hack\nover 10,000 devices\n.\nDespite a significant period having passed, at least one major telecommunications provider in Canada still hadn't patched, giving Salt Typhoon an easy way to compromise devices.\n\"Three network devices registered to a Canadian telecommunications company were compromised by likely Salt Typhoon actors in mid-February 2025,\"\nreads the bulletin\n.\n\"The actors exploited CVE-2023-20198 to retrieve the running configuration files from all three devices and modified at least one of the files to configure a GRE tunnel, enabling traffic collection from the network.\"\nIn October 2024, following\nSalt Typhoon breaches\non multiple American broadband providers, the Canadian authorities\nflagged reconnaissance activity\nthat targeted dozens of key organizations in the country.\nNo actual breaches were confirmed at the time, and despite the calls to elevate security, some critical service providers didn't take the required action.\nThe Cyber Centre notes that, based on separate investigations and crowd-sourced intelligence, activity likely tied to Salt Typhoon extends beyond the telecommunications sector, targeting multiple other industries.\nIn many cases, the activity is limited to reconnaissance, though the data stolen from internal networks can be used for lateral movement or supply chain attacks.\nThe Cyber Centre warned that the attacks against Canadian organizations \"will almost certainly continue\" over the next two years, urging critical organizations to protect their networks.\nTelecommunication service providers who handle valuable data, such as call metadata, subscriber location data, SMS contents, and government/political communications, are prime targets for state-sponsored espionage groups.\nTheir attacks typically target edge devices at the network perimeter, routers, firewalls, and VPN appliances, while MSPs and cloud vendors are also targeted for indirect attacks on their customers.\nThe Cyber Centre's bulletin lists resources providing edge device hardening instructions for critical infrastructure operators.\nSalt Typhoon attacks have impacted multiple telecom companies in\ndozens of countries\n, including AT&T, Verizon, Lumen, Charter Communications, Consolidated Communications, and Windstream.\nLast week, Viasat also confirmed that Salt Typhoon had breached them, but customer data was not impacted.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nTelecom giant Viasat breached by China's Salt Typhoon hackers\nWashington Post's email system hacked, journalists' accounts compromised\nGovernment webmail hacked via XSS bugs in global spy campaign\nNorth Korea ramps up cyberspying in Ukraine to assess war risk\nFBI seeks help to unmask Salt Typhoon hackers behind telecom breaches"
    },
    {
        "Title": "Revil ransomware members released after time served on carding charges",
        "Link": "https://www.bleepingcomputer.com/news/security/revil-hackers-released-after-time-served-on-carding-charges/",
        "Summary": "Four REvil ransomware members arrested in January 2022 were released by Russia on time served after they pleaded guilty to carding and malware distribution charges. [...]",
        "Date": "2025-06-23",
        "Content": "Four REvil ransomware members arrested in January 2022 were released by Russia on time served after they pleaded guilty to carding and malware distribution charges.\nAs they confirmed, Andrey Bessonov, Mikhail Golovachuk, Roman Muromsky, and Dmitry Korotayev were involved in the Revil gang's carding activities between October 2015 and January 2022, according to the Russian state-owned news agency\nTASS\n.\nAll four were found guilty by the court and sentenced to five years in prison, but were released from custody because the court considered they had served their sentence in a Russian detention center (SIZO) during the investigation and trial.\nThe defendants were part of a group of eight members of the REvil ransomware operation apprehended by Russian authorities more than three years ago.\nArtem Zayets, Alexey Malozemov, Daniil Puzyrevsky, and Ruslan Khansvyarov, the other REvil members arrested in January 2022, were\nsentenced to over 4 years in prison\nas part of a different proceeding after they refused to plead guilty to the charges.\nAccording to Russian news outlet\nKommersant\n, Zayets was sentenced today to 4.5 years, Malozemov to 5 years, Khansvyarov to 5.5 years, and Puzyrevsky to 6 years.\nThe court found all four of them guilty of illegal circulation of means of payment, while Puzyrevsky and Khansvyarov were also found guilty of distributing malware.\nREvil's downfall\nREvil ransomware, also known as Sodin and Sodinokibi,\nsurfaced in April 2019\nas a\nsuccessor to GandCrab\n, and it became the most prolific ransomware group, demanding high ransom payments and earning\nover $100 million\nwithin a year.\nHowever, in July 2021, things changed when REvil attacked over 1,500 businesses globally in a\nKaseya supply chain attack\n, prompting President Biden to call on President Putin to address cybercriminals in Russia,\nwarning\nthat the U.S. will take action if the Russian government refuses to do so.\nSubsequently, the U.S.\narrested a REvil ransomware affiliate\n(Ukrainian national Yaroslav Vasinskyi) responsible for the Kaseya attack in November 2021 and\nseized over $6 million\nfrom another Revil partner (Russian national Yevgeniy Polyanin), suspected of deploying the malware in at least 3,000 ransomware attacks. Vasinskyi was\nsentenced to 13 years in prison\nin May 2024 and was ordered to pay $16 million in restitution for his involvement in REvil ransomware attacks.\nThe same month, Romanian authorities\narrested two other REvil ransomware affiliates\nlinked to thousands of other REvil attacks.\nAfter the Kaseya attack, and likely prompted by the law enforcement pressure, the REvil gang\ntook a break\nbut\nresumed operations\ntwo months later. However, they unknowingly also restored machines controlled by law enforcement after the authorities breached their servers right before REvil decided to pause their operations.\nThis led to another wave of arrests, with the Russian Federal Security Service (FSB)\napprehending 14 suspects\nlinked to the REvil ransomware-as-a-service (RaaS) operation in January 2022 and saying it identified all members of the REvil gang and documented their illegal activities.\n\"As a result of the joint actions of the FSB and the Ministry of Internal Affairs of Russia, the organized criminal community ceased to exist, the information infrastructure used for criminal purposes was neutralized,\" the FSB said.\nHowever, after it invaded Ukraine,\nRussia said\nin April 2022 that the U.S. had unilaterally shut down communication channels with Russia on cybersecurity and withdrawn the negotiation process regarding the REvil gang.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nMcLaren Health Care says data breach impacts 743,000 patients\nRussian hackers bypass Gmail MFA using stolen app passwords\nAflac discloses breach amidst Scattered Spider insurance attacks\nKrispy Kreme says November data breach impacts over 160,000 people\nRyuk ransomware’s initial access expert extradited to the U.S."
    },
    {
        "Title": "McLaren Health Care says data breach impacts 743,000 patients",
        "Link": "https://www.bleepingcomputer.com/news/security/mclaren-health-care-says-data-breach-impacts-743-000-patients/",
        "Summary": "McLaren Health Care is warning 743,000 patients that the health system suffered a data breach caused by a July 2024 attack by the INC ransomware gang. [...]",
        "Date": "2025-06-23",
        "Content": "McLaren Health Care is warning 743,000 patients that the health system suffered a data breach caused by a July 2024 attack by the INC ransomware gang.\nAlthough the attack was discovered on August 5, 2024, forensic investigations determining who was impacted were only completed on May 5, 2025, with the notice circulation starting last Friday.\nMcLaren is a nonprofit health system in the U.S. with $6.6 billion in annual revenue, operating a network that spans 14 Michigan hospitals (2,624 beds). It employs 490 physicians and 28,000 full-time staff while contracting with another 113,000 providers across Michigan and into Indiana.\nIn early August 2024, the healthcare organization suffered an IT and phone systems outage that prompted investigations. Patient databases were reported impacted, and people were asked to bring information about appointments and medication when visiting McLaren hospitals.\nEven though the organization did not specify who the attackers were, an employee at one of McLaren's hospitals in Bay City, Michigan,\nposted INC ransom notes online\nthat were automatically printed on the hospital's printers.\nAlleged McLaren ransom note\nSource:\nThomas Barz\nIn the notice sent to impacted individuals, McLaren Health Care admits that the incident concerned a ransomware attack, though INC is still not mentioned.\n\"Our organization was the target of a cybersecurity attack by an international ransomware group that impacted the McLaren Health Care and Karmanos Cancer Institute computer network,\"\nreads the notice\n.\nThe investigation determined that the attackers maintained access to McLaren's and Karmanos' systems between July 17, 2024, and August 3, 2024.\nThe McLaren data breach notification sample\nsubmitted to U.S. authorities\nconfirms that full names were exposed, redacting other data types that were exposed. Therefore, the full extent of the data breach remains unclear.\nThis is the second major breach McLaren Health Care has suffered in recent years, with the previous one occurring in July 2023, attributed to the ALPHV/BlackCat ransomware group.\nIn that older case, the cybercriminals stole sensitive medical data, personally identifiable information, and SSNs of\n2.2 million people\n.\nSamples of that data were leaked online in October 2023 as part of the extortion process, pressing McLaren to pay an undisclosed ransom amount.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nSensata Technologies says personal data stolen by ransomware gang\nKrispy Kreme says November data breach impacts over 160,000 people\nMedia giant Lee Enterprises says data breach affects 39,000 people\nM&S says customer data stolen in cyberattack, forces password resets\nBaltimore City Public Schools data breach affects over 31,000 people"
    },
    {
        "Title": "Steel giant Nucor confirms hackers stole data in recent breach",
        "Link": "https://www.bleepingcomputer.com/news/security/steel-giant-nucor-confirms-hackers-stole-data-in-recent-breach/",
        "Summary": "Nucor, North America's largest steel producer and recycler, has confirmed that attackers behind a recent cybersecurity incident have also stolen data from the company's network. [...]",
        "Date": "2025-06-23",
        "Content": "Nucor, North America's largest steel producer and recycler, has confirmed that attackers behind a recent cybersecurity incident have also stolen data from the company's network.\nThe steel giant employs more than 32,000 people in numerous mills across the U.S., Mexico, and Canada and\nreported\na revenue of $30.73 billion last year.\nNucor disclosed this incident last month, revealing that it took down some systems to contain the security breach and halted production at some of its facilities. It also said it had notified law enforcement authorities and hired external cybersecurity experts to assist with the recovery efforts and investigation.\nWhile it didn't provide additional information regarding the incident, in a new\nfiling\nwith the U.S. Securities and Exchange Commission (SEC), Nucor confirmed that the attackers also stole data from compromised systems.\n\"The cybersecurity incident resulted in a temporary limitation of access to portions of the Company's information technology applications supporting some aspects of the Company's operations at some of the Company's facilities, and as noted in the Original Form 8-K, in an abundance of caution, the Company temporarily and proactively halted certain production operations at various locations,\" Nucor said.\n\"The Company's investigation also determined that the threat actor exfiltrated limited data from the Company's information technology systems. The Company is reviewing and evaluating the impacted data and will carry out any appropriate notifications to potentially affected parties and to regulatory agencies as required by applicable law.\"\nNucor says it has also restored access to systems impacted by the recent breach and affected production operations, adding that it believes the threat actors have been evicted and no longer have access to its network.\nThe company has yet to share further details regarding the date the breach was discovered or the type of attack, so it's unknown if the attackers also encrypted systems compromised during the incident.\nCurrently, no ransomware operations have claimed responsibility for the Nucor attack. Still, most of them also steal sensitive data before deploying ransomware on victims' networks as part of double-extortion schemes.\nBleepingComputer contacted the company for more information about the breach, but Nucor has not replied.\nWhy IT teams are ditching manual patch management\nPatching used to mean complex scripts, long hours, and endless fire drills. Not anymore.\nIn this new guide, Tines breaks down how modern IT orgs are leveling up with automation. Patch faster, reduce overhead, and focus on strategic work -- no complex scripts required.\nGet the free guide\nRelated Articles:\nSteel giant Nucor Corporation facing disruptions after cyberattack\nVictoria’s Secret restores critical systems after cyberattack\nGrocery wholesale giant United Natural Foods hit by cyberattack\nTax resolution firm Optima Tax Relief hit by ransomware, data leaked\nKettering Health confirms Interlock ransomware behind cyberattack"
    },
    {
        "Title": "SparkKitty Swipes Pics From iOS, Android Devices",
        "Link": "https://www.darkreading.com/mobile-security/sparkkitty-swipes-pics-ios-android-devices",
        "Summary": "Like its predecessor, SparkCat, the new malware appears to be going after sensitive data — such as seed phrases for cryptocurrency wallets — in device photo galleries.",
        "Date": "2025-06-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/mobile-security/sparkkitty-swipes-pics-ios-android-devices"
    },
    {
        "Title": "'Echo Chamber' Attack Blows Past AI Guardrails",
        "Link": "https://www.darkreading.com/cloud-security/echo-chamber-attack-ai-guardrails",
        "Summary": "An AI security researcher has developed a proof of concept that uses subtle, seemingly benign prompts to get GPT and Gemini to generate inappropriate content.",
        "Date": "2025-06-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/echo-chamber-attack-ai-guardrails"
    },
    {
        "Title": "Citrix Patches Critical Vulns in NetScaler ADC and Gateway",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/citrix-patches-vulns-netscaler-adc-gateway",
        "Summary": "Citrix is recommending its customers upgrade their appliances to mitigate potential exploitation of the vulnerabilities.",
        "Date": "2025-06-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/citrix-patches-vulns-netscaler-adc-gateway"
    },
    {
        "Title": "DHS Warns of Rise in Cyberattacks in Light of US-Iran Conflict",
        "Link": "https://www.darkreading.com/threat-intelligence/dhs-cyberattacks-iran-conflict",
        "Summary": "After President's Trump decision to enter the US into the conflict in the Middle East, the Department of Homeland Security expects there to be an uptick in Iranian hacktivists and state-sponsored actors targeting US systems.",
        "Date": "2025-06-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/dhs-cyberattacks-iran-conflict"
    },
    {
        "Title": "Attackers Use Docker APIs, Tor Anonymity in Stealthy Crypto Heist",
        "Link": "https://www.darkreading.com/cloud-security/attackers-docker-apis-tor-anonymity-crypto-heist",
        "Summary": "The attack is similar to previous campaigns by an actor called Commando Cat to use misconfigured APIs to compromise containers and deploy cryptocurrency miners.",
        "Date": "2025-06-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/attackers-docker-apis-tor-anonymity-crypto-heist"
    },
    {
        "Title": "A CISO's AI Playbook",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/ciso-ai-playbook",
        "Summary": "In a market where security budgets flatten while threats accelerate, improving analyst throughput is fiscal stewardship.",
        "Date": "2025-06-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/ciso-ai-playbook"
    },
    {
        "Title": "North Korean Hackers Take Over Victims’ Systems Using Zoom Meeting",
        "Link": "https://www.securityweek.com/north-korean-hackers-take-over-victims-systems-using-zoom-meeting/",
        "Summary": "<p>North Korean hackers employ social engineering to trick Zoom Meeting participants into executing system-takeover commands.</p>\n<p>The post <a href=\"https://www.securityweek.com/north-korean-hackers-take-over-victims-systems-using-zoom-meeting/\">North Korean Hackers Take Over Victims’ Systems Using Zoom Meeting</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/north-korean-hackers-take-over-victims-systems-using-zoom-meeting/"
    },
    {
        "Title": "China’s Salt Typhoon Hackers Target Canadian Telecom Firms",
        "Link": "https://www.securityweek.com/chinas-salt-typhoon-hackers-target-canadian-telecom-firms/",
        "Summary": "<p>Canada’s Centre for Cyber Security and the FBI warn of Chinese hackers targeting telecommunications and other companies in Canada.</p>\n<p>The post <a href=\"https://www.securityweek.com/chinas-salt-typhoon-hackers-target-canadian-telecom-firms/\">China&#8217;s Salt Typhoon Hackers Target Canadian Telecom Firms</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chinas-salt-typhoon-hackers-target-canadian-telecom-firms/"
    },
    {
        "Title": "New AI Jailbreak Bypasses Guardrails With Ease",
        "Link": "https://www.securityweek.com/new-echo-chamber-jailbreak-bypasses-ai-guardrails-with-ease/",
        "Summary": "<p>New \"Echo Chamber\" attack bypasses advanced LLM safeguards by subtly manipulating conversational context, proving highly effective across leading AI models.</p>\n<p>The post <a href=\"https://www.securityweek.com/new-echo-chamber-jailbreak-bypasses-ai-guardrails-with-ease/\">New AI Jailbreak Bypasses Guardrails With Ease</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/new-echo-chamber-jailbreak-bypasses-ai-guardrails-with-ease/"
    },
    {
        "Title": "Critical Authentication Bypass Flaw Patched in Teleport",
        "Link": "https://www.securityweek.com/critical-authentication-bypass-flaw-patched-in-teleport/",
        "Summary": "<p>A critical-severity vulnerability in Teleport could allow remote attackers to bypass SSH authentication and access managed systems.</p>\n<p>The post <a href=\"https://www.securityweek.com/critical-authentication-bypass-flaw-patched-in-teleport/\">Critical Authentication Bypass Flaw Patched in Teleport</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/critical-authentication-bypass-flaw-patched-in-teleport/"
    },
    {
        "Title": "743,000 Impacted by McLaren Health Care Data Breach",
        "Link": "https://www.securityweek.com/743000-impacted-by-mclaren-health-care-data-breach/",
        "Summary": "<p>The personal information of 743,000 individuals was compromised in a 2024 ransomware attack on McLaren Health Care.</p>\n<p>The post <a href=\"https://www.securityweek.com/743000-impacted-by-mclaren-health-care-data-breach/\">743,000 Impacted by McLaren Health Care Data Breach</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/743000-impacted-by-mclaren-health-care-data-breach/"
    },
    {
        "Title": "US Braces for Cyberattacks After Bombing Iranian Nuclear Sites",
        "Link": "https://www.securityweek.com/us-braces-for-cyberattacks-after-joining-israel-iran-war/",
        "Summary": "<p>Iranian hackers are expected to intensify cyberattacks against the US after the recent air strikes on Iran’s nuclear sites.</p>\n<p>The post <a href=\"https://www.securityweek.com/us-braces-for-cyberattacks-after-joining-israel-iran-war/\">US Braces for Cyberattacks After Bombing Iranian Nuclear Sites</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/us-braces-for-cyberattacks-after-joining-israel-iran-war/"
    },
    {
        "Title": "Steelmaker Nucor Says Hackers Stole Data in Recent Attack",
        "Link": "https://www.securityweek.com/steelmaker-nucor-says-hackers-stole-data-in-recent-attack/",
        "Summary": "<p>Nucor has shared an update on the impact of the recent cyberattack and confirmed that some data has been taken from its IT systems.</p>\n<p>The post <a href=\"https://www.securityweek.com/steelmaker-nucor-says-hackers-stole-data-in-recent-attack/\">Steelmaker Nucor Says Hackers Stole Data in Recent Attack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-06-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/steelmaker-nucor-says-hackers-stole-data-in-recent-attack/"
    },
    {
        "Title": "Angolan Government Documentation Panel Allegedly Breached",
        "Link": "https://dailydarkweb.net/angolan-government-documentation-panel-allegedly-breached/",
        "Summary": "A threat actor has allegedly gained unauthorized access to a documentation panel belonging to the government of Angola and is attempting to sell it. The Angolan government, the central governing authority of the Republic of Angola, is responsible for the administration and security of the nation. A breach of a governmental documentation system represents a [&#8230;]",
        "Date": "2025-06-23",
        "Content": "A threat actor has allegedly gained unauthorized access to a documentation panel belonging to the government of Angola and is attempting to sell it. The Angolan government, the central governing authority of the Republic of Angola, is responsible for the administration and security of the nation. A breach of a governmental documentation system represents a significant threat to national security, potentially exposing sensitive state and citizen information.\nThe seller posted evidence of their access on a dark web forum, offering the data to “serious buyers.” The origin of the breach is a malicious actor who is now looking to profit from the stolen information. The full extent of the data leak is unknown, but the samples provided suggest it contains highly confidential government documents. The leaked files allegedly include internal communications and documents related to the country’s national identification card system.\nThe allegedly leaked data titles include:\nTraining on the campaign for the universalization of the National Identity Card.\nRequest for clarification from named individuals.\nTags:\nallegedly\nAngola\nCyberSecurity\ndata-breach\ngovernment\nnational security"
    },
    {
        "Title": "Spanish Retailer Electropolis Allegedly Breached Over 100k Customers Affected",
        "Link": "https://dailydarkweb.net/spanish-retailer-electropolis-allegedly-breached-over-100k-customers-affected/",
        "Summary": "Spanish online electronics retailer, Electropolis.es, has allegedly suffered a significant data breach, with a threat actor claiming to have stolen a full database containing the information of over 100,000 customers. Electropolis is an e-commerce company based in Albacete, Spain, that has been operating since 2009, selling a wide range of electronics, gadgets, and other goods [&#8230;]",
        "Date": "2025-06-23",
        "Content": "Spanish online electronics retailer, Electropolis.es, has allegedly suffered a significant data breach, with a threat actor claiming to have stolen a full database containing the information of over 100,000 customers. Electropolis is an e-commerce company based in Albacete, Spain, that has been operating since 2009, selling a wide range of electronics, gadgets, and other goods to customers in Spain, Portugal, France, Italy, the USA, and other countries. The alleged breach was announced on a hacking forum, where the perpetrator is offering the data for sale.\nThe threat actor claims to have obtained complete database access, CRM access with SMTP, and invoicing capabilities. Screenshots shared as proof of the breach appear to show backend access to the company’s sales and invoicing systems, as well as a list of database files. The compromised information allegedly includes a wide range of sensitive customer and corporate data. If the claims are authentic, this incident could expose customers to a high risk of phishing attacks, fraud, and identity theft.\nBased on the evidence provided, the allegedly leaked data includes:\nCustomer accounts and contact information\nPostal codes and physical addresses\nSales, invoicing, and accounting diaries\nBank account details\nInternal file system records and cron job schedules\nCustomer relationship management (CRM) data\nTags:\nCyberSecurity\ndata-breach\ndata-leak\ne-commerce\nElectropolis\nSpain"
    },
    {
        "Title": "Alleged Sale of Vivaia Customer Data from January 2025 Breach Impacts 12 Million",
        "Link": "https://dailydarkweb.net/alleged-sale-of-vivaia-customer-data-from-january-2025-breach-impacts-12-million/",
        "Summary": "A threat actor has allegedly leaked the data of over 12 million customers from the global sustainable fashion brand, Vivaia. The data appeared for sale on a dark web forum, with the seller claiming to have breached the company in early January 2025. Vivaia is a popular direct-to-consumer brand known for its stylish and eco-friendly [&#8230;]",
        "Date": "2025-06-23",
        "Content": "A threat actor has allegedly leaked the data of over 12 million customers from the global sustainable fashion brand, Vivaia. The data appeared for sale on a dark web forum, with the seller claiming to have breached the company in early January 2025. Vivaia is a popular direct-to-consumer brand known for its stylish and eco-friendly footwear made from recycled materials, boasting a significant global customer base across more than 60 countries.\nThe individual who posted the data claims it was obtained on January 8, 2025. The compromised information allegedly contains sensitive customer details that could be exploited for phishing campaigns, identity theft, and other malicious activities. The seller has made the data available for purchase and has even offered to disclose the exploitation method to Vivaia’s administrators to help them secure their systems.\nAccording to the forum post, the leaked database includes a range of personally identifiable information. The specific data points allegedly exposed are:\nCustomer ID\nFull Name\nEmail Address\nPhone Number\nAccount Creation Time\nTags:\ncustomer-data\nCyberSecurity\ndata-breach\ne-commerce\nVivaia"
    },
    {
        "Title": "French Insurance Broker AMI 3F Allegedly Breached 20K Customer Records Leaked",
        "Link": "https://dailydarkweb.net/french-insurance-broker-ami-3f-allegedly-breached-20k-customer-records-leaked/",
        "Summary": "French insurance brokerage group AMI 3F has allegedly become the victim of a significant data breach. A threat actor has posted a database on a dark web forum, claiming it contains the sensitive information of 20,000 private and professional customers. The perpetrator released the data, which is divided into two files containing customer and contract [&#8230;]",
        "Date": "2025-06-23",
        "Content": "French insurance brokerage group AMI 3F has allegedly become the victim of a significant data breach. A threat actor has posted a database on a dark web forum, claiming it contains the sensitive information of 20,000 private and professional customers. The perpetrator released the data, which is divided into two files containing customer and contract details, for download within the cybercriminal community. Based in Toulouse, AMI 3F is a major wholesale insurance broker founded in 1999, operating a national network of thousands of intermediaries, making this a potentially serious incident for its clientele.\nThe leaked information appears to be extensive and highly sensitive. According to the forum post, the compromised data includes a wide range of personally identifiable information (PII) and contract-specific details. The exposure of such information could place the affected individuals and businesses at high risk of identity theft, phishing attacks, and other fraudulent activities. The breach allegedly compromises not only customer data but also information related to their insurance partners.\nThe data samples provided in the post indicate the severity of the leak. The compromised information allegedly includes:\nFull Names (First Name, Last Name)\nDates of Birth (DOB)\nPhone Numbers\nEmail Addresses\nPhysical Addresses\nUsernames and Passwords\nInsurance Policy Numbers and Status\nContract effective dates and premium amounts\nTags:\nAMI 3F\nCyberSecurity\ndark web\ndata-breach\nFrance\nInsurance\nPII Leak"
    },
    {
        "Title": "US-Based Telcom Insurance Group Allegedly Targeted in Lynx Ransomware Attack",
        "Link": "https://dailydarkweb.net/us-based-telcom-insurance-group-allegedly-targeted-in-lynx-ransomware-attack/",
        "Summary": "Telcom Insurance Group, a key US-based provider of business insurance solutions for the telecommunications sector, has allegedly fallen victim to a ransomware attack by the Lynx group. The company, which specializes in crucial coverage including cybersecurity, worker&#8217;s compensation, and property and casualty insurance for telecommunications companies, particularly in rural areas of the United States, is [&#8230;]",
        "Date": "2025-06-23",
        "Content": "Telcom Insurance Group, a key US-based provider of business insurance solutions for the telecommunications sector, has allegedly fallen victim to a ransomware attack by the Lynx group. The company, which specializes in crucial coverage including cybersecurity, worker’s compensation, and property and casualty insurance for telecommunications companies, particularly in rural areas of the United States, is now facing a significant data breach. The alleged attack is believed to have occurred around June 22, 2025, with the hacking group claiming to have exfiltrated a vast amount of sensitive information. The incident highlights the growing threat of ransomware attacks on critical infrastructure and the specialized service providers that support them.\nThe impact of this alleged breach could be substantial, given Telcom Insurance Group’s role in providing tailored insurance products and risk management services to the American telecommunications industry. The attackers claim to have obtained a “full data leak,” compromising a wide array of sensitive records. The potential exposure of such information raises serious concerns about the privacy of the insured organizations and their clients, as well as the security of their financial and contractual agreements. This event underscores the persistent and evolving nature of cyber threats, demonstrating that even organizations focused on cybersecurity are not immune to sophisticated attacks.\nThe allegedly leaked data is said to include:\nConfidential corporate documents\nBinding contracts and agreements\nSensitive financial data\nPrivate customer information\nTags:\nCyberSecurity\ndata-breach\nInsurance\nLynx ransomware\nTelcom Insurance Group\ntelecommunications\nUnited States"
    }
]