[
    {
        "Title": "Microsoft Uncovers Sandworm Subgroup's Global Cyber Attacks Spanning 15+ Countries",
        "Link": "https://thehackernews.com/2025/02/microsoft-uncovers-sandworm-subgroups.html",
        "Summary": "A subgroup within the infamous Russian state-sponsored hacking group known as Sandworm has been attributed to a multi-year initial access operation dubbed BadPilot that stretched across the globe.\n\"This subgroup has conducted globally diverse compromises of Internet-facing infrastructure to enable Seashell Blizzard to persist on high-value targets and support tailored network operations,\" the",
        "Date": "2025-02-12",
        "Content": "A subgroup within the infamous Russian state-sponsored hacking group known as\nSandworm\nhas been attributed to a multi-year initial access operation dubbed BadPilot that stretched across the globe.\n\"This subgroup has conducted globally diverse compromises of Internet-facing infrastructure to enable Seashell Blizzard to persist on high-value targets and support tailored network operations,\" the Microsoft Threat Intelligence team\nsaid\nin a new report shared with The Hacker News ahead of publication.\nThe geographical spread of the initial access subgroup's targets include the whole of North America, several countries in Europe, as well as others, including Angola, Argentina, Australia, China, Egypt, India, Kazakhstan, Myanmar, Nigeria, Pakistan, Turkey, and Uzbekistan.\nThe development marks a significant expansion of the hacking group's victimology footprint over the past three years, which is otherwise known to be concentrated around Eastern Europe -\n2022: Energy, retail, education, consulting, and agriculture sectors in Ukraine\n2023: Sectors in the United States, Europe, Central Asia, and the Middle East that provided material support to the war in Ukraine or were geopolitically significant\n2024: Entities in the United States, Canada, Australia, and the United Kingdom\nSandworm is tracked by Microsoft under the moniker Seashell Blizzard (formerly Iridium), and by the broader cybersecurity community under the names APT44, Blue Echidna, FROZENBARENTS, Grey Tornado, Iron Viking, Razing Ursa, Telebots, UAC-0002, and Voodoo Bear. Active since at least 2013, the group is assessed to be affiliated with Unit 74455 within the Main Directorate of the General Staff of the Armed Forces of the Russian Federation (GRU).\nThe adversarial collective has been\ndescribed\nby Google-owned Mandiant as a \"highly adaptive\" and \"operationally mature\" threat actor that engages in espionage, attack, and influence operations. It also has a track record of mounting\ndisruptive and destructive attacks\nagainst Ukraine over the past decade.\nCampaigns mounted by Sandworm in the wake of the Russo-Ukrainian war have leveraged data wipers (\nKillDisk\naka HermeticWiper), pseudo-ransomware (\nPrestige\naka PRESSTEA), and backdoors (\nKapeka\n), in addition to off-the-shelf malware families like\nDarkCrystal RAT\n(aka DCRat) that allow the threat actors to maintain\npersistent remote access\nto infected hosts.\nIt has also been observed relying on a variety of Russian companies and criminal marketplaces to source and sustain its offensive capabilities, highlighting a\ngrowing trend\nof cybercrime facilitating state-backed hacking.\n\"The group has used criminally sourced tools and infrastructure as a source of disposable capabilities that can be operationalized on short notice without immediate links to its past operations,\" the Google Threat Intelligence Group (GTIG)\nsaid\nin an analysis.\n\"Since Russia's full-scale invasion of Ukraine, APT44 has increased its use of such tooling, including malware such as DarkCrystal RAT (DCRat),\nWarzone\n, and\nRADTHIEF\n('Rhadamanthys Stealer'), and bulletproof hosting infrastructure such as that provided by the Russian-speaking actor 'yalishanda,' who advertises in cybercriminal underground communities.\"\nMicrosoft said the Sandworm subgroup has been operational since at least late 2021, exploiting various known security flaws to obtain initial access, followed by a series of post-exploitation actions aimed at collecting credentials, achieving command execution, and supporting lateral movement.\n\"Observed operations following initial access indicate that this campaign enabled Seashell Blizzard to obtain access to global targets across sensitive sectors including energy, oil and gas, telecommunications, shipping, arms manufacturing, in addition to international governments,\" the tech giant noted.\n\"This subgroup has been enabled by a horizontally scalable capability bolstered by published exploits that allowed Seashell Blizzard to discover and compromise numerous Internet-facing systems across a wide range of geographical regions and sectors.\"\nSince early last year, the sub-cluster is said to have weaponized vulnerabilities in ConnectWise ScreenConnect (\nCVE-2024-1709\n) and Fortinet FortiClient EMS (\nCVE-2023-48788\n) to infiltrate targets in the United Kingdom and the United States.\nAttacks carried out by the subgroup involve a combination of both opportunistic \"spray and pray\" attacks and targeted intrusions that are designed to maintain indiscriminate access and perform follow-on actions to either expand network access or obtain confidential information.\nIt's believed that the wide array of compromises offer Seashell Blizzard a way to meet Kremlin's ever-evolving strategic objectives, permitting the hacking outfit to horizontally scale their operations across diverse sectors as new exploits are disclosed.\nAs many as eight different known security vulnerabilities have been exploited by the subgroup to date -\nMicrosoft Exchange Server (\nCVE-2021-34473\naka ProxyShell)\nZimbra Collaboration (\nCVE-2022-41352\n)\nOpenfire (\nCVE-2023-32315\n)\nJetBrains TeamCity (\nCVE-2023-42793\n)\nMicrosoft Outlook (\nCVE-2023-23397\n)\nFortinet FortiClient EMS (\nCVE-2023-48788\n)\nConnectwise ScreenConnect (\nCVE-2024-1709\n)\nJBOSS (Unknown CVE)\nA successful foothold is succeeded by the threat actor establishing persistence through three different methods -\nFebruary 24, 2024 – present:\nDeployment of legitimate remote access software such as Atera Agent and Splashtop Remote Services, in some cases abusing the access to drop additional payloads for credential acquisition, data exfiltration, and other tools for maintaining access like OpenSSH and a bespoke utility dubbed ShadowLink that allows the compromised system to be accessible via the TOR anonymity network\nLate 2021 – present:\nDeployment of a web shell named LocalOlive that allows for command-and-control and serves as a conduit for more payloads, such as tunneling utilities (e.g., Chisel, plink, and rsockstun)\nLate 2021 – 2024:\nMalicious modifications to Outlook Web Access (OWA) sign-in pages to inject JavaScript code that can harvest and exfiltrate credentials back to the threat actor in real-time, and DNS A-record configuration changes likely in an effort to intercept credentials from critical authentication services\n\"This subgroup, which is characterized within the broader Seashell Blizzard organization by its near-global reach, represents an expansion in both the geographical targeting conducted by Seashell Blizzard and the scope of its operations,\" Microsoft said.\n\"At the same time, Seashell Blizzard's far-reaching, opportunistic access methods likely offer Russia expansive opportunities for niche operations and activities that will continue to be valuable over the medium term.\"\nThe development comes as Dutch cybersecurity company EclecticIQ linked the Sandworm group to another campaign that leverages pirated Microsoft Key Management Service (\nKMS\n) activators and fake Windows updates to deliver a new version of BACKORDER, a Go-based downloader that's responsible for fetching and executing a second-stage payload from a remote server.\nBACKORDER, per Mandiant, is usually delivered within trojanized installer files and is hard-coded to execute the original setup executable. The end goal of the campaign is to\ndeliver\nDarkCrystal RAT\n.\n\"Ukraine's heavy reliance on cracked software, including in government institutions, creates a major attack surface,\" security researcher Arda Büyükkaya\nsaid\n. \"Many users, including businesses and critical entities, have turned to\npirated software\nfrom untrusted sources, giving adversaries like Sandworm (APT44) a prime opportunity to embed malware in widely used programs.\"\nFurther infrastructure analysis has uncovered a previously undocumented RDP backdoor codenamed Kalambur that's disguised as a Windows update, and which utilizes the TOR network for command-and-control, as well as to deploy OpenSSH and enable remote access via the Remote Desktop Protocol (RDP) on port 3389.\nInterestingly, Kalambur shares some level of functional overlap with ShadowLink. \"When launched, [ShadowLink] installs TOR hidden services on the device, turning it into a TOR network server with a unique .onion domain,\" per Microsoft. \"The threat actor can connect to this domain using a pre-configured port number, which in this case is port 3389, redirecting traffic to the device's Remote Desktop Protocol (RDP) service.\"\n\"By leveraging trojanized software to infiltrate ICS environments, Sandworm (APT44) continues to demonstrate its strategic objective of destabilizing Ukraine's critical infrastructure in support of Russian geopolitical ambitions,\" Büyükkaya said.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Researchers Find New Exploit Bypassing Patched NVIDIA Container Toolkit Vulnerability",
        "Link": "https://thehackernews.com/2025/02/researchers-find-new-exploit-bypassing.html",
        "Summary": "Cybersecurity researchers have discovered a bypass for a now-patched security vulnerability in the NVIDIA Container Toolkit that could be exploited to break out of a container's isolation protections and gain complete access to the underlying host.\nThe new vulnerability is being tracked as CVE-2025-23359 (CVSS score: 8.3). It affects the following versions -\n\nNVIDIA Container Toolkit (All",
        "Date": "2025-02-12",
        "Content": "Cybersecurity researchers have discovered a bypass for a now-patched security vulnerability in the NVIDIA Container Toolkit that could be exploited to break out of a container's isolation protections and gain complete access to the underlying host.\nThe new vulnerability is being tracked as\nCVE-2025-23359\n(CVSS score: 8.3). It affects the following versions -\nNVIDIA Container Toolkit (All versions up to and including 1.17.3) - Fixed in version 1.17.4\nNVIDIA GPU Operator (All versions up to and including 24.9.1) - Fixed in version 24.9.2\n\"NVIDIA Container Toolkit for Linux contains a Time-of-Check Time-of-Use (\nTOCTOU\n) vulnerability when used with default configuration, where a crafted container image could gain access to the host file system,\" the company said in an advisory on Tuesday.\n\"A successful exploit of this vulnerability might lead to code execution, denial of service, escalation of privileges, information disclosure, and data tampering.\"\nCloud security firm Wiz, which\nshared\nadditional technical specifics of the flaw, said it's a bypass for another vulnerability (\nCVE-2024-0132\n, CVSS score: 9.0) that was addressed by NVIDIA in September 2024.\nIn a nutshell, the vulnerability enables bad actors to mount the host's root file system into a container, granting them unfettered access to all files. Furthermore, the access can be leveraged to launch privileged containers and achieve full host compromise via the runtime Unix socket.\nWiz researchers security researchers Shir Tamari, Ronen Shustin, and Andres Riancho said their source code analysis of the container toolkit found that the file paths used during mount operations could be manipulated using a symbolic link such that it makes it possible to mount from outside the container (i.e., the root directory) into a path within \"/usr/lib64.\"\nWhile the access to the host file system afforded by the container escape is read-only, this limitation can be circumvented by interacting with the Unix sockets to spawn new privileged containers and gain unrestricted access to the file system.\n\"This elevated level of access also allowed us to monitor network traffic, debug active processes, and perform a range of other host-level operations,\" the researchers said.\nBesides updating to the latest version, users of the NVIDIA Container Toolkit are recommended to not disable the\n\"--no-cntlibs\" flag\nin production environments.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "How to Steer AI Adoption: A CISO Guide",
        "Link": "https://thehackernews.com/2025/02/how-to-steer-ai-adoption-ciso-guide.html",
        "Summary": "CISOs are finding themselves more involved in AI teams, often leading the cross-functional effort and AI strategy. But there aren’t many resources to guide them on what their role should look like or what they should bring to these meetings.&nbsp;\nWe’ve pulled together a framework for security leaders to help push AI teams and committees further in their AI adoption—providing them with the",
        "Date": "2025-02-12",
        "Content": "CISOs are finding themselves more involved in AI teams, often leading the cross-functional effort and AI strategy. But there aren't many resources to guide them on what their role should look like or what they should bring to these meetings.\nWe've pulled together a framework for security leaders to help push AI teams and committees further in their AI adoption—providing them with the necessary visibility and guardrails to succeed. Meet the CLEAR framework.\nIf security teams want to play a pivotal role in their organization's AI journey, they should adopt the five steps of CLEAR to show immediate value to AI committees and leadership:\nC\n–\nCreate\nan AI asset inventory\nL\n–\nLearn\nwhat users are doing\nE\n–\nEnforce\nyour AI policy\nA\n–\nApply\nAI use cases\nR\n–\nReuse\nexisting frameworks\nIf you're looking for a solution to help take advantage of GenAI securely, check out\nHarmonic Security\n.\nAlright, let's break down the CLEAR framework.\nCreate an AI Asset Inventory\nA foundational requirement across regulatory and best-practice frameworks—including the EU AI Act, ISO 42001, and NIST AI RMF—is maintaining an AI asset inventory.\nDespite its importance, organizations struggle with manual, unsustainable methods of tracking AI tools.\nSecurity teams can take six key approaches to improve AI asset visibility:\nProcurement-Based Tracking\n– Effective for monitoring new AI acquisitions but fails to detect AI features added to existing tools.\nManual Log Gathering\n– Analyzing network traffic and logs can help identify AI-related activity, though it falls short for SaaS-based AI.\nCloud Security and DLP\n– Solutions like CASB and Netskope offer some visibility, but enforcing policies remains a challenge.\nIdentity and OAuth\n– Reviewing access logs from providers like Okta or Entra can help track AI application usage.\nExtending Existing Inventories\n– Classifying AI tools based on risk ensures alignment with enterprise governance, but adoption moves quickly.\nSpecialized Tooling\n– Continuous monitoring tools detect AI usage, including personal and free accounts, ensuring comprehensive oversight. Includes the likes of Harmonic Security.\nLearn: Shift to Proactive Identification of AI Use Cases\nSecurity teams should proactively identify AI applications that employees are using instead of blocking them outright—users will find workarounds otherwise.\nBy tracking why employees turn to AI tools, security leaders can recommend safer, compliant alternatives that align with organizational policies. This insight is invaluable in AI team discussions.\nSecond, once you know how employees are using AI, you can give better training. These training programs are going to become increasingly important amid the rollout of the EU AI Act, which mandates that organizations provide AI literacy programs:\n\"Providers and deployers of AI systems shall take measures to ensure, to their best extent, a sufficient level of AI literacy of their staff and other persons dealing with the operation and use of AI systems…\"\nEnforce an AI Policy\nMost organizations have implemented AI policies, yet enforcement remains a challenge. Many organizations opt to simply issue AI policies and hope employees follow the guidance. While this approach avoids friction, it provides little enforcement or visibility, leaving organizations exposed to potential security and compliance risks.\nTypically, security teams take one of two approaches:\nSecure Browser Controls\n– Some organizations route AI traffic through a secure browser to monitor and manage usage. This approach covers most generative AI traffic but has drawbacks—it often restricts copy-paste functionality, driving users to alternative devices or browsers to bypass controls.\nDLP or CASB Solutions\n– Others leverage existing Data Loss Prevention (DLP) or Cloud Access Security Broker (CASB) investments to enforce AI policies. These solutions can help track and regulate AI tool usage, but traditional regex-based methods often generate excessive noise. Additionally, site categorization databases used for blocking are frequently outdated, leading to inconsistent enforcement.\nStriking the right balance between control and usability is key to successful AI policy enforcement.\nAnd if you need help building a GenAI policy, check out our free generator:\nGenAI Usage Policy Generator\n.\nApply AI Use Cases for Security\nMost of this discussion is about securing AI, but let's not forget that the AI team also wants to hear about cool, impactful AI use cases across the business. What better way to show you care about the AI journey than to actually implement them yourself?\nAI use cases for security are still in their infancy, but security teams are already seeing some benefits for detection and response, DLP, and email security. Documenting these and bringing these use cases to AI team meetings can be powerful – especially referencing KPIs for productivity and efficiency gains.\nReuse Existing Frameworks\nInstead of reinventing governance structures, security teams can integrate AI oversight into existing frameworks like\nNIST AI RMF\nand\nISO 42001\n.\nA practical example is\nNIST CSF 2.0\n, which now includes the \"Govern\" function, covering: Organizational AI risk management strategies Cybersecurity supply chain considerations AI-related roles, responsibilities, and policies Given this expanded scope, NIST CSF 2.0 offers a robust foundation for AI security governance.\nTake a Leading Role in AI Governance for Your Company\nSecurity teams have a unique opportunity to take a leading role in AI governance by remembering CLEAR:\nC\nreating AI asset inventories\nL\nearning user behaviors\nE\nnforcing policies through training\nA\npplying AI use cases for security\nR\neusing existing frameworks\nBy following these steps, CISOs can demonstrate value to AI teams and play a crucial role in their organization's AI strategy.\nTo learn more about overcoming GenAI adoption barriers, check out\nHarmonic Security\n.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "North Korean Hackers Exploit PowerShell Trick to Hijack Devices in New Cyberattack",
        "Link": "https://thehackernews.com/2025/02/north-korean-hackers-exploit-powershell.html",
        "Summary": "The North Korea-linked threat actor known as Kimsuky has been observed using a new tactic that involves deceiving targets into running PowerShell as an administrator and then instructing them to paste and run malicious code provided by them.\n\"To execute this tactic, the threat actor masquerades as a South Korean government official and over time builds rapport with a target before sending a",
        "Date": "2025-02-12",
        "Content": "The North Korea-linked threat actor known as\nKimsuky\nhas been observed using a new tactic that involves deceiving targets into running PowerShell as an administrator and then instructing them to paste and run malicious code provided by them.\n\"To execute this tactic, the threat actor masquerades as a South Korean government official and over time builds rapport with a target before sending a spear-phishing email with an [sic] PDF attachment,\" the Microsoft Threat Intelligence team\nsaid\nin a series of posts shared on X.\nTo read the purported PDF document, victims are persuaded to click a URL containing a list of steps to register their Windows system. The registration link urges them to launch PowerShell as an administrator and copy/paste the displayed code snippet into the terminal, and execute it.\nShould the victim follow through, the malicious code downloads and installs a browser-based remote desktop tool, along with a certificate file with a hardcoded PIN from a remote server.\n\"The code then sends a web request to a remote server to register the victim device using the downloaded certificate and PIN. This allows the threat actor to access the device and carry out data exfiltration,\" Microsoft said.\nThe tech giant said it observed the use of this approach in limited attacks since January 2025, describing it as a departure from the threat actor's usual tradecraft.\nIt's worth noting that the Kimsuky is not the only North Korean hacking crew to adopt the compromise strategy. In December 2024, it was\nrevealed\nthat threat actors linked to the Contagious Interview campaign are tricking users into copying and executing a malicious command on their Apple macOS systems via the Terminal app so as to address a supposed problem with accessing the camera and microphone through the web browser.\nSuch attacks, along with those that have embraced the so-called\nClickFix\nmethod, have taken off in a big way in recent months, in part driven by the fact that they rely on the targets to infect their own machines, thereby bypassing security protections.\nArizona woman pleads guilty to running laptop farm for N. Korean IT workers\nThe development comes as the U.S. Department of Justice (DoJ) said a 48-year-old woman from the state of Arizona pleaded guilty for her role in the fraudulent\nIT worker scheme\nthat allowed North Korean threat actors to obtain remote jobs in more than 300 U.S. companies by posing as U.S. citizens and residents.\nThe activity generated over $17.1 million in illicit revenue for\nChristina Marie Chapman\nand for North Korea in violation of international sanctions between October 2020 and October 2023, the department said.\n\"Chapman, an American citizen, conspired with overseas IT workers from October 2020 to October 2023 to steal the identities of U.S. nationals and used those identities to apply for remote IT jobs and, in furtherance of the scheme, transmitted false documents to the Department of Homeland Security,\" the DoJ\nsaid\n.\n\"Chapman and her coconspirators obtained jobs at hundreds of U.S. companies, including Fortune 500 corporations, often through temporary staffing companies or other contracting organizations.\"\nThe defendant, who was arrested in May 2024, has also been accused of running a laptop farm by hosting multiple laptops at her residence to give the impression that the North Korean workers were working from within the country, when, in reality, they were based in China and Russia and remotely connected to the companies' internal systems.\n\"As a result of the conduct of Chapman and her conspirators, more than 300 U.S. companies were impacted, more than 70 identities of U.S. person were compromised, on more than 100 occasions false information was conveyed to DHS, and more than 70 U.S. individuals had false tax liabilities created in their name,\" the DoJ added.\nThe increased law enforcement scrutiny has led to an escalation of the IT worker scheme, with reports emerging of data exfiltration and extortion.\n\"After being discovered on company networks, North Korean IT workers have extorted victims by holding stolen proprietary data and code hostage until the companies meet ransom demands,\" the U.S. Federal Bureau of Investigation (FBI)\nsaid\nin an advisory last month. \"In some instances, North Korean IT workers have publicly released victim companies' proprietary code.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft’s Patch Tuesday Fixes 63 Flaws, Including Two Under Active Exploitation",
        "Link": "https://thehackernews.com/2025/02/microsofts-patch-tuesday-fixes-63-flaws.html",
        "Summary": "Microsoft on Tuesday released fixes for 63 security flaws impacting its software products, including two vulnerabilities that it said has come under active exploitation in the wild.\nOf the 63 vulnerabilities, three are rated Critical, 57 are rated Important, one is rated Moderate, and two are rated Low in severity. This is aside from the 23 flaws Microsoft addressed in its Chromium-based Edge",
        "Date": "2025-02-12",
        "Content": "Microsoft on Tuesday released fixes for\n63 security flaws\nimpacting its software products, including two vulnerabilities that it said has come under active exploitation in the wild.\nOf the 63 vulnerabilities, three are rated Critical, 57 are rated Important, one is rated Moderate, and two are rated Low in severity. This is aside from the\n23 flaws\nMicrosoft addressed in its Chromium-based Edge browser since the release of last month's\nPatch Tuesday update\n.\nThe update is notable for fixing two actively exploited flaws -\nCVE-2025-21391\n(CVSS score: 7.1) - Windows Storage Elevation of Privilege Vulnerability\nCVE-2025-21418\n(CVSS score: 7.8) - Windows Ancillary Function Driver for WinSock Elevation of Privilege Vulnerability\n\"An attacker would only be able to delete targeted files on a system,\" Microsoft said in an alert for CVE-2025-21391. \"This vulnerability does not allow disclosure of any confidential information, but could allow an attacker to delete data that could include data that results in the service being unavailable.\"\nMike Walters, president and co-founder of Action1,\nnoted\nthat the vulnerability could be chained with other flaws to escalate privileges and perform follow-on actions that can complicate recovery efforts and allow threat actors to cover up their tracks by deleting crucial forensic artifacts.\nCVE-2025-21418, on the other hand, concerns a case of privilege escalation in AFD.sys that could be exploited to achieve SYSTEM privileges.\nIt's worth noting that a similar flaw in the same component (CVE-2024-38193) was\ndisclosed\nby Gen Digital last August as being weaponized by the North Korea-linked Lazarus Group. In February 2024, the tech giant also plugged a Windows kernel privilege escalation flaw (CVE-2024-21338) affecting the AppLocker driver (appid.sys) that was also exploited by the hacking crew.\nThese attack chains stand out because they go beyond a traditional Bring Your Own Vulnerable Driver (BYOVD) attack by taking advantage of a security flaw in a native Windows driver, thereby obviating the need for introducing other drivers into target environments.\nIt's currently not known if the abuse of CVE-2025-21418 is linked to the Lazarus Group as well. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has\nadded\nboth the flaws to its Known Exploited Vulnerabilities (\nKEV\n) catalog, requiring federal agencies to apply the patches by March 4, 2025.\nThe most severe of the flaws addressed by Microsoft in this month's update is\nCVE-2025-21198\n(CVSS score: 9.0), a remote code execution (RCE) vulnerability in the High Performance Compute (HPC) Pack.\n\"An attacker could exploit this vulnerability by sending a specially crafted HTTPS request to the targeted head node or Linux compute node granting them the ability to perform RCE on other clusters or nodes connected to the targeted head node,\" Microsoft said.\nAlso worth mentioning is another RCE vulnerability (\nCVE-2025-21376\n, CVSS score: 8.1) impacting Windows Lightweight Directory Access Protocol (LDAP) that permits an attacker to send a specially crafted request and execute arbitrary code. However, successful exploitation of the flaw requires the threat actor to win a race condition.\n\"Given that LDAP is integral to Active Directory, which underpins authentication and access control in enterprise environments, a compromise could lead to lateral movement, privilege escalation, and widespread network breaches,\" Ben McCarthy, lead cybersecurity engineer at Immersive Labs, said.\nElsewhere, the update also resolves a NTLMv2 hash disclosure vulnerability (\nCVE-2025-21377\n, CVSS score: 6.5) that, if successfully exploited, could permit an attacker to authenticate as the targeted user.\nSoftware Patches from Other Vendors\nIn addition to Microsoft, security updates have also been released by other vendors over the past couple of weeks to rectify several vulnerabilities, including —\nAdobe\nAdvantive VeraCore\nAmazon Web Services\nAMD\nApple\nArm\nASUS\nAutomationDirect\nBosch\nCanon\nCisco\nCODESYS\nD-Link\nDell\nDevolutions Remote Desktop Manager\nDrupal\nF5\nFortinet\nGitLab\nGoogle\nAndroid\nand\nPixel\nGoogle Chrome\nGoogle Cloud\nGoogle Wear OS\nHMS Networks\nHP\nHP Enterprise\n(including Aruba Networking)\nIBM\nIntel\nIvanti\nJenkins\nJuniper Networks\nLenovo\nLinux distributions\nAmazon Linux\n,\nDebian\n,\nOracle Linux\n,\nRed Hat\n,\nRocky Linux\n,\nSUSE\n, and\nUbuntu\nMediaTek\nMitel\nMitsubishi Electric\nMozilla\nFirefox, Firefox ESR, and Thunderbird\nNETGEAR\nNVIDIA\nOpenSSL\nPalo Alto Networks\nProgress Software\nQNAP\nQualcomm\nRockwell Automation\nSalesforce\nSamsung\nSAP\nSchneider Electric\nSiemens\nSolarWinds\nSonicWall\nSynology\nTrimble Cityworks\nVeeam\nVeritas\nZimbra\nZoom\n, and\nZyxel\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Ivanti Patches Critical Flaws in Connect Secure and Policy Secure – Update Now",
        "Link": "https://thehackernews.com/2025/02/ivanti-patches-critical-flaws-in.html",
        "Summary": "Ivanti has released security updates to address multiple security flaws impacting Connect Secure (ICS), Policy Secure (IPS), and Cloud Services Application (CSA) that could be exploited to achieve arbitrary code execution.\nThe list of vulnerabilities is below -\n\nCVE-2024-38657 (CVSS score: 9.1) - External control of a file name in Ivanti Connect Secure before version 22.7R2.4 and Ivanti Policy",
        "Date": "2025-02-12",
        "Content": "Ivanti has\nreleased\nsecurity updates to address multiple security flaws impacting Connect Secure (ICS), Policy Secure (IPS), and Cloud Services Application (CSA) that could be exploited to achieve arbitrary code execution.\nThe list of vulnerabilities is below -\nCVE-2024-38657\n(CVSS score: 9.1) - External control of a file name in Ivanti Connect Secure before version 22.7R2.4 and Ivanti Policy Secure before version 22.7R1.3 allows a remote authenticated attacker with admin privileges to write arbitrary files\nCVE-2025-22467\n(CVSS score: 9.9) - A stack-based buffer overflow in Ivanti Connect Secure before version 22.7R2.6 allows a remote authenticated attacker to achieve remote code execution\nCVE-2024-10644\n(CVSS score: 9.1) - Code injection in Ivanti Connect Secure before version 22.7R2.4 and Ivanti Policy Secure before version 22.7R1.3 allows a remote authenticated attacker with admin privileges to achieve remote code execution\nCVE-2024-47908\n(CVSS score: 9.1) - Operating system command injection in the admin web console of Ivanti CSA before version 5.0.5 allows a remote authenticated attacker with admin privileges to achieve remote code execution\nThe shortcomings have been addressed in the below versions -\nIvanti Connect Secure 22.7R2.6\nIvanti Policy Secure 22.7R1.3\nIvanti CSA 5.0.5\nThe company said it's not aware of any of the flaws being exploited in the wild. However, with Ivanti appliances being\nrepeatedly weaponized\nby malicious actors, it's imperative that users take steps to apply the latest patches.\nJPCERT/CC, in a report published today, revealed that it observed\nCVE-2025-0282\n– a now-patched vulnerability affecting Ivanti Connect Secure – being exploited to deliver an updated version of the SPAWN malware framework called SPAWNCHIMERA.\n\"SPAWNCHIMERA is a malware that combines the updated functions of SPAWNANT, SPAWNMOLE, and SPAWNSNAIL into one,\" security researcher Yuma Masubuchi\nsaid\n, adding the modifications include changes to inter-process communication to use UNIX domain sockets and a function to plug the security defect in an attempt to prevent other actors from exploiting it.\nIvanti also acknowledged that its edge products have been \"targeted and exploited by sophisticated threat actor attacks\" and that it's making efforts to improve its software, implement secure-by-design principles, and raise the bar for potential abuse by adversaries.\n\"While these products are not the ultimate target, they are increasingly the route that well-resourced nation state groups are focusing their effort on to attempt espionage campaigns against extremely high-value organizations,\" Ivanti CSO Daniel Spicer\nsaid\n.\n\"We have enhanced internal scanning, manual exploitation and testing capabilities, increased collaboration and information sharing with the security ecosystem, and further enhanced our responsible disclosure process, including becoming a CVE Numbering Authority.\"\nThe development comes as Bishop Fox\nreleased\nfull technical details of a now-patched security flaw in SonicWall SonicOS (\nCVE-2024-53704\n) that could be exploited to bypass authentication in firewalls and allow attackers to hijack active SSL VPN sessions in order to gain unauthorized access.\nAs of February 7, 2025, nearly 4,500 internet-facing SonicWall SSL VPN servers remain unpatched against CVE-2024-53704.\nIn a similar move, Akamai has\npublished\nits discovery of two vulnerabilities in Fortinet FortiOS (\nCVE-2024-46666\nand\nCVE-2024-46668\n) that an unauthenticated attacker can exploit to achieve denial-of-service (DoS) and remote code execution. The flaws were resolved by Fortinet on January 14, 2025.\nFortinet has since also\nrevised\nits advisory for\nCVE-2024-55591\nto highlight another flaw tracked as\nCVE-2025-24472\n(CVSS score: 8.1) that could result in an authentication bypass in FortiOS and FortiProxy devices via a specially crafted CSF proxy request.\nThe company credited watchTowr Labs researcher Sonny Macdonald for discovering and reporting the flaw. It's worth noting that the vulnerability has already been patched alongside CVE-2024-55591, meaning no customer action is required if fixes for the latter have already been applied.\n\"Both CVEs cover the same vulnerability but on a different endpoint,\" Benjamin Harris, CEO of watchTowr, told The Hacker News. \"There is one management interface, however this management interface has effectively three sub interfaces.\n\"The original CVE-2024-55591 vulnerability was scoped to an authentication bypass in only one of these sub interfaces. The 'new' CVE that was disclosed yesterday reflects the same authentication bypass in a different sub interface. The root cause is the same and the same patch resolves CVE-2025-24472.\"\n(The story was updated after publication to include a response from watchTowr Labs.)\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "zkLend loses $9.5M in crypto heist, asks hacker to return 90%",
        "Link": "https://www.bleepingcomputer.com/news/cryptocurrency/zklend-loses-95m-in-crypto-heist-asks-hacker-to-return-90-percent/",
        "Summary": "Decentralized money lender zkLend suffered a breach where threat actors exploited a smart contract flaw to steal 3,600 Ethereum, worth $9.5 million at the time. [...]",
        "Date": "2025-02-12",
        "Content": "Decentralized money lender zkLend suffered a breach where threat actors exploited a smart contract flaw to steal 3,600 Ethereum, worth $9.5 million at the time.\nzkLend is a decentralized money-market protocol built on Starknet, a Layer 2 scaling solution for Ethereum. It enables users to deposit, borrow, and lend various assets.\nThe attack took place yesterday afternoon, with zkLend\nwarning on X\nthey were suffering a cybersecurity incident.\nAccording to the EthSecurity Telegram channel, the threat actors exploited a rounding error bug in zkLend's smart contract mint() function.\n\"The attacker manipulated the \"lending_accumulator\" to be very large at 4.069297906051644020, then took advantage of the rounding error during ztoken mint() and withdraw() to repeatedly deposit 4.069297906051644021 wstETH getting 2 wei then withdraw 4.069297906051644020*1.5 -1 = 6.103946859077466029 wstETH to expend just 1 wei,\" reads a post to the\nEthSecurity channel\n.\nStarkware, who developed the Starknet network,\nconfirmed\nthat the vulnerability was not part of Starknet technology but rather an application-specific bug.\nAccording to\nCyvers\n, the threat actors attempted to launder the crypto through the RailGun privacy protocol but was blocked due to protocol policies.\nzkLend has now issued a message to the hacker stating that if they return 90% of the stolen Ethereum, which is 3,300 ETH, they can keep the other 10% and will not face any liability for the attack.\n\"We understand that you are responsible for today's attack on zkLend. You may keep 10% of the funds as a whitehat bounty, and send back the remaining 90%, or 3,300 ETH to be exact, to this Ethereum address: 0xCf31e1b97790afD681723fA1398c5eAd9f69B98C,\" reads an on-chain\nmessage to the hacker\n.\n\"Upon receiving the transfer, we agree to release from any and all liability regarding the attack.\"\n\"We are working with security firms and law enforcement at this stage. If we do not hear from you by 00:00 UTC, 14th Feb 2025, we will proceed with the next steps to track and prosecute you.\"\nThe crypto thieves have until February 13, at 7:00 PM EST, to return 90% of the stolen funds, after which zkLend will pursue legal action.\nThere has not been any response from the hacker, which is usually the case in these situations. No threat actors have been attributed to the attack.\nRelated Articles:\nCanadian charged with stealing $65 million using DeFI crypto exploits\nFBI links North Korean hackers to $308 million crypto heist\nSonicWall firewall exploit lets hackers hijack VPN sessions, patch now\nCrypto-stealing apps found in Apple App Store for the first time\nHacker pleads guilty to SIM swap attack on US SEC X account"
    },
    {
        "Title": "Surge in attacks exploiting old ThinkPHP and ownCloud flaws",
        "Link": "https://www.bleepingcomputer.com/news/security/surge-in-attacks-exploiting-old-thinkphp-and-owncloud-flaws/",
        "Summary": "Increased hacker activity has been observed in attempts to compromise poorly maintained devices that are vulnerable to older security issues from 2022 and 2023. [...]",
        "Date": "2025-02-12",
        "Content": "Increased hacker activity has been observed in attempts to compromise poorly maintained devices that are vulnerable to older security issues from 2022 and 2023.\nThreat monitoring platform GreyNoise is reporting spikes in actors leveraging\nCVE-2022-47945\nand\nCVE-2023-49103\nthat affect ThinkPHP Framework and the open-source ownCloud solution for file sharing and syncing.\nBoth vulnerabilities have critical severity and can be exploited to execute arbitrary operating system commands or to obtain sensitive data (e.g. admin password, mail server credentials, license key).\nThe first vulnerability is a local file inclusion (LFI) issue in the language parameter of ThinkPHP Framework before 6.0.14. An unauthenticated remote attacker can leverage it to execute arbitrary operating system commands in deployments where the language pack feature is enabled.\nAkamai\nreported\nlast summer that Chinese threat actors have been leveraging the flaw since October 2023 in narrow-scope operations.\nAccording to threat monitoring platform GreyNoise, CVE-2022-47945 is under high-volume exploitation right now, with attacks launched from a growing number of source IPs.\n\"GreyNoise has observed 572 unique IPs attempting to exploit this vulnerability, with activity increasing in recent days,\"\nwarns the bulletin\n.\nThis is despite its low Exploit Prediction Scoring System (EPSS) rating of 7% and the flaw not being included in CISA's Known Exploited Vulnerabilities (KEV) catalog.\nDaily exploitation activity\nSource: Greynoise\nThe second vulnerability affects the\npopular\nopen-source file-sharing software and arises from the app's dependency on a third-party library that exposes PHP environment details through a URL.\nSoon after the vulnerability's\ninitial disclosure\nfrom the developers in November 2023,\nhackers started exploiting\nit to steal sensitive information from unpatched systems.\nA year later, CVE-2023-49103\nwas listed\nby the FBI, CISA, and NSA, among the 15 most exploited vulnerabilities of 2023.\nDespite over 2 years having passed since the vendor released an update that addresses the security issue, many instances remain unpatched and exposed to attacks.\nGreyNoise observed increased exploitation of CVE-2023-49103 recently, with malicious activity originating from 484 unique IPs.\nIPs targeting ownCloud daily\nSource: Greynoise\nTo safeguard systems against active exploitation users are advised to upgrade to ThinkPHP 6.0.14 or later, and ownCloud GraphAPI to 0.3.1 and newer.\nIt is also recommended that potentially vulnerable instances are taken offline or placed behind a firewall to reduce the attack surface.\nRelated Articles:\nHackers exploit Cityworks RCE bug to breach Microsoft IIS servers\nHackers exploit SimpleHelp RMM flaws to deploy Sliver malware\nCISA tags Microsoft .NET and Apache OFBiz bugs as exploited in attacks\nZyxel won’t patch newly exploited flaws in end-of-life routers\n7-Zip MotW bypass exploited in zero-day attacks against Ukraine"
    },
    {
        "Title": "Sarcoma ransomware claims breach at giant PCB maker Unimicron",
        "Link": "https://www.bleepingcomputer.com/news/security/sarcoma-ransomware-claims-breach-at-giant-pcb-maker-unimicron/",
        "Summary": "A relatively new ransomware operation named 'Sarcoma' has claimed responsibility for an attack against the Unimicron printed circuit boards (PCB) maker in Taiwan. [...]",
        "Date": "2025-02-12",
        "Content": "A relatively new ransomware operation named ‘Sarcoma’ has claimed responsibility for an attack against the Unimicron printed circuit boards (PCB) maker in Taiwan.\nThe cybercriminals have published samples of files allegedly stolen from the company’s systems during the attack and threaten to leak everything next week if a ransom is not paid.\nIn a new listing added to Sarcoma’s leak site yesterday, the threat actors claim to be holding 377 GB of SQL files and documents exfiltrated from the Taiwanese company.\nUnimicron added on Sarcoma's list of victims\nSource: BleepingComputer\nUnimicron is a public company manufacturing rigid and flexible PCBs, high-density interconnection (HDI) boards, and integrated circuit (IC) carriers.\nThe company is one of the largest PCB manufacturers in the world, with plants and service centers in Taiwan, China, Germany, and Japan. Its products are extensively used in LDC monitors, computers, peripherals, and smartphones.\nUnimicron disclosed in\na bulletin\npublished in the Taiwan Stock Exchange (TWSE) portal that on February 1 it suffered disruption from a ransomware attack.\nAccording to the statement, the incident occurred on January 30 and impacted Unimicron Technology (Shenzhen) Corp., its China-based subsidiary.\nThe firm said the impact of the attack is limited, and informed it has engaged an external cyber forensic team to conduct incident analysis and help with implementing defense measures.\nUnimicron did not confirm a data breach, though. Meanwhile, the samples Sarcoma leaked on its extortion portal appear authentic.\nBleepingComputer has reached out to Unimicron to ask for an updated statement addressing Sarcoma’s allegations, but a comment wasn’t immediately available.\nRapid rise to high-volume operations\nSarcoma launched its first attacks on October 2024, and quickly grew to one of the most active and prolific ransomware gangs on the same month,\nclaiming 36 victims\n.\nIn November 2024, cybersecurity specialists at\nCYFIRMA warned\n: “Sarcoma ransomware is rapidly becoming a significant threat due to its aggressive tactics and increasing victim count.”\nIn December 2024, operational technology cyber threat intelligence company\nDragos listed Sarcoma\namong the most important emerging threats for industrial organizations worldwide.\nA report by\nRedPiranha\nshares more details about Sarcoma, explaining that its operators employ phishing emails and n-day vulnerabilities exploitation to gain initial access, while they have also conducted supply chain attacks to pivot from service vendors to their clients.\nPost-compromise, Sarcoma engages in RDP exploitation, lateral movement, and data exfiltration.\nHowever, the tools the threat group uses have not been analyzed yet, so although the threat group’s operation indicates experience in the field, its exact origin and tactics haven’t been deciphered yet.\nRelated Articles:\nClop ransomware is now extorting 66 Cleo data-theft victims\nRansomware payments fell by 35% in 2024, totalling $813,550,000\nRansomware gang leaks data stolen in Rhode Island's RIBridges Breach\nClop ransomware claims responsibility for Cleo data theft attacks\nDutch Police seizes 127 XHost servers, dismantles bulletproof hoster"
    },
    {
        "Title": "DPRK hackers dupe targets into typing PowerShell commands as admin",
        "Link": "https://www.bleepingcomputer.com/news/security/dprk-hackers-dupe-targets-into-typing-powershell-commands-as-admin/",
        "Summary": "North Korean state actor 'Kimsuky' (aka 'Emerald Sleet' or 'Velvet Chollima') has been observed using a new tactic inspired from the now widespread ClickFix campaigns. [...]",
        "Date": "2025-02-12",
        "Content": "North Korean state actor ‘Kimsuky’ (aka ‘Emerald Sleet’ or ‘Velvet Chollima’) has been observed using a new tactic inspired from the now widespread ClickFix campaigns.\nClickFix is a social engineering tactic that has gained traction in the cybercrime community, especially for\ndistributing infostealer malware\n.\nIt involves deceptive error messages or\nprompts\nthat direct victims to execute malicious code themselves,\noften via PowerShell commands\n. These actions typically\nlead to malware infections\n.\nAccording to the information from Microsoft's Threat Intelligence team, the attacker masquerades as a South Korean government official and gradually builds a connection with the victim.\nOnce a certain level of trust is established, the attacker sends a spear-phishing email with a PDF attachment. However, targets that want to read the document are directed to a fake device registration link that instructs them to run PowerShell as an administrator and paste attacker-provided code.\nInstructions for performing the device registration\nSource: Microsoft\nWhen executed, the code installs a browser-based remote desktop tool, downloads a certificate using a hardcoded PIN, and registers the victim’s device with a remote server, giving the attacker direct access for data exfiltration.\nMicrosoft\nsays\nit observed this tactic in limited-scope attacks starting January 2025, targeting individuals that work in international affairs organizations, NGOs, government agencies, and media companies across North America, South America, Europe, and East Asia.\nMicrosoft notified customers targeted by this activity, and urges others to take note of the new tactic and treat all unsolicited communications with extreme caution.\n“While we have only observed the use of this tactic in limited attacks since January 2025, this shift is indicative of a new approach to compromising their traditional espionage targets,”\nwarns\nMicrosoft.\nThe adoption of ClickFix tactics by nation-state actors like Kimsuky is a testament to the attack’s effectiveness in actual operations.\nUsers should show caution when encountering requests to execute on their computers code they copy online, especially when doing so with administrator privileges.\nRelated Articles:\nMalicious ads push Lumma infostealer via fake CAPTCHA pages\nKimsuky hackers use new custom RDP Wrapper for remote access\nHundreds of fake Reddit sites push Lumma Stealer malware\nTelegram captcha tricks you into running malicious PowerShell scripts\nFake Homebrew Google ads target Mac users with malware"
    },
    {
        "Title": "Ivanti fixes three critical flaws in Connect Secure & Policy Secure",
        "Link": "https://www.bleepingcomputer.com/news/security/ivanti-fixes-three-critical-flaws-in-connect-secure-and-policy-secure/",
        "Summary": "Ivanti has released security updates for Ivanti Connect Secure (ICS), Ivanti Policy Secure (IPS), and Ivanti Secure Access Client (ISAC) to address multiple vulnerabilities, including three critical severity problems. [...]",
        "Date": "2025-02-12",
        "Content": "Ivanti has released security updates for Ivanti Connect Secure (ICS), Ivanti Policy Secure (IPS), and Ivanti Secure Access Client (ISAC) to address multiple vulnerabilities, including three critical severity problems.\nThe company learned about the flaws through its responsible disclosure program from security researchers at CISA and Akamai, and through the HackerOne bug bounty platform.\nIvanti notes in the security bulletin that it received no reports about any of the issues being actively exploited in the wild. However, it it recommends that users install the security updates as soon as possible.\nThe three critical security vulnerabilities Ivanti patched are the following:\nCVE-2025-22467\n: Stack-based buffer overflow in ICS allows remote authenticated attackers with low privileges to execute code. (critical severity score of 9.9)\nCVE-2024-38657\n: External control of a filename enables remote authenticated attackers to perform arbitrary file writing in ICS and IPS. (critical severity score of 9.1)\nCVE-2024-10644\n: Code injection vulnerability enables remote authenticated attackers remote code execution in ICS and IPS. (critical severity score of 9.1)\nExploiting any of the three issues is possible from a remote location but an attacker needs to be authenticated. Furthermore, for two of them admin privileges are necessary to achieve remote code execution or to write arbitrary files.\nDespite this, the risk is still considerable as insider threats or attackers who have stolen credentials via phishing, previous breaches, or via brute forcing passwords, can still leverage the flaws for malicious operations.\nThere are also five more flaws included in the bulletin, ranging from medium to high severity. Issues include cross-site scripting (XSS) issues, hardcoded keys, cleartext storage of sensitive data, and insufficient permissions.\nThe vulnerabilities impact ICS 22.7R2.5 and older, IPS 22.7R1.2 and older, and ISAC 22.7R4 and below. Details about which products are impacted by each flaw can be seen in the table below.\nThe issues were addressed in ICS version 22.7R2.6, IPS version 22.7R1.3, and ISAC 22.8R1, which are the recommended upgrade targets for system administrators.\nIvanti has also acknowledged that the issue also impacts Pulse Connect Secure 9.x, but stated it does not plan to offer fixes for these products as their support period has ended,\n“The Pulse Connect Secure 9.x version of the product reached End of Engineering June 2024 and has reached End-of-Support as of December 31, 2024,”\nIvanti explains\n.\n“Because of this, the 9.x version of Connect Secure no longer receives backported fixes,” the company added, encouraging customers to upgrade to version 22.7 of Ivanti Connect Secure.\nIvanti has not provided any mitigations for the patched flaws and applying the latest update is the recommended solution.\nRelated Articles:\nOver 12,000 KerioControl firewalls exposed to exploited RCE flaw\nHackers exploit Cityworks RCE bug to breach Microsoft IIS servers\nNetgear warns users to patch critical WiFi router vulnerabilities\nLaravel admin package Voyager vulnerable to one-click RCE flaw\nQNAP fixes six Rsync vulnerabilities in NAS backup, recovery app"
    },
    {
        "Title": "BadPilot network hacking campaign fuels Russian SandWorm attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/badpilot-network-hacking-campaign-fuels-russian-sandworm-attacks/",
        "Summary": "A subgroup of the Russian state-sponsored hacking group APT44, also known as 'Seashell Blizzard' and 'Sandworm', has been targeting critical organizations and governments in a multi-year campaign dubbed 'BadPilot.' [...]",
        "Date": "2025-02-12",
        "Content": "A subgroup of the Russian state-sponsored hacking group APT44, also known as 'Seashell Blizzard' and 'Sandworm', has been targeting critical organizations and governments in a multi-year campaign dubbed 'BadPilot.'\nThe threat actor has been active since at least 2021 and is also responsible for breaching networks of organizations in energy, oil and gas, telecommunications, shipping, and arms manufacturing sectors.\nMicrosoft's Threat Intelligence team says that the actor is dedicated to achieving initial access to target systems, establishing persistence, and maintaining presence to allow other\nAPT44\nsubgroups with post-compromise expertise to take over.\n\"We have also observed the initial access subgroup to pursue access to an organization prior to a Seashell Blizzard-linked destructive attack,\" reads a Microsoft report shared with BleepingComputer.\nMicrosoft's assessment is \"that Seashell Blizzard uses this initial access subgroup to horizontally scale their operations as new exploits are acquired and to sustain persistent access to current and future sectors of interest to Russia.\"\nTargeting scope\nMicrosoft's earliest observations of the subgroup's activity show opportunistic operations targeting Ukraine, Europe, Central and South Asia, and the Middle East,\nfocusing on critical sectors\n.\nStarting 2022, following Russia's invasion of Ukraine, the subgroup intensified its operations against critical infrastructure supporting Ukraine, including government, military, transportation, and logistics sectors.\nTheir intrusions aimed at intelligence collection, operational disruptions, and\nwiper attacks\naimed at\ncorrupting data\nat the targeted systems.\n\"We assess that the subgroup has likely enabled at least three destructive cyberattacks in Ukraine since 2023,\" mentions Microsoft regarding the subgroup's specific activity.\nBy 2023, the subgroup's targeting scope had broadened, conducting large-scale compromises across Europe, the United States, and the Middle East, and in 2024, it started focusing on the United States, United Kingdom, Canada, and Australia.\nAPT44's subgroup victims\nSource: Microsoft\nInitial access and post-compromise activity\nThe APT44 subgroup employs multiple techniques to compromise networks, including\nexploiting n-day vulnerabilities\nin internet-facing infrastructure, credential theft, and supply chain attacks.\nSupply-chain attacks were particularly effective against organizations\nacross Europe and Ukraine\n, where the hackers targeted regionally managed IT service providers and then accessed multiple clients.\nMicrosoft has observed network scans and subsequent exploitation attempts of the following vulnerabilities:\nCVE-2021-34473 (Microsoft Exchange)\nCVE-2022-41352 (Zimbra Collaboration Suite)\nCVE-2023-32315 (OpenFire)\nCVE-2023-42793 (JetBrains TeamCity)\nCVE-2023-23397 (Microsoft Outlook)\nCVE-2024-1709 (ConnectWise ScreenConnect)\nCVE-2023-48788  (Fortinet FortiClient EMS)\nAfter exploiting the above vulnerabilities to obtain access, the hackers established persistence by deploying custom web shells like 'LocalOlive'.\nIn 2024, the APT44 subgroup started to use legitimate IT remote management tools such as Atera Agent and Splashtop Remote Services to execute commands on compromised systems while posing as IT admins to evade detection.\nRegarding the post-initial access activity, the threat actors use Procdump or the Windows registry to steal credentials, and Rclone, Chisel, and Plink for data exfiltration through covert network tunnels.\nActivity overview\nSource: Microsoft\nResearchers observed a novel technique in 2024 as the threat actor routed traffic through the Tor network \"effectively cloaking all inbound connections to the affected asset and limiting exposures from both the actor and victim environment.\"\nFinally, the subgroup performs lateral movement to reach all the parts of the network it can, and modifies the infrastructure as required for its operations.\nThe modifications include DNS configuration manipulations, the creation of new services and scheduled tasks, and the configuration of backdoor access using OpenSSH with unique public keys.\nMicrosoft says that the Russian hacker subgroup has \"near-global reach\" and helps Seashell Blizzard expand its geographical targeting.\nIn the report published today, the researchers share hunting queries, indicators of compromise (IoCs), and YARA rules for defenders to catch this threat actor's activity and stop it before .\nRelated Articles:\nRussian military hackers deploy malicious Windows activators in Ukraine\nHackers exploit SimpleHelp RMM flaws to deploy Sliver malware\n7-Zip MotW bypass exploited in zero-day attacks against Ukraine\nHackers exploiting flaws in SimpleHelp RMM to breach networks\nSurge in attacks exploiting old ThinkPHP and ownCloud flaws"
    },
    {
        "Title": "Beyond VPN: How TruGrid Simplifies RDP Deployment, Security, and Compliance",
        "Link": "https://www.bleepingcomputer.com/news/security/beyond-vpn-how-trugrid-simplifies-rdp-deployment-security-and-compliance/",
        "Summary": "Cloud-based RDP Remote Desktop Protocol solutions offer a centralized dashboard to manage user access, security policies, and monitor usage from one location. Learn more from TruGrid about how their SecureRDP platform provides a secure, scalable, and cost-efficient alternative to VPN-based RDP implementations. [...]",
        "Date": "2025-02-12",
        "Content": "While the first article outlined\nwhy VPNs are risky and cloud-based RDP is a superior alternative\n, this article will take a closer look at what makes TruGrid SecureRDP the best choice for modern businesses.\nWe'll explore how it simplifies deployment, enhances security, and ensures compliance—all while eliminating the complexity of VPNs.\nSimplified Deployment and Management: Less Complexity, More Control\nDeploying and managing a VPN is often complex and time-consuming, particularly for organizations with large, distributed workforces.\nVPNs require complicated configuration for end users, and are often difficult to use because of multiple steps required to establish connectivity, all of which can lead to lost productivity.\nCloud-Based RDP Simplicity & Flexibility\nCloud-based RDP solutions, like those offered by TruGrid, simplify the deployment process by offering centralized management through a single dashboard. This allows IT administrators to control user access, manage security policies, and monitor usage from one location.\nTruGrid Management & Security Capabilities\nManage MFA: TruGrid enables the\nmanagement of MFA\nfor Active Directory users, with options to reset or disable MFA across domains. This is done via the Security Management section of the dashboard, offering a clear, user-friendly interface for managing MFA settings, which include disabling or resetting MFA for selected users.\nNote: TruGrid does not recommend ever turning off MFA!  For those using Microsoft Entra ID, TruGrid supports the use of Microsoft Entra MFA.\nFigure 1: MFA Management\nGeo-Blocking: Despite eliminating RDP exposure, Administrators can\nrestrict countries where end users can SIGN IN from\nby enabling the Geo-Blocking feature of TruGrid and adding trusted countries.\nFigure 2: Managing Geo-Blocking\nTruGrid RemoteApp (Role-based App Access): TruGrid allows admins to\nenable RemoteApp and allow access to just required apps\n.\nThis prevents the need to allow end users to access entire remote desktop, thereby further reducing the attack surface even for authorized users. This is achieved via the Resource Assignment – App section.\nFigure 3: Allowing Access to Specific Applications via TruGrid RemoteApp Feature\nTruGrid Supports BYOD\nWhile security-conscious organizations will never allow BYOD devices to use VPN to connect to the corporate network (for fear of malware-traversal over unmanaged (BYOD) devices), cloud-based RDP solutions such as TruGrid are device-agnostic, allowing users to connect from any device without any possibility of malware traversal between any device and the corporate network.\n\"The State of Bring Your Own Device (BYOD) Policies and Trends\" report from Enterprise Strategy Group (ESG) indicates that 70% of organizations allow certain personas, like IT and executives, to choose their devices, highlighting the growing reliance on BYOD.\nThe 73% of organizations that give IT personnel device choice and 54% for executives, reflect the need for flexible, yet secure access solutions. Cloud-based RDP provides a secure and simple solution for organizations with BYOD policies, ensuring secure remote access regardless of device type.\nOrganizations relying on VPN are prone to cyberattacks over BYOD devices since BYOD devices (not owned by the organization) can contain malware or other cyber threats that can spread from the BYOD devices to the corporate network.\nFigure 4: Most Organizations Allow for Some Sort of BYOD for Certain Users\nSecure and Simplify Remote Access with TruGrid SecureRDP\nTraditional VPNs expose networks to security risks, require complex configurations, and make compliance difficult. TruGrid SecureRDP eliminates these challenges with a fully managed, cloud-based RDP solution that requires no open firewall ports.\nWith built-in MFA, Geo-Blocking, and a Zero Trust framework, TruGrid simplifies remote access while ensuring enterprise-grade security.\nTry a Business Plan for Free\nCompliance and Governance: Stay Secure and Compliant\nWith increasing regulatory pressure, businesses must ensure compliance with standards such as HIPAA, GDPR, and PCI-DSS. VPNs, with their complex infrastructure, make auditing and monitoring difficult, leading to potential compliance issues. Cloud-based RDP offers\nenhanced compliance features\ncompared to VPNs.\nCloud-Based RDP Compliance Features\nCloud-based RDP solutions simplify compliance by providing granular logging and built-in auditing tools. They also support cyber insurance requirements, which increasingly demand secure, no-firewall exposure solutions for remote access. This makes it easier for businesses to demonstrate compliance with standards like SOC 2, HIPAA, and PCI DSS.\nThe \"Managing the Endpoint Vulnerability Gap\" report by Enterprise Strategy Group (ESG) further reinforces the compliance benefits of cloud-based RDP. The report finds that 44% of organizations uncovered systems with open access and 37% identified compliance issues during endpoint monitoring.\nCloud-based RDP eliminates risks posed by vulnerable endpoints (BYOD and corporate) because it connects endpoints to corporate networks in a zero-trust fashion, whereby threats from remote endpoints cannot traverse into the corporate network.\nFigure 5: Majority Have Experienced Attacks Relating to Device Management\n????\nDirect Comparison: VPN vs. Cloud-Based RDP\nFor many industries, especially healthcare, finance, and technology, where security and compliance are paramount, cloud-based RDP offers a superior solution when compared with RDP over VPN.\nCloud-based RDP ensures secure, scalable, and high-performance access to critical applications without exposing the entire network.\nFeature\nVPN\nCloud-Based RDP\nSecurity\nRequires open inbound firewall ports\nNo open inbound firewall ports, Zero Trust\nPerformance\nHigher latency, network congestion\nLow-latency, load distribution\nCost\nHigh upfront and ongoing costs\nPay-as-you-go, scalable\nManagement\nComplex setup and management\nSimplified and centralized\nCompliance\nExposed inbound ports create compliance headache\nZero exposure, integrated MFA, support for Geo Blocking and Conditional Access, help meet compliance\nTable 1: VPN vs. Cloud-Based RDP Feature Comparison\nConclusion\nAs businesses continue to adapt to a distributed workforce, the security, performance, and cost limitations of VPNs are becoming more evident.\nCloud-based RDP solutions like\nTruGrid SecureRDP\nprovide a secure, scalable, and cost-efficient alternative, making them the superior choice for modern remote access needs.\nGrowing cyber threats underscore the urgency for businesses to adopt zero-trust solutions like cloud-based RDP.\nDon't wait until your next cybersecurity audit or breach—\nschedule personalized demo with TruGrid\nand take the first step towards a secure remote access future.\nSponsored and written by\nTruGrid\n."
    },
    {
        "Title": "Google fixes flaw that could unmask YouTube users' email addresses",
        "Link": "https://www.bleepingcomputer.com/news/security/google-fixes-flaw-that-could-unmask-youtube-users-email-addresses/",
        "Summary": "Google has fixed two vulnerabilities that, when chained together, could expose the email addresses of YouTube accounts, causing a massive privacy breach for those using the site anonymously. [...]",
        "Date": "2025-02-12",
        "Content": "Google has fixed two vulnerabilities that, when chained together, could expose the email addresses of YouTube accounts, causing a massive privacy breach for those using the site anonymously.\nThe flaws\nwere discovered\nby security researchers Brutecat (\nbrutecat.com\n) and Nathan (\nschizo.org\n), who found that YouTube and Pixel Recorder APIs could be used to obtain user's Google Gaia IDs and convert them into their email addresses.\nThe ability to convert a YouTube channel into an owner's email address is a significant privacy risk to content creators, whistleblowers, and activists relying on being anonymous online.\nLeaky APIs\nThe first part of the attack chain, which was exploitable for months, was discovered after BruteCat looked through Google's\nInternal People API\nand found that Google's network-wide \"blocking\" feature required an obfuscated Gaia ID and a display name.\nA Gaia ID is a unique internal identifier Google uses to manage accounts across its network of sites. As users register for a single \"Google Account\" that is used across all of Google's sites, this ID is the same throughout Gmail, YouTube, Google Drive, and other Google services.\nHowever, this ID is not meant to be public and is for internal use to share data between Google's systems.\nPlaying around with the blocking feature on YouTube, BruteCat discovered that when attempting to block someone in a live chat, YouTube exposes the targeted person's obfuscated Gaia ID in a response from the\n/youtube/v1/live_chat/get_item_context_menu\nAPI request.\nThe response included base64 encoded data that, when decoded, contained the Gaia ID of that user.\nResponse from the YouTube API\nThe researchers found that simply clicking on the three-dot menu in a chat triggered a background request to YouTube's API, allowing them to access the ID without having to block them. By modifying the API call, the researchers retrieved the Gaia ID of any YouTube channel, including those attempting to remain anonymous.\nArmed with the Gaia ID, they now wanted to figure out a way to convert it into an email address, which would increase the flaw's severity.\nHowever, older APIs that\ncould do this\nhave been deprecated or no longer work, so BruteCat and Nathan began looking for old, outdated Google services that could potentially still be exploited.\nAfter experimenting, Nathan discovered that\nPixel Recorder\nhas a web-based API that could be used to convert the ID into an email when sharing a recording.\nUsing Pixel Recorder API to convert Gaia ID to an email address\nThis meant that once a YouTube user's Gaia ID was obtained, it could be submitted to the Pixel Recorder sharing feature, which then returned the associated email address, potentially compromising the identity of millions of YouTube users.\n\"Gaia IDs are leaked across several Google products apart from just YouTube (Maps, Play, Pay), causing a significant privacy risk for all Google users, as they can be used to reveal the email address tied to the Google account,\" the researchers told BleepingComputer.\nWhile the researchers now had a way of getting an email address from Gaia ID, the service also notified the users of the shared file, potentially alerting them of the malicious activity.\nAs the notification email included a video's title in the email notification, the researchers modified their request to include millions of characters in the title data, which caused the email notification service to fail and not send the email.\nThe researchers disclosed the flaw to Google on September 24th, 2024, and it was ultimately fixed last week on February 9th, 2025.\nGoogle initially responded that the vulnerability was a duplicate of a previously tracked bug, only awarding a $3,133 bounty. However, after demonstrating the additional Pixel Recorder component, they increased the bounty to $10,633, citing a high likelihood that it would be exploited.\nBruteCat and Nathan told BleepingComputer that Google mitigated the bugs by fixing the Gaia ID leak and the Gaia ID to Email flaw via Pixel Recorder. Google also made it so blocking a user on YouTube only impacted that site and would not affect other services.\nGoogle has confirmed to BleepingComputer that mitigations for the bugs are now completed and that there are no signs that any attacker actively exploited the flaws.\nRelated Articles:\nGoogle says hackers abuse Gemini AI to empower their attacks\nGoogle blocked 2.36 million risky Android apps from Play Store in 2024\nGoogle to kill Chrome Sync on older Chrome browser versions\nGoogle launches customizable Web Store for Enterprise extensions\nNew Android Identity Check locks settings outside trusted locations"
    },
    {
        "Title": "President Trump to Nominate Former RNC Official as National Cyber Director",
        "Link": "https://www.darkreading.com/cyber-risk/president-trump-nominate-former-rnc-official-national-cyber-director",
        "Summary": "Sean Cairncross will be one of the primary advisers to the administration on national cybersecurity matters.",
        "Date": "2025-02-12",
        "Content": "TechTarget and Informa Tech’s Digital Business Combine.TechTarget and Informa\nTogether, we power an unparalleled network of 220+ online properties covering 10,000+ granular topics, serving an audience of 50+ million professionals with original, objective content from trusted sources. We help you gain critical insights and make more informed decisions across your business priorities.\nSean Cairncross will be one of the primary advisers to the administration on national cybersecurity matters.\nFebruary 12, 2025\nPresident Donald Trump reportedly will nominate Sean Cairncross, former chief operating officer of the Republican National Committee (RNC), as the new head of the Office of the National Cyber Director (ONCD), according to multiple reports.\nCairncross's name apparently was mentioned in a list of planned White House nominees for various posts in the administration obtained by Politico, Axios, and other media outlets.\nAs national cyber director, Cairncross will play a key role in developing and shaping US cybersecurity policies in the new administration.\nThe ONCD serves as one of the principal advisers to the president on cybersecurity matters. Unlike the US Cybersecurity and Information Security Agency (CISA), which handles operational cybersecurity and directly engages with federal agencies, ONCD's primary mission is to develop a high-level, whole-of-nation cybersecurity strategy. Among other things, the ONCD led the development of President Joe Biden's National Cybersecurity Strategy of March 2023.\nIn his new role, Cairncross would be responsible for coordinating national cybersecurity policy, advising the president on cyber threats, and ensuring a unified federal response to emerging cyber-risks. He would share responsibility for advising the president on cyber matters, along with the director of cyber at the White House National Security Council (NSC) — a group that advises the president on all matters security related, and not just cyber.\nCairncross is a former RNC official and CEO of the independent US foreign aid agency Millennium Challenge Corporation (MCC). He brings considerable political experience but lacks formal cybersecurity credentials.\nAs CEO of the MCC from 2019 to 2020, Cairncross oversaw the agency's efforts to alleviate poverty through economic growth in developing nations. Before that, he was deputy assistant to President Trump and senior adviser to the White House chief of staff, and had served as chief operating officer (COO) of the RNC during the 2016 election cycle.\nIf confirmed, Cairncross fills the role formerly held by Harry Coker Jr., a former CIA senior executive and career Naval officer who served as the White House national cyber director from December 2023 to January, 2025. Coker now serves as Maryland Department of Commerce Secretary after his appointment by Maryland Governor Wes Moore in late January.\nMeanwhile, Politico last week reported that Trump had appointed Alexei Bulazel, a former security researcher at Apple and former director of the NSC, as the new senior director for cyber at the Council. If true, that would make Cairncross the second high-level cybersecurity appointment that Trump has made since taking office on Jan. 20.\nThe nomination of Cairncross as national cyber director marks a significant development in the Trump administration's still nascent but evolving cyber strategy. In just four weeks in the White House, Trump has implemented changes that have sent ripples through the cybersecurity industry.\nOne of his first acts in office was to rescind a Biden administration executive order that required developers of major artificial intelligence projects and systems to adhere to safety and ethical guidelines. He has, however, left two other Biden cybersecurity executive orders untouched thus far: EO 14111, Strengthening and Promoting Innovation in the Nation's Cybersecurity; and EO 14028, Improving the Nation's Cybersecurity.\nAlmost immediately after taking office, the Trump administration terminated advisory committee members within the US Department of Homeland Security (DHS). That included members of CISA's Cyber Safety Review Board (CSRB), which among other things was investigating Chinese group Salt Typhoon's attacks on US critical infrastructure.\nThe Trump administration's moves have impacted CISA as well. Earlier this week, 17 CISA staffers involved in efforts to combat election-related threats were placed on leave pending an internal review of their work. In a report last week, NPR quoted unnamed CISA staffers as saying they had received deferred resignation offers as part of the Elon Musk-led Department of Government Efficiency's (DOGE) efforts to cut costs across the federal government.\nJai Vijayan, Contributing Writer\n\nJai Vijayan is a seasoned technology reporter with over 20 years of experience in IT trade journalism. He was most recently a Senior Editor at Computerworld, where he covered information security and data privacy issues for the publication. Over the course of his 20-year career at Computerworld, Jai also covered a variety of other technology topics, including big data, Hadoop, Internet of Things, e-voting, and data analytics. Prior to Computerworld, Jai covered technology issues for The Economic Times in Bangalore, India. Jai has a Master's degree in Statistics and lives in Naperville, Ill.\nYou May Also Like\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nIndustrial Networks in the Age of Digitalization\nZero-Trust Adoption Driven by Data Protection, Cloud Access Control, and Regulatory Compliance Requirements\nThreat Hunting's Evolution: From On-Premises to the Cloud\nHow Enterprises Secure Their Applications\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\nFrost Radar: Cloud Security Posture Management, 2024\nThe State of Cloud Native Security Report 2024\nDriving the Future of Work Through Enterprise-Wide SASE\nUnderstanding Social Engineering Attacks and What To Do About Them\nSolution Brief: Introducing the runZero Platform\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nCopyright © 2025. This website is owned and operated by Informa TechTarget, part of a global network that informs, influences and connects the world’s technology buyers and sellers. All copyright resides with them. Informa PLC’s registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. TechTarget, Inc.’s registered office is 275 Grove St. Newton, MA 02466."
    },
    {
        "Title": "Content Credentials Technology Verifies Image, Video Authenticity",
        "Link": "https://www.darkreading.com/cyber-risk/content-credentials-aim-to-tame-disinformation",
        "Summary": "The open technology, which tackles disinformation, has gained steam in the past year, surpassing 500 corporate members and continuing to evolve.",
        "Date": "2025-02-12",
        "Content": "TechTarget and Informa Tech’s Digital Business Combine.TechTarget and Informa\nTogether, we power an unparalleled network of 220+ online properties covering 10,000+ granular topics, serving an audience of 50+ million professionals with original, objective content from trusted sources. We help you gain critical insights and make more informed decisions across your business priorities.\nNews, news analysis, and commentary on the latest trends in cybersecurity technology.\nThe open technology, which tackles disinformation, has gained steam in the past year, surpassing 500 corporate members and continuing to evolve.\nFebruary 12, 2025\nWhen armed gangs raided a Haitian prison and released 4,700 prisoners last March, images and videos showing the violence and gunfire saturated social media around the world. Determining which graphic media was authentic — and marking those instances in a way that future viewers could verify for themselves what was real and what was modified — was a significant challenge.\nShowcasing a solution to exactly that problem, the British Broadcasting Corporation (BBC) launched its adoption of Content Credentials, a technology for attesting to the authenticity and provenance of digital content, by using the technology to verify a TikTok video of the attack. The BBC verified the location of the video and its likely veracity, but it determined that audio of gunfire had been added after the fact. The company then digitally signed the video so that future viewers would know the BBC had verified it.\nContent Credentials — an open technology that aims to solve disinformation and media integrity issues — is being developed by the Coalition for Content Provenance and Authenticity (C2PA), a group of more than 500 media, software, and hardware companies working to create an ecosystem for verified media.\nThe BBC's adoption of Content Credentials is just one use case but an important one, says Andy Parsons, senior director of the Content Authenticity Initiative (CAI) at Adobe and a steering committee member of the C2PA.\n\"The BBC [is] declaring that — regardless of whether this is a photo or whether AI was used to do a photo illustration — you can be guaranteed that it came from BBC, and even that simple proof-of-date or proof-of-origin is something we don't have in media right now,\" Parsons says.\nIn 2019, technology and media companies created the CAI to find solutions to disinformation and ways for news organizations to authenticate photos and video. Two years later, six companies — Adobe, Arm, BBC, Intel, Microsoft, and Truepic — founded the C2PA to pursue an open standard for establishing the provenance of various types of media files. The two efforts eventually combined forces to advance Content Credentials, a digital-signature technology and infrastructure for verifying and authenticating media.\nIn the past year, Content Credentials and the C2PA gained significant steam, with the addition of Amazon, Google, Meta, and OpenAI to the steering committee and the adoption of the technology by several camera makers — including Canon, Leica, and Sony — and smartphone makers, such as Samsung.\nYet the ecosystem is still in its infancy, Christian Paquin, a principal research software engineer at Microsoft, told attendees at last month's ShmooCon 2025.\n\"You can imagine the situation in five to 10 years when this technology is baked in a lot of the trusted news and a hardware ecosystem that can produce these signatures and can be validated by the social media themselves or the browsers, so that we can really have trust signals to differentiate what's real and what's not,\" he said.\nContent Credentials have three main components: the media data, a manifest describing the data and any actions transforming the data, and a digital signature binding the two pieces of information together in a tamper-evident way. The manifest includes typical metadata, as well as some additional C2PA-accepted fields — attestations — that can describe additional attributes of the photo, its source, and the software actions used to process the data.\nBased on public-key encryption and digital signatures, Content Credentials act as an audit log of every action performed on a piece of media. A photo could be captured with a smartphone, cropped and lightened with photo-editing software, and then compressed by a content delivery network. Each of those steps would be an attestation in the manifest of the signed content credential.\n\nA video signed with a Content Credential shows that it originated with the BBC News Lab. Source: https://contentcredentials.org/verify\nThe result is providing an audit trail with each piece of authenticated content, which could help citizens and users better know what is fake and what is arguably real, Adobe's Parsons says.\n\"All the companies involved — and I would lump in civil society and some governments as well — have a real urgency to solve this problem,\" he says. \"And while C2PA is not a silver bullet at solving misinformation, it does put in place a fundamental foundational layer that the Internet probably should always have had around trust, and this is a really nice clean way to do it.\"\nAlready, most makers of foundational artificial intelligence (AI) models — such as Open AI, Meta, and Microsoft — digitally sign all images created by their image-generation models with a Content Credential, indicating that it was AI generated or manipulated.\nThe technology is not done, either. The C2PA specification has quickly evolved over the past three years, reaching version 2.1 in September. Among the new features are efforts to make the credentials more \"durable\" — in other words, adopting techniques, such as digital fingerprinting and watermarking, to indicate the provenance of images, even if they are manipulated after publication or captured from a screenshot.\nThe combination of signed metadata with fingerprinting and watermarking is powerful, Adobe's Parsons wrote in a 2024 analysis of the techniques.\n\"[N]one of these techniques is durable enough in isolation to be effective on its own,\" he said. \"But combined into a single approach, the three form a unified solution that is robust and secure enough to ensure that reliable provenance information is available no matter where a piece of content goes.\"\n\nWatermarks, fingerprinting, and Content Credentials can be a powerful combination. Source: \"Durable Content Credentials,\" CAI blog\nA number of technical problems remain to be solved. Journalists reporting on an authoritarian regime, for example, may want to remain anonymous and mask their location. Zero-knowledge proofs can help, allowing a name to be redacted and only the organization — BBC News, for example — to be shown or to generalize the location. ZK proofs allow an attribute to be signed, so a photo's GPS coordinates could instead be reduced to New York City or Kiev to provide a general location that hides the photographer's identity, and verified with a digital signature.\n\"This is an evolving set of certifications,\" Microsoft's Paquin told the audience at ShmooCon. \"The main challenge is establishing who can sign certificates ... establishing PKI that is worldwide is a big problem.\"\nRobert Lemos, Contributing Writer\n\nVeteran technology journalist of more than 20 years. Former research engineer. Written for more than two dozen publications, including CNET News.com, Dark Reading, MIT's Technology Review, Popular Science, and Wired News. Five awards for journalism, including Best Deadline Journalism (Online) in 2003 for coverage of the Blaster worm. Crunches numbers on various trends using Python and R. Recent reports include analyses of the shortage in cybersecurity workers and annual vulnerability trends.\nYou May Also Like\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nDrata Acquires SafeBase to Strengthen GRC Portfolio\nDatabarracks Launches Air Gap Recover\n7AI Streamlines Security Operations With Autonomous AI Agents\nBackline Tackles Enterprise Security Backlogs With AI\nCopyright © 2025. This website is owned and operated by Informa TechTarget, part of a global network that informs, influences and connects the world’s technology buyers and sellers. All copyright resides with them. Informa PLC’s registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. TechTarget, Inc.’s registered office is 275 Grove St. Newton, MA 02466."
    },
    {
        "Title": "Feds Sanction Russian Hosting Provider for Supporting LockBit Attacks",
        "Link": "https://www.darkreading.com/cyber-risk/feds-sanction-russian-hosting-provider-lockbit-attacks",
        "Summary": "US, UK, and Australian law enforcement have targeted a company called Zservers (and two of its administrators) for providing bulletproof hosting services to the infamous ransomware gang.",
        "Date": "2025-02-12",
        "Content": "TechTarget and Informa Tech’s Digital Business Combine.TechTarget and Informa\nTogether, we power an unparalleled network of 220+ online properties covering 10,000+ granular topics, serving an audience of 50+ million professionals with original, objective content from trusted sources. We help you gain critical insights and make more informed decisions across your business priorities.\nUS, UK, and Australian law enforcement have targeted a company called Zservers (and two of its administrators) for providing bulletproof hosting services to the infamous ransomware gang.\nFebruary 12, 2025\nThe US government has joined Australia and the UK in sanctioning a Russia-based bulletproof hosting (BPH) services provider and two of its administrators for the company's role in supporting LockBit ransomware attacks. The move is a continuation of a barrage of law-enforcement actions against the Russia-based cybercriminal organization.\nThe Department of the Treasury's Office of Foreign Assets Control (OFAC), Australia's Department of Foreign Affairs and Trade, and the United Kingdom's Foreign Commonwealth and Development Office jointly sanctioned Zservers, based in Barnaul, Russia, for enabling \"ransomware attacks and other criminal activity,\" the Treasury Department revealed in a press release Feb. 11. That illicit activity specifically centers on providing the infrastructure to facilitate attacks by LockBit, a prolific Russian-based ransomware-as-a-service (RaaS) group, according to the release.\nThe latest sanctions against Zservers are a continuation of multinational law-enforcement actions aimed at putting LockBit — which has committed severely disruptive ransomware attacks against numerous global organizations — permanently out of commission.\nSpecifically, they follow four LockBit-related arrests and device seizures made in October by Europol and Eurojust, which at the time also sanctioned and named as a LockBit affiliate Aleksandr Ryzhenkov (aka Beverley). Ryzhenkov was once second-in-command for the infamous Evil Corp cybercrime organization. Officials also arrested one of LockBit's lead developers in Israel last August, while a separate action by Australia sanctioned LockBit's head honcho, LockBitSupp (aka Dmitry Yuryevich Khoroshev), in May 2024.\nRelated:President Trump to Nominate Former RNC Official as National Cyber Director\n\"Ransomware actors and other cybercriminals rely on third-party network service providers like Zservers to enable their attacks on Us and international critical infrastructure,\" Bradley T. Smith, the Treasury Department's acting under secretary for terrorism and financial intelligence, said in a press statement. The sanctions demonstrate the US government's \"collective resolve to disrupt all aspects of this criminal ecosystem, wherever located, to protect our national security,\" he added.\nLaw enforcement investigating LockBit discovered the criminal activity of Zservers after the company advertised its BPH services on known cybercriminal forums, according to the Treasury Department. BPH service providers sell access to specialized servers and other computer infrastructure designed to evade detection and thus defy law enforcement attempts to disrupt malicious activities.\nRelated:Content Credentials Technology Verifies Image, Video Authenticity\nAllegedly, Zservers has provided BPH services, including leasing numerous IP addresses, to LockBit affiliates, who have used the hosting services to coordinate and launch ransomware attacks, according to international law enforcement, which collected evidence over several years to come to this conclusion.\nDuring a 2022 search of a known LockBit affiliate, Canadian law enforcement uncovered a laptop operating a virtual machine connected to a Zservers' subleased IP address and running a programming interface used to operate LockBit malware. Also that year, a Russian cybercriminal purchased IP addresses from Zservers, which the department said was likely for use to power LockBit chat servers to discuss ransomware operations. In 2023, Zservers also leased infrastructure, including a Russian IP address, to a LockBit affiliate, the department said.\nThe idea behind government sanctions is to prohibit companies in certain countries from doing business with people involved in cybercriminal activity with the aim of deterring that activity. However, given the resilience of professional ransomware and other cybercriminal groups, experts have mixed opinions on whether this strategy actually works in the long run.\nRelated:India's Cybercrime Problems Grow as Nation Digitizes\n\"It is important to acknowledge that although sanctions might impede ransomware operations by targeting their infrastructure, ransomware groups such as LockBit are highly adaptive and well-connected, and will likely have other providers they're able to call on,\" says Andrew Costis, engineering manager of the Adversary Research Team at security firm AttackIQ.\nHowever, sanctions should make it more difficult for cybercriminals to operate by increasing their costs and forcing attackers to find less effective methods to commit ransomware attacks, another security expert says. This can serve to at least slow them down if not totally put them out of service, notes Randolph Barr, CISO at security firm Cequence.\n\"The recently announced sanctions and law enforcement actions against Zservers will aid in disrupting ransomware groups by targeting their infrastructure, seizing servers, and blocking financial transactions,\" he says.\nStill, sanctions alone may not necessarily disrupt LockBit and other ransomware groups entirely, meaning that organizations must remain vigilant, Barr says. \"As threat actors adapt, companies must continue improving incident management and include ransomware scenarios in their preparedness exercises,\" he notes.\nIndeed, Costis says, given the adaptability of RaaS and its network of affiliates in particular, \"organizations must stay vigilant and focus on the latest tactics, techniques, and procedures (TTPs) attackers deploy, to stay ahead of ever-changing threats.\"\nElizabeth Montalbano, Contributing Writer\n\nElizabeth Montalbano is a freelance writer, journalist, and therapeutic writing mentor with more than 25 years of professional experience. Her areas of expertise include technology, business, and culture. Elizabeth previously lived and worked as a full-time journalist in Phoenix, San Francisco, and New York City; she currently resides in a village on the southwest coast of Portugal. In her free time, she enjoys surfing, hiking with her dogs, traveling, playing music, yoga, and cooking.\nYou May Also Like\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nIndustrial Networks in the Age of Digitalization\nZero-Trust Adoption Driven by Data Protection, Cloud Access Control, and Regulatory Compliance Requirements\nThreat Hunting's Evolution: From On-Premises to the Cloud\nHow Enterprises Secure Their Applications\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\nFrost Radar: Cloud Security Posture Management, 2024\nThe State of Cloud Native Security Report 2024\nDriving the Future of Work Through Enterprise-Wide SASE\nUnderstanding Social Engineering Attacks and What To Do About Them\nSolution Brief: Introducing the runZero Platform\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nCopyright © 2025. This website is owned and operated by Informa TechTarget, part of a global network that informs, influences and connects the world’s technology buyers and sellers. All copyright resides with them. Informa PLC’s registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. TechTarget, Inc.’s registered office is 275 Grove St. Newton, MA 02466."
    },
    {
        "Title": "Microsoft: Russia's Sandworm APT Exploits Edge Bugs Globally",
        "Link": "https://www.darkreading.com/threat-intelligence/microsoft-russian-sandworm-apt-exploits-edge-bugs-globally",
        "Summary": "Sandworm (aka Seashell Blizzard) has an initial access wing called &quot;BadPilot&quot; that uses standard intrusion tactics to spread Russia's tendrils around the world.",
        "Date": "2025-02-12",
        "Content": "TechTarget and Informa Tech’s Digital Business Combine.TechTarget and Informa\nTogether, we power an unparalleled network of 220+ online properties covering 10,000+ granular topics, serving an audience of 50+ million professionals with original, objective content from trusted sources. We help you gain critical insights and make more informed decisions across your business priorities.\nSandworm (aka Seashell Blizzard) has an initial access wing called \"BadPilot\" that uses standard intrusion tactics to spread Russia's tendrils around the world.\nFebruary 12, 2025\nArguably, no advanced persistent threat (APT) enjoys as much notoriety as Sandworm, otherwise known as Military Unit 74455 within Russia's military intelligence (GRU). Its highlight reel includes NotPetya, an attack against the 2018 Winter Olympics, and two effective assaults on Ukraine's power grid. More recent activities include a campaign against Denmark's energy sector and an unsuccessful attempt to down Ukraine's grid for a third time, followed by a successful attempt.\nIn a sign of the times, Sandworm has subtly been shifting toward quieter, more widespread intrusions. Microsoft, which tracks the group as \"Seashell Blizzard,\" has identified a subgroup within 74455 focused solely on gaining initial access to high-value organizations across major industries and geographic regions. It calls this subgroup \"BadPilot.\"\nSince at least late 2021, BadPilot has been performing opportunistic attacks against Internet-facing infrastructure, taking advantage of known vulnerabilities in popular email and collaboration platforms. Notable examples include Zimbra's CVE-2022-41352, the Microsoft Exchange bug CVE-2021-34473, and CVE-2023-23397 in Microsoft Outlook. All three of these vulnerabilities received \"critical\" 9.8 out of 10 scores in the Common Vulnerability Scoring System (CVSS).\nBadPilot uses these critical vulnerabilities to gain useful initial access to traditionally high-value organizations: telecommunications companies, oil and gas companies, shipping companies, arms manufacturers, and entities of foreign governments. Targets have ranged from Ukraine and broader Europe to Central and South Asia and the Middle East.\nSince early 2024, BadPilot has expanded to access targets in the US and UK as well. For this, it has made particular use of bugs in remote monitoring and management software: CVE-2023-48788, for example, a remote injection opportunity in the Fortinet Forticlient Enterprise Management Server (EMS), and the rare 10 out of 10 CVSS-rated CVE-2024-1709, allowing for authentication bypass in ScreenConnect by ConnectWise.\nAfter gaining its foothold on a targeted system, BadPilot follows all the usual steps of any average hacking operation. It promptly establishes persistence using its custom \"LocalOlive\" Web shell, as well as copies of legitimate remote management and monitoring (RMM) tools, or \"ShadowLink,\" which configures compromised systems as Tor hidden services. It collects credentials, performs lateral movement, exfiltrates data as necessary, and sometimes performs further post-compromise activities.\n\"There is not a lack of sophistication here, but a focus on agility and obtaining goals,\" says Sherrod DeGrippo, director of threat intelligence strategy at Microsoft. \"These TTPs work because this threat actor is persistent and continues pursuing its objectives.\"\nUltimately, BadPilot's job is to lubricate more significant attacks by its parent group, and, by extension, empower its controlling government. While a lot of its activity seems opportunistic, Microsoft wrote, \"its compromises cumulatively offer Seashell Blizzard options when responding to Russia's evolving strategic objectives.\"\nIt may or may not be a coincidence, for example, that the group came into being just months before Russia's invasion of Ukraine. As that war began, and Russia peppered its neighbor with more cyberattacks than ever before, BadPilot was right in the mix, helping gain access to organizations perceived to be providing political or military support to its adversary. Additionally, Microsoft says, the group has enabled at least three destructive attacks in Ukraine since 2023.\nSandworm has targeted critical infrastructure across Ukraine since the war started, including telecommunications infrastructure, manufacturing plants, transportation and logistics, energy, water, military and government organizations, and other infrastructure meant to support the civilian population. It has also targeted military communities for the purpose of intelligence gathering.\n\"These threat actors are persistent, creative, organized, and well-resourced,\" DeGrippo emphasizes. For this reason, \"Critical sectors need to ensure that they sustain above-average security practices, patch their software, monitor Internet-facing assets, and enhance their overall security posture.\"\nNate Nelson, Contributing Writer\n\nNate Nelson is a writer based in New York City. He formerly worked as a reporter at Threatpost, and wrote \"Malicious Life,\" an award-winning Top 20 tech podcast on Apple and Spotify. Outside of Dark Reading, he also co-hosts \"The Industrial Security Podcast.\"\nYou May Also Like\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nIndustrial Networks in the Age of Digitalization\nZero-Trust Adoption Driven by Data Protection, Cloud Access Control, and Regulatory Compliance Requirements\nThreat Hunting's Evolution: From On-Premises to the Cloud\nHow Enterprises Secure Their Applications\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\nFrost Radar: Cloud Security Posture Management, 2024\nThe State of Cloud Native Security Report 2024\nDriving the Future of Work Through Enterprise-Wide SASE\nUnderstanding Social Engineering Attacks and What To Do About Them\nSolution Brief: Introducing the runZero Platform\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nCopyright © 2025. This website is owned and operated by Informa TechTarget, part of a global network that informs, influences and connects the world’s technology buyers and sellers. All copyright resides with them. Informa PLC’s registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. TechTarget, Inc.’s registered office is 275 Grove St. Newton, MA 02466."
    },
    {
        "Title": "Is AI a Friend or Foe of Healthcare Security?",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/is-ai-friend-foe-healthcare-security",
        "Summary": "When it comes to keeping patient information safe, people empowerment is just as necessary as deploying new technologies.",
        "Date": "2025-02-12",
        "Content": "TechTarget and Informa Tech’s Digital Business Combine.TechTarget and Informa\nTogether, we power an unparalleled network of 220+ online properties covering 10,000+ granular topics, serving an audience of 50+ million professionals with original, objective content from trusted sources. We help you gain critical insights and make more informed decisions across your business priorities.\nWhen it comes to keeping patient information safe, people empowerment is just as necessary as deploying new technologies.\nFebruary 12, 2025\nCOMMENTARY\nSome say artificial intelligence (AI) has changed healthcare in ways we couldn't have imagined just a few years ago. It's now used for everything from paperwork to helping doctors make better diagnoses. But like any new tech, there are risks involved.\nCurrently, AI is both a potent defense mechanism and an attacker enabler. Therefore, the question that must be asked is clear: Is AI an enemy or a friend of cybersecurity in healthcare? Honestly, the answer is both.\nHealthcare systems are rich targets for malicious actors, with considerable protected health information (PHI) spread across interconnected assets such as electronic health records, Internet of Things (IoT)-enabled medical devices, and telehealth platforms. It has been proven that traditional cybersecurity tools often lack the resources and features required to protect such complex ecosystems and, as in different industries, struggle to keep pace with both the volume of data being generated and evolving attack methodologies.\nThe advantage of machine learning algorithms is that they can find a potential threat before it is serious. AI-powered security tools can detect anomalies in system behaviors, such as unauthorized data transfer or suspicious login activities, and thus proactively prevent a breach. Indeed, several hospitals using AI-powered systems have been able to avert ransomware attacks and maintain operational integrity and patient safety.\nArtificial Intelligence is also incomparable in terms of its critical role in reducing administrative burdens and further complying with the Health Insurance Portability and Accountability Act (HIPAA) and other regulations. AI-powered tools, such as virtual assistants and data processing systems, take over administrative work while safeguarding sensitive data. These tools protect PHI and free human resources to focus on patient care.\nWhile AI hardens the defense, it turbocharges the attacker side, too. In such a way, cyber threats in healthcare have become increasingly sophisticated. The game changed with generative AI tools that let attackers create unbelievably realistic tailor-made emails with perfect grammar and formatting that quickly slipped through traditional security filters.\nDeepfakes add another layer to these deceptions: generating hyperreal audio and video that makes an attacker sound like senior health leaders or other trusted voices. These fabrications have been used to deceive staff into granting unauthorized access, sharing PHI, and even making fraudulent financial transactions. In some cases, attackers have used deepfakes to spread false medical information or to undermine public confidence, further destabilizing an already complex threat landscape.\nAI-powered malware leverages machine learning to make live changes, evade traditional detection, and zero in on critical systems, such as IoT-enabled devices and electronic health records. Attackers manipulate diagnostic data, alter medical imaging, and gain entry through vulnerabilities in lightly secured IoT devices, enabling them to create avenues to coordinate attacks. Combining AI with IoT could pose a greater threat to patient safety and trust in healthcare systems than just financial losses. \nAI-powered threats sound an alarm for information security, IT, and healthcare leaders. These risks are reshaping the cybersecurity landscape. Preemptive defenses require advanced AI tools, employee training, and collaboration across cross-functional teams. This would, in turn, involve policy and detection system reviews to grant top priority for countering AI-impelled social engineering and malware. Constantly being one step ahead of the bad actors requires constant vigilance, innovative thinking, and a core commitment to data safety and patient care.\nAs an expert or executive, you face the critical decision of managing the promise of AI and the risk it further introduces into an already overcomplicated cybersecurity landscape. AI is not the Holy Grail; it's a tool that can be used for and against us. AI’s transformative potential in healthcare and security comes from how it is implemented, so leaders must approach its adoption with a balanced perspective. They should be excited yet cautious, knowing full well that attackers are leveraging the very same technology to undermine our systems, data, and trust.\nIn my experience, the excitement around adopting AI tools like transcript generators, grammar checkers, or automated note-taking systems often takes precedence over critical security assessments. I have seen teams advocate for rapid implementation to save time and resources without assessing the risks; common questions such as where the data is stored, how it is processed, or if the vendor is compliant often are not asked. This rush to embrace convenience creates gaps that attackers can exploit, especially in healthcare, where even minor oversights can lead to significant breaches of PHI or personally identifiable information (PII).\nDeepfakes, adaptive malware, and the exploitation of IoT devices, all powered by AI, require a new type of thinking to address these threats — one that changes from legacy defenses or even leading-edge AI-powered tools to placing those tools within an extended proactive security framework encompassing audits, employee training, and reliable governance. For that to happen, health workers and administrators must be empowered to recognize sophisticated attacks, faked video calls, or some other unexpected data transfer AI flagged up. People empowerment is just as necessary in deploying new technologies.\nDrive collaboration between IT, security, and clinical teams in developing customized strategies for technical vulnerabilities and operational realities. This means vigilance, from systems monitoring to continuing review of AI's evolving role in your institution.\nSafeguarding healthcare systems includes protecting the trust and well-being of the patients it cares for and its entire community. This depends entirely on the type of leadership that doesn't just react to threats but proactively takes bold measures to mitigate risks before they spread. Security embedded in all facets of the organization should ensure continuity of critical operations and uncompromised care of the patients by leaders in healthcare.\nClaudio Gallo\nLead Security Engineer, C4HCO\nClaudio Gallo is a lead security engineer of the Colorado Marketplace Exchange, dedicated to protecting critical information in the healthcare and insurance industries. With expertise in application security, cloud architecture, and compliance, Claudio designs innovative strategies to safeguard sensitive data and ensure trust in important services. Passionate about making a meaningful difference, he is equally committed to mentoring aspiring professionals in the information security industry, sharing knowledge, and fostering the next generation of cybersecurity talent.\nYou May Also Like\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nIndustrial Networks in the Age of Digitalization\nZero-Trust Adoption Driven by Data Protection, Cloud Access Control, and Regulatory Compliance Requirements\nThreat Hunting's Evolution: From On-Premises to the Cloud\nHow Enterprises Secure Their Applications\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\nFrost Radar: Cloud Security Posture Management, 2024\nThe State of Cloud Native Security Report 2024\nDriving the Future of Work Through Enterprise-Wide SASE\nUnderstanding Social Engineering Attacks and What To Do About Them\nSolution Brief: Introducing the runZero Platform\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nCopyright © 2025. This website is owned and operated by Informa TechTarget, part of a global network that informs, influences and connects the world’s technology buyers and sellers. All copyright resides with them. Informa PLC’s registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. TechTarget, Inc.’s registered office is 275 Grove St. Newton, MA 02466."
    },
    {
        "Title": "India's Cybercrime Problems Grow as Nation Digitizes",
        "Link": "https://www.darkreading.com/cyber-risk/indias-cybercrime-problems-nation-digitizes",
        "Summary": "More than half of attacks on Indian businesses come from outside the country, while 45% of those targeting consumers come from Cambodia, Myanmar, and Laos.",
        "Date": "2025-02-12",
        "Content": "TechTarget and Informa Tech’s Digital Business Combine.TechTarget and Informa\nTogether, we power an unparalleled network of 220+ online properties covering 10,000+ granular topics, serving an audience of 50+ million professionals with original, objective content from trusted sources. We help you gain critical insights and make more informed decisions across your business priorities.\nBreaking cybersecurity news, news analysis, commentary, and other content from around the world, with an initial focus on the Middle East & Africa and the Asia Pacific\nMore than half of attacks on Indian businesses come from outside the country, while 45% of those targeting consumers come from Cambodia, Myanmar, and Laos.\nFebruary 12, 2025\nIndia continues to see a surge in cybercrime affecting both citizens and businesses, with cyber fraud against citizens jumping 51% over the past year and cyberattackers targeting businesses in volumes significantly higher than global averages.\nOverall, Indian citizens filed more than 1.7 million cybercrime complaints in 2024, up from 1.1 million complaints in 2023, according to the latest data from India's National Cyber Reporting Platform (NCRP) released in early February. While many of those cyber scams came from domestic sources, about 45% of the cyberattacks came from cybercriminal havens in Cambodia, Myanmar, and Laos, according to the report.\nThe problem underscores the dark side of increasing access to online services. While the country is digitizing many of its government services — giving citizens easier access — crime has followed online, President Droupadi Murmu said during a speech to Parliament on Jan. 31.\n\"[I]n an increasingly digital society, cybersecurity has become a crucial issue of national importance,\" Murmu said. \"Digital fraud, cybercrime, and emerging technologies like deepfakes pose challenges to our social, economic, and national security.\"\nIndia's citizens are not the only targets of cybercriminals — business sites increasingly face online attacks. Cyber-risks and digital/technology risks are the most pressing concerns for companies in India, with businesses in the region prioritizing those issues more than their global counterparts, according to PricewaterhouseCoopers' \"2025 Global Digital Trust Insights — India Edition.\"\n\nSource: PricewaterhouseCoopers, \"2025 Global Digital Trust Insights — India Edition\"\n\"Over the next 12 months, Indian organizations are prioritizing the mitigation of three key risks: cyberthreats, digital vulnerabilities and inflation,\" PwC India stated in the report. \"This focus highlights the critical need for robust cybersecurity, reliable technological infrastructure, and strategies to counter rising costs and ensure resilience and sustained growth.\"\nCompared with other regions of the world, India is seeing a greater volume of attacks. The average website in India sees about 6.9 million unwanted requests — often referred to as \"attacks\" by vendors — every year, with 26% more attacks per site compared with the global average, according to Indusface. Denial-of-service attacks are also more common against Indian targets, compared with the global average, says Venky Sundar, founder and president for the Americas at Indusface.\nThe threat actors have gone mobile-first, with API servers for mobile applications targeted with 43% more requests per host compared with websites, he says.\nThere is \"a shift in attack strategies towards disrupting mobile and connected services,\" Sundar says. \"Cybercrime is increasingly targeting external-facing APIs associated with mobile apps rather than just traditional web platforms.\"\nThe attacks are split fairly evenly between domestic sources and global ones, he adds. Overall, about half of the malicious traffic targeting company sites and API servers are domestic, with much of the rest coming from four countries: US, France, UK, and Singapore.\nThe government is currently taking steps to make life harder for attackers. The Reserve Bank of India (RBI), for example, has created exclusive Internet domains for banks (bank.in) and for non-bank financial institutions (fin.in), which will be run by the Institute for Development and Research in Banking Technology (IDRBT). India also passed its first privacy and data-protection law in 2023, and drafted implementation rules last month, which together define the rights of Indian citizens and requirements for companies handling data.\nIndia and the US also recently signed a memorandum of understanding (MoU) that allows the two countries to cooperate on intelligence gathering, the exchange of information on cybercrime cases, and collaborative training. India has also fought to rescue and repatriate its citizens from forced labor camps for criminal syndicates in Cambodia, Myanmar, and Laos, where they are forced to conduct a variety of online scams.\nYet the country still faces a shortage of cybersecurity professionals. In September, the government announced an effort to train 5,000 \"cyber commandos\" over the next five years, to help national and state governments with cyber investigations.\nTraining citizens in cybersecurity can have additional benefits, President Murmu said in her remarks to Parliament.\n\"My government has taken numerous measures to control these cyber threats, creating opportunities for employment in the field of cybersecurity for the youth [and] is continuously working to ensure competence in cybersecurity,\" she said, noting that the country has reached Tier 1 status in the International Telecommunication Union's Global Cybersecurity Index.\nRead more about:\nRobert Lemos, Contributing Writer\n\nVeteran technology journalist of more than 20 years. Former research engineer. Written for more than two dozen publications, including CNET News.com, Dark Reading, MIT's Technology Review, Popular Science, and Wired News. Five awards for journalism, including Best Deadline Journalism (Online) in 2003 for coverage of the Blaster worm. Crunches numbers on various trends using Python and R. Recent reports include analyses of the shortage in cybersecurity workers and annual vulnerability trends.\nYou May Also Like\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nIndustrial Networks in the Age of Digitalization\nZero-Trust Adoption Driven by Data Protection, Cloud Access Control, and Regulatory Compliance Requirements\nThreat Hunting's Evolution: From On-Premises to the Cloud\nHow Enterprises Secure Their Applications\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\nTop 10 CI/CD Security Risks: The Technical Guide\nFrost Radar: Cloud Security Posture Management, 2024\nThe State of Cloud Native Security Report 2024\nDriving the Future of Work Through Enterprise-Wide SASE\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nCopyright © 2025. This website is owned and operated by Informa TechTarget, part of a global network that informs, influences and connects the world’s technology buyers and sellers. All copyright resides with them. Informa PLC’s registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. TechTarget, Inc.’s registered office is 275 Grove St. Newton, MA 02466."
    },
    {
        "Title": "What is penetration testing? | Unlocked 403 cybersecurity podcast (ep. 10)",
        "Link": "https://www.welivesecurity.com/en/videos/what-is-penetration-testing-unlocked-403-cybersecurity-podcast-ep-10/",
        "Summary": "Ever wondered what it's like to hack for a living – legally? Learn about the art and thrill of ethical hacking and how white-hat hackers help organizations tighten up their security.",
        "Date": "2025-02-12",
        "Content": "\n      Award-winning news, views, and insight from the ESET security community\n    \n\n        Award-winning news, views, and insight from the ESET security community\n      \nVideo\nEver wondered what it's like to hack for a living – legally? Learn about the art and thrill of ethical hacking and how white-hat hackers help organizations tighten up their security.\nEditor\n\n12 Feb 2025\n\nWhat if breaking into computer systems, tricking people into handing over passwords, and even sneaking into buildings was part of your normal daily routine? That is the reality for penetration testers – or, more broadly, ethical hackers – who get paid to think like criminals so that they can identify and help close security loopholes before the actual bad guys can exploit them.\nIn this episode of the Unlocked 403 cybersecurity podcast, Becks sits down with ESET penetration testers Tomas Lezovic and Pavol Michalec to give you a peek into the high-stakes world of hacking for good, answering questions like:\nAlso, don't miss a demo of a replay attack that leverages one of today's most popular hacking gadgets.\n\nConnect with us on Facebook, X, LinkedIn and Instagram.\n\n      Sign up for our newsletters\n    \nVideo\nThis month in security with Tony Anscombe – January 2025 edition\nVideo\nThis month in security with Tony Anscombe – January 2025 edition\n\nVideo\nUEFI Secure Boot: Not so secure\nVideo\nUEFI Secure Boot: Not so secure\n\nVideo\nThis month in security with Tony Anscombe – December 2024 edition\nVideo\nThis month in security with Tony Anscombe – December 2024 edition\n\nSecure Coding\nCapture the flag: 5 websites to sharpen your hacking skills\nDigital Security\nThe hacker’s toolkit: 4 gadgets that could spell security trouble\nDigital Security\nSmall but mighty: Top 5 pocket-sized gadgets to boost your ethical hacking skills\n\n            Award-winning news, views, and insight from the ESET security community\n          "
    },
    {
        "Title": "Microsoft Patch Tuesday, February 2025 Edition",
        "Link": "https://krebsonsecurity.com/2025/02/microsoft-patch-tuesday-february-2025-edition/",
        "Summary": "Microsoft today issued security updates to fix at least 56 vulnerabilities in its Windows operating systems and supported software, including two zero-day flaws that are being actively exploited.",
        "Date": "2025-02-12",
        "Content": "Microsoft today issued security updates to fix at least 56 vulnerabilities in its Windows operating systems and supported software, including two zero-day flaws that are being actively exploited.\n\nAll supported Windows operating systems will receive an update this month for a buffer overflow vulnerability that carries the catchy name CVE-2025-21418. This patch should be a priority for enterprises, as Microsoft says it is being exploited, has low attack complexity, and no requirements for user interaction.\nTenable senior staff research engineer Satnam Narang noted that since 2022, there have been nine elevation of privilege vulnerabilities in this same Windows component — three each year — including one in 2024 that was exploited in the wild as a zero day (CVE-2024-38193).\n“CVE-2024-38193 was exploited by the North Korean APT group known as Lazarus Group to implant a new version of the FudModule rootkit in order to maintain persistence and stealth on compromised systems,” Narang said. “At this time, it is unclear if CVE-2025-21418 was also exploited by Lazarus Group.”\nThe other zero-day, CVE-2025-21391, is an elevation of privilege vulnerability in Windows Storage that could be used to delete files on a targeted system. Microsoft’s advisory on this bug references something called “CWE-59: Improper Link Resolution Before File Access,” says no user interaction is required, and that the attack complexity is low.\nAdam Barnett, lead software engineer at Rapid7, said although the advisory provides scant detail, and even offers some vague reassurance that ‘an attacker would only be able to delete targeted files on a system,’ it would be a mistake to assume that the impact of deleting arbitrary files would be limited to data loss or denial of service.\n“As long ago as 2022, ZDI researchers set out how a motivated attacker could parlay arbitrary file deletion into full SYSTEM access using techniques which also involve creative misuse of symbolic links,”Barnett wrote.\nOne vulnerability patched today that was publicly disclosed earlier is CVE-2025-21377, another weakness that could allow an attacker to elevate their privileges on a vulnerable Windows system. Specifically, this is yet another Windows flaw that can be used to steal NTLMv2 hashes — essentially allowing an attacker to authenticate as the targeted user without having to log in.\nAccording to Microsoft, minimal user interaction with a malicious file is needed to exploit CVE-2025-21377, including selecting, inspecting or “performing an action other than opening or executing the file.”\n“This trademark linguistic ducking and weaving may be Microsoft’s way of saying ‘if we told you any more, we’d give the game away,'” Barnett said. “Accordingly, Microsoft assesses exploitation as more likely.”\nThe SANS Internet Storm Center has a handy list of all the Microsoft patches released today, indexed by severity. Windows enterprise administrators would do well to keep an eye on askwoody.com, which often has the scoop on any patches causing problems.\nIt’s getting harder to buy Windows software that isn’t also bundled with Microsoft’s flagship Copilot artificial intelligence (AI) feature. Last month Microsoft started bundling Copilot with Microsoft Office 365, which Redmond has since rebranded as “Microsoft 365 Copilot.” Ostensibly to offset the costs of its substantial AI investments, Microsoft also jacked up prices from 22 percent to 30 percent for upcoming license renewals and new subscribers.\nOffice-watch.com writes that existing Office 365 users who are paying an annual cloud license do have the option of “Microsoft 365 Classic,” an AI-free subscription at a lower price, but that many customers are not offered the option until they attempt to cancel their existing Office subscription.\nIn other security patch news, Apple has shipped iOS 18.3.1, which fixes a zero day vulnerability (CVE-2025-24200) that is showing up in attacks.\nAdobe has issued security updates that fix a total of 45 vulnerabilities across InDesign, Commerce, Substance 3D Stager, InCopy, Illustrator, Substance 3D Designer and Photoshop Elements.\nChris Goettl at Ivanti notes that Google Chrome is shipping an update today which will trigger updates for Chromium based browsers including Microsoft Edge, so be on the lookout for Chrome and Edge updates as we proceed through the week.\n\r\n         This entry was posted on Tuesday 11th of February 2025 11:58 PM \r\n         \nyou forgot about DC strong cert enforcement:\nhttps://support.microsoft.com/en-us/topic/kb5014754-certificate-based-authentication-changes-on-windows-domain-controllers-ad2c23b0-15d8-4340-a468-4d4f3b188f16#bkmk_certmap\nif organizations have not taken action, authentication could be broken. even though the KB is old, February 2025 is when MS flips the switch: “domain controllers will move to Full Enforcement mode when the February 2025 Windows security update is installed. Authentication will be denied if a certificate cannot be strongly mapped”\nYou forgot a bug CVE-2025-TRUMP.  That bug affects the entire country,\nMicrosoft makes it hard to cancel and get the Office 365 Personal Classic version, without Copilot. Some users were able to see it, but others were not. I was able to get a free two-month extension online. I asked for a callback. After about a 10 minute wait, someone called back from MS. She said I could cancel my subscription and switch to the Classic version, but I would lose my two month extension. OK, so if I want to keep the extra two months, I need to call back in May, when it is about to renew. Then I can cancel my Family subscription ($99 per month) and get the original $69 plan. This would be “the easiest way”, to which I disagreed.\nAtomic Shrimp addressed this very issue only 2 weeks ago here;\nhttps://youtu.be/eYVPThx7yss\nI do not know what your final resolution will be or what you are prepared to accept but it may give you some options you haven’t considered. This is typical behaviour from Tech companies today dragging us all down the path of ensh*ttification.\nGood luck.\nI accidentally deleted Microsoft Office (2019) from my computer and it will not reinstall with the product key.  I tried but do not like the Microsoft 365 Co-pilot version.  Any suggestions on how to work around this to get a ‘classic’ version of Office or an alternative that includes Excel?\nInstall LibreOffice.\nI’ve been forced to use Microsoft Word/Excel/etc. products for the last 20 years. \nExcept for some very special embedded technologies such as VBA macros, LibreOffice should be able to read, process, and update MS-format documents very well.\nSeconded.  A couple excel spreadsheets and other things made on 365 may break, most will not.  Regular updates too.\nagreed, MS at work due to semi monopoly/bundles,  Libre at home because it’s good and not evil MS that can’t make a secure OS or office version after 40 years of failing.\nClaire, you have a few options here but it all depends on your technical ability so bear with me.\nAs RipNoLonger pointed out above, LibreOffice is a good option, so is Google Sheets if it’s just an Excel alternative you are looking for. But, that doesn’t address the fact that you have a perfectly valid Office product key that you paid good money for.\nMy experience with repairing corrupted Office installs over the years has been frustrating to say the least. You should never uninstall Office without a tool like Revo Uninstaller, which will scan and remove registry markers that will otherwise impede a clean reinstall.\n1. Depending on Win10 or 11. Goto installed apps in ‘Settings’ and right click the Office app. Select ‘Modify’ and this will allow you to attempt to repair a single Office programme or the whole package. Try product key again. If fail goto 2.\n2. Install Revo Uninstaller (free version) and uninstall Office with it. Choose ‘Advanced’ scan after uninstall, select and delete EVERYTHING. Run ‘sfc /scannow’ in PowerShell to repair system files. Reboot and reinstall Office. If fail goto 3.\n3. I know this is the nuclear option but I guarantee it will work. You need to backup all your data and reinstall Windows. If you are not comfortable doing this yourself your local Tech shop will do it for a fee, BUT you will have a fresh platform to deal with. Before installing Office, or any other programmes for that matter, run Chris Titus Tech’s Windows Utility Tool to tweak and debloat your Windows OS. Run ‘irm christitus.com/win | iex’ in PowerShell and uninstall Copilot, Recall, OneDrive and disable Microsoft telemetry. Then install Office.\nI know option 3 works because I just successfully reinstalled Office 2007 and 2010 on 2 family members ageing PCs after upgrade to Win 11. The install accepted the product keys but stumbled on the ‘internet’ activation claiming the product key had been reused too many times (‘telephone’ activation is not supported for products older than Office 2016). However after all the updates and a reboot, activation completed.\nGood Luck.\nThanks for the detailed breakdown, Brian! It’s good to see Microsoft addressing a wide range of vulnerabilities this month—especially that zero-day, which could have been a real headache if left unpatched. Your prompt coverage and clear explanations help us prioritize these updates and keep our systems safe.\nMany thanks for all the thoughtful replies!\nIt seems some Win 11 workstations are having trouble with KB5051987.  KB5043080 needs to be installed at the same time. https://www.reddit.com/r/sysadmin/comments/1i2kruf/fix_for_windows_11_24h2_update_error_0x800f0838/\nApple has also enabled Apple Intelligence on 18.0.1 on devices that can use it even if previously you had disabled it. Seems all these tech giants plan for you to use AI whether you like it or not. I am still skeptical it would benefit me that much to have it enabled. Apparently it will not be a opt in choice, but I will wonder how AI will affect security going forward.\nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    }
]