[
    {
        "Title": "Google Confirms Android SafetyCore Enables AI-Powered On-Device Content Classification",
        "Link": "https://thehackernews.com/2025/02/google-confirms-android-safetycore.html",
        "Summary": "Google has stepped in to clarify that a newly introduced Android System SafetyCore app does not perform any client-side scanning of content.\n\"Android provides many on-device protections that safeguard users against threats like malware, messaging spam and abuse protections, and phone scam protections, while preserving user privacy and keeping users in control of their data,\" a spokesperson for",
        "Date": "2025-02-11",
        "Content": "Google has stepped in to clarify that a newly introduced Android System SafetyCore app does not perform any\nclient-side scanning\nof content.\n\"Android provides many on-device protections that safeguard users against threats like malware, messaging spam and abuse protections, and phone scam protections, while preserving user privacy and keeping users in control of their data,\" a spokesperson for the company told The Hacker News when reached for comment.\n\"SafetyCore is a new Google system service for Android 9+ devices that provides the on-device infrastructure for securely and privately performing classification to help users detect unwanted content. Users are in control over SafetyCore and SafetyCore only classifies specific content when an app requests it through an optionally enabled feature.\"\nSafetyCore (package name \"com.google.android.safetycore\") was\nfirst introduced\nby Google in October 2024, as part of a\nset of security measures\ndesigned to combat scams and other content deemed sensitive on the Google Messages app for Android.\nThe feature, which requires 2GB of RAM, is rolling out to all Android devices, running Android version 9 and later, as well as those running Android Go, a lightweight version of the operating system for entry-level smartphones.\nClient-side scanning (CSS), on the other hand, is seen as an alternative approach to enable on-device analysis of data as opposed to weakening encryption or adding backdoors to existing systems. However, the method has raised serious privacy concerns, as it's ripe for abuse by forcing the service provider to search for material beyond the initially agreed-upon scope.\nIn some ways, Google's Sensitive Content Warnings for the Messages app is a lot similar to Apple's\nCommunication Safety feature\nin iMessage, which employs on-device machine learning to analyze photo and video attachments and determine if a photo or video appears to contain nudity.\nThe maintainers of the GrapheneOS operating system, in a\npost\nshared on X, reiterated that SafetyCore doesn't provide client-side scanning, and is mainly designed to offer on-device machine-learning models that can be used by other applications to classify content as spam, scam, or malware.\n\"Classifying things like this is not the same as trying to detect illegal content and reporting it to a service,\" GrapheneOS said. \"That would greatly violate people's privacy in multiple ways and false positives would still exist. It's not what this is and it's not usable for it.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "4 Ways to Keep MFA From Becoming too Much of a Good Thing",
        "Link": "https://thehackernews.com/2025/02/4-ways-to-keep-mfa-from-becoming-too.html",
        "Summary": "Multi-factor authentication (MFA) has quickly become the standard for securing business accounts. Once a niche security measure, adoption is on the rise across industries. But while it’s undeniably effective at keeping bad actors out, the implementation of MFA solutions can be a tangled mess of competing designs and ideas. For businesses and employees, the reality is that MFA sometimes feels",
        "Date": "2025-02-11",
        "Content": "Multi-factor authentication (MFA) has quickly become the standard for securing business accounts. Once a niche security measure, adoption is on the rise across industries. But while it's undeniably effective at keeping bad actors out, the implementation of\nMFA solutions\ncan be a tangled mess of competing designs and ideas. For businesses and employees, the reality is that MFA sometimes feels like too much of a good thing.\nHere are a few reasons why MFA isn't implemented more universally.\n1. Businesses see MFA as a cost center\nMFA for businesses isn't free, and the\ncosts of MFA\ncan add up over time. Third-party MFA solutions come with subscription costs, typically charged per user. Even built-in options like Microsoft 365's MFA features can cost extra depending on your Microsoft Entra license.\nPlus, there's the cost of training employees to use MFA and the time IT takes to enroll them. If MFA increases help desk calls, support costs go up too. While these expenses are far less than the cost of a security breach (\n$4.88 million\nlast year), businesses don't always see that connection clearly.\n2. User experience is a persistent pain point\nNo matter how you slice it, MFA also brings extra steps. After entering a password, users must complete another verification step. This inevitably adds friction. Admins need to consider the form of MFA used, how often it's required, and balance both with risk.\nCombining MFA with SSO can lighten the security burden by allowing users to authenticate once to access multiple apps, rather than logging in separately to each one. This lowers friction for your users, so MFA doesn't get in the way of work. Beyond SSO, keep end users happy by opting for an MFA platform with flexible policy settings. For example, internal workstation access probably doesn't need MFA as often as remote access via VPN, RDP, or other external connections.\n3. MFA implementation brings hidden pitfalls\nDeploying MFA and training users isn't a small task. The first step is to create and manage a system that keeps things simple — from user enrollment to monitoring MFA activity.\nChoose an MFA that plays nicely with your organization's current identity setup. Securing access to a mix of on-premises Active Directory (AD) and cloud infrastructure can mean managing multiple identities per user, creating management overhead and creating a hybrid identity security gap.\nScalability is also a factor: as the user base grows, can the system keep up? If you're relying on a third-party MFA service, what happens if it goes down?\nThen there's the issue of connectivity. Many MFA solutions assume users are always online. But what if they're offline or on an isolated network with limited connectivity? Consider how and where your users log on and evaluate if your MFA should support local prompts to authenticate users, even when their device isn't connected to the internet.\n4. MFA alone isn't enough\nSure, MFA boosts security, but no MFA method is foolproof. Each approach has its own weaknesses that attackers can exploit. For example, SMS-based MFA (no longer recommended) is vulnerable to SIM-swapping attacks, while push notifications can fall victim to MFA fatigue, where users are bombarded with repeated login requests by attackers who've already compromised their passwords.\nMore advanced attackers have tools to steal session cookies, allowing them to bypass MFA entirely in some situations. SSO, while convenient, can exacerbate the problem — if an attacker breaks through one MFA barrier, they may gain access to multiple applications.\nMFA doesn't have to be this hard\nThe takeaway is that\nMFA\nneeds to be part of a broader strategy that includes monitoring and logging to give admins visibility into authentication activities. While MFA is a crucial layer in defending against unauthorized access, deployment will bring challenges. Plan for them. For a successful MFA implementation, understand costs, consider user experience, and take a proactive approach to mitigating its limitations.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Progress Software Patches High-Severity LoadMaster Flaws Affecting Multiple Versions",
        "Link": "https://thehackernews.com/2025/02/progress-software-patches-high-severity.html",
        "Summary": "Progress Software has addressed multiple high-severity security flaws in its LoadMaster software that could be exploited by malicious actors to execute arbitrary system commands or download any file from the system.\nKemp LoadMaster is a high-performance application delivery controller (ADC) and load balancer that provides availability, scalability, performance, and security for business-critical",
        "Date": "2025-02-11",
        "Content": "Progress Software has\naddressed\nmultiple high-severity security flaws in its LoadMaster software that could be exploited by malicious actors to execute arbitrary system commands or download any file from the system.\nKemp LoadMaster is a high-performance application delivery controller (ADC) and load balancer that provides availability, scalability, performance, and security for business-critical applications and websites.\nThe identified vulnerabilities are listed below -\nCVE-2024-56131\n,\nCVE-2024-56132\n,\nCVE-2024-56133\n, and\nCVE-2024-56135\n(CVSS scores: 8.4) - A set of improper input validation vulnerabilities that allows remote malicious actors who gain access to the management interface of LoadMaster and successfully authenticate to execute arbitrary system commands via a carefully crafted HTTP request\nCVE-2024-56134\n(CVSS score: 8.4) - An improper input validation vulnerability that allows remote malicious actors who gain access to the management interface of LoadMaster and successfully authenticate to download the content of any file on the system via a carefully crafted HTTP request\nThe following versions of the software are affected by the flaws -\nLoadMaster versions from 7.2.55.0 to 7.2.60.1 (inclusive) - Fixed in 7.2.61.0 (GA)\nLoadMaster versions from 7.2.49.0 to 7.2.54.12 (inclusive) - Fixed in 7.2.54.13 (LTSF)\nLoadMaster version 7.2.48.12 and prior - Upgrade to LTSF or GA\nMulti-Tenant LoadMaster version 7.1.35.12 and prior - Fixed in 7.1.35.13 (GA)\nProgress Software noted that it has no evidence that any of the aforementioned vulnerabilities have been exploited in the wild. That said, with previously disclosed flaws\nweaponized\nby threat actors in the past, it's essential that customers apply the latest patches for optimal protection.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Gcore DDoS Radar Reveals 56% YoY Increase in DDoS Attacks",
        "Link": "https://thehackernews.com/2025/02/gcore-ddos-radar-reveals-56-yoy.html",
        "Summary": "Gcore’s latest DDoS Radar report analyzes attack data from Q3–Q4 2024, revealing a 56% YoY rise in the total number of DDoS attacks with the largest attack peaking at a record 2 Tbps. The financial services sector saw the most dramatic increase, with a 117% rise in attacks, while gaming remained the most-targeted industry. This period’s findings emphasize the need for robust, adaptive DDoS",
        "Date": "2025-02-11",
        "Content": "Gcore's latest\nDDoS Radar report\nanalyzes attack data from Q3–Q4 2024, revealing a 56% YoY rise in the total number of DDoS attacks with the largest attack peaking at a record 2 Tbps. The financial services sector saw the most dramatic increase, with a 117% rise in attacks, while gaming remained the most-targeted industry. This period's findings emphasize the need for\nrobust, adaptive DDoS mitigation\nas attacks become more precise and frequent. Let's dive into the numbers.\nKey takeaways: the future of DDoS defense\nHere are the four key takeaways from Gcore Radar:\nDDoS attacks are increasing in volume and sophistication.\nThe 17% growth in total attacks and new peak volume of 2 Tbps highlight the need for advanced protection.\nFinancial services face growing risks.\nWith a 117% increase in attacks, this sector requires heightened security measures.\nShorter, high-intensity attacks are now the norm.\nTraditional mitigation approaches must adapt to rapid burst attacks that can evade detection.\nGeopolitical factors influence attack patterns.\nUnderstanding attack origins can help strengthen defenses in high-risk regions.\nDDoS attack frequency increases to new high\nThe report highlights a sustained increase in attack frequency. Compared to Q3–Q4 2023, DDoS attacks have risen by 56%, underscoring the long-term growth trend.\nGcore identifies several technological and environmental factors that are likely contributing to the rising number of attacks:\nEasy access to attack tools:\nDDoS-for-hire services and botnets have lowered the barrier for launching attacks.\nExpanding IoT vulnerabilities:\nPoorly secured IoT devices continue to fuel larger botnets.\nGeopolitical and economic tensions:\nPolitical conflicts and financial motivations drive targeted attacks.\nMore sophisticated attack strategies:\nMulti-vector and application-layer attacks make mitigation more difficult.\nLargest attack reaches 2 Tbps\nThe largest recorded attack in Q3–Q4 2024 hit 2 Tbps, targeting a major global gaming company. This represents an 18% increase from the previous peak of 1.7 Tbps in Q1–Q2 2024.\nWhile large-scale attacks like these are often mitigated quickly, their destructive potential continues to grow. Terabit-level attacks can cause widespread service outages and financial losses, particularly for businesses reliant on real-time operations.\nFinancial services face attack surge, but gaming remains the top target\nGaming remains the most-attacked sector, though its share of total attacks dropped from 49% in Q3–Q4 2023 to 34%. Possible explanations include:\nImproved DDoS protection forcing attackers to shift focus\nOngoing motivation for attacks due to competitive gaming and financial incentives\nHigh revenue impact from service downtime\nAlso notable is the uptick in attacks on financial services, rising from 12% to 26% of total incidents. The sector's heavy regulation, critical online services, and susceptibility to ransom-based attacks make it a prime target.\nThe full\nGcore Radar report\nshares industry data for media and entertainment, retail, telecommunications, technology, and other industries.\nRise of ACK floods and shorter bursts\nThe distribution of DDoS attacks across the network and application layers during H2 2024 highlights a greater prevalence of network-layer attacks.\nAt the network layer, UDP flood attacks remain the most common method, accounting for 60% of all network-layer attacks. However, ACK flood attacks are on the rise, now making up 7% of total attacks. These attacks mimic legitimate traffic, making mitigation more challenging.\nAt the application layer, L7 UDP flood attacks accounted for 45%, while L7 TCP flood attacks rose to 37%. Gcore notes that the latter is gaining traction due to its ability to evade traditional filtering mechanisms.\nShorter but more disruptive attacks\nOne of the most notable shifts is the decrease in attack duration. The longest recorded attack in Q3–Q4 2024 lasted just five hours, compared to 16 hours in the previous period.\nShorter, high-intensity burst attacks are becoming more common. These attacks:\nDisrupt services quickly\nwhile avoiding sustained detection.\nMimic legitimate traffic patterns\n, making mitigation more complex.\nServe as smokescreens\nfor other cyberattacks, including ransomware.\nGeopolitical influences\nGeopolitical tensions and economic rivalries continue to shape the DDoS landscape, with politically motivated attacks targeting financial services, critical infrastructure, and high-value enterprises. Meanwhile, regions with dense internet infrastructure—such as the Netherlands, the US, and China—serve as both launch points and battlegrounds for cybercriminal groups leveraging botnets, proxy networks, and DDoS-for-hire services.\nThe report identifies key regions contributing to DDoS attack traffic:\nThe US and the Netherlands\nare top sources for both attack layers.\nBrazil\nis a growing hub for network-layer attacks.\nChina\nand\nIndonesia\nboth contribute significantly to global attack volumes.\nDownload\nthe full report\nfor application-layer attack geographic data.\nGcore DDoS Protection: mitigating the new wave of attacks\nGcore DDoS Protection\nleverages 200+ Tbps filtering capacity across six continents to neutralize attacks in real time. As DDoS threats evolve, organizations must adopt proactive defense strategies to safeguard their digital assets.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Apple Patches Actively Exploited iOS Zero-Day CVE-2025-24200 in Emergency Update",
        "Link": "https://thehackernews.com/2025/02/apple-patches-actively-exploited-ios.html",
        "Summary": "Apple on Monday released out-of-band security updates to address a security flaw in iOS and iPadOS that it said has been exploited in the wild.\nAssigned the CVE identifier CVE-2025-24200 (CVSS score: 4.6), the vulnerability&nbsp;has been described as an authorization issue that could make it possible for a malicious actor to disable USB Restricted Mode on a locked device as part of a cyber",
        "Date": "2025-02-11",
        "Content": "Apple on Monday released out-of-band security updates to address a security flaw in iOS and iPadOS that it said has been exploited in the wild.\nAssigned the CVE identifier\nCVE-2025-24200\n(CVSS score: 4.6), the vulnerability has been described as an authorization issue that could make it possible for a malicious actor to disable USB Restricted Mode on a locked device as part of a cyber physical attack.\nThis suggests that the attackers require physical access to the device in order to exploit the flaw. Introduced in iOS 11.4.1, USB Restricted Mode\nprevents\nan Apple iOS and iPadOS device from communicating with a connected accessory if it has not been unlocked and connected to an accessory within the past hour.\nThe feature is seen as an attempt to prevent digital forensics tools like\nCellebrite\nor\nGrayKey\n, which are mainly used by law enforcement agencies, from gaining unauthorized entry to a confiscated device and extracting sensitive data.\nIn line with advisories of this kind, no other details about the security flaw are currently available. The iPhone maker said the vulnerability was addressed with improved state management.\nHowever, Apple acknowledged that it's \"aware of a report that this issue may have been exploited in an extremely sophisticated attack against specific targeted individuals.\"\nSecurity researcher Bill Marczak of The Citizen Lab at The University of Toronto's Munk School has been credited with discovering and reporting the flaw.\nThe update is available for the following devices and operating systems -\niOS 18.3.1 and iPadOS 18.3.1\n- iPhone XS and later, iPad Pro 13-inch, iPad Pro 12.9-inch 3rd generation and later, iPad Pro 11-inch 1st generation and later, iPad Air 3rd generation and later, iPad 7th generation and later, and iPad mini 5th generation and later\niPadOS 17.7.5\n- iPad Pro 12.9-inch 2nd generation, iPad Pro 10.5-inch, and iPad 6th generation\nThe development comes weeks after Cupertino\nresolved\nanother security flaw, a use-after-free bug in the Core Media component (CVE-2025-24085), that it revealed as having been exploited against versions of iOS before iOS 17.2.\nZero-days in Apple software have been\nprimarily weaponized\nby commercial surveillanceware vendors to deploy sophisticated programs that can extract data from victim devices.\nWhile these tools, such as NSO Group's\nPegasus\n, are marketed as \"technology that saves lives\" and to combat serious criminal activity as a way to get around the so-called\n\"Going Dark\" problem\n, they have also been misused to spy on members of the civil society.\nNSO Group, for its part, has reiterated that Pegasus is not a mass surveillance tool and that it's licensed to \"legitimate, vetted intelligence and law enforcement agencies.\"\nIn its\ntransparency report for 2024\n, the Israeli company said it serves 54 customers in 31 countries, of which 23 are intelligence agencies and another 23 are law enforcement agencies.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Protecting Your Software Supply Chain: Assessing the Risks Before Deployment",
        "Link": "https://thehackernews.com/2025/02/protecting-your-software-supply-chain.html",
        "Summary": "Imagine you're considering a new car for your family. Before making a purchase, you evaluate its safety ratings, fuel efficiency, and reliability. You might even take it for a test drive to ensure it meets your needs. The same approach should be applied to software and hardware products before integrating them into an organization's environment. Just as you wouldn’t buy a car without knowing its",
        "Date": "2025-02-11",
        "Content": "Imagine you're considering a new car for your family. Before making a purchase, you evaluate its safety ratings, fuel efficiency, and reliability. You might even take it for a test drive to ensure it meets your needs. The same approach should be applied to software and hardware products before integrating them into an organization's environment. Just as you wouldn't buy a car without knowing its safety features, you shouldn't deploy software without understanding the risks it introduces.\nThe Rising Threat of Supply Chain Attacks\nCybercriminals have recognized that instead of attacking an organization head-on, they can infiltrate through the software supply chain—like slipping counterfeit parts into an assembly line. According to the 2024\nSonatype State of the Software Supply Chain report\n, attackers are infiltrating open-source ecosystems at an alarming rate, with over 512,847 malicious packages detected last year alone—a 156% increase from the previous year. Traditional security tools and processes often miss these threats, leaving organizations unprepared.\nOne major example in 2024 was a year-long supply chain attack uncovered in the Python Package Index (PyPI). Attackers uploaded malicious packages disguised as legitimate AI chatbot tools, hoping to trick developers into integrating them into their projects. These packages contained harmful code designed to steal sensitive data and execute remote commands on infected systems. Because PyPI is widely used across various industries, this attack had the potential to compromise thousands of applications before security researchers at\nKaspersky\ndetected and reported the malicious activity. This incident highlights how attackers are increasingly exploiting trusted repositories to distribute malware, reinforcing the need for additional in-depth measures when evaluating software.\nA Hands-On Approach to Risk Assessment: Product Security Testing\nOrganizations need a structured and repeatable way to evaluate software and hardware risks before introducing them into their environments. This process, known as Product Security Testing (PST)\n,\nis about answering key questions:\nWhat risks does this product introduce to my network?\nShould we use this product, or is there a safer alternative?\nIf we use it, what mitigations should be put in place to minimize risk?\nPST isn't just about scanning for vulnerabilities—it's about understanding how a product behaves in your specific environment and determining its overall risk impact. Given the vast number of third-party components used in modern IT, it's unrealistic to scrutinize every software package equally. Instead, security teams should prioritize their efforts based on business impact and attack surface exposure. High-privilege applications that frequently communicate with external services should undergo product security testing, while lower-risk applications can be assessed through automated or less resource-intensive methods. Whether done before deployment or as a retrospective analysis, a structured approach to PST ensures that organizations focus on securing the most critical assets first while maintaining overall system integrity.\nLearning to Think Red, Act Blue\nThe\nSANS SEC568 course\nis designed to build practical skills in PST. It focuses on black-box testing, a method that simulates real-world conditions where the source code isn't available. This makes it highly applicable for evaluating third-party products that organizations don't have direct control over. The course follows the principle of Think Red, Act Blue—by learning offensive tactics, organizations can better defend against them.\nWhile Product Security Testing will never prevent a breach of a third party out of your control, it is necessary to allow organizations to make informed decisions about their defensive posture and response strategy. Many organizations follow a standard process of identifying a need, selecting a product, and deploying it without a deep security evaluation. This lack of scrutiny can leave them scrambling to determine the impact when a supply chain attack occurs.\nBy incorporating PST into the decision-making process, security teams gain critical documentation, including dependency mapping, threat models, and specific mitigations tailored to the technology in use. This proactive approach reduces uncertainty, allowing for faster and more effective responses when vulnerabilities emerge. Rather than relying solely on broad industry mitigations, organizations with PST documentation can implement targeted security controls that minimize risk before a breach even happens.\nWho leverages Product Security Testing?\nRegardless of job title, having a strong foundation in product security testing leads to better security posture and preparedness within the entire organization. While the obvious fit is product security testing teams can leverage these methodologies to evaluate third-party software as well as their own in-house products - product security testing isn't limited to one specific role. This is a valuable skill set that enhances various positions within an organization. Security auditors can use PST to tailor evaluations to an organization's unique risks and compliance needs, while penetration testers can go beyond simple vulnerability scans to analyze unknown protocols and proprietary software. Application developers benefit by understanding how attackers exploit security flaws, helping them write more secure code from the start, while SOC analysts can use these skills to detect and mitigate threats introduced by new software and hardware. Even decision-makers gain insights from PST, as it helps them make informed choices about risk, security investments, and mitigation strategies. It's important to remember that it's impossible to detect, mitigate, exploit, or develop what we don't understand.\nJoin Us in\nOrlando: April 13-18, 2024\nTo gain hands-on experience in product security testing, consider attending SEC568 in Orlando from April 13-18, 2024. This training will provide the technical foundation needed to assess software and hardware security effectively. Just like taking a car for a test drive before purchasing, applying a structured approach to product security testing allows organizations to fully understand potential risks before deployment. By following a repeatable methodology, security teams can reduce risks and be better prepared for future threats.\nNote:\nThis article was expertly written and contributed by Douglas McKee, the Executive Director of Threat Research at SonicWall, as well as the lead author and instructor for SANS SEC568.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Threat Actors Exploit ClickFix to Deploy NetSupport RAT in Latest Cyber Attacks",
        "Link": "https://thehackernews.com/2025/02/threat-actors-exploit-clickfix-to.html",
        "Summary": "Threat actors have observed the increasingly common ClickFix technique to deliver a remote access trojan named NetSupport RAT since early January 2025.\nNetSupport RAT, typically propagated via bogus websites and fake browser updates, grants attackers full control over the victim's host, allowing them to monitor the device's screen in real-time, control the keyboard and mouse, upload and download",
        "Date": "2025-02-11",
        "Content": "Threat actors have observed the increasingly common\nClickFix technique\nto deliver a remote access trojan named\nNetSupport RAT\nsince early January 2025.\nNetSupport RAT, typically propagated via bogus websites and fake browser updates, grants attackers full control over the victim's host, allowing them to monitor the device's screen in real-time, control the keyboard and mouse, upload and download files, and launch and execute malicious commands.\nOriginally known as NetSupport Manager, it was developed as a legitimate remote IT support program, but has since been repurposed by malicious actors to target organizations and capture sensitive information, including screenshots, audio, video, and files.\n\"ClickFix is a technique used by threat actors to inject a fake CAPTCHA webpage on compromised websites, instructing users to follow certain steps to copy and execute malicious PowerShell commands on their host to download and run malware payloads,\" eSentire\nsaid\nin an analysis.\nIn the attack chains identified by the cybersecurity company, the PowerShell command is used to download and execute the NetSupport RAT client from a remote server that hosts the malicious components in the form of PNG image files.\nThe development comes as the ClickFix approach is also being used to\npropagate\nan updated version of the Lumma Stealer malware that uses the ChaCha20 cipher for decrypting a configuration file containing the list of command-and-control (C2) servers.\n\"These changes provide insight into the evasive tactics employed by the developer(s) who are actively working to circumvent current extraction and analysis tools,\" eSentire\nsaid\n.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "FBI, Europol, and NCA Take Down 8Base Ransomware Data Leak and Negotiation Sites",
        "Link": "https://thehackernews.com/2025/02/8base-ransomware-data-leak-sites-seized.html",
        "Summary": "Source: The Nation\nA coordinated law enforcement operation has taken down the dark web data leak and negotiation sites associated with the 8Base ransomware gang.\nVisitors to the data leak site are now greeted with a seizure banner that says: \"This hidden site and the criminal content have been seized by the Bavarian State Criminal Police Office on behalf of the Office of the Public Prosecutor",
        "Date": "2025-02-11",
        "Content": "Source: The Nation\nA coordinated law enforcement operation has taken down the dark web data leak and negotiation sites associated with the 8Base ransomware gang.\nVisitors to the data leak site are now greeted with a seizure banner that says: \"This hidden site and the criminal content have been seized by the Bavarian State Criminal Police Office on behalf of the Office of the Public Prosecutor General in Bamberg.\"\nThe takedown involved the U.K. National Crime Agency (NCA), the U.S. Federal Bureau of Investigation (FBI), Europol, as well as agencies from Bavaria, Belgium, Czechia, France, Germany, Japan, Romania, Spain, Switzerland, and Thailand.\nThai media reports have\nrevealed\nthat\nfour European nationals\n– two men and two women – were arrested across four different locations on Monday as part of an effort codenamed Operation Phobos Aetor. The identities of the suspects were not disclosed.\nAuthorities are said to have seized more than 40 pieces of evidence, including mobile phones, laptops, and digital wallets.\nThey are alleged to be linked to the deployment of Phobos ransomware against 17 companies located in Switzerland between April 2023 and October 2024. Furthermore, the group has been accused of earning $16 million through attacks that claimed over 1,000 victims across the world.\n8Base, which emerged as a major double extortion player in 2023, has been previously found\nincorporating\nPhobos ransomware artifacts into their financially motivated cyber attacks, with research from VMware\nuncovering\na Phobos sample using a \".8base\" file extension on encrypted files.\nOverlaps have also been identified between 8Base and RansomHouse, particularly when it comes to their ransom notes and dark web infrastructure.\nThe latest development comes in the aftermath of a series of high-profile disruptions associated with\nHive\n,\nLockBit\n, and\nBlackCat\nin recent years. Late last year, Evgenii Ptitsyn, a 42-year-old Russian national believed to be the administrator of the Phobos ransomware, was\nextradited\nto the U.S.\nUpdate\nEuropol, in a press statement, said the four arrested individuals are all Russian nationals who are alleged to have deployed a Phobos ransomware variant to extort victims across Europe and beyond. In addition, the operation led to the disruption of more than 100 servers linked to the cybercrime network.\n\"Its Ransomware-as-a-Service (RaaS) model has made it particularly accessible to a range of criminal actors, from individual affiliates to structured criminal groups such as 8Base,\" the agency\nsaid\n. \"The adaptability of this framework has allowed attackers to customize their ransomware campaigns with minimal technical expertise, further fuelling its widespread use.\"\nPer Europol, 8Base leveraged the foundations of Phobos to deploy its own variant against targets. It described the group as \"particularly aggressive in its double extortion tactics,\" encrypting victims' data and threatening to publish stolen information unless a payment was made.\nIn a coordinated action, the U.S. Department of Justice (DoJ) unsealed criminal charges against Roman Berezhnoy, 33, and Egor Nikolaevich Glebov, 39, for allegedly operating a cybercrime group that used Phobos to victimize more than 1,000 public and private entities in the country and across the world. Phobos appeared on the scene in October 2018.\n\"Berezhnoy, Glebov, and others operated a ransomware affiliate organization, including under the names '8Base' and 'Affiliate 2803,' among others, that victimized public and private entities through the deployment of Phobos ransomware,\" the DoJ\nsaid\n.\nBerezhnoy and Glebov have been charged with one count of wire fraud conspiracy, one count of wire fraud, one count of conspiracy to commit computer fraud and abuse, three counts of causing intentional damage to protected computers, three counts of extortion in relation to damage to a protected computer, one count of transmitting a threat to impair the confidentiality of stolen data, and one count of unauthorized access and obtaining information from a protected computer.\nIf convicted on all counts, Berezhnoy and Glebov face a maximum penalty of 20 years in prison on each wire fraud-related count; 10 years in prison on each computer damage count; and five years in prison on each of the other counts.\nThe takedown also coincides with\nAustralia\n,\nthe U.K.\n, and\nthe U.S.\njointly announcing sanctions against Zservers, a Russia-based bulletproof hosting (\nBPH\n) provider, for its role in facilitating ransomware attacks, primarily those conducted by the LockBit RaaS group. The action marks the first time Australia has issued cyber sanctions against an entity.\nSanctions have also been imposed on its U.K. front company XHOST Internet Solutions LP, and six of the service's administrators and employees – Aleksandr Sergeyevich Bolshakov, Alexander Igorevich Mishin, Ilya Sidorov, Dimitriy Bolshakov, Igor Odintsov, and Vladimir Ananev in connection with the criminal operation.\n\"Zservers has provided BPH services, including leasing numerous IP addresses, to LockBit affiliates, who have used the hosting services to coordinate and launch ransomware attacks,\" the U.S. Department of the Treasury's Office of Foreign Assets Control (OFAC) said in a statement, adding it was advertised as a way to evade law enforcement scrutiny and takedowns.\n(The story was updated after publication to include additional information from Europol and the U.S. Department of Justice.)\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Windows 10 KB5051974 update force installs new Microsoft Outlook app",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb5051974-update-force-installs-new-microsoft-outlook-app/",
        "Summary": "Microsoft has released the KB5051974 cumulative update for Windows 10 22H2 and Windows 10 21H2, which automatically installs the new Outlook for Windows app and fixes a memory leak bug. [...]",
        "Date": "2025-02-11",
        "Content": "Microsoft has released the KB5051974 cumulative update for Windows 10 22H2 and Windows 10 21H2, which automatically installs the new Outlook for Windows app and fixes a memory leak bug.\nThe Windows 10 KB5051974 update is mandatory as it contains\nMicrosoft's January 2025 Patch Tuesday\nsecurity updates.\nWindows users can install this update by going into\nSettings\n, clicking on\nWindows Update,\nand manually performing a\n'Check for Updates\n.'\nHowever, as this update is mandatory, it will automatically start installing in Windows once you check for updates. To make this more manageable, you can schedule a time when your computer is restarted to finish the installation.\nWindows 10 KB5051974 cumulative update preview\nSource: BleepingComputer\nAfter installing this update, Windows 10 22H2 will be updated to build 19045.5487 and Windows 10 21H2 will be build 19044.5487.\nWindows 10 users can also manually download and install the KB5051974 update from the\nMicrosoft Update Catalog\n.\nWhat's new in Windows 10 KB5051974\nThe KB5051974 update includes fixes for numerous bugs in Windows 10, including one that prevented Capture Service and Snipping Tool from responding and a memory leak bug.\nThis update includes a total of eleven fixes or changes, with the highlighted ones listed below:\n[Mail]\nNew!\nYou now have the new Outlook for Windows app. A new app icon appears in the Apps section on the Start menu, near classic Outlook. There are no changes to any settings or defaults. If you are an IT admin, learn how to manage this update at\nControl the installation and use of new Outlook\n.\n[Screen capture]\nFixed: The Capture Service and Snipping Tool stop responding. This occurs when you press the Windows logo key+Shift+S several times while the Narrator is on.\n[Chinese Pinyin input method editor (IME)]\nBing will stop giving automatic suggestions in the search box for search engine sites like Baidu. To get manual suggestions, use Ctrl+Tab or the chevron button (>).\n[Digital/Analog converter (DAC) (known issue)]\nFixed: You might experience issues with USB audio devices. This is more likely when you use a DAC audio driver based on\nUSB 1.0\n. USB audio devices might stop working, which stops playback.\n[USB audio device drivers]\nFixed: The code 10 error message, \"This device cannot start,\" appears. This occurs when you connect to certain external audio management devices.\n[USB cameras]\nFixed: Your device does not recognize the camera is on. This issue occurs after you install the January 2025 security update.\n[Virtual memory]\nFixed: An issue depletes virtual memory, which might cause some apps to fail.\nMicrosoft says that there are three known issues, all of which were introduced in previous updates.\nAfter installing the update,\nOpenSSH connections on Windows may no longer work\nas the SSHD service fails to start automatically. This can be fixed by manually starting the SSHD service.\n\"Following the installation of the October 2024 security update, some customers report that the OpenSSH (Open Secure Shell) service fails to start, preventing SSH connections. The service fails with no detailed logging, and manual intervention is required to run the sshd.exe process,\" explains Microsoft.\nMicrosoft also says that the January 2025 and later Windows updates may fail if Citrix Session Recording Agent (SRA) version 2411 is installed on the device.\n\"As a workaround, stop the Session Recording Monitoring service, install the Microsoft security update, and enable the Session Recording Monitoring service,\" explains a\nCitrix support bulletin\n.\nDevices with certain Citrix components installed might be unable to complete the January 2025 Windows security update installation. This issue was observed on devices with\nCitrix Session Recording Agent (SRA)\nversion 2411. The 2411 version of this application was released in December 2024.\nFinally, the Windows EventViewer may incorrectly display an Event 7023 error about SgrmBroker.exe, stating, \"The System Guard Runtime Monitor Broker service terminated with the following error: %%3489660935.\"\nMicrosoft says that SgrmBroker.exe currently serves no purpose and that this error does not impact any functionality on the device and will be fixed in future updates.\nA complete list of fixes can be found in the\nKB5051974 support bulletin\nand last month's\nKB5050081 preview update bulletin\n.\nRelated Articles:\nWindows 10 KB5049981 update released with new BYOVD blocklist\nWindows 10 KB5048652 update fixes new motherboard activation bug\nMicrosoft February 2025 Patch Tuesday fixes 4 zero-days, 55 flaws\nMicrosoft January 2025 Patch Tuesday fixes 8 zero-days, 159 flaws\nWindows 11 KB5050009 & KB5050021  cumulative updates released"
    },
    {
        "Title": "Microsoft February 2025 Patch Tuesday fixes 4 zero-days, 55 flaws",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-february-2025-patch-tuesday-fixes-4-zero-days-55-flaws/",
        "Summary": "Today is Microsoft's February 2025 Patch Tuesday, which includes security updates for 55 flaws, including four zero-day vulnerabilities, with two actively exploited in attacks. [...]",
        "Date": "2025-02-11",
        "Content": "Today is Microsoft's February 2025 Patch Tuesday, which includes security updates for 55 flaws, including four zero-day vulnerabilities, with two actively exploited in attacks.\nThis Patch Tuesday also fixes three \"Critical\" vulnerabilities, all remote code execution vulnerabilities.\nThe number of bugs in each vulnerability category is listed below:\n19 Elevation of Privilege Vulnerabilities\n2 Security Feature Bypass Vulnerabilities\n22 Remote Code Execution Vulnerabilities\n1 Information Disclosure Vulnerabilities\n9 Denial of Service Vulnerabilities\n3 Spoofing Vulnerabilities\nThe above numbers do not include a critical Microsoft Dynamics 365 Sales elevation of privileges flaw and 10 Microsoft Edge vulnerabilities fixed on February 6.\nTo learn more about the non-security updates released today, you can review our dedicated articles on the\nWindows 11 KB5051987 & KB5051989 cumulative updates\nand the\nWindows 10 KB5051974 update\n.\nTwo actively exploited zero-day disclosed\nThis month's Patch Tuesday fixes two actively exploited and two publicly exposed zero-day vulnerabilities.\nMicrosoft classifies a zero-day flaw as one that is publicly disclosed or actively exploited while no official fix is available.\nThe actively exploited zero-day vulnerability in today's updates are:\nCVE-2025-21391\n- Windows Storage Elevation of Privilege Vulnerability\nMicrosoft has fixed an actively exploited elevation of privileges vulnerability that can be used to delete files.\n\"An attacker would only be able to delete targeted files on a system,\" reads Microsoft's advisory.\n\"This vulnerability does not allow disclosure of any confidential information, but could allow an attacker to delete data that could include data that results in the service being unavailable,\" continued Microsoft.\nNo information has been released about how this flaw was exploited in attacks and who disclosed it.\nCVE-2025-21418\n- Windows Ancillary Function Driver for WinSock Elevation of Privilege Vulnerability\nThe second actively exploited vulnerability allows threat actors to gain SYSTEM privileges in Windows.\nIt is unknown how it was used in attacks, and Microsoft says this flaw was disclosed anonymously.\nThe publicly disclosed zero-days are:\nCVE-2025-21194\n- Microsoft Surface Security Feature Bypass Vulnerability\nMicrosoft says that this flaw is a hypervisor vulnerability that allows attacks to bypass UEFI and compromise the secure kernel.\n\"This Hypervisor vulnerability relates to Virtual Machines within a Unified Extensible Firmware Interface (UEFI) host machine,\" explains Microsoft's advisory.\n\"On some specific hardware it might be possible to bypass the UEFI, which could lead to the compromise of the hypervisor and the secure kernel.\"\nMicrosoft says that Francisco Falcón and Iván Arce of Quarkslab discovered the vulnerability.\nWhile Microsoft did not share many details about the flaw, it is likely connected to the\nPixieFail flaws\ndisclosed by the researchers last month.\nPixieFail is a set of nine vulnerabilities that impact the IPv6 network protocol stack of Tianocore's EDK II, which is used by Microsoft Surface and the company's hypervisor products.\nCVE-2025-21377\n- NTLM Hash Disclosure Spoofing Vulnerability\nMicrosoft fixed a publicly disclosed bug that exposes a Window user's NTLM hashes, allowing a remote attacker to potentially log in as the user.\n\"Minimal interaction with a malicious file by a user such as selecting (single-click), inspecting (right-click), or performing an action other than opening or executing the file could trigger this vulnerability.\" explains Microsoft's advisory.\nWhile Microsoft has not shared many details about the flaw, it likely acts like other NTLM hash disclosure flaws, where simply interacting with a file rather than opening it could cause Windows to remotely connect to a remote share. When doing so, an NTLM negotiation passes the user's NTLM hash to the remote server, which the attacker can collect.\nThese NTLM hashes can then be cracked to get the plain-text password or used in\npass-the-hash attacks\n.\nMicrosoft says this flaw was discovered by Owen Cheung, Ivan Sheung, and Vincent Yau with Cathay Pacific, Yorick Koster of Securify B.V., and Blaz Satler with 0patch by ACROS Security.\nRecent updates from other companies\nOther vendors who released updates or advisories in February 2025 include:\nAdobe\nreleased security updates\nfor numerous products, including Adobe Photoshop, Substance3D, Illustrator, and Animate.\n​AMD\nreleased mitigations and firmware updates\nto address a vulnerability that can be exploited to load malicious CPU microcode.\nApple\nreleased a security update\nfor a zero-day exploited in 'extremely sophisticated' attacks.\nCisco\nreleased security updates\nfor multiple products, including Cisco IOS, ISE, NX-OS, and Identity Services.\nGoogle\nfixed an actively exploited zero-day flaw\nin Android Kernel's USB Video Class driver.\nIvanti\nreleased security updates\nfor Connect Secure, Neurons for MDM, and Cloud Service Application.\nFortinet\nreleased security updates\nfor numerous products, including FortiManager, FortiOS, FortiAnalyzer, and FortiSwitchManager.\nNetgear\nfixed two critical vulnerabilities\naffecting multiple WiFi router models.\nSAP\nreleases security updates\nfor multiple products.\nThe February 2025 Patch Tuesday Security Updates\nBelow is the complete list of resolved vulnerabilities in the February 2025 Patch Tuesday updates.\nTo access the full description of each vulnerability and the systems it affects, you can view the\nfull report here\n.\nTag\nCVE ID\nCVE Title\nSeverity\nActive Directory Domain Services\nCVE-2025-21351\nWindows Active Directory Domain Services API Denial of Service Vulnerability\nImportant\nAzure Network Watcher\nCVE-2025-21188\nAzure Network Watcher VM Extension Elevation of Privilege Vulnerability\nImportant\nMicrosoft AutoUpdate (MAU)\nCVE-2025-24036\nMicrosoft AutoUpdate (MAU) Elevation of Privilege Vulnerability\nImportant\nMicrosoft Digest Authentication\nCVE-2025-21368\nMicrosoft Digest Authentication Remote Code Execution Vulnerability\nImportant\nMicrosoft Digest Authentication\nCVE-2025-21369\nMicrosoft Digest Authentication Remote Code Execution Vulnerability\nImportant\nMicrosoft Dynamics 365 Sales\nCVE-2025-21177\nMicrosoft Dynamics 365 Sales Elevation of Privilege Vulnerability\nCritical\nMicrosoft Edge (Chromium-based)\nCVE-2025-21267\nMicrosoft Edge (Chromium-based) Spoofing Vulnerability\nLow\nMicrosoft Edge (Chromium-based)\nCVE-2025-21279\nMicrosoft Edge (Chromium-based) Remote Code Execution Vulnerability\nImportant\nMicrosoft Edge (Chromium-based)\nCVE-2025-21342\nMicrosoft Edge (Chromium-based) Remote Code Execution Vulnerability\nImportant\nMicrosoft Edge (Chromium-based)\nCVE-2025-0445\nChromium: CVE-2025-0445 Use after free in V8\nUnknown\nMicrosoft Edge (Chromium-based)\nCVE-2025-0451\nChromium: CVE-2025-0451 Inappropriate implementation in Extensions API\nUnknown\nMicrosoft Edge (Chromium-based)\nCVE-2025-0444\nChromium: CVE-2025-0444 Use after free in Skia\nUnknown\nMicrosoft Edge (Chromium-based)\nCVE-2025-21283\nMicrosoft Edge (Chromium-based) Remote Code Execution Vulnerability\nImportant\nMicrosoft Edge (Chromium-based)\nCVE-2025-21404\nMicrosoft Edge (Chromium-based) Spoofing Vulnerability\nLow\nMicrosoft Edge (Chromium-based)\nCVE-2025-21408\nMicrosoft Edge (Chromium-based) Remote Code Execution Vulnerability\nImportant\nMicrosoft Edge for iOS and Android\nCVE-2025-21253\nMicrosoft Edge for IOS and Android Spoofing Vulnerability\nModerate\nMicrosoft High Performance Compute Pack (HPC) Linux Node Agent\nCVE-2025-21198\nMicrosoft High Performance Compute (HPC) Pack Remote Code Execution Vulnerability\nImportant\nMicrosoft Office\nCVE-2025-21392\nMicrosoft Office Remote Code Execution Vulnerability\nImportant\nMicrosoft Office\nCVE-2025-21397\nMicrosoft Office Remote Code Execution Vulnerability\nImportant\nMicrosoft Office Excel\nCVE-2025-21381\nMicrosoft Excel Remote Code Execution Vulnerability\nCritical\nMicrosoft Office Excel\nCVE-2025-21394\nMicrosoft Excel Remote Code Execution Vulnerability\nImportant\nMicrosoft Office Excel\nCVE-2025-21383\nMicrosoft Excel Information Disclosure Vulnerability\nImportant\nMicrosoft Office Excel\nCVE-2025-21390\nMicrosoft Excel Remote Code Execution Vulnerability\nImportant\nMicrosoft Office Excel\nCVE-2025-21386\nMicrosoft Excel Remote Code Execution Vulnerability\nImportant\nMicrosoft Office Excel\nCVE-2025-21387\nMicrosoft Excel Remote Code Execution Vulnerability\nImportant\nMicrosoft Office SharePoint\nCVE-2025-21400\nMicrosoft SharePoint Server Remote Code Execution Vulnerability\nImportant\nMicrosoft PC Manager\nCVE-2025-21322\nMicrosoft PC Manager Elevation of Privilege Vulnerability\nImportant\nMicrosoft Streaming Service\nCVE-2025-21375\nKernel Streaming WOW Thunk Service Driver Elevation of Privilege Vulnerability\nImportant\nMicrosoft Surface\nCVE-2025-21194\nMicrosoft Surface Security Feature Bypass Vulnerability\nImportant\nMicrosoft Windows\nCVE-2025-21337\nWindows NTFS Elevation of Privilege Vulnerability\nImportant\nOpen Source Software\nCVE-2023-32002\nHackerOne: CVE-2023-32002 Node.js `Module._load()` policy Remote Code Execution Vulnerability\nImportant\nOutlook for Android\nCVE-2025-21259\nMicrosoft Outlook Spoofing Vulnerability\nImportant\nVisual Studio\nCVE-2025-21206\nVisual Studio Installer Elevation of Privilege Vulnerability\nImportant\nVisual Studio Code\nCVE-2025-24039\nVisual Studio Code Elevation of Privilege Vulnerability\nImportant\nVisual Studio Code\nCVE-2025-24042\nVisual Studio Code JS Debug Extension Elevation of Privilege Vulnerability\nImportant\nWindows Ancillary Function Driver for WinSock\nCVE-2025-21418\nWindows Ancillary Function Driver for WinSock Elevation of Privilege Vulnerability\nImportant\nWindows CoreMessaging\nCVE-2025-21358\nWindows Core Messaging Elevation of Privileges Vulnerability\nImportant\nWindows CoreMessaging\nCVE-2025-21184\nWindows Core Messaging Elevation of Privileges Vulnerability\nImportant\nWindows DHCP Client\nCVE-2025-21179\nDHCP Client Service Denial of Service Vulnerability\nImportant\nWindows DHCP Server\nCVE-2025-21379\nDHCP Client Service Remote Code Execution Vulnerability\nCritical\nWindows Disk Cleanup Tool\nCVE-2025-21420\nWindows Disk Cleanup Tool Elevation of Privilege Vulnerability\nImportant\nWindows DWM Core Library\nCVE-2025-21414\nWindows Core Messaging Elevation of Privileges Vulnerability\nImportant\nWindows Installer\nCVE-2025-21373\nWindows Installer Elevation of Privilege Vulnerability\nImportant\nWindows Internet Connection Sharing (ICS)\nCVE-2025-21216\nInternet Connection Sharing (ICS) Denial of Service Vulnerability\nImportant\nWindows Internet Connection Sharing (ICS)\nCVE-2025-21212\nInternet Connection Sharing (ICS) Denial of Service Vulnerability\nImportant\nWindows Internet Connection Sharing (ICS)\nCVE-2025-21352\nInternet Connection Sharing (ICS) Denial of Service Vulnerability\nImportant\nWindows Internet Connection Sharing (ICS)\nCVE-2025-21254\nInternet Connection Sharing (ICS) Denial of Service Vulnerability\nImportant\nWindows Kerberos\nCVE-2025-21350\nWindows Kerberos Denial of Service Vulnerability\nImportant\nWindows Kernel\nCVE-2025-21359\nWindows Kernel Security Feature Bypass Vulnerability\nImportant\nWindows LDAP - Lightweight Directory Access Protocol\nCVE-2025-21376\nWindows Lightweight Directory Access Protocol (LDAP) Remote Code Execution Vulnerability\nCritical\nWindows Message Queuing\nCVE-2025-21181\nMicrosoft Message Queuing (MSMQ) Denial of Service Vulnerability\nImportant\nWindows NTLM\nCVE-2025-21377\nNTLM Hash Disclosure Spoofing Vulnerability\nImportant\nWindows Remote Desktop Services\nCVE-2025-21349\nWindows Remote Desktop Configuration Service Tampering Vulnerability\nImportant\nWindows Resilient File System (ReFS) Deduplication Service\nCVE-2025-21183\nWindows Resilient File System (ReFS) Deduplication Service Elevation of Privilege Vulnerability\nImportant\nWindows Resilient File System (ReFS) Deduplication Service\nCVE-2025-21182\nWindows Resilient File System (ReFS) Deduplication Service Elevation of Privilege Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-21410\nWindows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-21208\nWindows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability\nImportant\nWindows Setup Files Cleanup\nCVE-2025-21419\nWindows Setup Files Cleanup Elevation of Privilege Vulnerability\nImportant\nWindows Storage\nCVE-2025-21391\nWindows Storage Elevation of Privilege Vulnerability\nImportant\nWindows Telephony Server\nCVE-2025-21201\nWindows Telephony Server Remote Code Execution Vulnerability\nImportant\nWindows Telephony Service\nCVE-2025-21407\nWindows Telephony Service Remote Code Execution Vulnerability\nImportant\nWindows Telephony Service\nCVE-2025-21406\nWindows Telephony Service Remote Code Execution Vulnerability\nImportant\nWindows Telephony Service\nCVE-2025-21200\nWindows Telephony Service Remote Code Execution Vulnerability\nImportant\nWindows Telephony Service\nCVE-2025-21371\nWindows Telephony Service Remote Code Execution Vulnerability\nImportant\nWindows Telephony Service\nCVE-2025-21190\nWindows Telephony Service Remote Code Execution Vulnerability\nImportant\nWindows Update Stack\nCVE-2025-21347\nWindows Deployment Services Denial of Service Vulnerability\nImportant\nWindows Win32 Kernel Subsystem\nCVE-2025-21367\nWindows Win32 Kernel Subsystem Elevation of Privilege Vulnerability\nImportant\nRelated Articles:\nMicrosoft January 2025 Patch Tuesday fixes 8 zero-days, 159 flaws\nWindows 10 KB5051974 update force installs new Microsoft Outlook app\nWindows 10 KB5049981 update released with new BYOVD blocklist\nWindows 10 KB5048652 update fixes new motherboard activation bug\nMicrosoft shares workaround for Windows security update issues"
    },
    {
        "Title": "Fortinet discloses second firewall auth bypass patched in January",
        "Link": "https://www.bleepingcomputer.com/news/security/fortinet-discloses-second-firewall-auth-bypass-patched-in-january/",
        "Summary": "Fortinet has disclosed a second authentication bypass vulnerability that was fixed as part of a January 2025 update for FortiOS and FortiProxy devices. [...]",
        "Date": "2025-02-11",
        "Content": "Update 2/11/25 07:32 PM ET:\nAfter publishing our story, Fortinet has informed us that the new CVE-2025-24472 flaw added to FG-IR-24-535 today is not a zero-day and was already fixed in January.\nFurthermore, even though\ntoday's updated advisory\nindicates that both flaws were exploited in attacks and even includes a workaround for the new CSF proxy requests exploitation pathway, Fortinet says that only CVE-2024-55591 was exploited.\nFortinet told BleepingComputer that if a customer previously upgraded based on the guidance in FG-IR-24-535 / CVE-2024-55591, then they are already protected against the newly disclosed vulnerability.\nThe title of our story has been updated to reflect this new information, and our original article is below.\nFortinet warned today that attackers are exploiting another now-patched zero-day bug in FortiOS and FortiProxy to hijack Fortinet firewalls and breach enterprise networks.\nSuccessful exploitation of this authentication bypass vulnerability (\nCVE-2025-24472\n) allows remote attackers to gain super-admin privileges by making maliciously crafted CSF proxy requests.\nThe security flaw impacts FortiOS 7.0.0 through 7.0.16, FortiProxy 7.0.0 through 7.0.19, and FortiProxy 7.2.0 through 7.2.12. Fortinet fixed it in FortiOS 7.0.17 or above and FortiProxy 7.0.20/7.2.13 or above.\nFortinet added the bug as a new CVE-ID to a\nsecurity advisory issued last month\ncautioning customers that\nthreat actors\nwere exploiting a zero-day vulnerability in FortiOS and FortiProxy (tracked as\nCVE-2024-55591\n), which affected the same software versions. However, the now-fixed CVE-2024-55591 flaw could be exploited by sending malicious requests to the Node.js websocket module.\nAccording to Fortinet, attackers exploit the two vulnerabilities to generate random admin or local users on affected devices, adding them to new and existing SSL VPN user groups. They have also been seen modifying firewall policies and other configurations and accessing SSLVPN instances with previously established rogue accounts \"to gain a tunnel to the internal network.network.\"\nWhile Fortinet didn't provide additional information on the campaign, cybersecurity company Arctic Wolf\nreleased a report\nwith matching indicators of compromise (IOCs), saying vulnerable Fortinet FortiGate firewalls with Internet-exposed management interfaces have been under attack since at least mid-November.\n\"The campaign involved unauthorized administrative logins on management interfaces of firewalls, creation of new accounts, SSL VPN authentication through those accounts, and various other configuration changes,\" Arctic Wolf Labs said.\n\"While the initial access vector is not definitively confirmed, a zero-day vulnerability is highly probable. Organizations should urgently disable firewall management access on public interfaces as soon as possible.\"\nArctic Wolf Labs also provided this timeline for CVE-2024-55591 mass-exploitation attacks, saying it includes four unique phases:\nVulnerability scanning (November 16, 2024 to November 23, 2024)\nReconnaissance (November 22, 2024 to November 27, 2024)\nSSL VPN configuration (December 4, 2024 to December 7, 2024)\nLateral Movement (December 16, 2024 to December 27, 2024)\n\"Given subtle differences in tradecraft and infrastructure between intrusions, it is possible that multiple individuals or groups may have been involved in this campaign, but jsconsole usage was a common thread across the board,\" it added.\nArctic Wolf Labs added that it notified Fortinet about the attacks on December 12 and received confirmation from the company's Product Security Incident Response Team (PSIRT) five days later that the activity was known and already under investigation.\nFortinet advised admins who can't immediately deploy the security updates to secure vulnerable firewalls to disable the HTTP/HTTPS administrative interface or limit the IP addresses that can reach it via local-in policies as a workaround.\nBleepingComputer reached out to a Fortinet spokesperson for comment but did not hear back by time of publication.\nRelated Articles:\nFortinet warns of auth bypass zero-day exploited to hijack firewalls\n7-Zip MotW bypass exploited in zero-day attacks against Ukraine\nGoogle fixes Android kernel zero-day exploited in attacks\nHackers exploit critical unpatched flaw in Zyxel CPE devices\nApple fixes this year’s first actively exploited zero-day bug"
    },
    {
        "Title": "Windows 11 KB5051987 & KB5051989 cumulative updates released",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5051987-and-kb5051989-cumulative-updates-released/",
        "Summary": "Microsoft has released Windows 11 KB5051987 and KB5051989 cumulative updates for versions 24H2 and 23H2 to fix security vulnerabilities and issues. [...]",
        "Date": "2025-02-11",
        "Content": "Microsoft has released Windows 11\nKB5051987\nand\nKB5051989\ncumulative updates for versions 24H2 and 23H2 to fix security vulnerabilities and issues.\nBoth KB5051987 and KB5051989 are mandatory cumulative updates as they contain the February 2025 Patch Tuesday security updates for vulnerabilities discovered in previous months.\nWindows 11 users can install today's update by going to\nStart\n>\nSettings\n>\nWindows Update\nand clicking on\n'Check for Updates\n.'\nYou can also manually download and install the update from the\nMicrosoft Update Catalog\n.\nWhat's new in the February 2025 Patch Tuesday update\nAfter installing today's security updates, Windows 11 24H2 (\nKB5051987\n) will have its build number changed to Build 26100.3194, and 23H2 (\nKB5051989\n) will be changed to 226x1.4890.\nThis month's Patch Tuesday update has several new features, including a feature that allows you to resume the OneDrive file that you edited on your phone directly from the desktop.\nHere is the full changelog:\n[Taskbar]\nNew!\nThis update improves the previews that show when your cursor hovers over apps on the taskbar. The update also improves their animations.\n[\nWindows Studio Effects\n]\nNew!\nAn icon will appear in the system tray when you use an app that supports\nWindows Studio Effects\n. This only occurs on a device that has a neural processing unit (NPU). Select the icon to open the Studio Effects page in Quick Settings. To view the app that is using the camera, hover over the icon for a tooltip.\n[Fonts]\nNew!\nThis update adds Simsun-ExtG, a new simplified Chinese font. It includes the Biangbiang noodles character. Some apps might not be able to display these new extension characters yet. The font has 9,753 ideographs that support Unicode Extensions\nG\n,\nH\n, and\nI\n. See the list below.\nUnicode range G 30000-3134A (4,939 chars)\nUnicode range H 31350-323AF (4,192 chars)\nUnicode range I 2EBF0-2EE5D (622 chars)\n[File Explorer]\nNew!\nWhen you right-click items in the left pane, the “New Folder” command appears on the context menu.\nNew!\nWindows restores all the previously open tabs in each File Explorer window. This occurs when you enable “Restore previous folder windows at logon.”\nNew!\nWindows turns on specific File Explorer settings for you. This occurs when you enable “Automatically save my restartable apps and restart them when I sign back in.” Go to\nSettings\n>\nAccounts\n>\nSign in options\n.\nFixed: After you do a search, that search might repeat when you don’t want it to.\nFixed: The date and time properties of a file might update after you copy it.\nFixed: Icons on the details pane might not update as you expect when you change a theme. This makes it hard to view the change when you switch between dark and light themes.\nFixed: The search box might lose input focus as you type.\n[High dynamic range (HDR)]\nFixed: The display of some games appears oversaturated. This occurs when you use Auto HDR.\n[Digital/Analog converter (DAC) (known issue)]\nFixed: You might experience issues with USB audio devices. This is more likely when you use a DAC audio driver based on\nUSB 1.0\n. USB audio devices might stop working, which stops playback.\n[USB audio device drivers]\nFixed: The code 10 error message, “This device cannot start” appears. This occurs when you connect to certain external audio management devices.\n[Chinese Pinyin input method editor (IME)]\nBing will stop giving automatic suggestions in the search box for search engine sites, like Baidu. To get manual suggestions, use Ctrl+Tab or the chevron button (>).\n[USB cameras]\nFixed: Your device does not recognize the camera is on. This issue occurs after you install the January 2025 security update.\n[Passkey]\nFixed: This update removes the one-minute timeout when you use a passkey on a phone.\n[Power]\nFixed: Shutdown might be slower on some devices when a controller is connected.\n​​​​​​​\n[Wi-Fi]\nFixed: The Windows Security dialog stops responding. This occurs when you sign in to certain Wi-Fi networks. The same issue might occur for some other options in Settings.\nAt the present, Microsoft is not aware of any new issues.\nYou can check for updates manually to get the changes as soon as possible.\nTo install the updates, open\nStart\n>\nSettings\n>\nWindows Update\nand click on\n'Check for Updates\n.'\nRelated Articles:\nMicrosoft has finally fixed Date & Time bug in Windows 11\nWindows 11 24H2 preview brings new taskbar features\nMicrosoft starts force upgrading Windows 11 22H2, 23H3 devices\nMicrosoft shares workaround for Windows security update issues\nWindows 11 installation media bug causes security update failures"
    },
    {
        "Title": "Russian military hackers deploy malicious Windows activators in Ukraine",
        "Link": "https://www.bleepingcomputer.com/news/security/russian-military-hackers-deploy-malicious-windows-activators-in-ukraine/",
        "Summary": "The Sandworm Russian military cyber-espionage group is targeting Windows users in Ukraine with trojanized Microsoft Key Management Service (KMS) activators and fake Windows updates. [...]",
        "Date": "2025-02-11",
        "Content": "The Sandworm Russian military cyber-espionage group is targeting Windows users in Ukraine with trojanized Microsoft Key Management Service (KMS) activators and fake Windows updates.\nThese attacks likely started in late 2023 and have now been linked by EclecticIQ threat analysts with Sandworm hackers based on overlapping infrastructure, consistent Tactics, Techniques and Procedures (TTPs), and frequently used ProtonMail accounts to register domains used in the attacks.\nThe attackers also used a BACKORDER loader to deploy DarkCrystal RAT (DcRAT) malware (used in\nprevious Sandworm attacks\n) and debug symbols referencing a Russian-language build environment, further reinforcing the researchers' confidence that Russian military hackers were involved.\nEclecticIQ identified seven malware distribution campaigns tied to the same malicious activity cluster, each using similar lures and TTPs. Most recently, on 12 January 2025, the analysts observed the attacks infecting victims with the DcRAT remote access Trojan in data exfiltration attacks using a typo-squatted domain.\nOnce deployed on a victim's device, the fake KMS activation tool displays a fake Windows activation interface, installs the malware loader, and disables Windows Defender in the background before delivering the final RAT payload.\nTrojanized KMS Activator (EclecticIQ)\nThe attacks' end goal is to collect sensitive information from infected computers and send it to attacker-controlled servers. The malware steals keystrokes, browser cookies, browser history, saved credentials, FTP credentials, system information, and screenshots.\nSandworm's use of malicious Windows activators was likely prompted by the vast attack surface opened by the\nheavy use of pirated software in Ukraine\n, which also plagues the country's government sector.\n\"Many users, including businesses and critical entities, have turned to pirated software from untrusted sources, giving adversaries like Sandworm (APT44) a prime opportunity to embed malware in widely used programs,\"\nEclecticIQ said\n.\n\"This tactic enables large-scale espionage, data theft, and network compromise, directly threatening Ukraine's national security, critical infrastructure, and private sector resilience.\"\nSandworm\n(also tracked as UAC-0113, APT44, and Seashell Blizzard) is a hacking group active since at least 2009 and part of the Military Unit 74455 of the Main Intelligence Directorate (GRU), Russia's military intelligence service, primarily focused on carrying out\ndisruptive\nand\ndestructive\nattacks\ntargeting Ukraine\n.\nRelated Articles:\nBadPilot network hacking campaign fuels Russian SandWorm attacks\nMicrosoft February 2025 Patch Tuesday fixes 4 zero-days, 55 flaws\nMicrosoft shares workaround for Windows security update issues\n7-Zip MotW bypass exploited in zero-day attacks against Ukraine\nWindows 11 24H2 now also offered to all eligible Windows 10 PCs"
    },
    {
        "Title": "Gartner: Most Security Leaders Cannot Balance Data Security, Business Goals",
        "Link": "https://www.darkreading.com/cybersecurity-operations/gartner-most-security-leaders-cannot-balance-data-security-business-goals",
        "Summary": "The analyst firm recommends defining security and governance processes while reducing friction for business stakeholders.",
        "Date": "2025-02-11",
        "Content": "TechTarget and Informa Tech’s Digital Business Combine.TechTarget and Informa\nTogether, we power an unparalleled network of 220+ online properties covering 10,000+ granular topics, serving an audience of 50+ million professionals with original, objective content from trusted sources. We help you gain critical insights and make more informed decisions across your business priorities.\nCybersecurity In-Depth: Digging into data about the latest attacks, threats, and trends using charts and tables.\nCybersecurity In-Depth: Digging into data about the latest attacks, threats, and trends using charts and tables.\nThe analyst firm recommends defining security and governance processes while reducing friction for business stakeholders.\nFebruary 11, 2025\nNEWS BRIEF\nOnly 14% of security and risk management leaders can effectively secure organizational data assets while also enabling the data to achieve business objectives, according to Gartner. In a recent survey, Gartner found that 35% of respondents secure data assets and 21% use data to achieve business goals, but only one in seven (14%) could do both effectively.\nThis gap exposes organizations to threats, regulatory penalties, and operational inefficiencies, Gartner said. The analyst firm outlined five recommendations for organizations to address the gap:\nReduce governance-related friction for the business. Use a well-established process to co-create data security polices and standards.\nAlign data-security-related governance efforts. Partner with other internal functions to identify overlaps.\nDelineate non-negotiable security requirements that business groups must meet when handling data security risks.\nDefine high-level guardrails around GenAI-related decisions. Allow business groups to experiment within clearly set parameters.\nWork jointly with data and analytics teams. Secure top-down buy-in on data security initiatives.\nRead more about:\nEdge Editors\nDark Reading\nThe Edge is Dark Reading's home for features, threat data and in-depth perspectives on cybersecurity.\nYou May Also Like\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nRansomware Groups Made Less Money in 2024\nCybercrime Forces Local Law Enforcement to Shift Focus\nHow Are Modern Fraud Groups Using GenAI and Deepfakes?\nInteractive Online Training for Cybersecurity Professionals; Earn CPE Credits\nCopyright © 2025. This website is owned and operated by Informa TechTarget, part of a global network that informs, influences and connects the world’s technology buyers and sellers. All copyright resides with them. Informa PLC’s registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. TechTarget, Inc.’s registered office is 275 Grove St. Newton, MA 02466."
    },
    {
        "Title": "Drata Acquires SafeBase to Strengthen GRC Portfolio",
        "Link": "https://www.darkreading.com/cyber-risk/drata-acquires-safebase-strengthen-grc-portfolio",
        "Summary": "The combined companies will create a seamless ecosystem of trust, governance, risk, and compliance.",
        "Date": "2025-02-11",
        "Content": "TechTarget and Informa Tech’s Digital Business Combine.TechTarget and Informa\nTogether, we power an unparalleled network of 220+ online properties covering 10,000+ granular topics, serving an audience of 50+ million professionals with original, objective content from trusted sources. We help you gain critical insights and make more informed decisions across your business priorities.\nNews, news analysis, and commentary on the latest trends in cybersecurity technology.\nThe combined companies will create a seamless ecosystem of trust, governance, risk, and compliance.\nFebruary 11, 2025\nNEWS BRIEF\nDrata, a trust management platform provider, announced plans on Tuesday to acquire SafeBase to streamline security reviews, strengthen vendor risk management, and maintain customer trust through continuous compliance. The acquisition, valued \"at a quarter of a billion dollars,\" according to a company spokesperson, is expected to close by the end of the month.\nStricter regulatory requirements, increased cloud adoption, and growing dependency on artificial intelligence tools are driving market demand for a \"full stack\" Trust Management platform, Drata said in a statement. The companies have a \"shared vision of being the go-to 'trust layer' between companies,\" Drata said. The goal is to create a comprehensive trust management platform, combining Drata's compliance automation and vendor risk management capabilities with SafeBase's Trust Center Platform, which streamlines security questionnaires.\nSafeBase, founded in 2020 by CEO al Yang and CTO Adar Arnon, helps customers fill out security questionnaires before buying a new piece of software or hardware. These questionnaires can be time-consuming and difficult to complete, especially for more complex products. SafeBase can reduce the time spent on inbound security questionnaires by up to 98%, according to Drata. The company, which raised $33 million in a Series B round last April, counts organizations including CrowdStrike, HubSpot, LinkedIn, T-Mobile, Twilio, and \"one-third of the Cloud 100\" as customers.\nRead more about:\nDark Reading Staff\nDark Reading\nDark Reading is a leading cybersecurity media site.\nYou May Also Like\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nDatabarracks Launches Air Gap Recover\n7AI Streamlines Security Operations With Autonomous AI Agents\nBackline Tackles Enterprise Security Backlogs With AI\nMicrosoft Sets End Date for Defender VPN\nCopyright © 2025. This website is owned and operated by Informa TechTarget, part of a global network that informs, influences and connects the world’s technology buyers and sellers. All copyright resides with them. Informa PLC’s registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. TechTarget, Inc.’s registered office is 275 Grove St. Newton, MA 02466."
    },
    {
        "Title": "Microsoft's February Patch a Lighter Lift Than January's",
        "Link": "https://www.darkreading.com/application-security/microsofts-february-patch-lighter-lift-januarys",
        "Summary": "But there's plenty in it — including two zero-days — that need immediate attention.",
        "Date": "2025-02-11",
        "Content": "TechTarget and Informa Tech’s Digital Business Combine.TechTarget and Informa\nTogether, we power an unparalleled network of 220+ online properties covering 10,000+ granular topics, serving an audience of 50+ million professionals with original, objective content from trusted sources. We help you gain critical insights and make more informed decisions across your business priorities.\nBut there's plenty in it — including two zero-days — that need immediate attention.\nFebruary 11, 2025\nMicrosoft's February security update contains substantially fewer vulnerabilities for admins to address compared to a month ago, but there's still plenty in it that requires immediate attention.\nTopping the list are two zero-day vulnerabilities that attackers are actively exploiting in the wild, two more that are publicly known but not exploited yet, a patch for a zero-day that Microsoft disclosed in December 2024, and an assortment of other common vulnerabilities and exposures (CVEs) with potentially severe consequences for affected organizations.\nIn total, Microsoft released patches for 63 unique CVEs, a far cry from the massive 159 CVEs — including a startling eight zero-days — that the company disclosed in January. Microsoft assessed four of the bugs it disclosed today as being of critical severity. It rated the vast majority of the remaining bugs as important to address but of lesser severity for a variety of factors, including attack complexity and privileges required to exploit the vulnerability.\nThe two actively exploited zero-day bugs in this month's update are CVE-2025-21418 (CVSS score 7.8), an elevation of privilege vulnerability in Windows Ancillary Function Driver for WinSock, and CVE-2025-21391 (CVSS 7.1), another elevation of privilege issue, this time affecting Windows Storage. Per its usual practice, Microsoft's advisories for both bugs offered no details on the exploitation activity. But security researchers had their own take on why organizations need to address the issues ASAP.\nCVE-2025-21418, for instance, only enables a local exploit. That means an attacker or malicious insider must already have access to a target machine, via a phishing attack, malicious document, or other vector, said Kev Breen, senior director, cyber threat research, at Immersive Labs. Even so, such flaws are \"valuable to attackers as they allow them to disable security tooling, dump credentials, or move laterally across the network to exploit the increased access,\" Breen said in an emailed comment. An attacker who successfully exploits the flaw can gain SYSTEM level privileges on the affected system, he said, while recommending that organizations make the vulnerability a top priority to fix.\nWith CVE-2025-21391, the Windows Storage zero-day, the concern is not about the flaw enabling unauthorized data access; rather, the concern is about how attackers could exploit it to affect data integrity and availability. \"Microsoft has outlined that if the attacker successfully exploited this vulnerability, they would only be able to delete targeted files on a system,\" said Natalie Silva, lead cyber security engineer at Immersive Labs, in an emailed comment. \"Microsoft has released patches to mitigate this vulnerability. It's recommended for administrators to apply these immediately.\"\nIn a blog, researchers at Action1 described the flaw as resulting from a weakness in how Windows Storage resolves file paths and follows links. Attackers can leverage the weakness to \"redirect file operations to critical system files or user data, leading to unauthorized deletion,\" the security vendor said.\nBreen recommended that organizations also treat CVE-2025-21377, an NTLM hash disclosure spoofing vulnerability, as a high priority bug that needs immediate attention. When Microsoft originally disclosed the bug in December 2024, it did not have a patch available for it, making the flaw a zero-day threat. \"The vulnerability allows a threat actor to steal the NTLM credentials for a victim by sending them a malicious file,\" Breen said. \"The user doesn't have to open or run the executable but simply viewing the file in Explorer could be enough to trigger the vulnerability.\" Microsoft itself has assessed the vulnerability as something that threat actors are more likely to exploit\nThe other previously disclosed vulnerability in the February patch update is CVE-2025-21194, a security feature bypass vulnerability in Microsoft Surface.\nThe flaws that Microsoft rated as being of critical severity in this latest update are CVE-2025-21379 (CVSS Score 7.1), an RCE in the DHCP client service; CVE-2025-21177 (CVSS Score 8.7), a privilege elevation vulnerability in Microsoft Dynamics 365 Sales; CVE-2025-21381 (CVSS 7.8), a Microsoft Excel RCE; and CVE-2025-21376 (CVSS 8.1), an RCE in Windows LDAP and the only one in the set that Microsoft identified as more vulnerable to exploitation.\nInterestingly, one of the flaws that Microsoft rated as critical (CVE-2025-21177) required affected customers to do nothing, but it is an issue that Microsoft has already addressed on its end. This vulnerability makes use of the newer CAR (customer action required) attribute to identify that there is no customer actions required, says Tyler Reguly, associate director security R&D at Fortra. \"While these information updates are nice, they can bloat the number of updates that admins may be worried about dealing with on a Patch Tuesday,\" Reguly said in an emailed comment. \"One can't help but wonder if these updates should be issued outside of Patch Tuesday since they do not require customer action.\"\nMeanwhile, the only CVE to earn a severity score of 9.0 in this month's update — (CVE-2025-21198) — is an RCE affecting Microsoft High Performance Compute (HPC) Pack. An attacker cannot exploit the flaw unless they have access to the network used to connect to the high-performance cluster, Reguly said. \"This networking requirement should limit the impact of what would otherwise be a more serious vulnerability.\"\nJai Vijayan, Contributing Writer\n\nJai Vijayan is a seasoned technology reporter with over 20 years of experience in IT trade journalism. He was most recently a Senior Editor at Computerworld, where he covered information security and data privacy issues for the publication. Over the course of his 20-year career at Computerworld, Jai also covered a variety of other technology topics, including big data, Hadoop, Internet of Things, e-voting, and data analytics. Prior to Computerworld, Jai covered technology issues for The Economic Times in Bangalore, India. Jai has a Master's degree in Statistics and lives in Naperville, Ill.\nYou May Also Like\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nIndustrial Networks in the Age of Digitalization\nZero-Trust Adoption Driven by Data Protection, Cloud Access Control, and Regulatory Compliance Requirements\nThreat Hunting's Evolution: From On-Premises to the Cloud\nHow Enterprises Secure Their Applications\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\nThe State of Cloud Native Security Report 2024\nDelivering Globally Consistent App Performance to the Hybrid Workforce\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nSocial Engineering: New Tricks, New Threats, New Defenses\nUnderstanding Social Engineering Attacks and What To Do About Them\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nCopyright © 2025. This website is owned and operated by Informa TechTarget, part of a global network that informs, influences and connects the world’s technology buyers and sellers. All copyright resides with them. Informa PLC’s registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. TechTarget, Inc.’s registered office is 275 Grove St. Newton, MA 02466."
    },
    {
        "Title": "Apple Releases Urgent Patch for USB Vulnerability",
        "Link": "https://www.darkreading.com/endpoint-security/apple-releases-urgent-patch-usb-vulnerability",
        "Summary": "The vulnerability could allow a threat actor to disable the security feature on a locked device and gain access to user data.",
        "Date": "2025-02-11",
        "Content": "TechTarget and Informa Tech’s Digital Business Combine.TechTarget and Informa\nTogether, we power an unparalleled network of 220+ online properties covering 10,000+ granular topics, serving an audience of 50+ million professionals with original, objective content from trusted sources. We help you gain critical insights and make more informed decisions across your business priorities.\nThe vulnerability could allow a threat actor to disable the security feature on a locked device and gain access to user data.\nFebruary 11, 2025\nNEWS BRIEF\nApple has released a security update for a vulnerability that the tech giant reports may have been exploited in an \"extremely sophisticated attack.\"\nNot only that, but these attacks targeted specific individuals, though Apple has not provided any further information.\nThe vulnerability, tracked as CVE-2025-24200, could allow for a physical attack to disable USB Restricted Mode on a locked device.\nUSB Restricted Mode is a feature that makes it more difficult for threat actors to unlock a user's phone. When active, a phone's lightning port will only allow charging after the device has been locked for more than an hour, meaning that if an unauthorized actor attempted to connect a locked iPhone to a device to access its data, they could only do so with the necessary credentials.\nThe security update to fix this vulnerability is available for iPhone XS and later, iPad Pro 13-inch, iPad Pro 12.9-inch third generation and later, iPad Pro 11-inch first generation and later, iPad Air third generation and later, iPad seventh generation and later, and iPad mini fifth generation and later.\nUsers of any of these devices should install updates as soon as possible and can check if they're updated to the latest software version by going to their settings.\nThese kinds of vulnerabilities are usually deployed by commercial spyware vendors, such as Pegasus, to target particular individuals, so the average user shouldn't be concerned about being targeted while the details of the attack remain unpublished. However, if they are published, copycat cybercriminals will try to imitate this attack vector, hence the urgency in updating to the latest version.\nRead more about:\nKristina Beek, Associate Editor, Dark Reading\n\nSkilled writer and editor covering cybersecurity for Dark Reading.\nYou May Also Like\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nIndustrial Networks in the Age of Digitalization\nZero-Trust Adoption Driven by Data Protection, Cloud Access Control, and Regulatory Compliance Requirements\nThreat Hunting's Evolution: From On-Premises to the Cloud\nHow Enterprises Secure Their Applications\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\nThe Definitive Guide to Container Security\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nSocial Engineering: New Tricks, New Threats, New Defenses\nUnderstanding Social Engineering Attacks and What To Do About Them\nThe State of Asset Security: Uncovering Alarming Gaps & Unexpected Exposures\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nCopyright © 2025. This website is owned and operated by Informa TechTarget, part of a global network that informs, influences and connects the world’s technology buyers and sellers. All copyright resides with them. Informa PLC’s registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. TechTarget, Inc.’s registered office is 275 Grove St. Newton, MA 02466."
    },
    {
        "Title": "CISA Places Election Security Staffers on Leave",
        "Link": "https://www.darkreading.com/cyber-risk/cisa-election-security-staffers-on-leave",
        "Summary": "The staffers were tasked with building relationships on the ground across the country in local election jurisdictions, teaching election officials tactics on mitigating cyber threats, cyber hygiene, combating misinformation and foreign influence, and more.",
        "Date": "2025-02-11",
        "Content": "TechTarget and Informa Tech’s Digital Business Combine.TechTarget and Informa\nTogether, we power an unparalleled network of 220+ online properties covering 10,000+ granular topics, serving an audience of 50+ million professionals with original, objective content from trusted sources. We help you gain critical insights and make more informed decisions across your business priorities.\nThe staffers were tasked with building relationships on the ground across the country in local election jurisdictions, teaching election officials tactics on mitigating cyber threats, cyber hygiene, combating misinformation and foreign influence, and more.\nFebruary 11, 2025\nNEWS BRIEF\nThe US Cybersecurity and Infrastructure Security Agency (CISA) has placed 17 staffers who worked with local officials to provide training on dealing with election-related cyber threats on leave.\nThis leave is pending an internal review, which will examine the staffers' work to combat cyber threats from foreign governments, and efforts to influence US elections with disinformation campaigns.\nTen of the employees are regional election security specialists, specifically hired to grow field staff and election security knowledge before the 2024 election. All 17 employees were former state or local election officials who were tasked with building relationships across 8,000 different local election jurisdictions across the country.\nThe other staffers that have been placed on leave include current and former members of CISA's Election Security and Resilience team, a leave that is also pending review of the agency's work to combat misinformation and disinformation campaigns. \nSome elected state officials have been particularly outspoken about the benefits that CISA's work has provided in securing election offices and mitigating cyber threats, such as Kentucky Secretary of State Michael Adams, who applauded the \"boots on the ground\" tactics CISA implemented, and the relationships its employees built with county clerks. \n\"They're teaching them and helping them check their physical security and their cyber hygiene, and that's been extremely popular,\" said Adams.\nFor now, the reviews only heighten questions and concerns over the future of the agency in this second Trump administration, especially considering the lack of a replacement for Jen Easterly as CISA director.\nThe first Trump administration went head-to-head with CISA when the agency aimed to counter misinformation about the 2020 election, which then-president Trump and his allies deemed as \"stolen\" without evidence. That included the firing of CISA Director Chris Krebs, who called the 2020 presidential election the most secure election in American history.\nRead more about:\nKristina Beek, Associate Editor, Dark Reading\n\nSkilled writer and editor covering cybersecurity for Dark Reading.\nYou May Also Like\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nIndustrial Networks in the Age of Digitalization\nZero-Trust Adoption Driven by Data Protection, Cloud Access Control, and Regulatory Compliance Requirements\nThreat Hunting's Evolution: From On-Premises to the Cloud\nHow Enterprises Secure Their Applications\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\nThe Definitive Guide to Container Security\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nSocial Engineering: New Tricks, New Threats, New Defenses\nUnderstanding Social Engineering Attacks and What To Do About Them\nThe State of Asset Security: Uncovering Alarming Gaps & Unexpected Exposures\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nCopyright © 2025. This website is owned and operated by Informa TechTarget, part of a global network that informs, influences and connects the world’s technology buyers and sellers. All copyright resides with them. Informa PLC’s registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. TechTarget, Inc.’s registered office is 275 Grove St. Newton, MA 02466."
    },
    {
        "Title": "Data Leaks Happen Most Often in These States — Here's Why",
        "Link": "https://www.darkreading.com/cyber-risk/business-cybersecurity-weakest-states",
        "Summary": "State-led data privacy laws and commitment to enforcement play a major factor in shoring up business data security, an analysis shows.",
        "Date": "2025-02-11",
        "Content": "TechTarget and Informa Tech’s Digital Business Combine.TechTarget and Informa\nTogether, we power an unparalleled network of 220+ online properties covering 10,000+ granular topics, serving an audience of 50+ million professionals with original, objective content from trusted sources. We help you gain critical insights and make more informed decisions across your business priorities.\nState-led data privacy laws and commitment to enforcement play a major factor in shoring up business data security, an analysis shows.\nFebruary 11, 2025\nStates are increasingly embracing data privacy regulation, and Kentucky, Rhode Island, and Tennessee are leading the charge. That has earned them high marks from security experts and landed them at the top of the list of states with the lowest rates of data breaches.\nThese three states are effectively protecting data because of a dual approach of drafting smart data privacy legislation, and then enforcing those laws when appropriate, according to Anonta Khan, who is with DesignRush, the firm that conducted the state data privacy study. Conversely, South Dakota (which got the lowest safety score in the survey, 65.14 out of 100) and Alaska (66.50) rank at the bottom.\n\"Some states, like Kentucky (the highest rated at 99.32) and Rhode Island (97.14), do a good job protecting data,\" Khan says. \"They have fewer cybercrimes and data leaks. Others, like South Dakota and Alaska, have weak laws and a lot of cyber threats.\"\nHowever, she stresses, \"having strong laws doesn't always mean a state is safe.\"\nIt's more nuanced than that.\nIn general, the results of the study suggest that states with less data breach regulation tend to have higher rates of cybercrime overall. That includes Nevada (with a safety score of 77.64), which last year logged 309.7 cyber incidents per 100,000 people, which is more than triple the national average. But there are other contributing factors. Nevada, for instance, has businesses that are attractive targets for hackers, like casinos, Kahn points out.\nRelated:President Trump to Nominate Former RNC Official as National Cyber Director\nGoing further, California (89.3) has strong privacy laws but high cybercrime rates; that's because hackers are consistently targeting the state's tech sector, Khan explains. Delaware is another state with strong privacy laws that is likewise plagued by high rates of data breaches, being the state where most financial lending services are incorporated.\nThe takeaway? \"This shows that laws need to be enforced well,\" Khan says.\nA similar report from the Electronic Privacy Information Center (EPIC) in late January outlined areas where states should, in its view, take a more aggressive position against companies leaking personal data. And state governments appear to be moving in that direction, with a new wave of reform efforts on the horizon.\nDelaware, for example, has kicked off 2025 with its new Data Privacy Protection Act going into effect. Other states, including Iowa, Nebraska, New Hampshire, and New Jersey, are also adding fresh data privacy laws this year and increasing enforcement budgets.\nRelated:Feds Sanction Russian Hosting Provider for Supporting LockBit Attacks\nStates like Texas have also provided a model for aggressive data privacy regulation enforcement. On Jan. 13, Texas Attorney General Ken Paxton filed suit against the Allstate insurance company for what he alleges was an effort to skirt his state's data privacy rules and track citizens' data without consent.\nAs these new laws come online, Khan and others are optimistic that data privacy practices are improving across the US, thanks to re-upped efforts at the state level. Moving forward, these laws will be tailored to fit emerging technology use cases, Khan adds.\n\"Artificial Intelligence (AI) is also becoming a bigger issue,\" Kahn says. \"Colorado's Anti-Discrimination in AI Law starts in 2026, and other states are considering similar rules. Meanwhile, lawsuits over website tracking, biometric data, and online privacy will continue in 2025.\"\nRegardless of state of residence, companies should look at this new era of data privacy protection as an opportunity, according to Ojas Rege, senior vice president and general manager of privacy and data governance at OneTrust.\n\"With 20 distinct US data privacy laws enacted — all with different requirements and obligations — this is a risk most organizations won't want to take,\" Rege says. \"By moving off spreadsheets, bringing in automation, and designating a senior data privacy leader, organizations can proactively comply with the current wave of US state privacy laws. Adopting AI responsibly also requires an effective data privacy program as a starting point and foundation.\"\nRelated:India's Cybercrime Problems Grow as Nation Digitizes\nRead more about:\nBecky Bracken, Senior Editor, Dark Reading\nDark Reading\nBecky Bracken is a veteran multimedia journalist covering cybersecurity for Dark Reading.\nYou May Also Like\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nIndustrial Networks in the Age of Digitalization\nZero-Trust Adoption Driven by Data Protection, Cloud Access Control, and Regulatory Compliance Requirements\nThreat Hunting's Evolution: From On-Premises to the Cloud\nHow Enterprises Secure Their Applications\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\nThe State of Cloud Native Security Report 2024\nDelivering Globally Consistent App Performance to the Hybrid Workforce\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nSocial Engineering: New Tricks, New Threats, New Defenses\nUnderstanding Social Engineering Attacks and What To Do About Them\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nCopyright © 2025. This website is owned and operated by Informa TechTarget, part of a global network that informs, influences and connects the world’s technology buyers and sellers. All copyright resides with them. Informa PLC’s registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. TechTarget, Inc.’s registered office is 275 Grove St. Newton, MA 02466."
    },
    {
        "Title": "Salt Typhoon's Impact on the US &amp; Beyond",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/salt-typhoons-impact-us-beyond",
        "Summary": "Salt Typhoon underscores the urgent need for organizations to rapidly adopt modern security practices to meet evolving threats.",
        "Date": "2025-02-11",
        "Content": "TechTarget and Informa Tech’s Digital Business Combine.TechTarget and Informa\nTogether, we power an unparalleled network of 220+ online properties covering 10,000+ granular topics, serving an audience of 50+ million professionals with original, objective content from trusted sources. We help you gain critical insights and make more informed decisions across your business priorities.\nSalt Typhoon underscores the urgent need for organizations to rapidly adopt modern security practices to meet evolving threats.\nFebruary 11, 2025\nCOMMENTARY\nThe Chinese-linked hacking group Salt Typhoon recently was detected lurking in major US telecommunication systems, exposing nearly every American's communications to Chinese intelligence and security services. \nIn response, on Dec. 4, 2024, the Cybersecurity and Infrastructure Security Agency (CISA) and the FBI issued a joint statement recommending that American citizens and companies adopt end-to-end encrypted communication tools to avoid exposing sensitive information to China. While this advice is prudent to secure communications, hasty adoption of these technologies could result in regulatory noncompliance for organizations in highly regulated industries. These organizations should carefully examine both their security risk and regulatory obligations as they adopt new security solutions.\nSalt Typhoon exploited legacy systems throughout the telecommunications industry that were too old to implement modern cybersecurity practices, with some parts dating back to the late 1970s. Commonly accepted baseline cyber protections like multifactor authentication were not implemented. While the scope of this attack is widespread, including voice calls and SMS messages, US intelligence officials noted that communications within encrypted communication applications such as Apple's iMessage, Meta's WhatsApp, and Signal were not exposed.\nSalt Typhoon marks one of the most sophisticated attacks on US critical infrastructure in history. US officials have concluded that every major telecommunications provider has been implicated. China remains the most active and persistent cyber threat to the United States, and the Salt Typhoon campaign marks one of the most sophisticated attacks on US critical infrastructure in history. \nUS cybersecurity and intelligence officials advised companies and individuals to adopt end-to-end encrypted applications for communications where only the sender and the intended recipients can access the content of the communication. End-to-end encryption works by securing the content of communications using cryptographic keys at both the sender and recipient. The end result is data in transit is secure, rendering the contents of any intercepted or compromised communications indecipherable without the cryptographic key, including by Internet service providers and telecommunications companies — and foreign hackers targeting those entities.\nWhile end-to-end encrypted applications provide obvious advantages for security, many are not designed to comply with the data retention and access requirements imposed upon certain highly regulated industries. \nIn the financial services sector, Securities and Exchange Commission (SEC) Rule 17a-4(b)(4) requires that communications received and sent by a member, broker, or dealer that relate to the business of an organization are to be retained for at least three years. Additionally, Section 802 of the Sarbanes-Oxley Act requires accountants who audit or review financial statements to retain records, which include any communications relevant to the audit or review. \nIn the healthcare sector, Section 164.312(e) of the Health Insurance Portability and Accessibility Act (HIPAA) requires that covered entities implement technical safeguards to prevent unauthorized access to electronic protected health information (ePHI) that is being transmitted over an electronic communications network. Many encrypted communications applications restrict a covered entity's ability to monitor for or audit unauthorized disclosure of ePHI. Additionally, Section 164.350(j) of HIPAA requires that covered entities retain documentation of any communications containing ePHI for at least six years. \nAs Salt Typhoon has revealed, unsecured communications of executives and employees across every sector may be targeted by Chinese intelligence services for exploitation. In this new environment, balancing communications security with compliance can be challenging. To appropriately navigate these risks, organizations in every sector should consider three things.\nFirst, organizations should implement end-to-end encryption for all business communications internally and, to the greatest extent practicable, externally. There are numerous mobile and desktop applications currently available that are designed to serve this purpose. For companies in regulated industries, it is important to also consider regulatory retention, monitoring, and auditing requirements when considering these tools. Such organizations should seek to implement solutions that can ensure appropriate encryption standards for messaging, collaboration, and voice and video calls specifically configured to allow for auditing and data preservation. \nSecond, organizations should implement policies and procedures to guide the use of encrypted communications. For example, many encrypted communication applications allow users to individually establish time-based purge rules for messages. While valuable for information security, this could render an organization non-compliant with data retention and audit requirements. Where possible, such functions should be disabled for individuals and archiving tools should be in place. Additionally, employees should receive regular training on communications security and regulatory compliance.\nThird, a key lesson from Salt Typhoon is that baseline cybersecurity measures still provide meaningful defenses against malicious parties. Cybersecurity measures such as multifactor authentication, use of password managers, encrypting data at rest and in motion, and ensuring that all software and hardware are modern and equipped with the latest updates will give organizations a much stronger cybersecurity posture. \nSalt Typhoon underscores the urgent need for organizations to rapidly adopt modern security practices to meet evolving threats. However, in doing so, organizations need to balance the security imperatives with their regulatory obligations. \nMichael McLaughlin\nCo-Leader, Cybersecurity and Data Privacy Practice Group, Buchanan Ingersoll & Rooney\nMichael McLaughlin is the co-leader of Buchanan Ingersoll & Rooney’s Cybersecurity and Data Privacy practice group. Michael advises clients in matters involving cybersecurity, public policy, and government relations. Michael helps clients navigate the complexities of cybersecurity, data privacy and the related regulatory landscape. Michael is the co-author of Battlefield Cyber: How China and Russia Are Undermining Our Democracy and National Security.\nJillian Cash\nJillian Cash, Associate, Corporate Section, Buchanan Ingersoll & Rooney\nJillian Cash is an associate Buchanan’s Corporate Section, where she focuses on a variety of corporate, transactional, and cybersecurity matters.\nKellen Carleton\nKellen Carleton, Associate, Corporate Finance and Technology Group, Buchanan Ingersoll & Rooney\nKellen Carleton is an associate in Buchanan’s Corporate Finance and Technology group where he focuses on a variety of corporate, transactional, and cybersecurity matters.\nYou May Also Like\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nIndustrial Networks in the Age of Digitalization\nZero-Trust Adoption Driven by Data Protection, Cloud Access Control, and Regulatory Compliance Requirements\nThreat Hunting's Evolution: From On-Premises to the Cloud\nHow Enterprises Secure Their Applications\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\nThe Definitive Guide to Container Security\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nSocial Engineering: New Tricks, New Threats, New Defenses\nUnderstanding Social Engineering Attacks and What To Do About Them\nThe State of Asset Security: Uncovering Alarming Gaps & Unexpected Exposures\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nCopyright © 2025. This website is owned and operated by Informa TechTarget, part of a global network that informs, influences and connects the world’s technology buyers and sellers. All copyright resides with them. Informa PLC’s registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. TechTarget, Inc.’s registered office is 275 Grove St. Newton, MA 02466."
    },
    {
        "Title": "DeepSeek AI Fails Multiple Security Tests, Raising Red Flag for Businesses",
        "Link": "https://www.darkreading.com/cyber-risk/deepseek-fails-multiple-security-tests-business-use",
        "Summary": "The popular generative AI (GenAI) model allows hallucinations, easily avoidable guardrails, susceptibility to jailbreaking and malware creation requests, and more at critically high rates, researchers find.",
        "Date": "2025-02-11",
        "Content": "TechTarget and Informa Tech’s Digital Business Combine.TechTarget and Informa\nTogether, we power an unparalleled network of 220+ online properties covering 10,000+ granular topics, serving an audience of 50+ million professionals with original, objective content from trusted sources. We help you gain critical insights and make more informed decisions across your business priorities.\nThe popular generative AI (GenAI) model allows hallucinations, easily avoidable guardrails, susceptibility to jailbreaking and malware creation requests, and more at critically high rates, researchers find.\nFebruary 11, 2025\nOrganizations might want to think twice before using the Chinese generative AI (GenAI) DeepSeek in business applications, after it failed a barrage of 6,400 security tests that demonstrate a widespread lack of guardrails in the model.\nThat's according to researchers at AppSOC, who conducted rigorous testing on a version of the DeepSeek-R1 large language model (LLM). Their results showed the model failed in multiple critical areas, including succumbing to jailbreaking, prompt injection, malware generation, supply chain, and toxicity. Failure rates ranged between 19.2% and 98%, they revealed in a recent report.\nTwo of the highest areas of failure were the ability for users to generate malware and viruses using the model, posing both a significant opportunity for threat actors and a significant threat to enterprise users. The testing convinced DeepSeek to create malware 98.8% of the time (the \"failure rate,\" as the researchers dubbed it) and to generate virus code 86.7% of the time.\nSuch a lackluster performance against security metrics means that despite all the hype around the open source, much more affordable DeepSeek as the next big thing in GenAI, organizations should not consider the current version of the model for use in the enterprise, says Mali Gorantla, co-founder and chief scientist at AppSOC.\nRelated:President Trump to Nominate Former RNC Official as National Cyber Director\n\"For most enterprise applications, failure rates about 2% are considered unacceptable,\" he explains to Dark Reading. \"Our recommendation would be to block usage of this model for any business-related AI use.\"\nOverall, DeepSeek earned an 8.3 out of 10 on the AppSOC testing scale for security risk, 10 being the riskiest, resulting in a rating of \"high risk.\" AppSOC recommended that organizations specifically refrain from using the model for any applications involving personal information, sensitive data, or intellectual property (IP), according to the report.\nAppSOC used model scanning and red teaming to assess risk in several critical categories, including: jailbreaking, or \"do anything now,\" prompting that disregards system prompts/guardrails; prompt injection to ask a model to ignore guardrails, leak data, or subvert behavior; malware creation; supply chain issues, in which the model hallucinates and makes unsafe software package recommendations; and toxicity, in which AI-trained prompts result in the model generating toxic output.\nThe researchers also tested DeepSeek against categories of high risk, including: training data leaks; virus code generation; hallucinations that offer false information or results; and glitches, in which random \"glitch\" tokens resulted in the model showing unusual behavior.\nRelated:Feds Sanction Russian Hosting Provider for Supporting LockBit Attacks\nAccording to Gorantla's assessment, DeepSeek demonstrated a passable score only in the training data leak category, showing a failure rate of 1.4%. In all other categories, the model showed failure rates of 19.2% or more, with median results in the range of a 46% failure rate.\n\"These are all serious security threats, even with much lower failure rates,\" Gorantla says. However, the high failure results in the malware and virus categories demonstrate significant risk for an enterprise. \"Having an LLM actually generate malware or viruses provides a new avenue for malicious code, directly into enterprise systems,\" he says.\nAppSOC's results reflect some issues that have already emerged around DeepSeek since its release to much fanfare in January with claims of exceptional performance and efficiency even though it was developed for less than $6 million by a scrappy Chinese startup.\nSoon after its release, researchers jailbroke DeepSeek, revealing the instructions that define how it operates. The model also has been controversial in other ways, with claims of IP theft from OpenAI, while attackers looking to benefit from its notoriety already have targeted DeepSeek in malicious campaigns.\nRelated:India's Cybercrime Problems Grow as Nation Digitizes\nIf organizations choose to ignore AppSOC's overall advice not to use DeepSeek for business applications, they should take several steps to protect themselves, Gorantla says. These include using a discovery tool to find and audit any models used within an organization.\n\"Models are often casually downloaded and intended for testing only, but they can easily slip into production systems if there isn't visibility and governance over models,\" he says.\nThe next step is to scan all models to test for security weaknesses and vulnerabilities before they go into production, something that should be done on a recurring basis. Organizations also should implement tools that can check the security posture of AI systems on an ongoing basis, including looking for scenarios such as misconfigurations, improper access permissions, and unsanctioned models, Gorantla says.\nFinally, these security checks and scans need to be performed during development (and continuously during runtime) to look for changes. Organizations should also monitor user prompts and responses, to avoid data leaks or other security issues, he adds.\n\nElizabeth Montalbano, Contributing Writer\n\nElizabeth Montalbano is a freelance writer, journalist, and therapeutic writing mentor with more than 25 years of professional experience. Her areas of expertise include technology, business, and culture. Elizabeth previously lived and worked as a full-time journalist in Phoenix, San Francisco, and New York City; she currently resides in a village on the southwest coast of Portugal. In her free time, she enjoys surfing, hiking with her dogs, traveling, playing music, yoga, and cooking.\nYou May Also Like\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nIndustrial Networks in the Age of Digitalization\nZero-Trust Adoption Driven by Data Protection, Cloud Access Control, and Regulatory Compliance Requirements\nThreat Hunting's Evolution: From On-Premises to the Cloud\nHow Enterprises Secure Their Applications\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\nThe State of Cloud Native Security Report 2024\nDelivering Globally Consistent App Performance to the Hybrid Workforce\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nSocial Engineering: New Tricks, New Threats, New Defenses\nUnderstanding Social Engineering Attacks and What To Do About Them\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nCopyright © 2025. This website is owned and operated by Informa TechTarget, part of a global network that informs, influences and connects the world’s technology buyers and sellers. All copyright resides with them. Informa PLC’s registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. TechTarget, Inc.’s registered office is 275 Grove St. Newton, MA 02466."
    }
]