[
    {
        "Title": "Bybit Confirms Record-Breaking $1.46 Billion Crypto Heist in Sophisticated Cold Wallet Attack",
        "Link": "https://thehackernews.com/2025/02/bybit-confirms-record-breaking-146.html",
        "Summary": "Cryptocurrency exchange Bybit on Friday revealed that a \"sophisticated\" attack led to the theft of over $1.46 billion worth of cryptocurrency from one of its Ethereum cold (offline) wallets, making it the largest ever single crypto heist in history.\n\"The incident occurred when our ETH multisig cold wallet executed a transfer to our warm wallet. Unfortunately, this transaction was manipulated",
        "Date": "2025-02-22",
        "Content": "Cryptocurrency exchange Bybit on Friday revealed that a \"sophisticated\" attack led to the theft of over $1.46 billion worth of cryptocurrency from one of its Ethereum cold (offline) wallets, making it the largest ever single crypto heist in history.\n\"The incident occurred when our ETH multisig cold wallet\nexecuted\na transfer to our warm wallet. Unfortunately, this transaction was manipulated through a sophisticated attack that masked the signing interface, displaying the correct address while altering the underlying smart contract logic,\" Bybit\nsaid\nin a post on X.\n\"As a result, the attacker was able to gain control of the affected ETH cold wallet and transfer its holdings to an unidentified address.\"\nIn a separate statement posted on the social media platform, Bybit's CEO Ben Zhou\nemphasized\nthat all other cold wallets are secure. The company further\nsaid\nit has reported the case to the appropriate authorities.\nWhile there is no official confirmation from Bybit yet,\nElliptic\nand\nArkham Intelligence\nconfirmed that the digital theft is the work of the infamous Lazarus Group. The incident makes it the biggest-ever cryptocurrency heist reported to date,\ndwarfing\nthat of\nRonin Network\n($624 million),\nPoly Network\n($611 million), and\nBNB Bridge\n($586 million).\nIndependent researcher\nZachXBT\nsaid they \"connected the Bybit hack on-chain to the\nPhemex hack\n,\" the latter of which took place late last month.\nThe North Korea-based threat actor is one of the most prolific hacking groups, orchestrating dozens of\ncryptocurrency heists\nto generate illicit revenue for the sanctions-hit nation. Last year, Google\ndescribed\nNorth Korea as \"arguably the world's leading cyber criminal enterprise.\"\nIn 2024, it's\nestimated\nto have stolen $1.34 billion across 47 cryptocurrency hacks, accounting for 61% of all ill-gotten crypto during the time period, according to blockchain intelligence firm Chainalysis.\n\"Cryptocurrency heists are on the rise due to the lucrative nature of their rewards, the challenges associated with attribution to malicious actors, and the opportunities presented by nascent familiarity with cryptocurrency and Web3 technologies among many organizations,\" Google-owned Mandiant\nsaid\nlast month.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "OpenAI Bans Accounts Misusing ChatGPT for Surveillance and Influence Campaigns",
        "Link": "https://thehackernews.com/2025/02/openai-bans-accounts-misusing-chatgpt.html",
        "Summary": "OpenAI on Friday revealed that it banned a set of accounts that used its ChatGPT tool to develop a suspected artificial intelligence (AI)-powered surveillance tool.\nThe social media listening tool is said to likely originate from China and is powered by one of Meta's Llama models, with the accounts in question using the AI company's models to generate detailed descriptions and analyze documents",
        "Date": "2025-02-22",
        "Content": "OpenAI on Friday\nrevealed\nthat it banned a set of accounts that used its ChatGPT tool to develop a suspected artificial intelligence (AI)-powered surveillance tool.\nThe social media listening tool is said to likely originate from China and is powered by one of Meta's\nLlama models\n, with the accounts in question using the AI company's models to generate detailed descriptions and analyze documents for an apparatus capable of collecting real-time data and reports about anti-China protests in the West and sharing the insights with Chinese authorities.\nThe campaign has been codenamed Peer Review owing to the \"network's behavior in promoting and reviewing surveillance tooling,\" researchers Ben Nimmo, Albert Zhang, Matthew Richard, and Nathaniel Hartley noted, adding the tool is designed to ingest and analyze posts and comments from platforms such as X, Facebook, YouTube, Instagram, Telegram, and Reddit.\nIn one instance flagged by the company, the actors used ChatGPT to debug and modify source code that's believed to run the monitoring software, referred to as \"Qianyue Overseas Public Opinion AI Assistant.\"\nBesides using its model as a research tool to surface publicly available information about think tanks in the United States, and government officials and politicians in countries like Australia, Cambodia and the United States, the cluster has also been found to leverage ChatGPT access to read, translate and analyze screenshots of English-language documents.\nSome of the images were announcements of Uyghur rights protests in various Western cities, and were likely copied from social media. It's currently not known if these images were authentic.\nOpenAI also said it disrupted several other clusters that were found abusing ChatGPT for various malicious activities -\nDeceptive Employment Scheme\n- A network from North Korea linked to the\nfraudulent IT worker scheme\nthat was involved in the creation of personal documentation for fictitious job applicants, such as resumés, online job profiles and cover letters, as well as come up convincing responses to explain unusual behaviors like avoiding video calls, accessing corporate systems from unauthorized countries or working irregular hours. Some of the bogus job applications were then shared on LinkedIn.\nSponsored Discontent\n- A network likely of Chinese origin that was involved in the creation of social media content in English and long-form articles in Spanish that were critical of the United States, and subsequently published by Latin American news websites in Peru, Mexico, and Ecuador. Some of the activity overlaps with a known activity cluster dubbed\nSpamouflage\n.\nRomance-baiting Scam\n- A network of accounts that was involved in the translation and generation of comments in Japanese, Chinese, and English for posting on social media platforms including Facebook, X and Instagram in connection with suspected Cambodia-origin\nromance and investment scams\n.\nIranian Influence Nexus\n- A network of five accounts that was involved in the generation of X posts and articles that were pro-Palestinian, pro-Hamas, and pro-Iran, and anti-Israel and anti-U.S., and shared on websites associated with an Iranian influence operations tracked as the International Union of Virtual Media (\nIUVM\n) and\nStorm-2035\n. One among the banned accounts was used to create content for both the operations, indicative of a \"previously unreported relationship.\"\nKimsuky and BlueNoroff\n- A network of accounts operated by North Korean threat actors that was\ninvolved\nin gathering information related to cyber intrusion tools and\ncryptocurrency-related topics\n, and debugging code for Remote Desktop Protocol (RDP) brute-force attacks\nYouth Initiative Covert Influence Operation\n- A network of accounts that was involved in the creation of English-language articles for a website named \"Empowering Ghana\" and social media comments targeting the Ghana presidential election\nTask Scam\n- A network of accounts likely originating from Cambodia that was involved in the translation of comments between Urdu and English as part of a\nscam\nthat lures unsuspecting people into jobs performing simple tasks (e.g., liking videos or writing reviews) in exchange for earning a non-existent commission, accessing which requires victims to part with their own money.\nThe development comes as AI tools are being increasingly used by bad actors to facilitate\ncyber-enabled disinformation campaigns\nand other malicious operations.\nLast month, Google Threat Intelligence Group (GTIG)\nrevealed\nthat over 57 distinct threat actors with ties to China, Iran, North Korea, and Russia used its Gemini AI chatbot to improve multiple phases of the attack cycle and conduct research into topical events, or perform content creation, translation, and localization.\n\"The unique insights that AI companies can glean from threat actors are particularly valuable if they are shared with upstream providers, such as hosting and software developers, downstream distribution platforms, such as social media companies, and open-source researchers,\" OpenAI said.\n\"Equally, the insights that upstream and downstream providers and researchers have into threat actors open up new avenues of detection and enforcement for AI companies.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Beware: PayPal \"New Address\" feature abused to send phishing emails",
        "Link": "https://www.bleepingcomputer.com/news/security/beware-paypal-new-address-feature-abused-to-send-phishing-emails/",
        "Summary": "An ongoing PayPal email scam exploits the platform's address settings to send fake purchase notifications, tricking users into granting remote access to scammers [...]",
        "Date": "2025-02-22",
        "Content": "An ongoing PayPal email scam exploits the platform's address settings to send fake purchase notifications, tricking users into granting remote access to scammers\nFor the past month, BleepingComputer and others [\n1\n,\n2\n] have received emails from PayPal stating, \"You added a new address. This is just a quick confirmation that you added an address in your PayPal account.\"\nThe email includes the new address that was allegedly added to your PayPal account, including a message claiming to be a purchase confirmation for a MacBook M4, and to call the enclosed PayPal number if you did not authorize the purchase.\n\"Confirmation: Your shipping address for the MacBook M4 Max 1 TB ($1098.95) has been changed. If you did not authorize this update, please reach out to PayPal at +1-888-668-2508',\" reads the scam email.\nPayPal \"new address\" feature abused in scam\nSource: BleepingComputer\nThe emails are being sent directly by PayPal from the address \"service@paypal.com,\" causing people to be concerned their account was hacked.\nHowever, those who received this email confirmed that no new addresses were actually added to their accounts. In our case, the scam email was sent to an email address with no PayPal account.\nFurthermore, as the emails are legitimate PayPal emails, they are bypassing security and spam filters. In the next section, we will explain how scammers send these emails.\nThe goal of these emails is to trick recipients into thinking their account was hacked to purchase a MacBook and scare the email recipient into calling the scammer's \"PayPal support\" phone number.\nWhen calling the number, a recording will automatically play stating that you have reached PayPal customer service and to hold while a support person becomes available. The call will then attempt to connect you to a \"customer support\" person.\nThis scammer will try to scare you into thinking your account was hacked and convince you to download and run the software so that they can \"help\" you regain access to the account and block the alleged transaction.\nThe scammer will direct you to visit a site like pplassist[.]com and enter a service code given by the fake PayPal employee. Entering this code will download a ConnectWise ScreenConnect client [\nVirusTotal\n] from lokermy.numaduliton[.]icu or other sites, which the scammer will ask you to run.\nScammer's site to distribute ConnectWise ScreenConnect\nSource: BleepingComputer\nAt this point, we hung up on the scammer and did not execute the program on our devices.\nHowever, in previous scams like this, once the threat actor gains access to the computer, they attempt to\nsteal money from bank accounts\n,\ndeploy malware\n, or\nsteal data from the computer\n.\nTherefore, if you receive a legitimate email from PayPal stating you updated your address, and it contains a bogus purchase confirmation, simply ignore the email and do not contact the listed phone number as it belongs to the scammer.\nTo be safe, instead, log into your PayPal account and confirm no additional addresses were added, and if not, junk the email.\nHow the PayPal scam works\nWhen BleepingComputer first received this email, we were confused as the email was sent from \"service@paypal.com\" to an email address that does not have a PayPal account associated with it.\nFurthermore, the mail headers show that the emails are legitimate, passing DKIM email security checks and originating directly from PayPal's mail server, as shown below.\nReceived: from mx1.phx.paypal.com (mx1.phx.paypal.com. [66.211.170.87])\r\n        by mx.google.com with ESMTPS id 41be03b00d2f7-addf237d3e1si10521113a12.387.2025.02.18.07.30.09\r\n        for <noreply_@usaea.institute>\nIt was unclear at first how these legitimate emails were being sent from PayPal until we noticed this text at the bottom of the email.\n\"If you want to link your credit card to this address, or make it your primary address, log in to your PayPal account and go to your Profile,\" reads the PayPal email notification.\n\"Since this address is a gift address, you can send packages to it with just a click.\"\nFurther research revealed that \"gift addresses\" are just additional addresses you can add to your PayPal profile.\nIn a test, BleepingComputer added a new address to one of our accounts and pasted the scammer's fake MacBook purchase confirmation message into the Address 2 field.\nAfter saving the address, PayPal sent us the same confirmation email, notifying us of the new address we added, which also included the fake purchase message.\nNow that we know how they are generating the email from PayPal, we still do not know how they are getting PayPal to send it to all of the targets.\nUpon further analysis of the mail headers, we can see that the email is actually being sent to the address \"noreply_@usaea.institute,\" which is the email address associated with the scammer's PayPal address.\nThe headers further show that this email address automatically forwards the email it receives to \"bill_complete1@zodu.onmicrosoft.com\", an account associated with a Microsoft 365 tenant.\nThis account is likely a mailing list, which automatically forwards any email it receives to all other group members. In this case, the members are you and I, the scammer's targets.\nWhen they add the scam address to PayPal, the payment platform will email a confirmation to the threat actor's email, which will then forward it to the Microsoft 365 account, which then forwards it to everyone on the mailing list, as shown in the flow chart below.\nScam attack flow\nSource: BleepingComputer\nPayPal enables this scam by not limiting the number of characters in the address form fields, allowing the threat actors to inject their scam message.\nTo fix this, PayPal needs to restrict the number of characters in the address field to a reasonable character count, like 50 characters, if not less.\nBleepingComputer contacted PayPal about this scam and is awaiting a response to our email.\nRelated Articles:\nFake CS2 tournament streams used to steal crypto, Steam accounts\nKimsuky hackers use new custom RDP Wrapper for remote access\nCalifornia man steals $50 million using fake investment sites, gets 7 years\nPayPal to pay $2 million settlement over 2022 data breach"
    },
    {
        "Title": "Fake CS2 tournament streams used to steal crypto, Steam accounts",
        "Link": "https://www.bleepingcomputer.com/news/security/fake-cs2-tournament-streams-used-to-steal-crypto-steam-accounts/",
        "Summary": "Threat actors are exploiting major Counter-Strike 2 (CS2) competitions, like IEM Katowice 2025 and PGL Cluj-Napoca 2025, to defraud gamers and steal their Steam accounts and cryptocurrency. [...]",
        "Date": "2025-02-22",
        "Content": "Threat actors are exploiting major Counter-Strike 2 (CS2) competitions, like IEM Katowice 2025 and PGL Cluj-Napoca 2025, to defraud gamers and steal their Steam accounts and cryptocurrency.\nAlthough CS2 first launched 13 years ago, it still maintains a massive community of plays and an active professional competition landscape with multi-million rewards.\nCharacteristically, earlier this month, CS2 achieved a new peak player count of over\n1.7 million concurrent players\non Steam.\nCS2 streamjacking campaign\nA malicious \"Streamjacking\" campaign was\nspotted by Bitdefender Labs\n, targeting the gaming community by impersonating popular CS2 players.\nThe security firm warns that the threat actors impersonate professional CS2 players like s1mple, NiKo, and donk in live streams on YouTube, promoting fake CS2 skin and cryptocurrency giveaways.\nFake YouTube CS2 livestream\nSource: Bitdefender\nThe channels that promote these scams are hijacked legitimate YouTube accounts, which the scammers rebrand as needed to impersonate professional players.\nWhat they show in these livestreams is loops of old gameplay footage, making it appear live to anyone who hasn't watched them before.\nQR codes or links on these videos direct viewers to malicious websites where they are requested to log in with their Steam account, supposedly to claim their gifts or send cryptocurrency to receive double in return.\n\"Once logged in, victims unknowingly grant access to scammers, allowing them to steal valuable skins and items. If cryptocurrency is sent, it is immediately transferred to scammer-controlled wallets,\" explains BitDefender.\nBitdefender says these scams often use names of legitimate platforms like CS.MONEY or esports sponsorships to further enhance the deception.\nScam page that steals cryptocurrency\nSource: Bitdefender\nHow to stay safe\nGamers should be wary of these scams circulating on YouTube and possibly elsewhere, and they should verify claimed affiliations with official esports organizations before entering any sensitive info on websites.\nPromises to double or triple crypto assets by first sending some are always scams, with no exceptions.\nTo keep Steam accounts safe, all users should activate multi-factor authentication (MFA), enable 'Steam Guard Mobile Authenticator,' and regularly review login activity for suspicious sign-ins.\nOn YouTube, only watch videos from official pro player accounts that you have subscribed to, and be suspicious when you see the same players live-stream on other, even similarly named channels.\nRemember that even legitimate YouTube channels can be hijacked to promote scams, so no giveaways should be blindly trusted.\nRelated Articles:\nCracked Garry’s Mod, BeamNG.drive games infect gamers with miners\nPirateFi game on Steam caught installing password-stealing malware\nStolen Path of Exile 2 admin account used to hack player accounts\nBeware: PayPal \"New Address\" feature abused to send phishing emails\nHacker steals record $1.46 billion from Bybit ETH cold wallet"
    },
    {
        "Title": "Bybit Hack Drains $1.5 Billion From Cryptocurrency Exchange",
        "Link": "https://www.securityweek.com/bybit-hack-drains-1-5-billion-from-cryptocurrency-exchange/",
        "Summary": "<p>Over 400,000 ETH and stETH worth more than $1.5 billion were stolen from the Bybit cryptocurrency exchange.</p>\n<p>The post <a href=\"https://www.securityweek.com/bybit-hack-drains-1-5-billion-from-cryptocurrency-exchange/\">Bybit Hack Drains $1.5 Billion From Cryptocurrency Exchange</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-02-22",
        "Content": "Hi, what are you looking for?\nOver 400,000 ETH and stETH worth more than $1.5 billion were stolen from the Bybit cryptocurrency exchange.\nBy\nFlipboard\nReddit\nWhatsapp\nWhatsapp\nEmail\nCryptocurrency exchange Bybit on Friday said a cyberattack allowed hackers to steal roughly $1.5 billion worth of digital currency.\nBybit, which claims more than 60 million users and more than $36 billion in daily trading volume, said a sophisticated cyberattack “altered the smart contract logic and masked the signing interface, enabling the attacker to gain control of the ETH Cold Wallet.”\n\n\n\nAs a result, over 400,000 ETH and stETH worth more than $1.5 billion were transferred to an unidentified address, Bybit said.\n\n\n\nThe company said that a potential vulnerability in the user interface of the Safe.global platform may have been exploited during the transaction process, but did not provide any technical details.\n\n\n\nThe company said the news of the hack led to a surge in withdrawal requests, but cryptocurrency holdings with the exchange were safe, despite possible delays in processing withdrawals.\n\n\n\nBen Zhou, CEO of Bybit, said that the exchange would remain solvent even if the stolen crypto funds were not recovered. “Bybit is Solvent even if this hack loss is not recovered, all of clients assets are 1 to 1 backed, we can cover the loss,” he noted on X.\n\n\n\nBybit claims to have “more than enough assets to cover the loss, with AUM exceeding $20 billion”, and said it would use a bridge loan if necessary to ensure the availability of user funds.\n\n\n\nAccording to fresh data from Chainalysis, cryptocurrency criminal activity surged in 2024, marking the fifth year in the past decade where losses exceeded $1 billion, with $2.2 billion stolen — a 20% year-over-year increase. Advertisement. Scroll to continue reading.\n\n\nRelated: FBI Blames North Korea for $308M Cryptocurrency Hack as Losses Surge in 2024\n\n\nBybit, which claims more than 60 million users and more than $36 billion in daily trading volume, said a sophisticated cyberattack “altered the smart contract logic and masked the signing interface, enabling the attacker to gain control of the ETH Cold Wallet.”\n\n\n\nAs a result, over 400,000 ETH and stETH worth more than $1.5 billion were transferred to an unidentified address, Bybit said.\n\n\n\nThe company said that a potential vulnerability in the user interface of the Safe.global platform may have been exploited during the transaction process, but did not provide any technical details.\n\n\n\nThe company said the news of the hack led to a surge in withdrawal requests, but cryptocurrency holdings with the exchange were safe, despite possible delays in processing withdrawals.\n\n\n\nBen Zhou, CEO of Bybit, said that the exchange would remain solvent even if the stolen crypto funds were not recovered. “Bybit is Solvent even if this hack loss is not recovered, all of clients assets are 1 to 1 backed, we can cover the loss,” he noted on X.\n\n\n\nBybit claims to have “more than enough assets to cover the loss, with AUM exceeding $20 billion”, and said it would use a bridge loan if necessary to ensure the availability of user funds.\n\n\n\nAccording to fresh data from Chainalysis, cryptocurrency criminal activity surged in 2024, marking the fifth year in the past decade where losses exceeded $1 billion, with $2.2 billion stolen — a 20% year-over-year increase. Advertisement. Scroll to continue reading.\n\n\nRelated: FBI Blames North Korea for $308M Cryptocurrency Hack as Losses Surge in 2024\n\n\nAs a result, over 400,000 ETH and stETH worth more than $1.5 billion were transferred to an unidentified address, Bybit said.\n\n\n\nThe company said that a potential vulnerability in the user interface of the Safe.global platform may have been exploited during the transaction process, but did not provide any technical details.\n\n\n\nThe company said the news of the hack led to a surge in withdrawal requests, but cryptocurrency holdings with the exchange were safe, despite possible delays in processing withdrawals.\n\n\n\nBen Zhou, CEO of Bybit, said that the exchange would remain solvent even if the stolen crypto funds were not recovered. “Bybit is Solvent even if this hack loss is not recovered, all of clients assets are 1 to 1 backed, we can cover the loss,” he noted on X.\n\n\n\nBybit claims to have “more than enough assets to cover the loss, with AUM exceeding $20 billion”, and said it would use a bridge loan if necessary to ensure the availability of user funds.\n\n\n\nAccording to fresh data from Chainalysis, cryptocurrency criminal activity surged in 2024, marking the fifth year in the past decade where losses exceeded $1 billion, with $2.2 billion stolen — a 20% year-over-year increase. Advertisement. Scroll to continue reading.\n\n\nRelated: FBI Blames North Korea for $308M Cryptocurrency Hack as Losses Surge in 2024\n\n\nThe company said that a potential vulnerability in the user interface of the Safe.global platform may have been exploited during the transaction process, but did not provide any technical details.\n\n\n\nThe company said the news of the hack led to a surge in withdrawal requests, but cryptocurrency holdings with the exchange were safe, despite possible delays in processing withdrawals.\n\n\n\nBen Zhou, CEO of Bybit, said that the exchange would remain solvent even if the stolen crypto funds were not recovered. “Bybit is Solvent even if this hack loss is not recovered, all of clients assets are 1 to 1 backed, we can cover the loss,” he noted on X.\n\n\n\nBybit claims to have “more than enough assets to cover the loss, with AUM exceeding $20 billion”, and said it would use a bridge loan if necessary to ensure the availability of user funds.\n\n\n\nAccording to fresh data from Chainalysis, cryptocurrency criminal activity surged in 2024, marking the fifth year in the past decade where losses exceeded $1 billion, with $2.2 billion stolen — a 20% year-over-year increase. Advertisement. Scroll to continue reading.\n\n\nRelated: FBI Blames North Korea for $308M Cryptocurrency Hack as Losses Surge in 2024\n\n\nThe company said the news of the hack led to a surge in withdrawal requests, but cryptocurrency holdings with the exchange were safe, despite possible delays in processing withdrawals.\n\n\n\nBen Zhou, CEO of Bybit, said that the exchange would remain solvent even if the stolen crypto funds were not recovered. “Bybit is Solvent even if this hack loss is not recovered, all of clients assets are 1 to 1 backed, we can cover the loss,” he noted on X.\n\n\n\nBybit claims to have “more than enough assets to cover the loss, with AUM exceeding $20 billion”, and said it would use a bridge loan if necessary to ensure the availability of user funds.\n\n\n\nAccording to fresh data from Chainalysis, cryptocurrency criminal activity surged in 2024, marking the fifth year in the past decade where losses exceeded $1 billion, with $2.2 billion stolen — a 20% year-over-year increase. Advertisement. Scroll to continue reading.\n\n\nRelated: FBI Blames North Korea for $308M Cryptocurrency Hack as Losses Surge in 2024\n\n\nBen Zhou, CEO of Bybit, said that the exchange would remain solvent even if the stolen crypto funds were not recovered. “Bybit is Solvent even if this hack loss is not recovered, all of clients assets are 1 to 1 backed, we can cover the loss,” he noted on X.\n\n\n\nBybit claims to have “more than enough assets to cover the loss, with AUM exceeding $20 billion”, and said it would use a bridge loan if necessary to ensure the availability of user funds.\n\n\n\nAccording to fresh data from Chainalysis, cryptocurrency criminal activity surged in 2024, marking the fifth year in the past decade where losses exceeded $1 billion, with $2.2 billion stolen — a 20% year-over-year increase. Advertisement. Scroll to continue reading.\n\n\nRelated: FBI Blames North Korea for $308M Cryptocurrency Hack as Losses Surge in 2024\n\n\nBybit claims to have “more than enough assets to cover the loss, with AUM exceeding $20 billion”, and said it would use a bridge loan if necessary to ensure the availability of user funds.\n\n\n\nAccording to fresh data from Chainalysis, cryptocurrency criminal activity surged in 2024, marking the fifth year in the past decade where losses exceeded $1 billion, with $2.2 billion stolen — a 20% year-over-year increase. Advertisement. Scroll to continue reading.\n\n\nRelated: FBI Blames North Korea for $308M Cryptocurrency Hack as Losses Surge in 2024\n\n\nAccording to fresh data from Chainalysis, cryptocurrency criminal activity surged in 2024, marking the fifth year in the past decade where losses exceeded $1 billion, with $2.2 billion stolen — a 20% year-over-year increase. Advertisement. Scroll to continue reading.\n\n\nRelated: FBI Blames North Korea for $308M Cryptocurrency Hack as Losses Surge in 2024\n\n\nRelated: FBI Blames North Korea for $308M Cryptocurrency Hack as Losses Surge in 2024\n\n\n\n\n\nSubscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.\nDiscover strategies for vendor selection, integration to minimize redundancies, and maximizing ROI from your cybersecurity investments. Gain actionable insights to ensure your stack is ready for tomorrow’s challenges.\nLearn best practices to plan, prepare, and recover from a ransomware incident.\nKatie Arrington has been appointed Chief Information Security Officer at the Department of Defense.\nWayne Maw has joined hardware cybersecurity company X-PHY as its US General Manager.\nBarracuda Networks has appointed Peter Alexander as its Chief Marketing Officer.\n\n\nAI systems can sometimes struggle with complex or nuanced situations, so human intervention can help identify and address potential issues that algorithms might not.\n(Marc Solomon)\n\n\n\nOrganizations adopting the transformative nature of agentic AI are urged to take heed of prompt engineering tactics being practiced by threat actors.\n(Etay Maor)\n\n\n\nIn the latest edition of “Rising Tides” we talk with Lesley Carhart, Technical Director of Incident Response at Dragos.\n(Jennifer Leggio)\n\n\n\nMillions of uninformed users have flocked to DeepSeek and share personal information without considering security or privacy risks.\n(Torsten George)\n\n\n\nThe blame of security incidents may be shared—but the burden of response always falls on the security team. Here’s how to prepare for the inevitable.\n(Joshua Goldfarb)\n\nFlipboard\nReddit\nWhatsapp\nWhatsapp\nEmail\nGot a confidential news tip? We want to hear from you.\nReach a large audience of enterprise cybersecurity professionals \nSubscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.\nCopyright © 2025 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\r\n\t\t\t\t\tSubscribe to the SecurityWeek Email Briefing to stay informed on the latest cybersecurity\r\n\t\t\t\t\tnews, threats, and expert insights. Unsubscribe at any time.\r\n\t\t\t\t\t\n\n\n"
    }
]