[
    {
        "Title": "New FinalDraft malware abuses Outlook mail service for stealthy comms",
        "Link": "https://www.bleepingcomputer.com/news/security/new-finaldraft-malware-abuses-outlook-mail-service-for-stealthy-comms/",
        "Summary": "A new malware called FinalDraft has been using Outlook email drafts for command-and-control communication in attacks against a ministry in a South American country. [...]",
        "Date": "2025-02-16",
        "Content": "A new malware called FinalDraft has been using Outlook email drafts for command-and-control communication in attacks against a ministry in a South American country.\nThe attacks were\ndiscovered by Elastic Security Labs\nand rely on a complete toolset that includes a custom malware loader named PathLoader, the FinalDraft backdoor, and multiple post-exploitation utilities.\nThe abuse of Outlook, in this case, aims to achieve covert communications, allowing the attackers to perform data exfiltration, proxying, process injection, and lateral movement while leaving minimal possible traces.\nAttack chain\nThe attack begins with the threat actor compromising the targer's system with PathLoader, a small executable file that executes shellcode, including the FinalDraft malware, retrieved from the attacker's infrastructure.\nPathLoader incorporates protections against static analysis by performing API hashing and using string encryption.\nFinalDraft is used for data exfiltration and process injection. After loading the configuration and generating a session ID, the malware establishes communication through Microsoft Graph API, by sending and receiving commands through Outlook email drafts.\nFinalDraft retrieves an OAuth token from Microsoft using a refresh token embedded in its configuration, and stores it in the Windows Registry for persistent access.\nToken stored in the Windows Registry\nSource: Elastic Security\nBy using Outlook drafts instead of sending emails, it avoids detection and blends into normal Microsoft 365 traffic.\nCommands from the attacker are hidden in drafts (r_<session-id>) and responses are stored in new drafts (p_<session-id>). After execution, draft commands are deleted, making forensic analysis harder and detection more unlikely.\nFinalDraft supports a total of 37 commands, the most important of them being:\nData exfiltration (files, credentials, system info)\nProcess injection (running payloads in legitimate processes like mspaint.exe)\nPass-the-Hash attacks (stealing authentication credentials for lateral movement)\nNetwork proxying (creating covert network tunnels)\nFile operations (copying, deleting, or overwriting files)\nPowerShell execution (without launching powershell.exe)\nElastic Security Labs also observed a Linux variant of FinalDraft, which can still use Outlook via REST API and Graph API, as well as HTTP/HTTPS, reverse UDP & ICMP, bind/reverse TCP, and DNS-based C2 exchange.\nFinalDraft operational overview\nSource: Elastic Security\nThe researchers present the attack campaign, dubbed REF7707, in a\nseparate report\nthat describes several opsec mistakes that are in contrast with the advanced intrusion set used, and which led to the attacker's exposure.\nREF7707 is a cyber-espionage campaign focused on a South American foreign ministry, but analysis of the infrastructure revealed links to Southeast Asian victims, suggesting a broader operation.\nThe investigation also uncovered another previously undocumented malware loader used in the attacks, named GuidLoader, capable to decrypt and execute payloads in memory\nREF7077 malware timeline\nSource: Elastic Security\nFurther analysis showed the attacker's repeated targeting of high-value institutions via compromised endpoints in telecommunications and internet infrastructure providers in Southeast Asia.\nAdditionally, a Southeast Asian university’s public-facing storage system was used to host malware payloads, suggesting prior compromise or a supply chain foothold.\nYARA rules to help defenders detect Guidloader, PathLoader, and FinalDraft, are available at the bottom of Elastic’s reports [\n1\n,\n2\n].\nRelated Articles:\nChinese espionage tools deployed in RA World ransomware attack\nMirrorFace hackers targeting Japanese govt, politicians since 2019\nWindows 10 KB5051974 update force installs new Microsoft Outlook app\nCritical RCE bug in Microsoft Outlook now exploited in attacks\nJanuary Windows 10 preview update force installs new Outlook"
    }
]