[
    {
        "Title": "Android's New Feature Blocks Fraudsters from Sideloading Apps During Calls",
        "Link": "https://thehackernews.com/2025/02/androids-new-feature-blocks-fraudsters.html",
        "Summary": "Google is working on a new security feature for Android that blocks device owners from changing sensitive settings when a phone call is in progress.\nSpecifically, the in-call anti-scammer protections include preventing users from turning on settings to install apps from unknown sources and granting accessibility access. The development was first reported by Android Authority.\nUsers who attempt",
        "Date": "2025-02-15",
        "Content": "Google is working on a new security feature for Android that blocks device owners from changing sensitive settings when a phone call is in progress.\nSpecifically, the in-call anti-scammer protections include preventing users from turning on settings to install apps from unknown sources and granting accessibility access. The development was\nfirst reported\nby Android Authority.\nUsers who attempt to do so during phone calls are served the message: \"Scammers often request this type of action during phone call conversations, so it's blocked to protect you,\" If you are being guided to take this action by someone you don't know, it might be a scam.\"\nFurthermore, it blocks users from giving an app access to accessibility over the course of a phone call.\nThe feature is\ncurrently live\nin Android 16 Beta 2, which was released earlier this week. With this latest addition, the idea is to introduce more friction to a tactic that has been\ncommonly abused\nby malicious actors to deliver malware.\nDubbed telephone-oriented attack delivery (TOAD), these approaches involve sending SMS messages to prospective targets and instructing them to call a number by inducing a false sense of urgency.\nLast year,\nNCC Group\nand Finland's\nNational Cyber Security Centre\n(NCSC-FI) disclosed that cybercriminals were distributing dropper apps using a combination of SMS messages and phone calls to trick them into installing malware such as Vultr.\nThe development comes after Google\nexpanded restricted settings\nto cover more permission categories in order to prevent sideloaded apps from accessing sensitive data.\nIt has also\nrolled out\nthe ability to automatically block sideloading of potentially unsafe apps in markets like Brazil, Hong Kong, India, Kenya, Nigeria, Philippines, Singapore, South Africa, Thailand, and Vietnam to tackle fraud.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft: Hackers steal emails in device code phishing attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/microsoft-hackers-steal-emails-in-device-code-phishing-attacks/",
        "Summary": "An active campaign from a threat actor potentially linked to Russia is targeting Microsoft 365 accounts of individuals at organizations of interest using device code phishing. [...]",
        "Date": "2025-02-15",
        "Content": "An active campaign from a threat actor potentially linked to Russia is targeting Microsoft 365 accounts of individuals at organizations of interest using device code phishing.\nThe targets are in the government, NGO, IT services and technology, defense, telecommunications, health, and energy/oil and gas sectors in Europe, North America, Africa, and the Middle East.\nMicrosoft Threat Intelligence Center tracks the threat actors behind the device code phishing campaign as 'Storm-237', Based on interests, victimology, and tradecraft, the researchers have medium confidence that the activity is associated with a nation-state operation that aligns with Russia's interests.\nDevice code phishing attacks\nInput constrained devices - those that lack keyboard or browser support, like smart TVs and some IoTs, rely on a code authentication flow to allow allowing users to sign into an application by typing an authorization code on a separate device like a smartphone or computer.\nMicrosoft researchers discovered that since last August, Storm-2372 abuses this authentication flow by tricking users into entering attacker-generated device codes on legitimate sign-in pages.\nThe operatives initiate the attack after first establishing a connection with the target by \"falsely posing as a prominent person relevant to the target\" over messaging platforms like WhatsApp, Signal, and Microsoft Teams.\nMessages Storm-2372 sent to targets\nSource: Microsoft\nThe threat actor gradually establishes a rapport before sending a fake online meeting invitation via email or message.\nAccording to the researchers, victim receives a Teams meeting invite that includes a device code generated by the attacker.\n\"The invitations lure the user into completing a device code authentication request emulating the experience of the messaging service, which provides Storm-2372 initial access to victim accounts and enables Graph API data collection activities, such as email harvesting,\" Microsoft\nsays\n.\nThis gives the hackers access to the victim's Microsoft services (email, cloud storage) without needing a password for as long as the stolen tokens remain valid.\nDevice code phishing attack overview\nSource: Microsoft\nHowever, Microsoft says that the attacker is now using the specific client ID for Microsoft Authentication Broker in the device code sign-in flow, which allows them to generate new tokens.\nThis opens new attack and persistence possiblities as the threat actor can use the client ID to register devices to Entra ID, Microsoft's cloud-based identity and access management solution.\n\"With the same refresh token and the new device identity, Storm-2372 is able to obtain a Primary Refresh Token (PRT) and access an organization’s resources. We have observed Storm-2372 using the connected device to collect emails\" -\nMicrosoft\nDefending against Storm-2372\nTo counter device code phishing attacks used by Storm-2372,\nMicrosoft proposes\nblocking device code flow where possible and enforcing Conditional Access policies in Microsoft Entra ID to limit its use to trusted devices or networks.\nIf device code phishing is suspected, immediately revoke the user's refresh tokens using 'revokeSignInSessions' and set a Conditional Access Policy to force re-authentication for affected users.\nFinally, use Microsoft Entra ID's sign-in logs to monitor for, and quickly identify high volumes of authentication attempts in a short period, device code logins from unrecognized IPs, and unexpected prompts for device code authentication sent to multiple users.\nRelated Articles:\nHackers spoof Microsoft ADFS login pages to steal credentials\nMicrosoft fixes bug causing Windows Server 2025 boot errors\nWindows 10 KB5051974 update force installs new Microsoft Outlook app\nMicrosoft February 2025 Patch Tuesday fixes 4 zero-days, 55 flaws\nWindows 11 KB5051987 & KB5051989 cumulative updates released"
    }
]