[
    {
        "Title": "Hyper-Volumetric DDoS Attacks Reach Record 7.3 Tbps, Targeting Key Global Sectors",
        "Link": "https://thehackernews.com/2025/07/hyper-volumetric-ddos-attacks-reach.html",
        "Summary": "Cloudflare on Tuesday said it mitigated 7.3 million distributed denial-of-service (DDoS) attacks in the second quarter of 2025, a significant drop from 20.5 million DDoS attacks it fended off the previous quarter.\n\"Overall, in Q2 2025, hyper-volumetric DDoS attacks skyrocketed,\" Omer Yoachimik and Jorge Pacheco said. \"Cloudflare blocked over 6,500 hyper-volumetric DDoS attacks, an average of 71",
        "Date": "2025-07-15",
        "Content": "Cloudflare on Tuesday said it mitigated 7.3 million distributed denial-of-service (DDoS) attacks in the second quarter of 2025, a significant drop from\n20.5 million DDoS attacks\nit fended off the previous quarter.\n\"Overall, in Q2 2025, hyper-volumetric DDoS attacks skyrocketed,\" Omer Yoachimik and Jorge Pacheco\nsaid\n. \"Cloudflare blocked over 6,500 hyper-volumetric DDoS attacks, an average of 71 per day.\"\nIn Q1 2025, the company said an 18-day sustained campaign against its own and other critical infrastructure protected by Cloudflare was responsible for 13.5 million of the attacks observed during the time period. Cumulatively, Cloudflare has blocked nearly 28 million DDoS attacks, surpassing the number of attacks it mitigated in all of 2024.\nThe notable of the attacks in Q2 2025 is a\nstaggering DDoS attack\nthat peaked at 7.3 terabits per second (Tbps) and 4.8 billion packets per second (Bpps) within a span of 45 seconds.\nBig traffic spikes like these make headlines—but what often gets missed is how attackers are now combining them with smaller, targeted probes. Instead of just overwhelming systems with brute force, they're mixing large-scale floods with quiet scans to find weak spots and slip past defenses built to block only the obvious.\nLayer 3/Layer 4 (L3/4) DDoS attacks\ndeclined 81% quarter-over-quarter to 3.2 million, while HTTP DDoS attacks rose 9% to 4.1 million. More than 70% of the HTTP DDoS attacks emanated from known botnets. The most common L3/4 attack vectors were flood attacks conducted over DNS, TCP SYN, and UDP protocols.\nTelecommunication service providers and carriers were among the most targeted, followed by the Internet, IT services, gaming, and gambling sectors.\nChina, Brazil, Germany, India, South Korea, Turkey, Hong Kong, Vietnam, Russia, and Azerbaijan emerged as the most attacked locations based on the billing country of the Cloudflare customers. Indonesia, Singapore, Hong Kong, Argentina, and Ukraine were the top five sources of DDoS attacks.\nThe web infrastructure and security company also revealed that the number of hyper-volumetric DDoS attacks exceeding 100 million packets per second (pps) increased by 592% compared to the previous quarter.\nAnother significant aspect is the 68% increase in ransom DDoS attack, which occurs when malicious actors attempt to extort money from an organization by threatening them with a DDoS attack. It also involves scenarios where the attacks are carried out and a ransom is demanded to stop it from happening again.\n\"While the majority of DDoS attacks are small, hyper-volumetric DDoS attacks are increasing in size and frequency,\" Cloudflare said. \"Six out of every 100 HTTP DDoS attacks exceed 1M rps, and 5 out of every 10,000 L3/4 DDoS attacks exceed 1 Tbps — a 1,150% QoQ increase.\"\nThe company further has called attention to a botnet variant dubbed\nDemonBot\nthat infects Linux-based systems, predominantly unsecured IoT devices, via open ports or weak credentials to enlist them into a DDoS botnet that can carry out UDP, TCP, and application-layer floods.\n\"Attacks are typically command-and-control (C2) driven and can generate significant volumetric traffic, often targeting gaming, hosting, or enterprise services,\" it added. \"To avoid infection, leverage antivirus software and domain filtering.\"\nInfection vectors like those exploited by DemonBot highlight broader challenges with unsecured IoT exposure, weak SSH credentials, and outdated firmware—common themes across DDoS botnet proliferation. Related attack strategies, such as TCP reflection, DNS amplification, and burst-layer evasion, are increasingly discussed in Cloudflare's application-layer threat reports and API security breakdowns.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Newly Emerged GLOBAL GROUP RaaS Expands Operations with AI-Driven Negotiation Tools",
        "Link": "https://thehackernews.com/2025/07/newly-emerged-global-group-raas-expands.html",
        "Summary": "Cybersecurity researchers have shed light on a new ransomware-as-a-service (RaaS) operation called GLOBAL GROUP that has targeted a wide range of sectors in Australia, Brazil, Europe, and the United States since its emergence in early June 2025.\nGLOBAL GROUP was \"promoted on the Ramp4u forum by the threat actor known as '$$$,'\" EclecticIQ researcher Arda Büyükkaya said. \"The same actor controls",
        "Date": "2025-07-15",
        "Content": "Cybersecurity researchers have shed light on a new ransomware-as-a-service (RaaS) operation called\nGLOBAL GROUP\nthat has targeted a wide range of sectors in Australia, Brazil, Europe, and the United States since its emergence in early June 2025.\nGLOBAL GROUP was \"promoted on the Ramp4u forum by the threat actor known as '$$$,'\" EclecticIQ researcher Arda Büyükkaya\nsaid\n. \"The same actor controls the BlackLock RaaS and previously managed Mamona ransomware operations.\"\nIt's believed that GLOBAL GROUP is a rebranding of BlackLock after the latter's data leak site was\ndefaced\nby the DragonForce ransomware cartel back in March. It's worth mentioning that BlackLock in itself is a rebrand of another RaaS scheme known as Eldorado.\nThe financially motivated group has been found to lean heavily on initial access brokers (IABs) to deploy the ransomware by weaponizing access to vulnerable edge appliances from Cisco, Fortinet, and Palo Alto Networks. Also put to use are brute-force utilities for Microsoft Outlook and RDWeb portals.\n$$$ has acquired Remote Desktop Protocol (RDP) or web shell access to corporate networks, such as those related to law firms, as a way to deploy post-exploitation tools, conduct lateral movement, siphon data, and deploy the ransomware.\nOutsourcing the infiltration phase to other threat actors, who supply pre-compromised entry points into enterprise networks, allows affiliates to expend their efforts on payload delivery, extortion, and negotiation rather than network penetration.\nThe RaaS platform comes with a negotiation portal and an affiliate panel, the latter of which allows cybercriminals to manage victims, build ransomware payloads for VMware ESXi, NAS, BSD, and Windows, and monitor operations. In a bid to entice more affiliates, the threat actors promise a revenue-sharing model of 85%.\n\"GLOBAL GROUP's ransom negotiation panel features an automated system powered by AI-driven chatbots,\" the Dutch security company said. \"This enables non-English-speaking affiliates to engage victims more effectively.\"\nAs of July 14, 2025, the RaaS group has claimed 17 victims in Australia, Brazil, Europe, and the United States, spanning healthcare, oil-and-gas equipment fabrication, industrial machinery and precision engineering, automotive repair, accident-recovery services, and large-scale business process outsourcing (BPO).\nThe links to BlackLock and Mamona stem from the use of the same Russian VPS provider IpServer and source code similarities with Mamona. Specifically, GLOBAL GROUP is said to be an evolution of Mamona with added features to enable domain-wide ransomware installation. What's more, the malware is also written in Go, just like BlackLock.\n\"The creation of GLOBAL GROUP by BlackLock's administrator is a deliberate strategy to modernize operations, expand revenue streams, and stay competitive in the ransomware market,\" Büyükkaya said. \"This new brand integrates AI-powered negotiation, mobile-friendly panels, and customizable payload builders, appealing to a broader pool of affiliates.\"\nThe disclosure comes as the\nQilin\nransomware group emerged as the most active RaaS operation in June 2025, accounting for 81 victims. Other major players include Akira (34), Play (30), SafePay (27), and DragonForce (25).\n\"SafePay saw the steepest decline at 62.5%, suggesting a major pullback,\" cybersecurity company CYFIRMA\nsaid\n. \"DragonForce emerged rapidly, with attacks spiking by 212.5%.\"\nIn all, the total number of ransomware victims has dropped from 545 in May to 463 in June 2025, a 15% decline. February tops this year's list with 956 victims.\n\"Despite the decline in numbers, geopolitical tensions and high-profile cyber attacks highlight growing instability, potentially heightening the risk of cyber threats,\" NCC Group\nnoted\nlate last month.\nAccording to data gathered by Optiv's Global Threat Intelligence Center (gTIC), 314 ransomware victims were listed on 74 unique data leak sites in Q1 2025, representing a 213% increase in the number of victims. A total of 56 variants were observed in Q1 2024.\n\"Ransomware operators continued to use tried-and-true methods to gain initial access to victims – social engineering/phishing, exploitation of software vulnerabilities, compromising exposed and insecure software, supply-chain attacks and leveraging the initial access broker (IAB) community,\" Optiv researcher Emily Lee\nsaid\n.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "State-Backed HazyBeacon Malware Uses AWS Lambda to Steal Data from SE Asian Governments",
        "Link": "https://thehackernews.com/2025/07/state-backed-hazybeacon-malware-uses.html",
        "Summary": "Governmental organizations in Southeast Asia are the target of a new campaign that aims to collect sensitive information by means of a previously undocumented Windows backdoor dubbed HazyBeacon.\nThe activity is being tracked by Palo Alto Networks Unit 42 under the moniker CL-STA-1020, where \"CL\" stands for \"cluster\" and \"STA\" refers to \"state-backed motivation.\"\n\"The threat actors behind this",
        "Date": "2025-07-15",
        "Content": "Governmental organizations in Southeast Asia are the target of a new campaign that aims to collect sensitive information by means of a previously undocumented Windows backdoor dubbed\nHazyBeacon\n.\nThe activity is being tracked by Palo Alto Networks Unit 42 under the moniker\nCL-STA-1020\n, where \"CL\" stands for \"cluster\" and \"STA\" refers to \"state-backed motivation.\"\n\"The threat actors behind this cluster of activity have been collecting sensitive information from government agencies, including information about recent tariffs and trade disputes,\" security researcher Lior Rochberger\nsaid\nin a Monday analysis.\nSoutheast Asia has increasingly become a focal point for cyber espionage due to its role in sensitive trade negotiations, military modernization, and strategic alignment in the U.S.–China power dynamic. Targeting government agencies in this region can provide valuable intelligence on foreign policy direction, infrastructure planning, and internal regulatory shifts that influence regional and global markets.\nThe exact initial access vector used to deliver the malware is currently not known, although evidence shows the use of DLL side-loading techniques to deploy it on compromised hosts. Specifically, it involves planting a malicious version of a DLL called \"mscorsvc.dll\" along with the legitimate Windows executable, \"\nmscorsvw.exe\n.\"\nOnce the binary is launched, the DLL proceeds to establish communication with an attacker-controlled URL that allows it to execute arbitrary commands and download additional payloads. Persistence is achieved by means of a service that ensures the DLL is launched even after a reboot of the system.\nHazyBeacon is notable for the fact that it leverages Amazon Web Services (AWS) Lambda URLs for command-and-control (C2) purposes, demonstrating threat actors' continued abuse of legitimate services to fly under the radar and escape detection.\n\"\nAWS Lambda URLs\nare a feature of AWS Lambda that allows users to invoke serverless functions directly over HTTPS,\" Rochberger explained. \"This technique uses legitimate cloud functionality to hide in plain sight, creating a reliable, scalable and difficult-to-detect communication channel.\"\nDefenders should pay attention to outbound traffic to rarely used cloud endpoints like\n*.lambda-url.*.amazonaws.com\n, especially when initiated by unusual binaries or system services. While AWS usage itself isn't suspicious, context-aware baselining—such as correlating process origins, parent-child execution chains, and endpoint behavior—can help distinguish legitimate activity from malware leveraging cloud-native evasion.\nDownloaded among the payloads is a file collector module that's responsible for harvesting files matching a specific set of extensions (e.g., doc, docx, xls, xlsx, and pdf) and within a time range. This includes attempts to search for files related to the recent tariff measures imposed by the United States.\nThe threat actor has also been found to employ other services like Google Drive and Dropbox as exfiltration channels so as to blend in with normal network traffic and transmit the gathered data. In the incident analyzed by Unit 42, attempts to upload the files to the cloud storage services are said to have been blocked.\nIn the final stage, the attackers run cleanup commands to avoid leaving traces of their activity, deleting all the archives of staged files and other payloads downloaded during the attack.\n\"The threat actors used HazyBeacon as the main tool for maintaining a foothold and collecting sensitive information from the affected governmental entities,\" Rochberger said. \"This campaign highlights how attackers continue to find new ways to abuse legitimate, trusted cloud services.\"\nHazyBeacon reflects a broader trend of advanced persistent threats using trusted platforms as covert channels—a tactic often referred to as \"living-off-trusted-services\" (LOTS). As part of this cloud-based malware cluster, similar techniques have been observed in threats using Google Workspace, Microsoft Teams, or Dropbox APIs to evade detection and facilitate persistent access.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Securing Agentic AI: How to Protect the Invisible Identity Access",
        "Link": "https://thehackernews.com/2025/07/securing-agentic-ai-how-to-protect.html",
        "Summary": "AI agents promise to automate everything from financial reconciliations to incident response. Yet every time an AI agent spins up a workflow, it has to authenticate somewhere; often with a high-privilege API key, OAuth token, or service account that defenders can’t easily see. These “invisible” non-human identities (NHIs) now outnumber human accounts in most cloud environments, and they have",
        "Date": "2025-07-15",
        "Content": "AI agents promise to automate everything from financial reconciliations to incident response. Yet every time an AI agent spins up a workflow, it has to authenticate somewhere; often with a high-privilege API key, OAuth token, or service account that defenders can't easily see. These \"invisible\" non-human identities (NHIs) now outnumber human accounts in most cloud environments, and they have become one of the ripest targets for attackers.\nAstrix's Field CTO Jonathan Sander put it bluntly in a recent\nHacker News webinar\n:\n\"One dangerous habit we've had for a long time is trusting application logic to act as the guardrails. That doesn't work when your AI agent is powered by LLMs that don't stop and think when they're about to do something wrong. They just do it.\"\nWhy AI Agents Redefine Identity Risk\nAutonomy changes everything:\nAn AI agent can chain multiple API calls and modify data without a human in the loop. If the underlying credential is exposed or overprivileged, each additional action amplifies the blast radius.\nLLMs behave unpredictably:\nTraditional code follows deterministic rules; large language models operate on probability. That means you cannot guarantee how or where an agent will use the access you grant it.\nExisting IAM tools were built for humans:\nMost identity governance platforms focus on employees, not tokens. They lack the context to map which NHIs belong to which agents, who owns them, and what those identities can actually touch.\nTreat AI Agents Like First-Class (Non-Human) Users\nSuccessful security programs already apply \"human-grade\" controls like birth, life, and retirement to service accounts and machine credentials.\nExtending the same discipline to AI agents delivers quick wins\nwithout blocking business innovation.\nHuman Identity Control\nHow It Applies to AI Agents\nOwner assignment\nEvery agent must have a named human owner (for example, the developer who configured a Custom GPT) who is accountable for its access.\nLeast privilege\nStart from read-only scopes, then grant narrowly scoped write actions the moment the agent proves it needs them.\nLifecycle governance\nDecommission credentials the moment an agent is deprecated, and rotate secrets automatically on a schedule.\nContinuous monitoring\nWatch for anomalous calls (e.g., sudden spikes to sensitive APIs) and revoke access in real time.\nSecure AI Agent Access\nEnterprises shouldn't have to choose between security and agility.\nAstrix makes it easy to protect innovation without slowing it down, delivering all essential controls in one intuitive platform:\n1.\nDiscovery and Governance\nAutomatically discover and map all AI agents, including external and homegrown agents, with context into their associated NHIs, permissions, owners, and accessed environments. Prioritize remediation efforts based on automated risk scoring based on agent exposure levels and configuration weaknesses.\n2.\nLifecycle management\nManage AI agents and the NHIs they rely on from provisioning to decommissioning through automated ownership, policy enforcement, and streamlined remediation processes, without the manual overhead.\n3.\nThreat detection & response\nContinuously monitor AI agent activity to detect deviations, out-of-scope actions, and abnormal behaviors, while automating remediation with real-time alerts, workflows, and investigation guides.\nThe Instant Impact: From Risk to ROI in 30 Days\nWithin the first month of deploying Astrix, our customers consistently report three transformative business wins within the first month of deployment:\nReduced risk, zero blind spots\nAutomated discovery\nand a single source of truth for every AI agent, NHI, and secret reveal unauthorized third-party connections, over-entitled tokens, and policy violations the moment they appear. Short-lived, least-privileged identities prevent credential sprawl before it starts.\n\"Astrix gave us full visibility into high-risk NHIs and helped us take action without slowing down the business.\"\n-\nAlbert Attias\n, Senior Director at Workday. Read Workday's success story\nhere\n.\nAudit-ready compliance, on demand\nMeet compliance requirements\nwith scoped permissions, time-boxed access, and per-agent audit trails. Events are stamped at creation, giving security teams instant proof of ownership for regulatory frameworks such as NIST, PCI, and SOX, turning board-ready reports into a click-through exercise.\n\"With Astrix, we gained visibility into over 900 non-human identities and automated ownership tracking, making audit prep a non-issue\"\n-\nBrandon Wagner\n, Head of Information Security at Mercury. Read Mercury's success story\nhere\n.\nProductivity increased, not undermined\nAutomated remediation\nenables engineers to integrate new AI workflows without waiting on manual reviews, while security gains real-time alerts for any deviation from policy. The result: faster releases, fewer fire drills, and a measurable boost to innovation velocity.\n\"The time to value was much faster than other tools. What could have taken hours or days was compressed significantly with Astrix\"\n-\nCarl Siva\n, CISO at Boomi. Read Boomi's success story\nhere\n.\nThe Bottom Line\nAI agents unlock historic productivity, yet they also magnify the identity problem security teams have wrestled with for years. By treating every agent as an NHI, applying least privilege from day one, and leaning on automation for continuous enforcement, you can help your business embrace AI safely, instead of cleaning up the breach after attackers exploit a forgotten API key.\nReady to see your invisible identities? Visit\nastrix.security\nand schedule a live demo to map every AI agent and NHI in minutes.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "AsyncRAT's Open-Source Code Sparks Surge in Dangerous Malware Variants Across the Globe",
        "Link": "https://thehackernews.com/2025/07/asyncrats-open-source-code-sparks-surge.html",
        "Summary": "Cybersecurity researchers have charted the evolution of a widely used remote access trojan called AsyncRAT, which was first released on GitHub in January 2019 and has since served as the foundation for several other variants.\n\"AsyncRAT has cemented its place as a cornerstone of modern malware and as a pervasive threat that has evolved into a sprawling network of forks and variants,\" ESET",
        "Date": "2025-07-15",
        "Content": "Cybersecurity researchers have charted the evolution of a widely used remote access trojan called\nAsyncRAT\n, which was first released on GitHub in January 2019 and has since served as the foundation for several other variants.\n\"AsyncRAT has cemented its place as a cornerstone of modern malware and as a pervasive threat that has evolved into a sprawling network of forks and variants,\" ESET researcher Nikola Knežević\nsaid\nin a report shared with The Hacker News.\n\"While its capabilities are not that impressive on their own, it is the open-source nature of AsyncRAT that has truly amplified its impact. Its plug-in-based architecture and ease of modification have sparked the proliferation of many forks, pushing the boundaries even further\"\nWhile AsyncRAT's evolution highlights its technical adaptability, its real-world impact stems from how it's deployed in opportunistic phishing campaigns and bundled with loaders like GuLoader or SmokeLoader. These delivery methods enable rapid distribution through cracked software, malicious ads, or fake updates -- targeting users in both corporate and consumer environments. Without early detection, AsyncRAT often acts as a tool for information theft and remote control.\nFirst\npublished\non GitHub by NYAN CAT, the C#-based malware is equipped to capture screenshots, log keystrokes, steal credentials, and allow attackers to commandeer infected systems stealthily, exfiltrate data, and execute malicious instructions.\nThe modular tool's simplicity and open-source nature, coupled with its modular architecture and enhanced stealth features, has not only made it very adaptable and harder to detect, but also an attractive option for threat actors, as\nevidenced\nby the\nmyriad\ncampaigns\ndistributing\nthe\nthreat\nover the years\n.\nThe Slovak cybersecurity company said the \"groundwork\" for AsyncRAT was laid earlier by another open-source RAT known as\nQuasar RAT\n(aka CinaRAT or Yggdrasil) that has been available on GitHub since 2015. Although both the malware strains are coded in C#, the wide-ranging differences between them suggest that AsyncRAT was much more than a fork: It was a major rewrite.\nThe two pieces of malware are united by the use of the same custom cryptography classes used to decrypt the malware configuration settings. Since the release of AsyncRAT, the malware has spawned diverse variants, including\nDCRat\n(aka DarkCrystal RAT) and\nVenom RAT\n.\nDCRat marks a significant improvement over AsyncRAT, packing in evasion techniques to fly under the radar and augmenting its capabilities to gather webcam data, microphone recordings, and Discord tokens, alongside even a module to encrypt files.\n\"DCRat also implements evasion techniques like AMSI and ETW patching, which work by disabling security features that detect and log malicious behavior,\" ESET said. \"Addi5onally, it features an anti-process system whereby processes whose names match those in a denylist are terminated.\"\nVenom RAT, on the other hand, is said to have been inspired by DCRat, while also packing in enough unique features of its own.\n\"While they indeed belong to the Quasar RAT family, they are still different RATs,\" Rapid7 researcher Anna Širokova\nnoted\nin an analysis of AsyncRAT and Venom RAT in November 2024. \"Venom RAT presents more advanced evasion techniques, making it a more sophisticated threat.\"\nESET said it also identified lesser-known variants of AsyncRAT, such as\nNonEuclid RAT\n, which incorporates plugins to brute-force SSH and FTP credentials, collect geolocation, act as a\nclipper\nby substituting clipboard data with the attacker's cryptocurrency wallet addresses, and even spread the malware by compromising portable executable files with an arbitrary payload.\nJasonRAT, for its part, introduces bespoke changes of its own, such as the ability to target systems based on country. Likewise,\nXieBroRAT\nfeatures a browser credential stealer and a plugin to interact with Cobalt Strike servers via a reverse connection. It's also\nadapted\nfor the Chinese market.\n\"AsyncRAT's rise and its subsequent forks highlight the inherent risks of open-source malware frameworks,\" ESET said. \"All of these forks not only extend AsyncRAT's technical capabilities but also demonstrate how quickly and creatively threat actors can adapt and repurpose open-source code.\"\n\"The widespread availability of such frameworks significantly lowers the barrier to entry for aspiring cybercriminals, enabling even novices to deploy sophisticated malware with minimal eﬀort. This democratization of malware development – especially considering the rising popularity of LLMs and potential to misuse their capabilities – further accelerates the creation and customization of malicious tools, contributing to a rapidly expanding and increasingly complex threat landscape.\"\nThis shift has also fueled the rise of malware-as-a-service (MaaS), where preconfigured AsyncRAT builders and plug-and-play modules are sold openly on Telegram and dark web forums. The growing overlap between open-source malware, penetration testing tools, and commercial remote access frameworks complicates attribution and defense.\nFor security teams, this means greater focus on behavioral detection, command-and-control (C2) analysis, and understanding how fileless persistence, clipboard hijacking, and credential theft converge in modern malware campaigns.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "North Korean Hackers Flood npm Registry with XORIndex Malware in Ongoing Attack Campaign",
        "Link": "https://thehackernews.com/2025/07/north-korean-hackers-flood-npm-registry.html",
        "Summary": "The North Korean threat actors linked to the Contagious Interview campaign have been observed publishing another set of 67 malicious packages to the npm registry, underscoring ongoing attempts to poison the open-source ecosystem via software supply chain attacks.\nThe packages, per Socket, have attracted more than 17,000 downloads, and incorporate a previously undocumented version of a malware",
        "Date": "2025-07-15",
        "Content": "The North Korean threat actors linked to the Contagious Interview campaign have been observed publishing another set of 67 malicious packages to the npm registry, underscoring ongoing attempts to poison the open-source ecosystem via software supply chain attacks.\nThe packages, per Socket, have attracted more than 17,000 downloads, and incorporate a previously undocumented version of a malware loader codenamed\nXORIndex\n. The activity is an expansion of an attack wave\nspotted\nlast month that involved the distribution of 35 npm packages that deployed another loader referred to as HexEval.\n\"The Contagious Interview operation continues to follow a whack-a-mole dynamic, where defenders detect and report malicious packages, and North Korean threat actors quickly respond by uploading new variants using the same, similar, or slightly evolved playbooks,\" Socket researcher Kirill Boychenko\nsaid\n.\nContagious Interview is the name assigned to a long-running campaign that seeks to entice developers into downloading and executing an open-source project as part of a purported coding assignment. First publicly disclosed in late 2023, the threat cluster is also tracked as DeceptiveDevelopment, Famous Chollima, Gwisin Gang, Tenacious Pungsan, UNC5342, and Void Dokkaebi.\nThe activity is believed to be\ncomplementary\nto Pyongyang's infamous remote information technology (IT) worker scheme, adopting the strategy of targeting developers already employed in companies of interest rather than applying for a job.\nThe attack chains using malicious npm packages are fairly straightforward in that they serve as a conduit for a known JavaScript loader and stealer called BeaverTail, which is subsequently used to extract data from web browsers and cryptocurrency wallets, as well as deploy a Python backdoor referred to as InvisibleFerret.\n\"The two campaigns now operate in parallel. XORIndex has accumulated over 9,000 downloads in a short window (June to July 2025), while HexEval continues at a steady pace, with more than 8,000 additional downloads across the newly discovered packages,\" Boychenko said.\nThe XORIndex Loader, like HexEval, profiles the compromised machine and uses endpoints associated with hard-coded command-and-control (C2) infrastructure to obtain the external IP address of the host. The collected information is then beaconed to a remote server, after which BeaverTail is launched.\nFurther analysis of these packages has uncovered a steady evolution of the loader, progressing from a bare-bones prototype to a sophisticated, stealthier malware. Early iterations have been found to lack in obfuscation and reconnaissance capabilities, while keeping their core functionality intact, with second and third-generation versions introducing rudimentary system reconnaissance capabilities.\n\"Contagious Interview threat actors will continue to diversify their malware portfolio, rotating through new npm maintainer aliases, reusing loaders such as HexEval Loader and malware families like BeaverTail and InvisibleFerret, and actively deploying newly observed variants including XORIndex Loader,\" Boychenko said.\nThe disclosure comes as Safety revealed that cybercriminals with ties to Russia published 10 npm packages that are designed to compromise Windows systems with a PowerShell payload retrieved from a remote server that, in turn, delivers a stealer capable of grabbing data from web browsers and likely launching a cryptocurrency miner.\n\"More worryingly, they have also manipulated npm download metrics to make their packages appear to have millions of downloads, lending false legitimacy to their malicious code,\" security researcher Paul McCarty\nsaid\n.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "OpenAI's image model gets built-in style feature on ChatGPT",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openais-image-model-gets-built-in-style-feature-on-chatgpt/",
        "Summary": "OpenAI's image gen model, which is available via ChatGPT for free, now lets you easily create AI images even if you're not familiar with trends or prompt engineering. [...]",
        "Date": "2025-07-15",
        "Content": "OpenAI's image gen model, which is available via ChatGPT for free, now lets you easily create AI images even if you're not familiar with trends or prompt engineering.\nRight now, if you want to create outstanding anime art, you need to come up with a very well-written prompt, and then ChatGPT will process your request.\nWhile prompt engineering is necessary, you might not always get the quality you're expecting from the AI.\nGPT Styles\nSource: BleepingComputer.com\nTo help you easily create images in different styles, ChatGPT has been quietly updated with a new 'Style' feature, which allows you to select a predefined prompt and convert images into the desired state.\nFor example, if you upload your own picture and select the 'anime' style, ChatGPT will create something realistic and possibly similar to Ghibli art.\nThis feature is rolling out to everyone for free.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nOpenAI says GPT-5 will unify breakthroughs from different models\nChatGPT is testing disruptive Study Together feature\nLeaks hint at Operator-like tool in ChatGPT ahead of GPT-5 launch\nOpenAI confirms threat actors use ChatGPT to write malware\nChatGPT's AI coder Codex now lets you choose the best solution"
    },
    {
        "Title": "Abacus dark web drug market goes offline in suspected exit scam",
        "Link": "https://www.bleepingcomputer.com/news/security/abacus-dark-web-drug-market-goes-offline-in-suspected-exit-scam/",
        "Summary": "Abacus Market, the largest Western darknet marketplace supporting Bitcoin payments, has shut down its public infrastructure in a move suspected to be an exit scam. [...]",
        "Date": "2025-07-15",
        "Content": "Abacus Market, the largest Western darknet marketplace supporting Bitcoin payments, has shut down its public infrastructure in a move suspected to be an exit scam.\nExit scams occur when the operator of a marketplace decides to vanish with the money they hold in escrow for various transactions between platform users.\nBlockchain intelligence firm\nTRM Labs reports\nthat Abacus shutting down so abruptly has all the indications of either an exit scam or a covert law enforcement operation dismantling the activity.\nHistorically, there have been “silent” takedowns that weren’t accompanied by announcements from the authorities, to allow investigations to continue unobstructed and gather more incriminating evidence or identify accomplices.\nThe Abacus Market frontpage advertising illicit substances\nSource: TRM Labs\nLeading force\nAbacus launched in September 2021 as ‘Alphabet Market,’ and gradually increased its popularity, especially as the number of other markets on the dark web dwindled, mostly as a result of law enforcement actions.\nIn 2022, Abacus was used by 10% of the users on Western darknet markets. It grew to 17% in 2023 and reached a leading status of 70% last year.\nAbacus dominating the market share in 2024\nSource: TRM Labs\nTRM Labs reports that the market had enabled transactions of nearly $100 million worth of Bitcoin but the figure does not include Monero (XMR) cryptocurrency, which requires special conditions to track and accounts for at least two-thirds of all transactions on Abacus.\nConsidering Monero transactions, the researchers estimate that total sales on Abacus were likely closer to at least $300 million. The best month for the darkweb market was this June, when the value of brokered sales peaked at $6.3 million.\nIn what concerns user deposits, TRM Labs reports that the platform received last month an average of $230,000 per day, across 1,400 transactions.\nThis figure dropped quickly in early July, to just $13,000 a day across 100 deposits, as user trust was quickly affected by withdrawal delays.\nExit scam unfolding\nWhen user complaints surfaced, Abacus’ administrator, “Vito,” said on the darknet forum Dread that the reasons behind withdrawal problems were a sudden influx of new users following the\nrecent shut-down of Archetyp Market\n, combined with a distributed denial-of-service (DDoS) attack.\nAdmin's explanation on Dread\nSource: TRM Labs\nDespite Vito's assurances, daily transaction activity on the site dropped.\nIn the days that followed, Abacus Market’s entire online infrastructure, including its clearnet mirror, went offline without a seizure banner or any indication that law enforcement was involved.\nCommunity consensus and users close to the Abacus team ruled out an FBI operation as a likely reason, leaning more towards an exit scam explanation for the sudden takedown of the platform.\nAt publishing time there is no indication that Abacus has been taken down by law enforcement but this scenario is not to be ruled out yet.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nPolice seizes Archetyp Market drug marketplace, arrests admin\n‘Russian Market’ emerges as a go-to shop for stolen credentials\nPolice arrests 270 dark web vendors, buyers in global crackdown"
    },
    {
        "Title": "Windows KB5064489 emergency update fixes Azure VM launch issues",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-kb5064489-emergency-update-fixes-azure-vm-launch-issues/",
        "Summary": "Microsoft has released an emergency update to fix a bug that prevents Azure virtual machines from launching when the Trusted Launch setting is disabled and Virtualization-Based Security (VBS) is enabled. [...]",
        "Date": "2025-07-15",
        "Content": "Microsoft has released an emergency update to fix a bug that prevents Azure virtual machines from launching when the Trusted Launch setting is disabled and Virtualization-Based Security (VBS) is enabled.\nThe bug impacted Windows Server 2025 and Windows 11 24H2 and was introduced during the\nJuly Patch Tuesday security updates\n.\n\"This update addresses an issue that prevented some virtual machines (VMs) from starting when Virtualization-Based Security (VBS) was enabled,\"\nexplains Microsoft\n.\n\"It affected VMs using version 8.0 (a non-default version) where VBS was offered by the host. In Azure, this applies to standard (non–Trusted Launch) General Enterprise (GE) VMs running on older VM SKUs.\"\n\"The problem was caused by a secure kernel initialization issue.\"\nTrusted Launch is an Azure feature that uses Secure Boot and a virtual Trusted Platform Module (vTPM) to protect virtual machines against bootkits and other low-level threats.\nOn Sunday, Microsoft released the\nKB5064489\nout-of-band update for Windows 11 24H2 and Windows Server 2025, which fixes the kernel initialization issue that prevented the VMs from launching.\nMicrosoft says that admins can determine if this bug would impact their VMs by performing these steps:\n​Check if your VM is created as \"Standard\".\n​Check if VBS is enabled. Open System Information (msinfo32.exe) and confirm that Virtualization-based security is running and that the Hyper-V role is not installed in the VM.\nIf you are impacted, Microsoft recommends installing this out-of-band update instead of the July 8th KB5062553 Patch Tuesday update. The company also says you can prevent this issue by using the\nTrusted Launch\nsecurity feature.\nMicrosoft has also updated the\nWindows Server 2025 VM images\nto include the newer cumulative update that fixes this bug.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nWindows Server emergency update fixes Hyper-V VM freezes, restart issues\nWindows 11 now uses JScript9Legacy engine for improved security\nMicrosoft fixes ‘Print to PDF’ feature broken by Windows update\nMicrosoft fixes known issue that breaks Windows 11 updates\nMicrosoft confirms Family Safety blocks Google Chrome from launching"
    },
    {
        "Title": "North Korean XORIndex malware hidden in 67 malicious npm packages",
        "Link": "https://www.bleepingcomputer.com/news/security/north-korean-xorindex-malware-hidden-in-67-malicious-npm-packages/",
        "Summary": "North Korean threat actors planted 67 malicious packages in the Node Package Manager (npm) online repository to deliver a new malware loader called XORIndex to developer systems. [...]",
        "Date": "2025-07-15",
        "Content": "North Korean threat actors planted 67 malicious packages in the Node Package Manager (npm) online repository to deliver a new malware loader called XORIndex to developer systems.\nThe packages collectively count more than 17,000 downloads and were discovered by researchers at package security platform Socket, who assess them to be part of the continued Contagious Interview operation.\nSocket researchers say that the campaign follows threat activity detected since April. Last month, the same actor infiltrated npm with\n35 packages\nthat dropped information stealers and backdoors onto developers’ devices.\nTimeline of the latest attack waves\nSource: Socket\nOverview of the attacks\nContagious Interview\nis a North Korean state-backed campaign that targets mostly developers with fake job offers to trick them into running malicious code on their systems.\nThe purpose varies from collecting sensitive information that allows breaching companies to stealing cryptocurrency assets.\nThe Node Package Manager (npm) is the default package manager for Node.js, a platform where developers publish and install JavaScript libraries and tools. It is widely used in web development, but also frequently exploited by threat actors for malware distribution.\nOut of the 67 packages the threat actors uploaded onto npm this time, there are several that appear to mimic or blend the names of legitimate software projects and libraries, like:\nvite-meta-plugin\nvite-postcss-tools\nvite-logging-tool\nvite-proc-log\npretty-chalk\npostcss-preloader\njs-prettier\nflowframe\nfigwrap\nmidd-js, middy-js\nWhen victims install any of these packages, a ‘postinstall’ script executes to launch XORIndex Loader, a novel tool that appears to be used in parallel with HexEval Loader, a malware dropper observed in past attacks.\nXORIndex Loader collects host data to profile each victim and sends it to a hardcoded command and control (C2) address, hosted on infrastructure from Vercel cloud application company.\nThe C2 server responds with one or more JavaScript payloads, which are executed on the victim’s system using eval(). These payloads are typically the BeaverTail and the InvisibleFerret backdoor, both attributed to North Korean Contagious Interview operations.\nThe two pieces of malware provide access to compromised machines, allow data exfiltration, and can download more payloads.\nAccording to the researchers, the North Korean hackers blend old and new tools with subtle modifications to evade detection, and every time npm cleans an infection, they return via different npm accounts and package names.\n“Contagious Interview threat actors will continue to diversify their malware portfolio, rotating through new npm maintainer aliases, reusing loaders such as HexEval Loader and malware families like BeaverTail and InvisibleFerret, and actively deploying newly observed variants including XORIndex Loader” - Socket\n“Defenders should expect continued iterations of these loaders across newly published packages, often with slight variations to evade detection,” the researchers warn.\nSocket researchers say that they reported to npm all malicious packages from the latest campaign but some of them may still be available in the repository.\nIt is important to double-check sourced packages to ensure they’re not typosquatting decoys, only trust well-known projects and publishers with a proven record, and scrutinize recent repository activity for signs of automation.\nWhen possible, always examine the source code for obfuscation and execute new libraries in isolated environments to evaluate their safety.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nNew wave of ‘fake interviews’ use 35 npm packages to spread malware\nMalware found in NPM packages with 1 million weekly downloads\nDozens of malicious packages on NPM collect host and network data\nNorth Korean hackers deepfake execs in Zoom call to spread Mac malware\nMalicious NPM package uses Unicode steganography to evade detection"
    },
    {
        "Title": "Police disrupt “Diskstation” ransomware gang attacking NAS devices",
        "Link": "https://www.bleepingcomputer.com/news/security/police-disrupt-diskstation-ransomware-gang-attacking-nas-devices/",
        "Summary": "An international law enforcement action dismantled a Romanian ransomware gang known as 'Diskstation,' which encrypted the systems of several companies in the Lombardy region, paralyzing their businesses. [...]",
        "Date": "2025-07-15",
        "Content": "An international law enforcement action dismantled a Romanian ransomware gang known as 'Diskstation,' which encrypted the systems of several companies in the Lombardy region, paralyzing their businesses.\nThe law enforcement operation codenamed 'Operation Elicius' was coordinated by Europol and also involved police forces in France and Romania.\nDiskstation is a ransomware operation that targets Synology Network-Attached Storage (NAS) devices, which are commonly used by companies for centralized file storage and sharing, data backup and recovery, and general content hosting.\nThe ransomware operation has been targeting NAS devices worldwide since 2021 under various names, including \"DiskStation Security\", \"Quick Security\", \"LegendaryDisk Security\", \"7even Security\", and \"Umbrella Security\".\nThe attacks targeted internet-exposed NAS devices, whose files were encrypted, demanding ransom payments ranging from $10,000 to hundreds of thousands of dollars.\nDiskStation ransom note\nSource: BleepingComputer\nAn announcement by the Postal and Cybersecurity Police Service explains that companies targeted by Diskstation experienced severe systems outages and business disruption.\n\"These companies had experienced encryption of data on their IT systems, resulting in the complete 'paralysis' of their production processes,\"\nreads the announcement\n.\n\"To regain access to their data and resume operations, the victims were required to pay a substantial ransom in cryptocurrency to the cybercriminals.\"\nVictims who reported the incidents to the police include graphic and film production firms, event organizers, and international NGOs active in civil rights and charity work.\nThe investigations, led by the Milan Prosecutor's Office, focused on the forensic analysis of compromised systems as well as blockchain analysis to trace ransom payments.\nWithin a few months, the investigators identified several suspects, which enabled international law enforcement partners to conduct raids at the specified Bucharest residences in June 2024.\nThese raids provided additional evidence to back the police's suspicions and also led to the arrests of people caught in the act of committing crimes.\nLaw enforcement arrested a 44-year-old Romanian man who is suspected of being the primary operator behind the attacks, who is now in pre-trial detention to face charges for unauthorized access to computer systems and extortion.\nTo protect NAS devices from unauthorized access or ransomware attacks, ensure they run the latest available firmware, turn off unnecessary services (such as Telnet, rsync, and UPnP), do not expose them to the internet and restrict access to VPNs.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nRyuk ransomware’s initial access expert extradited to the U.S.\nPolice arrest Conti and LockBit ransomware crypter specialist\nInterlock ransomware adopts new FileFix attack to push malware\nFour arrested in UK over M&S, Co-op, Harrods cyberattacks\nRussian pro basketball player arrested for alleged role in ransomware attacks"
    },
    {
        "Title": "Android malware Konfety uses malformed APKs to evade detection",
        "Link": "https://www.bleepingcomputer.com/news/security/android-malware-konfety-uses-malformed-apks-to-evade-detection/",
        "Summary": "A new variant of the Konfety Android malware emerged with a malformed ZIP structure along with other obfuscation methods that allow it to evade analysis and detection. [...]",
        "Date": "2025-07-15",
        "Content": "A new variant of the Konfety Android malware emerged with a malformed ZIP structure along with other obfuscation methods that allow it to evade analysis and detection.\nKonfety poses as a legitimate app, mimicking innocuous products available on Google Play, but features none of the promised functionality.\nThe capabilities of the malware include redirecting users to malicious sites, pushing unwanted app installs, and fake browser notifications.\nInstead, it fetches and renders hidden ads using the CaramelAds SDK and exfiltrates information such as installed apps, network configuration, and system information.\nUnwanted ads and redirects triggered by Konfety\nSource: Zimperium\nAlthough Konfety isn't a spyware or RAT tool, it includes an encrypted secondary DEX file inside the APK, which is decrypted and loaded at runtime, containing hidden services declared in the AndroidManifest file.\nThis leaves the door open for installing additional modules dynamically, thus allowing the delivery of more dangerous capabilities on current infections.\nEvasion tactics\nResearchers at mobile security platform\nZimperium discovered\nand analyzed the latest Konfety variant and report that the malware uses several methods to obfuscate its real nature and activity.\nKonfety tricks victims into installing it by copying the name and branding of legitimate apps are available on Google Play and distributing it through third-party stores - a tactic that researchers at\nHuman called \"evil twin\"\nor \"decoy twin.\"\nThe operators of the malware are promoting it on third-party app stores.\nThese marketplaces are often where users look for \"free\" variants of premium apps because they want to avoid Google tracking, have an Android device that is no longer supported, or don't have access to Google services.\nThe dynamic code loading, where the malicious logic is hidden in an encrypted DEX file that loads at runtime, is another effective obfuscation and evasion mechanism that Konfety employs.\nAnother uncommon anti-analysis strategy in Konfety is to manipulate the APK files in a way that confuses or breaks static analysis and reverse engineering tools.\nFirst, the APK sets the General Purpose Bit Flag to 'bit 0,' signaling that the file is encrypted, even though it is not. This triggers false password prompts when trying to inspect the file, blocking or delaying access to the APK's contents.\nSecondly, critical files in the APK are declared using BZIP compression (0x000C), which isn't supported by analysis tools like APKTool and JADX, resulting in a parsing failure.\nAnalysis tools crashing when trying to parse the malicious APK\nSource: Zimperium\nMeanwhile, Android ignores the declared method and falls back to default processing to maintain stability, allowing the malicious app to install and run on the device without issue.\nAfter installation, Konfety hides its app icon and name and uses geofencing to change behavior according to the victim's region.\nCompression-based obfuscation has been observed in the past in Android malware, as highlighted in a Kaspersky report from April 2024 on\nSoumniBot malware\n.\nIn that case, SoumniBot declared an invalid compression method in AndroidManifest.xml, declared a fake file size and data overlay, and confused analysis tools with very large namespace strings.\nIt is typically recommended to avoid installing APK files from third-party Android app stores and only trust software from publishers you know.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nAndroid malware Anatsa infiltrates Google Play to target US banks\nMalware on Google Play, Apple App Store stole your photos—and crypto\nGodfather Android malware now uses virtualization to hijack banking apps\nAndroid malware Crocodilus adds fake contacts to spoof trusted callers\nGoogle reveals details on Android’s Advanced Protection for Chrome"
    },
    {
        "Title": "OpenAI's ChatGPT-powered browser is codenamed 'Aura'",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openais-chatgpt-powered-browser-is-codenamed-aura/",
        "Summary": "OpenAI is following Perplexity and is working on its own AI-powered browser codenamed \"Aura.\" [...]",
        "Date": "2025-07-15",
        "Content": "OpenAI is following Perplexity and is working on its own AI-powered browser codenamed \"Aura.\"\nX user Tibor\nfound\nreferences to \"Aura,\" which is probably the codename for the new OpenAI browser.\nThere are already mentions of \"is Aura\" (\"mini-root,\" which is similar to checks for Android, iOS, or Electron/ChatGPT Windows desktop app), \"is Aura Sidebar,\" and \"in Aura\" in the ChatGPT web app.\nReuters previously\nreported\nthat OpenAI is building a Chromium-based Chrome alternative that will use generative and agentic AI capabilities to transform the web browsing experience.\nOpenAI also expressed interest in acquiring Chrome if the US vs Google antitrust trials go against the search engine giant.\nWhile that may or may not happen, OpenAI is exploring its own browser for now, and it could debut across all platforms because Chromium is always in a ready state.\nIn addition to a new browser, OpenAI is working on the GPT-5 model, which will combine breakthroughs from all different models to deliver the best experience.\nOpenAI is also testing a computer agent support inside ChatGPT's chain of thoughts, but details are unavailable right now.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nChatGPT's AI coder Codex now lets you choose the best solution\nChatGPT o3 API 80% price drop has no impact on performance\nOpenAI plans to ship an interesting ChatGPT product by 2026\nOpenAI plans to combine multiple models into GPT-5\nOpenAI's image model gets built-in style feature on ChatGPT"
    },
    {
        "Title": "Lessons Learned From McDonald's Big AI Flub",
        "Link": "https://www.darkreading.com/application-security/lessons-learned-mcdonalds-ai-flub",
        "Summary": "McDonald's hiring platform was using its original default credentials and inadvertently exposed information belonging to approximately 64 million job applicants.",
        "Date": "2025-07-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/lessons-learned-mcdonalds-ai-flub"
    },
    {
        "Title": "AI Is Reshaping How Attorneys Practice Law",
        "Link": "https://www.darkreading.com/cyber-risk/ai-is-reshaping-how-attorneys-practice-law",
        "Summary": "Experts recommend enhanced AI literacy, training around the ethics of using AI, and verification protocols to maintain credibility in an increasingly AI-influenced courtroom.",
        "Date": "2025-07-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/ai-is-reshaping-how-attorneys-practice-law"
    },
    {
        "Title": "AsyncRAT Spawns Concerning Labyrinth of Forks",
        "Link": "https://www.darkreading.com/remote-workforce/async-rat-labyrinth-forks",
        "Summary": "Since surfacing on GitHub in 2019, AsyncRAT has become a poster child for how open source malware can democratize cybercrime, with a mazelike footprint of variants available across the spectrum of functionality.",
        "Date": "2025-07-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/async-rat-labyrinth-forks"
    },
    {
        "Title": "Attackers Abuse AWS Cloud to Target Southeast Asian Governments",
        "Link": "https://www.darkreading.com/cloud-security/attackers-abuse-aws-southeast-asian-governments-novel-rat",
        "Summary": "The intelligence-gathering cyber campaign introduces the novel HazyBeacon backdoor and uses legitimate cloud communication channels for command-and-control (C2) and exfiltration to hide its malicious activities.",
        "Date": "2025-07-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/attackers-abuse-aws-southeast-asian-governments-novel-rat"
    },
    {
        "Title": "How Criminal Networks Exploit Insider Vulnerabilities",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/criminal-networks-exploit-insider-vulnerabilities",
        "Summary": "Criminal networks are adapting quickly, and they're betting that companies won't keep pace. Let's prove them wrong.",
        "Date": "2025-07-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/criminal-networks-exploit-insider-vulnerabilities"
    },
    {
        "Title": "MITRE Launches AADAPT Framework for Financial Systems",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/mitre-aadapt-framework-financial-systems",
        "Summary": "The new framework is modeled after and meant to complement the MITRE ATT&amp;CK framework, and it is aimed at detecting and responding to cyberattacks on cryptocurrency assets and other financial targets.",
        "Date": "2025-07-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/mitre-aadapt-framework-financial-systems"
    },
    {
        "Title": "DOGE Denizen Marko Elez Leaked API Key for xAI",
        "Link": "https://krebsonsecurity.com/2025/07/doge-denizen-marko-elez-leaked-api-key-for-xai/",
        "Summary": "Marko Elez, a 25-year-old employee at Elon Musk's Department of Government Efficiency (DOGE), has been granted access to sensitive databases at the U.S. Social Security Administration, the Treasury and Justice departments, and the Department of Homeland Security. So it should fill all Americans with a deep sense of confidence to learn that Mr. Elez over the weekend inadvertently published a private key that allowed anyone to interact directly with more than four dozen large language models (LLMs) developed by Musk's artificial intelligence company xAI.",
        "Date": "2025-07-15",
        "Content": "Marko Elez, a 25-year-old employee at Elon Musk’s Department of Government Efficiency (DOGE), has been granted access to sensitive databases at the U.S. Social Security Administration, the Treasury and Justice departments, and the Department of Homeland Security. So it should fill all Americans with a deep sense of confidence to learn that Mr. Elez over the weekend inadvertently published a private key that allowed anyone to interact directly with more than four dozen large language models (LLMs) developed by Musk’s artificial intelligence company xAI.\nImage: Shutterstock, @sdx15.\nOn July 13, Mr. Elez committed a code script to GitHub called “agent.py” that included a private application programming interface (API) key for xAI. The inclusion of the private key was first flagged by GitGuardian, a company that specializes in detecting and remediating exposed secrets in public and proprietary environments. GitGuardian’s systems constantly scan GitHub and other code repositories for exposed API keys, and fire off automated alerts to affected users.\nPhilippe Caturegli, “chief hacking officer” at the security consultancy Seralys, said the exposed API key allowed access to at least 52 different LLMs used by xAI. The most recent LLM in the list was called “grok-4-0709” and was created on July 9, 2025.\nGrok, the generative AI chatbot developed by xAI and integrated into Twitter/X, relies on these and other LLMs (a query to Grok before publication shows Grok currently uses Grok-3, which was launched in Feburary 2025). Earlier today, xAI announced that the Department of Defense will begin using Grok as part of a contract worth up to $200 million. The contract award came less than a week after Grok began spewing antisemitic rants and invoking Adolf Hitler.\nMr. Elez did not respond to a request for comment. The code repository containing the private xAI key was removed shortly after Caturegli notified Elez via email. However, Caturegli said the exposed API key still works and has not yet been revoked.\n“If a developer can’t keep an API key private, it raises questions about how they’re handling far more sensitive government information behind closed doors,” Caturegli told KrebsOnSecurity.\nPrior to joining DOGE, Marko Elez worked for a number of Musk’s companies. His DOGE career began at the Department of the Treasury, and a legal battle over DOGE’s access to Treasury databases showed Elez was sending unencrypted personal information in violation of the agency’s policies.\nWhile still at Treasury, Elez resigned after The Wall Street Journal linked him to social media posts that advocated racism and eugenics. When Vice President J.D. Vance lobbied for Elez to be rehired, President Trump agreed and Musk reinstated him.\nSince his re-hiring as a DOGE employee, Elez has been granted access to databases at one federal agency after another. TechCrunch reported in February 2025 that he was working at the Social Security Administration. In March, Business Insider found Elez was part of a DOGE detachment assigned to the Department of Labor.\nMarko Elez, in a photo from a social media profile.\nIn April, The New York Times reported that Elez held positions at the U.S. Customs and Border Protection and the Immigration and Customs Enforcement (ICE) bureaus, as well as the Department of Homeland Security. The Washington Post later reported that Elez, while serving as a DOGE advisor at the Department of Justice, had gained access to the Executive Office for Immigration Review’s Courts and Appeals System (EACS).\nElez is not the first DOGE worker to publish internal API keys for xAI: In May, KrebsOnSecurity detailed how another DOGE employee leaked a private xAI key on GitHub for two months, exposing LLMs that were custom made for working with internal data from Musk’s companies, including SpaceX, Tesla and Twitter/X.\nCaturegli said it’s difficult to trust someone with access to confidential government systems when they can’t even manage the basics of operational security.\n“One leak is a mistake,” he said. “But when the same type of sensitive key gets exposed again and again, it’s not just bad luck, it’s a sign of deeper negligence and a broken security culture.”\n\r\n         This entry was posted on Monday 14th of July 2025 09:23 PM \r\n         \nMusk and Trump hire only the best.  I doubt there will be any repercussions for his sloppy and dangerous disregard for security.\nNot when those who should hand out the repercussions are clueless, above the law, can do no wrong, and couldn’t care less about who they hurt, even when it’s themselves.\n“Russians don’t take a dump without a plan, son.”\n-Former US Presidential candidate Fred Thompson, ‘acting’\n“One ping, one ping only”  Proceeds to send two pings.\nEveryone knows you can’t trust a Marko Buckaroo.\nLooks like now we have Alfred E. Neuman running the show…\nGeez…appalling. Will we hear about any exfiltration of data from govt databases, or is everyone on the wrecking team now?\nJust one question; how do you “revoke” an API key?  Replace maybe?  (Revocation is possible for X.509 public keys)\nHopefully the application has a way to deny the key. I’m not a developer but you could have a deny list and refuse any connections from keys in the deny list. Also terminate any active sessions using that key.\n@Dave M Yes, that’s how you do it. There is a list of active keys, you remove the compromised key from the list. If it’s not done quickly, then it’s probably because it is “hard to change” (hardcoded in several places) or the key owner does not care. Worse, they might think that it is safe again now that it was “removed”.\nRemembering how, in the olden days of ‘such terrible security’, i.e. the 1990s through some time in the late 2000’s, many firewall rules actually required an IP to match a key to be able to connect to an application. I guess they don’t do that anymore, since everything is so webbed up now. LMAiO.\nThere’s already been evidence of data being exfiltrated to Russia.  Started very early on, I believe it was from Treasury.  It was detected and shut down.\nPerhaps some enterprising hacker with a progressive streak will obtain and leak the personal financials of the current regime, starting with the Tangerine Caligula (and its entire family), Hillbilly Vance and the whole cabinet  — straight through to the five Republican appointees of the Supreme “Court” (five by presidents who lost the popular vote).\nDoes it make you feel better about yourself to call other people names?\nCry harder, magat.\nDoes it make you feel better about yourself when you call other people names?\nRepeat it a third time for effect.\nIt’s pretty bad when your pet beagle is smarter than the smartest people in government.\nYoung, dumb, and full of scum.\nDOGGY DUMB.\nbleepingcomputer.com/news/security/russian-pro-basketball-player-arrested-for-alleged-role-in-ransomware-attacks/\nMarko can’t even dunk.\n“So it should fill all Americans with a deep sense of confidence to learn that Mr. Elez over the weekend inadvertently published a private key”\nI used to read your articles due to the non-biased nature. Now I feel like I’m reading an article from Foxnews or CNN.\nSad….\nAh yes, the sacred neutrality test: if something mildly inconveniences my worldview, it must be propaganda. Look, if your political compass is so wobbly that a cybersecurity report makes you cry “partisan hit piece,” maybe it’s not the article…\nBrian literally reported a dude leaking a private key, and you interpreted it as a political betrayal. That’s not bias, that’s you projecting your own tribal lens onto reality like it’s a Rorschach test. But sure, let’s cancel Krebs for… reporting the news. Classic.\nWondering what your reaction would be to a report of repeated colossal comsec blunders by a regular civil service employee?\nWhere’s the bias in that statement?\nI agree w/you 100% some simply can’t help themselves\nI’m concerned about your reading skills too.\nI think we are looking at a process issue. Its true the security aspect is involved but the root of the problem is the process they use to post code on GitHub, they need to refine the process to avoid this kind of mistake.\nIt takes longer to select a vendor and give them a credit card number than to actually enable repository governance. Secret scanning pre-commit and second approver enforcement are the bare minimum anyone should have for production.\nBrian, you used to be non-partisan and non-political, but now we’re seeing your true colors emerge. It’s fine to publish the screw ups of these so-called experts, but when you throw in the stupid political jabs, it ruins the article.  Too bad; your articles used to be worth reading.\nNot sure how you came away with the conclusion that this is somehow a story about right/left politics. Nevertheless, I release you from your subscription. Be well.\nI don’t see the “political jabs” in your report, as was mentioned by a previous comment.\nI do see a report on sloppy incompetence, or worse, criminal behavior with critical consequences for all of us.\nIt is important to report on it regardless of who may be offended or who the sloppy criminals are connected to. Keep up the investigation and reporting, Brian.\nHam is just being a crybaby.  If his complaints are that thin his skin must be like rice paper.\nThey want you to be a “news reporter” that publishes “just the facts”, once you give your opinion as an expert it suddenly crosses the line, as though they couldn’t draw the conclusion themselves, which is apparently the case.  Keep up the good work.\nOh no! Brian used sarcasm. Sound the alarm! Apparently pointing out that government officials leaking an API key might not instill public confidence is now a full-blown political manifesto. Incredible.\nBut thank you for your bravery in calling out this injustice. Truly, the real victim here is your feelings. Not the compromised API key, not the laughable opsec no, it’s you, because Brian dared to say something that vaguely pricked your partisan bubble. Stay strong, soldier.\nReally ham!! Its amazing to see your lack of reading and understanding. You are the problem with this country. When people like you try to politicize everything. Facts are facts get use to it dude\nOh, no, did your feelings get hurt, snowflake?\nThe true colors of being appalled by the lack of professionalism of the current administration?\nThat’s the color of anyone with a functioning brain.\n“Waaaah, he pointed out incompetence and fraud in the Trump administration, waaaaah.”\nGrow up baby.\nBrian,  thank you for the reporting. It’s sad that reporting inconvenient facts about API key leaks and lapses in security at the highest levels is seen as political.\nKeep up the good work.\nI would like to think this person would be removed the moment this was found out. This is not only extremely dangerous but seems like a malicous actor. Anyone in the Tech field this looks and feels like malicous inside actor. This person needs to be removed and investigated.\nThis person seems like they are a malicous actor. Something we in the tech field worry about. He should be removed and investigated. You dont accidentally do this sort of thing. This is a deliberate act and it would be grounds for investigations.\nIf he wanted to grant access to 3PLA, he could just grant their users access to the model or email them the API keys. This behavior is totally consistent with the incompetent chūni clowns in Elon’s entourage.\n“grounds for investigations”\nOh, Pam Bondi and Kash Patel will put down their Nintendo Switch and get right on that, I’m sure.\nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "Virtual Event Preview: Cloud & Data Security Summit – Tackling Exposed Attack Surfaces in the Cloud",
        "Link": "https://www.securityweek.com/virtual-event-preview-cloud-data-security-summit-2025-tackling-exposed-attack-surfaces-in-the-cloud/",
        "Summary": "<p>Virtual event brings together leading experts, practitioners, and innovators for a full day of insightful discussions and tactical guidance on evolving threats and real-world defense strategies in cloud security. </p>\n<p>The post <a href=\"https://www.securityweek.com/virtual-event-preview-cloud-data-security-summit-2025-tackling-exposed-attack-surfaces-in-the-cloud/\">Virtual Event Preview: Cloud &amp; Data Security Summit – Tackling Exposed Attack Surfaces in the Cloud</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/virtual-event-preview-cloud-data-security-summit-2025-tackling-exposed-attack-surfaces-in-the-cloud/"
    },
    {
        "Title": "Threat Actors Use SVG Smuggling for Browser-Native Redirection",
        "Link": "https://www.securityweek.com/threat-actors-use-svg-smuggling-for-browser-native-redirection/",
        "Summary": "<p>Obfuscated JavaScript code is embedded within SVG files for browser-native redirection to malicious pages.</p>\n<p>The post <a href=\"https://www.securityweek.com/threat-actors-use-svg-smuggling-for-browser-native-redirection/\">Threat Actors Use SVG Smuggling for Browser-Native Redirection</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/threat-actors-use-svg-smuggling-for-browser-native-redirection/"
    },
    {
        "Title": "DDoS Attacks Blocked by Cloudflare in 2025 Already Surpass 2024 Total",
        "Link": "https://www.securityweek.com/ddos-attacks-blocked-by-cloudflare-in-2025-already-surpass-2024-total/",
        "Summary": "<p>Cloudflare has published its quarterly DDoS threat report for Q2 2025 and the company says it has blocked millions of attacks.</p>\n<p>The post <a href=\"https://www.securityweek.com/ddos-attacks-blocked-by-cloudflare-in-2025-already-surpass-2024-total/\">DDoS Attacks Blocked by Cloudflare in 2025 Already Surpass 2024 Total </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/ddos-attacks-blocked-by-cloudflare-in-2025-already-surpass-2024-total/"
    },
    {
        "Title": "Data Breach at Debt Settlement Firm Impacts 160,000 People",
        "Link": "https://www.securityweek.com/data-breach-at-debt-settlement-firm-impacts-160000-people/",
        "Summary": "<p>Pennsylvania-based Century Support Services is disclosing a data breach after its systems were hacked in November 2024. </p>\n<p>The post <a href=\"https://www.securityweek.com/data-breach-at-debt-settlement-firm-impacts-160000-people/\">Data Breach at Debt Settlement Firm Impacts 160,000 People</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/data-breach-at-debt-settlement-firm-impacts-160000-people/"
    },
    {
        "Title": "Zip Security Raises $13.5 Million in Series A Funding",
        "Link": "https://www.securityweek.com/zip-security-raises-13-5-million-in-series-a-funding/",
        "Summary": "<p>Zip Security’s Series A funding round led by Ballistic Ventures will help the company grow its engineering and go-to-market teams.</p>\n<p>The post <a href=\"https://www.securityweek.com/zip-security-raises-13-5-million-in-series-a-funding/\">Zip Security Raises $13.5 Million in Series A Funding</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/zip-security-raises-13-5-million-in-series-a-funding/"
    },
    {
        "Title": "Ransomware Group Claims Attack on Belk",
        "Link": "https://www.securityweek.com/ransomware-group-claims-attack-on-belk/",
        "Summary": "<p>DragonForce says it stole more than 150 gigabytes of data from US department store chain Belk in a May cyberattack.</p>\n<p>The post <a href=\"https://www.securityweek.com/ransomware-group-claims-attack-on-belk/\">Ransomware Group Claims Attack on Belk</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/ransomware-group-claims-attack-on-belk/"
    },
    {
        "Title": "MITRE Unveils AADAPT Framework to Tackle Cryptocurrency Threats",
        "Link": "https://www.securityweek.com/mitre-unveils-aadapt-framework-to-tackle-cryptocurrency-threats/",
        "Summary": "<p>The MITRE AADAPT framework provides documentation for identifying, investigating, and responding to weaknesses in digital asset payments.</p>\n<p>The post <a href=\"https://www.securityweek.com/mitre-unveils-aadapt-framework-to-tackle-cryptocurrency-threats/\">MITRE Unveils AADAPT Framework to Tackle Cryptocurrency Threats </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/mitre-unveils-aadapt-framework-to-tackle-cryptocurrency-threats/"
    },
    {
        "Title": "Sesame Workshop Regains Control of Elmo’s Hacked X Account After Racist Posts",
        "Link": "https://www.securityweek.com/sesame-workshop-regains-control-of-elmos-hacked-x-account-after-racist-posts/",
        "Summary": "<p>The account was compromised over the weekend and Elmo’s 650,000 followers were given antisemitic threats and a reference to the Jeffrey Epstein investigation. </p>\n<p>The post <a href=\"https://www.securityweek.com/sesame-workshop-regains-control-of-elmos-hacked-x-account-after-racist-posts/\">Sesame Workshop Regains Control of Elmo’s Hacked X Account After Racist Posts</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/sesame-workshop-regains-control-of-elmos-hacked-x-account-after-racist-posts/"
    }
]