[
    {
        "Title": "Massive Android Fraud Operations Uncovered: IconAds, Kaleidoscope, SMS Malware, NFC Scams",
        "Link": "https://thehackernews.com/2025/07/mobile-security-alert-352-iconads-fraud.html",
        "Summary": "A mobile ad fraud operation dubbed IconAds that consisted of 352 Android apps has been disrupted, according to a new report from HUMAN.\nThe identified apps were designed to load out-of-context ads on a user's screen and hide their icons from the device home screen launcher, making it harder for victims to remove them, per the company's Satori Threat Intelligence and Research Team. The apps have",
        "Date": "2025-07-03",
        "Content": "A mobile ad fraud operation dubbed\nIconAds\nthat consisted of 352 Android apps has been disrupted, according to a\nnew report\nfrom HUMAN.\nThe identified apps were designed to load out-of-context ads on a user's screen and hide their icons from the device home screen launcher, making it harder for victims to remove them, per the company's Satori Threat Intelligence and Research Team. The apps have since been removed from the Play Store by Google.\nThe ad fraud scheme accounted for 1.2 billion bid requests a day, at the height of its activity. The vast majority of IconAds-associated traffic originated from Brazil, Mexico, and the United States.\nIt's worth noting that IconAds is a variant of a threat that's also\ntracked\nby other cybersecurity vendors under the names\nHiddenAds\nand\nVapor\n, with the malicious apps repeatedly slipping past the Google Play Store\nsince at least 2019\n.\nSome of the common characteristics of these apps include the use of obfuscation to conceal device information during network communications, a set naming pattern used for the command-and-control (C2) domains, and its ability to replace the default MAIN/LAUNCHER activity by declaring an alias.\n\"This means that when the app is installed, the default label name and icon will be displayed, but as soon as the app runs, the activity-alias declared on the manifest will be active and persist even after relaunching the app or rebooting the device,\" HUMAN said.\nThis behavior, in turn, causes the apps's name and icon to be hidden from the home screen, preventing easy uninstallation. The end goal of the apps is to load interstitial ads, regardless of which app is active, effectively disrupting user experience.\nSome variants of IconAds apps have been found to impersonate the Google Play Store (or using other Google-related application icons and names) instead of concealing them. Clicking on the app redirects the victim to the official app, while the malicious activity is taking place in the background.\nSome of the other new additions incorporated into new iterations of the malicious apps are a check to determine if the application was installed from the Play Store, as well as feature more layers of obfuscation to resist dynamic analysis.\n\"Many IconAds-associated apps have short shelf lives before being removed from the Play Store,\" HUMAN researchers said. \"With the several evolutions of this threat, researchers expect continued adaptation, with new apps published and new obfuscation techniques added.\"\nThe disclosure comes as IAS Threat Lab\nexposed\nanother \"insidiously adaptive\" ad fraud operation called Kaleidoscope that resorts to the evil twin technique, wherein \"legitimate-looking apps hosted on Google Play as a deceptive façade, while its malicious duplicate counterparts, distributed predominantly through third-party app stores, drive fraudulent ad supply.\"\nKaleidoscope is an evolution of\nKonfety\n, a similar ad fraud scheme that revolved around apps embedding an advertising framework called CaramelAds SDK. The newly identified apps have since removed references to CaramelAds and included the core functionality into other manipulated SDKs under different names like Leisure, Raccoon, and Adsclub.\nThe essence of the operation is this: Cybercriminals create two nearly identical versions of the same app, a harmless \"decoy twin\" available on Google Play and an \"evil twin\" that's distributed through third-party app stores or fake websites. The \"evil twin\" app then generates intrusive, unwanted ads to fraudulently earn advertising revenue.\nAccording to\ntelemetry data\nfrom ESET for the period December 2024 to May 2025, Kaleidoscope impacts a large number of Android users across the world, the most affected being Latin America, Türkiye, Egypt, and India due to the popularity of third-party app stores in these regions.\nThe adware activity kicks in when users unintentionally install the \"evil twin\" apps, resulting in intrusive ads and degraded device performance. But since the ads are served via the copycat apps, it tricks advertisers into paying the fraudsters for illegitimate ad views.\n\"The primary monetization strategy in this scheme relies on malicious duplicates distributed through third-party app stores, where a benign app ID is exploited by a malicious counterpart to generate ad impressions and drive revenue,\" IAS\nsaid\n. \"The malicious app delivers intrusive out-of-context ads under the guise of the benign app ID in the form of full-screen interstitial images and videos, triggered even without user interaction.\"\nA significant chunk of Kaleidoscope's monetization has been traced back to a Portuguese company named Saturn Dynamic that claims to offer a way to \"monetize display ads and videos.\"\nFrom Ad Fraud to Financial Fraud\nAndroid devices have also come under assault from\nvarious\nmalware families\nlike NGate and SuperCard X that abuse the Near-field communication (NFC) technology to commit financial fraud using inventive relay techniques that allow NFC signals from a victim's payment card to be routed through the compromised phone to attacker-controlled devices, enabling criminals to withdraw cash from ATMs remotely.\nMobile malware campaigns leveraging these malicious programs have claimed successful infections across Russia, Italy, Germany, and Chile.\nNGate has also been an inspiration for another NFC-based technique referred to as\nGhost Tap\n, which involves the attackers using stolen card data to register them in their own digital wallets like Google Pay and Apple Pay. The loaded wallets are subsequently relayed to conduct fraudulent contactless payments anywhere in the world.\n\"Ghost Tap attackers create fraudulent transactions by tapping compromised mobile devices against NFC-enabled payment terminals,\" ESET noted. \"These transactions appear legitimate, bypassing traditional security checks, and allowing criminals to cash out quickly.\"\nAndroid SMS Stealer Infects 100,000 Devices in Uzbekistan\nThe findings coincide with the discovery of a new Android malware campaign that's distributing a previously unidentified SMS stealer called Qwizzserial that has infected nearly 100,000 devices, primarily in Uzbekistan. The resulting financial losses are estimated to be at least $62,000 between March and June 2025.\nFirst\ndiscovered\nby Group-IB in March 2024, the malware is designed to harvest a list of installed financial apps, intercept two-factor authentication (2FA) SMS codes, and exfiltrate the details to the attackers via Telegram bots.\nMasquerading as legitimate banking apps and government services, Qwizzserial is mainly distributed in the form of APK files on bogus Telegram channels that claim to be government entities and officials. Simply put, the attacks abuse the trust users place in government services to trick them into installing the apps.\nTelegram is also central to the operation in that bots operated by the threat actors are used to automate the process of creating the malicious apps used for distribution. Other channels are devoted to internal group chats and making announcements related to the earnings made by different members.\nOnce installed, the apps request users to grant it permission to access SMS messages and phone calls. The user is then prompted to enter two phone numbers and their bank card numbers along with the expiration date, after which the entered information is sent to the attackers via the Telegram bot API.\nAs part of its SMS gathering step, Qwizzserial employs regular expression patterns to search for messages related to bank account balances and those that mention a sum exceeding 500,000 UZS ($39).\nNewer samples of the malware have also been found to ask users to disable battery optimization restrictions, thereby allowing it to run in the background without any intervention. Another change is that the collected data is transmitted to an external server by means of HTTP POST requests instead of directly sending it to the Telegram API.\n\"SMS stealers pose a serious threat in Uzbekistan, as SMS remains a primary channel to interact with end users,\" the Singaporean cybersecurity company said. \"Local payment systems are reliant on SMS to deliver two-factor authentication (2FA) codes for confirmation.\"\nIt's not just Qwizzserial. In recent months, mobile users in India have been\ntargeted\nby fake wedding invites that propagate malware-laced APK files through WhatsApp and Telegram to ultimately deploy\nSpyMax RAT\n(aka SpyNote) or other spyware that can capture sensitive data from infected devices.\nAnother campaign documented by Kaspersky entails the distribution of a new trojan named SparkKitty, which is capable of targeting both Android and iOS devices. The offending apps (币coin and SOEX) are no longer available for download from the respective app storefronts.\nOutside of Apple's Apple Store, the malware is also embedded within modified TikTok clones that are hosted on phony websites mimicking app listing pages. To facilitate installation through this vector, the malware developers rely on a\nprovisioning profile\navailable via Apple's Developer Program to deploy a certificate on victims' iPhones and push the app without uploading them to the App Store.\n\"While most versions of this malware indiscriminately steal all images, we discovered a related malicious activity cluster that uses OCR [optical character recognition] to pick specific pictures,\" the Russian cybersecurity company\nsaid\n.\nSparkKitty, assessed to be active since at least February 2024, is believed to be a possible successor to\nSparkCat\n, which also employs OCR to detect specific images containing wallet recovery phrases.\n\"Although we suspect the attackers' main goal is to find screenshots of crypto wallet seed phrases, other sensitive data could also be present in the stolen images,\" Kaspersky said. \"Judging by the distribution sources, this spyware primarily targets users in Southeast Asia and China.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Over 40 Malicious Firefox Extensions Target Cryptocurrency Wallets, Stealing User Assets",
        "Link": "https://thehackernews.com/2025/07/over-40-malicious-firefox-extensions.html",
        "Summary": "Cybersecurity researchers have uncovered over 40 malicious browser extensions for Mozilla Firefox that are designed to steal cryptocurrency wallet secrets, putting users' digital assets at risk.\n\"These extensions impersonate legitimate wallet tools from widely-used platforms such as Coinbase, MetaMask, Trust Wallet, Phantom, Exodus, OKX, Keplr, MyMonero, Bitget, Leap, Ethereum Wallet, and Filfox",
        "Date": "2025-07-03",
        "Content": "Cybersecurity researchers have uncovered over 40 malicious browser extensions for Mozilla Firefox that are designed to steal cryptocurrency wallet secrets, putting users' digital assets at risk.\n\"These extensions impersonate legitimate wallet tools from widely-used platforms such as Coinbase, MetaMask, Trust Wallet, Phantom, Exodus, OKX, Keplr, MyMonero, Bitget, Leap, Ethereum Wallet, and Filfox,\" Koi Security researcher Yuval Ronen\nsaid\n.\nThe large-scale campaign is said to have been ongoing since at least April 2025, with new extensions uploaded to the Firefox Add-ons store as recently as last week.\nThe identified extensions have been found to artificially inflate their popularity, adding hundreds of 5-star reviews that go far beyond the total number of active installations. This strategy is employed to give them an illusion of authenticity, making it seem like they are widely adopted and tricking unsuspecting users into installing them.\nAnother tactic adopted by the threat actor to bolster trust involves passing off these add-ons as legitimate wallet tools, using the same names and logos.\nThe fact that some of the actual extensions were open-source allowed the attackers to clone their source code and inject their own malicious functionality to extract wallet keys and seed phrases from targeted websites and exfiltrate them to a remote server. The rogue extensions have also been found to transmit the victims' external IP addresses.\nUnlike typical phishing scams that rely on fake websites or emails, these extensions operate inside the user's browser—making them far harder to detect or block with traditional endpoint tools.\n\"This low-effort, high-impact approach allowed the actor to maintain expected user experience while reducing the chances of immediate detection,\" Ronen said.\nThe presence of Russian language comments in the source code as well as metadata obtained from a PDF file retrieved from the command-and-control (C2) server used for the activity points to a Russian-speaking threat actor group.\nAll the identified add-ons with the exception of MyMonero Wallet have since been taken down by Mozilla. Last month, the browser maker\nsaid\nit has developed an \"early detection system\" to detect and block scam crypto wallet extensions before they gain popularity among users and are used to steal users' assets by tricking them into entering their credentials.\nTo mitigate the risk posed by such threats, it's advised to install extensions only from verified publishers and vet them to ensure that they don't silently change their behavior post-installation.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "The Hidden Weaknesses in AI SOC Tools that No One Talks About",
        "Link": "https://thehackernews.com/2025/07/the-hidden-weaknesses-in-ai-soc-tools.html",
        "Summary": "If you’re evaluating AI-powered SOC platforms, you’ve likely seen bold claims: faster triage, smarter remediation, and less noise. But under the hood, not all AI is created equal. Many solutions rely on pre-trained AI models that are hardwired for a handful of specific use cases. While that might work for yesterday’s SOC, today's reality is different.\nModern security operations teams face a",
        "Date": "2025-07-03",
        "Content": "If you're evaluating AI-powered SOC platforms, you've likely seen bold claims: faster triage, smarter remediation, and less noise. But under the hood, not all AI is created equal. Many solutions rely on pre-trained AI models that are hardwired for a handful of specific use cases. While that might work for yesterday's SOC, today's reality is different.\nModern security operations teams face a sprawling and ever-changing landscape of alerts. From cloud to endpoint, identity to OT, insider threats to phishing, network to DLP, and so many more, the list goes on and is continuously growing. CISOs and SOC managers are rightly skeptical. Can this AI actually handle all of my alerts, or is it just another rules engine in disguise?\nIn this post, we'll examine the divide between two types of AI SOC platforms. Those built on adaptive AI, which learns to triage and respond to any alert type, and those that rely on pre-trained AI, limited to handling predefined use cases only. Understanding this difference isn't just academic; it's the key to building a resilient SOC that is ready for the future.\nWhat is a pre-trained AI model?\nPre-trained AI models in the SOC are typically developed by training machine learning algorithms on historical data from specific security use cases, such as phishing detection, endpoint malware alerts, and the like. Engineers curate large, labeled datasets and tune the models to recognize common patterns and remediation steps associated with those use cases. Once deployed, the model operates like a highly specialized assistant. When it encounters an alert type it was trained on, it can quickly classify the alert, assign a confidence score, and recommend the next action, often with impressive accuracy.\nThis makes pre-trained AI particularly well-suited for high-volume, repeatable alert categories where the threat behavior is well-understood and relatively consistent over time. It can dramatically reduce triage times, surface clear remediation guidance, and eliminate redundant work by automating common security workflows. For organizations with predictable threat profiles, pre-trained models offer a fast track to operational efficiency, delivering value out-of-the-box without requiring deep customization.\nBut do such organizations exist? If they do, they are certainly far and few in between, leading us to our next section. The limitations of pre-trained AI.\nLimitations of a pre-trained AI model for the SOC\nDespite their initial appeal, pre-trained AI models come with significant limitations, especially for organizations seeking broad and adaptable alert coverage. From a business standpoint, the most critical drawback is that pre-trained AI can only triage what it has been explicitly taught, similar to SOARs that can only execute actions based on pre-configured playbooks.\nThis means that AI SOC vendors relying on the pre-trained approach must develop, test, and deploy new models for each individual use case, an inherently slow and resource-intensive process. As a result, their customers (i.e. SOC teams) are often left waiting for broader coverage of both existing and emerging alert types. This rigid development approach hinders agility and forces SOC teams to fall back on manual workflows for anything not covered.\nIn fast-changing environments where security signals evolve constantly, pre-trained models struggle to keep pace, quickly becoming outdated or brittle. This can create blind spots, inconsistent triage quality, and increased analyst workload, which undermines the very efficiency gains the AI was meant to deliver.\nWhat is an adaptive AI model?\nIn the context of SOC triage, adaptive AI represents a fundamental shift from the limitations of pre-trained models. Unlike static systems that can only respond to alerts they were trained on, adaptive AI is built to handle any alert, even one it has never seen before. When a new alert is ingested, adaptive AI doesn't fail silently or defer to a human; instead, it actively researches the new alert. It begins by analyzing the alert's structure, semantics, and context to determine what it represents and whether it poses a threat. This capability to research novel alerts in real-time (which is what experienced, higher-tier analysts do) is what allows adaptive AI to triage and respond across the entire spectrum of security signals without requiring prior training for each use case.\nThis capability holds true both for alert types the adaptive AI has never seen before, as well as for new variations of threats (e.g. a new form of malware).\nTechnically, adaptive AI uses semantic classification to assess how closely a new alert resembles previously seen alerts. If there's a strong match, it can intelligently reuse an existing triage outline: a structured set of investigative questions and actions tailored to the alert's characteristics. The AI performs a fresh analysis, which includes verifying the results of each step in the triage outline, assessing these results, identifying additional areas to investigate and finally compiling a conclusion.\nBut when the alert is novel or unfamiliar, the system shifts into discovery mode. Here,\nresearch agents,\njust like senior SOC analysts, will search vendor docs, threat intelligence feeds, as well as reputable websites and forums. They then analyze all the information and compile a report that defines what the new alert represents, e.g. is it malware or some other threat type. With this, the agents dynamically construct a brand-new triage outline. These outlines are passed to\ntriage agents\n, which execute the full triage process autonomously. This is possible because adaptive AI isn't a monolithic model. Rather, it's a coordinated system of dozens of specialized AI agents, each capable of performing a range of tasks. In complex cases, these agents may collectively perform over 150 inference jobs to fully triage a single alert, from data enrichment to threat validation to remediation planning.\nIn contrast to pre-trained AI, where all research is front-loaded by human trainers and triage is constrained to static and potentially outdated knowledge, adaptive AI brings continuous learning and execution into the SOC with research agents leveraging up-to-date, online resources and threat intelligence. Once research agents have surfaced fresh insights, they immediately share them with triage agents to complete the triage process. This agent-to-agent collaboration makes the system both flexible and scalable, enabling security teams to confidently automate triage across their entire alert landscape without waiting for vendors to catch up with new use cases or attack patterns.\nWhy multiple LLMs are better than one for SOC triage\nUsing multiple large language models (LLMs) in the SOC isn't just a technical decision—it's a strategic advantage. Each LLM has its own strengths, whether it's deep reasoning, concise summarization, code generation, or multilingual understanding. By orchestrating a set of complementary models, an adaptive AI platform assigns the right model to the right task, thereby ensuring more accurate, efficient, and context-aware triage. For example, one model might excel at analyzing structured security logs, another at understanding unstructured ticket narratives or phishing emails, while a third might be optimized for generating remediation scripts or querying cloud infrastructure.\nThis multi-LLM architecture adds resilience and depth to the triage process. If one model struggles to understand or classify a novel alert, another might offer a better interpretation or route the issue through a different reasoning path. It also reduces single-model bias and error amplification, which are common risks in mono-model systems. Most importantly, it enables the platform to continuously improve by benchmarking model performance on real-world SOC tasks and dynamically switching between them based on quality, latency, or cost.\nIn essence, the usage of multiple LLMs ensures the SOC gets the best of all worlds: speed, accuracy, flexibility, and robustness, tailored to the complexity and diversity of modern security environments. It's a design choice rooted in real-world SOC needs, not AI hype.\nThe business benefits of the adaptive AI model\nAdaptive AI delivers transformative value to both the SOC and the broader organization by removing the operational bottlenecks that have traditionally slowed security teams down. From a business perspective, it dramatically accelerates time-to-value by providing immediate triage coverage across all alert types, without waiting for vendor-led model development or manual tuning.\nAdaptive AI can handle all alert types and data sources\nThis means faster detection, faster response, and greater resilience across evolving environments. On the security front, adaptive AI ensures that no alert, no matter how novel or obscure, slips through the cracks due to model limitations. It adapts to new data sources, attack techniques, and threat vectors as they emerge, closing blind spots and improving overall threat coverage.\nFor human analysts, adaptive AI acts as a powerful force multiplier: it automates the investigative heavy lifting, eliminates alert fatigue, and surfaces high-context, high-confidence insights that allow analysts to focus on the most strategic and high-risk issues. The result is a more agile, efficient, and empowered SOC, one that can scale without compromising quality or coverage.\nOther essential features of AI SOC platforms\nIn addition to an adaptive AI model that can triage any alert type, SOC teams need more to boost end-to-end SOC efficiency and productivity.\nEven after all the false positives have been automatically triaged and only real threats escalated to incidents, human analysts still need to come up with and execute response actions.\nFurthermore, Tier 3 analysts will frequently want to dig deeper into the underlying logs for threat hunting and forensics. To avoid the \"swivel chair\" effect, an adaptive AI SOC platform should also provide integrated response and logging capabilities as follows:\nIntegrated response automation\nIf an alert has been deemed malicious, the adaptive AI generates custom, recommended actions to remediate the threat. Human analysts can execute the recommended remediation in one click or do so manually with step-by-step guidance.\nAdditionally, there is no need to configure or maintain any complex playbooks with the AI keeping the response action logic up-to-date and relevant for dynamic environments.\nIntegrated logging at a fraction of what traditional SIEMs cost\nBuilt-in log management leveraging customer cloud archive storage and modern logging architecture provides rapid querying and visualizations, and the ability to drill down directly from alerts and incidents into the relevant log data.\nThis approach eliminates vendor lock-in with unlimited storage and retention for a fraction of what traditional log management and SIEMs cost.\nSummary\nNot all AI SOC platforms are created equal. While pre-trained AI offers narrow, rules-bound automation for familiar alert types, it struggles to keep pace with today's dynamic and unpredictable threat landscape. Adaptive AI, by contrast, delivers continuous learning, real-time investigation, and full-spectrum triage for any alert. Powered by multiple specialized LLMs and a coordinated system of research and triage agents, adaptive AI empowers security teams to focus on real threats with speed, flexibility, and confidence.\nTo truly drive efficiency and scale, an AI SOC platform also needs integrated response automation and built-in log management, enabling analysts to quickly remediate threats and seamlessly drill into underlying log data without the overhead or cost associated with legacy SIEMs. With adaptive AI, organizations can finally break free from legacy limitations and operate a SOC that keeps pace with the real world.\nAbout Radiant's adaptive AI SOC platform\nRadiant provides an adaptive AI SOC platform designed for enterprise security teams looking to fully address 100% of the alerts they receive from multiple tools and sensors. Triaging alerts from any security vendor or data source, Radiant ensures real threats are detected in minutes. With integrated response automation, MTTR is slashed from days to minutes, enabling analysts to focus on real incidents and proactive security.\nAdditionally, Radiant's integrated and ultra-affordable log management empowers SOC teams to access all relevant data for both forensic and compliance purposes, all without vendor lock-in and the high costs associated with traditional SIEM solutions.\nSchedule a demo\nwith one of our friendly and knowledgeable product experts and see how Radiant can work for you!\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Chinese Hackers Exploit Ivanti CSA Zero-Days in Attacks on French Government, Telecoms",
        "Link": "https://thehackernews.com/2025/07/chinese-hackers-exploit-ivanti-csa-zero.html",
        "Summary": "The French cybersecurity agency on Tuesday revealed that a number of entities spanning governmental, telecommunications, media, finance, and transport sectors in the country were impacted by a malicious campaign undertaken by a Chinese hacking group by weaponizing several zero-day vulnerabilities in Ivanti Cloud Services Appliance (CSA) devices.\nThe campaign, detected at the beginning of",
        "Date": "2025-07-03",
        "Content": "The French cybersecurity agency on Tuesday revealed that a number of entities spanning governmental, telecommunications, media, finance, and transport sectors in the country were impacted by a malicious campaign undertaken by a Chinese hacking group by weaponizing several zero-day vulnerabilities in Ivanti Cloud Services Appliance (CSA) devices.\nThe campaign, detected at the beginning of September 2024, has been attributed to a distinct intrusion set codenamed\nHouken\n, which is assessed to share some level overlaps with a threat cluster tracked by Google Mandiant under the moniker UNC5174 (aka Uteus or Uetus).\n\"While its operators use zero-day vulnerabilities and a sophisticated rootkit, they also leverage a wide number of open-source tools mostly crafted by Chinese-speaking developers,\" the French National Agency for the Security of Information Systems (ANSSI)\nsaid\n. \"Houken's attack infrastructure is made up of diverse elements -- including commercial VPNs and dedicated servers.\"\nThe agency theorized that Houken is likely being used by an initial access broker since 2023 with an aim to gain a foothold into target networks and then shared with other threat actors interested in carrying out follow-on post-exploitation activities, reflective of a multi-party approach to vulnerability exploitation, as pointed out by HarfangLab.\n\"A first party identifies vulnerabilities, a second uses them at scale to create opportunities, then accesses are distributed to third parties which further attempt to develop targets of interest,\" the French cybersecurity company\nnoted\nearlier this February.\n\"The operators behind the UNC5174 and Houken intrusion sets are likely primarily looking for valuable initial accesses to sell to a state-linked actor seeking insightful intelligence,\" the agency added.\nIn recent months,\nUNC5174\nhas been linked to the active exploitation of SAP NetWeaver flaws to deliver GOREVERSE, a variant of GoReShell. The hacking crew has also leveraged vulnerabilities in Palo Alto Networks, Connectwise ScreenConnect, and F5 BIG-IP software in the past to deliver the SNOWLIGHT malware, which is then used to drop a Golang tunneling utility called GOHEAVY.\nAnother report from SentinelOne\nattributed\nthe threat actor to an intrusion against a \"leading European media organization\" in late September 2024.\nIn the attacks documented by ANSSI, the attackers have been observed exploiting three security defects in Ivanti CSA devices,\nCVE-2024-8963\n,\nCVE-2024-9380\n, and\nCVE-2024-8190\n, as zero-days to obtain credentials and establish persistence using one of the three methods -\nDirectly deploying PHP web shells\nModifying existing PHP scripts to inject web shell capabilities, and\nInstalling a kernel module that serves as a rootkit\nThe attacks are characterized by the use of publicly available web shells like\nBehinder\nand\nneo-reGeorg\n, followed by the deployment of GOREVERSE to maintain persistence after lateral movements. Also employed is an\nHTTP proxy tunneling tool\ncalled\nsuo5\nand a Linux kernel module named \"sysinitd.ko\" that was\ndocumented\nby Fortinet in October 2024 and January 2025.\n\"It is composed of a kernel module (sysinitd.ko) and a user-space executable file (sysinitd) installed on the targeted device through the execution of a shell script: install.sh,\" ANSSI said. \"By hijacking inbound TCP traffic over all ports, and invoking shells, sysinitd.ko and sysinitd allow the remote execution of any command with root privileges.\"\nThat's not all. Besides conducting reconnaissance and operating in the UTC+8 time zone (which corresponds to China Standard Time), the attackers have been observed attempting to patch the vulnerabilities, likely to prevent exploitation by other unrelated actors, ANSSI added.\nIt's suspected that the threat actors have a wide targeting range, comprising governmental and education sectors in Southeast Asia, non-governmental organizations located in China, including Hong Kong and Macau, and governmental, defence, education, media or telecommunication sectors in the West.\nOn top of that, the tradecraft similarities between Houken and UNC5174 have raised the possibility that they are operated by a common threat actor. That having said, at least in one incident, the threat actors are said to have weaponized the access to deploy cryptocurrency miners, underscoring their financial motivations.\n\"The threat actor behind the Houken and UNC5174 intrusion sets might correspond to a private entity, selling accesses and worthwhile data to several state-linked bodies while seeking its own interests leading lucrative oriented operations,\" ANSSI said.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Critical Cisco Vulnerability in Unified CM Grants Root Access via Static Credentials",
        "Link": "https://thehackernews.com/2025/07/critical-cisco-vulnerability-in-unified.html",
        "Summary": "Cisco has released security updates to address a maximum-severity security flaw in Unified Communications Manager (Unified CM) and Unified Communications Manager Session Management Edition (Unified CM SME) that could permit an attacker to login to a susceptible device as the root user, allowing them to gain elevated privileges.\nThe vulnerability, tracked as CVE-2025-20309, carries a CVSS score",
        "Date": "2025-07-03",
        "Content": "Cisco has released security updates to address a maximum-severity security flaw in Unified Communications Manager (Unified CM) and Unified Communications Manager Session Management Edition (Unified CM SME) that could permit an attacker to login to a susceptible device as the root user, allowing them to gain elevated privileges.\nThe vulnerability, tracked as\nCVE-2025-20309\n, carries a CVSS score of 10.0.\n\"This vulnerability is due to the presence of static user credentials for the root account that are reserved for use during development,\" Cisco\nsaid\nin an advisory released Wednesday.\n\"An attacker could exploit this vulnerability by using the account to log in to an affected system. A successful exploit could allow the attacker to log in to the affected system and execute arbitrary commands as the root user.\"\nHard-coded credentials like this usually come from testing or quick fixes during development, but they should never make it into live systems. In tools like Unified CM that handle voice calls and communication across a company, root access can let attackers move deeper into the network, listen in on calls, or change how users log in.\nThe networking equipment major said it found no evidence of the flaw being exploited in the wild, and that it was discovered during internal security testing.\nCVE-2025-20309 affects Unified CM and Unified CM SME versions 15.0.1.13010-1 through 15.0.1.13017-1, irrespective of device configuration.\nCisco has also released indicators of compromise (IoCs) associated with the flaw, stating successful exploitation would result in a log entry to \"/var/log/active/syslog/secure\" for the root user with root permissions. The log can retrieved by running the below command from the command-line interface -\ncucm1# file get activelog syslog/secure\nThe development comes merely days after the company\nfixed\ntwo security flaws in Identity Services Engine and ISE Passive Identity Connector (CVE-2025-20281 and CVE-2025-20282) that could permit an unauthenticated attacker to execute arbitrary commands as the root user.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Leaks hint at Operator-like tool in ChatGPT ahead of GPT-5 launch",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/leaks-hint-at-operator-like-tool-in-chatgpt-ahead-of-gpt-5-launch/",
        "Summary": "A few new code references in the ChatGPT web app and Android point to an Operator-like tool in GPT's chain of thoughts. [...]",
        "Date": "2025-07-03",
        "Content": "A few new code references in the ChatGPT web app and Android point to an Operator-like tool in GPT's chain of thoughts.\nAs\nspotted\nby Tibor on X, the Android beta has strings like “click,” “drag,” “type,” and even “terminal feed,” which seem to suggest that ChatGPT could soon call a remote browser or sandboxed environment (Operator?).\nFor those unaware, OpenAI already has Operator, which uses an AI agent to navigate a remote browser session and execute tasks for you.\nThese references suggest that ChatGPT's thinking model might call a browser or APIs to execute tasks. There are also references to “Checking available APIs” and “Reading API documentation.”\nAndroid beta include mentions of \"computer tool\" actions (click, performing computer actions, etc.)\nIt's also worth noting that the code mentions an “intake form,” so OpenAI may gate this feature behind an invite-only beta before rolling it out more widely.\nCould it be ChatGPT-5 or some other model? We don't know, and we likely won't anytime soon as OpenAI is busy with its standoff with Meta.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nOpenAI is hopeful GPT-5 will compete a little more\nOpenAI’s Sam Altman discusses GPT-5 release date\nOpenAI confirms threat actors use ChatGPT to write malware\nChatGPT's AI coder Codex now lets you choose the best solution\nChatGPT prepares o3-pro model for $200 Pro subscribers"
    },
    {
        "Title": "xAI prepares Grok 4 Code as it plans to take on Claude and Gemini",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/xai-prepares-grok-4-code-as-it-plans-to-take-on-claude-and-gemini/",
        "Summary": "xAI is preparing the rollout of Grok 4, which replaces Grok 3 as the new state-of-the-art model. [...]",
        "Date": "2025-07-03",
        "Content": "xAI is preparing the rollout of Grok 4, which replaces Grok 3 as the new state-of-the-art model.\nAhead of the rollout, testers on X have again\nspotted\nreferences to a few new Grok 4 models.\nOne of the models is called \"grok-4-prod-mimic,\" which reportedly excels at enterprise use cases like data extraction, coding, and text summarisation.\nIt also possesses deep domain knowledge in finance, healthcare, law, and science.\nBut \"grok-4-prod-mimic\" isn't the only new model coming to Grok.\nAnother model is called \"Grok 4 Code,\" which, according to xAI's console, is designed to be your \"coding companion.\"\nReferences to Grok 4 Code\nAnd then we have the most basic or \"your everyday chat\" model called just \"Grok 4,\" which is designed to offer \"unparalleled performance in natural language, math and reasoning, the perfect jack of all trades.\"\nxAI is planning to release Grok 4 without Vision and Image support after Independence Day in the United States of America.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nGoogle releases Gemini CLI with free Gemini 2.5 Pro\nGoogle rolls out text-to-image model Imagen 4 for free\nGoogle’s upcoming Gemini Kingfall is allegedly a coding beast\nAnthropic web config hints at Claude Sonnet 4 and Opus 4\nVibe coding company says Claude 4 reduced syntax errors by 25%"
    },
    {
        "Title": "Police dismantles investment fraud ring stealing €10 million",
        "Link": "https://www.bleepingcomputer.com/news/legal/police-dismantles-investment-fraud-ring-stealing-10-million/",
        "Summary": "The Spanish police have dismantled a large-scale investment fraud operation based in the country, which has caused cumulative damages exceeding €10 million ($11.8M). [...]",
        "Date": "2025-07-03",
        "Content": "The Spanish police have dismantled a large-scale investment fraud operation that caused cumulative damages exceeding $11.8 million (€10 million).\nDuring simultaneous raids in Barcelona, Madrid, Mallorca, and Alicante, coordinated by the Mossos d’Esquadra, Civil Guard, and the National Police, 21 individuals were arrested.\nAlong with the arrests, the police agents also confiscated seven luxury vehicles and more than $1.5 million €1.3 million in cash and cryptocurrency.\nThe fraudsters appear to have started the operation in 2022 and, since then, authorities received more than three hundred complaints from victims across the country.\n“They persuaded their victims to make fake investments through a network of fake advisors and experts, manipulated websites, and telephone call centers,”\nthe police says\n.\n“The group operated as a shell investment company advertising its services on social media. They offered investments in prestigious companies or in the cryptocurrency sector to lure their victims.”\nThe modus operandi is similar to “romance baiting” (“pig butchering”) scams, where fraudsters entice individuals via social media ads, abusing legitimate brands and including fake testimonials.\nNext, the scammers directed victims to fake cryptocurrency, forex, tech stocks, or gold investment portals, which show fake profits on the dashboard and even allow small withdrawals at the start.\nOnce bigger investments occur, withdrawals are locked, and the scammers impose “clearance taxes” or “processing fees” to victims that want to recover their money, but only to steal even more from them.\nIn organized operations like the one dismantled by the Spanish police, scammers use call centers that mimick professional investment firms, with operators trained with scripts and psychological manipulation techniques.\nThe police say the Barcelona-based call centers supporting the operation were rented for three to four months to hinder investigations, and feature a “panic button” that would automatically shut down all systems in case of a police raid.\nThe presence of such call centers in Spain is unusual, as these are typically hosted in Asian or Eastern European countries where evading law enforcement is easier.\nLast week, authorities in Spain dismantled an even larger cryptocurrency investment fraud ring that\nlaundered over $540 million\n(€460 million) stolen from 5,000 victims worldwide.\nIn April 2025, the Spanish police arrested six individuals who used AI to generate fraudulent investment ads, tricking over 200 victims into giving them\n19 million euros\n($20.9 million).\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nEuropol helps disrupt $540 million crypto investment fraud ring\nSpain arrests hackers who targeted politicians and journalists\nFive plead guilty to laundering $36 million stolen in investment scams\nUS arrests suspects behind $73M ‘pig butchering’ laundering scheme\nUS disrupts North Korean IT worker \"laptop farm\" scheme in 16 states"
    },
    {
        "Title": "Grafana releases critical security update for Image Renderer plugin",
        "Link": "https://www.bleepingcomputer.com/news/security/grafana-releases-critical-security-update-for-image-renderer-plugin/",
        "Summary": "Grafana Labs has addressed four Chromium vulnerabilities in critical security updates for the Grafana Image Renderer plugin and Synthetic Monitoring Agent. [...]",
        "Date": "2025-07-03",
        "Content": "Grafana Labs has addressed four Chromium vulnerabilities in critical security updates for the Grafana Image Renderer plugin and Synthetic Monitoring Agent.\nAlthough the issues impact Chromium and were fixed by the open-source project two weeks ago, Grafana received a bug bounty submission from security researcher Alex Chapman proving their exploitability in the Grafana components.\nGrafana describes the update as a \"critical severity security release\" and advises users to\napply the fixes\nfor the vulnerabilities below as soon as possible:\nCVE-2025-5959\n(high-severity, 8.8 score) – type confusion bug in the V8 JavaScript and WebAssembly engine allows remote code execution inside a sandbox via a crafted HTML page\nCVE-2025-6554\n(high-severity, 8.1 score) – type confusion in V8 enables attackers to perform arbitrary memory read/write through a malicious HTML page\nCVE-2025-6191\n(high-severity, 8.8 score) – integer overflow in V8 allows out-of-bounds memory access, potentially leading to code execution\nCVE-2025-6192\n(high-severity, 8.8 score) – use-after-free vulnerability in Chrome's Metrics component could cause heap corruption exploitable via crafted HTML\nThe security problems impact the Grafana Image Renderer versions prior to 3.12.9, and the Syntentic Monitoring Agent versions before 0.38.3.\nThe Grafana Image Renderer is a widely deployed plugin in production environments where automated dashboard rendering for scheduled email reports and embedding in third-party systems is crucial.\nEven though it is not bundled by default in Grafana, the plugin is officially maintained by the project and has millions of downloads.\nThe Synthetic Monitoring Agent is part of Grafana Cloud's Synthetic Monitoring, used by customers who need custom probe locations, low-latency, high-visibility checks from internal nodes, and enterprises with hybrid or multi-cloud infrastructure needing synthetic tests behind firewalls.\nIt is not as widely deployed as the Image Rendered, but it can still be found in a significant number of high-value environments.\nThe two components are vulnerbale because they include a headless Chromium browser for rendering dashboards.\nTo get the latest version of the Image Rendered plugin, use the command:\ngrafana-cli plugins install grafana-image-renderer\n. For container installations, use:\ndocker pull grafana/grafana-image-renderer:3.12.9\n.\nThe latest Synthetic Monitoring Agent version\ncan be downloaded from GitHub\n. For container upgrade, use:\ndocker pull grafana/synthetic-monitoring-agent:v0.38.3-browser\n.\nGrafana Labs says that Grafana Cloud and Azure Managed Grafana instances have been patched, so users relying on externally hosted instances don't have to take any action.\nGrafana users have not shown good reflexes against urgent update notices recently. Ox Security highlighted last month that over\n46,000 instances remained vulnerable\nto an account takeover flaw with public exploit for which the vendor released fixes in May.\nUpdate 7/3-\nGrafana sent BleepingComputer the following comment:\n\"Security is a continuous and collaborative process, and we acted quickly to mitigate these third-party vulnerabilities once they were disclosed. As soon as we were made aware of the Chromium-related issues via our bug bounty program, we prioritized updates to impacted components, issued patches to all affected Grafana Cloud services, and worked closely with our managed service partners to ensure full coverage. While these CVEs originate in the Chromium library, we take our responsibility to the community and our customers seriously and encourage all users to update immediately.\" - Joe McManus, CISO, Grafana Labs\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nNew Veeam RCE flaw lets domain users hack backup servers\nOver 46,000 Grafana instances exposed to account takeover bug\nTrend Micro fixes critical vulnerabilities in multiple products\nMicrosoft June 2025 Patch Tuesday fixes exploited zero-day, 66 flaws\nMozilla fixes Firefox zero-days exploited at hacking contest"
    },
    {
        "Title": "IdeaLab confirms data stolen in ransomware attack last year",
        "Link": "https://www.bleepingcomputer.com/news/security/idealab-confirms-data-stolen-in-ransomware-attack-last-year/",
        "Summary": "IdeaLab is notifying individuals impacted by a data breach incident last October when hackers accessed sensitive information. [...]",
        "Date": "2025-07-03",
        "Content": "IdeaLab is notifying individuals impacted by a data breach incident last October when hackers accessed sensitive information.\nAlthough the organization does not describe the type of attack, the Hunters International ransomware group has claimed the breach and leaked the stolen data on the dark web.\nIdeaLab is a California-based technology startup incubator that since 1996 has launched over 150 companies, including GoTo.com, CitySeach, eToys, Authy, Pet.net, Heliogen, and Energy Vault.\nBeing one of the longest-running and influential venture capital firms in the U.S., the company has generated considerable economic impact, job creation, and investment value.\nOn October 7, 2024, IdeaLab detected suspicious activity on its network. Upon investigation, it was determined that threat actors had gained unauthorized access to its systems three days earlier.\nThe company contracted third-party services to help with the investigation, which finished on June 26 this year.\nThe results confirmed that data had been stolen from its systems, impacting current and former employees, current and former support service contractors, and their dependents.\nIn the sample notification\nshared with authorities\n, IdeaLab did not describe all the information exposed in the incident, saying only that the hackers accessed only names in combination with various other types of data.\nOn October 23, 2024, likely after a failed extortion attempt, Hunters International disclosed the data stolen from IdeaLab.\nIdeaLab data leaked on the Hunters International website\nSource: BleepingComputer\nThe leak contains 137,000 files totaling 262.8 GB in size. At the time of writing, the download link no longer works, but it’s very likely that multiple threat actors downloaded the files earlier.\nEarlier today, the threat actor announced that they're\nshutting down Hunters International\nand deleted all company entries and files from its extortion portal. The hackers offered to share free decryption keys for all their victims.\nHowever, this may be part of a rebrand attempt, as researchers at cybersecurity company Group-IB in April said the threat actor launched a new, extortion-only operation called World Leaks.\nTo protect against the risks that arise from this incident, the notification recipients are offered free-of-charge coverage for a 24-month credit protection, identity theft, and dark web monitoring services through IDX. Impacted individuals are given until October 1 to enroll.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nSwitzerland says government data stolen in ransomware attack\nMcLaren Health Care says data breach impacts 743,000 patients\nSensata Technologies says personal data stolen by ransomware gang\nM&S says customer data stolen in cyberattack, forces password resets\nHunters International ransomware shuts down, releases free decryptors"
    },
    {
        "Title": "Microsoft investigates ongoing SharePoint Online access issues",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-investigates-ongoing-sharepoint-online-access-issues/",
        "Summary": "​Microsoft is investigating an ongoing incident causing intermittent issues for users attempting to access SharePoint Online sites. [...]",
        "Date": "2025-07-03",
        "Content": "​Microsoft is investigating an ongoing incident causing intermittent issues for users attempting to access SharePoint Online sites.\nPart of the Microsoft 365 suite, SharePoint Online is a cloud-based collaboration and document management platform that allows users to create websites, store and share documents, and collaborate on content over the Internet.\nAs the company announced earlier today in an\nincident alert\npublished in the message center, users are seeing \"Something went wrong\" errors when attempting to open SharePoint Online sites.\nRedmond first acknowledged this incident at 03:06 UTC, with the latest update published at 09:29, stating that Microsoft engineers are still investigating the root cause of these access issues.\n\"We've identified a specific reoccurring authentication-related cookie present in the provided network trace logs which appears to be causing the observed 503 errors,\" Microsoft said.\n\"We're working to confirm whether this component is causing impact, so we can begin to develop a remediation plan. Impact is specific to some users who are located on or served through the affected infrastructure.\"\nUntil a solution is available and the issues are resolved, Microsoft said that those affected may be able to work around these problems with the help of incognito mode, also known to Microsoft Edge users as InPrivate browsing.\nWhile the company has yet to disclose which regions are affected by this issue and its extent, Microsoft has tagged it as an incident, typically used to describe a critical service issue that causes noticeable user impact.\nMicrosoft also\nmitigated a Microsoft 365 incident\nin April, which caused SharePoint Online users to experience delays or failures during searches, and another one in June when users opening SharePoint Online or OneDrive-hosted files in File Explorer\nwere unable to autosave the files\ndue to a buggy OneDrive sync client build.\nThis week, the company also\naddressed a DNS misconfiguration\nthat was causing one-time passcode (OTP) message delivery failures in Exchange Online for some users.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nMicrosoft: DNS issue blocks delivery of Exchange Online OTP codes\nMicrosoft fixes Outlook bug causing crashes when opening emails\nMicrosoft shares temp fix for Outlook crashes when opening emails\nMicrosoft confirms auth issues affecting Microsoft 365 users\nNew Microsoft 365 outage impacts Teams and other services"
    },
    {
        "Title": "Microsoft: Exchange Server Subscription Edition now available",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-exchange-server-subscription-edition-now-available/",
        "Summary": "Microsoft has announced that the Exchange Server Subscription Edition (SE) is now available to all customers of its enterprise email service. [...]",
        "Date": "2025-07-03",
        "Content": "Microsoft has announced that the Exchange Server Subscription Edition (SE) is now available to all customers of its enterprise email service.\nAs the company explained, the Exchange Server SE RTM build released this week can be installed as a cumulative update (CU) on servers running Exchange Server 2019 CU15 or CU14, and it can also be joined to existing Exchange Server 2019 or Exchange Server 2016 organizations.\nWhile Exchange Server SE does not include major code upgrades or changes, and does not introduce new features or installation prerequisites compared to Exchange 2019 CU15, it does alter the way it is licensed and serviced.\n\"Exchange Server SE introduces changes to how Exchange is serviced and licensed. Unlike previous versions, Exchange SE is governed by the Modern Lifecycle Policy,\"\nMicrosoft explained\n.\n\"This means there is no fixed end date for support, provided that configurations remain current. The product will be serviced continuously as an evergreen release, with no additional major, year-based versions planned for the future release.\"\nMore information on how to upgrade your servers is available in\nthis blog post\n, which outlines the process of upgrading from current versions to Exchange Server SE.\nExchange 2016 / 2019 reach the end of support in October\nThis announcement follows Microsoft's\nwarning in April\nthat Exchange 2016 and Exchange 2019 will reach the end of support on October 14.\nIn January\n, the company also reminded that Exchange Server 2016 and Exchange Server 2019 will stop receiving technical support starting in October. One year ago, it also\nsaid\nit would not extend the end-of-life date, offer extended support, or provide Extended Security Updates (ESU) for Exchange 2016 or Exchange 2019.\nExchange 2016 reached its\nmainstream support end date\nin October 2020, while Exchange 2019 reached\nthe end of mainstream support\non January 9, 2024.\n\"While the RTM release of Exchange SE is currently identical to Exchange 2019 CU15, this will not remain the case. After support for Exchange 2016 and 2019 ends in October 2025, Exchange SE will be the only supported on-premises version of Exchange,\"\nMicrosoft added\n.\n\"This will create unique opportunities to simplify, streamline, and modernize the product over the coming years. We will continue releasing Exchange SE CUs at the same cadence of two CUs per calendar year, with Security or Hotfix updates being released as needed.\"\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nWashington Post's email system hacked, journalists' accounts compromised\nHacker steals $223 million in Cetus Protocol cryptocurrency heist\nGermany takes down eXch cryptocurrency exchange, seizes servers"
    },
    {
        "Title": "Hunters International ransomware shuts down, releases free decryptors",
        "Link": "https://www.bleepingcomputer.com/news/security/hunters-international-ransomware-shuts-down-after-world-leaks-rebrand/",
        "Summary": "​The Hunters International Ransomware-as-a-Service (RaaS) operation announced today that it has officially closed down its operations and will offer free decryptors to help victims recover their data without paying a ransom. [...]",
        "Date": "2025-07-03",
        "Content": "​The Hunters International Ransomware-as-a-Service (RaaS) operation announced today that it has officially closed down its operations and will offer free decryptors to help victims recover their data without paying a ransom.\n\"After careful consideration and in light of recent developments, we have decided to close the Hunters International project. This decision was not made lightly, and we recognize the impact it has on the organizations we have interacted with,\" the cybercrime gang says in a statement published on its dark web leak earlier today.\n\"As a gesture of goodwill and to assist those affected by our previous activities, we are offering free decryption software to all companies that have been impacted by our ransomware. Our goal is to ensure that you can recover your encrypted data without the burden of paying ransoms.\"\nThe threat actors also removed all entries from the extortion portal and added that companies whose systems were encrypted in Hunters International ransomware attacks can request decryption tools and recovery guidance on the gang's official website.\nWhile the ransomware group doesn't explain what \"recent developments\" it refers to, today's announcement follows a November 17 statement saying that Hunters International will soon shut down because of increased law enforcement scrutiny and declining profitability.\nThreat intelligence firm Group-IB also\nrevealed in April\nthat Hunters International was rebranding with plans to focus on data theft and extortion-only attacks, and had launched a new extortion-only operation known as \"World Leaks.\"\nHunters International shutdown announcement (BleepingComputer)\n​\"Unlike Hunters International, which combined encryption with extortion, World Leaks operates as an extortion-only group using a custom-built exfiltration tool,\" Group-IB said at the time, adding that the new tool appears to be an upgraded version of the Storage Software exfiltration tool used by Hunters International's ransomware affiliates.\n​Hunters International emerged in late 2023 and was flagged by security researchers and ransomware experts as a\npotential rebrand of Hive\ndue to code similarities. The ransomware group's malware targets a wide range of platforms, including Windows, Linux, FreeBSD, SunOS, and ESXi (VMware servers), and it also comes with support for x64, x86, and ARM architectures.\nOver the last two years, Hunters International has targeted companies of all sizes, with ransom demands ranging from hundreds of thousands to millions of dollars, depending on the size of the breached organization.\nThe ransomware gang has claimed responsibility for almost 300 attacks worldwide, making it one of the most active ransomware operations in recent years.\nNotable victims claimed by Hunters International include the\nU.S. Marshals Service\n, Japanese optics giant\nHoya\n,\nTata Technologies\n, North American automobile dealership\nAutoCanada\n, U.S. Navy contractor\nAustal USA\n, and\nIntegris Health\n, Oklahoma's largest not-for-profit healthcare network.\nIn December 2024, Hunters International also hacked the\nFred Hutch Cancer Center\n, threatening to leak the stolen data of over 800,000 cancer patients if they were not paid.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nHunters International shifts from ransomware to pure data extortion\nIdeaLab confirms data stolen in ransomware attack last year\nDOJ investigates ex-ransomware negotiator over extortion kickbacks\nRetail giant Ahold Delhaize says data breach affects 2.2 million people\nScania confirms insurance claim data breach in extortion attempt"
    },
    {
        "Title": "Microsoft asks users to ignore Windows Firewall config errors",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-asks-users-to-ignore-windows-firewall-config-errors/",
        "Summary": "Microsoft asked customers this week to disregard incorrect Windows Firewall errors that appear after rebooting their systems following the installation of the June 2025 preview update. [...]",
        "Date": "2025-07-03",
        "Content": "Microsoft asked customers this week to disregard incorrect Windows Firewall errors that appear after rebooting their systems following the installation of the June 2025 preview update.\nThese warnings are logged in the Event Viewer as 'Event 2042' for Windows Firewall with Advanced Security, with a 'Config Read Failed' warning and a 'More data is available' message.\nMicrosoft added that this known issue is caused by a new feature that's still under development and hasn't yet been fully integrated with the operating system.\n\"Following installation of the June 2025 Windows non-security preview update (\nKB5060829\n), security event logs might include an error event related to Windows Firewall With Advanced Security, which can be safely ignored,\" the company\nsaid\non the Windows release health dashboard.\n\"Please note Windows Firewall is expected to function normally, and no action is required to prevent or resolve this error event. This event is related to a feature that is currently under development and not fully implemented.\"\nThese incorrect firewall errors will only appear on Windows 11 24H2 systems, but they shouldn't impact any Windows processes associated with this event.\nMicrosoft is currently working on a fix for this known issue and will provide an update when more details are available.\nIn recent months, Redmond has dealt with similar issues affecting other Windows features, resulting in more erroneous warnings with no actual impact.\nIn April, the company resolved a bug that\ncaused incorrect BitLocker drive encryption errors\non Windows 10 and Windows 11 devices due to a reporting issue. Redmond acknowledged this bug\nin October\nand stated that it only impacted managed Windows environments where drive encryption was enforced for the operating system and fixed drives.\nThe same month, Microsoft\nconfirmed\nand fixed another known issue that\ntriggered invalid 0x80070643 failure errors\nafter installing the April 2025 Windows Recovery Environment (WinRE) updates.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nMicrosoft fixes known issue that breaks Windows 11 updates\nWindows 11 24H2 emergency update fixes Easy Anti-Cheat BSOD issue\nMicrosoft creates separate Windows 11 24H2 update for incompatible PCs\nWindows 11 upgrade block lifted after Safe Exam Browser fix\nMicrosoft fixes ‘Print to PDF’ feature broken by Windows update"
    },
    {
        "Title": "New Cyber Blueprint Aims to Guide Organizations on AI Journey",
        "Link": "https://www.darkreading.com/cyber-risk/cyber-blueprint-guide-ai-journey",
        "Summary": "Deloitte's new blueprint looks to bridge the gap between the massive push for AI adoption and a lack of preparedness among leaders and employees.",
        "Date": "2025-07-03",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/cyber-blueprint-guide-ai-journey"
    },
    {
        "Title": "Dark Web Vendors Shift to Third Parties, Supply Chains",
        "Link": "https://www.darkreading.com/threat-intelligence/dark-web-vendors-third-parties-supply-chains",
        "Summary": "As attacks on software supply chains and third parties increase, more data on critical software and infrastructure services is being advertised and sold on the Dark Web.",
        "Date": "2025-07-03",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/dark-web-vendors-third-parties-supply-chains"
    },
    {
        "Title": "Criminals Sending QR Codes in Phishing, Malware Campaigns",
        "Link": "https://www.darkreading.com/endpoint-security/criminals-send-qr-codes-phishing",
        "Summary": "The Anti-Phishing Working Group observed how attackers are increasingly abusing QR codes to conduct phishing attacks or to trick users into downloading malware.",
        "Date": "2025-07-03",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/criminals-send-qr-codes-phishing"
    },
    {
        "Title": "IDE Extensions Pose Hidden Risks to Software Supply Chain",
        "Link": "https://www.darkreading.com/application-security/ide-extensions-risks-software-supply-chain",
        "Summary": "Malicious extensions can be engineered to bypass verification checks for popular integrated development environments, according to research from OX Security.",
        "Date": "2025-07-03",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/ide-extensions-risks-software-supply-chain"
    },
    {
        "Title": "Attackers Impersonate Top Brands in Callback Phishing",
        "Link": "https://www.darkreading.com/endpoint-security/attackers-top-brands-callback-phishing",
        "Summary": "Microsoft, PayPal, Docusign, and others are among the trusted brands threat actors use in socially engineered scams that try to get victims to call adversary-controlled phone numbers.",
        "Date": "2025-07-03",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/attackers-top-brands-callback-phishing"
    },
    {
        "Title": "Big Tech’s Mixed Response to U.S. Treasury Sanctions",
        "Link": "https://krebsonsecurity.com/2025/07/big-techs-mixed-response-to-u-s-treasury-sanctions/",
        "Summary": "In May 2025, the U.S. government sanctioned a Chinese national for operating a cloud provider linked to the majority of virtual currency investment scam websites reported to the FBI. But more than a month later, the accused continues to openly operate accounts at a slew of American tech companies, including Facebook, Github, LinkedIn, PayPal and Twitter/X.",
        "Date": "2025-07-03",
        "Content": "In May 2025, the U.S. government sanctioned a Chinese national for operating a cloud provider linked to the majority of virtual currency investment scam websites reported to the FBI. But a new report finds the accused continues to operate a slew of established accounts at American tech companies — including Facebook, Github, PayPal and Twitter/X.\nOn May 29, the U.S. Department of the Treasury announced economic sanctions against Funnull Technology Inc., a Philippines-based company alleged to provide infrastructure for hundreds of thousands of websites involved in virtual currency investment scams known as “pig butchering.” In January 2025, KrebsOnSecurity detailed how Funnull was designed as a content delivery network that catered to foreign cybercriminals seeking to route their traffic through U.S.-based cloud providers.\n\nThe Treasury also sanctioned Funnull’s alleged operator, a 40-year-old Chinese national named Liu “Steve” Lizhi. The government says Funnull directly facilitated financial schemes resulting in more than $200 million in financial losses by Americans, and that the company’s operations were linked to the majority of pig butchering scams reported to the FBI.\nIt is generally illegal for U.S. companies or individuals to transact with people sanctioned by the Treasury. However, as Mr. Lizhi’s case makes clear, just because someone is sanctioned doesn’t necessarily mean big tech companies are going to suspend their online accounts.\nThe government says Lizhi was born November 13, 1984, and used the nicknames “XXL4” and “Nice Lizhi.” Nevertheless, Steve Liu’s 17-year-old account on LinkedIn (in the name “Liulizhi”) had hundreds of followers (Lizhi’s LinkedIn profile helpfully confirms his birthday) until quite recently: The account was deleted this morning, just hours after KrebsOnSecurity sought comment from LinkedIn.\nMr. Lizhi’s LinkedIn account was suspended sometime in the last 24 hours, after KrebsOnSecurity sought comment from LinkedIn.\nIn an emailed response, a LinkedIn spokesperson said the company’s “Prohibited countries policy” states that LinkedIn “does not sell, license, support or otherwise make available its Premium accounts or other paid products and services to individuals and companies sanctioned by the U.S. government.” LinkedIn declined to say whether the profile in question was a premium or free account.\nMr. Lizhi also maintains a working PayPal account under the name Liu Lizhi and username “@nicelizhi,” another nickname listed in the Treasury sanctions. PayPal did not respond to a request for comment. A 15-year-old Twitter/X account named “Lizhi” that links to Mr. Lizhi’s personal domain remains active, although it has few followers and hasn’t posted in years.\nThese accounts and many others were flagged by the security firm Silent Push, which has been tracking Funnull’s operations for the past year and calling out U.S. cloud providers like Amazon and Microsoft for failing to more quickly sever ties with the company.\nLiu Lizhi’s PayPal account.\nIn a report released today, Silent Push found Lizhi still operates numerous Facebook accounts and groups, including a private Facebook account under the name Liu Lizhi. Another Facebook account clearly connected to Lizhi is a tourism page for Ganzhou, China called “EnjoyGanzhou” that was named in the Treasury Department sanctions.\n“This guy is the technical administrator for the infrastructure that is hosting a majority of scams targeting people in the United States, and hundreds of millions have been lost based on the websites he’s been hosting,” said Zach Edwards, senior threat researcher at Silent Push. “It’s crazy that the vast majority of big tech companies haven’t done anything to cut ties with this guy.”\nThe FBI says it received nearly 150,000 complaints last year involving digital assets and $9.3 billion in losses — a 66 percent increase from the previous year. Investment scams were the top crypto-related crimes reported, with $5.8 billion in losses.\nIn a statement, a Meta spokesperson said the company continuously takes steps to meet its legal obligations, but that sanctions laws are complex and varied. They explained that sanctions are often targeted in nature and don’t always prohibit people from having a presence on its platform. Nevertheless, Meta confirmed it had removed the account, unpublished Pages, and removed Groups and events associated with the user for violating its policies.\nAttempts to reach Mr. Lizhi via his primary email addresses at Hotmail and Gmail bounced as undeliverable. Likewise, his 14-year-old YouTube channel appears to have been taken down recently.\nHowever, anyone interested in viewing or using Mr. Lizhi’s 146 computer code repositories will have no problem finding GitHub accounts for him, including one registered under the NiceLizhi and XXL4 nicknames mentioned in the Treasury sanctions.\nOne of multiple GitHub profiles used by Liu “Steve” Lizhi, who uses the nickname XXL4 (a moniker listed in the Treasury sanctions for Mr. Lizhi).\nMr. Lizhi also operates a GitHub page for an open source e-commerce platform called NexaMerchant, which advertises itself as a payment gateway working with numerous American financial institutions. Interestingly, this profile’s “followers” page shows several other accounts that appear to be Mr. Lizhi’s. All of the account’s followers are tagged as “suspended,” even though that suspended message does not display when one visits those individual profiles.\nIn response to questions, GitHub said it has a process in place to identify when users and customers are Specially Designated Nationals or other denied or blocked parties, but that it locks those accounts instead of removing them. According to its policy, GitHub takes care that users and customers aren’t impacted beyond what is required by law.\nAll of the follower accounts for the XXL4 GitHub account appear to be Mr. Lizhi’s, and have been suspended by GitHub, but their code is still accessible.\n“This includes keeping public repositories, including those for open source projects, available and accessible to support personal communications involving developers in sanctioned regions,” the policy states. “This also means GitHub will advocate for developers in sanctioned regions to enjoy greater access to the platform and full access to the global open source community.”\nEdwards said it’s great that GitHub has a process for handling sanctioned accounts, but that the process doesn’t seem to communicate risk in a transparent way, noting that the only indicator on the locked accounts is the message, “This repository has been archived by the owner. It is not read-only.”\n“It’s an odd message that doesn’t communicate, ‘This is a sanctioned entity, don’t fork this code or use it in a production environment’,” Edwards said.\nMark Rasch is a former federal cybercrime prosecutor who now serves as counsel for the New York City based security consulting firm Unit 221B. Rasch said when Treasury’s Office of Foreign Assets Control (OFAC) sanctions a person or entity, it then becomes illegal for businesses or organizations to transact with the sanctioned party.\nRasch said financial institutions have very mature systems for severing accounts tied to people who become subject to OFAC sanctions, but that tech companies may be far less proactive — particularly with free accounts.\n“Banks have established ways of checking [U.S. government sanctions lists] for sanctioned entities, but tech companies don’t necessarily do a good job with that, especially for services that you can just click and sign up for,” Rasch said. “It’s potentially a risk and liability for the tech companies involved, but only to the extent OFAC is willing to enforce it.”\nLiu Lizhi operates numerous Facebook accounts and groups, including this one for an entity specified in the OFAC sanctions: The “Enjoy Ganzhou” tourism page for Ganzhou, China. Image: Silent Push.\nIn July 2024, Funnull purchased the domain polyfill[.]io, the longtime home of a legitimate open source project that allowed websites to ensure that devices using legacy browsers could still render content in newer formats. After the Polyfill domain changed hands, at least 384,000 websites were caught in a supply-chain attack that redirected visitors to malicious sites. According to the Treasury, Funnull used the code to redirect people to scam websites and online gambling sites, some of which were linked to Chinese criminal money laundering operations.\nThe U.S. government says Funnull provides domain names for websites on its purchased IP addresses, using domain generation algorithms (DGAs) — programs that generate large numbers of similar but unique names for websites — and that it sells web design templates to cybercriminals.\n“These services not only make it easier for cybercriminals to impersonate trusted brands when creating scam websites, but also allow them to quickly change to different domain names and IP addresses when legitimate providers attempt to take the websites down,” reads a Treasury statement.\nMeanwhile, Funnull appears to be morphing nearly all aspects of its business in the wake of the sanctions, Edwards said.\n“Whereas before they might have used 60 DGA domains to hide and bounce their traffic, we’re seeing far more now,” he said. “They’re trying to make their infrastructure harder to track and more complicated, so for now they’re not going away but more just changing what they’re doing. And a lot more organizations should be holding their feet to the fire.”\nUpdate, 2:48 PM ET: Added response from Meta, which confirmed it has closed the accounts and groups connected to Mr. Lizhi.\n\r\n         This entry was posted on Thursday 3rd of July 2025 12:06 PM \r\n         \nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "Undetectable Android Spyware Backfires, Leaks 62,000 User Logins",
        "Link": "https://www.securityweek.com/undetectable-android-spyware-backfires-leaks-62000-user-logins/",
        "Summary": "<p>A vulnerability in the Catwatchful spyware allowed a security researcher to retrieve the usernames and passwords of over 62,000 accounts.</p>\n<p>The post <a href=\"https://www.securityweek.com/undetectable-android-spyware-backfires-leaks-62000-user-logins/\">Undetectable Android Spyware Backfires, Leaks 62,000 User Logins</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-03",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/undetectable-android-spyware-backfires-leaks-62000-user-logins/"
    },
    {
        "Title": "Cisco Warns of Hardcoded Credentials in Enterprise Software",
        "Link": "https://www.securityweek.com/cisco-warns-of-hardcoded-credentials-in-enterprise-software/",
        "Summary": "<p>Hardcoded SSH credentials in Cisco Unified CM and Unified CM SME could allow attackers to execute commands as root.</p>\n<p>The post <a href=\"https://www.securityweek.com/cisco-warns-of-hardcoded-credentials-in-enterprise-software/\">Cisco Warns of Hardcoded Credentials in Enterprise Software</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-03",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cisco-warns-of-hardcoded-credentials-in-enterprise-software/"
    },
    {
        "Title": "North Korean Hackers Use Fake Zoom Updates to Install macOS Malware",
        "Link": "https://www.securityweek.com/north-korean-hackers-use-fake-zoom-updates-to-install-macos-malware/",
        "Summary": "<p>SentinelOne says the fake Zoom update scam delivers ‘NimDoor’, a rare Nim-compiled backdoor.</p>\n<p>The post <a href=\"https://www.securityweek.com/north-korean-hackers-use-fake-zoom-updates-to-install-macos-malware/\">North Korean Hackers Use Fake Zoom Updates to Install macOS Malware</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-03",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/north-korean-hackers-use-fake-zoom-updates-to-install-macos-malware/"
    }
]