[
    {
        "Title": "Hackers Use Leaked Shellter Tool License to Spread Lumma Stealer and SectopRAT Malware",
        "Link": "https://thehackernews.com/2025/07/hackers-use-leaked-shellter-tool.html",
        "Summary": "In yet another instance of threat actors repurposing legitimate tools for malicious purposes, it has been discovered that hackers are exploiting a popular red teaming tool called Shellter to distribute stealer malware.\nThe company behind the software said a company that had recently purchased Shellter Elite licenses leaked their copy, prompting malicious actors to weaponize the tool for",
        "Date": "2025-07-08",
        "Content": "In yet another instance of threat actors repurposing legitimate tools for malicious purposes, it has been discovered that hackers are exploiting a popular red teaming tool called\nShellter\nto distribute stealer malware.\nThe company behind the software said a company that had recently purchased Shellter Elite licenses leaked their copy, prompting malicious actors to weaponize the tool for infostealer campaigns. An update has since been released to plug the issue.\n\"Despite our\nrigorous vetting process\n– which has successfully prevented such incidents since the launch of Shellter Pro Plus in February 2023 – we now find ourselves addressing this unfortunate situation,\" the Shellter Project Team\nsaid\nin a statement.\nThe response comes shortly after Elastic Security Labs released a report about how the commercial evasion framework is being abused in the wild since April 2025 to propagate Lumma Stealer, Rhadamanthys Stealer, and SectopRAT (aka ArechClient2).\nShellter is a\npotent tool\nthat allows offensive security teams to bypass antivirus and endpoint detection and response (EDR) software installed on endpoints.\nElastic said it identified multiple financially motivated infostealer campaigns using SHELLTER to package payloads beginning late April 2025, with the activity leveraging Shellter Elite version 11.0\nreleased\non April 16, 2025.\n\"Shellter-protected samples commonly employ self-modifying shellcode with polymorphic obfuscation to embed themselves within legitimate programs,\" the company\nsaid\n. \"This combination of legitimate instructions and polymorphic code helps these files evade static detection and signatures, allowing them to remain undetected.\"\nIt's believed that some of the campaigns, including those delivering SectopRAT and Rhadamanthys Stealer, adopted the tool after version 11 went up for sale on a popular cybercrime forum in mid-May, using lures related to sponsorship opportunities targeting content creators as well as through YouTube videos claiming to offer gaming mods like Fortnite cheats.\nThe Lumma Stealer attack chains leveraging Shellter, on the other hand, are said to have been disseminated via payloads hosted on MediaFire in late April 2025.\nWith cracked versions of\nCobalt Strike\nand\nBrute Ratel C4\npreviously finding their way to the hands of cybercriminals and nation-state actors, it wouldn't be entirely a surprise if Shellter follows a similar trajectory.\n\"Despite the commercial OST community's best efforts to retain their tools for legitimate purposes, mitigation methods are imperfect,\" Elastic said. \"Although the Shellter Project is a victim in this case through intellectual property loss and future development time, other participants in the security space must now contend with real threats wielding more capable tools.\"\nThe Shellter Project, however, criticized Elastic for \"prioritizing publicity over public safety\" and for acting in a manner that it said was \"reckless and unprofessional\" by not notifying them quickly.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Anatsa Android Banking Trojan Hits 90,000 Users with Fake PDF App on Google Play",
        "Link": "https://thehackernews.com/2025/07/anatsa-android-banking-trojan-hits.html",
        "Summary": "Cybersecurity researchers have discovered an Android banking malware campaign that has leveraged a trojan named Anatsa to target users in North America using malicious apps published on Google's official app marketplace.\nThe malware, disguised as a \"PDF Update\" to a document viewer app, has been caught serving a deceptive overlay when users attempt to access their banking application, claiming",
        "Date": "2025-07-08",
        "Content": "Cybersecurity researchers have discovered an Android banking malware campaign that has leveraged a trojan named Anatsa to target users in North America using malicious apps published on Google's official app marketplace.\nThe malware, disguised as a \"PDF Update\" to a document viewer app, has been caught serving a deceptive overlay when users attempt to access their banking application, claiming the service has been temporarily suspended as part of scheduled maintenance.\n\"This marks at least the third instance of Anatsa focusing its operations on mobile banking customers in the United States and Canada,\" Dutch mobile security company ThreatFabric\nsaid\nin a report shared with The Hacker News. \"As with previous campaigns, Anatsa is being distributed via the official Google Play Store.\"\nAnatsa, also referred to as TeaBot and Toddler, has been\nknown\nto be active since at least 2020, typically delivered to victims via dropper apps.\nEarly last year, Anatsa was\nfound\nto have targeted Android device users in Slovakia, Slovenia, and Czechia by first uploading benign apps masquerading as PDF readers and phone cleaners to the Play Store and then introducing malicious code a week after release.\nLike other Android banking trojans, Anatsa is capable of providing its operators with features designed to steal credentials through overlay and keylogging attacks, and conduct Device-Takeover Fraud (DTO) to initiate fraudulent transactions from victim's devices.\nThreatFabric said Anatsa campaigns follow a predictable, but well-oiled, process that involves establishing a developer profile on the app store and then publishing a legitimate app that works as advertised.\n\"Once the application gains a substantial user base – often in the thousands or tens of thousands of downloads – an update is deployed, embedding malicious code into the app,\" the company said. \"This embedded code downloads and installs Anatsa on the device as a separate application.\"\nThe malware then receives a dynamic list of targeted financial and banking institutions from an external server, enabling the attackers to perform credential theft for account takeover, keylogging, or fully automated transactions using DTO.\nA crucial factor that allows Anatsa to evade detection as well as maintain a high success rate is its cyclical nature where the attacks are interspersed by periods of no activity.\nThe newly discovered app targeting North American audiences masquerades as a Document Viewer (APK package name: \"com.stellarastra.maintainer.astracontrol_managerreadercleaner\") and is published by a developer named \"Hybrid Cars Simulator, Drift & Racing.\" Both the app and the associated developer account are no longer accessible on the Play Store.\nStatistics from Sensor Tower\nshow\nthat the app was first published on May 7, 2025, reaching the fourth spot in the \"Top Free - Tools\" category on June 29, 2025. It's estimated to have been downloaded around 90,000 times.\n\"This dropper followed Anatsa's established modus operandi: initially launched as a legitimate app, it was transformed into a malicious one approximately six weeks after release,\" ThreatFabric said. \"The distribution window for this campaign was short yet impactful, running from 24 to 30 June.\"\nThe Anatsa variant, per the company, is also configured to target a broader set of banking apps in the United States, reflective of the malware's increasing focus on exploiting financial entities in the region.\nAnother clever feature incorporated into the malware is its ability to display a fake maintenance notice when trying to access the target banking application. This tactic not only conceals the malicious activity occurring within the app, but also prevents customers from contacting the bank's support team, thereby delaying detection of financial fraud.\n\"The latest operation not only broadened its reach but also relied on well-established tactics aimed at financial institutions in the region,\" ThreatFabric said. \"Organizations in the financial sector are encouraged to review the provided intelligence and assess any potential risks or impacts on their customers and systems.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Malicious Pull Request Targets 6,000+ Developers via Vulnerable Ethcode VS Code Extension",
        "Link": "https://thehackernews.com/2025/07/malicious-pull-request-infects-6000.html",
        "Summary": "Cybersecurity researchers have flagged a supply chain attack targeting a Microsoft Visual Studio Code (VS Code) extension called Ethcode that has been installed a little over 6,000 times.\nThe compromise, per ReversingLabs, occurred via a GitHub pull request that was opened by a user named Airez299 on June 17, 2025.\nFirst released by 7finney in 2022, Ethcode is a VS Code extension that's used to",
        "Date": "2025-07-08",
        "Content": "Cybersecurity researchers have flagged a supply chain attack targeting a Microsoft Visual Studio Code (VS Code) extension called\nEthcode\nthat has been installed a little over 6,000 times.\nThe compromise, per\nReversingLabs\n, occurred via a GitHub pull request that was opened by a user named Airez299 on June 17, 2025.\nFirst released by 7finney in 2022,\nEthcode\nis a VS Code extension that's used to deploy and execute solidity smart contracts in Ethereum Virtual Machine (\nEVM\n)-based blockchains. An EVM is a decentralized computation engine that's designed to run smart contracts on the Ethereum network.\nAccording to the supply chain security company, the GitHub project received its last non-malicious update on September 6, 2024. That changed last month when Airez299\nopened a pull request\nwith the message \"Modernize codebase with viem integration and testing framework.\"\nThe user claimed to have added a new testing framework with Mocha integration and contract testing features, as well as made a number of changes, including removing old configurations and updating the dependencies to the latest version.\nWhile that may seem like a useful update for a project that lay dormant for over nine months, ReversingLabs said the unknown threat actor behind the attack managed to sneak in two lines of code as part of 43 commits and roughly 4,000 lines changes that compromised the entire extension.\nThis included the addition of an npm dependency in the form of the \"\nkeythereum-utils\n\" in the project's package.json file and importing it in the TypeScript file linked to the VS Code extension (\"src/extension.ts\").\nThe JavaScript library, now taken down from the npm registry, has been found to be heavily obfuscated and contains code to download an unknown second-stage payload. The package has been\ndownloaded\n495 times.\nMultiple versions of \"keythereum-utils\" have been uploaded to npm by users named 0xlab (version 1.2.1), 0xlabss (versions 1.2.2, 1.2.3, 1.2.4, 1.2.5, and 1.2.6), and 1xlab (version 1.2.7). The npm accounts no longer exist.\n\"After deobfuscating the keythereum-utils code, it became easy to see what the script does: spawn a hidden PowerShell that downloads and runs a batch script from a public file-hosting service,\" security researcher Petar Kirhmajer said.\nWhile the exact nature of the payload is not known, it's believed to be a piece of malware that's either capable of stealing cryptocurrency assets or poisoning the contracts that are being developed by users of the extension.\nFollowing responsible disclosure to Microsoft, the extension was removed from the VS Code Extensions Marketplace. After the removal of the malicious dependency, the extension has since been reinstated.\n\"Ethcode package has been unpublished by Microsoft,\" 0mkara, a project maintainer for the tool,\nsaid\nin a pull request submitted on June 28. \"They detected a malicious dependency in Ethcode. This PR removes potential malicious repository keythereum from the package.\"\nEthcode is the latest example of a broader and escalating trend of software supply chain attacks, where attackers weaponize public repositories like PyPI and npm to deliver malware directly into developer environments.\n\"The GitHub account Airez299 that initiated the Ethcode pull request was created on the same day as the PR request was opened,\" ReversingLabs said. \"Accordingly, the Airez299 account does not have any previous history or activity associated with it. This strongly indicates that this is a throwaway account that was created solely for the purpose of infecting this repo — a goal in which they were successful.\"\nAccording to data compiled by Sonatype, 16,279 pieces of open-source malware have been discovered in the second quarter of 2025, a 188% jump year-over-year. In comparison,\n17,954 pieces of open-source malware\nwere uncovered in Q1 2025.\nOf these, more than 4,400 malicious packages were engineered to harvest and exfiltrate sensitive information, such as credentials, and API tokens.\n\"Malware targeting data corruption doubled in frequency, making up 3% of total malicious packages — more than 400 unique instances,\" Sonatype\nsaid\n. \"These packages aim to damage files, inject malicious code, or otherwise sabotage applications and infrastructure.\"\nThe North Korea-linked Lazarus Group has been attributed to 107 malicious packages, which were collectively downloaded over 30,000 times. Another set of more than 90 npm packages has been associated with a Chinese threat cluster dubbed\nYeshen-Asia\nthat has been active since at least December 2024 to harvest system information and the list of running processes.\nThese numbers underscore the growing sophistication of attacks targeting developer pipelines, with attackers increasingly exploiting the trust in open-source ecosystems to carry out supply chain compromises.\n\"Each was published from a distinct author account, each hosted just one malicious component, and all communicated with infrastructure behind Cloudflare-protected yeshen.asia domains,\" the company said.\n\"Although no novel techniques were observed in this second wave, the level of automation and infrastructure reuse reflect a deliberate, persistent campaign focused on credential theft and secret exfiltration.\"\nThe development comes as Socket identified eight fake gaming-related extensions in the Mozilla Firefox Add-ons store that harbored varying levels of malicious functionality, ranging from adware to Google OAuth token theft.\nSpecifically, some of these extensions have also been found to redirect to gambling sites, serve bogus Apple virus alerts, and stealthily route shopping sessions through affiliate tracking links to earn commissions, and even track users by injecting invisible tracking iframes containing unique identifiers.\nThe names of the add-ons, all published by a threat actor with the username \"mre1903,\" are below -\nCalSyncMaster\nVPN - Grab a Proxy - Free\nGimmeGimme\nFive Nights at Freddy's\nLittle Alchemy 2\nBubble Spinner\n1v1.LOL\nKrunker io Game\n\"Browser extensions remain a favored attack vector due to their trusted status, extensive permissions, and ability to execute within the browser's security context,\" Socket researcher Kush Pandya\nsaid\n. \"The progression from simple redirect scams to OAuth credential theft demonstrates how quickly these threats evolve and scale.\"\n\"More concerning, the redirect infrastructure could easily be repurposed for more intrusive behavior such as comprehensive tracking, credential harvesting, or malware distribution.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "5 Ways Identity-based Attacks Are Breaching Retail",
        "Link": "https://thehackernews.com/2025/07/5-ways-identity-based-attacks-are.html",
        "Summary": "From overprivileged admin roles to long-forgotten vendor tokens, these attackers are slipping through the cracks of trust and access. Here’s how five retail breaches unfolded, and what they reveal about...\nIn recent months, major retailers like Adidas, The North Face, Dior, Victoria's Secret, Cartier, Marks &amp; Spencer, and Co‑op have all been breached. These attacks weren’t sophisticated",
        "Date": "2025-07-08",
        "Content": "From overprivileged admin roles to long-forgotten vendor tokens, these attackers are slipping through the cracks of trust and access. Here's how five retail breaches unfolded, and what they reveal about...\nIn recent months, major retailers like Adidas, The North Face, Dior, Victoria's Secret, Cartier, Marks & Spencer, and Co‑op have all been breached. These attacks weren't sophisticated malware or zero-day exploits. They were identity-driven, exploiting overprivileged access and unmonitored service accounts, and used the human layer through tactics like social engineering.\nAttackers didn't need to break in. They logged in. They moved through SaaS apps unnoticed, often using real credentials and legitimate sessions.\nAnd while most retailers didn't share all the technical details, the patterns are clear and recurring.\nHere's a breakdown of the five recent high-profile breaches in retail:\n1. Adidas: Exploiting third-party trust\nAdidas\nconfirmed\na data breach caused by an attack on a third-party customer service provider. The company said customer data was exposed, including names, email addresses, and order details. No malware. No breach on their side. Just the blast radius of a vendor they trusted.\nHow these attacks unfold in SaaS identities:\nSaaS tokens and service accounts granted to vendors often don't require MFA, don't expire, and fly under the radar. Once access is no longer needed but never revoked, they become silent entry points, perfect for supply chain compromises that map to tactics like T1195.002, giving attackers a way in without setting off alarms.\nSecurity takeaway:\nYou're not just securing your users. You're securing the access that vendors leave behind, too. SaaS integrations stick around longer than the actual contracts, and attackers know exactly where to look.\n2. The North Face: From password reuse to privilege abuse\nThe North Face confirmed a credential stuffing\nattack\n(MITRE T1110.004) where threat actors used leaked credentials (usernames and passwords) to access customer accounts. No malware, no phishing, just weak identity hygiene and no MFA. Once inside, they exfiltrated personal data, exposing a major gap in basic identity controls.\nHow these attacks unfold in SaaS identities:\nSaaS logins without MFA are still everywhere. Once attackers get valid credentials, they can access accounts directly and quietly, no need triggering endpoint protections or raising alerts.\nSecurity takeaway:\nCredential stuffing is nothing new. It was the fourth credential-based breach for The North Face since 2020. Each one is a reminder that password reuse without MFA is a wide-open door. And while plenty of orgs enforce MFA for employees, service accounts, and privileged roles, many times they go unprotected. Attackers know it, and they go where the gaps are.\nWant to go deeper?\nDownload the\n'SaaS Identity Security Guide\n'\nto learn how to proactively secure every identity, human or non-human, across your SaaS stack.\n3. M&S & Co-op: Breached by borrowed trust\nUK retailers Marks & Spencer and Co-op were reportedly targeted by the threat group Scattered Spider, known for identity-based attacks. According to\nreports\n, they used SIM swapping and social engineering to impersonate employees and trick IT help desks into resetting passwords and MFA, effectively bypassing MFA, all without malware or phishing.\nHow these attacks unfold in SaaS identities:\nOnce attackers bypass MFA, they target overprivileged SaaS roles or dormant service accounts to move laterally within the organization's systems, harvesting sensitive data or disrupting operations along the way. Their actions blend in with legitimate user behavior (T1078), and with password resets driven by help desk impersonation (T1556.003), they quietly gain persistence and control without raising any alarms.\nSecurity takeaway:\nThere's a reason identity-first attacks are spreading. They exploit what's already trusted, and often leave no malware footprint. To reduce risk, track SaaS identity behavior, including both human and non-human activity, and limit help desk privileges through isolation and escalation policies. Targeted training for support staff can also block social engineering before it happens.\n4. Victoria's Secret: When SaaS admins go unchecked\nVictoria's Secret delayed its earnings release after a cyber\nincident\ndisrupted both e-commerce and in-store systems. While few details were disclosed, the impact aligns with scenarios involving internal disruption through SaaS systems that manage retail operations, like inventory, order processing, or analytics tools.\nHow these attacks unfold in SaaS identities:\nThe real risk isn't just compromised credentials. It's the unchecked power of overprivileged SaaS roles. When a misconfigured admin or stale token gets hijacked (T1078.004), attackers don't need malware. They can disrupt core operations, from inventory management to order processing, all within the SaaS layer. No endpoints. Just destruction (T1485) at scale.\nSecurity takeaway:\nSaaS roles are powerful and often forgotten. A single overprivileged identity with access to critical business applications can trigger chaos, making it crucial to apply stringent access controls and continuous monitoring to these high-impact identities before it's too late.\n5. Cartier & Dior: The hidden cost of customer support\nCartier and Dior\ndisclosed\nthat attackers accessed customer information via third-party platforms used for CRM or customer service functions. These weren't infrastructure hacks; they were breaches through platforms meant to help customers, not expose them.\nHow these attacks unfold in SaaS identities:\nCustomer support platforms are often SaaS-based, with persistent tokens and API keys quietly connecting them to internal systems. These non-human identities (T1550.003) rarely rotate, often escape centralized IAM, and become easy wins for attackers targeting customer data at scale.\nSecurity takeaway:\nIf your SaaS platforms touch customer data, they're part of your attack surface. And if you're not tracking how machine identities access them, you're not protecting the frontlines.\nFinal Thought: Your SaaS identities aren't invisible. They're just unmonitored.\nYour SaaS identities aren't invisible; they're just unmonitored. These breaches didn't need fancy exploits. They just needed a misplaced trust, a reused credential, an unchecked integration, or an account no one reviewed.\nWhile security teams have locked down endpoints and hardened SaaS logins, the real gaps lie in those hidden SaaS roles, dormant tokens, and overlooked help desk overrides. If these are still flying under the radar, the breach already has a head start.\nWing Security was built for this.\nWing's multi-layered platform continuously protects your SaaS stack, discovering blind spots, hardening configurations, and detecting SaaS identity threats before they escalate.\nIt's one source of truth that connects the dots across apps, identities, and risks, so you can cut through the noise and stop breaches before they start.\n👉\nGet a demo\nof Wing Security to see what's hiding in your SaaS identity layer.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "RondoDox Botnet Exploits Flaws in TBK DVRs and Four-Faith Routers to Launch DDoS Attacks",
        "Link": "https://thehackernews.com/2025/07/rondodox-botnet-exploits-flaws-in-tbk.html",
        "Summary": "Cybersecurity researchers are calling attention to a malware campaign that's targeting security flaws in TBK digital video recorders (DVRs) and Four-Faith routers to rope the devices into a new botnet called RondoDox.\nThe vulnerabilities in question include CVE-2024-3721, a medium-severity command injection vulnerability affecting TBK DVR-4104 and DVR-4216 DVRs, and CVE-2024-12856, an operating",
        "Date": "2025-07-08",
        "Content": "Cybersecurity researchers are calling attention to a malware campaign that's targeting security flaws in TBK digital video recorders (DVRs) and Four-Faith routers to rope the devices into a new botnet called\nRondoDox\n.\nThe vulnerabilities in question include\nCVE-2024-3721\n, a medium-severity command injection vulnerability affecting TBK DVR-4104 and DVR-4216 DVRs, and\nCVE-2024-12856\n, an operating system (OS) command injection bug affecting Four-Faith router models F3x24 and F3x36.\nMany of these devices are installed in critical environments like retail stores, warehouses, and small offices, where they often go unmonitored for years. That makes them ideal targets—easy to exploit, hard to detect, and usually exposed directly to the internet through outdated firmware or misconfigured ports.\nIt's worth noting that all three security defects have been\nrepeatedly\nweaponized by\nthreat actors\nto deploy different\nMirai botnet variants\nin recent months.\n\"Both [the security flaws] have been publicly disclosed and are actively being targeted, posing serious risks to device security and overall network integrity,\" Fortinet FortiGuard Labs researcher Vincent Li\nsaid\n.\nThe cybersecurity company said it first identified an ELF binary for RondoDox in September 2024, with the malware capable of mimicking traffic from gaming platforms or VPN servers flying under the radar.\nWhat makes RondoDox especially dangerous isn't just the device takeover—it's how the attackers repurpose that access. Instead of using infected devices as typical botnet nodes, they weaponize them as stealth proxies to hide command-and-control traffic, carry out layered scams, or amplify DDoS-for-hire campaigns that blend financial fraud with infrastructure disruption.\nAnalysis of RondoDox artifacts indicates that it was initially distributed to target Linux-based operating systems running on ARM and MIPS architectures, before being distributed via a shell script downloader that can target other Linux architectures like Intel 80386, MC68000, MIPS R3000, PowerPC, SuperH, ARCompact, x86-64, and AArch64.\nThe shell script, once launched, instructs the victim host to ignore SIGINT, SIGQUIT, and SIGTERM signals that are used to terminate processes in Unix-like operating systems, and checks for writable paths across various paths such as /dev, /dev/shm, the victim user's home directory, /mnt, /run/user/0, /var/log, /var/run, /var/tmp, and /data/local/tmp.\nIn the final step, the RondoDox malware is downloaded and executed onto the host, and clears the command execution history to clear traces of the malicious activity. The botnet payload, for its part, proceeds to set up persistence on the machine to ensure that it's automatically launched following a system reboot.\nIt's also designed to scan the list of running processes and terminate any process related to network utilities (e.g., wget and curl), system analysis tools (e.g., Wireshark and gdb), or other malware (e.g., cryptominers or Redtail variants) so as to maintain operational stealth.\nThis approach reflects a growing trend in botnet design where threat actors use multi-architecture droppers, DoH-based C2 resolution, and XOR-encrypted payloads to bypass legacy IDS rules. As part of a broader category of evasive Linux malware, RondoDox sits alongside threats like\nRustoBot\nand\nMozi\n, forming a new wave of adaptable botnets built to exploit poor IoT hygiene and weak router hardening.\nFurthermore, RondoDox scans several common Linux executable directories, such as /usr/sbin, /usr/bin, /usr/local/bin, and /usr/local/sbin, and renames legitimate executables with random characters with an intent to inhibit recovery efforts. The modified file names are listed below -\niptables - jsuJpf\nufw - nqqbsc\npasswd - ahwdze\nchpasswd - ereghx\nshutdown - hhrqwk\npoweroff - dcwkkb\nhalt - cjtzgw\nreboot - gaajct\nOnce the setup process is complete, the malware contacts an external server (83.150.218[.]93) to receive commands to perform distributed denial-of-service (DDoS) attacks against specific targets using HTTP, UDP, and TCP protocols.\n\"To evade detection, it disguises malicious traffic by emulating popular games and platforms such as Valve, Minecraft, Dark and Darker, Roblox, DayZ, Fortnite, GTA, as well as tools like Discord, OpenVPN, WireGuard, and RakNet,\" Fortinet said.\n\"Beyond gaming and chat protocols, RondoDox can also mimic custom traffic from tunneling and real-time communication services, including WireGuard, OpenVPN variants (e.g., openvpnauth, openvpncrypt, openvpntcp), STUN, DTLS, and RTC.\"\nIn impersonating traffic associated with legitimate tools, the idea is to blend in with normal activity and make it challenging for defenders to detect and block it.\n\"RondoDox is a sophisticated and emerging malware threat that employs advanced evasion techniques, including anti-analysis measures, XOR-encoded configuration data, custom-built libraries, and a robust persistence mechanism,\" Li said. \"These capabilities allow it to remain undetected and maintain long-term access on compromised systems.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "BaitTrap: Over 17,000 Fake News Websites Caught Fueling Investment Fraud Globally",
        "Link": "https://thehackernews.com/2025/07/baittrap-over-17000-fake-news-websites.html",
        "Summary": "A newly released report by cybersecurity firm CTM360 reveals a large-scale scam operation utilizing fake news websites—known as Baiting News Sites (BNS)—to deceive users into online investment fraud across 50 countries.\nThese BNS pages are made to look like real news outlets: CNN, BBC, CNBC, or regional media. They publish fake stories that feature public figures, central banks, or financial",
        "Date": "2025-07-08",
        "Content": "A newly\nreleased report\nby cybersecurity firm CTM360 reveals a large-scale scam operation utilizing fake news websites—known as Baiting News Sites (BNS)—to deceive users into online investment fraud across 50 countries.\nThese BNS pages are made to look like real news outlets: CNN, BBC, CNBC, or regional media. They publish fake stories that feature public figures, central banks, or financial brands, all claiming to back new ways to earn passive income. The goal? Build trust quickly and steer readers toward professional-looking scam platforms like Trap10, Solara Vynex, or Eclipse Earn.\nScammers use sponsored ads on Google, Meta, and blog networks to push traffic to these sites. Ads often carry clickbait headlines—\"You won't believe what a prominent public figure just revealed\"—paired with official photos or national flags to make them feel legit. Clicking the ad directs users to a fake article, which then redirects them to a fraudulent trading platform.\nMany of these scams follow a two-phase structure. The first phase focuses on luring victims through ads and fake articles; the second phase kicks in once the victim engages, starting with a call from a so-called advisor, followed by requests for ID documents, crypto deposits, and ongoing \"account verifications\" designed to delay withdrawals. This layered setup helps scammers build false trust, stall suspicion, and extract maximum value before the victim realizes it's a trap.\nCTM360's Webhunt platform has tracked over 17,000 of these sites so far. Many are hosted on cheap top-level domains like .xyz, .click, or .shop. In some cases, attackers compromise real websites to host BNS content inside subfolders, making takedowns harder. The pages are often customized per region—using local languages, familiar media logos, regional influencers, and banks to increase believability.\nMost users encounter these scams while searching for ways to invest online or earn passive income, often clicking on sponsored headlines that mimic legitimate financial advice. The content is designed to match those high-intent searches—phrases like \"automated crypto trading\" or \"celebrity-backed investment\" are common bait, tailored to match what people are already looking for.\nOnce on the fake platform, victims are asked to register with their name, phone number, and email. Soon after, an \"investment agent\" follows up via phone, sounding professional and persuasive. Victims are urged to make a small deposit—usually around $240—to activate their account. From there, fake dashboards simulate profits, showing earnings that don't exist. The longer the victim stays engaged, the more they're pressured to invest again.\nThese schemes don't just exploit trust—they also collect sensitive data for reuse in phishing, identity theft, and secondary fraud. That makes Baiting News Sites a crossover threat: part investment scam, part brand impersonation, part data harvesting. It's a pattern increasingly seen in pig butchering scams, fake KYC platforms, and affiliate fraud networks—topics that deserve closer tracking as the ecosystem evolves.\nCTM360's Scam Navigator tool, modeled on the MITRE framework, maps out how these scams work step-by-step: from resource setup and ad creation to victim interaction, data theft, and monetization. BNS plays a key role in the distribution phase, acting as the entry point for a much larger fraud pipeline.\nCTM360 continues to track these campaigns and provide takedown support, threat intelligence, and risk protection to governments and organizations across targeted regions.\nRead the full report here.\nAbout CTM360\n- CTM360 is a unified external security platform that integrates External Attack Surface Management, Digital Risk Protection, Cyber Threat Intelligence, Brand Protection & Anti-phishing, Surface, Deep & Dark Web Monitoring, Security Ratings, Third Party Risk Management and Unlimited Takedowns. Seamless and turn-key, CTM360 requires no configurations, installations or inputs from the end-user, with all data pre-populated and specific to your organization. All aspects are managed by CTM360.\nFor more, visit\nwww.ctm360.com\n.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Researchers Uncover Batavia Windows Spyware Stealing Documents from Russian Firms",
        "Link": "https://thehackernews.com/2025/07/researchers-uncover-batavia-windows.html",
        "Summary": "Russian organizations have been targeted as part of an ongoing campaign that delivers a previously undocumented Windows spyware called Batavia.\nThe activity, per cybersecurity vendor Kaspersky, has been active since July 2024.\n\"The targeted attack begins with bait emails containing malicious links, sent under the pretext of signing a contract,\" the Russian company said. \"The main goal of the",
        "Date": "2025-07-08",
        "Content": "Russian organizations have been targeted as part of an ongoing campaign that delivers a previously undocumented Windows spyware called Batavia.\nThe activity, per cybersecurity vendor Kaspersky, has been active since July 2024.\n\"The targeted attack begins with bait emails containing malicious links, sent under the pretext of signing a contract,\" the Russian company\nsaid\n. \"The main goal of the attack is to infect organizations with the previously unknown Batavia spyware, which then proceeds to steal internal documents.\"\nThe email messages are sent from the domain \"oblast-ru[.]com,\" which is said to be owned by the attackers themselves. The links embedded within the digital missives lead to the download of an archive file containing a Visual Basic Encoded script (.VBE) file.\nWhen executed, the script profiles the compromised host and exfiltrates the system information to the remote server. This is followed by the retrieval of a next-stage payload from the same server, an executable written in Delphi.\nThe malware likely displays a fake contract to the victim as a distraction while collecting system logs, office documents (*.doc, *.docx, *.ods, *.odt, *.pdf, *.xls, and *.xlsx), and screenshots in the background. The data gathering also extends to removable devices attached to the host.\nAnother capability of the Delphi malware is to download a binary of its own from the server, which targets a broader set of file extensions for subsequent collection. This includes images, emails, Microsoft PowerPoint presentations, archive files, and text documents (*.jpeg, *.jpg, *.cdr, *.csv, *.eml, *.ppt, *.pptx, *.odp, *.rar, *.zip, *.rtf, and *.txt).\nThe newly collected data is then transmitted to a different domain (\"ru-exchange[.]com\"), from where an unknown executable is downloaded as a fourth-stage for continuing the attack chain further.\nTelemetry data from Kaspersky shows that more than 100 users across several dozen organizations received phishing emails over the past year.\n\"As a result of the attack, Batavia exfiltrates the victim's documents, as well as information such as a list of installed programs, drivers, and operating system components,\" the company said.\nThe disclosure comes as Fortinet FortiGuard Labs detailed a malicious campaign that delivers a Windows stealer malware codenamed NordDragonScan. While the exact initial access vector is not clear, it's believed to be a phishing email that propagates a link to trigger the download of an RAR archive.\n\"Once installed, NordDragonScan examines the host and copies documents, harvests entire Chrome and Firefox profiles, and takes screenshots,\" security researcher Cara Lin\nsaid\n.\nPresent within the archive is a Windows shortcut (LNK) file that stealthily makes use of \"mshta.exe\" to execute a remotely hosted HTML Application (HTA). This step results in the retrieval of a benign decoy document, while a nefarious .NET payload is quietly dropped onto the system.\nNordDragonScan, as the stealer malware is called, establishes connections with a remote server (\"kpuszkiev[.]com\"), sets up persistence via Windows Registry changes, and conducts extensive reconnaissance of the compromised machine to collect sensitive data and exfiltrate the information back to the server via an HTTP POST request.\n\"The RAR file contains LNK calls that invoke mshta.exe to execute a malicious HTA script, displaying a decoy document in Ukrainian, Lin said. \"Finally, it quietly installs its payload in the background. NordDragonScan is capable of scanning the host, capturing a screenshot, extracting documents and PDFs, and sniffing Chrome and Firefox profiles.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "CISA Adds Four Critical Vulnerabilities to KEV Catalog Due to Active Exploitation",
        "Link": "https://thehackernews.com/2025/07/cisa-adds-four-critical-vulnerabilities.html",
        "Summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Monday added four security flaws to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation in the wild.\nThe list of flaws is as follows -\n\nCVE-2014-3931 (CVSS score: 9.8) - A buffer overflow vulnerability in Multi-Router Looking Glass (MRLG) that could allow remote attackers to cause an",
        "Date": "2025-07-08",
        "Content": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Monday\nadded\nfour security flaws to its Known Exploited Vulnerabilities (\nKEV\n) catalog, citing evidence of active exploitation in the wild.\nThe list of flaws is as follows -\nCVE-2014-3931\n(CVSS score: 9.8) - A buffer overflow vulnerability in Multi-Router Looking Glass (MRLG) that could allow remote attackers to cause an arbitrary memory write and memory corruption\nCVE-2016-10033\n(CVSS score: 9.8) - A command injection vulnerability in PHPMailer that could allow an attacker to execute arbitrary code within the context of the application or result in a denial-of-service (DoS) condition\nCVE-2019-5418\n(CVSS score: 7.5) - A path traversal vulnerability in Ruby on Rails' Action View that could cause contents of arbitrary files on the target system's file system to be exposed\nCVE-2019-9621\n(CVSS score: 7.5) - A Server-Side Request Forgery (SSRF) vulnerability in the Zimbra Collaboration Suite that could result in unauthorized access to internal resources and remote code execution\nThere are currently no public reports on how the first three vulnerabilities are being exploited in real-world attacks. The abuse of CVE-2019-9621, on the other hand, was attributed by Trend Micro to a China-linked threat actor known as\nEarth Lusca\nin September 2023 to drop web shells and Cobalt Strike.\nIn light of active exploitation, Federal Civilian Executive Branch (FCEB) agencies are recommended to apply the necessary updates by July 28, 2025, to secure their networks.\nTechnical Details of Citrix Bleed 2 Out\nThe development comes as\nwatchTowr Labs\nand\nHorizon3.ai\nhave released technical analyses for a critical security flaw in Citrix NetScaler ADC (\nCVE-2025-5777\naka Citrix Bleed 2), which is assessed to have come under active exploitation.\n\"We're seeing active exploitation of both CVE-2025-5777 and CVE-2025-6543 in the wild,\" watchTowr CEO Benjamin Harris told The Hacker News. \"This vulnerability allows reading of memory, which we believe attackers are using to read sensitive information (for example, information sent within HTTP requests that are then processed in-memory), credentials, valid Citrix session tokens, and more.\"\nThe findings show that it's possible to send a login request to the \"/p/u/doAuthentication.do\" endpoint and cause it (and other endpoints susceptible to the flaw) to reflect the user-supplied login value in the response, regardless of success or failure.\nHorizon3.ai noted that the vulnerability could be used to leak approximately 127 bytes of data via a specially crafted HTTP request with a modified \"login=\" without an equal sign or value, thereby making it possible to extract session tokens or other sensitive information.\nThe shortcoming, watchTowr explained, stems from the use of the snprintf function along with a format string containing the \"%.*s\" format.\n\"The %.*s format tells snprintf: 'Print up to N characters, or stop at the first null byte (\\\\0) - whichever comes first.' That null byte eventually appears somewhere in memory, so while the leak doesn't run indefinitely, you still get a handful of bytes with each invocation,\" the company said.\n\"So, every time you hit that endpoint without the =, you pull more uninitialized stack data into the response. Repeat it enough times, and eventually, you might land on something valuable.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Samsung announces major security enhancements coming to One UI 8",
        "Link": "https://www.bleepingcomputer.com/news/security/samsung-announces-major-security-enhancements-coming-to-one-ui-8/",
        "Summary": "Samsung has announced multiple data security and privacy enhancements for its upcoming Galaxy smartphones running One UI 8, its custom user interface on top of Android. [...]",
        "Date": "2025-07-08",
        "Content": "Samsung has announced multiple data security and privacy enhancements for its upcoming Galaxy smartphones running One UI 8, its custom user interface on top of Android.\nKey highlights include the introduction of a system-level architecture named Knox Enhanced Encrypted Protection (KEEP), upgrades to Knox Matrix, and the addition of quantum resistance to WiFi connectivity.\nKeeping AI data secure\nWith AI tools taking an increasing role in day-to-day smartphone use, protecting user inputs has become more crucial.\nTo address this, Samsung is\nintroducing KEEP\n, a system built to support the company's Personal Data Engine (PDE) and other AI features like ‘Now Brief’ (personalized daily updates), ‘Smart Suggestions,’ ‘Moments’ (photo memories), and ‘Smart Gallery Search’ (natural language photo retrieval).\nKEEP is different from the existing ‘Secure Folder’, which is just a separate secure storage space. It is an architecture that creates isolated environments for each app to store sensitive data in encrypted state and keep it protected from unauthorized access by other processes.\nKnox Matrix expansion\nKnox Matrix, Samsung’s multi-device platform designed to protect and manage security across all connected Galaxy devices, will also receive significant upgrades in One UI 8.\nFirst, when the system detects manipulation or identity forgery, Knox Matrix will automatically sign out of the Samsung Account, cutting off the attacker’s channel to access cloud-connected services, data, and pivot to other devices.\nIf such an event occurs, the user receives an alert across all their connected Galaxy devices.\nAnother important addition to Knox Matrix concerns the delivery of warnings to users when they have yet to apply the latest security updates on their devices.\nQuantum WiFi\nThe release of One UI 8 also brings upgrades to Samsung’s ‘Secure WiFi,’ which will use the NIST-certified ML‑KEM scheme to offer post-quantum cryptographic resistance.\nThis strengthens the key-exchange process and protects encrypted connections from future quantum-based threats such as “harvest now, decrypt later” attacks, which could expose sensitive user data in the future.\nSecure WiFi also offers automatic strengthening when connecting to public hotspots, multi-point routing and packet encryption for anonymization, and security-related logging.\nOne UI 8 is expected to be released alongside Samsung’s upcoming launch of the widely anticipated Galaxy Z Fold 7 and Z Flip 7 devices, but the update is also expected to reach older Galaxy models soon.\nUsers who want to take advantage of the new protections should upgrade to the new release and review their data privacy and security settings accordingly.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nNew Android TapTrap attack fools users with invisible UI trick\nAndroid malware Anatsa infiltrates Google Play to target US banks\nMalware on Google Play, Apple App Store stole your photos—and crypto\nMicrosoft to remove legacy drivers from Windows Update for security boost\nMicrosoft unveils new security defaults for Windows 365 Cloud PCs"
    },
    {
        "Title": "M&S confirms social engineering led to massive ransomware attack",
        "Link": "https://www.bleepingcomputer.com/news/security/mands-confirms-social-engineering-led-to-massive-ransomware-attack/",
        "Summary": "M&amp;S confirmed today that the retail outlet's network was initially breached in a \"sophisticated impersonation attack\" that ultimately led to a DragonForce ransomware attack. [...]",
        "Date": "2025-07-08",
        "Content": "M&S confirmed today that the retail outlet's network was initially breached in a \"sophisticated impersonation attack\" that ultimately led to a DragonForce ransomware attack.\nM&S chairman Archie Norman revealed this in a hearing with the UK Parliament's Business and Trade Sub-Committee on Economic Security regarding the recent attacks on the retail sector in the country.\nWhile Norman did not go into details, he stated that the threat actors impersonated one of the 50,000 people working with the company to trick a third-party entity into resetting an employee's password.\n\"In our case the initial entry, which was on April the 17th, occured through what people now call social engineering. As far as I can tell that's a euphamism for impersonation,\" Norman explained to the MPs.\n\"And it was a sophisticated impersonation. They just didn't walk up and say will you change my password. They appeared as somebody with their details. And part of the point of entry also involved a third-party.\"\nAs\nreported by FT\nin May, IT outsourcing company Tata Consultancy Services had begun investigating whether it was inadvertantly involved in the attack on M&S. Tata provides help desk support for M&S and is believed to have been tricked by the threat actors into resetting an employee's password, which was then used to breach the M&S network.\nFor the first time, M&S referenced the DragonForce ransomware operation as the potential attacker, which he stated was believed to be operating from Asia.\n\"The instigator of the attack is believed to be DragonForce, who are a ransomware operation based, we believe, in Asia.\"\nSince the attack, many media outlets have incorrectly linked a hacktivist group known as \"DragonForce Malaysia\" with the DragonForce ransomware gang. The hacktivists are believed to be a pro-Palestine group operating out of Malaysia, while the DragonForce ransomware operation is believed to be in Russia.\nAs first reported by BleepingComputer, the attack on M&S was conducted by threat actors linked to Scattered Spider, who deployed the DragonForce ransomware on the network.\nThis led M&S to purposely shut down all their systems to prevent the spread of the attack.\nHowever, by then, it was too late, with numerous VMware ESXi servers encrypted and sources telling BleepingComputer that approximately 150GB of data was believed to be stolen.\nThe ransomware operation employs a double-extortion tactic, which involves not only encrypting devices but also stealing data and threatening to publish it if a ransom is not paid.\nWhile BleepingComputer was told that data was stolen in the attack, DragonForce has not made an entry on their data leak site for M&S. This could indicate that the retail chain paid a ransom demand to prevent the leaking of stolen data.\nWhen asked about the ransom demands during the hearings, Norman said they took a hands-off approach when dealing with the threat actors.\n\"We took an early decision that nobody at M&S would deal with the threat actors directly. We felt that the right thing would be to leave this to the professionals who have experience in the matter,\" explained Norman.\nNorman is likely referring to ransomware negotiation firms that help companies negotiate with threat actors and obtain access to Bitcoin to facilitate payments.\nWhen explicitly asked if they paid a ransom demand, Norman said they were not discussing these details publicly as they \"don't think it's in the public interest,\" but had fully shared the subject with the NCA and the authorities.\nRansomware gangs rarely do anything for free, and if data was stolen and not leaked by now, then either a payment has been made or the threat actors are still negotiating with M&S.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nService desks are under attack: What can you do about it?\nIngram Micro outage caused by SafePay ransomware attack\nQantas discloses cyberattack amid Scattered Spider aviation breaches\nJohnson Controls starts notifying people affected by 2023 breach\nU.S. warns of Iranian cyber threats on critical infrastructure"
    },
    {
        "Title": "New Android TapTrap attack fools users with invisible UI trick",
        "Link": "https://www.bleepingcomputer.com/news/security/new-android-taptrap-attack-fools-users-with-invisible-ui-trick/",
        "Summary": "A novel tapjacking technique can exploit user interface animations to bypass Android's permission system and allow access to sensitive data or trick users into performing destructive actions, such as wiping the device. [...]",
        "Date": "2025-07-08",
        "Content": "A novel tapjacking technique can exploit user interface animations to bypass Android's permission system and allow access to sensitive data or trick users into performing destructive actions, such as wiping the device.\nUnlike traditional, overlay-based tapjacking, TapTrap attacks work even with zero-permission apps to launch a harmless transparent activity on top of a malicious one, a behavior that remains unmitigated in Android 15 and 16.\nTapTrap was developed by a team of security researchers at TU Wien and the University of Bayreuth (Philipp Beer, Marco Squarcina, Sebastian Roth, Martina Lindorfer), and will be presented next month at the\nUSENIX Security Symposium\n.\nHowever, the team has already published a\ntechnical paper\nthat outlines the attack and a\nwebsite\nthat summarizes most of the details.\nHow TapTrap works\nTapTrap abuses the way Android handles activity transitions with custom animations to create a visual mismatch between what the user sees and what the device actually registers.\nA malicious app installed on the target device launches a sensitive system screen (permission prompt, system setting, etc.) from another app using ‘startActivity()’ with a custom low-opacity animation.\n“The key to TapTrap is using an animation that renders the target activity nearly invisible,” the researchers say on a\nwebsite that explains the attack\n.\n“This can be achieved by defining a custom animation with both the starting and ending opacity (alpha) set to a low value, such as 0.01,” thus making the malicious or risky activity almost completely transparent.\n“Optionally, a scale animation can be applied to zoom into a specific UI element (e.g., a permission button), making it occupy the full screen and increasing the chance the user will tap it.”\nTapTrap overview\nSource: taptrap.click\nAlthough the launched prompt receives all touch events, all the user sees is the underlying app that displays its own UI elements, as on top of it is the transparent screen the user actually engages with.\nThinking they interact with the bening app, a user may tap on specific screen positions that correspond to risky actions, such as an “Allow” or \"Authorize\" buttons on nearly invisible prompts.\nA video released by the researchers demonstrates how a game app could leverage TapTrap to enable camera access for a website via Chrome browser.\nRisk exposure\nTo check if TapTrap could work with applications in Play Store, the official Android repository, the researchers analyzed close to 100,000. They found that 76% of them are vulnerable to TapTrap as they include a screen (\"activity\") that meets the following conditions:\ncan be launched by another app\nruns in the same task as the calling app\ndoes not override the transition animation\ndoes not wait for the animation to finish before reacting to user input\nThe researchers say that animations are enabled on the latest Android version unless the user disables them from the developer options or accessibility settings, exposing the devices to TapTrap attacks.\nWhile developing the attack, the researchers used Android 15, the latest version at the time, but after Android 16 came out they also ran some tests on it.\nMarco Squarcina told BleepingComputer that they tried TapTrap on a Google Pixel 8a running Android 16 and they can confirm that the issue remains unmitigated.\nGrapheneOS, the mobile operating system focused on privacy and security, also confirmed to BleepingComputer that the latest Android 16 is vulnerable to the TapTrap technique, and announced that the their next release will\ninclude a fix\n.\nBleepingComputer has contacted Google about TapTrap, and a spokesperson said that the TapTrap problem will be mitigated in a future update:\n“Android is constantly improving its existing mitigations against tapjacking attacks. We are aware of this research and we will be addressing this issue in a future update. Google Play has policies in place to keep users safe that all developers must adhere to, and if we find that an app has violated our policies, we take appropriate action.”- a Google representative told BleepingComputer.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nAndroid malware Anatsa infiltrates Google Play to target US banks\nMalware on Google Play, Apple App Store stole your photos—and crypto\nAndroid malware Crocodilus adds fake contacts to spoof trusted callers\nAndroid 16 expands 'Advanced Protection' with device-level security\nNew FileFix attack runs JScript while bypassing Windows MoTW alerts"
    },
    {
        "Title": "Windows 10 KB5062554 cumulative update released with 13 changes, fixes",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb5062554-cumulative-update-released-with-13-changes-fixes/",
        "Summary": "Microsoft has released the KB5062554 cumulative update for Windows 10 22H2 and Windows 10 21H2, with thirteen new fixes or changes. [...]",
        "Date": "2025-07-08",
        "Content": "Microsoft has released the KB5062554 cumulative update for Windows 10 22H2 and Windows 10 21H2, with thirteen new fixes or changes.\nThe Windows 10 KB5062554 update is mandatory as it contains\nMicrosoft's July 2025 Patch Tuesday\nsecurity updates, which fix one zero-day vulnerability and 136 other flaws.\nWindows users can install this update by going into\nSettings\n, clicking on\nWindows Update,\nand manually performing a\n'Check for Updates\n.'\nHowever, as this update is mandatory, it will automatically start installing in Windows once you check for updates. To make this more manageable, you can schedule a time when your computer is restarted to finish the installation.\nWindows 10 KB5062554 update\nSource: BleepingComputer\nAfter installing this update, Windows 10 22H2 will be updated to build 19045.6093, and Windows 10 21H2 will be updated to build 19044.6093.\nWindows 10 users can also manually download and install the KB5062554 update from the\nMicrosoft Update Catalog\n.\nWhat's new in Windows 10 KB5062554\nAs Windows 10 nears the end of its life in October 2025, Microsoft is only focusing on minor bug fixes and improvements to the operating system.\nThe KB5062554 update includes thirteen fixes and changes that were previously being tested as part of the June preview update.\nThe changes and fixes are listed below:\n​​​​​\n[Mobile Operator Profiles]\nUpdated: Country and Operator Settings Asset (COSA) profiles.\n[File Server]\nFixed: An issue where the system may stop responding when acknowledging an Oplock break request on resources located on SMB shares.\n[Servicing]\nFixed: An issue where Kiosk devices using the ForceAutoLogon configuration and Shift Override might stop responding with a blue screen after being locked and unlocked by support administrators.\nChange of behavior: Associates HTTP and .pdf file types when setting default browser.\n[WinSaS]\nFixed:\nSettings\n>\nSystem\n>\nAbout\nincorrectly shows version 2009 instead of version 22H2.\nChange of behavior: To maintain DMA compliance in the European Economic Area (EEA), when a new default browser is set, it is automatically pinned to the Taskbar and Start menu.\n[Start Menu]\nFixed: An issue causing jump lists to disappear from the Start Menu.\nFixed: An issue where the Start Menu was not starting after installing an update.\n[Print and Peripherals]\nFixed: An issue affecting the complete removal of unused language packs and Feature on Demand (FOD) packages. This issue led to unnecessary storage use and increased Windows update installation time.\n[Input and Composition]\nFixed: An issue affecting USB-connected Multi-Function printers with dual protocol interfaces. Scanning failed and prevented the use of the built-in scanning functionality in the operating system.\n[Authentication Platform]\nFixed: An issue affecting the device registration in\nEntra ID Windows Account Manager (WAM)\nplugin.\n[App Platforms and Frameworks]\nFixed: An issue affecting Component Object Model (COM) functionality on Windows platforms. Remote COM activations were failing with error 0x8001011.\nUpdated: The version of the\ncurl\ntool included in Windows is updated to v8.13.0.\nMicrosoft states that the only known issue with this update is that NOTO fonts may appear blurry or unclear when displayed at 96 DPI.\n\"There are reports of blurry or unclear CJK (Chinese, Japanese, Korean) text when displayed at 96 DPI (100% scaling) in Chromium-based browsers such as Microsoft Edge and Google Chrome,\" explains Microsoft.\nAs a temporary workaround is to set your display scaling to 125% or 150% to improve text clarity.\nA complete list of fixes can be found in the\nKB5062554 support bulletin\nand last month's\nKB5061087 preview update bulletin\n.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nWindows 10 KB5060533 cumulative update released with 7 changes, fixes\nMicrosoft July 2025 Patch Tuesday fixes one zero-day, 137 flaws\nMicrosoft June 2025 Patch Tuesday fixes exploited zero-day, 66 flaws\nWindows 10 KB5058379 update fixes SgrmBroker errors in Event Viewer\nMicrosoft May 2025 Patch Tuesday fixes 5 exploited zero-days, 72 flaws"
    },
    {
        "Title": "Windows 11 KB5062553 & KB5062552  cumulative updates released",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5062553-and-kb5062552-cumulative-updates-released/",
        "Summary": "Microsoft has released Windows 11 KB5062553 and KB5062552 cumulative updates for versions 24H2 and 23H2 to fix security vulnerabilities and issues. [...]",
        "Date": "2025-07-08",
        "Content": "Microsoft has released Windows 11\nKB5062553\nand\nKB5062552\ncumulative updates for versions 24H2 and 23H2 to fix security vulnerabilities and issues.\nToday's updates are mandatory as they contain the\nJuly 2025 Patch Tuesday\nsecurity patches for vulnerabilities discovered in previous months.\nYou can install today's update by going to\nStart\n>\nSettings\n>\nWindows Update\nand clicking on\n'Check for Updates\n.'\nYou can also manually download and install the update from the\nMicrosoft Update Catalog\n.\nWhat's new in the July 2025 Patch Tuesday update\nAfter installing today's security updates, Windows 11 24H2 (\nKB5062553\n) will have its build number changed to Build 26100.4652, and 23H2 (\nKB5062552\n) will be changed to 226x1.5624.\nJuly 2025's Patch Tuesday update has a lot of changes. For example, you can now turn on smaller taskbar icons. And Click to Do on Copilot+ PCs now have Microsoft 365 Copilot button, but you won't see majority of the changes because of CFR (Controlled Feature Rollout).\nHere's the full list of improvements:\n[App defaults]\nNew!\nWe are rolling out some small changes in the European Economic Area (EEA) region for default browsers through the\nSet\ndefault button in\nSettings\n>\nApps\n>\nDefault apps\n:\nAdditional file and link types will be set for the new default browser, if it registers them.\nThe new default browser will be pinned to the Taskbar and Start menu unless you choose not to pin it by clearing the checkboxes.\nThere is now a separate one-click button for browsers to change your .pdf default, if the browser registers for the .pdf file type.\n[Click to Do (Preview)]\nNew!\nAsk Microsoft 365 Copilot\nis a new action in Click to Do on Copilot+ PCs. Use it to send text or images to Microsoft 365 Copilot, which will respond to your questions. The Ask Microsoft 365 Copilot action requires a Microsoft 365 license and follows your organization’s privacy policies.\n[Narrator]\nNew!\nThe Screen Curtain feature in Narrator helps protect your privacy and improve focus by blacking out the screen while Narrator reads content aloud. This is especially helpful in public or shared spaces, where you can work with sensitive information without others seeing your screen. To turn on Narrator, press\nCtrl\n+\nWindows\n+\nEnter\n. Then press\nCaps Lock\n+\nCtrl\n+\nC\nto turn on Screen Curtain. While it’s on, you can use Narrator as usual with the screen hidden. Press\nCaps Lock\n+\nCtrl\n+\nC\nagain to turn it off.\nNew!\nNarrator makes it easier to discover and learn about its features directly within the experience. Whether you're new or exploring advanced options, Narrator will guide you through the latest updates using a series of steps and prompts that explain each new feature and change.\n[PC Migration]\nNew!\nThe PC-to-PC migration experience in Windows is starting to roll out. You’ll begin to see the landing and the pairing page in the Windows Backup app, giving you a first look at what’s coming. In the full experience, you’ll be able to transfer files and settings from an old PC to a new one during setup. Support for this feature during PC setup will arrive in a future update. The rollout is being introduced in phases to support a smooth experience.\n[Settings]\nNew!\nWe are starting to roll out the Settings homepage for commercial customers on PCs managed by an IT administrator. The feature will show some existing cards relevant to enterprise-managed PCs like “Recommended settings” and “Bluetooth devices” as well as two new enterprise-specific device info and accessibility preferences cards. For commercial customers who also use their Microsoft account on their managed PC, there will also be a new accounts card indicating the presence of both work and school and Microsoft account types.\nNew!\nThe country or region selected during device setup now appears under\nSettings\n>\nTime & language\n>\nLanguage & region\n.\n[Taskbar & System Tray]\nNew!\nThe taskbar now resizes icons to fit more apps when space runs low, keeping everything visible and easy to access. You can adjust how icons appear in settings—reduce icon size only when the\ntaskbar is full\n(default), keep icons at their original size at all times by selecting\nNever,\nor use smaller icons all the time by selecting\nAlways\n. To change this setting, right-click an empty area on the taskbar, select\nTaskbar settings\n, expand the\nTaskbar behaviors\nsection, and choose your preference under\nShow smaller taskbar buttons\n.\nNew!\nIn addition to the new grouping of the\nAccessibility\nmenu in\nQuick\nsettings, there are text descriptions for the\nassistive technologies\nlike Narrator, Voice access, and more for easier identification and learning.\nNew!\nAdjusted the indicator (pill) under taskbar apps to make it wider and more visible.​​​​​​​\nFixed:\nWIN\n+\nCTRL\n+\nNumber\ndoesn't work anymore for switching windows of an open app in the taskbar.​​​​​​​\nFixed: When using taskbar in Windows, the media controls that appear in the preview windows for apps might unexpectedly flicker.\n[Voice Access]\nNew!\nYou can now use Voice access to navigate, dictate, and interact with Windows using voice commands in Simplified Chinese and Traditional Chinese.\nNew!\nYou can add custom words to the dictionary in voice access. The feature will be available in all the currently supported voice access languages.\nMicrosoft is not aware of any new issues, but the changelog still lists problem with certain fonts in regions like China, Japan and Korea.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nMicrosoft fixes known issue that breaks Windows 11 updates\nMicrosoft warns of Windows update delays due to wrong timestamp\nMicrosoft creates separate Windows 11 24H2 update for incompatible PCs\nMicrosoft: Windows 11 might fail to start after installing KB5058405\nMicrosoft: Windows 11 24H2 now ready to rollout to everyone"
    },
    {
        "Title": "Microsoft July 2025 Patch Tuesday fixes one zero-day, 137 flaws",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-july-2025-patch-tuesday-fixes-one-zero-day-137-flaws/",
        "Summary": "Today is Microsoft's July 2025 Patch Tuesday, which includes security updates for 137 flaws, including one publicly disclosed zero-day vulnerability in Microsoft SQL Server. [...]",
        "Date": "2025-07-08",
        "Content": "Today is Microsoft's July 2025 Patch Tuesday, which includes security updates for 137 flaws, including one publicly disclosed zero-day vulnerability in Microsoft SQL Server.\nThis Patch Tuesday also fixes fourteen \"Critical\" vulnerabilities, ten of which are remote code execution vulnerabilities, one is an information disclosure, and two are AMD side channel attack flaws.\nThe number of bugs in each vulnerability category is listed below:\n53 Elevation of Privilege Vulnerabilities\n8 Security Feature Bypass Vulnerabilities\n41 Remote Code Execution Vulnerabilities\n18 Information Disclosure Vulnerabilities\n6 Denial of Service Vulnerabilities\n4 Spoofing Vulnerabilities\nThese counts do not include four Mariner and three Microsoft Edge issues fixed earlier this month.\nTo learn more about the non-security updates released today, you can review our dedicated articles on the\nWindows 11 KB5062553 & KB5062552 cumulative updates\nand the\nWindows 10 KB5062554 cumulative update\n.\nOne zero-day and critical Microsoft office flaws\nThis month's Patch Tuesday fixes one publicly disclosed zero-day in Microsoft SQL Server. Microsoft\nclassifies a zero-day flaw\nas publicly disclosed or actively exploited while no official fix is available.\nThe publicly disclosed zero-day is:\nCVE-2025-49719\n- Microsoft SQL Server Information Disclosure Vulnerability\nMicrosoft fixes a flaw in Microsoft SQL Server that could allow a remote, unauthenticated attacker to access data from uninitialized memory.\n\"Improper input validation in SQL Server allows an unauthorized attacker to disclose information over a network,\" explains Microsoft.\nAdmins can fix the flaw by installing the latest version of Microsoft SQL Server and by installing the Microsoft OLE DB Driver 18 or 19.\nMicrosoft attributes the discovery of this flaw to Vladimir Aleksic with Microsoft and does not provide details regarding how it was publicly disclosed.\nWhile there was only one zero-day in this Patch Tuesday, Microsoft fixed numerous, critical remote code execution flaws in Microsoft Office that can be exploited simply by opening a specially crafted document or when viewed through the preview pane.\nMicrosoft states that the security updates for these flaws are not yet available for Microsoft Office LTSC for Mac 2021 and 2024 and will be released shortly.\nThe company also fixed another critical RCE in Microsoft SharePoint tracked as\nCVE-2025-49704\nthat can be exploited remotely over the Internet as long as they have an account on the platform.\nRecent updates from other companies\nOther vendors who released updates or advisories in July 2025 include:\nAMD\ndisclosed new Transient Scheduler Attacks\nbased on a Microsoft report titled \"\nEnter, Exit, Page Fault, Leak: Testing Isolation Boundaries for Microarchitectural Leaks\n.\"\nCisco\nreleased numerous patches\nthis month, including one for\nhardcoded root SSH credentials\nin Unified CM.\nFortinet\nreleased security updates\ntoday for multiple products, including FortiOS, FortiManager, FortiSandbox, FortiIsolator, and FortiProxy.\nGoogle's\nreleased security updates\nfor Google Chrome to fix an\nactively exploited zero-day tracked as CVE-2025-6554\n. Google has not released any Android security patches in its\nJuly 2025 Android Security Bulletin\n.\nGrafana\nhas\nreleased security fixes\nfor four Chromium vulnerabilities in Grafana Image Renderer plugin and Synthetic Monitoring Agent.\nIvanti\nreleased security updates\nfor flaws in Ivanti Connect Secure and Policy Secure, Ivanti EPMM, and Ivanti EPM. None of these vulnerabilities has been reported as actively exploited.\nSAP\nreleased the July security updates\nfor multiple products, including upgrading a previous flaw (\nCVE-2025-30012\n) in SAP Supplier Relationship Management to a rating of 10/10.\nThe July 2025 Patch Tuesday Security Updates\nBelow is the complete list of resolved vulnerabilities in the July 2025 Patch Tuesday updates.\nTo access the full description of each vulnerability and the systems it affects, you can view the\nfull report here\n.\nTag\nCVE ID\nCVE Title\nSeverity\nAMD L1 Data Queue\nCVE-2025-36357\nAMD: CVE-2025-36357 Transient Scheduler Attack in L1 Data Queue\nCritical\nAMD Store Queue\nCVE-2025-36350\nAMD: CVE-2024-36350 Transient Scheduler Attack in Store Queue\nCritical\nAzure Monitor Agent\nCVE-2025-47988\nAzure Monitor Agent Remote Code Execution Vulnerability\nImportant\nCapability Access Management Service (camsvc)\nCVE-2025-49690\nCapability Access Management Service (camsvc) Elevation of Privilege Vulnerability\nImportant\nHID class driver\nCVE-2025-48816\nHID Class Driver Elevation of Privilege Vulnerability\nImportant\nKernel Streaming WOW Thunk Service Driver\nCVE-2025-49675\nKernel Streaming WOW Thunk Service Driver Elevation of Privilege Vulnerability\nImportant\nMicrosoft Brokering File System\nCVE-2025-49677\nMicrosoft Brokering File System Elevation of Privilege Vulnerability\nImportant\nMicrosoft Brokering File System\nCVE-2025-49694\nMicrosoft Brokering File System Elevation of Privilege Vulnerability\nImportant\nMicrosoft Brokering File System\nCVE-2025-49693\nMicrosoft Brokering File System Elevation of Privilege Vulnerability\nImportant\nMicrosoft Configuration Manager\nCVE-2025-47178\nMicrosoft Configuration Manager Remote Code Execution Vulnerability\nImportant\nMicrosoft Graphics Component\nCVE-2025-49732\nWindows Graphics Component Elevation of Privilege Vulnerability\nImportant\nMicrosoft Graphics Component\nCVE-2025-49742\nWindows Graphics Component Remote Code Execution Vulnerability\nImportant\nMicrosoft Graphics Component\nCVE-2025-49744\nWindows Graphics Component Elevation of Privilege Vulnerability\nImportant\nMicrosoft Input Method Editor (IME)\nCVE-2025-49687\nWindows Input Method Editor (IME) Elevation of Privilege Vulnerability\nImportant\nMicrosoft Input Method Editor (IME)\nCVE-2025-47991\nWindows Input Method Editor (IME) Elevation of Privilege Vulnerability\nImportant\nMicrosoft Input Method Editor (IME)\nCVE-2025-47972\nWindows Input Method Editor (IME) Elevation of Privilege Vulnerability\nImportant\nMicrosoft MPEG-2 Video Extension\nCVE-2025-48806\nMicrosoft MPEG-2 Video Extension Remote Code Execution Vulnerability\nImportant\nMicrosoft MPEG-2 Video Extension\nCVE-2025-48805\nMicrosoft MPEG-2 Video Extension Remote Code Execution Vulnerability\nImportant\nMicrosoft Office\nCVE-2025-47994\nMicrosoft Office Elevation of Privilege Vulnerability\nImportant\nMicrosoft Office\nCVE-2025-49697\nMicrosoft Office Remote Code Execution Vulnerability\nCritical\nMicrosoft Office\nCVE-2025-49695\nMicrosoft Office Remote Code Execution Vulnerability\nCritical\nMicrosoft Office\nCVE-2025-49696\nMicrosoft Office Remote Code Execution Vulnerability\nCritical\nMicrosoft Office\nCVE-2025-49699\nMicrosoft Office Remote Code Execution Vulnerability\nImportant\nMicrosoft Office\nCVE-2025-49702\nMicrosoft Office Remote Code Execution Vulnerability\nCritical\nMicrosoft Office Excel\nCVE-2025-48812\nMicrosoft Excel Information Disclosure Vulnerability\nImportant\nMicrosoft Office Excel\nCVE-2025-49711\nMicrosoft Excel Remote Code Execution Vulnerability\nImportant\nMicrosoft Office PowerPoint\nCVE-2025-49705\nMicrosoft PowerPoint Remote Code Execution Vulnerability\nImportant\nMicrosoft Office SharePoint\nCVE-2025-49701\nMicrosoft SharePoint Remote Code Execution Vulnerability\nImportant\nMicrosoft Office SharePoint\nCVE-2025-49704\nMicrosoft SharePoint Remote Code Execution Vulnerability\nCritical\nMicrosoft Office SharePoint\nCVE-2025-49706\nMicrosoft SharePoint Server Spoofing Vulnerability\nImportant\nMicrosoft Office Word\nCVE-2025-49703\nMicrosoft Word Remote Code Execution Vulnerability\nCritical\nMicrosoft Office Word\nCVE-2025-49698\nMicrosoft Word Remote Code Execution Vulnerability\nCritical\nMicrosoft Office Word\nCVE-2025-49700\nMicrosoft Word Remote Code Execution Vulnerability\nImportant\nMicrosoft PC Manager\nCVE-2025-47993\nMicrosoft PC Manager Elevation of Privilege Vulnerability\nImportant\nMicrosoft PC Manager\nCVE-2025-49738\nMicrosoft PC Manager Elevation of Privilege Vulnerability\nImportant\nMicrosoft Teams\nCVE-2025-49731\nMicrosoft Teams Elevation of Privilege Vulnerability\nImportant\nMicrosoft Teams\nCVE-2025-49737\nMicrosoft Teams Elevation of Privilege Vulnerability\nImportant\nMicrosoft Windows QoS scheduler\nCVE-2025-49730\nMicrosoft Windows QoS Scheduler Driver Elevation of Privilege Vulnerability\nImportant\nMicrosoft Windows Search Component\nCVE-2025-49685\nWindows Search Service Elevation of Privilege Vulnerability\nImportant\nOffice Developer Platform\nCVE-2025-49756\nOffice Developer Platform Security Feature Bypass Vulnerability\nImportant\nRemote Desktop Client\nCVE-2025-48817\nRemote Desktop Client Remote Code Execution Vulnerability\nImportant\nRemote Desktop Client\nCVE-2025-33054\nRemote Desktop Spoofing Vulnerability\nImportant\nRole: Windows Hyper-V\nCVE-2025-48822\nWindows Hyper-V Discrete Device Assignment (DDA) Remote Code Execution Vulnerability\nCritical\nRole: Windows Hyper-V\nCVE-2025-47999\nWindows Hyper-V Denial of Service Vulnerability\nImportant\nRole: Windows Hyper-V\nCVE-2025-48002\nWindows Hyper-V Information Disclosure Vulnerability\nImportant\nService Fabric\nCVE-2025-21195\nAzure Service Fabric Runtime Elevation of Privilege Vulnerability\nImportant\nSQL Server\nCVE-2025-49719\nMicrosoft SQL Server Information Disclosure Vulnerability\nImportant\nSQL Server\nCVE-2025-49718\nMicrosoft SQL Server Information Disclosure Vulnerability\nImportant\nSQL Server\nCVE-2025-49717\nMicrosoft SQL Server Remote Code Execution Vulnerability\nCritical\nStorage Port Driver\nCVE-2025-49684\nWindows Storage Port Driver Information Disclosure Vulnerability\nImportant\nUniversal Print Management Service\nCVE-2025-47986\nUniversal Print Management Service Elevation of Privilege Vulnerability\nImportant\nVirtual Hard Disk (VHDX)\nCVE-2025-47971\nMicrosoft Virtual Hard Disk Elevation of Privilege Vulnerability\nImportant\nVirtual Hard Disk (VHDX)\nCVE-2025-49689\nMicrosoft Virtual Hard Disk Elevation of Privilege Vulnerability\nImportant\nVirtual Hard Disk (VHDX)\nCVE-2025-49683\nMicrosoft Virtual Hard Disk Remote Code Execution Vulnerability\nLow\nVirtual Hard Disk (VHDX)\nCVE-2025-47973\nMicrosoft Virtual Hard Disk Elevation of Privilege Vulnerability\nImportant\nVisual Studio\nCVE-2025-49739\nVisual Studio Elevation of Privilege Vulnerability\nImportant\nVisual Studio\nCVE-2025-27614\nMITRE: CVE-2025-27614 Gitk Arbitrary Code Execution Vulnerability\nUnknown\nVisual Studio\nCVE-2025-27613\nMITRE: CVE-2025-27613 Gitk Arguments Vulnerability\nUnknown\nVisual Studio\nCVE-2025-46334\nMITRE: CVE-2025-46334 Git Malicious Shell Vulnerability\nUnknown\nVisual Studio\nCVE-2025-46835\nMITRE: CVE-2025-46835 Git File Overwrite Vulnerability\nUnknown\nVisual Studio\nCVE-2025-48384\nMITRE: CVE-2025-48384 Git Symlink Vulnerability\nUnknown\nVisual Studio\nCVE-2025-48386\nMITRE: CVE-2025-48386 Git Credential Helper Vulnerability\nUnknown\nVisual Studio\nCVE-2025-48385\nMITRE: CVE-2025-48385 Git Protocol Injection Vulnerability\nUnknown\nVisual Studio Code - Python extension\nCVE-2025-49714\nVisual Studio Code Python Extension Remote Code Execution Vulnerability\nImportant\nWindows Ancillary Function Driver for WinSock\nCVE-2025-49661\nWindows Ancillary Function Driver for WinSock Elevation of Privilege Vulnerability\nImportant\nWindows AppX Deployment Service\nCVE-2025-48820\nWindows AppX Deployment Service Elevation of Privilege Vulnerability\nImportant\nWindows BitLocker\nCVE-2025-48818\nBitLocker Security Feature Bypass Vulnerability\nImportant\nWindows BitLocker\nCVE-2025-48001\nBitLocker Security Feature Bypass Vulnerability\nImportant\nWindows BitLocker\nCVE-2025-48804\nBitLocker Security Feature Bypass Vulnerability\nImportant\nWindows BitLocker\nCVE-2025-48003\nBitLocker Security Feature Bypass Vulnerability\nImportant\nWindows BitLocker\nCVE-2025-48800\nBitLocker Security Feature Bypass Vulnerability\nImportant\nWindows Connected Devices Platform Service\nCVE-2025-48000\nWindows Connected Devices Platform Service Elevation of Privilege Vulnerability\nImportant\nWindows Connected Devices Platform Service\nCVE-2025-49724\nWindows Connected Devices Platform Service Remote Code Execution Vulnerability\nImportant\nWindows Cred SSProvider Protocol\nCVE-2025-47987\nCredential Security Support Provider Protocol (CredSSP) Elevation of Privilege Vulnerability\nImportant\nWindows Cryptographic Services\nCVE-2025-48823\nWindows Cryptographic Services Information Disclosure Vulnerability\nImportant\nWindows Event Tracing\nCVE-2025-47985\nWindows Event Tracing Elevation of Privilege Vulnerability\nImportant\nWindows Event Tracing\nCVE-2025-49660\nWindows Event Tracing Elevation of Privilege Vulnerability\nImportant\nWindows Fast FAT Driver\nCVE-2025-49721\nWindows Fast FAT File System Driver Elevation of Privilege Vulnerability\nImportant\nWindows GDI\nCVE-2025-47984\nWindows GDI Information Disclosure Vulnerability\nImportant\nWindows Imaging Component\nCVE-2025-47980\nWindows Imaging Component Information Disclosure Vulnerability\nCritical\nWindows KDC Proxy Service (KPSSVC)\nCVE-2025-49735\nWindows KDC Proxy Service (KPSSVC) Remote Code Execution Vulnerability\nCritical\nWindows Kerberos\nCVE-2025-47978\nWindows Kerberos Denial of Service Vulnerability\nImportant\nWindows Kernel\nCVE-2025-49666\nWindows Server Setup and Boot Event Collection Remote Code Execution Vulnerability\nImportant\nWindows Kernel\nCVE-2025-26636\nWindows Kernel Information Disclosure Vulnerability\nImportant\nWindows Kernel\nCVE-2025-48809\nWindows Secure Kernel Mode Information Disclosure Vulnerability\nImportant\nWindows Kernel\nCVE-2025-48808\nWindows Kernel Information Disclosure Vulnerability\nImportant\nWindows MBT Transport driver\nCVE-2025-47996\nWindows MBT Transport Driver Elevation of Privilege Vulnerability\nImportant\nWindows Media\nCVE-2025-49682\nWindows Media Elevation of Privilege Vulnerability\nImportant\nWindows Media\nCVE-2025-49691\nWindows Miracast Wireless Display Remote Code Execution Vulnerability\nImportant\nWindows Netlogon\nCVE-2025-49716\nWindows Netlogon Denial of Service Vulnerability\nImportant\nWindows Notification\nCVE-2025-49726\nWindows Notification Elevation of Privilege Vulnerability\nImportant\nWindows Notification\nCVE-2025-49725\nWindows Notification Elevation of Privilege Vulnerability\nImportant\nWindows NTFS\nCVE-2025-49678\nNTFS Elevation of Privilege Vulnerability\nImportant\nWindows Performance Recorder\nCVE-2025-49680\nWindows Performance Recorder (WPR) Denial of Service Vulnerability\nImportant\nWindows Print Spooler Components\nCVE-2025-49722\nWindows Print Spooler Denial of Service Vulnerability\nImportant\nWindows Remote Desktop Licensing Service\nCVE-2025-48814\nRemote Desktop Licensing Service Security Feature Bypass Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-49688\nWindows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-49676\nWindows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-49672\nWindows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-49670\nWindows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-49671\nWindows Routing and Remote Access Service (RRAS) Information Disclosure Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-49753\nWindows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-49729\nWindows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-49673\nWindows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-49674\nWindows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-49669\nWindows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-49663\nWindows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-49668\nWindows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-49681\nWindows Routing and Remote Access Service (RRAS) Information Disclosure Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-49657\nWindows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-47998\nWindows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-48824\nWindows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability\nImportant\nWindows Secure Kernel Mode\nCVE-2025-48810\nWindows Secure Kernel Mode Information Disclosure Vulnerability\nImportant\nWindows Shell\nCVE-2025-49679\nWindows Shell Elevation of Privilege Vulnerability\nImportant\nWindows SmartScreen\nCVE-2025-49740\nWindows SmartScreen Security Feature Bypass Vulnerability\nImportant\nWindows SMB\nCVE-2025-48802\nWindows SMB Server Spoofing Vulnerability\nImportant\nWindows SPNEGO Extended Negotiation\nCVE-2025-47981\nSPNEGO Extended Negotiation (NEGOEX) Security Mechanism Remote Code Execution Vulnerability\nCritical\nWindows SSDP Service\nCVE-2025-47976\nWindows Simple Search and Discovery Protocol (SSDP) Service Elevation of Privilege Vulnerability\nImportant\nWindows SSDP Service\nCVE-2025-47975\nWindows Simple Search and Discovery Protocol (SSDP) Service Elevation of Privilege Vulnerability\nImportant\nWindows SSDP Service\nCVE-2025-48815\nWindows Simple Search and Discovery Protocol (SSDP) Service Elevation of Privilege Vulnerability\nImportant\nWindows StateRepository API\nCVE-2025-49723\nWindows StateRepository API Server file Tampering Vulnerability\nImportant\nWindows Storage\nCVE-2025-49760\nWindows Storage Spoofing Vulnerability\nModerate\nWindows Storage VSP Driver\nCVE-2025-47982\nWindows Storage VSP Driver Elevation of Privilege Vulnerability\nImportant\nWindows TCP/IP\nCVE-2025-49686\nWindows TCP/IP Driver Elevation of Privilege Vulnerability\nImportant\nWindows TDX.sys\nCVE-2025-49658\nWindows Transport Driver Interface (TDI) Translation Driver Information Disclosure Vulnerability\nImportant\nWindows TDX.sys\nCVE-2025-49659\nWindows Transport Driver Interface (TDI) Translation Driver Elevation of Privilege Vulnerability\nImportant\nWindows Universal Plug and Play (UPnP) Device Host\nCVE-2025-48821\nWindows Universal Plug and Play (UPnP) Device Host Elevation of Privilege Vulnerability\nImportant\nWindows Universal Plug and Play (UPnP) Device Host\nCVE-2025-48819\nWindows Universal Plug and Play (UPnP) Device Host Elevation of Privilege Vulnerability\nImportant\nWindows Update Service\nCVE-2025-48799\nWindows Update Service Elevation of Privilege Vulnerability\nImportant\nWindows User-Mode Driver Framework Host\nCVE-2025-49664\nWindows User-Mode Driver Framework Host Information Disclosure Vulnerability\nImportant\nWindows Virtualization-Based Security (VBS) Enclave\nCVE-2025-47159\nWindows Virtualization-Based Security (VBS) Elevation of Privilege Vulnerability\nImportant\nWindows Virtualization-Based Security (VBS) Enclave\nCVE-2025-48811\nWindows Virtualization-Based Security (VBS) Enclave Elevation of Privilege Vulnerability\nImportant\nWindows Virtualization-Based Security (VBS) Enclave\nCVE-2025-48803\nWindows Virtualization-Based Security (VBS) Elevation of Privilege Vulnerability\nImportant\nWindows Win32K - GRFX\nCVE-2025-49727\nWin32k Elevation of Privilege Vulnerability\nImportant\nWindows Win32K - ICOMP\nCVE-2025-49733\nWin32k Elevation of Privilege Vulnerability\nImportant\nWindows Win32K - ICOMP\nCVE-2025-49667\nWindows Win32 Kernel Subsystem Elevation of Privilege Vulnerability\nImportant\nWorkspace Broker\nCVE-2025-49665\nWorkspace Broker Elevation of Privilege Vulnerability\nImportant\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nMicrosoft June 2025 Patch Tuesday fixes exploited zero-day, 66 flaws\nMicrosoft May 2025 Patch Tuesday fixes 5 exploited zero-days, 72 flaws\nWindows 10 KB5062554 cumulative update released with 13 changes, fixes\nWindows 10 KB5060533 cumulative update released with 7 changes, fixes\nWindows 10 KB5058379 update fixes SgrmBroker errors in Event Viewer"
    },
    {
        "Title": "Android malware Anatsa infiltrates Google Play to target US banks",
        "Link": "https://www.bleepingcomputer.com/news/security/android-malware-anatsa-infiltrates-google-play-to-target-us-banks/",
        "Summary": "The Anatsa banking trojan has sneaked into Google Play once more via an app posing as a PDF viewer that counted more than 50,000 downloads. [...]",
        "Date": "2025-07-08",
        "Content": "The Anatsa banking trojan has sneaked into Google Play once more via an app posing as a PDF viewer that counted more than 50,000 downloads.\nThe malware becomes active on the device immediately after installing the app, tracking users launching North American banking apps and serving them an overlay that allows accessing the account, keylogging, or automating transactions.\nAccording to\nThreat Fabric researchers\nwho spotted the latest campaign and reported it to Google, Anatsa shows users a fake message when they open the targeted apps, informing of a scheduled banking system maintenance.\nThe notification is displayed on top of the banking app’s UI, obscuring the malware’s activity in the background and preventing victims from contacting their bank or checking their accounts for unauthorized transactions.\nThreat Fabric has been tracking Anatsa on Google Play for years, uncovering multiple infiltrations under fake or trojanized utility and productivity tools.\nA campaign uncovered in November 2021 achieved\n300,000 downloads\n, another exposed in June 2023 had\n30,000 downloads\n, and another one disclosed in February 2024 reached\n150,000 downloads\n.\nIn May 2024, mobile security firm Zscaler reported that Anatsa had achieved yet another infiltration on Android’s official app store, with two apps posing as a PDF reader and a QR reader, collectively amassing\n70,000 downloads\n.\nThe Anatsa app that Threat Fabric discovered on Google Play this time is ‘Document Viewer – File Reader,’ published by ‘Hybrid Cars Simulator, Drift & Racing.’\nApp on Google Play that delivered Anatsa to its users\nSource: ThreatFabric\nThe researchers report that this app follows a sneaky tactic Anatsa operators demonstrated in previous cases too, where they keep the app “clean” until it gains a substantial userbase.\nOnce the app becomes sufficiently popular, they introduce malicious code via an update that fetches an Anatsa payload from a remote server and installs it as a separate application.\nThen, Anatsa connects to the command-and-control (C2) and receives a list of targeted apps to monitor for on the infected device.\nThe latest Anatsa app delivered the trojan between June 24 and 30, six weeks after its initial release on the store.\nGoogle has since removed the malicious app from the store.\nIf you installed the app, it is recommended that you uninstall it immediately, run a full system scan using Play Protect, and reset your banking account credentials.\nAnatsa periodically finds ways to infiltrate Google Play, so users should only trust apps from reputable publishers, check user reviews, pay attention to the requested permissions, and keep the number of installed apps on your device at the necessary minimum.\nUpdate 7/8\n- A Google spokesperson sent BleepingComputer the following comment:\n“All of these identified malicious apps have been removed from Google Play. Users are automatically protected by Google Play Protect, which can warn users or block apps known to exhibit malicious behavior on Android devices with Google Play Services.\" - A Google spokesperson\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nMalware on Google Play, Apple App Store stole your photos—and crypto\nGodfather Android malware now uses virtualization to hijack banking apps\nAndroid malware Crocodilus adds fake contacts to spoof trusted callers\nNew Android TapTrap attack fools users with invisible UI trick\nFBI: BADBOX 2.0 Android malware infects millions of consumer devices"
    },
    {
        "Title": "Overcoming Technical Barriers in Desktop and Application Virtualization",
        "Link": "https://www.bleepingcomputer.com/news/security/overcoming-technical-barriers-in-desktop-and-application-virtualization/",
        "Summary": "Exposed RDP ports are an open door for attackers. TruGrid SecureRDP enforces Zero Trust and MFA, blocks lateral movement, and secures remote access—no open firewall ports required. Learn more and get a free trial. [...]",
        "Date": "2025-07-08",
        "Content": "As organizations increasingly embrace remote and hybrid work, desktop and application virtualization have become essential strategies for ensuring flexibility, scalability, and security.\nHowever, implementing these solutions presents several technical challenges that IT leaders must address to maintain seamless operations and robust security.\nThis article explores these challenges and highlights proven strategies for overcoming them.\nSecuring Virtual Environments in the Face of Evolving Threats\nVirtualized environments are prime targets for cyberattacks due to their centralized nature and the potential vulnerabilities inherent in remote access protocols.\nCommon Security Risks in Virtualization\nDesktop and application virtualization come with\ninherent security risks\n, including:\nRDP-Based Attacks:\nCybercriminals exploit RDP vulnerabilities, such as BlueKeep and DejaBlue, to gain unauthorized access.\nSession Hijacking & Lateral Movement:\nAttackers who gain access to a virtual desktop can move laterally across the network, compromising sensitive systems.\nExposed Firewall Ports:\nMany virtualization solutions require open firewall ports for gateway access, exposing corporate networks to brute-force attacks and ransomware.\nImplementing a\nZero Trust\narchitecture and\nMulti-Factor Authentication (MFA)\nis crucial to mitigate these risks, ensuring that\nonly authenticated users and trusted devices\ncan access the virtual environment.\nHow TruGrid SecureRDP Strengthens Security\nUnlike traditional virtualization setups that often require open inbound firewall ports,\nTruGrid SecureRDP minimizes attack surfaces\nby ensuring\nRDP connections\nare established without exposing firewall ports.\nAdditionally, it enforces\nmulti-factor authentication (MFA)\nat the authentication layer, reducing the risk of credential-based attacks.\nKey security features:\nZero Trust Access:\nEvery session requires\nauthentication and assumes every device is untrusted\n, reducing attack surfaces.\nBuilt-in MFA:\nEnforces\nmulti-factor authentication\nat every login, preventing credential-based attacks.\nNo Open Ports:\nUnlike traditional solutions,\nTruGrid SecureRDP does not expose RDP ports\n, mitigating brute-force and ransomware risks.\nGeo-Blocking:\nPrevents unauthorized access by\nrestricting login attempts from unapproved locations\n.\nWithin the\nTruGrid Dashboard\n, administrators can enable\nZero Trust RDP Security\n(enabled by default) with a single toggle, blocking all device redirection between the remote user and the corporate network.\nThis ensures that endpoints remain isolated, significantly reducing the risk of unauthorized data leakage.\nFigure 1: TruGrid Dashboard – Enable Zero Trust Policy\nWith integrated security features, TruGrid SecureRDP helps organizations\nreduce ransomware risks and prevent unauthorized access\nto virtualized environments.\nOrganizations can use\nRDP Inspector\nto scan their external RDP settings for vulnerabilities.\nOptimizing Network Performance for Virtual Desktops\nOne of the biggest technical challenges in desktop virtualization is network performance degradation caused by\nlatency, bandwidth constraints, and routing inefficiencies\n.\nWhy Performance Issues Occur\nLatency Sensitivity:\nVirtual desktops rely on constant data exchange, and high-latency connections result in sluggish user experiences.\nCongested Network Paths:\nTraditional virtualization often routes traffic over public internet over multiple routes, leading to bottlenecks and slow performance.\nHow TruGrid SecureRDP Optimizes Performance\nTraditional virtualization solutions often rely on\nVPN tunnels or inefficient routing paths\n, leading to congestion and performance degradation.\nTruGrid SecureRDP\nimproves remote desktop responsiveness by leveraging a\nglobal fiber optics mesh\nthat dynamically optimizes traffic flow, reducing latency and packet loss.\nGlobal Fiber Optics Mesh:\nTruGrid dynamically selects the most efficient path between users and virtual desktops.\nOptimized Protocols:\nTruGrid enhances TCP traffic performance, reducing packet loss and improving remote desktop responsiveness.\nBypassing Public Internet Congestion:\nUnlike VPN-based RDP, TruGrid ensures low-latency and optimized connection between users and workstations.\nMitigating Virtualization Risks with Secure, Scalable Solutions\nOrganizations face increasing challenges in securing, optimizing, and scaling virtual desktops. Traditional solutions often rely on VPNs or require open firewall ports, increasing security risks.\nAs organizations grow, managing multiple\nvirtual desktops\n, security policies, and access controls becomes complex. Traditional VDI solutions often require extensive manual configurations, leading to increased IT workload.\nTry a Business Plan for Free\nSimplifying Scalability and Infrastructure Management\nAs organizations grow, managing multiple\nvirtual desktops\n, security policies, and access controls becomes complex. Traditional\nVDI solutions often require extensive manual configurations\n, leading to increased IT workload.\nScalability Challenges\nKey challenges include:\nResource Allocation:\nEnsuring that virtual desktops have adequate resources without over-provisioning can be difficult.\nManagement Complexity:\nManaging numerous virtual desktops, each with its configurations and requirements, can overwhelm IT teams.\nA recent\nreport by GDH Consulting\nhighlights that resource distribution and complex management are among the top challenges in virtualization efforts.\nAccording to the survey by\nEnterprise Strategy Group (ESG)\n, organizations that adopted primary virtual desktop solutions have realized significant benefits, including improved efficiency and enhanced user satisfaction. This highlights the critical role of effective virtualization in addressing scalability challenges and optimizing resource management.\nFigure 2: Benefits Realized as a Result of Primary Virtual Desktop Platform\nHow TruGrid SecureRDP Simplifies Scalability\nDynamic Scaling:\nOrganizations can scale up or down without complex reconfigurations.\nCentralized Management:\nAdmins can control user access and security policies from a single dashboard.\nIntegration with Active Directory & Azure AD:\nSeamless integration simplifies user authentication and access management, reducing administrative overhead.\nThe TruGrid Analytics Dashboard provides organizations with insights into\nActive Directory logins, RDP connections, licensing allocations, and resource assignments\n. By leveraging this data, administrators can make informed decisions on infrastructure management and scalability.\nThe\nRDP Connection Analytics\nsection offers a breakdown of total RDP connections attempts, successful RDP connections, and failed RDP connections, helping teams track usage patterns and detect anomalies.\nThe\nLicensing dashboard\nprovides a\nclear view of allocated vs. consumed licenses\n, ensuring that organizations are not over-provisioning or underutilizing their licensing resources. For more information, refer to\nthis article\n.\nFigure 3: TruGrid Analytics Dashboard\nEnsuring Compliance and Simplifying Licensing\nMany industries, including healthcare, finance, and government, must adhere to strict compliance frameworks such as HIPAA, PCI-DSS, and SOC 2. However, managing compliance in virtualized environments can be challenging due to:\nTracking Access Logs:\nMonitoring and recording user activities to meet compliance requirements can be complex in virtual environments.\nInconsistent Security Policies:\nEnsuring uniform security measures across all virtual desktops is challenging, especially in dynamic setups.\nComplex Licensing Requirements:\nVirtualization can complicate software licensing, leading to potential compliance issues and unexpected costs.\nLicensing compliance is a significant concern in virtualization, requiring diligent management to avoid violations.\nHow TruGrid SecureRDP Helps Maintain Compliance\nTruGrid SecureRDP provides\nbuilt-in security and compliance features\nto simplify regulatory adherence and licensing management:\nBuilt-in Logging & Reporting:\nGenerates detailed activity logs, making it easier for IT teams to track user sessions and meet regulatory requirements like HIPAA, PCI-DSS, and SOC 2.\nRole-Based Access Controls (RBAC):\nAdministrators can define granular access permissions, ensuring that users only access the applications and data necessary for their role.\nNo Public Exposure:\nHelps organizations meet cyber insurance requirements by eliminating firewall vulnerabilities.\nBy automating compliance enforcement, TruGrid SecureRDP simplifies regulatory requirements while improving security posture.\nSecure Your Virtual Desktop Infrastructure Today\nEliminate firewall exposure, optimize remote performance, and simplify compliance with TruGrid SecureRDP.\nRequest a Demo and see it in action.\nRequest a Demo\nImproving User Experience and Adoption of Virtual Desktops\nWhile security and performance are critical,\nuser experience plays a key role\nin the success of virtualization deployments. If users encounter\nslow login times\n,\nlaggy sessions\n, or\nfrequent disconnects\n,\nadoption rates drop\n, and productivity suffers.\nChallenges in User Experience for Virtual Desktops\nThe most common user experience pitfalls in virtual desktop environments include:\nSlow Authentication Processes:\nTraditional VDI setups often rely on complex login procedures, requiring users to connect via VPNs or navigate multiple authentication steps.\nSession Interruptions & Disruptions:\nPoor network performance leads to session timeouts, forcing users to reconnect and lose progress.\nLack of Personalization:\nUsers expect their workspace settings, applications, and files to remain persistent across sessions. Many traditional solutions lack seamless session continuity.\nHow TruGrid SecureRDP Enhances User Experience\nTruGrid SecureRDP ensures a\nfrictionless remote desktop experience\nthrough:\nSingle Sign-On (SSO) & Seamless Authentication:\nUsers can access their virtual desktops without navigating VPNs or complicated login steps.\nSession Persistence Across Devices:\nTruGrid SecureRDP allows users to switch between endpoints (e.g., laptop to tablet) without losing their session progress.\nPerformance-Optimized RDP Connections:\nTruGrid ensures lag-free remote desktop experiences.\nThese improvements increase user adoption and productivity, ensuring that virtual desktops remain a preferred solution for remote and hybrid workforces.\nThe survey data from Enterprise Strategy Group (ESG) indicates that a growing number of organizations expect to see a\nsubstantial increase in their usage of desktop and application virtualization technologies\nover the next 24-36 months.\nThis trend underscores the urgency for optimizing network performance and reducing latency to support the expanding virtual workforce.\nFigure 4: Desktop and Application Virtualization Usage Is Expected to Grow\nAddressing Common Misconceptions About Virtual Desktops\nDespite its advantages, there are several misconceptions about desktop virtualization:\nMisconception: Virtual desktops are less secure than traditional desktops\nReality:\nVirtual desktops are more secure when configured correctly. Solutions like TruGrid SecureRDP enforce\nZero Trust security\n,\nMFA\n, and\nrole-based access to eliminate traditional endpoint risks.\nMisconception: Virtualization is only for large enterprises\nReality:\nVirtual desktops can scale to businesses of any size. SMBs benefit from\nsimplified management, reduced hardware costs, and secure remote access\n.\nSecure and Streamline Virtualization with TruGrid SecureRDP\nThe growing reliance on remote and hybrid work makes desktop and application virtualization an essential strategy for businesses. However, organizations must overcome\nkey technical barriers\n, including:\nSecurity risks\nfrom exposed firewall (gateway) attacks and lateral movement threats\nNetwork performance issues\n, such as latency and congestion bottlenecks\nScalability challenges\nin managing large virtual desktop environments\nCompliance complexities\nin auditing and licensing management\nTruGrid SecureRDP\nprovides a\nsecure\n,\nscalable\n, and\nhigh-performance solution\n, eliminating these challenges through Zero Trust security, optimized network routing, and centralized management tools.\nRequest a\nFree Trial of TruGrid SecureRDP\nand experience the future of secure virtualization!\nSponsored and written by\nTruGrid\n."
    },
    {
        "Title": "Malicious Chrome extensions with 1.7M installs found on Web Store",
        "Link": "https://www.bleepingcomputer.com/news/security/malicious-chrome-extensions-with-17m-installs-found-on-web-store/",
        "Summary": "Almost a dozen malicious extensions with 1.7 million downloads in Google's Chrome Web Store could track users, steal browser activity, and redirect to potentially unsafe web addresses. [...]",
        "Date": "2025-07-08",
        "Content": "Almost a dozen malicious extensions with 1.7 million downloads in Google's Chrome Web Store could track users, steal browser activity, and redirect to potentially unsafe web addresses.\nMost of the add-ons provide the advertised functionality and pose as legitimate tools like color pickers, VPNs, volume boosters, and emoji keyboards.\nResearchers at\nKoi Security\n, a company providing a platform for security self-provisioned software, discovered the malicious extensions in Chrome Web Store and reported them to Google.\nSome of the extensions are no longer present but many of them continue to be available.\nTwo of the Chrome extensions featuring tracking code\nSource: BleepingComputer\nMany of those extensions are verified, have hundreds of positive reviews, and are featured prominently on the Chrome Web Store, misleading users about their safety.\nUsers should check for the following add-ons in Chrome browser and remove them as soon as possible:\nColor Picker, Eyedropper — Geco colorpick\nEmoji keyboard online — copy&paste your emoji\nFree Weather Forecast\nVideo Speed Controller — Video manager\nUnlock Discord — VPN Proxy to Unblock Discord Anywhere\nDark Theme — Dark Reader for Chrome\nVolume Max — Ultimate Sound Booster\nUnblock TikTok — Seamless Access with One-Click Proxy\nUnlock YouTube VPN\nUnlock TikTok\nWeather\nOne of them, ‘Volume Max — Ultimate Sound Booster,’ has also been\nflagged by LayerX\nresearchers last month, who warned about its potential for spying on users; but no malicious activity could be confirmed at the time.\nRisky Chrome extension flagged by two security teams\nSource: BleepingComputer\nAccording to the researchers, the malicious functionality is implemented in the background service worker of each extension using the Chrome Extensions API, registering a listener that is triggered every time a user navigates to a new webpage.\nThe listener captures the URL of the visited page and exfiltrates the information to a remote server along with a unique tracking ID for each user.\nThe server can respond with redirection URLs, hijacking the user’s browsing activity and potentially taking them to unsafe destinations that may enable cyberattacks.\nAlthough the possibility is there, it should be noted that Koi Security has not observed malicious redirections in their testing.\nFurthermore, the malicious code was not present in the initial versions of the extensions, but was introduced at a later time via updates.\nGoogle’s auto-update system silently deploys the newest versions to users without requiring any user approval or interaction.\nGiven that some of these extensions were safe for years, it is possible that they were hijacked/compromised by external actors who introduced the malicious code.\nBleepingComputer contacted several publishers to inquire about this possibility, but we have not yet heard back from any of them.\nBefore publishing this article, Koi Security researchers discovered that cybercriminals have also planted malicious extensions in the official store for Microsoft Edge, which shows a total count of 600,000 downloads.\n\"Combined, these eighteen extensions have infected over 2.3 million users across both browsers, creating one of the largest browser hijacking operations we’ve documented,\" the researchers say.\nThey recommend users remove all listed extensions immediately, clear the browsing data to purge any tracking identifiers, check the system for malware, and monitor accounts for suspicious activity.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nMicrosoft confirms Family Safety blocks Google Chrome from launching\nGoogle patches new Chrome zero-day bug exploited in attacks\nGoogle Chrome to distrust Chunghwa Telecom, Netlock certificates in August\nData-stealing Chrome extensions impersonate Fortinet, YouTube, VPNs\nGoogle fixes fourth actively exploited Chrome zero-day of 2025"
    },
    {
        "Title": "Alleged Chinese hacker tied to Silk Typhoon arrested for cyberespionage",
        "Link": "https://www.bleepingcomputer.com/news/security/alleged-chinese-hacker-tied-to-silk-typhoon-arrested-for-cyberespionage/",
        "Summary": "A Chinese national was arrested in Milan, Italy, last week for allegedly being linked to the state-sponsored Silk Typhoon hacking group, which responsible for cyberattacks against American organizations and government agencies. [...]",
        "Date": "2025-07-08",
        "Content": "A Chinese national was arrested in Milan, Italy, last week for allegedly being linked to the state-sponsored Silk Typhoon hacking group, which responsible for cyberattacks against American organizations and government agencies.\nAccording to Italian media\nANSA\n, the 33-year-old man, Xu Zewei, was arrested at Milan's Malpensa Airport on July 3rd after arriving on a flight from China. Italian police arrested the suspect on an international warrant from the U.S. government.\nANSA reports that Xu is accused of being linked to the Chinese state-sponsored Silk Typhoon hacking group, aka Hafnium, which has been responsible for a wide range of cyberespionage attacks against the U.S. and other countries.\nIn particular, Italian media reports that Xu is linked to the 2020 Silk Typhoon cyberattacks on infectious disease researchers and healthcare organizations, which aimed to steal data on anti-COVID vaccines.\n\"These actors have been observed attempting to identify and illicitly obtain valuable intellectual property (IP) and public health data related to vaccines, treatments, and testing from networks and personnel affiliated with COVID-19-related research,\" read the\njoint advisory\n.\nThe hacking group has also been linked to more recent cyberespionage campaigns, including those on the\nU.S. Treasury's Office of Foreign Assets Control (OFAC)\nand the\nCommittee on Foreign Investment\n.\nIn March,\nMicrosoft reported\nthat Silk Typhoon had begun targeting remote management tools and cloud services in supply chain attacks to gain access to downstream customers' networks.\nXu is currently being held in Busto Arsizio prison with the U.S. seeking extradition to face trial in the States.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nUS sanctions firm linked to cyber scams behind $200 million in losses"
    },
    {
        "Title": "Microsoft Patches 137 CVEs in July, but No Zero-Days",
        "Link": "https://www.darkreading.com/application-security/microsoft-patches-137-cves-no-zero-days",
        "Summary": "Some 17 of the bugs are at high risk for exploits, including multiple remote code execution bugs in Office and SharePoint.",
        "Date": "2025-07-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/microsoft-patches-137-cves-no-zero-days"
    },
    {
        "Title": "Malicious Open Source Packages Spike 188% YoY",
        "Link": "https://www.darkreading.com/application-security/malicious-open-source-packages-spike",
        "Summary": "Data exfiltration was the most common malware in Sonatype report, with more than 4,400 packages designed to steal secrets, personally identifiable information, credentials, and API tokens.",
        "Date": "2025-07-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/malicious-open-source-packages-spike"
    },
    {
        "Title": "Suspected Hacker Linked to Silk Typhoon Arrested in Milan",
        "Link": "https://www.darkreading.com/threat-intelligence/suspected-hacker-silk-typhoon-arrested",
        "Summary": "The alleged Chinese state-sponsored hacker faces multiple charges, including wire fraud, aggravated identity theft, and unauthorized access to protected computers.",
        "Date": "2025-07-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/suspected-hacker-silk-typhoon-arrested"
    },
    {
        "Title": "Hackers 'Shellter' Various Stealers in Red-Team Tool to Evade Detection",
        "Link": "https://www.darkreading.com/threat-intelligence/hackers-shellter-red-team-tool-evade-detection",
        "Summary": "Researchers have uncovered multiple campaigns spreading Lumma, Arechclient2, and Rhadamanthys malware by leveraging key features of the AV/EDR evasion framework.",
        "Date": "2025-07-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/hackers-shellter-red-team-tool-evade-detection"
    },
    {
        "Title": "4 Critical Steps in Advance of 47-Day SSL/TLS Certificates",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/critical-steps-advance-ssl-tls-certificates",
        "Summary": "With certificate lifespans set to shrink by 2029, IT teams need to spend the next 100 days planning in order to avoid operational disruptions.",
        "Date": "2025-07-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/critical-steps-advance-ssl-tls-certificates"
    },
    {
        "Title": "TAG-140 Targets Indian Government Via 'ClickFix-Style' Lure",
        "Link": "https://www.darkreading.com/threat-intelligence/tag-140-indian-government-clickfix-lure",
        "Summary": "The threat actors trick victims into opening a malicious script, leading to the execution of the BroaderAspect .NET loader.",
        "Date": "2025-07-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/tag-140-indian-government-clickfix-lure"
    },
    {
        "Title": "Adobe Patches Critical Code Execution Bugs",
        "Link": "https://www.securityweek.com/adobe-patches-critical-code-execution-bugs/",
        "Summary": "<p>Adobe patches were also released for medium-severity flaws in After Effects, Audition, Dimension, Experience Manager Screens, FrameMaker, Illustrator, Substance 3D Stager, and Substance 3D Viewer.</p>\n<p>The post <a href=\"https://www.securityweek.com/adobe-patches-critical-code-execution-bugs/\">Adobe Patches Critical Code Execution Bugs</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/adobe-patches-critical-code-execution-bugs/"
    },
    {
        "Title": "Microsoft Patches 130 Vulnerabilities for July 2025 Patch Tuesday",
        "Link": "https://www.securityweek.com/microsoft-patches-130-vulnerabilities-for-july-2025-patch-tuesday/",
        "Summary": "<p>Patch Tuesday July 2025: Microsoft rolled out fixes for 130 vulnerabilities, including a zero-day in SQL Server.</p>\n<p>The post <a href=\"https://www.securityweek.com/microsoft-patches-130-vulnerabilities-for-july-2025-patch-tuesday/\">Microsoft Patches 130 Vulnerabilities for July 2025 Patch Tuesday</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/microsoft-patches-130-vulnerabilities-for-july-2025-patch-tuesday/"
    },
    {
        "Title": "Impostor Uses AI to Impersonate Rubio and Contact Foreign and US Officials",
        "Link": "https://www.securityweek.com/impostor-uses-ai-to-impersonate-rubio-and-contact-foreign-and-us-officials/",
        "Summary": "<p>The warning came after the department discovered that an impostor attempted to reach out to at least three foreign ministers, a U.S. senator and a governor.</p>\n<p>The post <a href=\"https://www.securityweek.com/impostor-uses-ai-to-impersonate-rubio-and-contact-foreign-and-us-officials/\">Impostor Uses AI to Impersonate Rubio and Contact Foreign and US Officials</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/impostor-uses-ai-to-impersonate-rubio-and-contact-foreign-and-us-officials/"
    },
    {
        "Title": "Legitimate Shellter Pen-Testing Tool Used in Malware Attacks",
        "Link": "https://www.securityweek.com/legit-shellter-pen-testing-tool-used-in-malware-attacks/",
        "Summary": "<p>A stolen copy of Shellter Elite shows how easily legitimate security tools can be repurposed by threat actors when vetting and oversight fail.</p>\n<p>The post <a href=\"https://www.securityweek.com/legit-shellter-pen-testing-tool-used-in-malware-attacks/\">Legitimate Shellter Pen-Testing Tool Used in Malware Attacks</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/legit-shellter-pen-testing-tool-used-in-malware-attacks/"
    },
    {
        "Title": "The Wild West of Agentic AI – An Attack Surface CISOs Can’t Afford to Ignore",
        "Link": "https://www.securityweek.com/the-wild-wild-west-of-agentic-ai-an-attack-surface-cisos-cant-afford-to-ignore/",
        "Summary": "<p>As organizations rush to adopt agentic AI, security leaders must confront the growing risk of invisible threats and new attack vectors.</p>\n<p>The post <a href=\"https://www.securityweek.com/the-wild-wild-west-of-agentic-ai-an-attack-surface-cisos-cant-afford-to-ignore/\">The Wild West of Agentic AI &#8211; An Attack Surface CISOs Can’t Afford to Ignore</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/the-wild-wild-west-of-agentic-ai-an-attack-surface-cisos-cant-afford-to-ignore/"
    },
    {
        "Title": "SAP Patches Critical Flaws That Could Allow Remote Code Execution, Full System Takeover",
        "Link": "https://www.securityweek.com/sap-patches-critical-flaws-that-could-allow-remote-code-execution-full-system-takeover/",
        "Summary": "<p>SAP has released patches for multiple insecure deserialization vulnerabilities in NetWeaver that could lead to full system compromise.</p>\n<p>The post <a href=\"https://www.securityweek.com/sap-patches-critical-flaws-that-could-allow-remote-code-execution-full-system-takeover/\">SAP Patches Critical Flaws That Could Allow Remote Code Execution, Full System Takeover</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/sap-patches-critical-flaws-that-could-allow-remote-code-execution-full-system-takeover/"
    },
    {
        "Title": "Exploits, Technical Details Released for CitrixBleed2 Vulnerability",
        "Link": "https://www.securityweek.com/exploits-technical-details-released-for-citrixbleed2-vulnerability/",
        "Summary": "<p>Researchers released technical information and exploit code targeting a critical vulnerability (CVE-2025-5777) in Citrix NetScaler.</p>\n<p>The post <a href=\"https://www.securityweek.com/exploits-technical-details-released-for-citrixbleed2-vulnerability/\">Exploits, Technical Details Released for CitrixBleed2 Vulnerability</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/exploits-technical-details-released-for-citrixbleed2-vulnerability/"
    },
    {
        "Title": "Qantas Hit with Extortion Demand After Data Breach",
        "Link": "https://www.securityweek.com/qantas-hit-with-extortion-demand-after-data-breach/",
        "Summary": "<p>The Australian airline says a cybercriminal attempted to extort it after customer data was stolen from a contact center.</p>\n<p>The post <a href=\"https://www.securityweek.com/qantas-hit-with-extortion-demand-after-data-breach/\">Qantas Hit with Extortion Demand After Data Breach</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/qantas-hit-with-extortion-demand-after-data-breach/"
    }
]