[
    {
        "Title": "ChatGPT is testing disruptive Study Together feature",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-is-testing-disruptive-study-together-feature/",
        "Summary": "OpenAI's \"Study together\" mode has been spotted in the wild, and it could help students prepare for exams directly from ChatGPT. [...]",
        "Date": "2025-07-06",
        "Content": "OpenAI's \"Study together\" mode has been spotted in the wild, and it could help students prepare for exams directly from ChatGPT.\nWe don't have the details yet, but references to ChatGPT Study Mode were first\nspotted\nin May, and testers\nnoticed\nit widely earlier today.\nThe Study together mode, which doesn't work right now, might allow students to either invite their friends to study on ChatGPT or have the AI act as a companion.\nWe just don't know how it works yet, but it could disrupt the education niche.\nStudy together isn't the only new feature coming to ChatGPT.\nChatGPT is also testing new connectors for GPT Search and Deep Research.\nOne of the upcoming connectors is Slack, which will allow ChatGPT Deep Research to crawl your Slack messages and use them as context in the research.\nOpenAI has been quiet lately about its plans for ChatGPT, but we know that GPT-5 is coming, and it could be a big moment for the AI startup, as it struggles with its Microsoft deal and Meta's poaching.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nLeaks hint at Operator-like tool in ChatGPT ahead of GPT-5 launch\nOpenAI confirms threat actors use ChatGPT to write malware\nChatGPT's AI coder Codex now lets you choose the best solution\nChatGPT prepares o3-pro model for $200 Pro subscribers\nOpenAI is hopeful GPT-5 will compete a little more"
    }
]