[
    {
        "Title": "Allianz Life confirms data breach impacts majority of 1.4 million customers",
        "Link": "https://www.bleepingcomputer.com/news/security/allianz-life-confirms-data-breach-impacts-majority-of-14-million-customers/",
        "Summary": "Insurance company Allianz Life has confirmed that the personal information for the \"majority\" of its 1.4 million customers was exposed in a data breach that occurred earlier this month. [...]",
        "Date": "2025-07-26",
        "Content": "Insurance company Allianz Life has confirmed that the personal information for the \"majority\" of its 1.4 million customers was exposed in a data breach that occurred earlier this month.\n\"On July 16, 2025, a malicious threat actor gained access to a third-party, cloud-based CRM system used by Allianz Life Insurance Company of North America (Allianz Life),\" an Allianz Life spokesperson told BleepingComputer.\n\"The threat actor was able to obtain personally identifiable data related to the majority of Allianz Life's customers, financial professionals, and select Allianz Life employees, using a social engineering technique.\"\n\"We took immediate action to contain and mitigate the issue and notified the FBI. Based on our investigation to-date, there is no evidence the Allianz Life network or other company systems were accessed, including our policy administration system.\"\n\"Our investigation is ongoing and we began the process of reaching out to individuals impacted with dedicated resources to assist them. This incident is related only to Allianz Life, which currently has 1.4 million customers.\"\nAllianz Life is a US-based provider of annuities and life insurance for over 1.4 million Americans. The company is owned by Allianz SE, a global financial services group headquartered in Germany, serving more than 128 million customers.\nThe company first revealed the breach in a mandatory filing with\nMaine's Attorney General's Office\non Saturday, issuing a placeholder notification alerting of the breach.\n\"The consumer notice will be provided once Allianz has identified the affected individuals,\" reads the placeholder notification.\nWhile Allianz Life declined to answer questions about the threat actor and whether they were being extorted, BleepingComputer has learned that the attack is believed to have been conducted by the ShinyHunters extortion group.\nShinyHunters is a group of threat actors who are linked to multiple high-profile data breaches and attacks, including those against\nPowerSchool\nand the\nSnowFlake attacks\n, which impacted\nSantander\n,\nTicketmaster\n,\nAT&T\n,\nAdvance Auto Parts\n,\nNeiman Marcus\n, and\nCylance\n.\nWhile multiple ShinyHunters members have\nbeen arrested\nover the\npast few years\n, including a\nrecent arrest in France\n, the hacking group continues to conduct attacks.\nLast month, Mandiant warned that ShinyHunters had begun to\ntarget Salesforce CRM customers\nin social engineering attacks.\nDuring these attacks, the hackers impersonate IT support personnel, requesting the targeted employee accept a connection to Salesforce Data Loader, a client application that allows users to import, export, update, or delete data within Salesforce environments.\nOnce the connection is accepted, the threat actors use Salesforce Data Loader to exfiltrate data from Salesforce, which is then used to extort the company.\nBleepingComputer asked Allianz Life if the CRM is Salesforce, but the spokesperson declined to comment.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nKelly Benefits says 2024 data breach impacts 550,000 customers\nHealthcare SaaS firm says data breach impacts 5.4 million patients\nStolen Ticketmaster data from Snowflake attacks briefly for sale again\nMajor European healthcare network discloses security breach\nDior begins sending data breach notifications to U.S. customers"
    },
    {
        "Title": "Post SMTP plugin flaw exposes 200K WordPress sites to hijacking attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/post-smtp-plugin-flaw-exposes-200k-wordpress-sites-to-hijacking-attacks/",
        "Summary": "More than 200,000 WordPress websites are using a vulnerable version of the Post SMTP plugin that allows hackers to take control of the administrator account. [...]",
        "Date": "2025-07-26",
        "Content": "More than 200,000 WordPress websites are using a vulnerable version of the Post SMTP plugin that allows hackers to take control of the administrator account.\nPost SMTP is a popular email delivery plugin for WordPress that counts more than 400,000 active installations. It’s marketed as a replacement of the default ‘\nwp_mail()\n’ function that is more reliable and feature-rich.\nOn May 23, a security researcher reported the vulnerability to WordPress security firm PatchStack. The flaw is now identified as CVE-2025-24000 and received a medium severity score of 8.8.\nThe security issue affects all versions of Post SMTP up to 3.2.0 and is due to a broken access control mechanism in the plugin’s REST API endpoints, which only verified if a user was logged in, without checking their permission level.\nThis means that low-privileged users, such as Subscribers, could access email logs containing full email content.\nOn vulnerable sites, a subscriber could initiate a password reset for an Administrator account, intercept the reset email via the logs, and gain control of the account.\nThe vulnerable code\nSource: PatchStack\nThe plugin’s developer, Saad Iqbal, was informed about the flaw and responded with a fix for Patchstack to review on May 26.\nThe solution was to incorporate additional privilege checks in the ‘get_logs_permission’ function that would validate a user’s permissions before giving access to sensitive API calls.\nThe fix was incorporated into Post SMTP version 3.3.0, which was published on June 11.\nDownload statistics on\nWordPress.org\nshow that less than half of the plugin's user base (48.5%) has updated to version 3.3. This means that more than 200,000 websites are vulnerable to CVE-2025-24000.\nA notable 24.2%, corresponding to 96,800 sites, still run Post SMTP versions from the 2.x branch, which is vulnerable to additional security flaws, leaving them open to attacks.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nWordPress Motors theme flaw mass-exploited to hijack admin accounts\nWordPress Gravity Forms developer hacked to push backdoored plugins\nHackers exploit OttoKit WordPress plugin flaw to add admin accounts\nForminator plugin flaw exposes WordPress sites to takeover attacks\nOver 46,000 Grafana instances exposed to account takeover bug"
    }
]