[
    {
        "Title": "Taiwan NSB Alerts Public on Data Risks from TikTok, Weibo, and RedNote Over China Ties",
        "Link": "https://thehackernews.com/2025/07/taiwan-nsb-alerts-public-on-data-risks.html",
        "Summary": "Taiwan's National Security Bureau (NSB) has warned that China-developed applications like RedNote (aka Xiaohongshu), Weibo, TikTok, WeChat, and Baidu Cloud pose security risks due to excessive data collection and data transfer to China.\nThe alert comes following an inspection of these apps carried out in coordination with the Ministry of Justice Investigation Bureau (MJIB) and the Criminal",
        "Date": "2025-07-05",
        "Content": "Taiwan's National Security Bureau (NSB) has warned that China-developed applications like RedNote (aka Xiaohongshu), Weibo, TikTok, WeChat, and Baidu Cloud pose security risks due to excessive data collection and data transfer to China.\nThe alert comes following an inspection of these apps carried out in coordination with the Ministry of Justice Investigation Bureau (MJIB) and the Criminal Investigation Bureau (CIB) under the National Police Agency.\n\"The results indicate the existence of security issues, including excessive data collection and privacy infringement,\" the NSB\nsaid\n. \"The public is advised to exercise caution when choosing mobile apps.\"\nThe agency said it evaluated the apps against 15 indicators spanning five broad categories: Personal data collection, excessive permission usage, data transmission and sharing, system information extraction, and biometric data access.\nAccording to the analysis, RedNote violated all 15 indicators, followed by Weibo and TikTok that were found to breach 13 indicators. WeChat and Baidu Cloud violated 10 and 9 of the 15 indicators, respectively.\nThese issues encompassed extensive collection of personal data, including facial recognition information, screenshots, clipboard contents, contact lists, and location information. All the apps have also been flagged for harvesting the list of installed apps and device parameters.\n\"With regard to data transmission and sharing, the said five apps were found to send packets back to servers located in China,\" the NSB said. \"This type of transmission has raised serious concerns over the potential misuse of personal data by third-parties.\"\nNSB also pointed out that companies operating in China are obligated to turn over user data under domestic laws for national security, public security, and intelligence purposes, and that using these apps can breach the privacy of Taiwanese users.\nThe development comes as countries like India have enacted bans against Chinese-made apps, citing security concerns. In November 2024, Canada\nordered\nTikTok to dissolve its operations in the country, although its fate in the U.S. still remains in limbo, as the ban – which was\nsupposed to take effect\nin January 2025 – has been\nextended for a third time\n.\nLast week, one of Germany's data protection authorities\nurged\nApple and Google to remove Chinese artificial intelligence (AI) chatbot DeepSeek from their respective app stores due to unlawful user data transfers to China. Similar restrictions have also been imposed by other nations.\n\"The NSB strongly advises the public to remain vigilant regarding mobile device security and avoid downloading China-made apps that pose cybersecurity risks, so as to protect personal data privacy and corporate business secrets,\" it added.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Alert: Exposed JDWP Interfaces Lead to Crypto Mining, Hpingbot Targets SSH for DDoS",
        "Link": "https://thehackernews.com/2025/07/alert-exposed-jdwp-interfaces-lead-to.html",
        "Summary": "Threat actors are weaponizing exposed Java Debug Wire Protocol (JDWP) interfaces to obtain code execution capabilities and deploy cryptocurrency miners on compromised hosts.\n\"The attacker used a modified version of XMRig with a hard-\"coded configuration, allowing them to avoid suspicious command-line arguments that are often flagged by defenders,\" Wiz researchers Yaara Shriki and Gili",
        "Date": "2025-07-05",
        "Content": "Threat actors are weaponizing exposed Java Debug Wire Protocol (\nJDWP\n) interfaces to obtain code execution capabilities and deploy cryptocurrency miners on compromised hosts.\n\"The attacker used a modified version of XMRig with a hard-\"coded configuration, allowing them to avoid suspicious command-line arguments that are often flagged by defenders,\" Wiz researchers Yaara Shriki and Gili Tikochinski\nsaid\nin a report published this week. \"The payload used mining pool proxies to hide their cryptocurrency wallet address, thereby preventing investigators from pivoting on it.\"\nThe cloud security firm, which is being acquired by Google Cloud, said it observed the activity against its honeypot servers running TeamCity, a popular continuous integration and continuous delivery (CI/CD) tool.\nJDWP is a communication protocol used in Java for debugging purposes. With JDWP, users can leverage a debugger to work in a different process, a Java application, on the same computer, or on a remote computer.\nBut given that JDWP lacks authentication or access control mechanisms, exposing the service to the internet can open up a new attack vector that attackers can abuse as an entry point, enabling full control over the running Java process.\nSimply put, the misconfiguration can be utilized to inject and execute arbitrary commands in order to set up persistence on and ultimately run malicious payloads.\n\"While JDWP is not enabled by default in most Java applications, it is commonly used in development and debugging environments,\" Wiz said. \"Many popular applications automatically start a JDWP server when run in debug mode, often without making the risks obvious to the developer. If improperly secured or left exposed, this can open the door to remote code execution (RCE) vulnerabilities.\"\nSome of the applications that may launch a JDWP server when in debug mode include TeamCity, Jenkins, Selenium Grid, Elasticsearch, Quarkus, Spring Boot, and Apache Tomcat.\nData from\nGreyNoise\nshows\nmore than 2,600 IP addresses\nscanning for JDWP endpoints within the last 24 hours, out of which over 1,500 IP addresses are malicious and 1,100 IP addresses are classified as suspicious. The vast majority of these IP addresses originate from China, the United States, Germany, Singapore, and Hong Kong.\nIn the attacks observed by Wiz, threat actors take advantage of the fact that the Java Virtual Machine (JVM) listens for debugger connections on port 5005 to initiate scanning for open JDWP ports across the internet. In the next phase, a JDWP-Handshake request is sent to confirm if the interface is active and establish a JDWP session.\nOnce it's confirmed that the service is exposed and interactive, the attackers move to execute a curl command to fetch and execute a dropper shell script that performs a series of actions -\nKill competing miners or any high‐CPU processes\nDrop a modified version of XMRig miner for the appropriate system architecture from an external server (\"awarmcorner[.]world\") into \"~/.config/logrotate\"\nEstablish persistence by setting cron jobs to ensure that payload is re-fetched and re-executed after every shell login, reboot, or a scheduled time interval\nDelete itself on exit\n\"Being open-source, XMRig offers attackers the convenience of easy customization, which in this case involved stripping out all command-line parsing logic and hardcoding the configuration,\" Wiz said. \"This tweak not only simplifies deployment but also allows the payload to mimic the original logrotate process more convincingly.\"\nNew Hpingbot Botnet Emerges\nThe disclosure comes as NSFOCUS\ndetailed\na new, rapidly-evolving Go-based malware named Hpingbot that's capable of targeting both Windows and Linux systems to enlist them into a botnet that can launch distributed denial-of-service (DDoS) attacks using\nhping3\n, a\nfreely-available utility\nfor crafting and sending custom ICMP/TCP/UDP packets.\nA notable aspect of the malware is that unlike other trojans that are typically derived from known botnet malware families like Mirai and Gafgyt, Hpingbot is an entirely new strain. At least since June 17, 2025, a few hundred DDoS instructions have been issued, with Germany, the United States, and Turkey being the main targets.\n\"This is a new botnet family built from scratch, showing strong innovation capabilities and efficiency in using existing resources, such as distributing loads through the online text storage and sharing platform Pastebin and launching DDoS attacks using the network testing tool hping3, which not only improves stealth but also significantly reduces development and operating costs,\" the Chinese cybersecurity company said.\nHpingbot primarily takes advantage of weak SSH configurations, propagated by means of an independent module that carries out password spraying attacks to obtain initial access to systems.\nThe presence of German debugging comments in the source code likely indicates that the latest version may be under testing. The attack chain, in a nutshell, involves using Pastebin as a\ndead drop resolver\nto point to an IP address (\"128.0.118[.]18\") that, in turn, is employed to download a shell script.\nThe script is then used to detect the CPU architecture of the infected host, terminate an already running version of the trojan, and retrieve the main payload that's responsible for initiating DDoS flood attacks over TCP and UDP. Hpingbot is also designed to establish persistence and cover up traces of infection by clearing the command history.\nIn an interesting twist, attackers have been observed using nodes controlled by Hpingbot to deliver another Go-based DDoS component as of June 19 that, while relying on the same command-and-control (C2) sever, eschews Pastebin and hping3 calls for built-in flood attack functions based on UDP and TCP protocols.\nAnother aspect worth mentioning is that although the Windows version cannot use hping3 to launch DDoS attacks due to the fact that the tool is installed using the Linux command \"\napt -y install\n,\" the ability of the malware to drop and execute additional payloads hints at the possibility that the threat actors intend to go beyond service disruption to turn it into a payload distribution network.\n\"It is worth noting that the Windows version of Hpingbot cannot directly call hping3 to launch DDoS attacks, but its activity is just as frequent, indicating that attackers are not only focusing on launching DDoS, but are more likely to focus on its function of downloading and executing arbitrary payloads.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Ingram Micro outage caused by SafePay ransomware attack",
        "Link": "https://www.bleepingcomputer.com/news/security/ingram-micro-outage-caused-by-safepay-ransomware-attack/",
        "Summary": "An ongoing outage at IT giant Ingram Micro is caused by a SafePay ransomware attack that led to the shutdown of internal systems, BleepingComputer has learned. [...]",
        "Date": "2025-07-05",
        "Content": "An ongoing outage at IT giant Ingram Micro is caused by a SafePay ransomware attack that led to the shutdown of internal systems, BleepingComputer has learned.\nIngram Micro is one of the world's largest business-to-business technology distributors and service providers, offering a range of solutions including hardware, software, cloud services, logistics, and training to resellers and managed service providers worldwide.\nSince Thursday, Ingram Micro's website and online ordering systems\nhave been down\n, with the company not disclosing the cause of the issues.\nBleepingComputer has now learned that the outages are caused by a cyberattack that occurred early Thursday morning, with employees suddenly finding ransom notes created on their devices.\nThe ransom note, seen by BleepingComputer, is associated with the SafePay ransomware operation, which has become one of the more active operations in 2025. It is unclear if devices were actually encrypted in the attack.\nIt should be noted that while the ransom note claims to have stolen a wide variety of information, this is generic language used in all SafePay ransom notes and may not be true for the Ingram Micro attack.\nSafePay ransom note found on Ingram Micro devices\nSource: BleepingComputer\nDo you have information about this or another cyberattack? If you want to share the information, you can contact us securely and confidentially on Signal at LawrenceA.11, via email at lawrence.abrams@bleepingcomputer.com, or by using our\ntips form\n.\nSources have told BleepingComputer that it is believed the threat actors breached Ingram Micro through its GlobalProtect VPN platform.\nOnce the attack was discovered, employees in some locations were told to work from home. The company also shut down internal systems, telling employees not to use the company's GlobalProtect VPN access, which was said to be impacted by the IT outage.\nSystems that are impacted in many locations include the company's AI-powered Xvantage distribution platform and the Impulse license provisioning platform. However, BleepingComputer was told that other internal services, such as Microsoft 365, Teams, and SharePoint, continue to operate as usual.\nAs of yesterday, Ingram Micro has not disclosed the attack publicly or to its employees, only stating there are ongoing IT issues, as indicated by company-wide advisories shared with BleepingComputer.\nThe SafePay ransomware gang is a relatively new operation that was first seen in November 2024, accumulating over 220 victims since then.\nThe ransomware operation has been previously observed breaching corporate networks\nthrough VPN gateways\nusing\ncompromised credentials\nand\npassword spray attacks\n.\nBleepingComputer contacted Ingram Micro yesterday and today about the outages and ransomware attack, but did not receive a response to our emails.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nJohnson Controls starts notifying people affected by 2023 breach\nU.S. warns of Iranian cyber threats on critical infrastructure\nFog ransomware attack uses unusual mix of legitimate and open-source tools\nTax resolution firm Optima Tax Relief hit by ransomware, data leaked\nKettering Health confirms Interlock ransomware behind cyberattack"
    }
]