[
    {
        "Title": "Fortinet Releases Patch for Critical SQL Injection Flaw in FortiWeb (CVE-2025-25257)",
        "Link": "https://thehackernews.com/2025/07/fortinet-releases-patch-for-critical.html",
        "Summary": "Fortinet has released fixes for a critical security flaw impacting FortiWeb that could enable an unauthenticated attacker to run arbitrary database commands on susceptible instances.\nTracked as CVE-2025-25257, the vulnerability carries a CVSS score of 9.6 out of a maximum of 10.0.\n\"An improper neutralization of special elements used in an SQL command ('SQL Injection') vulnerability [CWE-89] in",
        "Date": "2025-07-11",
        "Content": "Fortinet has released fixes for a critical security flaw impacting FortiWeb that could enable an unauthenticated attacker to run arbitrary database commands on susceptible instances.\nTracked as CVE-2025-25257, the vulnerability carries a CVSS score of 9.6 out of a maximum of 10.0.\n\"An improper neutralization of special elements used in an SQL command ('SQL Injection') vulnerability [CWE-89] in FortiWeb may allow an unauthenticated attacker to execute unauthorized SQL code or commands via crafted HTTP or HTTPs requests,\" Fortinet\nsaid\nin an advisory released this week.\nThe shortcoming impacts the following versions -\nFortiWeb 7.6.0 through 7.6.3 (Upgrade to 7.6.4 or above)\nFortiWeb 7.4.0 through 7.4.7 (Upgrade to 7.4.8 or above)\nFortiWeb 7.2.0 through 7.2.10 (Upgrade to 7.2.11 or above)\nFortiWeb 7.0.0 through 7.0.10 (Upgrade to 7.0.11 or above)\nKentaro Kawane from GMO Cybersecurity, who was recently credited with reporting a set of critical flaws in Cisco Identity Services and ISE Passive Identity Connector (\nCVE-2025-20286\n,\nCVE-2025-20281, and CVE-2025-20282\n), has been acknowledged for discovering the issue.\nIn an analysis published today, watchTowr Labs said the problem is rooted in a function called \"get_fabric_user_by_token\" that's associated with the Fabric Connector component, which acts as a bridge between FortiWeb and other Fortinet products.\nThe function, in turn, is invoked from another function named \"fabric_access_check,\" that's called from three different API endpoints: \"/api/fabric/device/status,\" \"/api/v[0-9]/fabric/widget/[a-z]+,\" and \"/api/v[0-9]/fabric/widget.\"\nThe issue is that attacker-controlled input – passed via a Bearer token\nAuthorization header\nin a specially crafted HTTP request – is passed directly to an SQL database query without adequate sanitization to make sure that it's not harmful and does not include any malicious code.\nThe\nattack\ncan be extended further by embedding a\nSELECT ... INTO OUTFILE\nstatement to write the results of command execution to a file in the underlying operating system by taking advantage of the fact that the query is run as the \"mysql\" user.\n\"The new version of the function replaces the previous format-string query with\nprepared statements\n– a reasonable attempt to prevent straightforward SQL injection,\" security researcher Sina Kheirkhah\nsaid\n.\nAs temporary workarounds until the necessary patches can be applied, users are recommended to disable HTTP/HTTPS administrative interface.\nWith flaws in Fortinet devices having been exploited by threat actors in the past, it's essential that users move quickly to update to the latest version to mitigate potential risks.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "PerfektBlue Bluetooth Vulnerabilities Expose Millions of Vehicles to Remote Code Execution",
        "Link": "https://thehackernews.com/2025/07/perfektblue-bluetooth-vulnerabilities.html",
        "Summary": "Cybersecurity researchers have discovered a set of four security flaws in OpenSynergy's BlueSDK Bluetooth stack that, if successfully exploited, could allow remote code execution on millions of transport vehicles from different vendors.\nThe vulnerabilities, dubbed PerfektBlue, can be fashioned together as an exploit chain to run arbitrary code on cars from at least three major automakers,",
        "Date": "2025-07-11",
        "Content": "Cybersecurity researchers have discovered a set of four security flaws in OpenSynergy's\nBlueSDK\nBluetooth stack that, if successfully exploited, could allow remote code execution on millions of transport vehicles from different vendors.\nThe vulnerabilities, dubbed\nPerfektBlue\n, can be fashioned together as an exploit chain to run arbitrary code on cars from at least three major automakers, Mercedes-Benz, Volkswagen, and Skoda, according to PCA Cyber Security (formerly PCAutomotive). Outside of these three, a fourth unnamed original equipment manufacturer (OEM) has been confirmed to be affected as well.\n\"PerfektBlue exploitation attack is a set of critical memory corruption and logical vulnerabilities found in OpenSynergy BlueSDK Bluetooth stack that can be chained together to obtain Remote Code Execution (RCE),\" the cybersecurity company\nsaid\n.\nWhile infotainment systems are often seen as isolated from critical vehicle controls, in practice, this separation depends heavily on how each automaker designs internal network segmentation. In some cases, weak isolation allows attackers to use IVI access as a springboard into more sensitive zones—especially if the system lacks gateway-level enforcement or secure communication protocols.\nThe only requirement to pull off the attack is that the bad actor needs to be within range and be able to pair their setup with the target vehicle's infotainment system over Bluetooth. It essentially amounts to a one-click attack to trigger over-the-air exploitation.\n\"However, this limitation is implementation-specific due to the framework nature of BlueSDK,\" PCA Cyber Security added. \"Thus, the pairing process might look different between various devices: limited/unlimited number of pairing requests, presence/absence of user interaction, or pairing might be disabled completely.\"\nThe list of\nidentified vulnerabilities\nis as follows -\nCVE-2024-45434\n(CVSS score: 8.0) - Use-After-Free in AVRCP service\nCVE-2024-45431\n(CVSS score: 3.5) - Improper validation of an L2CAP channel's remote CID\nCVE-2024-45433\n(CVSS score: 5.7) - Incorrect function termination in RFCOMM\nCVE-2024-45432\n(CVSS score: 5.7) - Function call with incorrect parameter in RFCOMM\nSuccessfully obtaining code execution on the In-Vehicle Infotainment (IVI) system enables an attacker to track GPS coordinates, record audio, access contact lists, and even perform lateral movement to other systems and potentially take control of critical software functions of the car, such as the engine.\nFollowing responsible disclosure in May 2024, patches were\nrolled out\nin September 2024.\n\"PerfektBlue allows an attacker to achieve remote code execution on a vulnerable device,\" PCA Cyber Security said. \"Consider it as an entrypoint to the targeted system which is critical. Speaking about vehicles, it's an IVI system. Further lateral movement within a vehicle depends on its architecture and might involve additional vulnerabilities.\"\nEarlier this April, the company presented a series of vulnerabilities that could be exploited to remotely break into a Nissan Leaf electric vehicle and take control of critical functions. The findings were\npresented\nat the Black Hat Asia conference held in Singapore.\n\"Our approach began by exploiting weaknesses in Bluetooth to infiltrate the internal network, followed by bypassing the secure boot process to escalate access,\" it said.\n\"Establishing a command-and-control (C2) channel over DNS allowed us to maintain a covert, persistent link with the vehicle, enabling full remote control. By compromising an independent communication CPU, we could interface directly with the\nCAN bus\n, which governs critical body elements, including mirrors, wipers, door locks, and even the steering.\"\nCAN, short for Controller Area Network, is a communication protocol mainly used in vehicles and industrial systems to facilitate communication between multiple electronic control units (ECUs). Should an attacker with physical access to the car be able to tap into it, the scenario opens the door for injection attacks and impersonation of trusted devices.\n\"One notorious example involves a small electronic device hidden inside an innocuous object (like a portable speaker),\" the Hungarian company\nsaid\n. \"Thieves covertly plug this device into an exposed CAN wiring junction on the car.\"\n\"Once connected to the car's CAN bus, the rogue device mimics the messages of an authorized ECU. It floods the bus with a burst of CAN messages declaring 'a valid key is present' or instructing specific actions like unlocking the doors.\"\nIn a report published late last month, Pen Test Partners\nrevealed\nit turned a 2016 Renault Clio into a Mario Kart controller by intercepting CAN bus data to gain control of the car and mapping its steering, brake, and throttle signals to a Python-based game controller.\nUpdate\nIn a statement shared with The Hacker News, Volkswagen said the identified issues exclusively concern Bluetooth and that neither is vehicle safety or integrity affected.\n\"The investigations revealed that it is possible under certain conditions to connect to the vehicle's infotainment system via Bluetooth without authorization,\" the company said.\n\"Interventions in vehicle functions beyond the infotainment system are not possible, e.g., no steering interventions, no interventions in driver assistance systems, or engine or brake functions. These are located in the vehicle on a different control unit, which is protected against external interference by its own security functions. There are also no indications of malicious exploitation in vehicles in the field.\"\nIt also noted that exploitation of the vulnerabilities is only possible when several conditions are met simultaneously -\nThe attacker is within a maximum distance of 5 to 7 meters from the vehicle\nThe vehicle's ignition must be switched on\nThe infotainment system must be in pairing mode, i.e., the vehicle user must be actively pairing a Bluetooth device, and\nThe vehicle user must actively approve the external Bluetooth access of the attacker on the screen\nEven in scenarios where a threat actor is able to meet the aforementioned criteria and obtain access to the Bluetooth interface, they must remain within a maximum distance of 5 to 7 meters from the vehicle to access the described audio functions of the vehicle.\nAs a precautionary measure, vehicle users can safeguard against these attacks by checking the pairing data during the connection process and ensure the numbers match those displayed on their own device.\n\"Volkswagen is addressing the security gap with software updates, so vehicle users should definitely perform the offered software updates,\" the spokesperson added. \"In some cases, a visit to the workshop may also be necessary.\"\n(The story was updated after publication to include a response from Volkswagen.)\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Securing Data in the AI Era",
        "Link": "https://thehackernews.com/2025/07/securing-data-in-ai-era.html",
        "Summary": "The 2025 Data Risk Report: Enterprises face potentially serious data loss risks from AI-fueled tools. Adopting a unified, AI-driven approach to data security can help.\nAs businesses increasingly rely on cloud-driven platforms and AI-powered tools to accelerate digital transformation, the stakes for safeguarding sensitive enterprise data have reached unprecedented levels. The Zscaler ThreatLabz",
        "Date": "2025-07-11",
        "Content": "The 2025 Data Risk Report\n: Enterprises face potentially serious data loss risks from AI-fueled tools. Adopting a unified, AI-driven approach to data security can help.\nAs businesses increasingly rely on cloud-driven platforms and AI-powered tools to accelerate digital transformation, the stakes for safeguarding sensitive enterprise data have reached unprecedented levels. The Zscaler ThreatLabz 2025 Data Risk Report reveals how evolving technology landscapes are amplifying vulnerabilities, highlighting the critical need for a proactive and unified approach to data protection.\nDrawing on insights from more than 1.2 billion blocked transactions recorded by the Zscaler Zero Trust Exchange between February and December 2024, this year's report paints a clear picture of the data security challenges that enterprises face. From the rise of data leakage through generative AI tools to the undiminished risks stemming from email, SaaS applications, and file-sharing services, the findings are both eye-opening and urgent.\nThe 2025 Data Risk Report sheds light on the multifaceted data security risks enterprises face in today's digitally enabled world. Some of the most noteworthy trends include:\nAI apps are a major data loss vector: AI tools like ChatGPT and Microsoft Copilot contributed to millions of data loss incidents in 2024, particularly social security numbers.\nSaaS data loss is surging: Spanning 3,000+ SaaS apps, enterprises saw more than 872 million data loss violations.\nEmail remains a leading source of data loss: Nearly 104 million transactions leaked billions of instances of sensitive data.\nFile-sharing data loss spikes: Among the most popular file-sharing apps, 212 million transactions saw data loss incidents.\nThere has never been a more critical time to rethink your enterprise's approach to data security.\nThe 2025 ThreatLabz Data Risk Report\noffers a comprehensive look at where risks lie, what drives them, and how organizations can respond effectively to secure their sensitive data in today's rapidly evolving, AI-driven ecosystem.\nTo learn more about Zscaler Zero Trust Architecture and Zero Trust + AI, visit\nzscaler.com/security\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Critical Wing FTP Server Vulnerability (CVE-2025-47812) Actively Being Exploited in the Wild",
        "Link": "https://thehackernews.com/2025/07/critical-wing-ftp-server-vulnerability.html",
        "Summary": "A recently disclosed maximum-severity security flaw impacting the Wing FTP Server has come under active exploitation in the wild, according to Huntress.\nThe vulnerability, tracked as CVE-2025-47812 (CVSS score: 10.0), is a case of improper handling of null ('\\0') bytes in the server's web interface, which allows for remote code execution. It has been addressed in version 7.4.4.\n\"The user and",
        "Date": "2025-07-11",
        "Content": "A recently disclosed maximum-severity security flaw impacting the Wing FTP Server has come under active exploitation in the wild, according to Huntress.\nThe vulnerability, tracked as CVE-2025-47812 (CVSS score: 10.0), is a case of improper handling of null ('\\0') bytes in the server's web interface, which allows for remote code execution. It has been addressed in version 7.4.4.\n\"The user and admin web interfaces mishandle '\\0' bytes, ultimately allowing injection of arbitrary Lua code into user session files,\" according to an\nadvisory\nfor the flaw on CVE.org. \"This can be used to execute arbitrary system commands with the privileges of the FTP service (root or SYSTEM by default).\"\nWhat makes it even more concerning is that the flaw can be exploited via anonymous FTP accounts. A\ncomprehensive breakdown\nof the vulnerability entered the public domain towards the end of June 2025, courtesy of RCE Security researcher Julien Ahrens.\nCybersecurity company Huntress said it observed threat actors exploiting the flaw to download and execute malicious Lua files, conduct reconnaissance, and install remote monitoring and management software.\n\"CVE-2025-47812 stems from how null bytes are handled in the username parameter (specifically related to the loginok.html file, which handles the authentication process),\" Huntress researchers\nsaid\n. \"This can allow remote attackers to perform Lua injection after using the null byte in the username parameter.\"\n\"By taking advantage of the null-byte injection, the adversary disrupts the anticipated input in the Lua file which stores these session characteristics.\"\nEvidence of active exploitation was first observed against a single customer on July 1, 2025, merely a day after details of the exploit were disclosed. Upon gaining access, the threat actors are said to have run enumeration and reconnaissance commands, created new users as a form of persistence, and dropped Lua files to drop an installer for ScreenConnect.\nThere is no evidence that the remote desktop software was actually installed, as the attack was detected and stopped before it could progress any further. It's currently not clear who is behind the activity.\nData from Censys\nshows\nthat there are 8,103 publicly-accessible devices running Wing FTP Server, out of which 5,004 have their web interface exposed. The majority of the instances are\nlocated\nin the U.S., China, Germany, the U.K., and India.\nIn light of active exploitation, it's essential that users move quickly to apply the latest patches and update their Wing FTP Server versions of 7.4.4 or later.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Iranian-Backed Pay2Key Ransomware Resurfaces with 80% Profit Share for Cybercriminals",
        "Link": "https://thehackernews.com/2025/07/iranian-backed-pay2key-ransomware.html",
        "Summary": "An Iranian-backed ransomware-as-a-service (RaaS) named Pay2Key has resurfaced in the wake of the Israel-Iran-U.S. conflict last month, offering bigger payouts to cybercriminals who launch attacks against Israel and the U.S.\nThe financially motivated scheme, now operating under the moniker Pay2Key.I2P, is assessed to be linked to a hacking group tracked as Fox Kitten (aka Lemon Sandstorm).\n\"",
        "Date": "2025-07-11",
        "Content": "An Iranian-backed ransomware-as-a-service (RaaS) named Pay2Key has resurfaced in the wake of the Israel-Iran-U.S. conflict last month, offering bigger payouts to cybercriminals who launch attacks against Israel and the U.S.\nThe financially motivated scheme, now operating under the moniker Pay2Key.I2P, is assessed to be linked to a hacking group tracked as Fox Kitten (aka Lemon Sandstorm).\n\"Linked to the notorious Fox Kitten APT group and closely tied to the well-known Mimic ransomware, [...] Pay2Key.I2P appears to partner with or incorporate Mimic's capabilities,\" Morphisec security researcher Ilia Kulmin\nsaid\n.\n\"Officially, the group offers an 80% profit share (up from 70%) to affiliates supporting Iran or participating in attacks against the enemies of Iran, signaling their ideological commitment.\"\nLast year, the U.S. government\nrevealed\nthe advanced persistent threat's (APT) modus operandi of carrying out ransomware attacks by covertly partnering with NoEscape, RansomHouse, and BlackCat (aka ALPHV) crews.\nThe use of Pay2Key by Iranian threat actors\ngoes back to October 2020\n, with the attacks targeting Israeli companies by exploiting known security vulnerabilities.\nPay2Key.I2P, per Morphisec, emerged on the scene in February 2025, claiming over 51 successful ransom payouts in four months, netting it more than $4 million in ransom payments and $100,000 in profits for individual operators.\nWhile their financial motives are apparent and doubtless effective, there is also an underlying ideological agenda behind them: the campaign appears to be a case of cyber warfare waged against targets in Israel and the U.S.\nA notable aspect of the latest variant of Pay2Key.I2P is that it's the first known RaaS platform to be hosted on the Invisible Internet Project (I2P).\n\"While some malware families have used I2P for [command-and-control] communication, this is a step further – a Ransomware-as-a-Service operation running its infrastructure directly on I2P,\" Swiss cybersecurity company PRODAFT\nsaid\nin a post shared on X in March 2025. The post was subsequently\nreposted\nby Pay2Key.I2P's own X account.\nWhat's more, Pay2Key.I2P has observed posting on a Russian darknet forum that allowed anyone to deploy the ransomware binary for a $20,000 payout per successful attack, marking a shift in RaaS operations. The post was made by a user named \"Isreactive\" on February 20, 2025.\n\"Unlike traditional Ransomware-as-a-Service (RaaS) models, where developers take a cut only from selling the ransomware, this model allows them to capture the full ransom from successful attacks, only sharing a portion with the attackers who deploy it,\" Kulmin\nnoted\nat the time.\n\"This shift moves away from a simple tool-sale model, creating a more decentralized ecosystem, where ransomware developers earn from attack success rather than just from selling the tool.\"\nAs of June 2025, the ransomware builder includes an option to target Linux systems, indicating that the threat actors are actively refining and improving the locker's functionality. The Windows counterpart, on the other hand, is delivered as a Windows executable within a self-extracting (SFX) archive.\nIt also incorporates various evasion techniques that allow it to run unimpeded by disabling Microsoft Defender Antivirus and deleting malicious artifacts deployed as part of the attack to minimize forensic trail.\n\"Pay2Key.I2P represents a dangerous convergence of Iranian state-sponsored cyber warfare and global cybercrime,\" Morphisec said. \"With ties to Fox Kitten and Mimic, an 80% profit incentive for Iran's supporters, and over $4 million in ransoms, this RaaS operation threatens Western organizations with advanced, evasive ransomware.\"\nThe findings come as the U.S. cybersecurity and intelligence agencies have\nwarned\nof retaliatory attacks by Iran after American airstrikes on three nuclear facilities in the country.\nOperational technology (OT) security company Nozomi Networks said it has observed Iranian hacking groups like MuddyWater, APT33, OilRig, Cyber Av3ngers, Fox Kitten, and Homeland Justice targeting transportation and manufacturing organizations in the U.S.\n\"Industrial and critical infrastructure organizations in the U.S. and abroad are urged to be vigilant and review their security posture,\" the company\nsaid\n, adding it detected 28 cyber attacks related to Iranian threat actors between May and June 2025.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "CISA Adds Citrix NetScaler CVE-2025-5777 to KEV Catalog as Active Exploits Target Enterprises",
        "Link": "https://thehackernews.com/2025/07/cisa-adds-citrix-netscaler-cve-2025.html",
        "Summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Thursday added a critical security flaw impacting Citrix NetScaler ADC and Gateway to its Known Exploited Vulnerabilities (KEV) catalog, officially confirming the vulnerability has been weaponized in the wild.\nThe shortcoming in question is CVE-2025-5777 (CVSS score: 9.3), an instance of insufficient input validation that could",
        "Date": "2025-07-11",
        "Content": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Thursday\nadded\na critical security flaw impacting Citrix NetScaler ADC and Gateway to its Known Exploited Vulnerabilities (\nKEV\n) catalog, officially confirming the vulnerability has been weaponized in the wild.\nThe shortcoming in question is\nCVE-2025-5777\n(CVSS score: 9.3), an instance of insufficient input validation that could be exploited by an attacker to bypass authentication when the appliance is configured as a Gateway or AAA virtual server. It's also called\nCitrix Bleed 2\nowing to its similarities with Citrix Bleed (CVE-2023-4966).\n\"Citrix NetScaler ADC and Gateway contain an out-of-bounds read vulnerability due to insufficient input validation,\" the agency said. \"This vulnerability can lead to memory overread when the NetScaler is configured as a Gateway (VPN virtual server, ICA Proxy, CVPN, RDP Proxy) OR AAA virtual server.\"\nCISA pointed out that flaws like CVE-2025-5777 are frequent attack vectors for malicious cyber actors and pose significant risk to federal enterprises. To that end, Federal Civilian Executive Branch (FCEB) agencies are required to implement mitigations by the end of today, July 11.\nAlthough multiple security vendors have since reported that the flaw has been exploited in real-world attacks, Citrix has yet to update its own advisories to reflect this aspect. As of June 26, 2025, Anil Shetty, senior vice president of engineering at NetScaler,\nsaid\n, \"there is no evidence to suggest exploitation of CVE-2025-5777.\"\nHowever, security researcher Kevin Beaumont, in a\nreport\npublished this week, said the Citrix Bleed 2 exploitation started as far back as mid-June, adding one of the IP addresses carrying out the attacks has been previously linked to RansomHub ransomware activity.\nData from\nGreyNoise\nshows that exploitation efforts are originating from\n10 unique malicious IP addresses\nlocated in Bulgaria, the United States, China, Egypt, and Finland over the past 30 days. The primary targets of these efforts are the United States, France, Germany, India, and Italy.\nThe addition of CVE-2025-5777 to the KEV catalog comes as another flaw in the same product (\nCVE-2025-6543\n, CVSS score: 9.2) has also come under active exploitation in the wild. CISA\nadded\nthe flaw to the KEV catalog on June 30, 2025.\n\"The term 'Citrix Bleed' is used because the memory leak can be triggered repeatedly by sending the same payload, with each attempt leaking a new chunk of stack memory — effectively 'bleeding' sensitive information,\" Akamai\nsaid\n, warning of a \"drastic increase of vulnerability scanner traffic\" after\nexploit details became public\n.\n\"This flaw can have dire consequences, considering that the affected devices can be configured as VPNs, proxies, or AAA virtual servers. Session tokens and other sensitive data can be exposed — potentially enabling unauthorized access to internal applications, VPNs, data center networks, and internal networks.\"\nBecause these appliances often serve as centralized entry points into enterprise networks, attackers can pivot from stolen sessions to access single sign-on portals, cloud dashboards, or privileged admin interfaces. This type of lateral movement—where a foothold quickly becomes full network access—is especially dangerous in hybrid IT environments with weak internal segmentation.\nTo mitigate this flaw, organizations should immediately upgrade to the patched builds listed in Citrix's June 17 advisory, including version 14.1-43.56 and later. After patching, all active sessions—especially those authenticated via AAA or Gateway—should be forcibly terminated to invalidate any stolen tokens.\nAdmins are also encouraged to inspect logs (e.g., ns.log) for suspicious requests to authentication endpoints such as /p/u/doAuthentication.do, and review responses for unexpected XML data like <InitialValue> fields. Since the vulnerability is a memory overread, it does not leave traditional malware traces—making token hijack and session replay the most urgent concerns.\nThe development also follows reports of active exploitation of a\ncritical security vulnerability\nin\nOSGeo GeoServer GeoTools\n(CVE-2024-36401, CVSS score: 9.8) to deploy NetCat and the XMRig cryptocurrency miner in attacks targeting South Korea by means of PowerShell and shell scripts. CISA\nadded\nthe flaw to the KEV catalog in July 2024.\n\"Threat actors are targeting environments with vulnerable GeoServer installations, including those of Windows and Linux, and have installed NetCat and XMRig coin miner,\" AhnLab\nsaid\n.\n\"When a coin miner is installed, it uses the system's resources to mine the threat actor's Monero coins. The threat actor can then use the installed NetCat to perform various malicious behaviors, such as installing other malware or stealing information from the system.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "'123456' password exposed chats for 64 million McDonald’s job applicants",
        "Link": "https://www.bleepingcomputer.com/news/security/123456-password-exposed-chats-for-64-million-mcdonalds-job-applicants/",
        "Summary": "Cybersecurity researchers discovered a vulnerability in McHire, McDonald's chatbot job application platform, that exposed the chats of more than 64 million job applicants across the United States. [...]",
        "Date": "2025-07-11",
        "Content": "Cybersecurity researchers discovered a vulnerability in McHire, McDonald's chatbot job application platform, that exposed the chats of more than 64 million job applicants across the United States.\nThe flaw was discovered by security researchers Ian Carroll and Sam Curry, who found that the ChatBot's admin panel utilized a test franchise that was protected by weak credentials of a login name \"123456\" and a password of \"123456\".\nMcHire, powered by Paradox.ai and used by about 90% of McDonald's franchisees, accepts job applications through a chatbot named Olivia. Applicants can submit names, email addresses, phone numbers, home addresses, and availability, and are required to complete a personality test as part of the job application process.\nOnce logged in, the researchers submitted a job application to the test franchise to see how the process worked.\nDuring this test, they noticed that HTTP requests were sent to an API endpoint at /api/lead/cem-xhr, which used a parameter lead_id, which in their case was 64,185,742.\nThe researchers found that by incrementing and decrementing the lead_id parameter, they were able to expose the full chat transcripts, session tokens, and personal data of real job applicants that previously applied on McHire.\nThis type of flaw is called an IDOR (Insecure Direct Object Reference) vulnerability, which is when an application exposes internal object identifiers, such as record numbers, without verifying whether the user is actually authorized to access the data.\n\"During a cursory security review of a few hours, we identified two serious issues: the McHire administration interface for restaurant owners accepted the default credentials 123456:123456, and an insecure direct object reference (IDOR) on an internal API allowed us to access any contacts and chats we wanted,\" Carroll\nexplained in a writeup\nabout the flaw.\n\"Together they allowed us and anyone else with a McHire account and access to any inbox to retrieve the personal data of more than 64 million applicants.\"\nIn this case, incrementing or decrementing a lead_id number in a request returned sensitive data belonging to other applicants, as the API failed to check if the user had access to the data.\nExploiting the IDOR bug to see McDonald's job applications\nThe issue was reported to Paradox.ai and McDonald's on June 30.\nMcDonald's acknowledged the report within an hour, and the default admin credentials were disabled soon after.\n\"We're disappointed by this unacceptable vulnerability from a third-party provider, Paradox.ai. As soon as we learned of the issue, we mandated Paradox.ai to remediate the issue immediately, and it was resolved on the same day it was reported to us,\" McDonald's told\nWired\nin a statement about the research.\nParadox deployed a fix to address the IDOR flaw and confirmed that the vulnerability was mitigated. Paradox.ai has\nsince stated\nthat it is conducting a review of its systems to prevent similar big issues from recurring.\nParadox also told BleepingComputer that the information exposed would be any chatbot interaction, such as clicking on a button, even if no personal information was entered.\nUpdate 7/11/25: Added information from Paradox.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nCISA tags Citrix Bleed 2 as exploited, gives agencies a day to patch\nNew ServiceNow flaw lets attackers enumerate restricted data\nRuckus Networks leaves severe flaws unpatched in management devices\nMicrosoft July 2025 Patch Tuesday fixes one zero-day, 137 flaws\nWindows 10 KB5062554 cumulative update released with 13 changes, fixes"
    },
    {
        "Title": "Exploits for pre-auth Fortinet FortiWeb RCE flaw released, patch now",
        "Link": "https://www.bleepingcomputer.com/news/security/exploits-for-pre-auth-fortinet-fortiweb-rce-flaw-released-patch-now/",
        "Summary": "Proof-of-concept exploits have been released for a critical SQLi vulnerability in Fortinet FortiWeb that can be used to achieve pre-authenticated remote code execution on vulnerable servers. [...]",
        "Date": "2025-07-11",
        "Content": "Proof-of-concept exploits have been released for a critical SQLi vulnerability in Fortinet FortiWeb that can be used to achieve pre-authenticated remote code execution on vulnerable servers.\nFortiWeb is a web application firewall (WAF), which is used to protect web applications from malicious HTTP traffic and threats.\nThe FortiWeb vulnerability has a 9.8/10 severity score and is tracked as CVE-2025-25257. Fortinet fixed it last week in FortiWeb 7.6.4, 7.4.8, 7.2.11, and 7.0.11 and later versions.\n\"An improper neutralization of special elements used in an SQL command ('SQL Injection') vulnerability [CWE-89] in FortiWeb may allow an unauthenticated attacker to execute unauthorized SQL code or commands via crafted HTTP or HTTPs requests,\" reads\nFortinet's advisory\n.\nThe flaw was discovered by Kentaro Kawane from GMO Cybersecurity, who also disclosed a\nstatic hardcoded password vulnerability in Cisco ISE\nlast month.\nFortiWeb pre-auth SQLi to pre-auth RCE\nToday, cybersecurity firm\nWatchTowr\nand a security researcher known as \"\nfaulty *ptrrr\n\" released technical write-ups and proof-of-concept exploits that open reverse shells or a web shell.\nThe flaw is found in FortiWeb's Fabric Connector, which is software that synchronizes authentication and policy data between Fortinet products.\nThe software contains an unauthenticated SQL injection flaw in the\nget_fabric_user_by_token()\nfunction, which uses the following code to issue a MySQL query:\nsnprintf(s, 0x400u, \"select id from fabric_user.user_table where token='%s'\", a1);\nThis code did not properly sanitize the bearer token sent in HTTP request headers, allowing attackers to inject custom SQL into the header to achieve SQLi.\nAttackers can trigger the flaw through HTTP requests to the\n/api/fabric/device/status\nendpoint by injecting SQL into the Authorization header (e.g.,\nBearer AAAAAA'or'1'='1\n), allowing attackers to bypass authentication checks.\nThe researchers were able to escalate the SQL injection to remote code execution by executing MySQL's\nSELECT … INTO OUTFILE\nquery via the SQLi flaw to create arbitrary files on the device. This allowed them to write a Python .pth file into the site‑packages directory.\nAs .pth files are automatically loaded and run when Python is executed, the researchers found a legitimate FortiWeb CGI Python script (\n/cgi-bin/ml‑draw.py\n) that could be used to launch the malicious code in the .pth file and achieve remote code execution.\nAs exploits are now public and widely available, it is strongly advised that admins prioritize installing the patches to prevent servers from being compromised.\nAt this time, there is no indication that the vulnerability is being actively exploited, but this will likely change in the near future.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nCritical Fortinet flaws now exploited in Qilin ransomware attacks\nFortinet fixes critical zero-day exploited in FortiVoice attacks\nPerfektBlue Bluetooth flaws impact Mercedes, Volkswagen, Skoda cars\nCisco warns of max severity RCE flaws in Identity Services Engine\nWinRAR patches bug letting malware launch from extracted archives"
    },
    {
        "Title": "WordPress Gravity Forms developer hacked to push backdoored plugins",
        "Link": "https://www.bleepingcomputer.com/news/security/wordpress-gravity-forms-developer-hacked-to-push-backdoored-plugins/",
        "Summary": "The popular WordPress plugin Gravity Forms has been compromised in what seems a supply-chain attack where manual installers from the official website were infected with a backdoor. [...]",
        "Date": "2025-07-11",
        "Content": "The popular WordPress plugin Gravity Forms has been compromised in what seems a supply-chain attack where manual installers from the official website were infected with a backdoor.\nGravity Forms is a premium plugin for creating contact, payment, and other online forms. Based on statistic data from the vendor, the product is isntalled on around one million websites, some belonging to well-known organizations like Airbnb, Nike, ESPN, Unicef, Google, and Yale.\nRemote code execution on the server\nWordPress security firm PatchStack says it received a report earlier today about suspicious requests generated by plugins downloaded from the Gravity Forms website.\nAfter examining the plugin, PatchStack confirmed that it received a malicious file (gravityforms/common.php) downloaded from the vendor's website. Closer examination revealed that the file initiated a POST request to a suspicious domain at “gravityapi.org/sites.”\nUpon further analysis, the researchers found that the plugin collected extensive site metadata, including URL, admin path, theme, plugins, and PHP/WordPress versions, and exfiltrates it to the attackers.\nThe server response includes base64-encoded PHP malware, which is saved as “wp-includes/bookmark-canonical.php.”\nThe malware masquerades as WordPress Content Management Tools that enables remote code execution without the need to authenticate using functions like ‘handle_posts(),’ ‘handle_media(),’ ‘handle_widgets().’\n“All of those functions can be called from __construct -> init_content_management -> handle_requests -> process_request function. So, it basically can be triggered by an unauthenticated user,”\nPatchstack explains\n.\n“From all of the functions, it will perform an eval call with the user-supplied input, resulting in remote code execution on the server,” the researchers said.\nRocketGenius, the developer behind Gravity Forms, was informed of the issue, and a staff member told Patchstack that the malware affected only manual downloads and composer installation of the plugin.\nPatchstack recommends that anyone who downloaded Gravity Forms starting yesterday reinstall the plugin by getting a clean version. Admins should also scan their websites for any signs of infection.\nAccording to Patchstack, the domains facilitating this operation were registered on July 8.\nHackers add admin account\nRocketGenius has published a post-mortem of the incident confirming that only Gravity Forms 2.9.11.1 and 2.9.12 available for manual download between July 10 and 11 were compromised.\nIf admins ran a composer install for version 2.9.11 on any of the two dates, they received an infected copy of the product.\n\"The Gravity API service that handles licensing, automatic updates, and the installation of add-ons initiated from within the Gravity Forms plugin was never compromised. All package updates managed through that service are unaffected\" -\nRocketGenius\nRocketGenius says that the malicious code blocked update attempts, contacted an external servers to fetch additional payloads, and added an admin account that gave the attacker complete control of the website.\nThe developer also provides methods for administrators to\ncheck for possible infection\nby following specific links on their websites.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nForminator plugin flaw exposes WordPress sites to takeover attacks\nLinux Foundation unveils decentralized WordPress plugin manager\nTwilio denies breach following leak of alleged Steam 2FA codes\nMalicious Chrome extensions with 1.7M installs found on Web Store\nCoinMarketCap briefly hacked to drain crypto wallets via fake Web3 popup"
    },
    {
        "Title": "NVIDIA shares guidance to defend GDDR6 GPUs against Rowhammer attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/nvidia-issues-guidance-to-defend-gddr6-gpus-against-rowhammer/",
        "Summary": "NVIDIA is warning users to activate System Level Error-Correcting Code  mitigation to protect against Rowhammer attacks on graphical processors with GDDR6 memory. [...]",
        "Date": "2025-07-11",
        "Content": "NVIDIA is warning users to activate System Level Error-Correcting Code  mitigation to protect against Rowhammer attacks on graphical processors with GDDR6 memory.\nThe company is reinforcing the recommendation as new research demonstrates a Rowhammer attack against an NVIDIA A6000 GPU (graphical processing unit).\nRowhammer is a hardware fault that can be triggered through software processes and stems from memory cells being too close to each other. The attack was demonstrated on DRAM cells but it can affect GPU memory, too.\nIt works by accessing a memory row with enough read-write operations, which causes the value of adjacent data bits to flip from one to zero and vice-versa, causing the in-memory information to change.\nThe effect could be a denial-of-service condition, data corruption, or even privilege escalation.\nSystem Level Error-Correcting Codes (ECC) can preserve the integirty of the data by adding redundant bits and correcting single-bit errors to maintain data reliability and accuracy.\nIn workstation and data center GPUs where VRAM handles large datasets and precise calculations related to AI workloads, ECC must be enabled to prevent crucial errors in their operation.\nNVIDIA's security notice notes that researchers at the University of Toronto showed \"a potential Rowhammer attack against an NVIDIA A6000 GPU with GDDR6 Memory\" where System-Level ECC was not enabled.\nThe academic researchers developed GPUHammer, an attack method to flip bits on GPU memories.\nAlthough hammering is harder on GDDR6 because of higher latency and faster refresh compared with CPU-based DDR4, the researchers were able to demonstrate that\nRowhammer attacks on GPU\nmemory banks is possible.\nApart from the RTX A6000, the GPU maker also\nrecommends\nenabling System-Level ECC for the following products:\nData Center GPUs:\nAmpere: A100, A40, A30, A16, A10, A2, A800\nAda: L40S, L40, L4\nHopper: H100, H200, GH200, H20, H800\nBlackwell: GB200, B200, B100\nTuring: T1000, T600, T400, T4\nVolta: Tesla V100, Tesla V100S\nWorkstation GPUs:\nAmpere RTX: A6000, A5000, A4500, A4000, A2000, A1000, A400\nAda RTX: 6000, 5000, 4500, 4000, 4000 SFF, 2000\nBlackwell RTX PRO (newest workstation line)\nTuring RTX: 8000, 6000, 5000, 4000\nVolta: Quadro GV100\nEmbedded / Industrial:\nJetson AGX Orin Industrial\nIGX Orin\nThe GPU maker notes that newer GPUs like Blackwell RTX 50 Series (GeForce), Blackwell Data Center GB200, B200, B100, and Hopper Data Center H100, H200, H20, and GH200, come with built-in on-die ECC protection, which does nor require an intervention from the user.\nOne way to check if System Level ECC is enabled is to use an out-of-band method that utilizes the system's BMC (Baseboard Management Controller) and hardware interface software, like the\nRedfish API\n, to check the \"ECCModeEnabled\" status.\nTools like NSM Type 3 and NVIDIA SMBPBI can also be used for configuration, though they require access to the NVIDIA Partner Portal.\nA second In-Band method also exists, using the nvidia-smi command-line utility from the system's CPU to check and enable ECC where supported.\nRowhammer represents a real security concern that could cause data corruption or enable attacks in multi-tenant environments like cloud servers where vulnerable GPUs may be deployed.\nHowever, the real risk is context-dependent, and exploiting Rowhammer reliably is complicated, requiring specific conditions, high access rates, and precise control, making it an attack difficult to execute.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nHikvision Canada ordered to cease operations over security risks\nClaude catches up to ChatGPT with built-in memory support\nChatGPT rolls out Memory upgrade for free users\nQualcomm fixes three Adreno GPU zero-days exploited in attacks\nMozilla releases Firefox 139.0.1 update to fix artifacts on Nvidia GPUs"
    },
    {
        "Title": "The zero-day that could've compromised every Cursor and Windsurf user",
        "Link": "https://www.bleepingcomputer.com/news/security/the-zero-day-that-couldve-compromised-every-cursor-and-windsurf-user/",
        "Summary": "Learn how one overlooked flaw in OpenVSX discovered by Koi Secureity could've let attackers hijack millions of dev machines via an extension supply chain attack. The zero-day threat's been patched—but the wake-up call is clear: extensions are a new, massive supply chain risk. [...]",
        "Date": "2025-07-11",
        "Content": "A security researcher from\nKoi Security\nstumbled upon a critical zero-day buried deep in the infrastructure powering today’s AI coding tools. Had it been exploited, a non-sophisticated attacker could’ve hijacked over 10 million machines with a single stroke.\nAI coding assistants like Cursor and Windsurf have exploded in popularity, promising supercharged productivity for developers around the world. Behind their sleek interfaces lies a shared foundation: community-built VS Code forks and an open marketplace of extensions that powers the magic. But, with this new wave of developer tooling comes a dangerous blind spot.\nDubbed VSXPloit:\nA single overlooked flaw in OpenVSX - a critical component in the developer supply chain - allowed silent, full-system compromise on any machine running a VS Code fork. One bug. Total control.\nLet’s dive in.\nToday’s AI-powered editors heavily rely on extensions to deliver their most basic functionality. Features like syntax highlighting, linting, and debugging aren’t hardcoded into the editor - they are provided by extensions.\nEach of these extensions runs with full privileges on the developer’s machine. This in turn means that a single compromised extension can lead to full machine takeover of anyone who installs it.\nThis exact nightmare scenario is what security researcher Oren Yomtov from\nKoi Security\n, a company providing a platform for securing software provisioning and extensions, stumbled upon.\nIn a recent post\nYomtov explains that while examining the build process behind OpenVSX, the open-source marketplace powering extensions for tools like Cursor, Windsurf, VSCodium, and others, he discovered a critical flaw.\nThe vulnerability allowed any attacker, not only to gain control over a single extension, but an supply chain armageddon, gaining full control over the entire marketplace.\nGiven this flaw, any attacker could push malicious updates under the trusted @open-vsx account. At first, Yomtov assumed it had to be a mistake, this code had been running for years, used by tens of millions. But when he recreated the attack in his lab, the simulation worked flawlessly.\nWhat seemed unthinkable was suddenly very real: a silent, full-scale security disaster was sitting in plain sight.\nSecure Your Dev Environment from Hidden Extension Threats\nLearn how Koi helps organizations discover, assess, and govern risky extensions across VSCode, OpenVSX, Chrome, and other marketplaces.\nGain full visibility and protect your development supply chain.\nRequest a Demo\nThe Vulnerability: A Variation On The Classic “Pwn Request”\nTo understand how the vulnerability worked, you first need to understand how extensions make their way into OpenVSX in the first place.\nIf you want to publish an extension to Open VSX, you have two options:\nUpload it to Open VSX yourself\nRequest an extension to be auto-published by creating a pull request that adds the extension to the list in the extensions.json file\n“The nightly build is where the problem lies,” says Yomtov.\nEvery night, OpenVSX runs an automated process that fetches the latest versions of community-submitted extensions, builds them, and publishes them to the marketplace. It’s meant to make life easier for developers, but in this case, it introduced a critical flaw.\nTo get an extension auto-published, all a developer has to do is submit a simple pull request adding it to a public list. From there, OpenVSX takes over: it pulls the code, installs the dependencies, builds the extension, and publishes it using a powerful secret token that belongs to the trusted @open-vsx account.\nThis token was meant to stay hidden, only seen by trusted infrastructure. Unfortunately, due to how the build process runs arbitrary code from public repositories, any extension author could craft a malicious update that\nsilently captures the token\n.\nWhat’s even more alarming is that they wouldn’t need to submit a malicious extension directly. They could have hidden their code inside a dependency, or even a dependency-of-a-dependency, and the system would have executed it automatically during the nightly build. From there, stealing the token was trivial.\nAnd with that token in hand, an attacker wouldn’t just control their own extension. They could publish updates, overwrite existing ones, and silently hijack the entire marketplace.\nThe Impact: A Supply-Chain Nightmare That Exposed Millions of Developers\nWith access to the @open-vsx account’s token, an attacker could have created a world wide supply chain nightmare. “That token is a super-admin credential,” explains Yomtov. “It can publish new extensions, overwrite existing ones, and impersonate any publisher in the ecosystem.”\nFrom that point on, the damage becomes almost effortless. Every time a developer installs an extension or their editor auto-updates one in the background, which continuously happens, the attacker’s payload would be silently delivered to their machine. No alerts. No prompts. No suspicion. Full takeover.\nAnd what could that payload do? “Pretty much anything,” says Yomtov. Extensions in VS Code and its forks run as Node.js processes, which means they can access files, launch other programs, make network requests, and execute arbitrary code.\nA malicious update to a popular extension, say, the Python plugin, could quietly install a keylogger, steal browser cookies, swipe source code, infect builds, or backdoor entire development pipelines.\nThere have been isolated cases of rogue VS Code extensions stealing SSH keys or crypto wallets. But this wouldn’t be one bad actor slipping through the cracks. This would be full-scale takeover, supply-chain compromise at ecosystem scale. Like SolarWinds, but for developer tools.\nWhile the impact would be most severe for desktop editors like Cursor, Windsurf, and VSCodium, even browser-based environments such as Gitpod or StackBlitz could be affected, depending on how deeply integrated the compromised extensions are.\nSo What Can You Do About It?\nWe asked Yomtov what users and organizations should take away from this incident. His answer was blunt: “Assume every extension is untrusted until proven otherwise.”\nExtensions may feel like harmless add-ons, but under the hood, they’re powerful software components, often written by individuals, running with full permissions, and automatically updated without oversight.\n“It’s no different than pulling in a package from npm or PyPI, and generally even worse” Yomtov says. “If you wouldn’t blindly trust a GitHub repo with root access to your machine, you shouldn’t trust an extension either.”\nTo protect ourselves, Yomtov recommends organizations treat extensions as part of their attack surface and apply the same discipline they use for any other dependency. That means:\nMaintaining a real inventory\nof what’s installed, across which machines, and by whom\nAssessing risk\nbased on who built the extension, how it’s maintained, and what it actually does\nEnforcing clear policies\naround what’s allowed, and taking action when something drifts out of bounds\nMonitoring continuously\n, since extensions can update silently and introduce new risks overnight\nKoi’s research team continues to\nfind both vulnerable and actively malicious extensions\n- not just in OpenVSX,or Microsoft’s marketplace, even in other extension marketplaces like the Chrome Web Store.\n“The ecosystem has grown faster than the guardrails,” says Yomtov. “Until that changes, the safest assumption is zero trust. Every extension is a potential backdoor unless you’ve reviewed and are watching it.”\nYomtov and the team at\nKoi Security\nresponsibly disclosed the vulnerability to the Eclipse Foundation, which maintains the OpenVSX project. Over the following weeks, they worked closely with the maintainers to validate the issue, design a robust fix, and ensure the patch was properly implemented and deployed.\nThanks to this collaboration, the vulnerability has been closed and the marketplace is once again safe for the millions of developers who rely on it daily.\nBut the incident serves as a wake-up call - even trusted infrastructure needs constant scrutiny, especially when it holds the keys to the entire development ecosystem.\nLearn how Koi helps organizations discover, assess, and govern risky extensions across VSCode, OpenVSX, Chrome, and other marketplaces\nChat with us.\nSponsored and written by\nKoi Security\n."
    },
    {
        "Title": "CISA tags Citrix Bleed 2 as exploited, gives agencies a day to patch",
        "Link": "https://www.bleepingcomputer.com/news/security/cisa-tags-citrix-bleed-2-as-exploited-gives-agencies-a-day-to-patch/",
        "Summary": "The U.S. Cybersecurity & Infrastructure Security Agency has confirmed active exploitation of the CitrixBleed 2 vulnerability (CVE-2025-5777) in Citrix NetScaler ADC and Gateway and is giving federal agencies one day to apply fixes. [...]",
        "Date": "2025-07-11",
        "Content": "The U.S. Cybersecurity & Infrastructure Security Agency has confirmed active exploitation of the CitrixBleed 2 vulnerability (CVE-2025-5777) in Citrix NetScaler ADC and Gateway and is giving federal agencies one day to apply fixes.\nSuch a short deadline for installing the patches is unprecedented since CISA released the Known Exploited Vulnerabilities (KEV) catalog, showing the severity of the attacks exploiting the security issue.\nThe agency\nadded the flaw\nto its Known Exploited Vulnerabilities (KEV) catalog yesterday, ordering federal agencies to implement mitigations by the end of today, June 11.\nCVE-2025-5777 is a critical memory safety vulnerability (out-of-bounds memory read) that gives an unauthenticated attacker access to restricted parts of the memory.\nThe issue impacts NetScaler devices that are configured as a Gateway or an AAA virtual server, in versions prior to 14.1-43.56, 13.1-58.32, 13.1-37.235-FIPS/NDcPP, and 2.1-55.328-FIPS.\nCitrix addressed the vulnerability through\nupdates released on June 17\n.\nA week later, security researcher Kevin Beaumont warned in a blog post about the flaw's potential for exploitation, its severity and repercussions if left unpatched.\nBeaumont called the flaw '\nCitrixBleed 2'\ndue to similarities with the infamous CitrixBleed vulnerability (CVE-2023-4966), which was extensively exploited in the wild by all types of cybercriminal actors.\nThe first warning of CitrixBleed 2 being exploited\ncame from ReliaQuest\non June 27. On July 7, security researchers at watchTowr and Horizon3\npublished proof-of-concept exploits\n(PoCs) for CVE-2025-5777, demonstrating how the flaw can be leveraged in attacks that steal user session tokens.\nAt the time, signs of definitive active exploitation in the wild remained elusive, but with the availability of PoCs and ease of exploitation, it was only a matter of time until attackers started to leverage it at a larger scale.\nFor the past two weeks, though, threat actors have been active on hacker forums discussing, working, testing, and publicly sharing feedback on PoCs for the Citrix Bleed 2 vulnerability.\nThey showed interest in how to make available exploits work in attacks. Their activity increased the past few days and multiple exploits for the vulnerability have been published.\nWith CISA confirming CitrixBleed 2 being actively used in attacks, it is likely that threat actors have now developed their own exploits based on the technical info released last week.\n\"Apply mitigations per vendor instructions, follow applicable BOD 22-01 guidance for cloud services, or discontinue use of the product if mitigations are unavailable,\"\nCISA warns\n.\nTo mitigate the issue, users are strongly recommended to upgrade to firmware versions 14.1-43.56+, 13.1- 58.32+, or 13.1-FIPS/NDcPP 13.1- 37.235+.\nAfter updating, admins should disconnect all active ICA and PCoIP sessions, as they may already be compromised.\nBefore doing so, they should review current sessions for suspicious behavior using the\n'show icaconnection'\ncommand or via NetScaler Gateway > PCoIP > Connections.\nThen, end the sessions using the following commands:\nkill icaconnection -all\nkill pcoipconnection -all\nIf updating right away isn't possible, limit external access to NetScaler using firewall rules or ACLs.\nAlthough CISA confirms exploitation, it is important to note that Citrix has still to update its\noriginal security bulletin\nfrom June 27, which states that there is no evidence of CVE-2025-5777 exploited in the wild.\nBleepingComputer contacted Citrix to ask if there are any updates on the exploitation status of CitrixBleed 2, and we will update this post once a statement becomes available.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nNew 'CitrixBleed 2' NetScaler flaw let hackers hijack sessions\nCitrix Bleed 2 flaw now believed to be exploited in attacks\nPublic exploits released for Citrix Bleed 2 NetScaler flaw, patch now\nCISA warns of ConnectWise ScreenConnect bug exploited in attacks\nCISA: AMI MegaRAC bug enabling server hijacks exploited in attacks"
    },
    {
        "Title": "Pay2Key Ransomware Gang Resurfaces With Incentives to Attack US, Israel",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/pay2key-ransomware-gang-incentives-attack-us-israel",
        "Summary": "The ransomware-as-a-service (RaaS) operation, which has been tied to an Iranian advanced persistent threat (APT) group, recently boosted its affiliate profit share to 80% for attacks on Western targets.",
        "Date": "2025-07-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/pay2key-ransomware-gang-incentives-attack-us-israel"
    },
    {
        "Title": "350M Cars, 1B Devices Exposed to 1-Click Bluetooth RCE",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/350m-cars-1b-devices-1-click-bluetooth-rce",
        "Summary": "Mercedes, Skoda, and Volkswagen vehicles, as well as untold industrial, medical, mobile, and consumer devices, may be vulnerable to an attack chain called &quot;PerfektBlue.&quot;",
        "Date": "2025-07-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/350m-cars-1b-devices-1-click-bluetooth-rce"
    },
    {
        "Title": "As Cyber-Insurance Premiums Drop, Coverage Is Key to Resilience",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/cyber-insurance-premiums-drop-coverage-key-resilience",
        "Summary": "Cyber-insurance premiums continue to decline from their explosive growth from 2020 to 2022, but coverage is more important than ever to manage risks, experts say.",
        "Date": "2025-07-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/cyber-insurance-premiums-drop-coverage-key-resilience"
    },
    {
        "Title": "Factoring Cybersecurity Into Finance's Digital Strategy",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/factoring-cybersecurity-finances-digital-strategy",
        "Summary": "As financial institutions continue to embrace digital transformation, their success will depend on their ability to establish and maintain robust and responsible cybersecurity practices.",
        "Date": "2025-07-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/factoring-cybersecurity-finances-digital-strategy"
    },
    {
        "Title": "Customer, Employee Data Exposed in Nippon Steel Breach",
        "Link": "https://www.darkreading.com/threat-intelligence/customer-employee-data-nippon-steel-breach",
        "Summary": "Information from the company's NS Solutions subsidiary has yet to show up on any Dark Web sites, but it doesn't rule out the possibility that the data may have been stolen.",
        "Date": "2025-07-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/customer-employee-data-nippon-steel-breach"
    },
    {
        "Title": "In Other News: Microsoft Finds AMD CPU Flaws, ZuRu macOS Malware Evolves, DoNot APT Targets Govs",
        "Link": "https://www.securityweek.com/in-other-news-microsoft-finds-amd-cpu-flaws-zuru-macos-malware-donot-apt/",
        "Summary": "<p>Noteworthy stories that might have slipped under the radar: Microsoft shows attack against AMD processors, SentinelOne details latest ZuRu macOS malware version, Indian APT DoNot targets governments. </p>\n<p>The post <a href=\"https://www.securityweek.com/in-other-news-microsoft-finds-amd-cpu-flaws-zuru-macos-malware-donot-apt/\">In Other News: Microsoft Finds AMD CPU Flaws, ZuRu macOS Malware Evolves, DoNot APT Targets Govs</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/in-other-news-microsoft-finds-amd-cpu-flaws-zuru-macos-malware-donot-apt/"
    },
    {
        "Title": "Cyberstarts Launches $300M Liquidity Fund to Help Startups Retain Top Talent",
        "Link": "https://www.securityweek.com/cyberstarts-launches-300m-liquidity-fund-to-help-startups-retain-top-talent/",
        "Summary": "<p>With IPOs taking longer than ever, the venture firm’s fund aims to keep startup veterans motivated while staying private.</p>\n<p>The post <a href=\"https://www.securityweek.com/cyberstarts-launches-300m-liquidity-fund-to-help-startups-retain-top-talent/\">Cyberstarts Launches $300M Liquidity Fund to Help Startups Retain Top Talent</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cyberstarts-launches-300m-liquidity-fund-to-help-startups-retain-top-talent/"
    },
    {
        "Title": "EU Unveils AI Code of Practice to Help Businesses Comply With Bloc’s Rules",
        "Link": "https://www.securityweek.com/eu-unveils-ai-code-of-practice-to-help-businesses-comply-with-blocs-rules/",
        "Summary": "<p>The EU code is voluntary and complements the EU’s AI Act, a comprehensive set of regulations that was approved last year and is taking effect in phases.</p>\n<p>The post <a href=\"https://www.securityweek.com/eu-unveils-ai-code-of-practice-to-help-businesses-comply-with-blocs-rules/\">EU Unveils AI Code of Practice to Help Businesses Comply With Bloc’s Rules</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/eu-unveils-ai-code-of-practice-to-help-businesses-comply-with-blocs-rules/"
    },
    {
        "Title": "McDonald’s Chatbot Recruitment Platform Exposed 64 Million Job Applications",
        "Link": "https://www.securityweek.com/mcdonalds-chatbot-recruitment-platform-leaked-64-million-job-applications/",
        "Summary": "<p>Two vulnerabilities in an internal API allowed unauthorized access to contacts and chats, exposing the information of 64 million McDonald’s applicants.</p>\n<p>The post <a href=\"https://www.securityweek.com/mcdonalds-chatbot-recruitment-platform-leaked-64-million-job-applications/\">McDonald&#8217;s Chatbot Recruitment Platform Exposed 64 Million Job Applications</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/mcdonalds-chatbot-recruitment-platform-leaked-64-million-job-applications/"
    },
    {
        "Title": "Critical Wing FTP Server Vulnerability Exploited",
        "Link": "https://www.securityweek.com/critical-wing-ftp-server-vulnerability-exploited/",
        "Summary": "<p>Wing FTP Server vulnerability CVE-2025-47812 can be exploited for arbitrary command execution with root or system privileges.</p>\n<p>The post <a href=\"https://www.securityweek.com/critical-wing-ftp-server-vulnerability-exploited/\">Critical Wing FTP Server Vulnerability Exploited</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/critical-wing-ftp-server-vulnerability-exploited/"
    },
    {
        "Title": "TikTok Faces Fresh European Privacy Investigation Over China Data Transfers",
        "Link": "https://www.securityweek.com/tiktok-faces-fresh-european-privacy-investigation-over-china-data-transfers/",
        "Summary": "<p>The Irish Data Privacy Commission announced that TikTok is facing a new European Union privacy investigation into user data sent to China.</p>\n<p>The post <a href=\"https://www.securityweek.com/tiktok-faces-fresh-european-privacy-investigation-over-china-data-transfers/\">TikTok Faces Fresh European Privacy Investigation Over China Data Transfers</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/tiktok-faces-fresh-european-privacy-investigation-over-china-data-transfers/"
    },
    {
        "Title": "July 2025 Breaks a Decade of Monthly Android Patches",
        "Link": "https://www.securityweek.com/july-2025-breaks-a-decade-of-monthly-android-patches/",
        "Summary": "<p>Since August 2015, Google has delivered a constant stream of monthly security patches for Android. Until July 2025.</p>\n<p>The post <a href=\"https://www.securityweek.com/july-2025-breaks-a-decade-of-monthly-android-patches/\">July 2025 Breaks a Decade of Monthly Android Patches</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/july-2025-breaks-a-decade-of-monthly-android-patches/"
    },
    {
        "Title": "Rowhammer Attack Demonstrated Against Nvidia GPU",
        "Link": "https://www.securityweek.com/rowhammer-attack-demonstrated-against-nvidia-gpu/",
        "Summary": "<p>Researchers demonstrated GPUHammer — a Rowhammer attack against GPUs — by degrading the accuracy of machine learning models.</p>\n<p>The post <a href=\"https://www.securityweek.com/rowhammer-attack-demonstrated-against-nvidia-gpu/\">Rowhammer Attack Demonstrated Against Nvidia GPU</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/rowhammer-attack-demonstrated-against-nvidia-gpu/"
    }
]