[
    {
        "Title": "Threat actors downgrade FIDO2 MFA auth in PoisonSeed phishing attack",
        "Link": "https://www.bleepingcomputer.com/news/security/threat-actors-downgrade-fido2-mfa-auth-in-poisonseed-phishing-attack/",
        "Summary": "A PoisonSeed phishing campaign is bypassing FIDO2 security key protections by abusing the cross-device sign-in feature in WebAuthn to trick users into approving login authentication requests from fake company portals. [...]",
        "Date": "2025-07-19",
        "Content": "A PoisonSeed phishing campaign is bypassing FIDO2 security key protections by abusing the cross-device sign-in feature in WebAuthn to trick users into approving login authentication requests from fake company portals.\nThe PoisonSeed threat actors are known to employ large-volume phishing attacks for financial fraud. In the past,\ndistributing emails containing crypto seed phrases\nused to drain cryptocurrency wallets.\nIn the recent phishing attack\nobserved by Expel\n, the PoisonSeed threat actors do not exploit a flaw in FIDO2's security but rather abuse the legitimate cross-device authentication feature.\nCross-device authentication is a WebAuthn feature that allows users to sign in on one device using a security key or authentication app on another device. Instead of requiring a physical connection, such as plugging in a security key, the authentication request is transmitted between devices via Bluetooth or a QR code scan.\nThe attack begins by directing users to a phishing site that impersonates corporate login portals, such as from Okta or Microsoft 365.\nWhen the user enters their credentials into the portal, the campaign uses an adversary-in-the-middle (AiTM) backend to silently log in with the submitted credentials on the legitimate login portal in real-time.\nThe user targeted in the attack normally would use their FIDO2 security keys to verify multi-factor authentication requests. However, the phishing backend instead tells the legitimate login portal to authenticate using cross-device authentication.\nThis causes the legitimate portal to generate a QR code, which is transmitted back to the phishing page and displayed to the user.\nWhen the user scans this QR code using their smartphone or authentication app, it approves the login attempt initiated by the attacker.\nPoisonSeed attack flow to bypass FIDO2 protections\nSource: Expel\nThis method effectively bypasses FIDO2 security key protections by allowing attackers to initiate a login flow that relies on cross-device authentication instead of the user's physical FIDO2 key.\nExpel warns that this attack does not exploit a flaw in the FIDO2 implementation, but instead abuses a legitimate feature that downgrades the FIDO key authentication process.\nTo mitigate the risk, Expel recommends the following defenses:\nLimiting geographic locations from which users are allowed to log in and establishing a registration process for individuals traveling.\nRoutinely check for the registration of unknown FIDO keys from unknown locations and uncommon security key brands.\nOrganizations can consider enforcing Bluetooth-based authentication as a requirement for cross-device authentication, which significantly reduces the effectiveness of remote phishing attacks.\nExpel also observed a separate incident where a threat actor registered their own FIDO key after compromising an account via what is believed to be phishing and resetting the password. However, this attack did not require any methods to trick the user, like a QR code.\nThis attack highlights how threat actors are finding ways to bypass phishing-resistant authentication by tricking users into completing login flows that bypass the need for physical interaction with a security key.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nThe MFA You Trust Is Lying to You – and Here's How Attackers Exploit It\nMicrosoft confirms auth issues affecting Microsoft 365 users\nGoogle Gemini flaw hijacks email summaries for phishing\nOvercoming Technical Barriers in Desktop and Application Virtualization\nFBI: Cybercriminals steal health data posing as fraud investigators"
    },
    {
        "Title": "Popular npm linter packages hijacked via phishing to drop malware",
        "Link": "https://www.bleepingcomputer.com/news/security/popular-npm-linter-packages-hijacked-via-phishing-to-drop-malware/",
        "Summary": "Popular JavaScript libraries eslint-config-prettier and eslint-plugin-prettier were hijacked this week and turned into malware droppers, in a supply chain attack achieved via targeted phishing and credential theft. [...]",
        "Date": "2025-07-19",
        "Content": "Popular JavaScript libraries were hijacked this week and turned into malware droppers, in a supply chain attack achieved via targeted phishing and credential theft.\nThe npm package\neslint-config-prettier\n, downloaded over 30 million times weekly, was compromised after its maintainer fell victim to a phishing attack. Other packages, namely\neslint-plugin-prettier\n,\nsynckit\n,\n@pkgr/core\n, and\nnapi-postinstall\nfrom the same maintainer, were also targeted.\nThe attacker(s) used stolen credentials to publish multiple unauthorized versions of the packages with malicious code to infect Windows machines.\nMaintainer phished, libraries compromised\nOn July 18th, developers began noticing unusual behavior after installing versions 8.10.1, 9.1.1, 10.1.6, and 10.1.7 of eslint-config-prettier. These versions were published to the npm registry but had no corresponding changes in the GitHub repository that'd corroborate the releases, raising immediate suspicion within the open-source community.\nLibraries like eslint-config-prettier and eslint-plugin-prettier make it easier for developers to work with Prettier and ESLint by ensuring that the code formatting rules are consistenly styled across the project without conflicts or rendundant linting.\nDeveloper Dasa Paddock initially raised a GitHub\nissue\nin the project's repository shedding light on the matter and community members quickly chimed in.\nShortly afterward, the package's maintainer, JounQin,\nconfirmed\nthat he had fallen victim to a phishing attack. This allowed an unauthorized party to gain access to his npm token and publish the compromised versions.\n\"It's this phishing email,\" wrote JounQin, sharing a screenshot of a convincing \"Verify your account\" email he had received:\nPhishing email received by npm library's maintainer\n(JounQin)\nThe email has been spoofed to appear to originate from \"support@npmjs.com,\" but the link in it leads the user to an illicit\nnpnjs[.]com\ndomain.\n\"I've deleted that npm token and will publish a new version ASAP,\" stated JounQin.\n\"Thanks all, and sorry for my negligence,\" continued writing the maintainer in the same thread.\nMalicious postinstall script runs a Windows DLL\nIn the malicious versions, an npm\npostinstall\nscript \"install.js\" is configured to run as soon as the package is installed.\nThis \"install.js\" contains a suspicious function\nlogDiskSpace()\n, which, contrary to its name isn't concerned with disk space monitoring. Instead, the function attempts to execute the DLL \"node-gyp.dll\" bundled within the package, via the rundll32 Windows system process.\nMalicious function in the install.js file\n(BleepingComputer)\nAt the time of writing, the DLL, a recognized trojan, has\na 19/72 detection score\non VirusTotal, which means it is still being missed by a majority of antivirus engines.\nWhat should you do?\nDo not install the following versions of the affected packages:\neslint-config-prettier\nversions 8.10.1, 9.1.1, 10.1.6, and 10.1.7\n.\neslint-plugin-prettier\nversions\n4.2.2 and 4.2.3.\nsynckit\nversion\n0.11.9\n@pkgr/core\nversion\n0.2.8\nnapi-postinstall\nversion\n0.3.1\nVerify your\npackage-lock.json\nor\nyarn.lock\nfiles for references to these versions.\nIf you deployed builds after July 18th, check CI logs and runtime environments for signs of compromise, especially on Windows machines.\nConsider rotating any secrets that may have been exposed during affected build processes.\nThe maintainer additionally marked the affected versions as \"deprecated\" on the npmjs registry. Additionally, a\nGitHub user cautioned\nthat any other packages published by the maintainer also be checked for potential signs of tampering.\nCompromised versions marked deprecated on npmjs\n(BleepingComputer)\nThe compromise follows a series of similar social engineering attacks that have targeted developers of popular libraries in recent times.\nIn March,\nmore than ten widely used npm libraries\nwere compromised and turned into info-stealers. Last month,\n17 Gluestack packages\nwith over a million weekly downloads were hijacked to deploy a Remote Access Trojan (RAT).\nAs the open-source ecosystem largely operates on trust, incidents like these underscore the fragility of supply chain security and the importance of maintainer security. One wrong click is enough to put millions of users at risk.\nUpdate, 19-Jul-2025 12:42 PM ET: Added names of additional packages impacted.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nNorth Korean XORIndex malware hidden in 67 malicious npm packages\nWordPress Gravity Forms developer hacked to push backdoored plugins\nMalware found in NPM packages with 1 million weekly downloads\nDozens of malicious packages on NPM collect host and network data\nWindows 11 now uses JScript9Legacy engine for improved security"
    },
    {
        "Title": "ChatGPT\"s GPT-5-reasoning-alpha model spotted ahead of launch",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpts-gpt-5-reasoning-alpha-model-spotted-ahead-of-launch/",
        "Summary": "GPT-5 might be just a few days or weeks away, as we've spotted references to a new model called gpt-5-reasoning-alpha-2025-07-13. [...]",
        "Date": "2025-07-19",
        "Content": "GPT-5 might be just a few days or weeks away, as we've spotted references to a new model called gpt-5-reasoning-alpha-2025-07-13.\nAs\nspotted\non X, OpenAI is testing a model called \"gpt-5-reasoning-alpha-2025-07-13.\"\nThis model was finalised on the 13th of July, and it appears to be the final round of testing.\n\"Models: openai/gpt-5-reasoning-alpha-2025-07-13: reasoning_effort: high,\" one of the code references read.\nAlexander Wei, a researcher at OpenAI, recently confirmed that GPT-5 is on its way.\nOther researchers have also dropped hints that GPT-5 will combine breakthroughs from all models to create a unified model.\nWe also have reasons to believe that GPT-5 could deliver shockwave in the industry, but there's another model that might be more interesting.\nBleepingComputer understands that OpenAI is testing o3-alpha, which is better than o3 and o3-pro in coding and front-end designing.\nOpenAI models have always performed poorly when it comes to frontend designing, but that might change with o3-alpha.\nIt's also possible that GPT-5 will ship with o3-alpha capabilities we spotted earlier.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nOpenAI: GPT-5 is coming, \"we'll see\" if it creates a shockwave\nOpenAI says GPT-5 will unify breakthroughs from different models\nLeaks hint at Operator-like tool in ChatGPT ahead of GPT-5 launch\nOpenAI is hopeful GPT-5 will compete a little more\nNew ChatGPT o3-alpha model hints at coding upgrade"
    },
    {
        "Title": "OpenAI, Anthropic, Google may disrupt education market with new AI tools",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-anthropic-google-may-disrupt-education-market-with-new-ai-tools/",
        "Summary": "AI companies could soon disrupt the education market with their new AI-based learning tools for students. [...]",
        "Date": "2025-07-19",
        "Content": "AI companies could soon disrupt the education market with their new AI-based learning tools for students.\nBleepingComputer recently\nreported\nthat OpenAI is working on a Study Together feature for ChatGPT.\nThis would allow ChatGPT to teach students a wide range of topics and then offer quizzes.\nThe idea is to create an engaging and interactive \"study together\" experience where students ask questions and ChatGPT puts in effort to teach them.\nBut it turns out that OpenAI isn't the only AI company pursuing this industry.\nClaude maker Anthropic is also building a new Study Projects feature.\nAs\nspotted\non X, Claude's Study Projects will guide your learning process instead of just giving answers. You can adjust these instructions in the project anytime.\n\"A project for studying your course materials, where Claude helps visualize key concepts, build comprehensive study guides, and tutor you according to your learning needs,\" the description of the feature reads.\nIn addition, Google is testing a similar feature called \"Guided Learning for Gemini.\"\nWhen you use Guided Learning, Gemini will guide your learning process instead of just giving answers.\nGoogle's move comes after the company made the $20 Gemini AI Pro subscription free for students.\nThese tools may not replace a real human professor, but they could aid in student learning and potentially disrupt the online education market.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nChatGPT will analyze Gmail emails, manage schedule on Google Calendar\nChatGPT\"s GPT-5-reasoning-alpha model spotted ahead of launch\nNew ChatGPT o3-alpha model hints at coding upgrade\nOpenAI: GPT-5 is coming, \"we'll see\" if it creates a shockwave\nOpenAI's image model gets built-in style feature on ChatGPT"
    }
]