[
    {
        "Title": "EncryptHub Targets Web3 Developers Using Fake AI Platforms to Deploy Fickle Stealer Malware",
        "Link": "https://thehackernews.com/2025/07/encrypthub-targets-web3-developers.html",
        "Summary": "The financially motivated threat actor known as EncryptHub (aka LARVA-208 and Water Gamayun) has been attributed to a new campaign that's targeting Web3 developers to infect them with information stealer malware.\n\"LARVA-208 has evolved its tactics, using fake AI platforms (e.g., Norlax AI, mimicking Teampilot) to lure victims with job offers or portfolio review requests,\" Swiss cybersecurity",
        "Date": "2025-07-20",
        "Content": "The financially motivated threat actor known as\nEncryptHub\n(aka LARVA-208 and Water Gamayun) has been\nattributed\nto a new campaign that's targeting Web3 developers to infect them with information stealer malware.\n\"LARVA-208 has evolved its tactics, using fake AI platforms (e.g., Norlax AI, mimicking Teampilot) to lure victims with job offers or portfolio review requests,\" Swiss cybersecurity company PRODAFT said in a statement shared with The Hacker News.\nWhile the group has a\nhistory\nof deploying ransomware, the latest findings demonstrate an evolution of its tactics and a diversification of its monetization methods by using stealer malware to harvest data from cryptocurrency wallets.\nEncryptHub's focus on Web3 developers isn't random—these individuals often manage crypto wallets, access to smart contract repositories, or sensitive test environments. Many operate as freelancers or work across multiple decentralized projects, making them harder to protect with traditional enterprise security controls. This decentralized, high-value developer community presents an ideal target for attackers looking to monetize quickly without triggering centralized defenses.\nThe attack chains entail directing prospective targets to deceptive artificial intelligence (AI) platforms and tricking them into clicking on purported meeting links within these sites.\nMeeting links to these sites are sent to developers who follow Web3 and Blockchain-related content via platforms like X and Telegram under the pretext of a job interview or portfolio discussion. The threat actors have also been found sending the meeting links to people who applied for positions posted by them on a Web3 job board called Remote3.\nWhat's interesting is the approach used by the attackers to sidestep security warnings issued by Remote3 on their site. Given that the service explicitly warns job seekers against downloading unfamiliar video conferencing software, the attackers conduct an initial conversation via Google Meet, during which they instruct the applicant to resume the interview on\nNorlax AI\n.\nRegardless of the method used, once the victim clicks on the meeting link, they are asked to enter their email address and invitation code, following which they are served a fake error message about outdated or missing audio drivers.\nClicking the message leads to the download of malicious software disguised as a genuine Realtek HD Audio Driver, which executes PowerShell commands to retrieve and deploy the\nFickle Stealer\n. The information gathered by the stealer malware is transmitted to an external server codenamed SilentPrism.\n\"The threat actors distribute infostealers like Fickle through fake AI applications, successfully harvesting cryptocurrency wallets, development credentials, and sensitive project data,\" PRODAFT said.\n\"This latest operation suggests a shift toward alternative monetization strategies, including the exfiltration of valuable data and credentials for potential resale or exploitation in illicit markets.\"\nThe development comes as Trustwave SpiderLabs detailed a new ransomware strain called\nKAWA4096\nthat \"follows the style of the\nAkira\nransomware group, and a ransom note format similar to\nQilin's\n, likely an attempt to further enrich their visibility and credibility.\"\nKAWA4096, which first emerged in June 2025, is said to have targeted 11 companies, with the most number of targets located in the United States and Japan. The initial access vector used in the attacks is not known.\nA notable feature of KAWA4096 is its ability to encrypt files on shared network drives and the use of multithreading to increase operational efficiency and speed up the scanning and encryption process.\n\"After identifying valid files, the ransomware adds them to a shared queue,\" security researchers Nathaniel Morales and John Basmayor\nsaid\n. \"This queue is processed by a pool of worker threads, each responsible for retrieving file paths and passing it on to the encryption routine. A semaphore is used for synchronization among threads, ensuring efficient processing of the file queue.\"\nAnother new entrant to the ransomware landscape is Crux, which claims to be part of the\nBlackByte\ngroup and has been deployed in the wild in three incidents detected on July 4 and 13, 2025, per Huntress.\nIn one of the incidents, the threat actors have been found to leverage valid credentials via RDP to obtain a foothold in the target network. Common to all the attacks is the use of legitimate Windows tools like svchost.exe and bcdedit.exe to conceal malicious commands and modify boot configuration so as to inhibit system recovery.\n\"The threat actor also clearly has a preference for legitimate processes like bcdedit.exe and svchost.exe, so continual monitoring for suspicious behavior using these processes via endpoint detection and response (EDR) can help suss out threat actors in your environment,\" Huntress\nsaid\n.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Critical Unpatched SharePoint Zero-Day Actively Exploited, Breaches 75+ Company Servers",
        "Link": "https://thehackernews.com/2025/07/critical-microsoft-sharepoint-flaw.html",
        "Summary": "A critical security vulnerability in Microsoft SharePoint Server has been weaponized as part of an \"active, large-scale\" exploitation campaign.\nThe zero-day flaw, tracked as CVE-2025-53770 (CVSS score: 9.8), has been described as a variant of CVE-2025-49706 (CVSS score: 6.3), a spoofing bug in Microsoft SharePoint Server that was addressed by the tech giant as part of its July 2025 Patch Tuesday",
        "Date": "2025-07-20",
        "Content": "A critical security vulnerability in Microsoft SharePoint Server has been weaponized as part of an \"active, large-scale\" exploitation campaign.\nThe zero-day flaw, tracked as\nCVE-2025-53770\n(CVSS score: 9.8), has been described as a variant of\nCVE-2025-49706\n(CVSS score: 6.3), a spoofing bug in Microsoft SharePoint Server that was\naddressed\nby the tech giant as part of its July 2025 Patch Tuesday updates.\n\"Deserialization of untrusted data in on-premises Microsoft SharePoint Server allows an unauthorized attacker to execute code over a network,\" Microsoft\nsaid\nin an advisory released on July 19, 2025.\nThe Windows maker further noted that it's preparing and fully testing a comprehensive update to resolve the issue. It credited Viettel Cyber Security for discovering and reporting the flaw through Trend Micro's Zero Day Initiative (ZDI).\nIn a separate alert issued Saturday, Redmond\nsaid\nit's aware of active attacks targeting on-premises SharePoint Server customers, but emphasized that SharePoint Online in Microsoft 365 is not impacted.\nAttackers exploiting this bug aren't just injecting arbitrary code—they're abusing how SharePoint deserializes untrusted objects, allowing them to execute commands even before authentication takes place. Once inside, they can forge trusted payloads using stolen machine keys to persist or move laterally, often blending in with legitimate SharePoint activity—making detection and response especially difficult without deep endpoint visibility.\nIn the absence of an official patch, Microsoft is urging customers to\nconfigure Antimalware Scan Interface (AMSI)\nintegration in SharePoint and deploy Defender AV on all SharePoint servers.\nIt's worth noting that AMSI integration is enabled by default in the September 2023 security update for SharePoint Server 2016/2019 and the Version 23H2 feature update for SharePoint Server Subscription Edition.\nFor those who cannot enable AMSI, it's advised that the SharePoint Server is disconnected from the internet until a security update is available. For added protection, users are recommended to deploy Defender for Endpoint to detect and block post-exploit activity.\nThe disclosure comes as\nEye Security\nand\nPalo Alto Networks Unit 42\nwarned of attacks chaining CVE-2025-49706 and\nCVE-2025-49704\n(CVSS score: 8.8), a code injection flaw in SharePoint, to facilitate arbitrary command execution on susceptible instances. The exploit chain has been codenamed\nToolShell\n.\nBut given that CVE-2025-53770 is a \"variant\" of CVE-2025-49706, it's suspected that these attacks are related.\nEye Security said the wide-scale attacks it identified leverage CVE-2025-49706 to POST a remote code execution payload exploiting CVE-2025-49704. \"We believe that the finding that adding \"_layouts/SignOut.aspx\" as HTTP referer, makes CVE-2025-49706 into CVE-2025-53770,\" it said.\nIt's worth mentioning here that the ZDI has\ncharacterized\nCVE-2025-49706 as an authentication bypass vulnerability that stems from how the application handles HTTP Referer header provided to the ToolPane endpoint (\"/_layouts/15/ToolPane.aspx\").\nThe malicious activity essentially involves delivering ASPX payloads via PowerShell, which is then used to steal the SharePoint server's\nMachineKey\nconfiguration, including the ValidationKey and DecryptionKey, to maintain persistent access.\nThe Dutch cybersecurity company said these keys are crucial for generating valid __VIEWSTATE payloads, and that gaining access to them effectively turns any authenticated SharePoint request into a remote code execution opportunity.\n\"We are still identifying mass exploit waves,\" Eye Security CTO Piet Kerkhofs told The Hacker News in a statement. \"This will have a huge impact as adversaries are laterally moving using this remote code execution with speed.\"\nMore than 85 SharePoint servers globally have been identified as compromised with the malicious web shell as of writing. These hacked servers belong to 29 organizations, including multinational firms and government entities.\n\"__VIEWSTATE is a core mechanism in ASP.NET that stores state information between requests,\" watchTowr CEO Benjamin Harris said. \"It is cryptographically signed and optionally encrypted using the ValidationKey and DecryptionKey.\"\n\"With these keys in hand, attackers can craft forged __VIEWSTATE payloads that SharePoint will accept as valid—enabling seamless remote code execution. This approach makes remediation particularly difficulta—typical patch would not automatically rotate these stolen cryptographic secrets leaving organizations vulnerable even after they patch.\"\nHarris also pointed out that it's not yet clear whether some of the activity associated with CVE-2025-53770 may have been overlapping with or misattributed to CVE-2025-49704 or CVE-2025-49706.\nThe U.S. Cybersecurity and Infrastructure Security Agency (CISA), in an\nalert\n, said it's aware of active exploitation of CVE-2025-53770, which enables unauthenticated access to SharePoint systems and arbitrary code execution over the network.\n\"CISA was made aware of the exploitation by a trusted partner and we reached out to Microsoft immediately to take action,\" said Acting Executive Assistant Director for Cybersecurity, Chris Butera. \"Microsoft is responding quickly, and we are working with the company to help notify potentially impacted entities about recommended mitigations. CISA encourages all organizations with on-premise Microsoft Sharepoint servers to take immediate recommended action.\"\n\"This is an important example of operational collaboration in action for homeland and national security. This type of rapid identification and response to cyber threats is possible because of the trust and cooperation that has been built between the research community, technology providers, and CISA.\"\nIt's worth noting that Microsoft has yet to update its advisories for CVE-2025-49706 and CVE-2025-49704 to reflect active exploitation. We have also reached out to the company for further clarification, and we will update the story if we hear back.\n(The story is developing. Please check back for more details.)\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Malware Injected into 5 npm Packages After Maintainer Tokens Stolen in Phishing Attack",
        "Link": "https://thehackernews.com/2025/07/malware-injected-into-6-npm-packages.html",
        "Summary": "Cybersecurity researchers have alerted to a supply chain attack that has targeted popular npm packages via a phishing campaign designed to steal the project maintainers' npm tokens.\nThe captured tokens were then used to publish malicious versions of the packages directly to the registry without any source code commits or pull requests on their respective GitHub repositories.\nThe list of affected",
        "Date": "2025-07-20",
        "Content": "Cybersecurity researchers have alerted to a supply chain attack that has targeted popular npm packages via a phishing campaign designed to steal the project maintainers' npm tokens.\nThe captured tokens were then used to publish malicious versions of the packages directly to the registry without any source code commits or pull requests on their respective GitHub repositories.\nThe list of affected packages and their rogue versions,\naccording\nto Socket, is listed below -\neslint-config-prettier (versions 8.10.1, 9.1.1, 10.1.6, and 10.1.7)\neslint-plugin-prettier (versions 4.2.2 and 4.2.3)\nsynckit (version 0.11.9)\n@pkgr/core (version 0.2.8)\nnapi-postinstall (version 0.3.1)\n\"The injected code attempted to execute a DLL on Windows machines, potentially allowing remote code execution,\" the software supply chain security firm said.\nThe development comes in the aftermath of a\nphishing campaign\nthat has been found to send email messages impersonating npm in order to trick project maintainers into clicking on a typosquatted link (\"npnjs[.]com,\" as opposed to \"npmjs[.]com\") that harvested their credentials.\nThe\ndigital missives\n, with the subject line \"Please verify your email address,\" spoofed a legitimate email address associated with npm (\"support@npmjs[.]org\"), urging recipients to validate their email address by clicking on the embedded link.\nThe bogus landing page to which the victims are redirected to, per Socket, is a clone of the legitimate npm login page that's designed to capture their login information.\nDevelopers who use the affected packages are advised to cross-check the versions installed and rollback to a safe version. Project maintainers are recommended to turn on two-factor authentication to secure their accounts, and use scoped tokens instead of passwords for publishing packages.\n\"This incident shows how quickly phishing attacks on maintainers can escalate into ecosystem-wide threats,\" Socket said.\nThe findings coincide with an unrelated campaign that has flooded npm with 28 packages containing protestware functionality that can disable mouse-based interaction on websites with a Russian or Belarusian domain. They are also engineered to play the Ukrainian national anthem on a loop.\nHowever, the attack only works when the site visitor has their browser language settings set to Russian and, in some cases, the same website is visited a second time, thereby ensuring that only repeat visitors are targeted. The activity marks an expansion of a campaign that was\nfirst flagged\nlast month.\n\"This protestware underscores that actions taken by developers can propagate unnoticed in nested dependencies and may take days or weeks to manifest,\" security researcher Olivia Brown\nsaid\n.\nArch Linux Removes 3 AUR Packages that Installed Chaos RAT Malware\nIt also comes as the Arch Linux team said it has pulled three malicious AUR packages that were uploaded to the Arch User Repository (\nAUR\n) and harbored hidden functionality to install a\nremote access trojan\ncalled\nChaos RAT\nfrom a now-removed\nGitHub repository\n.\nThe affected packages are: \"\nlibrewolf-fix-bin\n,\" \"\nfirefox-patch-bin\n,\" and \"\nzen-browser-patched-bin\n.\" They were published by a user named \"danikpapas\" on July 16, 2025.\n\"These packages were installing a script coming from the same GitHub repository that was identified as a Remote Access Trojan (RAT),\" the maintainers\nsaid\n. \"We strongly encourage users that may have installed one of these packages to remove them from their system and to take the necessary measures in order to ensure they were not compromised.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Hackers Exploit Critical CrushFTP Flaw to Gain Admin Access on Unpatched Servers",
        "Link": "https://thehackernews.com/2025/07/hackers-exploit-critical-crushftp-flaw.html",
        "Summary": "A newly disclosed critical security flaw in CrushFTP has come under active exploitation in the wild. Assigned the CVE identifier CVE-2025-54309, the vulnerability carries a CVSS score of 9.0.\n\"CrushFTP 10 before 10.8.5 and 11 before 11.3.4_23, when the DMZ proxy feature is not used, mishandles AS2 validation and consequently allows remote attackers to obtain admin access via HTTPS,\" according to",
        "Date": "2025-07-20",
        "Content": "A newly disclosed critical security flaw in CrushFTP has come under active exploitation in the wild. Assigned the CVE identifier\nCVE-2025-54309\n, the vulnerability carries a CVSS score of 9.0.\n\"CrushFTP 10 before 10.8.5 and 11 before 11.3.4_23, when the DMZ proxy feature is not used, mishandles AS2 validation and consequently allows remote attackers to obtain admin access via HTTPS,\" according to a\ndescription\nof the vulnerability in the NIST's National Vulnerability Database (NVD).\nCrushFTP, in an advisory, said it first detected the zero-day exploitation of the vulnerability in the wild on July 18, 2025, 9 a.m. CST, although it acknowledged that it may have been weaponized much earlier.\n\"The attack vector was HTTP(S) for how they could exploit the server,\" the company\nsaid\n. \"We had fixed a different issue related to AS2 in HTTP(S) not realizing that a prior bug could be used like this exploit was. Hackers apparently saw our code change, and figured out a way to exploit the prior bug.\"\nCrushFTP is widely used in government, healthcare, and enterprise environments to manage sensitive file transfers, making administrative access especially dangerous. A compromised instance can allow attackers to exfiltrate data, inject backdoors, or pivot into internal systems that rely on the server for trusted exchange. Without DMZ isolation, the exposed instance becomes a single point of failure.\nThe company said the unknown threat actors behind the malicious activity managed to reverse engineer its source code and discovered the new flaw to target devices that are yet to be updated to the latest versions. It's believed that CVE-2025-54309 was present in CrushFTP builds prior to July 1.\nCrushFTP has also released the following indicators of compromise (IoCs) -\nDefault user has admin access\nLong random user IDs created (e.g., 7a0d26089ac528941bf8cb998d97f408m)\nOther new usernames created with admin access\nThe file \"MainUsers/default/user.xml\" was recently modified and has a \"last_logins\" value in it\nButtons from the end user web interface disappeared, and users previously identified as regular users now have an Admin button\nSecurity teams investigating possible compromise should review user.xml modification times, correlate admin login events with public IPs, and audit permission changes on high-value folders. It's also essential to look for suspicious patterns in access logs tied to newly created users or unexplained admin role escalations, which are typical signs of post-exploitation behavior in real-world breach scenarios.\nAs mitigations, the company recommends that users restore a prior default user from the backup folder, as well as review upload/download reports for any signs of suspicious transfers. Other steps include -\nLimit the IP addresses used for administrative actions\nAllowlist IPs that can connect to the CrushFTP server\nSwitch to DMZ CrushFTP instance for enterprise use\nEnsure automatic updates are enabled\nAt this stage, the exact nature of the attacks exploiting the flaw is not known. Earlier this April, another security defect in the same solution (\nCVE-2025-31161\n, CVSS score: 9.8) was weaponized to deliver the MeshCentral agent and other malware.\nLast year, it also emerged that a second critical vulnerability impacting CrushFTP (CVE-2024-4040, CVSS score: 9.8) was\nleveraged\nby threat actors to target multiple U.S. entities.\nWith multiple high-severity CVEs exploited over the past year, CrushFTP has emerged as a recurring target in advanced threat campaigns. Organizations should consider this pattern as part of broader threat exposure assessments, alongside patch cadence, third-party file transfer risks, and zero-day detection workflows involving remote access tools and credential compromise.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft SharePoint zero-day exploited in RCE attacks, no patch available",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-sharepoint-zero-day-exploited-in-rce-attacks-no-patch-available/",
        "Summary": "Critical zero-day vulnerabilities in Microsoft SharePoint, tracked as CVE-2025-53770 and CVE-2025-53771, have been actively exploited since at least July 18th, with no patch available and at least 85 servers already compromised worldwide. [...]",
        "Date": "2025-07-20",
        "Content": "Update 7/20/25: Added that there are actually two zero-days exploited and that Microsoft released a security update for SharePoint Subscription Edition.\nCritical zero-day vulnerabilities in Microsoft SharePoint, tracked as CVE-2025-53770 and CVE-2025-53771, have been actively exploited since at least July 18th, with no patch available and at least 85 servers already compromised worldwide.\nIn May, Viettel Cyber Security researchers chained two Microsoft SharePoint flaws,\nCVE-2025-49706\nand\nCVE-2025-49704\n, in a \"ToolShell\" attack demonstrated at Pwn2Own Berlin to achieve remote code execution.\nWhile Microsoft patched both ToolShell flaws as part of the\nJuly Patch Tuesday\n, it is now warning that threat actors were able to bypass the fixes with new exploits.\nThese new vulnerabilities are tracked as\nCVE-2025-53770\n(bypasses CVE-2025-49704) and\nCVE-2025-53771\n(CVE-2025-49706), and are actively exploited attacks against on-premise SharePoint servers.\n\"Microsoft is aware of active attacks targeting on-premises SharePoint Server customers by exploiting vulnerabilities partially addressed by the July Security Update,\"\nwarns a new Microsoft blog post\n.\n\"These vulnerabilities apply to on-premises SharePoint Servers only. SharePoint Online in Microsoft 365 is not impacted.\"\nMicrosoft has now released the KB5002768 update for Microsoft SharePoint Subscription Edition to fix these flaws. However, they are still working on security updates for Microsoft SharePoint 2019 and 2016.\n\"Yes, the update for CVE-2025-53770 includes more robust protections than the update for CVE-2025-49704. The update for CVE-2025-53771 includes more robust protections than the update for CVE-2025-49706,\" reads Microsoft's updated CVE advisories.\nFor SharePoint servers that do not currently have a patch or are unable to apply them immediatly, Microsoft recommends that customers enable\nAMSI integration\nin SharePoint and deploy Defender AV on all SharePoint servers.\nMicrosoft AMSI (Antimalware Scan Interface) is a security feature that allows applications and services to pass potentially malicious content to an installed antivirus solution for real-time scanning. It's commonly used to inspect scripts and code in memory, helping detect and block obfuscated or dynamic threats.\nMicrosoft says that enabling these mitigations will prevent unauthenticated attacks from exploiting the flaw.\nThe company notes that this feature is enabled by default since the September 2023 security updates for SharePoint Server 2016/2019 and the Version 23H2 feature update for SharePoint Server Subscription Edition.\nMicrosoft also suggests that customers rotate their SharePoint Server ASP.NET machine keys after applying the security updates or enabling AMSI, as doing so will prevent the threat actors from executing commands on previously compromised services.\nSharePoint admins can rotate machine keys using one of the two methods below:\nManually via PowerShell\nTo update the machine keys using PowerShell, use the Update-SPMachineKey cmdlet.\nManually via Central Admin\nTrigger the Machine Key Rotation timer job by performing the following steps:\nNavigate to the\nCentral Administration\nsite.\nGo to\nMonitoring\n->\nReview job definition.\nSearch for\nMachine Key Rotation Job\nand select\nRun Now.\nAfter the rotation has completed,\nrestart IIS\non all SharePoint servers using iisreset.exe.\nIf you cannot enable AMSI, Microsoft says that SharePoint servers should be disconnected from the internet until a security update is released.\nTo detect if a SharePoint server has been compromised, admins can check if the\nC:\\PROGRA~1\\COMMON~1\\MICROS~1\\WEBSER~1\\16\\TEMPLATE\\LAYOUTS\\spinstall0.aspx\nexists.\nMicrosoft also shared the following Microsoft 365 Defender query that can be used to check for this file:\neviceFileEvents\r\n| where FolderPath has \"MICROS~1\\\\WEBSER~1\\\\16\\\\TEMPLATE\\\\LAYOUTS\"\r\n| where FileName =~ \"spinstall0.aspx\"\r\nor FileName has \"spinstall0\"\r\n| project Timestamp, DeviceName, InitiatingProcessFileName, InitiatingProcessCommandLine, FileName, FolderPath, ReportId, ActionType, SHA256\r\n| order by Timestamp desc\nAfter publishing this article, CISA added the Microsoft SharePoint CVE-2025-53770 vulnerability to its Known Exploited Vulnerability catalog, giving federal agencies one day to apply patches when they are released.\n\"CISA was made aware of the exploitation by a trusted partner and we reached out to Microsoft immediately to take action,\" CISA's Acting Executive Assistant Director for Cybersecurity Chris Butera told BleepingComputer.\n\"Microsoft is responding quickly, and we are working with the company to help notify potentially impacted entities about recommended mitigations. CISA encourages all organizations with on-premise Microsoft Sharepoint servers to take immediate recommended action.\"\nBleepingComputer contacted Microsoft last night to ask when exploitation had started but was told they have nothing further to share other than their blog post.\nFurther IOCs and technical information from other cybersecurity firms are shared below.\nExploited in RCE attacks\nThe Microsoft SharePoint zero-day attacks were\nfirst identified\nby Dutch cybersecurity firm Eye Security, which told BleepingComputer that over 29 organizations have already been compromised by the attacks.\nEye Security first observed attacks on July 18th after receiving an alert from one of their customers' EDR agents that a suspicious process tied to an uploaded malicious .aspx file was launched.\nIIS logs showed that a POST request was made to\n_layouts/15/ToolPane.aspx\nwith an HTTP referer of /_layouts/SignOut.aspx.\nUpon investigation, it was determined that threat actors have weaponized the Pwn2Own ToolShell vulnerability soon after CODE WHITE GmbH replicated the exploit and Soroush Dalili\nshared further technical details\nabout the web referer last week.\n\"We have reproduced 'ToolShell', the unauthenticated exploit chain for CVE-2025-49706 + CVE-2025-49704 used by @_l0gg  to pop SharePoint at #Pwn2Own Berlin 2025, it's really just one request!,\"\nposted CODE WHITE GmbH to X\n.\nDemonstration of the created Microsoft SharePoint ToolShell exploit\nSource: CODE WHITE GmbH\nAs part of the exploitation, attackers upload a file named \"spinstall0.aspx,\" which is used to steal the Microsoft SharePoint server's MachineKey configuration, including the ValidationKey and DecryptionKey.\n\"Now, with the ToolShell chain (CVE-2025-49706 + CVE-2025-49704), attackers appear to extract the ValidationKey directly from memory or configuration,\" explains Eye Security.\n\"Once this cryptographic material is leaked, the attacker can craft fully valid, signed __VIEWSTATE payloads using a tool called ysoserial as shown in the example below.\n\"Using ysoserial the attacker can generate it's own valid SharePoint tokens for RCE.\"\nMalicious spinstall0.aspx used to steal ValidationKey\nSource: BleepingComputer\nViewState is used by ASP.NET, which powers SharePoint, to maintain the state of web controls between web requests. However, if it's not adequately protected or if the server's ValidationKey is exposed,  the ViewState can be tampered with to inject malicious code that executes on the server when deserialized.\nEye Security CTO Piet​​​​ Kerkhofs told BleepingComputer that they have conducted scans of the internet for compromised servers and found 54 organizations impacted in the attacks.\n\"Although we identified 85+ compromised SharePoint Servers worldwide, we were able to cluster them down to the organizations affected,\" Kerkhofs told BleepingComputer.\nOf those 54 organisations, Eye Security says there are several multi-nationals and national government entities who were breached.\nSome of these include a private university in California state, a private energy sector operator in California state, a federal government health org, a private AI tech company, a private Fintech company in New York state, and a state government org in Florida.\nKerkhofs also told BleepingComputer that some firewall vendors are successfully blocking CVE-2025-49704 payloads attached to HTTP POST requests. However, Kerkhofs warned that if the attackers can bypass the signature, many more SharePoint servers will likely be hit.\nThe following IOCs were shared to help defenders determine if their SharePoint servers were compromised:\nExploitation from IP address\n107.191.58[.]76\nseen by Eye Security on July 18th\nExploitation from IP address\n104.238.159[.]149\nseen by Eye Security on July 19th.\nExploitation from IP address\n96.9.125[.]147\nseen\nby Palo Alto Networks.\nCreation of\nC:\\PROGRA~1\\COMMON~1\\MICROS~1\\WEBSER~1\\16\\TEMPLATE\\LAYOUTS\\spinstall0.aspx\nfile.\nIIS logs showing a POST request to\n_layouts/15/ToolPane.aspx?DisplayMode=Edit&a=/ToolPane.aspx\nand a HTTP referer of\n_layouts/SignOut.aspx\n.\nIf the presence of any of these IOCs is detected in IIS logs or the file system, administrators should assume their server has been compromised and immediately take it offline.\nFurther investigations should be conducted to determine if the threat actors spread further to other devices.\nThis is a developing story and will be updated as new information becomes available.\nUpdate 7/20/25 5:44 PM ET: Updated to up the count of breached organizations and that CISA is giving agencies one day to apply the upcoming security update.\nUpdate 7/20/25 6:20 PM ET: Added examples of some of the orgs breached in the SharePoint attacks.\nUpdate 7/20/25 7:12 PM ET: Added information that there are actually two zero-days exploited, both bypasses for Microsoft's original fixes. Also added that the security update for SharePoint Subscription edition has been released.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nNew CrushFTP zero-day exploited in attacks to hijack servers\nNew Fortinet FortiWeb hacks likely linked to public RCE exploits\nMicrosoft July 2025 Patch Tuesday fixes one zero-day, 137 flaws\nGoogle fixes fourth actively exploited Chrome zero-day of 2025\nHackers exploited Windows WebDav zero-day to drop malware"
    },
    {
        "Title": "HPE warns of hardcoded passwords in Aruba access points",
        "Link": "https://www.bleepingcomputer.com/news/security/hpe-warns-of-hardcoded-passwords-in-aruba-access-points/",
        "Summary": "Hewlett-Packard Enterprise (HPE) is warning of hardcoded credentials in Aruba Instant On Access Points that allow attackers to bypass normal device authentication and access the web interface. [...]",
        "Date": "2025-07-20",
        "Content": "Hewlett-Packard Enterprise (HPE) is warning of hardcoded credentials in Aruba Instant On Access Points that allow attackers to bypass normal device authentication and access the web interface.\nAruba Instant On Access Points are compact, plug-and-play wireless (Wi-Fi) devices, designed primarily for small to medium-sized businesses, offering enterprise-grade features (guest networks, traffic segmentation) with cloud/mobile app management.\nThe security issue, tracked as CVE-2025-37103 and rated “critical” (CVSS v3.1 score: 9.8), impacts Instant On Access Points running firmware version 3.2.0.1 and below.\n“Hardcoded login credentials were found in HPE Networking Instant On Access Points, allowing anyone with knowledge of it to bypass normal device authentication,”\nexplained HPE in the bulletin\n.\n“Successful exploitation could allow a remote attacker to gain administrative access to the system.”\nAs the administrative credentials are hardcoded in the firmware, discovering them is trivial for knowledgeable actors.\nBy accessing the web interface as administrators, attackers may change the access point’s settings, reconfigure security, install backdoors, perform stealthy surveillance by capturing traffic, or even attempt lateral movement.\nThe vulnerability was discovered by a Ubisectech Sirius Team security researcher using the alias ZZ, who reported it directly to the vendor.\nUsers of vulnerable devices are recommended to upgrade to firmware version 3.2.1.0 or newer to address the risk. HPE has given no workarounds, so patching is the recommended course of action.\nIt is clarified in the bulletin that CVE-2025-37103 does not impact Instant On Switches.\nOn the same bulletin, HPE highlights a second vulnerability, CVE-2025-37102. This is a high-severity authenticated command injection flaw in the Command Line Interface (CLI) of Aruba Instant On access points.\nThis flaw can be chained with CVE-2025-37103, as admin access is required for its exploitation, allowing threat actors to inject arbitrary commands into the CLI for data exfiltration, security disabling, and establishing persistence.\nIn this case, too, the problem is resolved by upgrading to firmware version 3.2.1.0 or later, and no workaround is available.\nAt this time, HPE Aruba Networking is not aware of any reports of exploitation of the two flaws. However, this could change quickly, so applying the security updates immediately is crucial.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nGigabyte motherboards vulnerable to UEFI malware bypassing Secure Boot\nRuckus Networks leaves severe flaws unpatched in management devices\nHewlett Packard Enterprise warns of critical StoreOnce auth bypass\nHackers scanning for TeleMessage Signal clone flaw exposing passwords\nCitrix Bleed 2 exploited weeks before PoCs as Citrix denied attacks"
    },
    {
        "Title": "SharePoint Under Attack: Microsoft Warns of Zero-Day Exploited in the Wild – No Patch Available",
        "Link": "https://www.securityweek.com/sharepoint-under-attack-microsoft-warns-of-zero-day-exploited-in-the-wild-no-patch-available/",
        "Summary": "<p>Enterprises running SharePoint servers should not wait for a fix for CVE-2025-53770 and should commence threat hunting to search for compromise immediately.</p>\n<p>The post <a href=\"https://www.securityweek.com/sharepoint-under-attack-microsoft-warns-of-zero-day-exploited-in-the-wild-no-patch-available/\">SharePoint Under Attack: Microsoft Warns of Zero-Day Exploited in the Wild – No Patch Available</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-20",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/sharepoint-under-attack-microsoft-warns-of-zero-day-exploited-in-the-wild-no-patch-available/"
    }
]