[
    {
        "Title": "Gold Melody IAB Exploits Exposed ASP.NET Machine Keys for Unauthorized Access to Targets",
        "Link": "https://thehackernews.com/2025/07/gold-melody-iab-exploits-exposed-aspnet.html",
        "Summary": "The Initial Access Broker (IAB) known as Gold Melody has been attributed to a campaign that exploits leaked ASP.NET machine keys to obtain unauthorized access to organizations and peddle that access to other threat actors.\nThe activity is being tracked by Palo Alto Networks Unit 42 under the moniker TGR-CRI-0045, where \"TGR\" stands for \"temporary group\" and \"CRI\" refers to criminal motivation.",
        "Date": "2025-07-09",
        "Content": "The Initial Access Broker (IAB) known as\nGold Melody\nhas been attributed to a campaign that exploits leaked ASP.NET machine keys to obtain unauthorized access to organizations and peddle that access to other threat actors.\nThe activity is being tracked by Palo Alto Networks Unit 42 under the moniker\nTGR-CRI-0045\n, where \"TGR\" stands for \"temporary group\" and \"CRI\" refers to criminal motivation. The hacking group is also known as\nProphet Spider\nand\nUNC961\n, with one of its tools also used by an initial access broker called\nToyMaker\n.\n\"The group seems to follow an opportunistic approach but has attacked organizations in Europe and the U.S. in the following industries: financial services, manufacturing, wholesale and retail, high technology, and transportation and logistics,\" researchers Tom Marsden and Chema Garcia\nsaid\n.\nThe abuse of ASP.NET machine keys in the wild was\nfirst documented\nby Microsoft in February 2025, with the company noting that it had identified over 3,000 such publicly disclosed keys that could be weaponized for\nViewState\ncode injection attacks, ultimately leading to arbitrary code execution.\nThe first sign of these attacks was detected by the Windows maker in December 2024, when an unknown adversary leveraged a publicly available, static ASP.NET machine key to inject malicious code and deliver the Godzilla post-exploitation framework.\nUnit 42's analysis shows that the TGR-CRI-0045 is following a similar modus operandi, employing the leaked keys to sign malicious payloads that provide unauthorized access to targeted servers, a technique known as ASP.NET ViewState deserialization.\n\"This technique enabled the IAB to execute malicious payloads directly in server memory, minimizing their on-disk presence and leaving few forensic artifacts, making detection more challenging,\" the cybersecurity company said, adding it found evidence of earliest exploitation in October 2024.\nUnlike traditional web shell implants or file-based payloads, this memory-resident approach bypasses many legacy EDR solutions that rely on file system or process tree artifacts. Organizations relying solely on file integrity monitoring or antivirus signatures may completely miss the intrusion, making it critical to implement behavioral detections based on anomalous IIS request patterns, child processes spawned by w3wp.exe, or sudden changes in .NET application behavior.\nA significant spike in activity is said to have been detected between late January and March 2025, during which period the attacks led to the deployment of post-exploitation tools such as open-source port scanners and bespoke C# programs like updf for local privilege escalation.\nIn at least two incidents observed by Unit 42, the attacks are characterized by command shell execution originating from Internet Information Services (IIS) web servers. Another notable aspect is the likely use of an open-source .NET deserialization payload generator called\nysoserial.net and ViewState plugin\nto build the payloads.\nThese payloads bypass ViewState protections and trigger the execution of a .NET assembly in memory. Five different IIS modules have been identified as loaded into memory so far -\nCmd /c, which is used to passing a command to be executed to the system's command shell and execute arbitrary instructions on the server\nFile upload, which allows for uploading files to the server by specifying a target file path and a byte buffer containing the file's contents\nWinner, which is likely a check for successful exploitation\nFile download (not recovered), which appears to be a downloader that allows an attacker to retrieve sensitive data from the compromised server\nReflective loader (not recovered), which seemingly acts as a reflective loader to dynamically load and execute additional .NET assemblies in memory without leaving a trail\n\"Between October 2024 and January 2025, the threat actor's activity primarily focused on exploiting systems, deploying modules — like the exploit checker — and performing basic shell reconnaissance,\" Unit 42 said. \"Post-exploitation activity has primarily involved reconnaissance of the compromised host and surrounding network.\"\nSome of the other tools downloaded onto the systems include an ELF binary named atm from an external server (\"195.123.240[.]233:443\") and a Golang port scanner called TXPortMap to map out the internal network and identify potential exploitation targets.\n\"TGR-CRI-0045 uses a simplistic approach to ViewState exploitation, loading a single, stateless assembly directly,\" the researchers noted. \"Each command execution requires re-exploitation and re-uploading the assembly (e.g., running the file upload assembly multiple times).\"\n\"Exploiting ASP.NET View State deserialization vulnerabilities via exposed Machine Keys allows minimal on-disk presence and enables long-term access. The group's opportunistic targeting and ongoing tool development highlight the need for organizations to prioritize identifying and remediating compromised Machine Keys.\"\nThis campaign also highlights a broader category of cryptographic key exposure threats, including weak machineKey generation policies, missing MAC validation, and insecure defaults in older ASP.NET applications. Expanding internal threat models to include cryptographic integrity risks, ViewState MAC tampering, and IIS middleware abuse can help organizations build more resilient AppSec and identity protection strategies.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "DoNot APT Expands Operations, Targets European Foreign Ministries with LoptikMod Malware",
        "Link": "https://thehackernews.com/2025/07/donot-apt-expands-operations-targets.html",
        "Summary": "A threat actor with suspected ties to India has been observed targeting a European foreign affairs ministry with malware capable of harvesting sensitive data from compromised hosts.\nThe activity has been attributed by Trellix Advanced Research Center to an advanced persistent threat (APT) group called DoNot Team, which is also known as APT-C-35, Mint Tempest, Origami Elephant, SECTOR02, and",
        "Date": "2025-07-09",
        "Content": "A threat actor with suspected ties to India has been observed targeting a European foreign affairs ministry with malware capable of harvesting sensitive data from compromised hosts.\nThe activity has been attributed by Trellix Advanced Research Center to an advanced persistent threat (APT) group called\nDoNot Team\n, which is also\nknown\nas APT-C-35, Mint Tempest, Origami Elephant, SECTOR02, and Viceroy Tiger. It's been assessed to be active since 2016.\n\"DoNot APT is known for using custom-built Windows malware, including backdoors like YTY and GEdit, often delivered through spear-phishing emails or malicious documents,\" Trellix researchers Aniket Choukde, Aparna Aripirala, Alisha Kadam, Akhil Reddy, Pham Duy Phuc, and Alex Lanstein\nsaid\n.\n\"This threat group typically targets government entities, foreign ministries, defense organizations, and NGOs especially those in South Asia and Europe.\"\nThe attack chain commences with phishing emails that aim to trick recipients into clicking on a Google Drive link to trigger the download of a RAR archive, which then paves the way for the deployment of a malware dubbed LoptikMod, which is exclusively put to use by the group as far back as 2018.\nThe messages, per Trellix, originate from a Gmail address and impersonate defense officials, with a subject line that references an Italian Defense Attaché's visit to Dhaka, Bangladesh.\n\"The email used HTML formatting with UTF-8 encoding to properly display special characters like 'é' in 'Attaché,' demonstrating attention to detail to increase legitimacy,\" Trellix noted in its deconstruction of the infection sequence.\nThe RAR archive distributed via the emails contains a malicious executable that mimics a PDF document, opening which causes the execution of the LoptikMod remote access trojan that can establish persistence on the host via scheduled tasks and connect to a remote server to send system information, receive further commands, download additional modules, and exfiltrate data.\nIt also employs anti-VM techniques and ASCII obfuscation to hinder execution in virtual environments and evade analysis, thereby making it a lot more challenging to determine the tool's purpose. Furthermore, the attack makes sure that only one instance of the malware is actively running on the compromised system to avoid potential interference.\nTrellix said the command-and-control (C2) server used in the campaign is currently inactive, meaning the infrastructure has been either temporarily disabled or no longer functional, or that the threat actors have moved to a completely different server.\nThe inactive state of the C2 server also means that it's currently not feasible to determine the exact set of commands that are transmitted to infected endpoints and the kinds of data that are sent back as responses.\n\"Their operations are marked by persistent surveillance, data exfiltration, and long-term access, suggesting a strong cyber espionage motive,\" the researchers said. \"While historically focused on South Asia, this incident targeting South Asian embassies in Europe, indicates a clear expansion of their interests towards European diplomatic communications and intelligence.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "U.S. Sanctions North Korean Andariel Hacker Behind Fraudulent IT Worker Scheme",
        "Link": "https://thehackernews.com/2025/07/us-sanctions-north-korean-andariel.html",
        "Summary": "The U.S. Department of the Treasury's Office of Foreign Assets Control (OFAC) on Tuesday sanctioned a member of a North Korean hacking group called Andariel for their role in the infamous remote information technology (IT) worker scheme.\nThe Treasury said Song Kum Hyok, a 38-year-old North Korean national with an address in the Chinese province of Jilin, enabled the fraudulent operation by using",
        "Date": "2025-07-09",
        "Content": "The U.S. Department of the Treasury's Office of Foreign Assets Control (OFAC) on Tuesday sanctioned a member of a North Korean hacking group called\nAndariel\nfor their role in the infamous remote information technology (IT) worker scheme.\nThe Treasury said Song Kum Hyok, a 38-year-old North Korean national with an address in the Chinese province of Jilin, enabled the fraudulent operation by using foreign-hired IT workers to seek remote employment with U.S. companies and planning to split income with them.\nBetween 2022 and 2023, Song is alleged to have used the identities of U.S. people, including their names, addresses, and Social Security numbers, to craft aliases for the hired workers, who then used these personas to pose as U.S. nationals looking for remote jobs in the country.\nThe development comes days after the U.S. Department of Justice (DoJ)\nannounced\nsweeping actions targeting the North Korean information technology (IT) worker scheme, leading to the arrest of one individual and the seizure of 29 financial accounts, 21 fraudulent websites, and nearly 200 computers.\nSanctions have also been levied against a Russian national and four entities involved in a Russia-based IT worker scheme that contracted and hosted North Koreans to pull off the malicious operation. This includes -\nGayk Asatryan, who used his Russia-based companies Asatryan LLC and Fortuna LLC to employ North Korean IT workers\nKorea Songkwang Trading General Corporation, which signed a deal with Asatryan to dispatch up to 30 IT workers to work in Russia for Asatryan LLC\nKorea Saenal Trading Corporation, which signed a deal with Asatryan to dispatch up to 50 IT workers to work in Russia for Fortuna LLC\nThe sanctions mark the first time a threat actor linked to\nAndariel\n, a sub-cluster within the Lazarus Group, has been tied to the IT worker scheme, which has become a crucial illicit revenue stream for the sanctions-hit nation. The Lazarus Group is assessed to be affiliated with the Democratic People's Republic of Korea (DPRK) Reconnaissance General Bureau (RGB).\nThe action \"underscores the importance of vigilance on the DPRK's continued efforts to clandestinely fund its WMD and ballistic missile programs,\"\nsaid\nDeputy Secretary of the Treasury Michael Faulkender.\n\"Treasury remains committed to using all available tools to disrupt the Kim [Jong Un] regime's efforts to circumvent sanctions through its digital asset theft, attempted impersonation of Americans, and malicious cyber attacks\"\nThe IT worker scheme, also tracked as Nickel Tapestry, Wagemole, and UNC5267, involves North Korean actors using a mix of stolen and fictitious identities to gain employment with U.S. companies as remote IT workers with the goal of drawing a regular salary that's then funneled back to the regime through intricate cryptocurrency transactions.\nThe insider threat is just one of the many methods embraced by Pyongyang to generate revenue for the country. Data\ncompiled\nby TRM Labs shows that North Korea is behind approximately $1.6 billion out of the total $2.1 billion stolen as a result of 75 cryptocurrency hacks and exploits in the first half of 2025 alone -- mainly driven by the\nblockbuster heist of Bybit\nearlier this year.\nA majority of steps taken to counter the threat has ostensibly come from U.S. authorities, but Michael \"Barni\" Barnhart, Principal i3 Insider Risk Investigator at DTEX, told The Hacker News that other countries are also stepping up and taking similar actions and driving awareness to a broader audience.\n\"This is a complex, transnational issue with many moving parts, so international collaboration and open communication are extremely useful,\" Barnhart said.\n\"For an example of some of the complexities with this issue, a North Korean IT worker may be physically located in China, employed by a front company posing as a Singapore-based firm, contracted to a European vendor delivering services to clients in the United States. That level of operational layering highlights just how important joint investigations and intelligence sharing are in effectively countering this activity.\"\n\"The good news is that awareness has grown significantly in recent years, and we're now seeing the fruits of that labor. These initial awareness steps are part of a broader global shift toward recognizing and actively disrupting these threats.\"\nNews of the sanctions dovetail with reports that the North Korea-aligned group tracked as\nKimsuky\n(aka APT-C-55) is using a backdoor called\nHappyDoor\nin attacks\ntargeting\nSouth Korean entities. HappyDoor, according to AhnLab, has been put to use as far back as 2021.\nTypically distributed via spear-phishing email attacks, the malware has witnessed steady improvements over the years, allowing it to harvest sensitive information; execute commands, PowerShell code, and batch scripts; and upload files of interest.\n\"Mainly taking on the disguise of a professor or an academic institution, the threat actor has been using social engineering techniques like spear-phishing to distribute emails with attachments that, once run, install a backdoor and may also install additional malware,\" AhnLab\nnoted\n.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "How To Automate Ticket Creation, Device Identification and Threat Triage With Tines",
        "Link": "https://thehackernews.com/2025/07/how-to-automate-ticket-creation-device.html",
        "Summary": "Run by the team at workflow orchestration and AI platform Tines, the Tines library features over 1,000 pre-built workflows shared by security practitioners from across the community - all free to import and deploy through the platform’s Community Edition.\nA recent standout is a workflow that handles malware alerts with CrowdStrike, Oomnitza, GitHub, and PagerDuty. Developed by Lucas Cantor at",
        "Date": "2025-07-09",
        "Content": "Run by the team at workflow orchestration and AI platform Tines, the Tines library features over 1,000 pre-built workflows shared by security practitioners from across the community - all free to import and deploy through the platform's\nCommunity Edition.\nA recent standout is a workflow that handles malware alerts with CrowdStrike, Oomnitza, GitHub, and PagerDuty. Developed by Lucas Cantor at Intercom, the creators of\nfin.ai\n, the workflow makes it easier to determine the severity of a security alert and escalate it seamlessly, depending on the device owner's response. \"It's a great way to reduce noise and add context to security issues that are added on our endpoints as well,\" Lucas explains.\nIn this guide, we'll share an overview of the workflow, plus step-by-step instructions for getting it up and running.\nThe problem - lack of integration between security tools\nFor security teams, responding to malware threats, analyzing their severity, and identifying the device owner so they can be contacted to resolve the threat, can take up a lot of time.\nFrom a workflow perspective, teams often have to:\nManually respond to CrowdStrike events\nEnrich the alert with additional metadata\nDocument and alert the device owner in Slack\nNotify on call teams via PagerDuty\nGoing through this process manually can result in delays and increase the chances of human error.\nThe solution - automated ticket creation, device identification, and threat triage\nLucas's prebuilt workflow automates the process of taking the malware alert and creating the case - while crucially notifying the device owner and the on-call team. This workflow helps security teams accurately identify the level of threat faster by:\nDetecting new alerts from Crowdstrike\nIdentifying and notifying the device owner\nEscalating critical issues\nThe result is streamlined response to malware security alerts that ensures they are dealt with quickly, no matter what the severity.\nKey benefits of this workflow:\nReduced remediation time\nDevice owner is kept informed\nClear remediation and escalation pathways\nCentralized management system\nWorkflow overview\nTools used:\nTines - workflow orchestration and AI platform (free Community Edition available)\nCrowdstrike - threat intelligence and EDR platform\nOomnitza - IT asset management platform\nGithub - developer platform\nPagerDuty - incident management platform\nSlack – team collaboration platform\nHow it works\nPart 1\nGet a security alert from CrowdStrike\nFind the device that the alert was triggered and look up its details\nCreate a ticket in GitHub for the alert and raise the issue in a Slack message\nIf the device is owned by a user and it is a low priority,\nSend the owner a message requesting escalation\nIf the device is owned by a user and it is a high priority,\nCreate a PagerDuty Event to notify the on-call analyst\nInforming the owner of the ongoing issue\nPart 2\nGet a user interaction with the Slack message\nEnrich the GitHub issue with the users response\nIf the owner escalates the issue\nCreate a PagerDuty Event to notify the on-call analyst\nConfiguring the workflow - step-by-step guide\n1.\nLog into Tines or create a new account.\n2.\nNavigate to the\npre-built workflow in the library.\nSelect import. This should take you straight to your new pre-built workflow.\n3.\nSet up your credentials\nYou'll need five credentials added to your Tines tenant:\nCrowdStrike\nOomnitza\nGithub\nPagerDuty\nSlack\nNote that similar services to the ones listed above can also be used, with some adjustments to the workflow.\nFrom the credentials page, select New credential, scroll down to the relevant credential and complete the required fields. Follow the CrowdStrike, Oomnitza, Github, PagerDuty, and Slack credential guides at explained.tines.com if you need help.\n4.\nConfigure your actions.\nSet your environment variables. This includes your:\nSlack IT channel alerting webhook (`slack_channel_webhook_urls_prod`)\nCrowdStrike/GitHub severity priority mapping (`crowdstrike_to_github_priority_map`)\nConfigure CrowdStrike to alert the New CrowdStrike Detection webhook when a detection is created\nConfigure your SlackBot interactivity URL to the Receive Slack Button Push webhook\n5.\nTest the workflow.\n6.\nPublish and operationalize\nOnce tested, publish the workflow.\nIf you'd like to test this workflow, you can sign up for a\nfree Tines account\n.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Chinese Hacker Xu Zewei Arrested for Ties to Silk Typhoon Group and U.S. Cyber Attacks",
        "Link": "https://thehackernews.com/2025/07/chinese-hacker-xu-zewei-arrested-for.html",
        "Summary": "A Chinese national has been arrested in Milan, Italy, for his alleged links to a state-sponsored hacking group known as Silk Typhoon and for carrying out cyber attacks against American organizations and government agencies.\nThe 33-year-old, Xu Zewei, has been charged with nine counts of wire fraud and conspiracy to cause damage to and obtain information by unauthorized access to protected",
        "Date": "2025-07-09",
        "Content": "A Chinese national has been arrested in Milan, Italy, for his alleged links to a state-sponsored hacking group known as Silk Typhoon and for carrying out cyber attacks against American organizations and government agencies.\nThe 33-year-old,\nXu Zewei\n, has been\ncharged\nwith nine counts of wire fraud and conspiracy to cause damage to and obtain information by unauthorized access to protected computers, as well as committing aggravated identity theft. Details of the arrest were\nfirst reported\nby Italian media.\nXu is alleged to have been involved in the U.S. computer intrusions between February 2020 and June 2021, including a mass attack spree that leveraged then-zero-day flaws in Microsoft Exchange Server, a cluster of activity the Windows maker designed as\nHafnium\n.\nThe suspect is also accused of participating in China's espionage efforts during the COVID-19 pandemic, attempting to gain access to vaccine research at various U.S. universities, including the University of Texas.\nXu, alongside co-defendant and Chinese national Zhang Yu, are believed to have undertaken the attacks based on directions given by the Ministry of State Security's (MSS) Shanghai State Security Bureau (SSSB).\n\"Beginning in late 2020, Xu and his co-conspirators exploited certain vulnerabilities in Microsoft Exchange Server, a widely used Microsoft product for sending, receiving and storing email messages,\" the Justice Department said. \"Their exploitation of Microsoft Exchange Server was allegedly at the forefront of a massive campaign targeting thousands of computers worldwide and known publicly as 'Hafnium.'\"\nSilk Typhoon\n, which overlaps with\nUNC5221\n, is known for its use of zero-day vulnerabilities and successful compromises of technology firms in supply chain attacks. The group is said to have targeted over 60,000 U.S. entities, successfully victimizing more than 12,700 in order to steal sensitive information through the Hafnium campaign.\nIn previous disclosures, Silk Typhoon has demonstrated a preference for targeting sectors tied to intellectual property and national resilience, such as healthcare, defense, and critical infrastructure. Their campaigns often involve a mix of credential harvesting, supply chain compromise, and long-term access operations—indicative of a broader mandate focused on both immediate and strategic intelligence collection.\nWhile Hafnium is widely categorized as an advanced persistent threat (APT), analysts linking its activity to UNC5221 have mapped key techniques—like initial access through CVE-2021-26855 and lateral movement via PowerShell scripts—to MITRE ATT&CK patterns. The overlap reflects a broader APT ecosystem that blends zero-day exploitation, outsourced contractor operations, and long-term access strategies—core themes in ongoing discussions around attribution and cyber defense posture.\nThe Justice Department has also claimed that Zewei worked for a company named\nShanghai Powerock Network Co. Ltd.\nwhen the attacks were carried out, lending further credence to other reports that China is leveraging an array of\ncontractors\nand\nprivate firms\nto launch state-sponsored espionage campaigns in an effort to obscure the government's involvement.\nA recent analysis of leaked Chinese datasets that appeared on sale on DarkForums, an English-language cybercrime forum, has shed further light on the shadowy hack-for-hire scene in the country. The cache allegedly contains non-public documents related to VenusTech, a major IT security vendor in China with a focus on serving government clients, and\nSalt Typhoon\n, per\nSpyCloud\n.\nThe VenusTech documents, leaked by a user named IronTooth, reference already hacked organizations, in addition to containing contract information showing various Chinese government entities to which the company offers its services.\nThe second batch is said to include details about several employees behind the Salt Typhoon hacking group and information on 242 hacked routers. Also leaked by ChinaBob, the DarkForums user who has advertised the dataset, is a spreadsheet that purportedly shows transactions between various governments customers and their sellers.\nThe document lists three different seller companies: Sichuan Zhixin Ruijie Network Technology Company Limited, Beijing Huanyu Tiangiong Information Technology Company Limited, and Sichuan Juxinhe Network Technology Company Limited. It's worth noting that Sichuan Juxinhe was\nsanctioned\nby the U.S. Treasury Department earlier this January for its ties to Salt Typhoon.\n\"While the origin of these leaks is uncertain, this data appearing for sale on a Western hacking forum fits into a few overarching trends that we have observed from monitoring Chinese cybercriminal communities: China's state-sanctioned data collection and intelligence apparatus is\nleaky\n[and] cybercriminals from the Sinosphere appear to be increasingly present in Western digital crime spaces,\" SpyCloud said.\nAccording to a\nreport\nfrom Reuters, Xu has opposed the extradition request, claiming a case of mistaken identity. Xu's lawyer added his surname is quite common in China and that his mobile phone had been stolen from him in 2020.\n\"Unfortunately, the impact of this arrest won't be felt immediately. There are several teams composed of dozens of operators who are going to continue to carry out cyber espionage,\" John Hultquist, Chief Analyst, Google Threat Intelligence Group (GTIG), said in a statement shared with The Hacker News.\n\"Government sponsors are not going to be deterred. The arrest is unlikely to bring operations to a halt or even significantly slow them, but it may give some of these talented young hackers a reason to think twice before getting involved in this work.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft Patches 130 Vulnerabilities, Including Critical Flaws in SPNEGO and SQL Server",
        "Link": "https://thehackernews.com/2025/07/microsoft-patches-130-vulnerabilities.html",
        "Summary": "For the first time in 2025, Microsoft's Patch Tuesday updates did not bundle fixes for exploited security vulnerabilities, but the company acknowledged one of the addressed flaws had been publicly known.\nThe patches resolve a whopping 130 vulnerabilities, along with 10 other non-Microsoft CVEs that affect Visual Studio, AMD, and its Chromium-based Edge browser. Of these 10 are rated Critical and",
        "Date": "2025-07-09",
        "Content": "For the first time in 2025, Microsoft's Patch Tuesday updates did not bundle fixes for exploited security vulnerabilities, but the company acknowledged one of the addressed flaws had been publicly known.\nThe patches resolve a\nwhopping 130 vulnerabilities\n, along with 10 other non-Microsoft CVEs that affect Visual Studio, AMD, and its Chromium-based Edge browser. Of these 10 are rated Critical and the remaining are all rated Important in severity.\n\"The 11-month streak of patching at least one zero-day that was exploited in the wild ended this month,\" Satnam Narang, Senior Staff Research Engineer at Tenable, said.\nFifty-three of these shortcomings are classified as privilege escalation bugs followed by 42 as remote code execution, 17 as information disclosure, and 8 as security feature bypasses. These patches are in addition to\ntwo other flaws\naddressed by the company in the Edge browser since the release of\nlast month's Patch Tuesday update\n.\nThe vulnerability that's listed as publicly known is an information disclosure flaw in Microsoft SQL Server (\nCVE-2025-49719\n, CVSS score: 7.5) that could permit an unauthorized attacker to leak uninitialized memory.\n\"An attacker might well learn nothing of any value, but with luck, persistence, or some very crafty massaging of the exploit, the prize could be cryptographic key material or other crown jewels from the SQL Server,\" Adam Barnett, Lead Software Engineer at Rapid7, said in a statement.\nMike Walters, President and Co-Founder of Action1,\nsaid\nthe flaw likely is the result of improper input validation in SQL Server's memory management, allowing access to uninitialized memory.\n\"As a result, attackers could retrieve remnants of sensitive data, such as credentials or connection strings,\" Walters added. \"It affects both the SQL Server engine and applications using OLE DB drivers.\"\nThe most critical flaw patched by Microsoft as part of this month's updates concerns a case of remote code execution impacting SPNEGO Extended Negotiation (\nNEGOEX\n). Tracked as\nCVE-2025-47981\n, it carries a CVSS score of 9.8 out of 10.0.\n\"Heap-based buffer overflow in Windows SPNEGO Extended Negotiation allows an unauthorized attacker to execute code over a network,\" Microsoft said in an advisory. \"An attacker could exploit this vulnerability by sending a malicious message to the server, potentially leading to remote code execution.\"\nAn anonymous researcher and Yuki Chen have been credited with discovering and repairing the flaw. Microsoft noted that the issue only impacts Windows client machines running Windows 10, version 1607 and above due to the \"Network security: Allow PKU2U authentication requests to this computer to use online identities\" Group Policy Object (\nGPO\n) being enabled by default.\n\"As always, Remote Code Execution is bad, but early analysis is suggesting that this vulnerability may be 'wormable' - the sort of vulnerability that could be leveraged in self-propagating malware and make many revisit trauma from the WannaCry incident,\" watchTowr founder and CEO Benjamin Harris said.\n\"Microsoft is clear on pre-requisites here: no authentication required, just network access, and Microsoft themselves believe exploitation is 'More Likely.' We shouldn't fool ourselves - if the private industry has noticed this vulnerability, it is certainly already on the radar of every attacker with an ounce of malice. Defenders need to drop everything, patch rapidly, and hunt down exposed systems.\"\nOther vulnerabilities of importance include remote code execution flaws impacting Windows KDC Proxy Service (\nCVE-2025-49735\n, CVSS score: 8.1), Windows Hyper-V (\nCVE-2025-48822\n, CVSS score: 8.6), and Microsoft Office (\nCVE-2025-49695\n,\nCVE-2025-496966\n, and\nCVE-2025-49697\n, CVSS scores: 8.4).\n\"What makes CVE-2025-49735 significant is the network exposure combined with no required privileges or user interaction. Despite its high attack complexity, the vulnerability opens the door to pre-auth remote compromise, particularly attractive to APTs and nation-state actors,\" Ben McCarthy, Lead Cyber Security Engineer at Immersive, said.\n\"The attacker must win a race condition – a timing flaw where memory is freed and reallocated in a specific window – meaning reliability is low for now. Still, such issues can be weaponized with techniques like heap grooming, making eventual exploitation feasible.\"\nElsewhere, the update closes out five security feature bypasses in Bitlocker (\nCVE-2025-48001\n,\nCVE-2025-48003\n,\nCVE-2025-48800\n,\nCVE-2025-48804\n, and\nCVE-2025-48818\n, CVSS scores: 6.8) that could allow an attacker with physical access the device to get hold of encrypted data.\n\"An attacker could exploit this vulnerability by loading a WinRE.wim file while the OS volume is unlocked, granting access to BitLocker encrypted data,\" Microsoft said about CVE-2025-48804.\nResearchers Netanel Ben Simon and Alon Leviev with Microsoft Offensive Research and Security Engineering (MORSE) have been acknowledged for reporting the five issues in the built-in disk encryption tool.\n\"If exploited, these flaws could expose sensitive files, credentials, or allow tampering with system integrity,\" Jacob Ashdown, Cyber Security Engineer at Immersive, said. \"This poses a particular risk, especially for organizations where devices may be lost or stolen, as attackers with hands-on access could potentially bypass encryption and extract sensitive data.\"\nIt's also worth\nnoting\nthat July 8, 2025, officially marks the end of the road for SQL Server 2012, which will no longer receive any future security patches in the list of the Extended Security Update (ESU) program coming to a close.\nSoftware Patches from Other Vendors\nIn addition to Microsoft, security updates have also been released by other vendors over the past couple of weeks to rectify several vulnerabilities, including —\nAdobe\nAMD\nAtlassian\nBitdefender\nBroadcom\n(including VMware)\nCisco\nCitrix\nD-Link\nDell\nDrupal\nF5\nFortinet\nFortra\nGigabyte\nGitLab\nGoogle Chrome\nGoogle Cloud\nGrafana\nHikvision\nHitachi Energy\nHP\nHP Enterprise\n(including Aruba Networking)\nIBM\nIntel\nIvanti\nJenkins\nJuniper Networks\nLenovo\nLinux distributions\nAlmaLinux\n,\nAlpine Linux\n,\nAmazon Linux\n,\nArch Linux\n,\nDebian\n,\nGentoo\n,\nOracle Linux\n,\nMageia\n,\nRed Hat\n,\nRocky Linux\n,\nSUSE\n, and\nUbuntu\nMediaTek\nMitsubishi Electric\nMongoDB\nMoxa\nMozilla Thunderbird\nNVIDIA\nOPPO\nPalo Alto Networks\nProgress Software\nQualcomm\nRicoh\nRuckus Wireless\nSamsung\nSAP\nSchneider Electric\nServiceNow\nSiemens\nSplunk\nSupermicro\nVeeam\nWordPress\nZimbra\n, and\nZoom\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft Authenticator on iOS moves backups fully to iCloud",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-authenticator-on-ios-moves-backups-fully-to-icloud/",
        "Summary": "Microsoft is rolling out a new backup system in September for its Authenticator app on iOS, removing the requirement to use a Microsoft personal account to back up TOTP secrets and account names. [...]",
        "Date": "2025-07-09",
        "Content": "Microsoft is rolling out a new backup system in September for its Authenticator app on iOS, removing the requirement to use a Microsoft personal account to back up TOTP secrets and account names.\nPreviously, the Microsoft Authenticator app required iOS users to sign in with a personal Microsoft Account to enable backups, regardless of whether they were using the app for personal or enterprise credentials.\nThis created problems in enterprise environments where organizations often like to keep personal and corporate data separated.\nThe new backup system will continue to use the signed-in iCloud account to store the backups, but no longer with the requirement to use a Microsoft account. If the company uses a managed Apple ID on their corporate devices, then that will be used instead of a personal account.\nMicrosoft says this new feature will begin rolling out in September and will be finished by early October 2025, with users being shown a notification about the new experience in the app, as shown below.\nIn-app warning about upcoming change\nSource: Microsoft\nMicrosoft says this feature will only be available to users running iOS 16.0 or later with iCloud and iCloud Keychain enabled. Once installed, account names and TOTP credentials (secrets) will be backed up to iCloud and restored automatically on new devices when you use the same Apple account..\n\"Account names for all accounts in the Authenticator app—including work or school accounts, Microsoft personal accounts, and non-Microsoft accounts (such as Amazon, Google)—will be securely backed up using iCloud and iCloud Keychain,\" reads the Microsoft announcement.\nThe company stresses that only TOTP secrets will be backed up and no other credentials, and that users can disable the backup feature through the iCloud settings on their device.\nMicrosoft says that this feature will automatically roll out to all users with no admin action required.\nThe feature comes after Microsoft's\nrecent announcement\nthey are removing the password autofill and management functionality from Authenticator.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nMicrosoft Authenticator now warns to export passwords before July cutoff\nMicrosoft confirms Windows Server Update Services (WSUS) sync is broken\nMicrosoft July 2025 Patch Tuesday fixes one zero-day, 137 flaws\nWindows 10 KB5062554 cumulative update released with 13 changes, fixes\nMicrosoft fixes ‘Print to PDF’ feature broken by Windows update"
    },
    {
        "Title": "Microsoft confirms Windows Server Update Services (WSUS) sync is broken",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-confirms-windows-server-update-services-wsus-sync-is-broken/",
        "Summary": "Microsoft has confirmed a widespread issue in Windows Server Update Services (WSUS) that prevents organizations from syncing with Microsoft Update and deploying the latest Windows updates. [...]",
        "Date": "2025-07-09",
        "Content": "Microsoft has confirmed a widespread issue in Windows Server Update Services (WSUS) that prevents organizations from syncing with Microsoft Update and deploying the latest Windows updates.\nWindows Server Update Services (WSUS) is a Microsoft product that allows businesses to manage and distribute Windows updates to computers within their network.\nBy default, WSUS synchronizes with Microsoft Update servers once a day, when it downloads the latest metadata on available Windows updates. Admins can change the frequency if they wish in the settings.\nSince last night, Windows admins have reported that WSUS synchronization is broken, with event logs showing \"A connection attempt failed\" or .NET errors stating, \"The operation has timed out,\" when syncs were attempted.\n\"Is anyone having synchronization issues with their WSUS server? I started having issues last night and still cant get it to sync this morning. There does appear to be one sync that was successful in the middle of the night, but none since,\" reads a\nReddit topic\nabout the issue.\nAdmins report that the synchronization began earlier this morning at approximately 12:30 am ET.\nMicrosoft has now confirmed the synchronization problem in WSUS and said that they identified a \"problematic update revision in the storage layer\" that is causing the issue.\n\"Devices trying to synchronize updates from Microsoft Updates using Windows Server for Update Services (WSUS) might fail to complete the synchronization process. As a result, updates cannot be deployed using WSUS or Configuration Manager,\" reads a Microsoft advisory shared with BleepingComputer.\n\"WSUS synchronization tasks are frequently configured to occur automatically in business and enterprise environments, although manual tasks are also possible. Error logs for WSUS are usually found in the SoftwareDistribution.log file under C:\\Program Files\\Update Services\\LogFiles\\.\"\n\"Common messages may include text similar to \"Unable to connect to the remote server\" and \"A connection attempt failed because the connected party did not properly respond after a period of time\"\nMicrosoft says that there are no workarounds at this time and that they are working on a fix.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nMicrosoft July 2025 Patch Tuesday fixes one zero-day, 137 flaws\nWindows 10 KB5062554 cumulative update released with 13 changes, fixes\nMicrosoft fixes known issue that breaks Windows 11 updates\nMicrosoft to remove legacy drivers from Windows Update for security boost\nWindows 11 users want these five features back"
    },
    {
        "Title": "Qantas confirms data breach impacts 5.7 million customers",
        "Link": "https://www.bleepingcomputer.com/news/security/qantas-confirms-data-breach-impacts-57-million-customers/",
        "Summary": "Australian airline Qantas has confirmed that 5.7 million people have been impacted by a recent data breach, in which threat actors stole customers' data. [...]",
        "Date": "2025-07-09",
        "Content": "Australian airline Qantas has confirmed that 5.7 million people have been impacted by a recent data breach, in which threat actors stole customers' data.\nOn July 1st, Qantas disclosed that it\nhad detected a cyberattack\nthe previous day on a third-party platform used by a Qantas airline contact centre.\nWhile the company did not share any further details, BleepingComputer learned that the attack shared similarities with\nother attacks on the aviation industry\nlinked to threat actors classified as Scattered Spider.\nOn Monday, Qantas warned that the\nthreat actors had contacted them\n, likely to begin extorting the company to prevent the release of the stolen data.\nIn a\nnew update today\n, Qantas has confirmed that the threat actors stole data for approximately 5.7 million customers, with varying types of data exposed in the breach:\n4 million customer records are limited to name, email address and Qantas Frequent Flyer details. Of this:\n1.2 million customer records contained name and email address.\n2.8 million customer records contained name, email address and Qantas Frequent Flyer number. The majority of these also had tier included. A smaller subset of these had points balance and status credits included.\nOf the remaining 1.7 million customers, their records included a combination of some of the data fields above and one or more of the following:\nAddress – 1.3 million. This is a combination of residential addresses and business addresses including hotels for misplaced baggage delivery.\nDate of birth – 1.1 million\nPhone number (mobile, landline and/or business) – 900,000\nGender – 400,000. This is separate to other gender identifiers like name and salutation.\nMeal preferences – 10,000\nQantas warns that these counts are based on unique email addresses, and customers may have multiple accounts with different emails.\nThe airline also continues to stress that no Qantas Frequent Flyer accounts, passwords, PINs and login details, financial information, or passport details were stolen in the attack.\nQantas says they are now contacting customers whose data was stolen and have implemented additional safeguards to protect customers' data.\n\"Our absolute focus since the incident has been to understand what data has been compromised for each of the 5.7 million impacted customers and to share this with them as soon as possible,\" said Qantas Group Chief Executive Officer Vanessa Hudson.\n\"From today we are reaching out to customers to notify them of the specific personal data fields that were held in the compromised system and offer advice on how they can access the necessary support services.\"\n\"Since the incident, we have put in place a number of additional cyber security measures to further protect our customers data, and are continuing to review what happened.\"\nQantas recommends that customers be on the lookout for emails claiming to be from Qantas that may be attempts to steal further information.\nThe attack on Qantas follows other recent attacks on the aviation industry, including those on\nHawaiian Airlines\nand\nWestJet\n.\nThe threat actors, classified as\nScattered Spider\n, are utilizing social engineering attacks to breach corporate networks and systems, stealing data and attempting to extort companies into paying a ransom.\nIn some attacks, such as\nM&S\nand\nCo-op\n, the threat actors attempted to deploy the DragonForce ransomware to encrypt devices.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nQantas is being extorted in recent data-theft cyberattack\nQantas discloses cyberattack amid Scattered Spider aviation breaches\nOld AT&T data leak repackaged to link SSNs, DOBs to 49M phone numbers\nCartier discloses data breach amid fashion brand cyberattacks\nBitcoin Depot breach exposes data of nearly 27,000 crypto users"
    },
    {
        "Title": "Google reveals details on Android’s Advanced Protection for Chrome",
        "Link": "https://www.bleepingcomputer.com/news/security/google-reveals-details-on-androids-advanced-protection-for-chrome/",
        "Summary": "Google is sharing more information on how Chrome operates when Android mobile users enable Advanced Protection, highlighting strong security improvements. [...]",
        "Date": "2025-07-09",
        "Content": "Google is sharing more information on how Chrome operates when Android mobile users enable Advanced Protection, highlighting strong security improvements.\nThe tech giant\nrecently extended\nits Advanced Protection Program to the device level with the release of Android 16, aimed at offering a robust, holistic security posture for high-risk individuals likely to be targeted by sophisticated spyware attacks.\nStarting Android 16, Advanced Protection can be activated from the settings, strengthening security measures across the board, including on Google apps such as Chrome, Messages, and Phone.\nFor Chrome specifically, these measures became available with version 137 for Android, but Google hadn’t shared details about their added value and how they worked.\nIn a\nnew blog post\n, the Chrome Security Team explains that activating Advanced Protection triggers the following in Chrome:\nEnforcing Secure Connections\n– forces Chrome to attempt HTTPS for all sites (public and private) and warns users before connecting to any site over the insecure HTTP; this protects against attackers who may intercept or alter data over unencrypted connections.\nFull Site Isolation\n– isolates each website into its own process, preventing one site from accessing data from another, even in the event of a renderer exploit. On Android with more than 4GB of RAM the feature is active by default, otherwise it can be enabled under Advanced Protection\nJavaScript Optimization and Security\n– Advanced Protection disables high-level JavaScript optimizing compilers in Chrome’s V8 engine to reduce the browser’s attack surface. These optimizers improve performance but have historically been linked to many exploited bugs. It is estimated that disabling them could have mitigated roughly half of such cases, with no significant performance hit on most sites.\nHTTPS and JS security features were already available as options under Chrome’s Privacy and Security menu since version 133, so users can independently enable them even without toggling Advanced Protection to on.\nIt is also noted that site isolation still triggers even without Advanced Protection when users attempt to log in or submit a form on a site, which are considered high-risk scenarios by default.\nTo enable Advanced Protection on Android, go to Settings > Security & Privacy > Advanced Protection > toggle switch to the “on” position.\nActivating Advanced Protection on Android 16\nSource: BleepingComputer\nGoogle also recommends that high-risk individuals join the Advanced Protection Program with a Google account for stronger multi-factor authentication and automatic enforcement of security settings across devices.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nAndroid 16 expands 'Advanced Protection' with device-level security\nNew Android TapTrap attack fools users with invisible UI trick\nAndroid malware Anatsa infiltrates Google Play to target US banks\nGoogle fixes fourth actively exploited Chrome zero-day of 2025\nMalware on Google Play, Apple App Store stole your photos—and crypto"
    },
    {
        "Title": "Bitcoin Depot breach exposes data of nearly 27,000 crypto users",
        "Link": "https://www.bleepingcomputer.com/news/security/bitcoin-depot-breach-exposes-data-of-nearly-27-000-crypto-users/",
        "Summary": "Bitcoin Depot, an operator of Bitcoin ATMs, is notifying customers of a data breach incident that has exposed their sensitive information. [...]",
        "Date": "2025-07-09",
        "Content": "Bitcoin Depot, an operator of Bitcoin ATMs, is notifying customers of a data breach incident that has exposed their sensitive information.\nIn the letter sent to affected individuals, the company informs that it first detected suspicious activity on its network last year on June 23.\nAlthough the internal investigation was completed on July 18, 2024, a parallel investigation by federal agencies dictated that public disclosure of the incident should be withheld until it was completed.\n“On July 18, 2024, the investigation was complete, and we identified your personal information contained within documents related to certain of our customers that the unauthorized individual obtained,”\nexplains Bitcoin Depot in the letter\n.\n“Unfortunately, we were not able to inform you sooner due to an ongoing investigation. Federal law enforcement requested that Bitcoin Depot wait to provide you notice until after they completed the investigation.”\nThe type of data that has been exposed in this incident varies from individual to individual and may include:\nFull name\nPhone number\nDriver’s license number\nAddress\nDate of birth\nEmail address\nBitcoin Depot is one of the largest Bitcoin ATM networks in the United States, operating 8,800 machines in the U.S., Canada, and Australia.\nThe information exposed in this incident is similar to data typically collected during Know-Your-Customer verification processes that crypto ATM operations in the U.S. are obliged to comply with as per applicable FinCEN regulations.\nThe number of people exposed in this incident is\nestimated to nearly 27,000\n.\nBecause the financial risk is related to cryptocurrency, letter recipients were not offered coverage through identity monitoring and theft protection services.\nInstead, they are advised to maintain high alertness for signs of fraud, monitor their account statements, and consider placing a security freeze on their credit report.\nIn December 2024, a similar incident occurred at U.S. Bitcoin ATM operator Byte Federal, which disclosed a data breach\naffecting 58,000 customers\n.\nIn that case, the breach was caused by hackers exploiting a GitLab vulnerability to access a server hosting sensitive customer information.\nBleepingComputer has contacted Bitcoin Depot about the security incident but a comment was not avaialble.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nIdeaLab confirms data stolen in ransomware attack last year\nQantas discloses cyberattack amid Scattered Spider aviation breaches\nKelly Benefits says 2024 data breach impacts 550,000 customers\nMcLaren Health Care says data breach impacts 743,000 patients\nHealthcare SaaS firm says data breach impacts 5.4 million patients"
    },
    {
        "Title": "Ruckus Networks leaves severe flaws unpatched in management devices",
        "Link": "https://www.bleepingcomputer.com/news/security/ruckus-networks-leaves-severe-flaws-unpatched-in-management-devices/",
        "Summary": "Multiple vulnerabilities that remain unpatched in Ruckus Wireless management products could be exploited to fully compromise the network environment they serve. [...]",
        "Date": "2025-07-09",
        "Content": "Multiple vulnerabilities that remain unpatched in Ruckus Wireless management products could be exploited to fully compromise the network environment they serve.\nThe issues affect Ruckus Wireless Virtual SmartZone (vSZ) and Ruckus Network Director (RND), and range from uauthenticated remote code execution to hardcoded passwords or SSH public and private keys.\nRuckus vSZ is a centralized wireless network controller that can manage tens of thousands of Ruckus access points and clients, allowing configuration, monitoring, and controlling large-scale WiFi deployments. Ruckus RND is a management tool for vSZ clusters.\nThe two products are typically used by large organizations and public entities in need of scalable and robust WiFi infrastructure.\nThe vulnerabilities were reported to Carnegie Mellon University’s CERT Coordination Center (CERT/CC) by Noam Moshe, a member of Team82, Claroty's research division.\nNeither CERT/CC nor Moshe were able to contact Ruckus Wireless (now Ruckus Networks) or its parent company, CommScope, about the security problems, which remain unfixed at the time of publishing.\nThe problems impacting the two Ruckus Networks products received identifiers and are described as follows:\nCVE-2025-44957\n– hardcoded secrets in vSZ that allow bypassing authentication and admin-level access using crafted HTTP headers and valid API keys\nCVE-2025-44962\n– path traversal in vSZ that allows arbitrary file reads for authenticated users\nCVE-2025-44954\n– vSZ has hardcoded default public/private SSH keys that allows anyone to connect to vulnerable devices with root access\nCVE-2025-44960\n– vSZ has an API route with a user-controlled parameter that isn't sanitized, allowing execution of arbitrary operating system commands\nCVE-2025-44961\n– command injection in vSZ allows an authenticated user to supply an unsanitized IP address to an OS command\nCVE-2025-44963\n– RND uses a hardcoded backend JWT secret key, allowing anyone with it to forge valid admin session tokens\nCVE-2025-44955\n– RND includes a \"jailed\" environment with a built-in jailbreak using a weak, hardcoded password to gain root access\nCVE-2025-6243\n– RND includes a root-privileged user (sshuser) with hardcoded public/private SSH keys that allow root access\nCVE-2025-44958\n– RND encrypts stored passwords with a hardcoded weak secret key and can return them in plaintext if compromised\nAlthough severity scores have not been calculated, CERT/CC highlights the broad impact of the vulnerabilities, their potential for exploitation, and the possibility to chain them for a more impactful attack.\n\"[The] impact of these vulnerabilities varies from information leakage to total compromise of the wireless environment managed by the affected products,\"\nreads the bulletin\n.\n\"As an example, an attacker with network access to Ruckus Wireless vSZ can exploit CVE-2025-44954 to gain full administrator access that will lead to total compromise of the vSZ wireless management environment.\"\n\"Furthermore, multiple vulnerabilities can be chained to create chained attacks that can allow the attacker to combine attacks to bypass any security controls that prevent only specific attacks.\"\nWith no patches available and no clear information on when they might be released, administrators with Ruckus vSZ and RND on their network are recommended to limit access to Ruckus management interfaces to isolated, trusted networks and enforce access over secure protocols only.\nBleepingComputer attempted to contact Ruckus via multiple communication channels, but we were unable to reach out.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nMicrosoft July 2025 Patch Tuesday fixes one zero-day, 137 flaws\nApple fixes two zero-days exploited in targeted iPhone attacks\nOver 46,000 Grafana instances exposed to account takeover bug\nHackers exploited Windows WebDav zero-day to drop malware\nGoogle patches new Chrome zero-day bug exploited in attacks"
    },
    {
        "Title": "Ingram Micro starts restoring systems after ransomware attack",
        "Link": "https://www.bleepingcomputer.com/news/security/ingram-micro-starts-restoring-systems-after-ransomware-attack/",
        "Summary": "Ingram Micro has begun restoring systems and business services after suffering a massive SafePay ransomware attack right before the July 4th holiday. [...]",
        "Date": "2025-07-09",
        "Content": "Ingram Micro has begun restoring systems and business services after suffering a massive SafePay ransomware attack right before the July 4th holiday.\nLast Thursday, IT distributor and services giant Ingram Micro suffered a global outage, with their website and ordering systems taken offline, and employees told to work from home.\nSaturday morning, BleepingComputer exclusively reported that a SafePay ransomware attack was behind the outage, with the company confirming a ransomware attack later that night.\nSince Monday, Ingram Micro has begun restoring some of its business operations, stating that it has resumed accepting orders via phone and email in many countries. By Tuesday, this expanded to the US, Canada, and other countries.\n\"Subscription orders, including renewals and modifications, are available globally and are being processed centrally via Ingram Micro's support organization,\"\nIngram Micro announced on Monday\n.\n\"Additionally, we are now able to process orders received by phone or email from the UK, Germany, France, Italy, Portugal, Spain, Brazil, India, and China. Some limitations still exist with hardware and other technology orders, which will be clarified as orders are placed.\"\nIn addition, BleepingComputer has learned that the company performed a company-wide password and multi-factor authentication (MFA) reset, and has begun restoring VPN access to employees.\nNumerous internal systems and platforms, many related to ordering, logistics, and fulfillment, have been restored yesterday and today, allowing employees greater access to the company's ordering system.\nWhile Ingram Micro is quickly recovering from the attack, BleepingComputer was told that the restoration process is far from over, with employees gradually transitioning back to in-office work.\nIt is unclear whether data was stolen during the attack, and SafePay has not publicly claimed responsibility for the attack at this time.\nHowever, the ransomware gang is known for stealing data in their attacks, so if a ransom is not paid, we may see some indication of this in the coming days or weeks.\nBleepingComputer contacted Ingram Micro about whether data was believed to have been stolen and will update the story if we receive a response.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nIngram Micro outage caused by SafePay ransomware attack\nKettering Health hit by system-wide outage after ransomware attack\nM&S confirms social engineering led to massive ransomware attack\nIngram Micro suffers global outage as internal systems inaccessible\nJohnson Controls starts notifying people affected by 2023 breach"
    },
    {
        "Title": "Treasury sanctions North Korean over IT worker malware scheme",
        "Link": "https://www.bleepingcomputer.com/news/legal/treasury-sanctions-north-korean-over-it-worker-malware-scheme/",
        "Summary": "The U.S. Department of the Treasury sanctioned cyber actor Song Kum Hyok for his association with North Korea's hacking group Andariel and for facilitating IT worker schemes that generated revenue for the Pyongyang regime. [...]",
        "Date": "2025-07-09",
        "Content": "The U.S. Department of the Treasury sanctioned cyber actor Song Kum Hyok for his association with North Korea's hacking group Andariel and for facilitating IT worker schemes that generated revenue for the Pyongyang regime.\nConsidered a sub-cluster of the Lazarus group linked to North Korea's Reconnaissance General Bureau, the Andariel state actor is focused mostly on financially-motivated operations like ransomware (\nMaui\n,\nPlay\n) and\ncryptocurrency heists\n.\nSong Kum Hyok has been identified as a member of the Andariel hacking group (also known as APT45 and Silent Cholima) and has been providing fake or stolen U.S. identities to foreign IT workers seeking remote jobs at U.S. companies.\nThe workers split the income with Song, who sent the funds to North Korea as part of the country's effort to finance its WMD (weapons of mass destruction) and ballistic missile programs.\nSome of the workers also helped Andariel hackers' cyberattacks by stealing data, and deploying malware on the systems of the companies hiring them.\n“Song facilitated an information technology (IT) worker scheme in which individuals, often DPRK nationals working from countries such as China and Russia, were recruited and provided with falsified identities and nationalities to obtain employment at unwitting companies to generate revenue for the DPRK regime,”\nreads the U.S. Treasury announcement\n.\n“In some cases, these DPRK IT workers have been known to introduce malware into company networks for additional exploitation.”\nBetween 2022 and 2023, Song Kum Hyok used stolen U.S. citizens’ information (names, social security numbers, addresses) to create for his collaborators aliases that would get them hired by U.S. companies.\nRelated to these activities, the U.S. Treasury’s Office of Foreign Assets Control (OFAC) lists another five parties:\nGayk Asatryan\n– Russian national who employed DPRK IT workers through his companies\nAsatryan LLC\n– Russian company owned or controlled by Gayk Asatryan\nFortuna LLC\n– Russian company owned or controlled by Gayk Asatryan\nKorea Songkwang Trading General Corporation (Songkwang Trading)\n– North Korean company involved in dispatching IT workers to Russia\nKorea Saenal Trading Corporation (Saenal Trading)\n– North Korean company involved in the same activity\nU.S. Treasury sanctions include a freeze on all assets under U.S. jurisdiction, a transaction ban for U.S. individuals and companies, and cuts off access to U.S.-based payment processing platforms.\nFurthermore, non-U.S. entities like foreign banks and platforms that continue to do business with the sanctioned entities risk being sanctioned themselves.\nThis action comes shortly after the U.S. Department of Justice announced sweeping action against North Korean IT worker schemes in the country.\nOn July 1, 2025, the U.S. authorities performed searches at 29 “laptop farms”\nannouncing\none arrest, 12 indictments, and the seizure of 29 financial accounts, 21 websites, and 200 computers.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nUS disrupts North Korean IT worker \"laptop farm\" scheme in 16 states\nAeza Group sanctioned for hosting ransomware, infostealer servers\nGermany asks Google, Apple to remove DeepSeek AI from app stores\nHikvision Canada ordered to cease operations over security risks\nEuropol helps disrupt $540 million crypto investment fraud ring"
    },
    {
        "Title": "The MFA You Trust Is Lying to You – and Here's How Attackers Exploit It",
        "Link": "https://www.bleepingcomputer.com/news/security/the-mfa-you-trust-is-lying-to-you-and-heres-how-attackers-exploit-it/",
        "Summary": "MFA Authenticator apps aren't cutting it anymore. Attackers are bypassing legacy MFA with fake sites and real-time phishing. Token Ring and BioStick stop them cold—with fingerprint-bound hardware. Learn more from Token. [...]",
        "Date": "2025-07-09",
        "Content": "Still getting login codes via text or authenticator apps? You’re not alone—and that’s a big problem. What used to feel like a smart security layer is now one of the easiest ways for attackers to gain access to your accounts.\nFirst we were told to use SMS for MFA. Then we were told: “Don’t use SMS for MFA, use an authenticator app instead.”\nAnd while that may seem like a step forward, it’s still fundamentally flawed. Authenticator apps do improve over SMS by avoiding message interception, but they are easily fished (every day now) and often rely on time-based codes that can also be phished, relayed, or even intercepted if the device is compromised.\nThe core issue remains: the system has no idea whether it’s being used on the legitimate site or a perfect fake. So while it’s a different system, it’s not a secure one—just a broken version of the same problem.\nWant proof? Recent high-profile breaches (Including Aflac, Erie Insurance and Philadelphia Insurance Companies) showed exactly how easy this is.\nSome were calls to IT help desks asking for an MFA bypass or reset. But the favorite is quickly becoming a phishing/spoof trick.\nA phishing email lands. The user clicks. The spoofed website is pixel perfect. They enter their username, password, and they confirm it’s them on their auth app. Done. The attacker is in.\nBecause the authenticator app doesn’t verify who is asking or where the request came from - you become the attack vector.\nCISO Guide: Stopping Ransomware with Next-Gen MFA\nDownload to explore how ransomware attacks are evolving and why legacy MFA can’t keep up.\nThis guide reveals the real-world impact of phishing-resistant MFA, how it stops ransomware before damage is done, and why CISOs are switching to next-generation authentication.\nRead the CISO Guide\nThis is what no one wants to say out loud: authenticator apps and SMS codes can be phished in real time. They give users a false sense of security while offering little to no actual protection against the most common threat today—spoofed websites paired with social engineering.\nEven major platforms like Amazon and Google, according to recent investigations, use third-party SMS delivery firms—some with ties to surveillance operations. These intermediaries have already been linked to security breaches. Even the U.S. Cybersecurity and Infrastructure Security Agency (CISA) has issued a blunt warning: “Do not use SMS as a second factor.”\nSo you might think passkeys are an answer—and they are a small step forward but now are easily compromised as well. They cryptographically bind login credentials to websites and reduce human error. But they’re not foolproof. Passkeys are often stored and synced via cloud accounts.\nIf someone hijacks your Apple or Google account, they can gain access to every passkey you’ve saved. A stolen or compromised phone? Same risk. And malware or user coercion can still result in approvals that give attackers full access.\nSo what\nis\nthe solution? It's time to move past the illusion of codes and cloud-sync. Enter\nToken Ring\nand\nToken BioStick\n—purpose-built, biometric hardware authenticators that completely remove the weak links.\nHere’s why they work:\nNo cloud.\nNo shared secrets.\nNo reliance on user judgment.\nNo code entry.\nToken Ring and Token BioStick store your credentials inside tamper-proof secure elements. They only authenticate when your fingerprint matches, you're physically present, and the domain requesting access is verified cryptographically.\nEven if an attacker steals the device, it's useless without your fingerprint. Even if you’re tricked into visiting a fake site, it won't even come alive let alone authenticate—because the device must be in proximity to the device logging in, and even if someone figured that out, the cryptographic handshake fails automatically.\nThey cannot be phished. They cannot be hijacked remotely. They eliminate trust from the equation. That’s the power of biometric FIDO2 done right, in secure hardware, with no shortcuts.\nBottom line: If your MFA can be tricked by a fake website, it’s already obsolete.\nSMS is dead. Auth apps are legacy. Passkeys are progress—but flawed.\nToken Ring\nand\nToken BioStick\nare the gold standard. Phishing-proof. Tamper-resistant. Biometrically bound. Proximity required.\nAttackers are coming for your MFA and auth apps—it’s not a matter of\nif\n, but\nwhen\n. And every other method today? They fail.\nIt’s time to upgrade. Before you’re the next headline.\nSponsored and written by\nToken\n."
    },
    {
        "Title": "New ServiceNow flaw lets attackers enumerate restricted data",
        "Link": "https://www.bleepingcomputer.com/news/security/new-servicenow-flaw-lets-attackers-enumerate-restricted-data/",
        "Summary": "A new vulnerability in ServiceNow, dubbed Count(er) Strike, allows low-privileged users to extract sensitive data from tables to which they should not have access. [...]",
        "Date": "2025-07-09",
        "Content": "A new vulnerability in ServiceNow, dubbed Count(er) Strike, allows low-privileged users to extract sensitive data from tables to which they should not have access.\nServiceNow is a cloud-based platform that enables organizations to manage digital workflows for their enterprise operations. It is widely adopted across various industries, including public sector organizations, healthcare, financial institutions, and large enterprises.\nThe flaw was discovered by Varonis Threat Labs in February 2025 and assigned the CVE-2025-3648 identifier, and may impact configurations with misconfigured or overly permissive ACLs.\nServiceNow\nreleased additional access control frameworks\nin the Xanadu and Yokohama versions, released last month, to address the issue. However, all admins should review existing tables to ensure their data is properly locked down.\nThe Count(er) Strike flaw\nServiceNow utilizes Access Control Lists (ACLs) to restrict access to data within its tables. Each ACL evaluates four conditions when determining if a user should have access to a specific resource:\nRequired roles\nSecurity attributes\nData conditions\nScript conditions\nFor a user to gain access to a resource, all of these conditions must be satisfied.\nHowever, if a resource is protected with multiple ACLs, ServiceNow previously used an \"Allow if\" condition, meaning that if a user satisfied just one ACL, they could gain access, even if other ACLs would have blocked them.\nIn some cases, this granted full access. However, in others, it allowed partial access, such as record counts that could be exploited, as explained later in the article.\n\"Each resource or table in ServiceNow can have numerous ACLs, each defining different conditions for access,\"\nexplains the Varonis report.\n.\n\"However, if a user passes just one ACL, they gain access to the resource, even if other ACLs might not grant access. If there is no ACL present for the resource, access will default to the default access property which is set to deny in most cases.\"\nThis permissive model led Varonis to discover that it was possible to gain partial access, which could be used to enumerate protected data, even though the user may have failed more restrictive ACLs.\nVaronis found that if a user fails the\ndata\ncondition or\nscript\ncondition, ServiceNow still returns the record count in the UI and source HTML. The page also states that some results were removed due to security constraints.\nRestricted data still showing record counts and fields\nSource: Varonis\nWith this partial data, Varonis began manipulating URL-based filters, such as\nSTARTSWITH\n,\nCONTAINS\n,\n=\n, and\n!=\nto enumerate the contents of records one character or condition at a time.\nFor example:\nhttps://[my_company].service-now.com/task_list.do?sysparm_query=short_descriptionSTARTSWITHp\nRepeating this process with different values and queries allows for the retrieval of data one character or digit at a time.\nTo automate this procedure, Varonis created a script that successfully enumerated data records from a table to which they had limited access.\nEnumerating data using a script\nSource: Varonis\nEven when record data isn't displayed, the record count leaks enough information to determine fields, including credentials, PII, and internal configuration data.\nVaronis warned that self-registered users could also use this attack. Self-registration is a feature that allows users to create accounts and access the instance with minimal privileges, which can still be used to launch an attack.\n\"Though it is rare for instances to allow anonymous registration and access, this configuration was found in the ServiceNow systems of several Fortune 500 companies,\" warned Varonis.\nMitigating the attack\nVaronis told BleepingComputer that they tested the attack against ServiceNow's ITSM product, but stated that it should also apply to all ServiceNow products that utilize the same ACL logic.\nServiceNow has now addressed the attack by:\nIntroducing 'Deny Unless' ACLs, which require users to pass\nall\nACLs to gain access to a dataset.\nAdding Query ACLs, which restrict these types of enumeration queries using range operators.\nRecommending the use of Security Data Filters, which hide row counts and suppress inference cues.\nHowever, customers should still manually review their tables and modify ACLs to make sure they are not overly permissive, and thus vulnerable to this attack.\nVaronis says that it has not seen any evidence that this vulnerability has been exploited in the wild.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nAsana warns MCP AI feature exposed customer data to other orgs\nRuckus Networks leaves severe flaws unpatched in management devices\nMicrosoft July 2025 Patch Tuesday fixes one zero-day, 137 flaws\nWindows 10 KB5062554 cumulative update released with 13 changes, fixes\nPublic exploits released for Citrix Bleed 2 NetScaler flaw, patch now"
    },
    {
        "Title": "An NVIDIA Container Bug &amp; Chance to Harden Kubernetes",
        "Link": "https://www.darkreading.com/cloud-security/nvidia-container-bug-harden-kubernetes",
        "Summary": "A container escape flaw involving the NVIDIA Container Toolkit could have enabled a threat actor to access AI datasets across tenants.",
        "Date": "2025-07-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/nvidia-container-bug-harden-kubernetes"
    },
    {
        "Title": "New AI Malware PoC Reliably Evades Microsoft Defender",
        "Link": "https://www.darkreading.com/endpoint-security/ai-malware-poc-evades-microsoft-defender",
        "Summary": "Worried about hackers employing LLMs to write powerful malware? Using targeted reinforcement learning (RL) to train open source models in specific tasks has yielded the capability to do just that.",
        "Date": "2025-07-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/ai-malware-poc-evades-microsoft-defender"
    },
    {
        "Title": "Rubio Impersonator Signals Growing Security Threat From Deepfakes",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/rubio-impersonator-growing-security-threat-deepfakes",
        "Summary": "An impostor who posed as the secretary of state in text and voice communications with diplomats and politicians demonstrates the increased sophistication of and national security threat posed by the AI technology.",
        "Date": "2025-07-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/rubio-impersonator-growing-security-threat-deepfakes"
    },
    {
        "Title": "Know Your Enemy: Understanding Dark Market Dynamics",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/understanding-dark-market-dynamics",
        "Summary": "To help counter crime, today's organizations require a cyber-defense strategy that incorporates the mindset of the cybercriminal.",
        "Date": "2025-07-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/understanding-dark-market-dynamics"
    },
    {
        "Title": "SatanLock Next in Line for Ransomware Group Shutdowns",
        "Link": "https://www.darkreading.com/threat-intelligence/satanlock-ransomware-group-shutdowns",
        "Summary": "Though the victims list on its site has since been taken down, the group plans on leaking the rest of the files stolen from its victims.",
        "Date": "2025-07-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/satanlock-ransomware-group-shutdowns"
    },
    {
        "Title": "South Korean Government Imposes Penalties on SK Telecom for Breach",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/south-korea-imposes-penalties-sk-telecom-breach",
        "Summary": "Following a breach at the country's top mobile provider that exposed 27 million records, the South Korean government imposed a small monetary penalty but stiff regulatory requirements.",
        "Date": "2025-07-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/south-korea-imposes-penalties-sk-telecom-breach"
    },
    {
        "Title": "Microsoft Patch Tuesday, July 2025 Edition",
        "Link": "https://krebsonsecurity.com/2025/07/microsoft-patch-tuesday-july-2025-edition/",
        "Summary": "Microsoft today released updates to fix at least 137 security vulnerabilities in its Windows operating systems and supported software. None of the weaknesses addressed this month are known to be actively exploited, but 14 of the flaws earned Microsoft's most-dire \"critical\" rating, meaning they could be exploited to seize control over vulnerable Windows PCs with little or no help from users.",
        "Date": "2025-07-09",
        "Content": "Microsoft today released updates to fix at least 137 security vulnerabilities in its Windows operating systems and supported software. None of the weaknesses addressed this month are known to be actively exploited, but 14 of the flaws earned Microsoft’s most-dire “critical” rating, meaning they could be exploited to seize control over vulnerable Windows PCs with little or no help from users.\n\nWhile not listed as critical, CVE-2025-49719 is a publicly disclosed information disclosure vulnerability, with all versions as far back as SQL Server 2016 receiving patches. Microsoft rates CVE-2025-49719 as less likely to be exploited, but the availability of proof-of-concept code for this flaw means its patch should probably be a priority for affected enterprises.\nMike Walters, co-founder of Action1, said CVE-2025-49719 can be exploited without authentication, and that many third-party applications depend on SQL server and the affected drivers — potentially introducing a supply-chain risk that extends beyond direct SQL Server users.\n“The potential exposure of sensitive information makes this a high-priority concern for organizations handling valuable or regulated data,” Walters said. “The comprehensive nature of the affected versions, spanning multiple SQL Server releases from 2016 through 2022, indicates a fundamental issue in how SQL Server handles memory management and input validation.”\nAdam Barnett at Rapid7 notes that today is the end of the road for SQL Server 2012, meaning there will be no future security patches even for critical vulnerabilities, even if you’re willing to pay Microsoft for the privilege.\nBarnett also called attention to CVE-2025-47981, a vulnerability with a CVSS score of 9.8 (10 being the worst), a remote code execution bug in the way Windows servers and clients negotiate to discover mutually supported authentication mechanisms. This pre-authentication vulnerability affects any Windows client machine running Windows 10 1607 or above, and all current versions of Windows Server. Microsoft considers it more likely that attackers will exploit this flaw.\nMicrosoft also patched at least four critical, remote code execution flaws in Office (CVE-2025-49695, CVE-2025-49696, CVE-2025-49697, CVE-2025-49702). The first two are both rated by Microsoft as having a higher likelihood of exploitation, do not require user interaction, and can be triggered through the Preview Pane.\nTwo more high severity bugs include CVE-2025-49740 (CVSS 8.8) and CVE-2025-47178 (CVSS 8.0); the former is a weakness that could allow malicious files to bypass screening by Microsoft Defender SmartScreen, a built-in feature of Windows that tries to block untrusted downloads and malicious sites.\nCVE-2025-47178 involves a remote code execution flaw in Microsoft Configuration Manager, an enterprise tool for managing, deploying, and securing computers, servers, and devices across a network. Ben Hopkins at Immersive said this bug requires very low privileges to exploit, and that it is possible for a user or attacker with a read-only access role to exploit it.\n“Exploiting this vulnerability allows an attacker to execute arbitrary SQL queries as the privileged SMS service account in Microsoft Configuration Manager,” Hopkins said. “This access can be used to manipulate deployments, push malicious software or scripts to all managed devices, alter configurations, steal sensitive data, and potentially escalate to full operating system code execution across the enterprise, giving the attacker broad control over the entire IT environment.”\nSeparately, Adobe has released security updates for a broad range of software, including After Effects, Adobe Audition, Illustrator, FrameMaker, and ColdFusion.\nThe SANS Internet Storm Center has a breakdown of each individual patch, indexed by severity. If you’re responsible for administering a number of Windows systems, it may be worth keeping an eye on AskWoody for the lowdown on any potentially wonky updates (considering the large number of vulnerabilities and Windows components addressed this month).\nIf you’re a Windows home user, please consider backing up your data and/or drive before installing any patches, and drop a note in the comments if you encounter any problems with these updates.\n\r\n         This entry was posted on Tuesday 8th of July 2025 08:53 PM \r\n         \nDeath; Taxes ; M$ and other vulnerabilities from all “Providers”… Guarantees?…\n2 things happened today after my Win 10 and Win 11 machines were updated. Neither can see each other now. And the Win 11 Pro is now the Win 11 Pro Insider Version. Did not ask for that.\nNot sure about insider edition, but remote desktop still works on the one computer I have it set up on.\nSeems to have required two reboots on the two computers I watched.\nBut at least it didn’t ask to go through some setup procedures as sometimes occurs.\nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "Nippon Steel Subsidiary Blames Data Breach on Zero-Day Attack",
        "Link": "https://www.securityweek.com/nippon-steel-subsidiary-blames-data-breach-on-zero-day-attack/",
        "Summary": "<p>Nippon Steel Solutions has disclosed a data breach that resulted from the exploitation of a zero-day in network equipment.</p>\n<p>The post <a href=\"https://www.securityweek.com/nippon-steel-subsidiary-blames-data-breach-on-zero-day-attack/\">Nippon Steel Subsidiary Blames Data Breach on Zero-Day Attack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/nippon-steel-subsidiary-blames-data-breach-on-zero-day-attack/"
    },
    {
        "Title": "Samsung Announces Security Improvements for Galaxy Smartphones",
        "Link": "https://www.securityweek.com/samsung-announces-security-improvements-for-galaxy-smartphones/",
        "Summary": "<p>New Samsung Galaxy features include protections for on-device AI, expanded cross-device threat detection, and quantum-resistant encryption for network security.</p>\n<p>The post <a href=\"https://www.securityweek.com/samsung-announces-security-improvements-for-galaxy-smartphones/\">Samsung Announces Security Improvements for Galaxy Smartphones</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/samsung-announces-security-improvements-for-galaxy-smartphones/"
    },
    {
        "Title": "ICS Patch Tuesday: Vulnerabilities Addressed by Siemens, Schneider, Phoenix Contact",
        "Link": "https://www.securityweek.com/ics-patch-tuesday-vulnerabilities-addressed-by-siemens-schneider-phoenix-contact-2/",
        "Summary": "<p>Industrial solutions providers Siemens, Schneider Electric and Phoenix Contact have released July 2025 Patch Tuesday ICS security advisories.</p>\n<p>The post <a href=\"https://www.securityweek.com/ics-patch-tuesday-vulnerabilities-addressed-by-siemens-schneider-phoenix-contact-2/\">ICS Patch Tuesday: Vulnerabilities Addressed by Siemens, Schneider, Phoenix Contact</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/ics-patch-tuesday-vulnerabilities-addressed-by-siemens-schneider-phoenix-contact-2/"
    },
    {
        "Title": "Unpatched Ruckus Vulnerabilities Allow Wireless Environment Hacking",
        "Link": "https://www.securityweek.com/unpatched-ruckus-vulnerabilities-allow-wireless-environment-hacking/",
        "Summary": "<p>Multiple vulnerabilities in Ruckus Wireless management products could be exploited to fully compromise the managed environments.</p>\n<p>The post <a href=\"https://www.securityweek.com/unpatched-ruckus-vulnerabilities-allow-wireless-environment-hacking/\">Unpatched Ruckus Vulnerabilities Allow Wireless Environment Hacking</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/unpatched-ruckus-vulnerabilities-allow-wireless-environment-hacking/"
    },
    {
        "Title": "Canadian Electric Utility Says Power Meters Disrupted by Cyberattack",
        "Link": "https://www.securityweek.com/canadian-electric-utility-says-power-meters-disrupted-by-cyberattack/",
        "Summary": "<p>Nova Scotia Power is notifying individuals affected by the recent data breach, including in the United States.</p>\n<p>The post <a href=\"https://www.securityweek.com/canadian-electric-utility-says-power-meters-disrupted-by-cyberattack/\">Canadian Electric Utility Says Power Meters Disrupted by Cyberattack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/canadian-electric-utility-says-power-meters-disrupted-by-cyberattack/"
    },
    {
        "Title": "Ivanti, Fortinet, Splunk Release Security Updates",
        "Link": "https://www.securityweek.com/ivanti-fortinet-splunk-release-security-updates/",
        "Summary": "<p>Ivanti, Fortinet, and Splunk have released patches for critical- and high-severity vulnerabilities in their products.</p>\n<p>The post <a href=\"https://www.securityweek.com/ivanti-fortinet-splunk-release-security-updates/\">Ivanti, Fortinet, Splunk Release Security Updates</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/ivanti-fortinet-splunk-release-security-updates/"
    },
    {
        "Title": "Alleged Chinese State Hacker Wanted by US Arrested in Italy",
        "Link": "https://www.securityweek.com/alleged-chinese-state-hacker-wanted-by-us-arrested-in-italy/",
        "Summary": "<p>Xu Zewei has been arrested on charges that he is a member of the Chinese state-sponsored hacking group Hafnium (Silk Typhoon).</p>\n<p>The post <a href=\"https://www.securityweek.com/alleged-chinese-state-hacker-wanted-by-us-arrested-in-italy/\">Alleged Chinese State Hacker Wanted by US Arrested in Italy</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/alleged-chinese-state-hacker-wanted-by-us-arrested-in-italy/"
    }
]