[
    {
        "Title": "Hackers Leverage Microsoft Teams to Spread Matanbuchus 3.0 Malware to Targeted Firms",
        "Link": "https://thehackernews.com/2025/07/hackers-leverage-microsoft-teams-to.html",
        "Summary": "Cybersecurity researchers have flagged a new variant of a known malware loader called Matanbuchus that packs in significant features to enhance its stealth and evade detection.\nMatanbuchus is the name given to a malware-as-a-service (MaaS) offering that can act as a conduit for next-stage payloads, including Cobalt Strike beacons and ransomware.\nFirst advertised in February 2021 on",
        "Date": "2025-07-16",
        "Content": "Cybersecurity researchers have flagged a new variant of a known malware loader called\nMatanbuchus\nthat packs in significant features to enhance its stealth and evade detection.\nMatanbuchus is the name given to a malware-as-a-service (MaaS) offering that can act as a conduit for\nnext-stage payloads\n, including Cobalt Strike beacons and ransomware.\nFirst\nadvertised\nin February 2021 on Russian-speaking cybercrime forums for a rental price of $2,500, the malware has been put to use as part of\nClickFix-like lures\nto trick users visiting legitimate-but-compromised sites not running it.\nMatanbuchus stands out among loaders because it's not usually spread through spam emails or drive-by downloads. Instead, it's often deployed using hands-on social engineering, where attackers trick users directly. In some cases, it supports the kind of initial access used by brokers who sell entry to ransomware groups. This makes it more targeted and coordinated than typical commodity loaders.\nThe latest version of the loader, tracked as Matanbuchus 3.0, incorporates several new features, including improved communication protocol techniques, in-memory capabilities, enhanced obfuscation methods, CMD and PowerShell reverse shell support, and the ability to run next-stage DLL, EXE, and shellcode payloads, per Morphisec.\nThe cybersecurity company said it observed the malware in an incident earlier this month where an unnamed company was targeted via external Microsoft Teams calls that impersonated an IT help desk and tricked employees into launching Quick Assist for remote access and then executing a PowerShell script that deployed Matanbuchus.\nIt's worth noting that similar social engineering tactics have been\nemployed\nby threat actors associated with the Black Basta ransomware operation.\n\"Victims are carefully targeted and persuaded to execute a script that triggers the download of an archive,\" Morphisec CTO Michael Gorelik\nsaid\n. \"This archive contains a renamed Notepad++ updater (GUP), a slightly modified configuration XML file, and a malicious side-loaded DLL representing the Matanbuchus loader.\"\nMatanbuchus 3.0 has been advertised publicly for a monthly price of $10,000 for the HTTPS version and $15,000 for the DNS version.\nOnce launched, the malware collects system information and iterates over the list of running processes to determine the presence of security tools. It also checks the status of its process to check if it's running with administrative privileges.\nIt then sends the gathered details to a command-and-control (C2) server to receive additional payloads in the form of MSI installers and portable executables. Persistence on the shot is achieved by setting up a scheduled task.\n\"While it sounds simple, Matanbuchus developers implemented advanced techniques to schedule a task through the usage of\nCOM\nand injection of shellcode,\" Gorelik explained. \"The shellcode itself is interesting; it implements a relatively basic API resolution (simple string comparisons), and a sophisticated COM execution that manipulates the\nITaskService\n.\"\nThe loader also comes fitted with features that can be invoked remotely by the C2 server to collect all executing processes, running services, and a list of installed applications.\n\"The Matanbuchus 3.0 Malware-as-a-Service has evolved into a sophisticated threat,\" Gorelik said. \"This updated version introduces advanced techniques such as improved communication protocols, in-memory stealth, enhanced obfuscation, and support for WQL queries, CMD, and PowerShell reverse shells.\"\n\"The loader's ability to execute regsvr32, rundll32, msiexec, or process hollowing commands underscores its versatility, making it a significant risk to compromised systems.\"\nAs malware-as-a-service evolves, Matanbuchus 3.0 fits into a broader trend of stealth-first loaders that rely on LOLBins (living-off-the-land binaries), COM object hijacking, and PowerShell stagers to stay under the radar.\nThreat researchers are increasingly mapping these loaders as part of attack surface management strategies and linking them to abuse of enterprise collaboration tools like Microsoft Teams and Zoom.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "UNC6148 Backdoors Fully-Patched SonicWall SMA 100 Series Devices with OVERSTEP Rootkit",
        "Link": "https://thehackernews.com/2025/07/unc6148-backdoors-fully-patched.html",
        "Summary": "A threat activity cluster has been observed targeting fully-patched end-of-life SonicWall Secure Mobile Access (SMA) 100 series appliances as part of a campaign designed to drop a backdoor called OVERSTEP.\nThe malicious activity, dating back to at least October 2024, has been attributed by the Google Threat Intelligence Group (GTIG) to a hacking crew it tracks as UNC6148. The number of known",
        "Date": "2025-07-16",
        "Content": "A threat activity cluster has been observed targeting fully-patched\nend-of-life\nSonicWall Secure Mobile Access (SMA) 100 series appliances as part of a campaign designed to drop a backdoor called\nOVERSTEP\n.\nThe malicious activity, dating back to at least October 2024, has been\nattributed\nby the Google Threat Intelligence Group (GTIG) to a hacking crew it tracks as\nUNC6148\n. The number of known victims is \"limited\" at this stage.\nThe tech giant assessed with high confidence that the threat actor is \"leveraging credentials and one-time password (OTP) seeds stolen during previous intrusions, allowing them to regain access even after organizations have applied security updates.\"\n\"Analysis of network traffic metadata records suggests that UNC6148 may have initially exfiltrated these credentials from the SMA appliance as early as January 2025.\"\nThe exact initial access vector used to deliver the malware is currently not known due to the steps taken by the threat actors to remove log entries. But it's believed that access may have been gained through the exploitation of known security flaws such as\nCVE-2021-20035\n,\nCVE-2021-20038, CVE-2021-20039\n,\nCVE-2024-38475\n, or\nCVE-2025-32819\n.\nAlternately, the tech giant's threat intelligence team theorized that the administrator credentials could've been obtained through information-stealing logs or acquired from credential marketplaces. However, it said it didn't find any evidence to back up this hypothesis.\nUpon gaining access, the threat actors have been found to establish an SSL-VPN session and spawn a reverse shell, although how this was achieved remains a mystery given that shell access should not be possible by design on these appliances. It's believed that it may have been pulled off by means of a zero-day flaw.\nThe reverse shell is used to run reconnaissance and file manipulation commands, not to mention export and import settings to the SMA appliance, suggesting that UNC6148 may have altered an exported settings file offline to include new rules so that their operations are not interrupted or blocked by the access gateways.\nThe attacks culminate in the deployment of a previously undocumented implant named OVERSTEP that's capable of modifying the appliance's boot process to maintain persistent access, as well as credential theft and concealing its own components to evade detection by patching various file system-related functions.\nThis is achieved by implementing a usermode rootkit through the hijacked standard library functions open and readdir, allowing it to hide the artifacts associated with the attack. The malware also hooks into the write API function to receive commands from an attacker-controlled server in the form of embedded within web requests -\ndobackshell\n, which starts a reverse shell to the specified IP address and port\ndopasswords\n, which creates a TAR archive of the files /tmp/temp.db, /etc/EasyAccess/var/conf/persist.db, and /etc/EasyAccess/var/cert, and save it in the location \"/usr/src/EasyAccess/www/htdocs/\" so that it can be downloaded via a web browser\n\"UNC6148 modified the legitimate RC file '/etc/rc.d/rc.fwboot' to achieve persistence for OVERSTEP,\" GTIG said. \"The changes meant that whenever the appliance was rebooted, the OVERSTEP binary would be loaded into the running file system on the appliance.\"\nOnce the deployment step is complete, the threat actor then proceeds to clear the system logs and reboots the firewall to activate the execution of the C-based backdoor. The malware also attempts to remove the command execution traces from different log files, including httpd.log, http_request.log, and inotify.log.\n\"The actor's success in hiding their tracks is largely due to OVERSTEP's capability to selectively delete log entries [from the three log files],\" Google said. \"This anti-forensic measure, combined with a lack of shell history on disk, significantly reduces visibility into the actor's secondary objectives.\"\nGoogle has evaluated with medium confidence that UNC6148 may have weaponized an unknown, zero-day remote code execution vulnerability to deploy OVERSTEP on targeted SonicWall SMA appliances. Furthermore, it's suspected that the operations are carried out with the intent to facilitate data theft and extortion operations, and even ransomware deployment.\nThis connection stems from the fact that one of the organizations that was targeted by UNC6148 was posted on the data leak site operated by World Leaks, an extortion gang run by individuals previously associated with the Hunters International ransomware scheme. It's worth noting that Hunters International recently\nshuttered\nits criminal enterprise.\nAccording to Google, UNC6148 exhibits tactical overlaps with prior exploitation of SonicWall SMA devices observed in July 2023 that involved an unknown threat actor deploying a web shell, a hiding mechanism, and a way to ensure persistence across firmware upgrades, per\nTruesec\n.\nThe exploitation activity was subsequently\nlinked\nby security researcher Stephan Berger to the deployment of the Abyss ransomware.\nThe findings once again highlight how threat actors are increasingly focusing on edge network systems that aren't usually covered by common security tools like Endpoint Detection and Response (EDR) or antivirus software and slip into target networks unnoticed.\n\"Organizations should acquire disk images for forensic analysis to avoid interference from the rootkit anti-forensic capabilities. Organizations may need to engage with SonicWall to capture disk images from physical appliances,\" Google said.\nWhen reached for comment on the findings, SonicWall told The Hacker News that it has been \"working closely\" with GTIG throughout the whole process, and that it plans to accelerate the end-of-support date for the SMA 100 series. It also said it intends to support existing SMA 100 deployments with firmware updates throughout the remaining lifecycle.\n\"In response to the evolving threat landscape – and in alignment with our commitment to transparency and customer protection – SonicWall will accelerate the end-of-support date for the SMA 100 series from October 1, 2027, to December 31, 2025,\" the company said. \"The SMA 100 has already reached end-of-sale status, as reflected in our Product Lifecycle Table, and this update aligns with our long-term strategy and industry direction.\"\n\"SonicWall has been actively guiding customers toward more modern, secure solutions such as our Cloud Secure Edge service and the SMA 1000 series. These platforms are built on advanced technology stacks and offer stronger security, greater scalability, and an improved user experience – better suited for today's distributed and cloud-connected environments. This mirrors broader industry trends, where leading vendors like Cisco and Palo Alto Networks have moved customers from legacy hardware to cloud-native architectures.\"\n(The story was updated after publication to include a response from SonicWall.)\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Critical Golden dMSA Attack in Windows Server 2025 Enables Cross-Domain Attacks and Persistent Access",
        "Link": "https://thehackernews.com/2025/07/critical-golden-dmsa-attack-in-windows.html",
        "Summary": "Cybersecurity researchers have disclosed what they say is a \"critical design flaw\" in delegated Managed Service Accounts (dMSAs) introduced in Windows Server 2025.\n\"The flaw can result in high-impact attacks, enabling cross-domain lateral movement and persistent access to all managed service accounts and their resources across Active Directory indefinitely,\" Semperis said in a report shared with",
        "Date": "2025-07-16",
        "Content": "Cybersecurity researchers have disclosed what they say is a \"critical design flaw\" in delegated Managed Service Accounts (dMSAs) introduced in Windows Server 2025.\n\"The flaw can result in high-impact attacks, enabling cross-domain lateral movement and persistent access to all managed service accounts and their resources across Active Directory indefinitely,\" Semperis said in a report shared with The Hacker News.\nPut differently, successful exploitation could allow adversaries to sidestep authentication guardrails and generate passwords for all Delegated Managed Service Accounts (\ndMSAs\n) and group Managed Service Accounts (\ngMSAs\n) and their associated service accounts.\nThe persistence and privilege escalation method has been codenamed\nGolden dMSA\n, with the cybersecurity company deeming it as low complexity owing to the fact that the vulnerability simplifies brute-force password generation.\nHowever, in order for bad actors to exploit it, they must already be in possession of a Key Distribution Service (KDS)\nroot key\nthat's typically only available to privileged accounts, such as root Domain Admins, Enterprise Admins, and SYSTEM.\nDescribed as the crown jewel of Microsoft's gMSA infrastructure, the KDS root key serves as a master key, allowing an attacker to derive the current password for any dMSA or gMSA account without having to connect to the domain controller (DC).\n\"The attack leverages a critical design flaw: A structure that's used for the password-generation computation contains predictable time-based components with only 1,024 possible combinations, making brute-force password generation computationally trivial,\" security researcher Adi Malyanker\nsaid\n.\nDelegated Managed Service Accounts is a new feature\nintroduced\nby Microsoft that facilitates migration from an existing legacy service account. It was introduced in Windows Server 2025 as a way to counter Kerberoasting attacks.\nThe machine accounts bind authentication directly to explicitly authorized machines in Active Directory (AD), thus eliminating the possibility of credential theft. By tying authentication to device identity, only specified machine identities mapped in AD can access the account.\nGolden dMSA, similar to\nGolden gMSA\nActive Directory\nattacks\n, plays out over four steps once an attacker has obtained elevated privileges within a domain -\nExtracting KDS root key material by elevating to SYSTEM privileges on one of the domain controllers\nEnumerating dMSA accounts using\nLsaOpenPolicy\nand\nLsaLookupSids\nAPIs or via a Lightweight Directory Access Protocol (\nLDAP\n)-based approach\nIdentifying the\nManagedPasswordID\nattribute and password hashes through targeted guessing\nGenerating valid passwords (i.e., Kerberos tickets) for any gMSA or dMSA associated with the compromised key and testing them via\nPass the Hash\nor\nOverpass the Hash\ntechniques\n\"This process requires no additional privileged access once the KDS root key is obtained, making it a particularly dangerous persistence method,\" Malyanker said.\n\"The attack highlights the critical trust boundary of managed service accounts. They rely on domain-level cryptographic keys for security. Although automatic password rotation provides excellent protection against typical credential attacks, Domain Admins, DnsAdmins, and Print Operators can bypass these protections entirely and compromise all of the dMSAs and gMSAs in the forest.\"\nSemperis noted that the Golden dMSA technique turns the breach into a forest-wide persistent backdoor, given that compromising the KDS root key from any single domain within the forest is enough to breach every dMSA account across all domains in that forest.\nIn other words, a single KDS root key extraction can be weaponized to achieve cross-domain account compromise, forest-wide credential harvesting, and lateral movement across domains using the compromised dMSA accounts.\n\"Even in environments with multiple KDS root keys, the system consistently uses the first (oldest) KDS root key for compatibility reasons,\" Malyanker pointed out. \"This means that the original key we've compromised could be preserved by Microsoft's design – creating a persistent backdoor that could last for years.\"\nEven more concerning is that the attack completely sidesteps normal\nCredential Guard\nprotections, which are used to secure NTLM password hashes, Kerberos Ticket Granting Tickets (TGTs), and credentials so that only privileged system software can access them.\nFollowing responsible disclosure on May 27, 2025, Microsoft said, \"If you have the secrets used to derive the key, you can authenticate as that user. These features have never been intended to protect against a compromise of a domain controller.\" Semperis has also\nreleased\nan open-source as proof-of-concept (PoC) to demonstrate the attack.\n\"What starts as one DC compromise escalates to owning every dMSA-protected service across an entire enterprise forest,\" Malyanker said. \"It's not just privilege escalation. It's enterprise-wide digital domination through a single cryptographic vulnerability.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "AI Agents Act Like Employees With Root Access—Here's How to Regain Control",
        "Link": "https://thehackernews.com/2025/07/ai-agents-act-like-employees-with-root.html",
        "Summary": "The AI gold rush is on. But without identity-first security, every deployment becomes an open door. Most organizations secure native AI like a web app, but it behaves more like a junior employee with root access and no manager.\nFrom Hype to High Stakes\nGenerative AI has moved beyond the hype cycle. Enterprises are:\n\nDeploying LLM copilots to accelerate software development\nAutomating customer",
        "Date": "2025-07-16",
        "Content": "The AI gold rush is on. But without identity-first security, every deployment becomes an open door. Most organizations secure native AI like a web app, but it behaves more like a junior employee with root access and no manager.\nFrom Hype to High Stakes\nGenerative AI has moved beyond the hype cycle. Enterprises are:\nDeploying LLM copilots to accelerate software development\nAutomating customer service workflows with AI agents\nIntegrating AI into financial operations and decision-making\nWhether building with open-source models or plugging into platforms like OpenAI or Anthropic, the goal is speed and scale. But what most teams miss is this:\nEvery LLM access point or website is a new identity edge. And every integration adds risk unless identity and device posture are enforced.\nWhat Is the AI Build vs. Buy Dilemma?\nMost enterprises face a pivotal decision:\nBuild\n: Create in-house agents tailored to internal systems and workflows\nBuy\n: Adopt commercial AI tools and SaaS integrations\nThe threat surface doesn't care which path you choose.\nCustom-built agents\nexpand internal attack surfaces, especially if access control and identity segmentation aren't enforced at runtime.\nThird-party tools\nare often misused or accessed by unauthorized users, or more commonly, corporate users on personal accounts, where governance gaps exist.\nSecuring AI isn't about the algorithm, it's about who (or what device) is talking to it, and what permissions that interaction unlocks.\nWhat's Actually at Risk?\nAI agents are agentic which is to say they can take actions on a human's behalf and access data like a human would. They're often embedded in business-critical systems, including:\nSource code repositories\nFinance and payroll applications\nEmail inboxes\nCRM and ERP platforms\nCustomer support logs and case history\nOnce a user or device is compromised, the AI agent becomes a high-speed backdoor to sensitive data. These systems are highly privileged, and AI amplifies attacker access.\nCommon AI-Specific Threat Vectors:\nIdentity-based attacks\nlike credential stuffing or session hijacking targeting LLM APIs\nMisconfigured agents\nwith excessive permissions and no scoped role-based access control (RBAC)\nWeak session integrity\nwhere infected or insecure devices request privileged actions through LLMs\nHow to Secure Enterprise AI Access\nTo eliminate AI access risk without killing innovation, you need:\nPhishing-resistant MFA\nfor every user and device accessing LLMs or agent APIs\nGranular RBAC\ntied to business roles—developers shouldn't access finance models\nContinuous device trust enforcement\n, using signals from EDR, MDM, and ZTNA\nAI access control must evolve from a one-time login check to a real-time policy engine that reflects current identity and device risk.\nThe Secure AI Access Checklist:\nNo shared secrets\nNo trusted device assumptions\nNo over-permissioned agents\nNo productivity tax\nThe Fix: Secure AI Without Slowing Down\nYou don't have to trade security for speed. With the right architecture, it's possible to:\nBlock unauthorized users and devices by default\nEliminate trust assumptions at every layer\nSecure AI workflows without interrupting legitimate use\nBeyond Identity makes this possible today.\nBeyond Identity's IAM platform makes unauthorized access to AI systems impossible by enforcing phishing-resistant, device-aware, continuous access control for AI systems. No passwords. No shared secrets. No untrustworthy devices.\nBeyond Identity is also prototyping a secure-by-design architecture for in-house AI agents that binds agent permissions to verified user identity and device posture—enforcing RBAC at runtime and continuously evaluating risk signals from EDR, MDM, and ZTNA. For instance, if an engineer loses CrowdStrike full disk access, the agent immediately blocks access to sensitive data until posture is remediated.\nWant a First Look?\nRegister for Beyond Identity's webinar\nto get a behind-the-scenes look at\nhow a Global Head of IT Security built and secured his internal, enterprise AI agents that's now used by 1,000+ employees.\nYou'll see a demo of how one of Fortune's Fastest Growing Companies uses phishing-resistant, device-bound access controls to make unauthorized access impossible.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "New Konfety Malware Variant Evades Detection by Manipulating APKs and Dynamic Code",
        "Link": "https://thehackernews.com/2025/07/new-konfety-malware-variant-evades.html",
        "Summary": "Cybersecurity researchers have discovered a new, sophisticated variant of a known Android malware referred to as Konfety that leverages the evil twin technique to enable ad fraud.\nThe sneaky approach essentially involves a scenario wherein two variants of an application share the same package name: A benign \"decoy\" app that's hosted on the Google Play Store and its evil twin, which is",
        "Date": "2025-07-16",
        "Content": "Cybersecurity researchers have discovered a new, sophisticated variant of a known Android malware referred to as\nKonfety\nthat leverages the evil twin technique to enable ad fraud.\nThe sneaky approach essentially involves a scenario wherein two variants of an application share the same package name: A benign \"decoy\" app that's hosted on the Google Play Store and its evil twin, which is distributed via third-party sources.\nIt's worth pointing out that the decoy apps don't have to be necessarily published by threat actors themselves and could be legitimate. The only caveat is that the malicious apps share the exact same package names as their real counterparts already available on the Play Store.\n\"The threat actors behind Konfety are highly adaptable, consistently altering their targeted ad networks and updating their methods to evade detection,\" Zimperium zLabs researcher Fernando Ortega\nsaid\n. \"This latest variant demonstrates their sophistication by specifically tampering with the APK's ZIP structure.\"\nBy using malformed APKs, the tactic allows threat actors to sidestep detection and challenge reverse engineering efforts. Besides dynamically loading the main DEX (Dalvik Executable) payload at runtime, the newly discovered versions enable the general-purpose bit flag by setting it to \"\nBit 0\n,\" signaling to the system that the file is encrypted.\nThis behavior, in turn, triggers a false password prompt when attempting to inspect the Android package, thereby blocking access and complicating attempts to analyze its contents.\nThe second technique entails falsely declaring the use of BZIP compression method in the app's manifest XML file (\"AndroidManifest.xml\"), causing analysis tools like APKTool and JADX to crash due to a parsing failure. A similar compression-based defense evasion technique was previously highlighted by Kaspersky in another Android malware called\nSoumniBot\n.\nThe use of dynamic code loading to execute the primary payload affords added stealth during initial scans or reverse engineering, Zimperium noted. During execution, the DEX payload is decrypted and loaded directly into memory without attracting any red flags.\n\"This multi-layered obfuscation approach, combining encrypted assets, runtime code injection, and deceptive manifest declarations, demonstrates the evolving sophistication of the Konfety operation and its continuous efforts to evade analysis and bypass detection mechanisms,\" Ortega said.\nLike the previous iteration reported by HUMAN last year, Konfety abuses the CaramelAds software development kit (SDK) to fetch ads, deliver payloads, and maintain communication with attacker-controlled servers.\nIt comes with capabilities to redirect users to malicious websites, prompt unwanted app installs, and trigger persistent spam-like browser notifications. Furthermore, the malware hides its app icon and uses geofencing to alter its functionality based on the victim's region.\nThe development comes as ANY.RUN detailed a Chinese Android\npacker\ntool known as Ducex that's mainly designed to conceal embedded payloads like\nTriada\nwithin fake Telegram apps.\n\"The packer employs serious obfuscation through function encryption using a modified RC4 algorithm with added shuffling,\" ANY.RUN researcher Alina Markova\nsaid\n. \"Ducex creates major roadblocks for debugging. It performs APK signature verification, failing if the app is re-signed. It also employs self-debugging using fork and ptrace to block external tracing.\"\nOn top of that, Ducex is designed to detect the presence of popular analysis tools such as Frida, Xposed, and Substrate, and if present, terminate itself.\nThe findings also follow a new study published by a team of researchers from TU Wien and the University of Bayreuth about a novel technique dubbed TapTrap that can be weaponized by a malicious app to covertly bypass Android's permission system and gain access to sensitive data or execute destructive actions.\nThe attack, in a nutshell, hijacks user interactions on Android devices by overlaying animations or games on a user's screen, while surreptitiously launching user interface elements underneath that trick users into performing undesirable actions, such as installing malware or granting the app intrusive permissions.\n\"Normally, Android shows an animation when the screen changes, such as the new screen sliding or fading in,\" researchers Philipp Beer, Marco Squarcina, Sebastian Roth, and Martina Lindorfer\nsaid\n. \"However, the app can tell the system that a custom animation should be used instead that is long-running and makes the new screen fully transparent, keeping it hidden from you.\"\n\"Any taps you make during this animation go to the hidden screen, not the visible app. The app can then use this to lure you into tapping on specific areas of the screen that correspond to sensitive actions on the hidden screen, allowing it to perform actions without your knowledge.\"\nIn a hypothetical attack scenario, a threat actor-released game installed by the victim can secretly open a web browser session and dupe them into granting camera permissions to a malicious website.\nThat said, TapTrap's impact extends beyond the Android ecosystem, opening the door to tapjacking and web clickjacking attacks. The issue has been addressed in\nGrapheneOS\n, Chrome 135 (\nCVE-2025-3067\n), and Firefox 136 (\nCVE-2025-1939\n). Android 16 continues to remain susceptible to the attack.\nWhen reached for comment, Google told The Hacker News that it's working to mitigate the problem in an upcoming Android update, adding the operating system already has defenses in place to prevent\ntapjacking attacks\n. It also pointed out that there is no evidence of any malicious Play Store apps abusing the technique in the wild.\n\"Android is constantly improving its existing mitigations against tapjacking attacks. We are aware of this research and we will be addressing this issue in a future update,\" a Google spokesperson said. \"Google Play has policies in place to keep users safe that all developers must adhere to, and if we find that an app has violated our policies, we take appropriate action.\"\n(The story was updated after publication to include a response from Google on the TapTrap attack.)\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Deepfakes. Fake Recruiters. Cloned CFOs — Learn How to Stop AI-Driven Attacks in Real Time",
        "Link": "https://thehackernews.com/2025/07/deepfakes-fake-recruiters-cloned-cfos.html",
        "Summary": "Social engineering attacks have entered a new era—and they’re coming fast, smart, and deeply personalized.\nIt’s no longer just suspicious emails in your spam folder. Today’s attackers use generative AI, stolen branding assets, and deepfake tools to mimic your executives, hijack your social channels, and create convincing fakes of your website, emails, and even voice. They don’t just spoof—they",
        "Date": "2025-07-16",
        "Content": "Social engineering attacks have entered a new era—and they're coming fast, smart, and deeply personalized.\nIt's no longer just suspicious emails in your spam folder. Today's attackers use generative AI, stolen branding assets, and deepfake tools to mimic your executives, hijack your social channels, and create convincing fakes of your website, emails, and even voice. They don't just spoof—\nthey impersonate.\nModern attackers aren't relying on chance. They're running long-term, multi-channel campaigns across email, LinkedIn, SMS, and even support portals—targeting your employees, customers, and partners.\nWhether it's a fake recruiter reaching out on LinkedIn, a lookalike login page sent via text, or a cloned CFO demanding a wire transfer, the tactics are faster, more adaptive, and increasingly automated using AI.\nThe result? Even trained users are falling for sophisticated fakes—because they're not just phishing links anymore. They're operations.\nThis Webinar Shows You How to Fight Back\nJoin us for a deep dive\ninto how\nDoppel's real-time AI platform\ndetects and disrupts social engineering threats before they escalate.\nYou'll learn how AI can be used not just to spot suspicious signals, but to\nunderstand attacker behavior\n, track impersonation campaigns across platforms, and respond instantly—before reputational or financial damage occurs.\nWhat You'll Learn\nThe Modern Threat Landscape:\nHow AI-powered social engineering campaigns are evolving—and what that means for your current defenses.\nReal-Time Defense:\nHow Doppel identifies impersonation attempts and shuts them down before users engage.\nShared Intelligence at Scale:\nHow learning from attacks across thousands of brands helps make deception unprofitable.\nImpersonation attacks are scaling faster than any human team can monitor manually. Security awareness training isn't enough. Static detection rules fall short. You need a defense that thinks and adapts in real-time.\nDoppel's AI learns from every attack attempt—so your protection keeps getting smarter.\nWho Should Attend:\nSecurity leaders responsible for brand trust and executive protection, SOC teams overwhelmed by phishing and impersonation alerts, and risk, fraud, or threat intelligence professionals seeking faster, smarter signal-to-action.\nWatch this Webinar\nDon't wait for an impersonation attack to make the first move. Learn how to fight back—before it happens. Save Your Spot.\nRegister Now\n→\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Urgent: Google Releases Critical Chrome Update for CVE-2025-6558 Exploit Active in the Wild",
        "Link": "https://thehackernews.com/2025/07/urgent-google-releases-critical-chrome.html",
        "Summary": "Google on Tuesday rolled out fixes for six security issues in its Chrome web browser, including one that it said has been exploited in the wild.\nThe high-severity vulnerability in question is CVE-2025-6558 (CVSS score: 8.8), which has been described as an incorrect validation of untrusted input in the browser's ANGLE and GPU components.\n\"Insufficient validation of untrusted input in ANGLE and",
        "Date": "2025-07-16",
        "Content": "Google on Tuesday rolled out fixes for six security issues in its Chrome web browser, including one that it said has been exploited in the wild.\nThe high-severity vulnerability in question is\nCVE-2025-6558\n(CVSS score: 8.8), which has been described as an incorrect validation of untrusted input in the browser's ANGLE and GPU components.\n\"Insufficient validation of untrusted input in ANGLE and GPU in Google Chrome prior to 138.0.7204.157 allowed a remote attacker to potentially perform a sandbox escape via a crafted HTML page,\" according to the\ndescription\nof the flaw from the NIST's National Vulnerability Database (NVD).\nANGLE, short for \"Almost Native Graphics Layer Engine,\" acts as a translation layer between Chrome's rendering engine and device-specific graphics drivers. Vulnerabilities in the module can let attackers escape Chrome's sandbox by abusing low-level GPU operations that browsers usually keep isolated, making this a rare but powerful path to deeper system access.\nFor most users, a sandbox escape like this means that visiting a malicious site is sufficient to potentially break out of the browser's security bubble and interact with the underlying system. This is especially critical in targeted attacks where just opening a webpage could trigger a silent compromise without requiring any download or click.\nClément Lecigne and Vlad Stolyarov of Google's Threat Analysis Group (TAG) have been credited with discovering and reporting the zero-day vulnerability on June 23, 2025.\nThe exact nature of the attacks weaponizing the flaw has not been disclosed, but Google\nacknowledged\nthat an \"exploit for CVE-2025-6558 exists in the wild.\" That said, the discovery by TAG alludes to the possibility of nation-state involvement.\nThe development comes about two weeks after Google addressed another actively exploited Chrome zero-day (\nCVE-2025-6554\n, CVSS score: 8.1), which was also reported by Lecigne on June 25, 2025.\nGoogle has resolved a total of five zero-day vulnerabilities in Chrome that have been either actively exploited or demonstrated as a proof-of-concept (PoC) since the start of the year. This includes:\nCVE-2025-2783\n,\nCVE-2025-4664\n,\nCVE-2025-5419\n, and\nCVE-2025-6554\n.\nTo safeguard against potential threats, it's advised to update their Chrome browser to versions 138.0.7204.157/.158 for Windows and Apple macOS, and 138.0.7204.157 for Linux. To make sure the latest updates are installed, users can\nnavigate\nto More > Help > About Google Chrome, and select Relaunch.\nUsers of other Chromium-based browsers such as Microsoft Edge, Brave, Opera, and Vivaldi are also advised to apply the fixes as and when they become available.\nIssues like this often fall under broader categories like GPU sandbox escapes, shader-related bugs, or WebGL vulnerabilities. While not always headline-grabbing, they tend to resurface in chained exploits or targeted attacks. If you follow Chrome security updates, it's worth keeping an eye out for graphics driver flaws, privilege boundary bypasses, and memory corruption in rendering paths, as they often point to the next round of patch-worthy bugs.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Google AI \"Big Sleep\" Stops Exploitation of Critical SQLite Vulnerability Before Hackers Act",
        "Link": "https://thehackernews.com/2025/07/google-ai-big-sleep-stops-exploitation.html",
        "Summary": "Google on Tuesday revealed that its large language model (LLM)-assisted vulnerability discovery framework discovered a security flaw in the SQLite open-source database engine before it could have been exploited in the wild.\nThe vulnerability, tracked as CVE-2025-6965 (CVSS score: 7.2), is a memory corruption flaw affecting all versions prior to 3.50.2. It was discovered by Big Sleep, an",
        "Date": "2025-07-16",
        "Content": "Google on Tuesday revealed that its large language model (LLM)-assisted vulnerability discovery framework discovered a security flaw in the SQLite open-source database engine before it could have been exploited in the wild.\nThe vulnerability, tracked as\nCVE-2025-6965\n(CVSS score: 7.2), is a memory corruption flaw affecting all versions prior to 3.50.2. It was discovered by\nBig Sleep\n, an artificial intelligence (AI) agent that was launched by Google last year as part of a collaboration between DeepMind and Google Project Zero.\n\"An attacker who can inject arbitrary SQL statements into an application might be able to cause an integer overflow resulting in read off the end of an array,\" SQLite project maintainers\nsaid\nin an advisory.\nThe tech giant described CVE-2025-6965 as a critical security issue that was \"known only to threat actors and was at risk of being exploited.\" Google did not reveal who the threat actors were.\n\"Through the combination of threat intelligence and Big Sleep, Google was able to actually predict that a vulnerability was imminently going to be used and we were able to cut it off beforehand,\" Kent Walker, President of Global Affairs at Google and Alphabet,\nsaid\n.\n\"We believe this is the first time an AI agent has been used to directly foil efforts to exploit a vulnerability in the wild.\"\nIn October 2024, Big Sleep was\nbehind\nthe discovery of another flaw in SQLite, a stack buffer underflow vulnerability that could have been exploited to result in a crash or arbitrary code execution.\nCoinciding with the development, Google has also published a white paper to build secure AI agents such that they have well-defined human controllers, their capabilities are carefully limited to avoid potential rogue actions and sensitive data disclosure, and their actions are observable and transparent.\n\"Traditional systems security approaches (such as restrictions on agent actions implemented through classical software) lack the contextual awareness needed for versatile agents and can overly restrict utility,\" Google's Santiago (Sal) Díaz, Christoph Kern, and Kara Olive\nsaid\n.\n\"Conversely, purely reasoning-based security (relying solely on the AI model's judgment) is insufficient because current LLMs remain susceptible to manipulations like prompt injection and cannot yet offer sufficiently robust guarantees.\"\nTo mitigate the key risks associated with agent security, the company said it has adopted a hybrid defense-in-depth approach that combines the strengths of both traditional, deterministic controls and dynamic, reasoning-based defenses.\nThe idea is to create robust boundaries around the agent's operational environment so that the risk of harmful outcomes is significantly mitigated, specifically malicious actions carried out as a result of prompt injection.\n\"This defense-in-depth approach relies on enforced boundaries around the AI agent's operational environment to prevent potential worst-case scenarios, acting as guardrails even if the agent's internal reasoning process becomes compromised or misaligned by sophisticated attacks or unexpected inputs,\" Google said.\n\"This multi-layered approach recognizes that neither purely rule-based systems nor purely AI-based judgment are sufficient on their own.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Co-op confirms data of 6.5 million members stolen in cyberattack",
        "Link": "https://www.bleepingcomputer.com/news/security/co-op-confirms-data-of-65-million-members-stolen-in-cyberattack/",
        "Summary": "UK retailer Co-op has confirmed that personal data of 6.5 million members was stolen in the massive cyberattack in April that shut down systems and caused food shortages in its grocery stores. [...]",
        "Date": "2025-07-16",
        "Content": "UK retailer Co-op has confirmed that personal data of 6.5 million members was stolen in the massive cyberattack in April that shut down systems and caused food shortages in its grocery stores.\nCo-op (short for the Co-operative Group) is one of the United Kingdom's largest consumer co-operatives, operating food stores, funeral services, insurance, and legal services. It is owned by millions of members who receive discounts on services and share in the company's governance.\nCo-op's CEO, Shirine Khoury-Haq, apologized today on the BBC Breakfast show, confirming that the attackers successfully stole the data for all of its 6.5 million members.\n\"Their data was copied, and the criminals did have access to it like they do when they hack other organizations. That is the awful part of this unfortunately,\" said Khoury-Haq.\nWhile no financial or transaction information was exposed in the attack, the contact information for its members was stolen.\nThe CEO said the breach felt like a personal attack, not on her, but rather on the Co-op's members and employees who were impacted.\n\"And it it's not about me. It was my colleagues. It was personal to me because it hurt them. It hurt my members. They took their data and it hurt our customers and that I do take personally,\" she explained in the interview.\nThe\ncyberattack occurred in April\n, forcing Co-op to shut down several IT systems to prevent the threat actors from further spreading to devices and ultimately deploying the DragonForce ransomware encryptor.\nInitially downplayed as an attempted intrusion into its network, the\ncompany later confirmed\nthat a \"significant\" amount of data was accessed and stolen during the attack.\nSources told BleepingComputer at the time that the breach initially occurred on April 22, after the threat actors conducted a social engineering attack that allowed them to reset an employee's password.\nOnce they gained access to the network, they spread to other devices and ultimately stole the Windows domain's Windows NTDS.dit file. This file is a database for Windows Active Directory Services that contains password hashes for Windows accounts.\nThreat actors commonly steal this file to extract and crack passwords offline, allowing them to further spread to other devices on the network.\nBleepingComputer was told that the attack was linked to threat actors associated with Scattered Spider, who were linked to the\nMarks & Spencer (M&S) cyberattack\nwhere the DragonForce ransomware was deployed.\nThe BBC reported that they spoke to the DragonForce ransomware operator about Co-op, who confirmed one of its affiliates was behind the attack. They also shared samples of data with the BBC, claiming that Co-op's corporate and customer data had been stolen during the attack.\nLast week, the UK's National Crime Agency (NCA)\narrested four people\nsuspected of being involved in the attacks on Co-op, M&S, and an attempted one on\nHarrods\n.\nThe arrested individuals are two 19-year-old males, one 17-year-old male, and a 20-year-old female, who were apprehended in London and the West Midlands.\nIt is\nreported\nthat one of the suspects arrested is linked to a 2023\nattack on MGM Resorts\nthat resulted in the\nencryption of over 100 VMware ESXi virtual machines\n.\nThe MGM attack was also attributed to Scattered Spider, who was working with the BlackCat ransomware operation at the time.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nM&S confirms social engineering led to massive ransomware attack\nQantas discloses cyberattack amid Scattered Spider aviation breaches\nService desks are under attack: What can you do about it?\nLouis Vuitton says regional data breaches tied to same cyberattack\nFour arrested in UK over M&S, Co-op, Harrods cyberattacks"
    },
    {
        "Title": "U.S. Army soldier pleads guilty to extorting 10 tech, telecom firms",
        "Link": "https://www.bleepingcomputer.com/news/security/us-army-soldier-pleads-guilty-to-extorting-10-tech-telecom-firms/",
        "Summary": "A 21-year old former U.S. Army soldier pleaded guilty to charges of hacking and extorting at least ten telecommunications and technology companies in the country. [...]",
        "Date": "2025-07-16",
        "Content": "A 21-year old former U.S. Army soldier pleaded guilty to charges of hacking and extorting at least ten telecommunications and technology companies in the country.\nCameron John Wagenius was arrested in Texas on December 20, 2024 and indicted in the Western District of Washington on two counts of unlawful transfer of confidential phone records.\nIn February 2025, the man\npleaded guilty\nto hacking AT&T and Verizon, for which Connor Moucka and John Binnswere had been\nindicted in November 2024\n, linking their activities to the major Snowflake hacking incident.\nAccording to the latest U.S. DoJ announcement, Wagenius was active in the underground cyberspace between 2023 and 2024 under the aliases 'kiberphant0m', 'cyb3rph4nt0m', and 'buttholio'.\nHe conspired with others to steal login credentials, access sensitive IT systems, and demand ransom payments from breached telecommunication firms under the threat of leaking stolen data on cybercrime forums such as BreachForums and XSS.is.\n“Between April 2023 and Dec. 18, 2024, Cameron John Wagenius, 21, used online accounts associated with the nickname “kiberphant0m” and conspired with others to defraud at least 10 victim organizations by obtaining login credentials for the organizations’ protected computer networks,”\nreads the U.S. DoJ announcement\n.\n“The conspirators obtained these credentials using a hacking tool that they called SSH Brute, among other means.”\n“They used Telegram group chats to transfer stolen credentials and discuss gaining unauthorized access to victim companies’ networks.”\nWagenius and his co-conspirators also engaged in SIM-swapping and announced stolen data sales on said forums, attempting extortion for up to $1 million.\nIt has been confirmed that the threat actors successfully sold some of this data to other cybercriminals or used it to perpetrate further fraud.\nThe authorities underline that Wagenius performed these activities while he was on active duty with the U.S. Army.\nWagenius was\nindicted on July 14th\nfor wire fraud conspiracy, aggravated identity theft, and extortion in relation to computer fraud.\nA message he left one of the victims threatened with leaking more than 358GB of data unless the organization contacted him to negotiate a ransom payment. In an email to another victim company, Wagenius asked for $500,000 in cryptocurrency.\nA day after the indictment, Wagenius entered a\nplea agreement\n, admitting guilt on all three charges.\nBased on these charges, the man faces a possible maximum sentence of up to 27 years in prison.\nThe punishment will be decided on October 6, and it may also include additional time for\nWagenius’ previous guilty plea\nfor two counts of unlawful transfer of confidential phone records information concerning the separate case.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nPowerSchool hacker pleads guilty to student data extortion scheme\nQantas is being extorted in recent data-theft cyberattack\nHunters International ransomware shuts down, releases free decryptors\nHunters International shifts from ransomware to pure data extortion\nDOJ investigates ex-ransomware negotiator over extortion kickbacks"
    },
    {
        "Title": "Louis Vuitton says regional data breaches tied to same cyberattack",
        "Link": "https://www.bleepingcomputer.com/news/security/louis-vuitton-says-regional-data-breaches-tied-to-same-cyberattack/",
        "Summary": "Luxury fashion giant Louis Vuitton confirmed that breaches impacting customers in the UK, South Korea, and Turkey stem from the same security incident, which is believed to be linked to the ShinyHunters extortion group. [...]",
        "Date": "2025-07-16",
        "Content": "Luxury fashion giant Louis Vuitton confirmed that breaches impacting customers in the UK, South Korea, and Turkey stem from the same security incident, which is believed to be linked to the ShinyHunters extortion group.\nSince last week, the retailer has been notifying customers that their info was exposed in a data breach, first in South Korea, then in Turkey, and on Friday in the United Kingdom.\n\"Despite all security measures in place, on July 2, 2025, we became aware of a personal data breach resulting from the exfiltration of certain personal data of some of our clients following an unauthorized access to our system,\" reads Louis Vuitton's data breach notifications sent to customers.\n\"We would like to assure you that our cybersecurity teams have taken care of the incident with the utmost diligence and attention. Technical measures were immediately taken to contain the incident after its occurence, notably by blocking the unauthorized access.\n\"Louis Vuitton teams are mobilized to cooperate with the competent authorities which have been notified, including the Information Commissioner's Office (the ICO).\"\nLouis Vuitton data breach notification to UK customers\nSource:\nTeytey2022\n(Reddit)\nIn a statement to BleepingComputer, Louis Vuitton confirmed that no payment information was compromised from the database accessed during the incident.\nThe company further stated that it is working with cybersecurity experts to investigate the incident and has begun notifying relevant regulators.\nWhen asked if the breach notifications in the different regions are linked to the same security incident, BleepingComputer was told that their statement applies to all notifications sent to clients.\nThis incident follows similar breaches\ndisclosed by Tiffany & Co. in April\nand\nHouse of Dior in May\n, affecting customers in South Korea.\nWhen BleepingComputer asked if the Louis Vuitton and Dior breaches were part of the same cyberattack, a LVMH spokesperson said there was no additional information they could share at this time.\nHowever, sources have told BleepingComputer that the LVMH breaches are linked to an attack by the ShinyHunters extortion group, which gained access and stole data from a third-party vendor's database.\nThis same attack is also believed to be tied to a\ndata breach at Adidas\ndisclosed in May that also impacted customers from South Korea and Turkey.\nShinyHunters is a prolific threat actor tied to numerous data theft campaigns, including those against\nSalesforce\nand\nPowerSchool\n, as well as the\nSnowFlake attacks\n, which impacted\nSantander\n,\nTicketmaster\n,\nAT&T\n,\nAdvance Auto Parts\n,\nNeiman Marcus\n, and\nCylance\n.\nLast month, French police arrested five operators of the BreachForum cybercrime forum, which included ShinyHunters members, who had helped re-launch the hacking forum.\nHowever, it is believed that other members of the group are still at large, so other attacks may appear under that alias in the future.\nBleepingComputer contacted Louis Vuitton to ask if ShinyHunters was behind its breach but did not receive a response at this time.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nQantas discloses cyberattack amid Scattered Spider aviation breaches\nJohnson Controls starts notifying people affected by 2023 breach\nVictoria’s Secret restores critical systems after cyberattack\nTexas Dept. of Transportation breached, 300k crash records stolen\nCartier discloses data breach amid fashion brand cyberattacks"
    },
    {
        "Title": "Cloudflare says 1.1.1.1 outage not caused by attack or BGP hijack",
        "Link": "https://www.bleepingcomputer.com/news/security/cloudflare-says-1111-outage-not-caused-by-attack-or-bgp-hijack/",
        "Summary": "To quash speculation of a cyberattack or BGP hijack incident causing the recent 1.1.1.1 Resolver service outage, Cloudflare explains in a post mortem that the incident was caused by an internal misconfiguration. [...]",
        "Date": "2025-07-16",
        "Content": "To quash speculation of a cyberattack or BGP hijack incident causing the recent 1.1.1.1 Resolver service outage, Cloudflare explains in a post mortem that the incident was caused by an internal misconfiguration.\nThe outage occurred on July 14 and impacted most users of the service all over the world, rendering internet services unavailable in many cases.\n“The root cause was an internal configuration error and not the result of an attack or a BGP hijack,”\nCloudflare says in the announcement\n.\nThis statement comes after people reported on social media that the outage was caused by a BGP hijack.\nGlobal outage unfolding\nCloudflare's 1.1.1.1 public DNS resolver launched in 2018 promising a private and fast internet connectivity service to users worldwide.\nThe company explains that behind the outage was a configuration change for a future Data Localization Suite (DLS) performed on June 6, which mistakenly linked 1.1.1.1 Resolver IP prefixes to a non-production DLS service.\nOn July 14 at 21:48 UTC, a new update added a test location to the inactive DLS service, refreshing the network configuration globally and applying the misconfiguration.\nThis withdrew 1.1.1.1 Resolver prefixes from Cloudflare’s production data centers and routed them to a single offline location, making the service globally unreachable.\nLess than four minutes later, DNS traffic to the 1.1.1.1 Resolver began to drop. By 22:01 UTC, Cloudflare detected the incident and disclosed it to the public.\nThe misconfiguration was reverted at 22:20 UTC, and Cloudflare began re-advertising the withdrawn BGP prefixes. Finally, full service restoration at all locations was achieved at 22:54 UTC.\nThe incident affected multiple IP ranges, including 1.1.1.1 (main public DNS resolver), 1.0.0.1 (secondary public DNS resolver), 2606:4700:4700::1111 and 2606:4700:4700::1001 (main and secondary IPv6 DNS resolvers, and multiple IP ranges that support routing within Cloudflare infrastructure.\nOutage impacting key IP ranges\nSource: Cloudflare\nRegarding the incident’s impact on protocols, UDP, TCP, and DNS-over-TLS (DoT) queries to the above addresses saw a significant drop in volume, but DNS-over-HTTPS (DoH) traffic was largely unaffected as it follows a different routing via cloudflare-dns.com.\nIncident's impact for each protocol\nSource: Cloudflare\nNext steps\nThe misconfiguration could have been rejected if Cloudflare had used a system that performed progressive rollout, the internet giant admits, blaming the use of legacy systems for this failure.\nFor this reason, it plans to deprecate legacy systems and accelerate migration to newer configuration systems that utilize abstract service topologies instead of static IP bindings, allowing for gradual deployment, health monitoring at each stage, and quick rollbacks in the event that issues arise.\nCloudflare also points out that the misconfiguration had passed peer review and wasn’t caught due to insufficient internal documentation of service topologies and routing behavior, an area that the company also plans to improve.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nRussia’s throttling of Cloudflare makes sites inaccessible\nCloudflare: Outage not caused by security incident, data is safe\nGoogle Cloud and Cloudflare hit by widespread service outages\nIngram Micro starts restoring systems after ransomware attack\nIngram Micro suffers global outage as internal systems inaccessible"
    },
    {
        "Title": "SonicWall SMA devices hacked with OVERSTEP rootkit tied to ransomware",
        "Link": "https://www.bleepingcomputer.com/news/security/sonicwall-sma-devices-hacked-with-overstep-rootkit-tied-to-ransomware/",
        "Summary": "A threat actor has been deploying a previously unseen malware called OVERSTEP that modifies the boot process of fully-patched but no longer supported SonicWall Secure Mobile Access appliances. [...]",
        "Date": "2025-07-16",
        "Content": "A threat actor has been deploying a previously unseen malware called OVERSTEP that modifies the boot process of fully-patched but no longer supported SonicWall Secure Mobile Access appliances.\nThe backdoor is a user-mode rootkit that allows hackers to hide malicious components, maintain persistent access on the device, and steal sensitive credentials.\nResearchers at Google Threat Intelligence Group (GTIG) observed the rootkit in attacks that may have relied on “an unknown, zero-day remote code execution vulnerability”.\nThe threat actor is tracked as UNC6148 and has been operating since at least last October, with an organization being targeted as recently as May.\nBecause files stolen from the victim were later published on the World Leaks (\nHunters International rebrand\n) data-leak site, GTIG researchers believe that UNC6148 engages in data theft and extortion attacks, and may also deploy Abyss ransomware (tracked as  VSOCIETY by GTIG).\nHackers come prepared\nThe hackers are targeting end-of-life (EoL) SonicWall SMA 100 Series devices that provide secure remote access to enterprise resources on the local network, in the cloud, or hybrid datacenters.\nIt is unclear how the hackers obtained initial access, but researchers investigating UNC6148 attacks noticed that the threat actor already had local administrator credentials on the targeted appliance.\n“GTIG assesses with high confidence that UNC6148 exploited a known vulnerability to steal administrator credentials prior to the targeted SMA appliance being updated to the latest firmware version (10.2.1.15-81sv)” - Google Threat Intelligence Group\nLooking at the network traffic metadata, the investigators found evidence suggesting that UNC6148 had stolen the credentials for the targeted appliance in January.\nMultiple n-day vulnerabilities (\nCVE-2021-20038\n,\nCVE-2024-38475\n,\nCVE-2021-20035\n,\nCVE-2021-20039\n,\nCVE-2025-32819\n) could have been exploited to this effect, the oldest of them disclosed in 2021 and the most recent being from May 2025.\nOf these, the hackers may have exploited CVE-2024-38475 as it provides “local administrator credentials and valid session tokens that UNC6148 could reuse.”\nHowever, incident responders at Mandiant (a Google company) could not confirm that the attacker exploited the vulnerability.\nReverse-shell mystery\nIn an attack in June, UNC6148 used the local admin credentials to connect to the targeted SMA 100 series appliance over an SSL-VPN session.\nThe hackers started a reverse shell, although shell access should not be possible by design on these appliances.\nSonicWall’s Product Security Incident Response Team (PSIRT) tried to determine how this was possible but could not come up with an explanation, and one answer could be the exploitation of an unknown security issue.\nWith shell access on the appliance, the threat actor ran reconnaissance and file manipulation activities, and imported settings that included new network access control policy rules to allow the hacker’s IP addresses.\nOVERSTEP rootkit leaves no clues\nAfter this, UNC6148 deployed the OVERSTEP rootkit through a series of commands that decoded the binary from base64 and planted it as a .ELF file.\n“Following the installation, the attacker manually cleared the system logs before restarting the appliance, activating the OVERSTEP backdoor” - Google Threat Intelligence Group\nOVERSTEP acts as a backdoor that establishes a reverse shell and steals passwords from the host. It also implements user-mode rootkit capabilities to keep its components hidden on the host.\nThe rootkit component gave the threat actor long-term persistence by loading and executing malicious code each time a dynamic executable starts.\nOVERSTEP’s anti-forensic feature lets the attacker selectively delete log entries and thus cover their tracks. This capability and the lack of command history on disk denied researchers’ visibility in the threat actor’s post-compromise activities.\nHowever, GTIG warns that OVERSTEP can steal sensitive files such as the\npersist.db\ndatabase and certificate files, which give hackers access to credentials, OTP seeds, and certificates that allow persistence.\nWhile researchers cannot determine the true purpose of UNC6148’s attacks, they highlight “noteworthy overlaps” in this threat actor’s activity and analysis of incidents where Abyss-related ransomware was deployed.\nIn late 2023, Truesec researchers\ninvestigated\nan Abyss ransowmare incident that occurred after hackers deployed a web shell on an SMA appliance, hiding mechanism, and established persistence across firmware updates.\nA few months later in March 2024, InfoGuard AG incident responder Stephan Berger\npublished a post\ndescribing a similar compromise of an SMA device that ended with the deployment of the same Abyss malware.\nOrganizations with SMA appliances are recommended to check the devices for potential compromise by acquiring disk images, which should prevent interference from the rootkit.\nGTIG provides a set of indicators of compromise along with the signs analysts should look for to determine if the device was hacked.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nHackers abuse Microsoft ClickOnce and AWS services for stealthy attacks\nAtomic macOS infostealer adds backdoor for persistent attacks\nSonicWall warns of trojanized NetExtender stealing VPN logins\nSitecore CMS exploit chain starts with hardcoded 'b' password\nSentinelOne shares new details on China-linked breach attempt"
    },
    {
        "Title": "New Fortinet FortiWeb hacks likely linked to public RCE exploits",
        "Link": "https://www.bleepingcomputer.com/news/security/new-fortinet-fortiweb-hacks-likely-linked-to-public-rce-exploits/",
        "Summary": "Multiple Fortinet FortiWeb instances recently infected with web shells are believed to have been compromised using public exploits for a recently patched remote code execution (RCE) flaw tracked as CVE-2025-25257. [...]",
        "Date": "2025-07-16",
        "Content": "Multiple Fortinet FortiWeb instances recently infected with web shells are believed to have been compromised using public exploits for a recently patched remote code execution (RCE) flaw tracked as CVE-2025-25257.\nNews of the exploitation activity comes from threat monitoring platform The Shadowserver Foundation, which observed 85 infections on July 14 and 77 on the next day.\nThe researchers\nreported\nthat these Fortinet FortiWeb instances are believed to be compromised through the CVE-2025-25257 flaw.\nCVE-2025-25257 is a critical pre-authenticated RCE via SQL injection (SQLi) affecting FortiWeb 7.6.0 through 7.6.3, 7.4.0 through 7.4.7, 7.4.0 through 7.4.7, and 7.0.0 through 7.0.10.\nFortinet released patches on July 8, 2025, urging users to upgrade to FortiWeb 7.6.4, 7.4.8, 7.2.11, or 7.0.11 and later versions of each branch.\n\"An improper neutralization of special elements used in an SQL command ('SQL Injection') vulnerability in FortiWeb may allow an unauthenticated attacker to execute unauthorized SQL code or commands via crafted HTTP or HTTPs requests,\"\nexplained Fortinet\n.\nOn July 11,\nexploits were made public\nby cybersecurity firm WatchTowr, and a co-discoverer of the flaw, \"faulty *ptrrr.\" These exploits demonstrated methods for planting webshells or opening reverse shells on unpatched endpoints.\nThe exploitation involves performing SQLi via crafted Authorization headers in HTTP requests sent to /api/fabric/device/status, which writes a malicious .pth file into Python's 'site-packages.'\nA legitimate FortiWeb CGI script (/cgi-bin/ml-draw.py) is then accessed remotely, causing the code in the malicious .pth file to be executed and achieving remote code execution on the device.\nAt the time, there was no evidence of active exploitation in the wild, but the release of public exploits made patching critical for administrators.\nToday's confirmation of active exploitation by The Shadowserver Foundation can be seen as a wake-up call for those who have yet to install the latest software on their devices.\nAccording to the threat intelligence organization, 223 FortiWeb management interfaces were still exposed as of yesterday, although there's no visibility into the version they run.\nOf the compromised endpoints, most (40) are located in the United States, followed by the Netherlands (5), Singapore (4), and the United Kingdom (4).\nFortiWeb is a Web Application Firewall (WAF) used by large enterprises, government agencies, and managed security service providers to block and detect unwanted HTTP traffic.\nIf upgrading to a secure version immediately is impossible, it is recommended to turn off the HTTP/HTTPS administrative interface to restrict access to the vulnerable component (/api/fabric/device/status).\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nHackers are exploiting critical RCE flaw in Wing FTP Server\nHackers exploited Windows WebDav zero-day to drop malware\nHackers are exploiting critical flaw in vBulletin forum software\nHackers exploit OttoKit WordPress plugin flaw to add admin accounts\nGoogle fixes actively exploited sandbox escape zero day in Chrome"
    },
    {
        "Title": "Europol disrupts pro-Russian NoName057(16) DDoS hacktivist group",
        "Link": "https://www.bleepingcomputer.com/news/security/europol-disrupts-pro-russian-noname05716-ddos-hacktivist-group/",
        "Summary": "An international law enforcement operation dubbed \"Operation Eastwood\" has targeted the infrastructure of the pro-Russian hacktivist group NoName057(16), responsible for distributed denial-of-service (DDoS) attacks across Europe and the US. [...]",
        "Date": "2025-07-16",
        "Content": "An international law enforcement operation dubbed \"Operation Eastwood\" has targeted the infrastructure and members of the pro-Russian hacktivist group NoName057(16), responsible for distributed denial-of-service (DDoS) attacks across Europe, Israel, and Ukraine.\nOperation Eastwood was led by Europol and Eurojust with support from 12 countries. It took place on July 15, 2025, and targeted the systems and individuals behind the group's activities.\nNoName057(16) is a pro-Russian hacking group that launched in March 2022 after the war in Ukraine began. To conduct attacks, the group uses Telegram channels and the \"\nDDoSia\n\" project, software that runs on volunteers' computers to crowdsource DDoS attacks on targets selected by the threat actors.\nSince then, NoName057(16) and its supporters have carried out DDoS attacks against companies and critical infrastructure in European countries that support Ukraine. These targets include NATO sites, government agencies, transportation services, banks, defense firms, media outlets, and energy suppliers.\nAccording to\nEuropol\n, the attacks disrupted critical services in Germany, Poland, Lithuania, Latvia, Estonia, Sweden, the Netherlands, and other countries.​\nNoName057(16) announcing an attack on Telegram\nSource: BleepingComputer\n\"The hacktivist group has executed 14 attacks in Germany, some of them lasting multiple days and affecting around 230 organisations including arms factories, power suppliers and government organisations,\" reads a\nstatement from Eurojust\n.\n\"Attacks were also executed across Europe during the European elections. In Sweden, authorities and bank websites were targeted, while in Switzerland multiple attacks were carried out during a video message given by the Ukrainian President to the Joint Parliament in June 2023, and during the Peace Summit for Ukraine in June 2024.\"\n\"Most recently, the Netherlands was targeted during the NATO Summit at the end of June.\"\nOn July 15, law enforcement agencies conducted searches in Germany, Latvia, Spain, Italy, Czechia, Poland, and France, with more than 100 servers hosting the group's infrastructure disrupted or taken offline.\nTwo arrests have been made as part of this operation (1 preliminary arrest in France and 1 in Spain), and seven European arrest warrants were issued, including six by Germany and one by Spain. The authorities also sent Telegram messages to 1,100 participants and 17 administrators, warning them that they were facing criminal liability for their actions.\nSix of the warrants issued by Germany are for individuals believed to be residing in Russia, with two of them suspected of being the primary operators of the group.\nResults of Operation Eastwood\nSource: Europol\nThe operation involved law enforcement from Czechia, Estonia, Finland, France, Germany, Latvia, Lithuania, the Netherlands, Poland, Spain, Sweden, Switzerland, and the United States.\nAuthorities claim that Operation Eastwood is a significant blow to NoName057(16). However, with the core members located in Russia, this action is likely to have only a short-lived effect, as the threat actors will likely rebuild their infrastructure.\nAs of today, the threat actors continue to announce new attacks and breaches of German companies.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nAPT28 hackers use Signal chats to launch new malware attacks on Ukraine\nNew PathWiper data wiper malware hits critical infrastructure in Ukraine\nUkraine claims it hacked Tupolev, Russia’s strategic warplane maker\nRussian Laundry Bear cyberspies linked to Dutch Police hack\nRussian hackers breach orgs to track aid routes to Ukraine"
    },
    {
        "Title": "Grok 4 benchmark results: Tops math, ranks second in coding",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/grok-4-benchmark-results-tops-math-ranks-second-in-coding/",
        "Summary": "Grok 4 is a huge leap from Grok 3, but how good is it compared to other models in the market, such as Gemini 2.5 Pro? We now have answers, thanks to new independent benchmarks. [...]",
        "Date": "2025-07-16",
        "Content": "Grok 4 is a huge leap from Grok 3, but how good is it compared to other models in the market, such as Gemini 2.5 Pro? We now have answers, thanks to new independent benchmarks.\nLMArena.ai, which is an open platform for crowdsourced AI benchmarking, has\npublished\nthe results of Grok 4.\nWe're talking about Grok 4 API (grok-4-0709), which received about 4k+ community votes and ranks #3 overall in Text Arena. This is a huge leap from Grok 3, which ranked 8th.\nAccording to LMArena's tests, Grok 4 scores Top-3 across all categories (#1 in Math, #2 in Coding, #3 in Hard Prompts).\nGrok 4 was tested with real-world prompts across domains like coding, math, as well as creative writing, and it performed really well:\nMath: #1\nCoding: #2\nCreative Writing: #2\nInstruction Following: #2\nHard Prompts: #3\nHowever, it is worth noting that the tested model is Grok 4, not Grok 4 Heavy.\nWhile both are reasoning models, Grok 4 Heavy is significantly better.\nThe numbers could be different with Grok 4 Heavy, which uses multiple agents to think and compare results, but the Grok 4 Heavy model is not yet available on the API platform.\nGemini 2.5 Pro and Claude still remain the best models for coding, but that might change when xAI ships Grok 4 Code in August.\nGrok 4 Code is optimised for coding, and we're also expecting a CLI, similar to Gemini CLI and Claude Code.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nLeak suggests xAI is getting ready to ship Grok 3.5\nGrok 4 spotted ahead of launch with special coding features\nOpenAI's image model gets built-in style feature on ChatGPT\nGoogle Gemini flaw hijacks email summaries for phishing\nOpenAI says GPT-5 will unify breakthroughs from different models"
    },
    {
        "Title": "Google fixes actively exploited sandbox escape zero day in Chrome",
        "Link": "https://www.bleepingcomputer.com/news/security/google-fixes-actively-exploited-sandbox-escape-zero-day-in-chrome/",
        "Summary": "Google has released a security update for Chrome to address half a dozen vulnerabilities, one of them actively exploited by attackers to escape the browser's sandbox protection. [...]",
        "Date": "2025-07-16",
        "Content": "Google has released a security update for Chrome to address half a dozen vulnerabilities, one of them actively exploited by attackers to escape the browser's sandbox protection.\nThe vulnerability is identified as\nCVE-2025-6558\nand received a high-severity rating of 8.8. It was discovered by researchers at Google’s Threat Analysis Group (TAG) on June 23.\nThe security issue is described as an insufficient validation of untrusted input in ANGLE and GPU that affects Google Chrome versions before 138.0.7204.157. An attacker successfully exploiting it could perform a sandbox escape by using a specially crafted HTML page.\nANGLE (Almost Native Graphics Layer Engine) is an open-source graphics abstraction layer used by Chrome to translate OpenGL ES API calls to Direct3D, Metal, Vulkan, and OpenGL.\nBecause ANGLE processes GPU commands from untrusted sources like websites using WebGL, bugs in this component can have a critical security impact.\nThe vulnerability allows a remote attacker using a specially crafted HTML page to execute arbitrary code within the browser’s GPU process. Google has not provided the technical details on how triggering the issue could lead to escaping the browser's sandbox.\n“Access to bug details and links may be kept restricted until a majority of users are updated with a fix,”\nstates Google in the security bulletin\n.\n“We will also retain restrictions if the bug exists in a third-party library that other projects similarly depend on, but haven’t yet fixed.”\nChrome sandbox component is a core security mechanism that isolates browser processes from the underlying operating system, thus preventing malware from spreading outside the web browser to compromise the device.\nGiven the high risk and active exploitation status of CVE-2025-6558, Chrome users are advised to update as soon as possible to version 138.0.7204.157/.158, depending on their operating system.\nYou can do this by navigating to\nchrome://settings/help\nand allowing the update check to finish. Updates will be applied successfully after restarting the web browser.\nThe current Chrome security update contains fixes for five more vulnerabilities, including a high-severity flaw in the V8 engine tracked as CVE-2025-7656, and a use-after-free issue in WebRTC tracked under CVE-2025-7657. None of these five were highlighted as actively exploited.\nCVE-2025-6558 is the fifth actively exploited flaw discovered and fixed in Chrome browser since the beginning of the year.\nIn March, Google patched a high-severity sandbox escape flaw,\nCVE-2025-2783\n, discovered by Kaspersky researchers. The vulnerability had been exploited in targeted espionage attacks against Russian government agencies and media organizations, delivering malware.\nTwo months later, in May, Google issued another update to fix\nCVE-2025-4664\n, a zero-day vulnerability in Chrome that allowed attackers to hijack user accounts.\nIn June, the company addressed yet another severe issue,\nCVE-2025-5419\n, an out-of-bounds read/write vulnerability in Chrome’s V8 JavaScript engine, reported by Google TAG’s Benoît Sevens and Clément Lecigne.\nEarlier this month, Google fixed the fourth zero-day flaw in Chrome,\nCVE-2025-6554\n, also in the V8 engine, that was discovered by GTAG researchers.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nGoogle patches new Chrome zero-day bug exploited in attacks\nGoogle fixes fourth actively exploited Chrome zero-day of 2025\nCISA tags recently patched Chrome bug as actively exploited\nNew Fortinet FortiWeb hacks likely linked to public RCE exploits\nHackers exploit OttoKit WordPress plugin flaw to add admin accounts"
    },
    {
        "Title": "ISC2 Finds Orgs Are Increasingly Leaning on AI",
        "Link": "https://www.darkreading.com/remote-workforce/isc2-orgs-increasingly-leaning-ai",
        "Summary": "While many organizations are eagerly integrating AI into their workflows and cybersecurity practices, some remain undecided and even concerned about potential drawbacks of AI deployment.",
        "Date": "2025-07-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/isc2-orgs-increasingly-leaning-ai"
    },
    {
        "Title": "Elite 'Matanbuchus 3.0' Loader Spruces Up Ransomware Infections",
        "Link": "https://www.darkreading.com/threat-intelligence/matanbuchus-loader-ransomware-infections",
        "Summary": "An upgraded cybercrime tool is designed to make targeted ransomware attacks as easy and effective as possible, with features like EDR-spotting and DNS-based C2 communication.",
        "Date": "2025-07-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/matanbuchus-loader-ransomware-infections"
    },
    {
        "Title": "Oracle Fixes Critical Bug in Cloud Code Editor",
        "Link": "https://www.darkreading.com/application-security/oracle-fixes-critical-bug-cloud-code-editor",
        "Summary": "The bug allowed an attacker an easy way to compromise full suite of developer tools in Oracle Cloud Infrastructure.",
        "Date": "2025-07-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/oracle-fixes-critical-bug-cloud-code-editor"
    },
    {
        "Title": "Women Who 'Hacked the Status Quo' Aim to Inspire Cybersecurity Careers",
        "Link": "https://www.darkreading.com/cybersecurity-operations/women-hacked-status-quo-cybersecurity-careers",
        "Summary": "A group of female cybersecurity pioneers will share what they've learned about navigating a field dominated by men, in order to help other women empower themselves and pursue successful cybersecurity careers.",
        "Date": "2025-07-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/women-hacked-status-quo-cybersecurity-careers"
    },
    {
        "Title": "Cognida.ai Launches Codien: An AI Agent to Modernize Legacy Test Automation and Fast-Track Test Creation",
        "Link": "https://www.darkreading.com/application-security/cognida-ai-launches-codien",
        "Summary": "No summary available",
        "Date": "2025-07-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/cognida-ai-launches-codien"
    },
    {
        "Title": "Fully Patched SonicWall Gear Under Likely Zero-Day Attack",
        "Link": "https://www.darkreading.com/remote-workforce/fully-patched-sonicwall-gear-zero-day-attack",
        "Summary": "A threat actor with likely links to the Abyss ransomware group is leveraging an apparent zero-day vulnerability to deploy the &quot;Overstep&quot; backdoor on fully up-to-date appliances.",
        "Date": "2025-07-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/fully-patched-sonicwall-gear-zero-day-attack"
    },
    {
        "Title": "Securing the Budget: Demonstrating Cybersecurity's Return",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/securing-budget-cybersecurity-return",
        "Summary": "By tying security investments to measurable outcomes — like reduced breach likelihood and financial impact — CISOs can align internal stakeholders and justify spending based on real-world risk.",
        "Date": "2025-07-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/securing-budget-cybersecurity-return"
    },
    {
        "Title": "Altered Telegram App Steals Chinese Users' Android Data",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/telegram-app-chinese-users-android-data",
        "Summary": "Using more than 600 domains, attackers entice Chinese-speaking victims to download a vulnerable Telegram app that is nearly undetectable on older versions of Android.",
        "Date": "2025-07-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/telegram-app-chinese-users-android-data"
    },
    {
        "Title": "Europol-Coordinated Global Operation Takes Down Pro-Russian Cybercrime Network",
        "Link": "https://www.securityweek.com/europol-coordinated-global-operation-takes-down-pro-russian-cybercrime-network/",
        "Summary": "<p>Codenamed Eastwood, the operation targeted the so-called NoName057(16) group, which was identified as being behind a series of DDoS attacks on municipalities and organizations linked to a NATO summit.</p>\n<p>The post <a href=\"https://www.securityweek.com/europol-coordinated-global-operation-takes-down-pro-russian-cybercrime-network/\">Europol-Coordinated Global Operation Takes Down Pro-Russian Cybercrime Network</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/europol-coordinated-global-operation-takes-down-pro-russian-cybercrime-network/"
    },
    {
        "Title": "United Natural Foods Projects Up to $400M Sales Hit from June Cyberattack",
        "Link": "https://www.securityweek.com/united-natural-foods-projects-up-to-400m-sales-hit-from-june-cyberattack/",
        "Summary": "<p>Cyberattack disrupted UNFI’s operations in June; company estimates $50–$60 million net income hit but anticipates insurance will cover most losses.</p>\n<p>The post <a href=\"https://www.securityweek.com/united-natural-foods-projects-up-to-400m-sales-hit-from-june-cyberattack/\">United Natural Foods Projects Up to $400M Sales Hit from June Cyberattack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/united-natural-foods-projects-up-to-400m-sales-hit-from-june-cyberattack/"
    },
    {
        "Title": "SonicWall SMA Appliances Targeted With New ‘Overstep’ Malware",
        "Link": "https://www.securityweek.com/sonicwall-sma-appliances-targeted-with-new-overstep-malware/",
        "Summary": "<p>A threat actor that may be financially motivated is targeting SonicWall devices with a backdoor and user-mode rootkit.</p>\n<p>The post <a href=\"https://www.securityweek.com/sonicwall-sma-appliances-targeted-with-new-overstep-malware/\">SonicWall SMA Appliances Targeted With New &#8216;Overstep&#8217; Malware</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/sonicwall-sma-appliances-targeted-with-new-overstep-malware/"
    },
    {
        "Title": "Virtual Event Today: Cloud & Data Security Summit – Tackling Exposed Attack Surfaces in the Cloud",
        "Link": "https://www.securityweek.com/virtual-event-preview-cloud-data-security-summit-2025-tackling-exposed-attack-surfaces-in-the-cloud/",
        "Summary": "<p>Virtual event brings together leading experts, practitioners, and innovators for a full day of insightful discussions and tactical guidance on evolving threats and real-world defense strategies in cloud security. </p>\n<p>The post <a href=\"https://www.securityweek.com/virtual-event-preview-cloud-data-security-summit-2025-tackling-exposed-attack-surfaces-in-the-cloud/\">Virtual Event Today: Cloud &amp; Data Security Summit – Tackling Exposed Attack Surfaces in the Cloud</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/virtual-event-preview-cloud-data-security-summit-2025-tackling-exposed-attack-surfaces-in-the-cloud/"
    },
    {
        "Title": "Compumedics Ransomware Attack Led to Data Breach Impacting 318,000",
        "Link": "https://www.securityweek.com/compumedics-ransomware-attack-led-to-data-breach-impacting-318000/",
        "Summary": "<p>Compumedics has been targeted by the VanHelsing ransomware group, which stole files from the company’s systems.</p>\n<p>The post <a href=\"https://www.securityweek.com/compumedics-ransomware-attack-led-to-data-breach-impacting-318000/\">Compumedics Ransomware Attack Led to Data Breach Impacting 318,000</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/compumedics-ransomware-attack-led-to-data-breach-impacting-318000/"
    },
    {
        "Title": "Cyber Intelligence Firm iCOUNTER Emerges From Stealth With $30 Million in Funding",
        "Link": "https://www.securityweek.com/cyber-intelligence-firm-icounter-emerges-from-stealth-with-30-million-in-funding/",
        "Summary": "<p>iCOUNTER, which helps organizations defend against targeted attacks, has launched under the helm of former Mandiant president and COO John Watters.</p>\n<p>The post <a href=\"https://www.securityweek.com/cyber-intelligence-firm-icounter-emerges-from-stealth-with-30-million-in-funding/\">Cyber Intelligence Firm iCOUNTER Emerges From Stealth With $30 Million in Funding</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cyber-intelligence-firm-icounter-emerges-from-stealth-with-30-million-in-funding/"
    },
    {
        "Title": "Google Says AI Agent Thwarted Exploitation of Critical Vulnerability",
        "Link": "https://www.securityweek.com/google-says-ai-agent-thwarted-exploitation-of-critical-vulnerability/",
        "Summary": "<p>Google refused to share any details on how its Big Sleep AI foiled efforts to exploit a SQLite vulnerability in the wild.</p>\n<p>The post <a href=\"https://www.securityweek.com/google-says-ai-agent-thwarted-exploitation-of-critical-vulnerability/\">Google Says AI Agent Thwarted Exploitation of Critical Vulnerability </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/google-says-ai-agent-thwarted-exploitation-of-critical-vulnerability/"
    },
    {
        "Title": "China’s Salt Typhoon Hacked US National Guard",
        "Link": "https://www.securityweek.com/chinas-salt-typhoon-hacked-us-national-guard/",
        "Summary": "<p>Chinese hacking group Salt Typhoon targeted a National Guard unit’s network and tapped into communications with other units.</p>\n<p>The post <a href=\"https://www.securityweek.com/chinas-salt-typhoon-hacked-us-national-guard/\">China&#8217;s Salt Typhoon Hacked US National Guard</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chinas-salt-typhoon-hacked-us-national-guard/"
    },
    {
        "Title": "Former US Soldier Who Hacked AT&T and Verizon Pleads Guilty",
        "Link": "https://www.securityweek.com/former-us-soldier-who-hacked-att-and-verizon-pleads-guilty/",
        "Summary": "<p>Cameron John Wagenius pleaded guilty to charges related to hacking into US telecommunications companies.</p>\n<p>The post <a href=\"https://www.securityweek.com/former-us-soldier-who-hacked-att-and-verizon-pleads-guilty/\">Former US Soldier Who Hacked AT&#038;T and Verizon Pleads Guilty</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/former-us-soldier-who-hacked-att-and-verizon-pleads-guilty/"
    },
    {
        "Title": "IoT Security Firm Exein Raises $81 Million",
        "Link": "https://www.securityweek.com/iot-security-firm-exein-raises-81-million/",
        "Summary": "<p>Italian company Exein has raised €70 million (~$81 million) in a Series C funding round led by Balderton.</p>\n<p>The post <a href=\"https://www.securityweek.com/iot-security-firm-exein-raises-81-million/\">IoT Security Firm Exein Raises $81 Million </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/iot-security-firm-exein-raises-81-million/"
    },
    {
        "Title": "Access to Israeli Flight Agencies and Hotels Allegedly Sold on Dark Web After Zero-Day Breach",
        "Link": "https://dailydarkweb.net/access-to-israeli-flight-agencies-and-hotels-allegedly-sold-on-dark-web-after-zero-day-breach/",
        "Summary": "A recent dark web listing allegedly advertises the sale of access to servers belonging to numerous Israeli flight agencies and hotels, indicating a significant cybersecurity breach and a highly concerning market for stolen credentials. The perpetrators claim to have utilized a &#8220;zero-day&#8221; exploit to gain unauthorized entry, compromising critical infrastructure within Israel&#8217;s travel and hospitality [&#8230;]",
        "Date": "2025-07-16",
        "Content": "A recent dark web listing allegedly advertises the sale of access to servers belonging to numerous Israeli flight agencies and hotels, indicating a significant cybersecurity breach and a highly concerning market for stolen credentials. The perpetrators claim to have utilized a “zero-day” exploit to gain unauthorized entry, compromising critical infrastructure within Israel’s travel and hospitality sectors. The listing, priced between $5,000 and $10,000 for access and up to $15,000 with the zero-day exploit, suggests a coordinated attack on a vital segment of the nation’s economy and tourism industry, with the intent of monetizing unauthorized access.\nThe breach allegedly encompasses over 6 terabytes of sensitive data, with multiple points of access reportedly still available for purchase. The sale of this access on underground forums raises serious concerns about the potential for widespread misuse of the compromised information, impacting potentially thousands of individuals and critical national services. Investigations are likely underway to assess the full extent of the damage and to implement measures to prevent further exploitation of these alleged vulnerabilities.\nAllegedly Compromised Data Categories:\nPassports\nIdentical info of passengers\nFlight info\nHotel reservation info\nTags:\naccess sale\nCyberSecurity\ndark web\ndata-breach\nhospitality\nIsrael\ntravel industry\nZero-Day"
    },
    {
        "Title": "Alleged Collection of 1 Million Israeli Card Holders Data Offered for Sale",
        "Link": "https://dailydarkweb.net/alleged-collection-of-1-million-israeli-card-holders-data-offered-for-sale/",
        "Summary": "A substantial collection of data, allegedly comprising personal and financial information of 1 million Israeli cardholders, has reportedly been made available for sale. This compilation, attributed to various prominent Israeli financial institutions, raises significant concerns regarding the security of sensitive customer information within these critical entities. The origin of this data collection is currently unknown, [&#8230;]",
        "Date": "2025-07-16",
        "Content": "A substantial collection of data, allegedly comprising personal and financial information of 1 million Israeli cardholders, has reportedly been made available for sale. This compilation, attributed to various prominent Israeli financial institutions, raises significant concerns regarding the security of sensitive customer information within these critical entities. The origin of this data collection is currently unknown, but its exposure could have severe implications for the privacy and security of a substantial portion of the Israeli population, including customers of major banks and credit card companies.\nThe alleged collection impacts individuals associated with several key players in the Israeli financial sector, including Bank Leumi Le-Israel BM, Israel Credit Cards Ltd., Bank Hapoalim B.M., Israel Postal Bank Company Ltd., Leumi Card, MAX IT Finance Ltd., Mizrahi Tefahot, Europay (Eurocard) Israel Ltd., Beinleumi, and Payoneer. These institutions are central to Israel’s financial infrastructure, serving a wide array of individuals and businesses. The alleged availability of such sensitive data from these prominent entities highlights a significant security incident.\nThe data offered allegedly includes:\nHolder Name\nBank Name\nSSN (Social Security Number)\nDate of Birth\nCountry\nZIP Code\nCity\nState\nAddress\nCredit Card Class\nCredit Card Type\nEmail\nPhone Number\nCVV\nExpiration Date\nCredit Card Number\nTags:\nBank Hapoalim\nBank Leumi\nCredit Card Data\nCyberSecurity\nData Collection\nFinancial Institutions\nIsrael\nIsrael Credit Cards"
    },
    {
        "Title": "Alleged Data Breach Impacts Brazilian Company GRS Informatica",
        "Link": "https://dailydarkweb.net/alleged-data-breach-impacts-brazilian-company-grs-informatica/",
        "Summary": "A Brazilian IT company, GRS Informatica, has allegedly become the victim of a significant cyberattack, leading to the exposure of sensitive personal data belonging to approximately 4.3 million unique users. The full extent of the impact on GRS Informatica, a company specializing in information technology solutions, is still unfolding, but the sheer volume of records [&#8230;]",
        "Date": "2025-07-16",
        "Content": "A Brazilian IT company, GRS Informatica, has allegedly become the victim of a significant cyberattack, leading to the exposure of sensitive personal data belonging to approximately 4.3 million unique users. The full extent of the impact on GRS Informatica, a company specializing in information technology solutions, is still unfolding, but the sheer volume of records involved suggests a substantial compromise of user privacy in Brazil. The leaked data, allegedly offered for sale, appears to be a full dump in CSV format.\nThe compromised information, according to the claims, includes:\nUnique Usernames\nDate of Birth (DOB)\nMobile Telephone Numbers\nTags:\nBrazil\ncyberattack\nCyberSecurity\ndata-breach\nGRS Informatica\nPersonal Data"
    },
    {
        "Title": "Alleged Data Breach Rocks Unnamed Major Crypto Gaming Company",
        "Link": "https://dailydarkweb.net/alleged-data-breach-rocks-unnamed-major-crypto-gaming-company/",
        "Summary": "A crypto gaming company has allegedly fallen victim to a significant data breach, with sensitive user information now being offered for sale on underground forums. The alleged attackers claim to have exfiltrated 349,000 lines of data from the company&#8217;s database. While the specific name of the victim company has not been disclosed, its description as [&#8230;]",
        "Date": "2025-07-16",
        "Content": "A crypto gaming company has allegedly fallen victim to a significant data breach, with sensitive user information now being offered for sale on underground forums. The alleged attackers claim to have exfiltrated 349,000 lines of data from the company’s database. While the specific name of the victim company has not been disclosed, its description as a “major crypto gaming company” suggests a significant player in the booming blockchain gaming sector, potentially impacting a large user base with valuable digital assets. The origin of the attack is currently unknown, though the data is being peddled for a substantial sum, indicating a financially motivated operation.\nThe compromised data, reportedly available for purchase at $1500 per 25,000 lines or $25,000 for the entire dataset, includes a range of personal and account-related information. This type of leak could expose users to various risks, including phishing attempts, credential stuffing, and even direct theft of their crypto assets if associated accounts are compromised. The alleged sellers are seeking to offload the entire database to a single buyer, suggesting an attempt to maximize profit and potentially prevent wider dissemination.\nThe leaked data titles include:\nID\nuser_url\nuser_pass\nuser_email\nuser_login\nuser_status\ndisplay_name\nuser_nicename\nuser_activation_key\nTags:\nBlockchain\ncrypto gaming\nCyberSecurity\ndata-breach\ndata-leak"
    },
    {
        "Title": "Alleged Data Breach Impacts VantageFinance Customers",
        "Link": "https://dailydarkweb.net/alleged-data-breach-impacts-vantagefinance-customers/",
        "Summary": "An alleged data breach in April 2025 has reportedly exposed the personal information of over 95,000 customers of VantageFinance, an American financial services company. The compromised data, now allegedly being offered for sale, includes a wide range of sensitive details, raising significant privacy concerns for those affected. VantageFinance is a key player in the US [&#8230;]",
        "Date": "2025-07-16",
        "Content": "An alleged data breach in April 2025 has reportedly exposed the personal information of over 95,000 customers of VantageFinance, an American financial services company. The compromised data, now allegedly being offered for sale, includes a wide range of sensitive details, raising significant privacy concerns for those affected. VantageFinance is a key player in the US financial sector, and a breach of this magnitude could have serious implications for their customers’ financial security.\nThe leaked data, allegedly obtained and listed for sale, encompasses a comprehensive set of personal and financial identifiers. The availability of such detailed information poses a considerable risk of identity theft and financial fraud for the individuals whose data has been compromised. Customers of VantageFinance are advised to remain vigilant regarding any suspicious activity related to their personal and financial accounts.\nSSN\nFirst Name\nMiddle Name\nLast Name\nEmail\nDate of Birth\nDriver’s License #\nDriver’s License Expiration\nStreet Number\nStreet Direction\nStreet Name\nCity\nZip Code\nMobile Phone Number\nPhone Number\nTime at Address (Years)\nTime at Address (Months)\nHousing Payment\nEmployment Status\nEmployer\nWork Phone Number\nTime on Job (Years)\nTime on Job (Months)\nJob Title\nSalary (Gross)\nPrevious Street Number\nPrevious Street Direction\nPrevious Street Name\nPrevious City\nPrevious Zip Code\nPrevious Time at Address (Years)\nPrevious Time at Address (Months)\nPrevious Employment Status\nPrevious Employer\nPrevious Work Phone Number\nPrevious Time on Job (Years)\nPrevious Time on Job (Months)\nPrevious Job Title\nCoApp SSN\nCoApp First Name\nCoApp Middle Name\nCoApp Last Name\nCoApp Email\nCoApp Date of Birth\nCoApp Driver’s License #\nCoApp Driver’s License Expiration\nCoApp Street Number\nCoApp Street Direction\nCoApp Street Name\nCoApp City\nCoApp Zip Code\nCoApp Mobile Phone Number\nCoApp Phone Number\nCoApp Time at Address (Years)\nCoApp Time at Address (Months)\nCoApp Housing Payment\nTags:\ncybercrime\nCyberSecurity\ndata-breach\ndata-leak\nfinancial data\nPersonal Information\nVantageFinance"
    },
    {
        "Title": "Cyberattack Allegedly Compromises Chartered Institute of Bankers of Nigeria (CIBN) Servers",
        "Link": "https://dailydarkweb.net/cyberattack-allegedly-compromises-chartered-institute-of-bankers-of-nigeria-cibn-servers/",
        "Summary": "Reports circulating on the dark web allegedly indicate that the Chartered Institute of Bankers of Nigeria (CIBN), a prominent professional body for bankers in Nigeria, may have suffered a significant cybersecurity breach. The CIBN plays a crucial role in regulating and developing the banking profession in Nigeria, making any compromise of its systems a serious [&#8230;]",
        "Date": "2025-07-16",
        "Content": "Reports circulating on the dark web allegedly indicate that the Chartered Institute of Bankers of Nigeria (CIBN), a prominent professional body for bankers in Nigeria, may have suffered a significant cybersecurity breach. The CIBN plays a crucial role in regulating and developing the banking profession in Nigeria, making any compromise of its systems a serious concern for the nation’s financial stability and the personal data of its members. The alleged breach appears to have originated from a server located in France.\nAccording to the claims, full administrative RDP (Remote Desktop Protocol) access to servers associated with cibn.org, including what is described as “portal.cibn.org & others,” is being offered for sale. The compromised system is allegedly running Windows Server 2019.\nTags:\nBanking Sector\nCIBN\ncybercrime\nCyberSecurity\ndata-breach\nNigeria\nRDP access"
    },
    {
        "Title": "IWACLUB Allegedly Suffers Data Breach",
        "Link": "https://dailydarkweb.net/iwaclub-allegedly-suffers-data-breach/",
        "Summary": "IWACO Maroc, a prominent Moroccan company, has allegedly become the victim of a cyberattack, with the hacker group &#8220;Keymous&#8221; claiming responsibility for breaching the backend systems of their &#8220;IWACLUB&#8221; application. IWACO Maroc operates across various sectors in Morocco, and its IWACLUB app is used by customers for loyalty programs, orders, and other services, making this [&#8230;]",
        "Date": "2025-07-16",
        "Content": "IWACO Maroc, a prominent Moroccan company, has allegedly become the victim of a cyberattack, with the hacker group “Keymous” claiming responsibility for breaching the backend systems of their “IWACLUB” application. IWACO Maroc operates across various sectors in Morocco, and its IWACLUB app is used by customers for loyalty programs, orders, and other services, making this a significant incident for its user base.\nThe alleged breach reportedly exposes sensitive user data, order systems, and loyalty function information. The full extent of the compromise is still being assessed, but the group has explicitly stated that IWACO’s user data, order systems, and loyalty functions are now at risk.\nLeaked data titles allegedly include:\nUser Subscriptions/Abonnements\nOrders\nCustomer Profiles\nProduct Details\nLoyalty Information\nTags:\ncyberattack\nCyberSecurity\ndata-breach\nIWACLUB App\nIWACO Maroc\nMorocco"
    },
    {
        "Title": "Qilin Ransomware Group Allegedly Breaches Five U.S. Entities – Halvorsen Family Law, WH Rogers Sheet Metal, City of Green River, Paul Wilkinson Law Firm, and ProActive Solutions USA",
        "Link": "https://dailydarkweb.net/qilin-ransomware-group-allegedly-breaches-five-u-s-entities-halvorsen-family-law-wh-rogers-sheet-metal-city-of-green-river-paul-wilkinson-law-firm-and-proactive-solutions-usa/",
        "Summary": "The notorious Qilin ransomware group has allegedly claimed responsibility for compromising the systems of five distinct organizations across the United States. This widespread attack highlights the indiscriminate nature of ransomware operations, targeting entities ranging from local government to specialized manufacturing and legal services. Halvorsen Family Law Group: A small firm dedicated to personalized client care [&#8230;]",
        "Date": "2025-07-16",
        "Content": "The notorious Qilin ransomware group has allegedly claimed responsibility for compromising the systems of five distinct organizations across the United States. This widespread attack highlights the indiscriminate nature of ransomware operations, targeting entities ranging from local government to specialized manufacturing and legal services.\nHalvorsen Family Law Group:\nA small firm dedicated to personalized client care in family legal matters, where confidentiality is paramount.\nWH Rogers Sheet Metal:\nA company with over 50 years of experience in custom metal fabrication and an ASME certification.\nCity of Green River, Utah:\nA municipal government serving its community, businesses, and government, potentially impacting public services and sensitive data.\nThe Paul Wilkinson Law Firm:\nA Denver-based personal injury firm handling sensitive client information related to accidents.\nProActive Solutions USA:\nAn ISO 9001 certified manufacturer and distributor of chemicals and health products for the farm and food industries, operating in 22 states.\nThe origin of the Qilin ransomware group is widely believed to be Russia.\nThe leaked data, as allegedly posted by the Qilin group, includes a variety of sensitive information depending on the victim:\nEmployee records\nClient data\nFinancial documents\nContracts\nInternal communications\nDriver’s licenses\nPassports\nSocial Security cards\nBusiness and government records\nTags:\nCity of Green River\nCyberSecurity\ndata-breach\nHalvorsen Family Law Group\nProActive Solutions USA\nQilin\nransomware\nThe Paul Wilkinson Law Firm\nWH Rogers Sheet Metal"
    },
    {
        "Title": "Mauritanian Government Employability Platform Allegedly Breached",
        "Link": "https://dailydarkweb.net/mauritanian-government-employability-platform-allegedly-breached/",
        "Summary": "The official Mauritanian government platform for Qualification and Certification of Employability (QCE) has allegedly suffered a significant data breach, with 12.8 GB of data reportedly compromised. The QCE platform is a crucial digital service for Mauritanian citizens, enabling individuals to validate their professional skills and obtain government-recognized certifications, thereby playing a vital role in the [&#8230;]",
        "Date": "2025-07-16",
        "Content": "The official Mauritanian government platform for Qualification and Certification of Employability (QCE) has allegedly suffered a significant data breach, with 12.8 GB of data reportedly compromised. The QCE platform is a crucial digital service for Mauritanian citizens, enabling individuals to validate their professional skills and obtain government-recognized certifications, thereby playing a vital role in the nation’s workforce development and job market.\nThe alleged breach, with a reported dump date of 2025, involves 13,618 files. The leaked data is being offered for $400 on a cybercrime forum. While the full extent of the compromised data is still being assessed, the breach of such a critical government platform could have significant implications for the privacy and professional lives of countless Mauritanian citizens.\nLeaked data titles allegedly include:\nMauritanian Identification Cards (Carte d’Identification)\nEmployment Contracts (Contrat de Travail)\nCurriculum Vitae (CV)\nProfessional Diplomas (Diplôme)\nTags:\nCyberSecurity\ndata-breach\nEmployability\ngovernment\nMauritania\nQCE"
    }
]