[
    {
        "Title": "The Unusual Suspect: Git Repos",
        "Link": "https://thehackernews.com/2025/07/the-unusual-suspect-git-repos.html",
        "Summary": "While phishing and ransomware dominate headlines, another critical risk quietly persists across most enterprises: exposed Git repositories leaking sensitive data. A risk that silently creates shadow access into core systems\nGit is the backbone of modern software development, hosting millions of repositories and serving thousands of organizations worldwide. Yet, amid the daily hustle of shipping",
        "Date": "2025-07-14",
        "Content": "While phishing and ransomware dominate headlines, another critical risk quietly persists across most enterprises: exposed Git repositories leaking sensitive data. A risk that silently creates shadow access into core systems\nGit is the backbone of modern software development, hosting millions of repositories and serving thousands of organizations worldwide. Yet, amid the daily hustle of shipping code, developers may inadvertently leave behind API keys, tokens, or passwords in configuration files and code files, effectively handing attackers the keys to the kingdom.\nThis isn't just about poor hygiene; it's a systemic and growing supply chain risk. As cyber threats become more sophisticated, so do compliance requirements. Security frameworks like NIS2, SOC2, and ISO 27001 now demand proof that software delivery pipelines are hardened and third-party risk is controlled. The message is clear: securing your Git repositories is no longer optional, it's essential.\nBelow, we look at the risk profile of exposed credentials and secrets in public and private code repositories, how this attack vector has been used in the past, and what you can do to minimize your exposure.\nThe Git Repo Threat Landscape\nThe threat landscape surrounding Git repositories is expanding rapidly, driven by a number of causes:\nGrowing complexity of DevOps practices\nWidespread reliance on public version control platforms like GitHub\nHuman error and all the misconfigurations that entail: from poorly applied access controls to forgotten test environments pushed to production\nIt's no surprise that as development velocity increases, so does the opportunity for attackers to weaponize exposed code repositories. GitHub alone reported over 39 million leaked secrets in 2024—a 67% increase from the year before. These included cloud credentials, API tokens, and SSH keys. Most of these exposures originate from:\nPersonal developer accounts\nAbandoned or forked projects\nMisconfigured or unaudited repositories\nFor attackers, these aren't just mistakes, they're entry points. Exposed Git repos offer a direct, low-friction pathway into internal systems and developer environments. What starts as a small oversight can escalate into a full-blown compromise, often without triggering any alerts.\nHow Do Attackers Leverage Exposed Git Repositories?\nPublic tools and scanners make it trivial to harvest secrets from exposed Git repositories, and attackers know how to pivot quickly from exposed code to compromised infrastructure.\nOnce inside a repository, attackers look for:\nSecrets and credentials\n: API keys, authentication tokens, and passwords. Often hidden in plain sight within config files or commit history.\nInfrastructure intel\n: Details about Internal systems such as hostnames, IPs, ports, or architectural diagrams.\nBusiness logic:\nSource code that can reveal vulnerabilities in authentication, session handling, or API access.\nThese insights are then weaponized for:\nInitial access\n: Attackers use valid credentials to authenticate into:\nCloud environments — e.g., AWS IAM roles via exposed access keys, Azure Service Principals\nDatabases — e.g., MongoDB, PostgreSQL, MySQL using hardcoded connection strings\nSaaS platforms — leveraging API tokens found in config files or commit history\nLateral movement\n: Once inside, attackers pivot further by:\nEnumerating internal APIs using exposed OpenAPI/Swagger specs\nAccessing CI/CD pipelines using leaked tokens from GitHub Actions, GitLab CI, or Jenkins\nUsing misconfigured permissions to move across internal services or cloud accounts\nPersistence and exfiltration\n: To maintain access and extract data over time, they:\nCreate new IAM users or SSH keys to stay embedded\nDeploy malicious Lambda functions or containers to blend in with normal workloads\nExfiltrate data from S3 buckets, Azure Blob Storage, or logging platforms like CloudWatch and Log Analytics\nA single leaked AWS key can expose an entire cloud footprint. A forgotten .git/config file or stale commit may still contain live credentials.\nThese exposures often bypass traditional perimeter defenses entirely. We've seen attackers pivot from exposed Git repositories → to developer laptops → to internal networks. This threat isn't theoretical, it's a kill chain we've validated in live production environments using\nPentera\n.\nRecommended Mitigation Strategies\nReducing exposure risk starts with the basics. While no single control can eliminate Git-based attacks, the following practices help reduce the likelihood of secrets leaking - and limit the impact when they do.\n1. Secrets Management\nStore secrets outside your codebase using dedicated secret management solutions like HashiCorp Vault (open source), AWS Secrets Manager, or Azure Key Vault. These tools provide secure storage, fine-grained access control, and audit logging.\nAvoid hardcoding secrets in source files or configuration files. Instead, inject secrets at runtime via environment variables or secure APIs.\nAutomate secret rotation to reduce the window of exposure.\n2. Code Hygiene\nEnforce strict .gitignore policies to exclude files that may contain sensitive information, such as .env, config.yaml, or credentials.json.\nIntegrate scanning tools like Gitleaks, Talisman, and git-secrets into developer workflows and CI/CD pipelines to catch secrets before they're committed.\n3. Access Controls\nEnforce the principle of least privilege across all Git repositories. Developers, CI/CD tools, and third-party integrations should only have the access they need - no more.\nUse short-lived tokens or time-bound credentials wherever possible.\nEnforce multi-factor authentication (MFA) and single sign-on (SSO) on Git platforms.\nRegularly audit user and machine access logs to identify excessive privileges or suspicious behavior.\nFind Exposed Git Data Before Attackers Do\nExposed Git repositories are not an edge-case risk, but a mainstream attack vector especially in fast-moving DevOps environments. While secret scanners and hygiene practices are essential, they often fall short of providing the full picture. Attackers aren't just reading your code; they're using it as a map to walk right into your infrastructure.\nYet, even teams using best practices are left blind to one critical question: could an attacker actually use this exposure to break in? Securing your repositories requires more than just static checks. It calls for continuous validation, proactive remediation, and an adversary's mindset. As compliance mandates tighten and attack surfaces expand, organizations must treat code exposure as a core part of their security strategy and not as an afterthought.\nTo learn more about how your team can do this,\njoin the webinar\nThey're Out to Git You\non July 23rd, 2025\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "New PHP-Based Interlock RAT Variant Uses FileFix Delivery Mechanism to Target Multiple Industries",
        "Link": "https://thehackernews.com/2025/07/new-php-based-interlock-rat-variant.html",
        "Summary": "Threat actors behind the Interlock ransomware group have unleashed a new PHP variant of its bespoke remote access trojan (RAT) as part of a widespread campaign using a variant of ClickFix called FileFix.\n\"Since May 2025, activity related to the Interlock RAT has been observed in connection with the LandUpdate808 (aka KongTuke) web-inject threat clusters,\" The DFIR Report said in a technical",
        "Date": "2025-07-14",
        "Content": "Threat actors behind the Interlock ransomware group have unleashed a new PHP variant of its bespoke remote access trojan (RAT) as part of a widespread campaign using a variant of ClickFix called FileFix.\n\"Since May 2025, activity related to the Interlock RAT has been observed in connection with the\nLandUpdate808\n(aka KongTuke) web-inject threat clusters,\" The DFIR Report\nsaid\nin a technical analysis published today in collaboration with Proofpoint.\n\"The campaign begins with compromised websites injected with a single-line script hidden in the page's HTML, often unbeknownst to site owners or visitors.\"\nThe JavaScript code acts as a traffic distribution system (TDS), using IP filtering techniques to redirect users to fake CAPTCHA verification pages that leverage ClickFix to entice them into running a PowerShell script that leads to the deployment of NodeSnake (aka Interlock RAT).\nThe use of NodeSnake by Interlock was\npreviously documented\nby Quorum Cyber as part of cyber attacks targeting local government and higher education organizations in the United Kingdom in January and March 2025. The malware facilitates persistent access, system reconnaissance, and remote command execution capabilities.\nWhile the name of the malware is a reference to its Node.js foundations, new campaigns observed last month have led to the distribution of a PHP variant by means FileFix. The activity is assessed to be opportunistic in nature, aiming for a broad range of industries.\n\"This updated delivery mechanism has been observed deploying the PHP variant of the Interlock RAT, which in certain cases has then led to the deployment of the Node.js variant of the Interlock RAT,\" the researchers said.\nFileFix is an evolution of ClickFix that takes advantage of the Windows operating system's ability to instruct victims into copying and executing commands using the File Explorer's address bar feature. It was first\ndetailed\nas a proof-of-concept (PoC) last month by security researcher mrd0x.\nOnce installed, the RAT malware carries out reconnaissance of the infected host and exfiltrate system information in JSON format. It also checks its own privileges to determine if it's being run as USER, ADMIN, or SYSTEM, and establishes contact with a remote server to download and run EXE or DLL payloads.\nPersistence on the machine is accomplished via Windows Registry changes, while the Remote Desktop Protocol (RDP) is used to enable lateral movement.\nA noteworthy feature of the trojan is its abuse of\nCloudflare Tunnel subdomains\nto obscure the true location of the command-and-control (C2) server. The malware further embeds hard-coded IP addresses as a fallback mechanism so as to ensure that the communication remains intact even if the Cloudflare Tunnel is taken down.\n\"This discovery highlights the continued evolution of the Interlock group's tooling and their operational sophistication,\" the researchers said. \"While the Node.js variant of Interlock RAT was known for its use of Node.js, this variant leverages PHP, a common web scripting language, to gain and maintain access to victim networks.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "⚡ Weekly Recap: Scattered Spider Arrests, Car Exploits, macOS Malware, Fortinet RCE and More",
        "Link": "https://thehackernews.com/2025/07/weekly-recap-scattered-spider-arrests.html",
        "Summary": "In cybersecurity, precision matters—and there’s little room for error. A small mistake, missed setting, or quiet misconfiguration can quickly lead to much bigger problems. The signs we’re seeing this week highlight deeper issues behind what might look like routine incidents: outdated tools, slow response to risks, and the ongoing gap between compliance and real security.\nFor anyone responsible",
        "Date": "2025-07-14",
        "Content": "In cybersecurity, precision matters—and there's little room for error. A small mistake, missed setting, or quiet misconfiguration can quickly lead to much bigger problems. The signs we're seeing this week highlight deeper issues behind what might look like routine incidents: outdated tools, slow response to risks, and the ongoing gap between compliance and real security.\nFor anyone responsible for protecting systems, the key isn't just reacting to alerts—it's recognizing the larger patterns and hidden weak spots they reveal.\nHere's a breakdown of what's unfolding across the cybersecurity world this week.\n⚡ Threat of the Week\nNCA Arrests for Alleged Scattered Spider Members\n— The U.K. National Crime Agency (NCA) announced that four people have been arrested in connection with cyber attacks targeting major retailers Marks & Spencer, Co-op, and Harrods. The arrested individuals include two men aged 19, a third aged 17, and a 20-year-old woman. They were apprehended in the West Midlands and London on suspicion of Computer Misuse Act offenses, blackmail, money laundering, and participating in the activities of an organized crime group. They are believed to be associated with the notorious cybercrime group known as Scattered Spider, an offshoot of a loose-knit collective called The Com, which is responsible for a vast catalog of crimes, including social engineering, phishing, SIM swapping, extortion, sextortion, swatting, kidnapping, and murder.\nGet a Red-Team Style Assessment of Your Identity Infrastructure, at No Cost.\nPrivileged identities are just the tip of the iceberg. Reveal the escalation pathways and other identity-based threats below the surface, with a free identity security risk assessment. Plus, get context-based insights and actions on how to prioritize and mitigate the risk.\nGet Started Now ➝\n🔔 Top News\nPerfektBlue Bluetooth Flaws Expose Millions of Vehicles to Remote Attacks\n— Cybersecurity researchers have discovered a set of four security flaws in OpenSynergy's BlueSDK Bluetooth stack that, if successfully exploited, could allow remote code execution on millions of transport vehicles from Mercedes-Benz, Volkswagen, and Skoda. \"PerfektBlue exploitation attack is a set of critical memory corruption and logical vulnerabilities found in OpenSynergy BlueSDK Bluetooth stack that can be chained together to obtain Remote Code Execution (RCE),\" PCA Cyber Security said. Volkswagen said the identified issues exclusively concern Bluetooth and that neither is vehicle safety nor integrity affected. It also noted that exploitation of the vulnerabilities is only possible when several conditions are met simultaneously.\nNorth Korean Hacker Behind Fraudulent IT Worker Scheme Sanctioned\n— The U.S. Department of the Treasury's Office of Foreign Assets Control (OFAC) on Tuesday sanctioned a member of a North Korean hacking group called Andariel for their role in the infamous remote information technology (IT) worker scheme. Song Kum Hyok, 38, is alleged to have enabled the fraudulent operation by using foreign-hired IT workers to seek remote employment with U.S. companies and planning to split income with them. The sanctions mark the first time a threat actor linked to Andariel, a sub-cluster within the Lazarus Group, has been tied to the IT worker scheme. \"While the Treasury's announcement marks a formal public association of the Andariel (APT45) hacking group with North Korea's remote IT worker operation, the connection reflects a much broader and long-running pattern,\" Michael \"Barni\" Barnhart, Principal i3 Insider Risk Investigator at DTEX, told The Hacker News.\nChinese Hacker Arrested for Silk Typhoon Attacks\n— A Chinese national has been arrested in Milan, Italy, for his alleged links to a state-sponsored hacking group known as Silk Typhoon and for carrying out cyber attacks against American organizations and government agencies. Xu Zewei, 33, has been accused of being involved in the U.S. computer intrusions between February 2020 and June 2021, including a mass attack spree that leveraged then-zero-day flaws in Microsoft Exchange Server, a cluster of activity the Windows maker designed as Hafnium. Xu, alongside co-defendant and Chinese national Zhang Yu, are believed to have undertaken the attacks based on directions issued by the Ministry of State Security's (MSS) Shanghai State Security Bureau (SSSB).\nThreat Weaponize Leaked Version of Shellter to Distribute Stealers\n— Hackers are exploiting a popular red teaming tool called Shellter to distribute stealer malware and remote access trojans. The campaigns are believed to have started in April 2025, around the same time a company that procured a licensed version of the software leaked a copy on cybercrime forums. \"Although the Shellter Project is a victim in this case through intellectual property loss and future development time, other participants in the security space must now contend with real threats wielding more capable tools,\" Elastic Security Labs said.\nFortinet Patches Critical SQL Injection Flaw\n— Fortinet has released fixes for a critical security flaw impacting FortiWeb that could enable an unauthenticated attacker to run arbitrary database commands on susceptible instances. Tracked as CVE-2025-25257, the vulnerability carries a CVSS score of 9.6 out of a maximum of 10.0. According to watchTowr Labs, the problem is rooted in the fact that a Bearer token Authorization header in a specially crafted HTTP request is passed directly to an SQL database query without adequate sanitization to make sure that it's not harmful and does not include any malicious code. The disclosure comes as Sonar\ndetailed\nmultiple vulnerabilities in Fortinet's FortiClient (CVE-2025-25251, CVE-2025-31365, CVE-2025-22855, CVE-2025-22859, and CVE-2025-31366) that, when chained together, grants an attacker complete organizational control with minimal user interaction. CVE-2025-22859 \"enables an authenticated attacker to upload a stored XSS payload to a Linux-based EMS server,\" security researcher Yaniv Nizry\nsaid\n. \"Exploiting this vulnerability, an attacker can manipulate an EMS user into clicking a malicious link, forcing all registered endpoints to switch connection to a malicious EMS server without any interaction from the clients. This makes them susceptible to arbitrary code execution.\"\n‎️‍🔥 Trending CVEs\nHackers are quick to jump on newly discovered software flaws – sometimes within hours. Whether it's a missed update or a hidden bug, even one unpatched CVE can open the door to serious damage. Below are this week's high-risk vulnerabilities making waves. Review the list, patch fast, and stay a step ahead.\nThis week's list includes —\nCVE-2025-47227\n,\nCVE-2025-47228\n(ScriptCase),\nCVE-2025-24269\n,\nCVE-2025-24235\n(SMBClient),\nCVE-2025-30012, CVE-2025-42963, CVE-2025-42964, CVE-2025-42966, and CVE-2025-42980\n(SAP),\nCVE-2025-52488 (DNN), CVE-2025-44954, CVE-2025-44955, CVE-2025-44957, CVE-2025-44958, CVE-2025-44960, CVE-2025-44961, CVE-2025-44962, CVE-2025-44963, CVE-2025-6243\n(Ruckus Wireless),\nCVE-2025-52434\n,\nCVE-2025-52520\n,\nCVE-2025-53506\n(Apache Tomcat),\nCVE-2025-6948\n(GitLab CE/EE),\nCVE-2025-0141\n(Palo Alto Networks GlobalProtect App),\nCVE-2025-6691\n(SureForms plugin),\nCVE-2025-7206\n(D-Link DIR-825),\nCVE-2025-32353, CVE-2025-32874\n(Kaseya RapidFire Tools Network Detective),\nCVE-2025-7026, CVE-2025-7027, CVE-2025-7028, CVE-2025-7029\n(Gigabyte UEFI),\nCVE-2025-1727\n(End-of-Train and Head-of-Train devices), and a\ncritical double free vulnerability\nin the Linux kernel's pipapo set module.\n📰 Around the Cyber World\nAtomic Stealer Gets a Backdoor Feature\n— The macOS information stealer known as Atomic Stealer (aka AMOS) has been updated with an embedded backdoor to obtain persistent access to compromised systems. The new component allows executing arbitrary remote commands, gaining full user-level access, and even surviving reboots, allowing attackers to maintain control over infected hosts indefinitely. According to\nMoonlock Lab\n, campaigns distributing Atomic have recently shifted from broad distribution channels like cracked software sites to targeted phishing aimed at cryptocurrency owners and using staged job interview invitations to infect freelancers. The United States, France, Italy, the United Kingdom, and Canada are among the most affected by the stealer malware. It is only the second known case of backdoor deployment at a global scale targeting macOS users, after North Korea. \"The upgrade to AMOS represents a significant escalation in both capability and intent, whether the changes were made by the original malware authors or by someone else modifying the code,\" the company said. \"It's clear that the Russia-affiliated authors of Atomic macOS Stealer are following in the footsteps of North Korean attack groups.\"\nCall of Duty Makers Takes Game Offline After Reports of RCE Exploit\n— The makers of Call of Duty: World War 2\nannounced\nthat the PC version of the game has been taken offline following \"reports of an issue.\" The issue\nappears\nto be a security problem, specifically a remote code execution (RCE) vulnerability in the popular video game that could allow an attacker to take over others' PCs during live multi-player matches. The RCE exploit has been found to be abused to open command prompts on victim PCs, send mocking messages via Notepad, and forcibly shut down players' computers, among others. Activision has not officially commented on the issue, but it's said to be\nworking\nto remediate the bug.\nBaitTrap Uses Over 17K Sites to Push Scams\n— A network of more than 17,000 websites is mimicking trusted brands, including CNN, BBC and CNBC, to redirect visitors to online scams. The BaitTrap network\nuses\nGoogle and Meta ads, social media posts, and YouTube videos to lure victims. The bogus sites typically collect personal information and attempt to hijack online crypto accounts. They target audiences in more than 50 countries all over the globe. The sites publish fake stories featuring prominent public figures, including national leaders and central bank governors, and falsely link those figures to \"fabricated investment schemes in order to build trust and get engagement from victims.\"\nDutch Police Arrest 5 Phishing Gang Members\n— Dutch police have\narrested\nfive members of a phishing gang that operated out of the city of Lelystad. Four of the group's members are teenagers aged 14 to 17. Authorities said the suspects used QR codes sent via email to collect login credentials for local banks. In a related law enforcement development, Nepalese authorities have\napprehended\n52 people for allegedly running online dating and crypto investment scams. The group ran a call center and a dating app called METOO to lure young Nepali women and facilitate fraudulent online transactions. Six of the detained suspects are Chinese and are believed to have managed the operation.\nGerman Court Orders Meta to Pay €5K Over GDPR Violation\n— A German court has ruled that Meta must pay €5,000 ($5,900) to a German Facebook user who sued the platform for embedding its Pixel tracking technology in third-party websites. The ruling could open the door to large fines down the road over data privacy violations relating to similar tracking tools. The Regional Court of Leipzig in Germany ruled that Meta tracking pixels and software development kits embedded in countless websites and apps collect users' data without their consent and violate the continent's General Data Protection Regulation (GDPR). \"Every user is individually identifiable to Meta at all times as soon as they visit the third-party websites or use an app, even if they have not logged in via the Instagram and Facebook account,\" the court\nsaid\n.\nLFI Flaw in Microsoft Export to PDF Feature\n— A Local File Inclusion (LFI) vulnerability has been disclosed in Microsoft 365's Export to PDF functionality, potentially allowing attackers to access sensitive internal data when converting HTML documents to PDF. The vulnerability, reported by security researcher Gianluca Baldi, was subsequently patched by Microsoft, earning them a $3,000 bounty reward. \"It turned out there was an undocumented behavior that allowed converting from HTML to PDF files,\" Baldi\nsaid\n. \"By embedding specific tags (<embed>, <object>, and <iframe>) into the HTML content, an attacker could force the inclusion of local files from the server's file system into the resulting PDF—even files located outside the server's root directory.\"\nUnpatched Flaws in Ruckus Wireless\n— Multiple unpatched security flaws have been disclosed (CVE-2025-44954, CVE-2025-44955, CVE-2025-44957, CVE-2025-44958, CVE-2025-44960, CVE-2025-44961, CVE-2025-44962, CVE-2025-44963, and CVE-2025-6243) in Ruckus Wireless management products Virtual SmartZone (vSZ) and Network Director (RND) could be exploited by an attacker to leak sensitive information and compromise the wireless environment. The flaws include authentication bypass, hard-coded secrets, arbitrary file read by authenticated users, and unauthenticated remote code execution. \"An attacker with network access to Ruckus Wireless vSZ can exploit CVE-2025-44954 to gain full administrator access that will lead to total compromise of the vSZ wireless management environment,\" CERT/CC\nsaid\n. \"Furthermore, multiple vulnerabilities can be chained to create chained attacks that can allow the attacker to combine attacks to bypass any security controls that prevent only specific attacks.\" Noam Moshe of Claroty Team82 has been credited with discovering and reporting the issues. In the absence of patches, users are advised to limit access to trusted users and their authenticated clients to manage the infrastructure via a secure protocol like HTTPS or SSH.\nSecurity Flaws in Gigabyte UEFI\n— Multiple security flaws have been disclosed in UEFI modules present in Gigabyte firmware (CVE-2025-7026, CVE-2025-7027, CVE-2025-7028, and CVE-2025-7029) that an attacker could exploit to elevate privileges and execute arbitrary code in the System Management Mode (SMM) environment of a UEFI-supported processor. \"An attacker with local or remote administrative privileges may exploit these vulnerabilities to execute arbitrary code in System Management Mode (Ring -2), bypassing OS-level protections,\" CERT/CC\nsaid\n. \"These vulnerabilities can be triggered via SMI handlers from within the operating system, or in certain cases, during early boot phases, sleep states, or recovery modes – before the OS fully loads.\" Successful exploitation of the vulnerabilities can disable UEFI security mechanisms such as Secure Boot and Intel BootGuard, facilitating stealthy firmware implants and persistent control over the system. The flaws were\ndiscovered and reported\nby Binarly.\nAndroid did not have a patch for the first time in July 2025 in a Decade\n— Google announced that no security patches have been released for\nAndroid\nand\nPixel\ndevices for the month of July 2025, ending a decade-long streak of security updates. This is the first month no security updates have been released since Google started rolling out monthly Android fixes in August 2015.\nIndonesia Extradites Russian National for Selling Personal Data on Telegram\n— Indonesia has extradited a Russian citizen named Alexander Zverev for allegedly running a Telegram channel that sold personal data obtained from law enforcement databases. Russian authorities\nclaimed\nthat Zverev operated an unnamed criminal network between 2018 and 2021 that profited from selling sensitive personal information sourced from databases belonging to Russia's Interior Ministry (MVD), Federal Security Service (FSB), and mobile phone operators. Subscribers of the Telegram channel could allegedly purchase details about Russian citizens, including private information. Authorities have not disclosed the name of the channel or whether it is currently operational.\nLaw Enforcement Catches Up on Ransomware Actors\n— The Brussels criminal court\nsentenced\nthe Russian developer of Crylock ransomware to seven years in prison for masterminding the malware's deployment on thousands of computers. His former co-conspirator, a female involved in advertising Crylock and negotiating with the victims, was sentenced to five years. More than €60 million (~$70 million) in cryptocurrency representing illegal proceeds from the ransomware operation have been seized by law enforcement. The development came as French authorities arrested a 26-year-old Russian basketball player for his alleged role in ransomware attacks. Daniil Kasatkin was arrested on June 21, 2025, at the Charles de Gaulle Airport in Paris at the request of U.S. authorities. It's alleged that Kasatkin helped an unnamed ransomware gang negotiate ransoms. Kasatkin's lawyer denied the charges and claimed his client had no technical skills. \"He bought a second-hand computer. He did absolutely nothing. He's shocked,\" his lawyer, Frédéric Bélot,\ntold\nAFP. \"He's useless with computers and can't even install an application. He didn't touch anything on the computer: it was either hacked, or the hacker sold it to him to act under the cover of another person.\" He's currently being held pending extradition to the U.S. The ransomware group Kasatkin was allegedly involved with has not been named, but is said to have attacked roughly 900 companies. The U.S. Federal Bureau of Investigation (FBI) said recently that it's aware of 900 organizations hit by the Play ransomware group.\nRansomedVC Returns After Hiatus; Leaks Medusa Data\n— The RansomedVC ransomware group has\nreturned\nafter a two-year absence and leaked the internal chat transcripts of the Medusa ransomware group from December 11, 2022, to March 2023. RansomedVC claimed Medusa's admin \"seems completely absent and unresponsive to the needs of his members\" and indicated that they may either be trying an exit scam or might have been compromised by law enforcement. \"From the transcript and analyzing previous events, the group is mainly focused on targeting Fortinet Access as an SQLi Vulnerability was exploited by the group in 2024 and the current leaked chat that mentions 'Forti' also underlines its importance which dates back to 2023,\" security researcher Rakesh Krishnan said. The development coincides with the emergence of new players, including\nBERT\n. Another ransomware group, SafePay, which emerged last year has since evolved to become \"one of the most active and dangerous actors,\" mainly targeting managed service providers (MSPs) and small-to-midsize businesses (SMBs). \"The group uses classic but effective techniques: RDP- and VPN-based intrusion, credential theft, privilege escalation and living-off-the-land binaries to quietly move through victim networks, exfiltrate sensitive data and then encrypt files,\" Acronis\nsaid\n. Ransomware assaults on businesses around the world have increased by 213% in the first quarter of 2025, with 2,314 victims reported over 74 distinct data breach sites, compared to just 1,086 in the first quarter of 2024.\nDisgruntled IT Worker Jailed for Cyber Attack\n— Mohammed Umar Taj, 31, of Hyrst Garth, Batley, U.K., was\nsentenced\nto seven months and 14 days in prison for unlawfully accessing his former employer's premises, altering login credentials, and changing access credentials and multi-factor authentication configuration to disrupt the company's operations. He was suspended from work in July 2022.\nHacker Behind GMX Exchange Returns Assets\n— An unknown hacker behind the $42 million theft from decentralized exchange GMX has returned the stolen assets in return for a $5 million bug bounty. The development happened after GMX promised not to pursue charges if the hacker returned the funds. In a post-mortem report, the company said it has addressed the root cause in a subsequent update. \"Based on a review of the incident by contributors, auditors and security researchers, the root cause of the exploit is a\nreentrancy attack\n,\" it\nsaid\n. \"By utilizing this reentrancy and bypassing the average short price calculations, the attacker was able to open positions and manipulate the average short price for BTC downwards from the initial value of $109,505.77 to $1,913.70.\"\nFlaws in Thermomix TM5 Appliance\n— A security analysis of Thermomix TM5's has uncovered several weaknesses that could render the kitchen appliance susceptible to firmware downgrade attacks (limited to versions prior to 2.14. Version 2.14) and secure boot bypass, allowing an attacker to gain persistence. \"This vulnerability can be chained with the firmware downgrade vulnerability to gain arbitrary code execution and apply a controlled firmware update file without messing up with the NAND flash,\" Synacktiv\nsaid\n. \"By exploiting these flaws, one can alter the firmware version block to bypass anti-downgrade protections, downgrade the firmware, and potentially execute arbitrary code.\"\nAPI Client Security Risks Detailed\n— An analysis of API clients like Postman, Insomnia, Bruno, and Hoppscotch has uncovered\npotential vulnerabilities\nwithin their JavaScript sandboxing implementations that could be exploited to achieve code execution. \"Running untrusted code without any isolation is, of course, a bad idea, but it is also problematic to use seemingly working solutions such as Node.js's built-in vm module or the third-party vm2 package,\" Sonar researchers Oskar Zeino-Mahmalat and Paul Gerste\nsaid\n. \"These are known to have bypasses that let malicious code escape the sandbox and get access to system resources.\"\nUbuntu Turns Off Intel GPU Security Mitigations\n— Ubuntu has disabled a security feature that protected Intel GPUs against Spectre side-channel attacks. Canonical said it now uses kernel-level protections, making it no longer necessary to have those safeguards. Ubuntu developers can expect the operating system to see a 20% in improvement in performance following the update. \"After discussion between Intel and Canonical's security teams, we are in agreement that Spectre no longer needs to be mitigated for the GPU at the Compute Runtime level,\" Ubuntu maintainers\nsaid\n. \"At this point, Spectre has been mitigated in the kernel, and a clear warning from the Compute Runtime build serves as a notification for those running modified kernels without those patches. For these reasons, we feel that Spectre mitigations in Compute Runtime no longer offer enough security impact to justify the current performance tradeoff.\"\nBotnet Engages in Web Scraping\n— A new botnet comprising more than 3,600 unique IP addresses has been observed involved in web scraping activity at least since April 19, 2025. The majority of the botnet's infected hosts are located in Taiwan, Japan, Bulgaria, and France, GreyNoise said, with targeted systems predominantly located in the United States and United Kingdom. \"The dominance of Taiwanese IP space could suggest: A common technology or service deployed widely in Taiwan has been compromised, or that local exposure to a shared vulnerability is driving the clustering,\" the threat intelligence firm\nsaid\n.\nCzechia Becomes the Latest Country to Issue Warning About DeepSeek\n— Czechia's cybersecurity agency, the National Cyber and Information Security Agency (NÚKIB), issued a formal warning detailing the national security risks posed by the use of software provided by Chinese artificial intelligence company DeepSeek. \"The primary security concerns stem from insufficient protection of data transmission and handling, from the collection of data types which, in greater volume, may lead to user deanonymization, and lastly, from the legal and political environment of the People's Republic of China to which the company DeepSeek is fully subject,\" NÚKIB\nsaid\n. To that end, the government has banned the use of DeepSeek on state-owned devices, urging the public to be mindful of the information shared with the platform. However, NÚKIB noted that the decision does not apply to open-source large language models (LLMs) developed by the company DeepSeek, provided that their source code is made available for review and can be deployed locally without any contact with servers associated with DeepSeek or its related entities. Several other nations, including Canada, Germany, Italy, the Netherlands, South Korea, and Taiwan, have\nissued\nsimilar warnings\n.\nTikTok Comes Under E.U. Radar Again\n— Ireland's Data Protection Commission (DPC) said it's\nopening\na probe into TikTok over the transfer of user data in the European Union to servers located in China. \"The purpose of the inquiry is to determine whether TikTok has complied with its relevant obligations under the GDPR in the context of the transfers now at issue, including the lawfulness of the transfers [under GDPR],\" the DPC said. The development comes a little more than two months after the DPC\nfined\nTikTok €530 million ($620 million) for infringing data protection regulations in the region by transferring European users' data to China and for allowing TikTok's China-based staff access European user data. TikTok, which is owned by China's ByteDance, has been the subject of intense scrutiny on both sides of the Atlantic over how it handles personal user information amid concerns that it poses a national security risk. As per stringent data protection laws in the region, European user data can only be transferred outside of the bloc if there are safeguards in place to ensure the same level of protection. TikTok is also facing the heat in the United Kingdom after the First-tier Tribunal\nruled\nthat the Information Commissioner's Office (ICO), the British data regulator, has the power to issue a monetary penalty notice (MPN) to TikTok. The ICO fined TikTok £12.7 million in 2023, but the company argued that \"its processing was for artistic purposes, so the 'special purposes' provisions applied.\"\nGoogle Details Advanced Protection in Android\n— Back in May 2025, Google\nlaunched\nAdvanced Protection, a security feature that \"ensures all of Android's highest security features are enabled and are seamlessly working together to safeguard you against online attacks, harmful apps, and data risks.\" Similar to Lockdown Mode in Apple iOS, iPadOS, and macOS devices, Advanced Protection aims to provide improved guardrails for journalists and other high-risk targets. In Google Chrome, this\nincludes\nalways using secure connections, full site isolation on mobile devices with 4GB+ RAM to keep malicious sites away from legitimate sites, and disabling JavaScript optimizations.\nSatanLock Announces Abrupt Shutdown\n— SatanLock, a newer ransomware group on the threat landscape, has\nannounced\nthat it will be shutting down. The exact reasons behind the sudden move is unclear. The group first emerged in early April, and published 67 victims within a span of a month. However, Check Point\nfound\nthat 65% of these victims had already been listed by other ransomware groups.\nRussia Rejects Law to Legalize White-Hat Hacking\n— Russia's State Duma has rejected legislation that would have legalized ethical hacking, citing national security concerns. Politicians expressed worries that finding vulnerabilities found in software made by companies headquartered in hostile countries would require sharing them, which, in turn, could lead to those nations abusing the defects for strategic gain, local media\nreported\n.\nGitHub Repos Used to Distribute Malware as Free VPN\n— Threat actors have been observed using\nGitHub as a mechanism\nfor staging\nstealer malware\nlike Lumma by disguising it as 'Free VPN for PC and Minecraft Skin Changer. \"The analysis of the 'Free-VPN-For-PC' sample revealed that, behind its seemingly legitimate facade, it functions as a sophisticated malware dropper designed to implant the Lumma Stealer,\" CYFIRMA\nsaid\n. \"Disguised as a helpful tool, the dropper uses multiple layers of obfuscation, in-memory execution, and process injection to evade detection. The same malware was also repackaged under the name 'Minecraft Skin,' indicating a broader social engineering tactic targeting different user interests.\"\nNFC-Enabled Fraud Targets Philippines' Financial Sector\n— Chinese mobile malware syndicates that rely on\nNFC relay attacks\nhave now spread to the Philippines, Resecurity revealed. \"Major underground shops managed by Chinese cybercriminals list the Philippines as one of the most impacted areas, based on the volume of compromised credit cards (CCs),\" the company\nsaid\n. Some of the other top regions targeted by Chinese cybercriminals include Australia, Taiwan, Malaysia, New Zealand, Singapore, Thailand, Hong Kong, Korea, and Indonesia. These groups, active on Telegram, enable fraudsters to acquire compromised cards and also check whether they are valid or not, using micro-charges performed via fraudulent merchants set up by Chinese cybercriminals. Attackers can then use tools like Z-NFC, X-NFC, SuperCard X, Track2NFC to clone stolen card data and perform unauthorized transactions using NFC-enabled devices.\nGitPhish Tool to Automate GitHub Device Code Phishing\n— Cybersecurity researchers have\ndemonstrated\na novel initial access vector that leverages the OAuth 2.0 Device Authorization Grant flow to compromise an organization's GitHub repositories and software supply chain. Called Device Code Phishing, the technique employs social engineering ploys to trick targets into entering an eight-digit device code by clicking on an attacker-provided link, potentially leading to complete compromise of organizational GitHub repositories and software supply chains. It's worth noting that device code phishing has been\nutilized\nby suspected Russian threat actors to gain access to Microsoft accounts. \"We designed\nGitPhish\nexplicitly for security teams looking to conduct assessments and build detection capabilities around Device Code Phishing in GitHub,\" Praetorian\nsaid\n. \"Red teamers can simulate realistic attack scenarios to test organizational resilience, while detection engineers can validate their ability to identify suspicious OAuth flows, unusual GitHub authentication patterns, and potential social engineering attempts.\"\nMalicious Browser Extensions Galore\n— A set of 18 malicious extensions with 2.3 million downloads in Google's Chrome Web Store and Microsoft Edge Addons have been found to incorporate features to track users' site visits, steal browser activity, and redirect to potentially unsafe sites. These add-ons pose as productivity and entertainment tools across diverse categories, including color pickers, emoji keyboards, weather forecasts, video speed controllers, VPN proxies for Discord and TikTok, dark themes, volume boosters and YouTube unblockers. While they offer the advertised functionality, they provide the perfect cover to conceal their browser surveillance and hijacking capabilities. The activity has been codenamed\nRedDirection\nby Koi Security. What makes the campaign concerning is that the extensions started off as benign tools, with the malicious code introduced at a later time via updates, in some cases after years. Last month, LayerX\nrevealed\nthat it had identified a network of malicious \"sleeper agent\" extensions that are likely being set up as a stepping stone for future activity. These extensions were identified as being installed nearly 1.5 million times. One of the extensions that's common to both these clusters is \"Volume Max — Ultimate Sound Booster\" (extension ID: mgbhdehiapbjamfgekfpebmhmnmcmemg). The disclosure coincides with another campaign uncovered by Secure Annex dubbed Mellow Drama, which has transformed hundreds of extensions incorporating a Mellowtel library into a distributed web scraping network. The extensions have been collectively installed nearly 1 million times. \"We discovered a new monetization library developed by Mellowtel that pays extension developers in exchange for the 'unused bandwidth' of users who have an extension installed,\" John Tuckner\nsaid\n. The library has been traced back to an individual named Arslan Ali, who is also the founder of a company called\nOlostep\nthat claims to offer the \"World's Most Reliable and Cost-effective Web Scraping API.\" It's believed that scraping requests from Olostep are distributed to any of the active extensions that are running the Mellowtel library. Mellowtel has since responded, stating it does not collect or sell users' personal data. \"Instead of collecting users' data, tracking them across the web, and showing them ads non-stop, we are building a monetization engine for developers based on bandwidth/resource sharing,\" Ali\nsaid\n.\n🎥 Cybersecurity Webinars\nStop 'Pip Install and Pray': How to Secure Your Python Supply Chain in 2025\n- Repojacking, typosquatting, and poisoned containers are turning trusted tools into attack vectors. Whether you're managing infrastructure or writing code, securing your Python environment is no longer optional. Learn how to take control before attackers do.\nFrom Login Fatigue to AI Fatigue: Securing Identity in 2025\n- AI is streamlining logins—but it's also raising alarm bells. Customers are growing wary of how their data is used, and trust is becoming harder to earn. This webinar reveals how leading brands are rebuilding digital trust while staying secure and user-friendly.\nFrom Copilots to Attack Bots: Securing the AI Identity Layer\n- As AI copilots and agents go mainstream, attackers are using the same tools to bypass logins, impersonate users, and exploit APIs. In this webinar, Okta reveals how to outpace AI threats by making identity your first—and last—line of defense.\n🔧 Cybersecurity Tools\nBitChat\n- It is a tool that lets you chat without the internet, servers, or even phone numbers—just Bluetooth. It builds a local mesh network between nearby devices, enabling fully offline communication. Public group chats are secure and ready to use. Private messages and channels are still under development and haven't been externally reviewed, so they're not recommended for sensitive conversations just yet.\nGitPhish\n- It is a tool for testing GitHub's device login flow in a security research setting. It helps stimulate phishing-style attacks by creating fake login pages, capturing tokens, and tracking activity. Built for ethical testing, it includes a dashboard, automated deployments, and logging—all meant for use in safe, authorized environments only.\nDisclaimer: These newly released tools are for educational use only and haven't been fully audited. Use at your own risk—review the code, test safely, and apply proper safeguards.\n🔒 Tip of the Week\nMap Known Vulnerabilities Automatically Across Your Stack —\nManually checking for CVEs is slow, incomplete, and easy to get wrong. Instead, use automated tools that correlate software versions with known vulnerabilities across your entire environment—both internal and internet-facing.\nStart with\nNmap\nand tools like\nCVEScannerV2\nor\nVulners NSE\nto scan live services for exposed software versions and match them to CVE databases. For deeper insights:\nUse tools like\nNuclei\n(customizable vulnerability templates),\nTrivy\n(container + system CVEs), and\nGrype\n(SBOM-based scanning).\nMonitor third-party components\nwith\nOSV-Scanner\nor\nDependency-Track\nif you're building software.\nSet up scheduled scans\nand use tools that integrate with ticketing systems to ensure teams actually act on the findings.\nFinally,\nfilter out noise\n—not every CVE is worth patching. Focus on CVEs with public exploits, high CVSS scores, and exposure to users or attackers.\nPro tip:\nAlways validate findings with real-world exploitability, not just version matches.\nConclusion\nWhat stands out this week isn't just the scale of incidents—it's how familiar tools, platforms, and even browser extensions are being quietly turned against us. From red teaming software reappearing as malware loaders to code libraries enabling stealth attacks, the line between legitimate use and exploitation keeps getting harder to see. When trusted environments become part of the attack chain, security teams must look beyond patching and start questioning assumptions about what's safe by default.\nStaying ahead means paying just as much attention to what's already inside the gates as what's trying to break in.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "CBI Shuts Down £390K U.K. Tech Support Scam, Arrests Key Operatives in Noida Call Center",
        "Link": "https://thehackernews.com/2025/07/cbi-shuts-down-390k-uk-tech-support.html",
        "Summary": "India's Central Bureau of Investigation (CBI) has announced that it has taken steps to dismantle what it said was a transnational cybercrime syndicate that carried out \"sophisticated\" tech support scams targeting citizens of Australia and the United Kingdom.\nThe fraudulent scheme is estimated to have led to losses worth more than £390,000 ($525,000) in the United Kingdom alone.\nThe law",
        "Date": "2025-07-14",
        "Content": "India's Central Bureau of Investigation (CBI) has announced that it has taken steps to dismantle what it said was a transnational cybercrime syndicate that carried out \"sophisticated\" tech support scams targeting citizens of Australia and the United Kingdom.\nThe fraudulent scheme is estimated to have led to losses worth more than £390,000 ($525,000) in the United Kingdom alone.\nThe law enforcement effort, which was carried out on July 7, 2025, as part of\nOperation Chakra V\n, involved searches at three locations in Noida, one of which was a fully functional fraudulent call center operating from the Noida Special Economic Zone.\nEvidence gathered by the CBI revealed that the call center, named FirstIdea, made use of advanced calling infrastructure and malicious scripts to facilitate cross-border anonymity and victim targeting at scale. A total of two arrests have been made, including a key operative partner of FirstIdea.\n\"The operation was meticulously timed with the time zones of the victims, resulting in the detection of live scam calls in progress during the raids,\" the CBI\nsaid\nin a press statement.\nThe syndicate, the agency added, masqueraded as technical support staff of reputed multinational companies, including Microsoft with an intent to cheat foreign nationals by falsely claiming that their devices were compromised and extort money from them to address non-existent technical problems.\nThe U.K. National Crime Agency (NCA) said the arrest and disruption was the result of 18 months of \"groundbreaking collaboration\" between CBI, NCA, the U.S. Federal Bureau of Investigation (FBI), and Microsoft to identify the organized crime group and target the IT infrastructure used.\nMore than 100 people in the United Kingdom are said to have fallen prey to the tech support scam, which involved the threat actors using spoofed phone numbers and Voice Over Internet Protocol (VoIP) to route calls through multiple servers in several countries.\n\"More than 100 U.K. victims had been contacted by a group offering to fix their computers for a fee, following a screen pop up that suggested their device was infected or had been hacked,\" the NCA\nnoted\n. \"In reality, the fraudsters were posing as employees of Microsoft, offering software solutions to an attack that had never taken place.\"\nThe development comes as Nikkei Asia\nrevealed\nthat the number of scam centers used to\npull off crypto scams\nin eastern Myanmar is continuing to expand at a rapid pace despite a crackdown earlier this February, with at least 16 suspected scam sites being documented and construction ongoing at eight of them.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "eSIM Vulnerability in Kigen's eUICC Cards Exposes Billions of IoT Devices to Malicious Attacks",
        "Link": "https://thehackernews.com/2025/07/esim-vulnerability-in-kigens-euicc.html",
        "Summary": "Cybersecurity researchers have discovered a new hacking technique that exploits weaknesses in the eSIM technology used in modern smartphones, exposing users to severe risks.\nThe issues impact the Kigen eUICC card. According to the Irish company's website, more than two billion SIMs in IoT devices have been enabled as of December 2020.\nThe findings come from Security Explorations, a research lab",
        "Date": "2025-07-14",
        "Content": "Cybersecurity researchers have discovered a new hacking technique that exploits weaknesses in the eSIM technology used in modern smartphones, exposing users to severe risks.\nThe issues\nimpact\nthe Kigen eUICC card. According to the Irish company's website, more than\ntwo billion SIMs\nin IoT devices have been\nenabled\nas of December 2020.\nThe findings come from Security Explorations, a research lab of AG Security Research company. Kigen awarded the company a $30,000 bounty for their report.\nAn eSIM, or embedded SIM, is a digital SIM card that's embedded directly into a device as software installed onto an Embedded Universal Integrated Circuit Card (eUICC) chip.\neSIMs allow users to activate a cellular plan from a carrier without the need for a physical SIM card. eUICC software offers the ability to change operator profiles, remote provisioning, and management of SIM profiles.\n\"The eUICC card makes it possible to install the so-called eSIM profiles into the target chip,\" Security Explorations said. \"eSIM profiles are software representations of mobile subscriptions.\"\nAccording to an\nadvisory\nreleased by Kigen, the vulnerability is rooted in the GSMA TS.48 Generic Test Profile, versions 6.0 and earlier, which is said to be used in eSIM products for radio compliance testing.\nSpecifically, the shortcoming allows for the installation of non-verified, and potentially malicious applets.\nGSMA TS.48 v7.0\n, released last month, mitigates the problem by restricting the use of the test profile. All\nother versions\nof the TS.48 specification have been deprecated.\n\"Successful exploitation requires a combination of specific conditions. An attacker must first gain physical access to a target eUICC and use publicly known keys,\" Kigen said. \"This enables the attacker to install a malicious JavaCard applet.\"\nFurthermore, the vulnerability could facilitate the extraction of the Kigen eUICC identity certificate, thereby making it possible to download arbitrary profiles from mobile network operators (MNOs) in cleartext, access MNO secrets, and tamper with profiles and put them into an arbitrary eUICC without being flagged by MNO.\nSecurity Explorations said the findings build upon its own prior research from 2019, which\nfound\nmultiple\nsecurity vulnerabilities\nin Oracle Java Card that could pave the way for the deployment of a persistent backdoor in the card. One of the flaws also impacted Gemalto SIM, which relies on the Java Card technology.\nThese security defects can be exploited to \"break memory safety of the underlying Java Card VM\" and gain full access to the card's memory, break the applet firewall, and potentially even achieve native code execution.\nHowever, Oracle downplayed the potential impact and indicated that the \"security concerns\" did not affect their production of Java Card VM. Security Explorations said these \"concerns\" have now been proven to be \"real bugs.\"\nThe attacks might sound prohibitive to execute, but, to the contrary, they are well within the reach of capable nation-state groups. They could allow the attackers to compromise an eSIM card and deploy a stealthy backdoor, effectively intercepting all communications.\n\"The downloaded profile can be potentially modified in such a way, so that the operator loses control over the profile (no ability for remote control / no ability to disable/invalidate it, etc.), the operator can be provided with a completely false view of the profile state or all of its activity can be subject to monitoring,\" the company added.\n\"In our opinion, the ability for a single broken eUICC / single eUICC GSMA cert theft to peek into (download in plaintext) eSIMs of arbitrary MNO constitutes a significant eSIM architecture weak point.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "UK launches vulnerability research program for external experts",
        "Link": "https://www.bleepingcomputer.com/news/security/uk-launches-vulnerability-research-program-for-external-experts/",
        "Summary": "UK's National Cyber Security Centre (NCSC) has announced a new Vulnerability Research Initiative (VRI) that aims to strengthen relations with external cybersecurity experts. [...]",
        "Date": "2025-07-14",
        "Content": "UK's National Cyber Security Centre (NCSC) has announced a new Vulnerability Research Initiative (VRI) that aims to strengthen relations with external cybersecurity experts.\nThe agency already conducts internal vulnerability research on a wide range of technologies and will continue to do so. However, the launch of VRI will create a parallel program designed to improve discovery and sharing of critical insights with the community more expeditiously.\nThe NCSC is the UK's cybersecurity authority, tasked to protect from cyber threats targeting the country's critical infrastructure, government, businesses, and citizens.\nTo fulfill this mission, the agency\npublishes alerts\n, cybersecurity guidance, and threat analysis, provides support in incident response, and coordinates related activities with public, private, and international partners.\nThe VRI is a structured collaboration between the NCSC and external cybersecurity researchers to improve the UK's capabilities in identifying and understanding software and hardware vulnerabilities.\n\"The Vulnerability Research Initiative (VRI) is NCSC's programme of research with external partners on VR,\"\nreads the agency's announcement\n.\n\"The VRI's mission is to strengthen the UK's ability to carry out VR. We work with the best external vulnerability researchers to deliver a deep understanding of security on a wide range of technologies we care about.​\"\nNCSC will partner with skilled external vulnerability researchers who will be given objectives to identify flaws in specific products of interest, assess proposed mitigations, and finally disclose the flaws through the 'Equities Process' procedure.\nThe researchers will also submit to the NCSC details about the tools they used and the methodologies they followed during their VR activities, to help develop a framework of effective practices.\nNCSC states that it plans to involve more experts in emerging specialized areas such as AI-powered vulnerability discovery.\nInterested security specialists are invited to email at vri@ncsc.gov.uk with their skills and focus areas.\nThe email address address should not be used for sending full vulnerability reports, the agency notes. NCSC recommends using\nthis portal\nto report a vulnerability instead.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nThe zero-day that could've compromised every Cursor and Windsurf user\nFour arrested in UK over M&S, Co-op, Harrods cyberattacks\nFBI's CJIS demystified: Best practices for passwords, MFA & access control\nRuckus Networks leaves severe flaws unpatched in management devices\nThe MFA You Trust Is Lying to You – and Here's How Attackers Exploit It"
    },
    {
        "Title": "Interlock ransomware adopts FileFix method to deliver malware",
        "Link": "https://www.bleepingcomputer.com/news/security/interlock-ransomware-adopts-filefix-method-to-deliver-malware/",
        "Summary": "Hackers have adopted the new technique called 'FileFix' in Interlock ransomware attacks to drop a remote access trojan (RAT) on targeted systems. [...]",
        "Date": "2025-07-14",
        "Content": "Hackers have adopted the new technique called 'FileFix' in Interlock ransomware attacks to drop a remote access trojan (RAT) on targeted systems.\nInterlock ransomware operations have increased over the past months as the threat actor started using the KongTuke web injector (aka 'LandUpdate808') to deliver payloads through compromised websites.\nThis shift in modus operandi was observed by researchers at The DFIR Report and Proofpoint since May. Back then, visitors of compromised sites were prompted to pass a fake CAPTCHA + verification, and then paste into a Run dialog content automatically saved to the clipboard, a tactic consistent with ClickFix attacks.\nThe trick led users to execute a PowerShell script that fetched and launched a Node.js-based variant of the Interlock RAT.\nIn June, researchers found a PHP-based variant of Interlock RAT used in the wild, which was delivered using the same KongTuke injector.\nEarlier this month, a significant change in the delivery wrapper occurred, with Interlock now switching to the FileFix variation of the ClickFix method as the preferred delivery method.\nInterlock's FileFix attack\nSource: The DFIR Report\nFileFix\nis a social engineering attack technique developed by security researcher mr.d0x. It's an evolution of the\nClickFix attack\n, which became one of the most\nwidely employed\npayload distribution methods over the past year.\nIn the FileFix variation, the attacker weaponizes trusted Windows UI elements, such as File Explorer and HTML Applications (.HTA), to trick users into executing malicious PowerShell or\nJavaScript code\nwithout displaying any security warnings.\nUsers are prompted to \"open a file\" by pasting a copied string into File Explorer's address bar. The string is a PowerShell command disguised to look like a file path using comment syntax.\nIn the recent Interlock attacks, targets are asked to paste a command disguised with a fake file path onto File Explorer, leading to the downloading of the PHP RAT from 'trycloudflare.com' and its execution on the system.\nPost-infection, the RAT executes a series of PowerShell commands to gather system and network information and exfiltrates this data as structured JSON to the attacker.\nThe\nDFIR Report\nalso mentions evidence of interactive activity, including Active Directory enumeration, checking for backups, navigating local directories, and examining domain controllers.\nThe command and control (C2) server can send shell commands for the RAT to execute, introduce new payloads, add persistence via a Registry run key, or move laterally via remote desktop (RDP).\nInterlock ransomware\nlaunched in September 2024\n, claiming notable victims like the\nTexas Tech University\n,\nDaVita\n, and\nKettering Health\n.\nThe ransomware operation\nleveraged ClickFix\nto infect targets, but its pivoting to FileFix indicates that the attacker is quick to adapt to stealthier attack methods.\nThis is the first public confirmation of FileFix being used in actual cyberattacks. It is likely to gain more popularity as threat actors explore ways to incorporate it into their attack chains.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nInterlock ransomware gang deploys new NodeSnake RAT on universities\nKettering Health confirms Interlock ransomware behind cyberattack\nInterlock ransomware claims Kettering Health breach, leaks stolen data\nKettering Health hit by system-wide outage after ransomware attack\nRussian pro basketball player arrested for alleged role in ransomware attacks"
    },
    {
        "Title": "Gigabyte motherboards vulnerable to UEFI malware bypassing Secure Boot",
        "Link": "https://www.bleepingcomputer.com/news/security/gigabyte-motherboards-vulnerable-to-uefi-malware-bypassing-secure-boot/",
        "Summary": "Dozens of Gigabyte motherboard models run on UEFI firmware vulnerable to security issues that allow planting bootkit malware that is invisible to the operating system and can survive reinstalls. [...]",
        "Date": "2025-07-14",
        "Content": "Dozens of Gigabyte motherboard models run on UEFI firmware vulnerable to security issues that allow planting bootkit malware that is invisible to the operating system and can survive reinstalls.\nThe vulnerabilities could allow attackers with local or remote admin permissions to execute arbitrary code in System Management Mode (SMM), an environment isolated from the operating system (OS) and with more privileges on the machine.\nMechanisms running code below the OS have low-level hardware access and initiate at boot time. Because of this, malware in these environments can bypass traditional security defenses on the system.\nUEFI, or Unified Extensible Firmware Interface, firmware is more secure due to the Secure Boot feature that ensures through cryptographic verifications that a device uses at boot time code that is safe and trusted.\nFor this reason, UEFI-level malware like bootkits (\nBlackLotus\n,\nCosmicStrand\n,\nMosaicAggressor\n,\nMoonBounce\n,\nLoJax\n) can deploy malicious code at every boot.\nPlenty of motherboards impacted\nThe four vulnerabilities are in Gigabyte firmware implementations and were discovered by researchers at firmware security company Binarly, who shared their findings with Carnegie Mellon University’s CERT Coordination Center (CERT/CC).\nThe original firmware supplier is American Megatrends Inc. (AMI), which addressed the issues after a private disclosure but some OEM firmware builds (e.g. Gigabyte's) did not implement the fixes at the time.\nIn Gigabyte firmware implementations, Binarly found the following vulnerabilities, all with a high-severity score of 8.2:\nCVE-2025-7029\n: bug in an SMI handler (OverClockSmiHandler) that can lead to SMM privilege escalation\nCVE-2025-7028\n: bug in an SMI handler (SmiFlash) gives read/write access to the System Management RAM (SMRAM), which can lead to malware installation\nCVE-2025-7027\n: can lead to SMM privilege escalation and modifying the firmware by writing arbitrary content to SMRAM\nCVE-2025-7026\n: allows arbitrary writes to SMRAM and can lead to privilege escalation to SMM and persistent firmware compromise\nBy our count, there are a little more than 240 motherboard models impacted - including revisions, variants, and region-specific editions, with firmware updated between late 2023 and mid-August 2024.\nBleepingComputer reached out to Binarly for an official count and a company representative told us that \"over a hundred product lines are affected.\"\nProducts from other enterprise device vendors are also impacted by the four vulnerabilities but their names remain undisclosed until fixes become available.\nBinarly researchers notified Carnegie Mellon CERT/CC about the issues on April 15 and Gigabyte confirmed the vulnerabilities on June 12, followed by the release of firmware updates, according to\nCERT/CC\n.\nHowever, the OEM has not published a security bulletin about the security problems that Binarly reported. BleepingComputer has emailed the hardware vendor a request for comment but we are still waiting for their response.\nMeanwhile, Binarly founder and CEO Alex Matrosov told BleepingComputer that Gigabyte most likely hasn’t released fixes. With many of the products already having reached end-of-life, users should not expect to receive any security updates.\n“Because all these four vulnerabilities originated from AMI reference code, AMI disclosed these vulnerabilities a while ago with their silent disclosure to paid customers only under NDA, and it caused significant effects for years on the downstream vendors when they stayed vulnerable and unpatched” - Alex Matrosov\n“It seems that Gigabyte has not released any fixes yet, and many of the affected devices have reached end-of-life status, meaning they will likely remain vulnerable indefinitely.”\nWhile the risk for general consumers is admittedly low, those in critical environments can assess the specific risk with Binarly’s\nRisk Hunt scanner tool\n, which includes free detection for the four vulnerabilities.\nComputers from various OEMs using Gigabyte motherboards may be vulnerable, so users are advised to monitor for firmware updates and apply them promptly.\nUPDATE [July 14th, 13:23 EST]:\nArticle updated with comment from Binarly saying that the four vulnerabilities affect more than 100 motherboards, and that products from other vendors are impacted.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nHackers exploit OttoKit WordPress plugin flaw to add admin accounts\nWindows 10 KB5062554 cumulative update released with 13 changes, fixes\n'123456' password exposed chats for 64 million McDonald’s job chatbot applications\nHackers are exploiting critical RCE flaw in Wing FTP Server\nNVIDIA shares guidance to defend GDDR6 GPUs against Rowhammer attacks"
    },
    {
        "Title": "Malicious VSCode extension in Cursor IDE led to $500K crypto theft",
        "Link": "https://www.bleepingcomputer.com/news/security/malicious-vscode-extension-in-cursor-ide-led-to-500k-crypto-theft/",
        "Summary": "A fake extension for the Cursor AI IDE code editor infected devices with remote access tools and infostealers, which, in one case, led to the theft of $500,000 in cryptocurrency from a Russian crypto developer. [...]",
        "Date": "2025-07-14",
        "Content": "A fake extension for the Cursor AI IDE code editor infected devices with remote access tools and infostealers, which, in one case, led to the theft of $500,000 in cryptocurrency from a Russian crypto developer.\nCursor AI IDE is an AI-powered development environment based on Microsoft's Visual Studio Code. It includes support for Open VSX, an alternative to the Visual Studio Marketplace, that allows you to install VSCode-compatible extensions to expand the software's functionality.\nKaspersky\nreports\nthat they were called in to investigate a security incident where a Russian developer working in cryptocurrency reported that $500,00 in crypto was stolen from his computer. The machine had no antivirus software installed, but it was said to be clean.\nGeorgy Kucherin, a security researcher for Kaspersky, received an image of the device's hard drive, and after analyzing it, discovered a malicious JavaScript file named extension.js located in the .cursor/extensions directory.\nThe extension was named \"Solidity Language\" and was published on the Open VSX registry, claiming to be a syntax highlighting tool for working with Ethereum smart contracts\nAlthough the plugin impersonated the legitimate\nSolidity syntax highlighting extension\n, it actually executed a PowerShell script from a remote host at angelic[.]su to download additional malicious payloads.\nExtension.js file executing remote PowerShell script\nSource: Kaspersky\nThe remote PowerShell script checked if the remote management tool ScreenConnect was already installed, and if not, executed another script to install it.\nOnce ScreenConnect was installed, the threat actors gained full remote access to the developer's computer. Using ScreenConnect, the threat actor uploaded and executed VBScript files that were used to download additional payloads to the device.\nThe final script in the attack downloaded a malicious executable from archive[.]org that contained a loader known as VMDetector, which installed:\nQuasar RAT:\nA remote access trojan capable of executing commands on devices.\nPureLogs stealer:\nAn infostealing malware that steals credentials and authentication cookies from web browsers, as well as stealing cryptocurrency wallets.\nAccording to Kaspersky, Open VSX showed that the extension had been downloaded 54,000 times before it was removed on July 2. However, the researchers believe that this install count was artificially inflated to give it a sense of legitimacy.\nA day later, the attackers published an almost identical version under the name \"solidity,\" inflating the install count for this extension to nearly two million.\nInflated download counts for malicious extensions\nSource: Kaspersky\nKaspersky says the threat actors were able to rank their extension higher than the legitimate one in Open VSX search results by gaming the algorithm and through the inflated install count. This caused the victim to install the malicious extension, thinking it was the legitimate one.\nThe researchers found similar extensions published to Microsoft's Visual Studio Code marketplace named \"solaibot\", \"among-eth\", and \"blankebesxstnion,\" which also executed a PowerShell script to install ScreenConnect and infostealers.\nKaspersky warns that developers should be wary of downloading packages and extensions from open repositories as they have become a common source of malware infections.\n\"Malicious packages continue to pose a significant threat to the crypto industry. Many projects today rely on open-source tools downloaded from package repositories,\" concludes Kaspersky.\n\"Unfortunately, packages from these repositories are often a source of malware infections. Therefore, we recommend extreme caution when downloading any tools. Always verify that the package you're downloading isn't a fake.\"\n\"If a package doesn't work as advertised after you install it, be suspicious and check the downloaded source code.\"\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nDozens of fake wallet add-ons flood Firefox store to drain crypto\nMozilla launches new system to detect Firefox crypto drainer add-ons\nDark Partners cybercrime gang fuels large-scale crypto heists\nThe zero-day that could've compromised every Cursor and Windsurf user\nEmployee gets $920 for credentials used in $140 million bank heist"
    },
    {
        "Title": "Web-Inject Campaign Debuts Fresh Interlock RAT Variant",
        "Link": "https://www.darkreading.com/threat-intelligence/web-inject-campaign-interlock-rat-variant",
        "Summary": "A cyber-threat campaign is using legitimate websites to inject victims with remote access Trojans belonging to the Interlock ransomware group, in order to gain control of devices.",
        "Date": "2025-07-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/web-inject-campaign-interlock-rat-variant"
    },
    {
        "Title": "Military Veterans May Be What Cybersecurity Is Looking For",
        "Link": "https://www.darkreading.com/remote-workforce/military-veterans-cybersecurity",
        "Summary": "As the field struggles with a shortage, programs that aim to provide veterans with the technical skills needed to succeed in cybersecurity may be the solution for everyone.",
        "Date": "2025-07-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/military-veterans-cybersecurity"
    },
    {
        "Title": "Google Gemini AI Bug Allows Invisible, Malicious Prompts",
        "Link": "https://www.darkreading.com/remote-workforce/google-gemini-ai-bug-invisible-malicious-prompts",
        "Summary": "A prompt-injection vulnerability in the AI assistant allows attackers to create messages that appear to be legitimate Google Security alerts but instead can be used to target users across various Google products with vishing and phishing.",
        "Date": "2025-07-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/google-gemini-ai-bug-invisible-malicious-prompts"
    },
    {
        "Title": "The Dark Side of Global Power Shifts &amp; Demographic Decline",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/dark-side-global-power-shifts-demographic-decline",
        "Summary": "As global power realigns and economies falter, the rise in cybercrime is no longer hypothetical — it's inevitable.",
        "Date": "2025-07-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/dark-side-global-power-shifts-demographic-decline"
    },
    {
        "Title": "Train Hack Gets Proper Attention After 20 Years: Researcher",
        "Link": "https://www.securityweek.com/train-hack-gets-proper-attention-after-20-years-researcher/",
        "Summary": "<p>A vulnerability affecting systems named End-of-Train and Head-of-Train can be exploited by hackers to cause trains to brake. </p>\n<p>The post <a href=\"https://www.securityweek.com/train-hack-gets-proper-attention-after-20-years-researcher/\">Train Hack Gets Proper Attention After 20 Years: Researcher </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/train-hack-gets-proper-attention-after-20-years-researcher/"
    },
    {
        "Title": "CitrixBleed 2 Flaw Poses Unacceptable Risk: CISA",
        "Link": "https://www.securityweek.com/citrixbleed-2-flaw-poses-unacceptable-risk-cisa/",
        "Summary": "<p>CISA considers the recently disclosed CitrixBleed 2 vulnerability an unacceptable risk and has added it to the KEV catalog.</p>\n<p>The post <a href=\"https://www.securityweek.com/citrixbleed-2-flaw-poses-unacceptable-risk-cisa/\">CitrixBleed 2 Flaw Poses Unacceptable Risk: CISA</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/citrixbleed-2-flaw-poses-unacceptable-risk-cisa/"
    },
    {
        "Title": "Google Gemini Tricked Into Showing Phishing Message Hidden in Email",
        "Link": "https://www.securityweek.com/google-gemini-tricked-into-showing-phishing-message-hidden-in-email/",
        "Summary": "<p>Google Gemini for Workspace can be tricked into displaying a phishing message when asked to summarize an email.</p>\n<p>The post <a href=\"https://www.securityweek.com/google-gemini-tricked-into-showing-phishing-message-hidden-in-email/\">Google Gemini Tricked Into Showing Phishing Message Hidden in Email </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/google-gemini-tricked-into-showing-phishing-message-hidden-in-email/"
    },
    {
        "Title": "New Interlock RAT Variant Distributed via FileFix Attacks",
        "Link": "https://www.securityweek.com/new-interlock-rat-variant-distributed-via-filefix-attacks/",
        "Summary": "<p>The Interlock ransomware group has partnered with the KongTuke TDS to distribute a new RAT variant via FileFix attacks.</p>\n<p>The post <a href=\"https://www.securityweek.com/new-interlock-rat-variant-distributed-via-filefix-attacks/\">New Interlock RAT Variant Distributed via FileFix Attacks</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/new-interlock-rat-variant-distributed-via-filefix-attacks/"
    },
    {
        "Title": "Flaws in Gigabyte Firmware Allow Security Bypass, Backdoor Deployment",
        "Link": "https://www.securityweek.com/flaws-in-gigabyte-firmware-allow-security-bypass-backdoor-deployment/",
        "Summary": "<p>Vulnerabilities in Gigabyte firmware implementations could allow attackers to disable Secure Boot and execute code during the early boot phase.</p>\n<p>The post <a href=\"https://www.securityweek.com/flaws-in-gigabyte-firmware-allow-security-bypass-backdoor-deployment/\">Flaws in Gigabyte Firmware Allow Security Bypass, Backdoor Deployment</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/flaws-in-gigabyte-firmware-allow-security-bypass-backdoor-deployment/"
    },
    {
        "Title": "Louis Vuitton Data Breach Hits Customers in Several Countries",
        "Link": "https://www.securityweek.com/louis-vuitton-data-breach-hits-customers-in-several-countries/",
        "Summary": "<p>Louis Vuitton customers in the UK, South Korea, Turkey and possibly other countries are being notified of a data breach.</p>\n<p>The post <a href=\"https://www.securityweek.com/louis-vuitton-data-breach-hits-customers-in-several-countries/\">Louis Vuitton Data Breach Hits Customers in Several Countries</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/louis-vuitton-data-breach-hits-customers-in-several-countries/"
    },
    {
        "Title": "Hackers Inject Malware Into Gravity Forms WordPress Plugin",
        "Link": "https://www.securityweek.com/hackers-inject-malware-into-gravity-forms-wordpress-plugin/",
        "Summary": "<p>Two Gravity Forms WordPress plugin versions available on the official download page were injected with malware in a supply chain attack.</p>\n<p>The post <a href=\"https://www.securityweek.com/hackers-inject-malware-into-gravity-forms-wordpress-plugin/\">Hackers Inject Malware Into Gravity Forms WordPress Plugin </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/hackers-inject-malware-into-gravity-forms-wordpress-plugin/"
    },
    {
        "Title": "13 Romanians Arrested for Phishing the UK’s Tax Service",
        "Link": "https://www.securityweek.com/thirteen-romanians-arrested-for-phishing-the-uks-tax-service/",
        "Summary": "<p>Investigators from HMRC joined more than 100 Romanian police officers to arrest the 13 Romanian suspects in the counties of Ilfov, Giurgiu and Calarasi. </p>\n<p>The post <a href=\"https://www.securityweek.com/thirteen-romanians-arrested-for-phishing-the-uks-tax-service/\">13 Romanians Arrested for Phishing the UK’s Tax Service</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/thirteen-romanians-arrested-for-phishing-the-uks-tax-service/"
    },
    {
        "Title": "CARSTAR Business Group Allegedly Hit by Sarcoma Ransomware",
        "Link": "https://dailydarkweb.net/carstar-business-group-allegedly-hit-by-sarcoma-ransomware/",
        "Summary": "CARSTAR Business Group, a prominent entity in the Automotive Service &#38; Collision Repair industry, has allegedly fallen victim to a cyberattack by the Sarcoma ransomware group. The company, which employs between 50 and 99 individuals and boasts an annual revenue of $5 million to $10 million, is headquartered in Ancaster, Ontario, Canada. This breach could [&#8230;]",
        "Date": "2025-07-14",
        "Content": "CARSTAR Business Group, a prominent entity in the Automotive Service & Collision Repair industry, has allegedly fallen victim to a cyberattack by the Sarcoma ransomware group. The company, which employs between 50 and 99 individuals and boasts an annual revenue of $5 million to $10 million, is headquartered in Ancaster, Ontario, Canada. This breach could have significant implications given CARSTAR’s position within the automotive repair sector.\nThe Sarcoma ransomware group allegedly exfiltrated a substantial 65 GB archive of data from CARSTAR Business Group’s systems. The leaked data reportedly contains various files, potentially including sensitive operational and customer information. The full extent of the impact on CARSTAR’s customers and business operations is yet to be determined, but the incident highlights the ongoing threat posed by ransomware to businesses of all sizes.\nVehicle Information (License, VIN)\nVendor Information (Name, Address, Phone, Fax)\nInvoice Details (Invoice Number, Description, Amount)\nReturn Order Details (Return Parts, Description, Part Number, Type, Original Invoice, Credit Amount)\nPayment Information (Check Number, Amount, Date)\nTags:\nautomotive industry\nCanada\nCARSTAR Business Group\nCyberSecurity\ndata-breach\nransomware\nSarcoma"
    },
    {
        "Title": "Alleged Data Breach of Colmedsa Exposes Records of Argentine Medical Professionals",
        "Link": "https://dailydarkweb.net/alleged-data-breach-of-colmedsa-exposes-records-of-argentine-medical-professionals/",
        "Summary": "A significant data breach has allegedly impacted the Colegio Médico de Santiago del Estero (COLMEDSA.COM.AR), an important institution for medical professionals in Argentina. This organization is responsible for overseeing and regulating the medical community in the Santiago del Estero province, making the exposed data highly sensitive. The breach allegedly compromised 138,978 records, which reportedly contain [&#8230;]",
        "Date": "2025-07-14",
        "Content": "A significant data breach has allegedly impacted the Colegio Médico de Santiago del Estero (COLMEDSA.COM.AR), an important institution for medical professionals in Argentina. This organization is responsible for overseeing and regulating the medical community in the Santiago del Estero province, making the exposed data highly sensitive. The breach allegedly compromised 138,978 records, which reportedly contain personal and professional information of Argentine medical professionals.\nThe data, allegedly scraped from 1,863 medical records, includes a wide array of personal and professional details. The exposure of such information could lead to various risks, including identity theft, phishing attacks, and other forms of cybercrime targeting these professionals.\nLeaked data titles allegedly include:\nLegajos (Files)\nPersonas (Persons)\nDatos Profesionales (Professional Data)\nPagos (Payments)\nBancos (Banks)\nTags:\nArgentina\nCOLMEDSA\nCyberSecurity\ndata-breach\ndata-leak\nMedical Professionals"
    },
    {
        "Title": "Naver.com Allegedly Suffers Significant Data Leak",
        "Link": "https://dailydarkweb.net/naver-com-allegedly-suffers-significant-data-leak/",
        "Summary": "Naver.com, often described as the &#8220;Yahoo for Koreans&#8221; and owned by the Japanese company Line Corporation, has allegedly experienced a substantial data breach. This incident follows a previous leak that the company reportedly dismissed as a &#8220;public info scrape.&#8221; However, based on information circulating, the current compromise appears to be far more severe, potentially exposing [&#8230;]",
        "Date": "2025-07-14",
        "Content": "Naver.com, often described as the “Yahoo for Koreans” and owned by the Japanese company Line Corporation, has allegedly experienced a substantial data breach. This incident follows a previous leak that the company reportedly dismissed as a “public info scrape.” However, based on information circulating, the current compromise appears to be far more severe, potentially exposing sensitive user data.\nThe alleged breach includes a range of critical user information, which could have serious implications for the millions who rely on Naver’s services for everything from search and news to shopping and communication. While the full extent of the compromised data is still being assessed, the initial indications point to a significant security incident.\nLeaked data allegedly includes:\nUser IDs\nPassword Hashes\nEmails\nPlaintext Passwords\nTags:\nCyberSecurity\ndata-breach\ndata-leak\nemail addresses\nNaver\npassword hashes\nplaintext passwords\nuser data"
    },
    {
        "Title": "UK Crowdfunding Platform Rebuilding Society Allegedly Hacked",
        "Link": "https://dailydarkweb.net/uk-crowdfunding-platform-rebuilding-society-allegedly-hacked/",
        "Summary": "A UK-based crowdfunding platform, Rebuilding Society, has allegedly been targeted in a cyberattack. The platform, which focuses on supporting social development projects and economic restructuring initiatives through innovative financing models, reportedly suffered a breach affecting its database. Rebuilding Society is a key player in empowering local communities by offering peer-to-peer lending, social impact investing, and [&#8230;]",
        "Date": "2025-07-14",
        "Content": "A UK-based crowdfunding platform, Rebuilding Society, has allegedly been targeted in a cyberattack. The platform, which focuses on supporting social development projects and economic restructuring initiatives through innovative financing models, reportedly suffered a breach affecting its database. Rebuilding Society is a key player in empowering local communities by offering peer-to-peer lending, social impact investing, and support for small businesses and startups.\nThe alleged perpetrators are said to have employed various methods to gain unauthorized access, including identifying vulnerabilities in the website’s source code, exploiting SQL injection flaws, implementing man-in-the-middle attacks, and utilizing phishing techniques. This breach allegedly resulted in the compromise of sensitive information.\nLeaked data titles reportedly include:\nUser account details\nProject funding amounts\nFinancial transaction records\nSensitive business strategies\nTags:\nCrowdfunding\ncyberattack\nCyberSecurity\ndata-breach\nRebuilding Society\nUK"
    },
    {
        "Title": "WinRAR Zero-Day Exploit Allegedly on Sale for $80,000",
        "Link": "https://dailydarkweb.net/winrar-zero-day-exploit-allegedly-on-sale-for-80000/",
        "Summary": "A critical zero-day remote code execution (RCE) vulnerability allegedly affecting the popular file compression software WinRAR is reportedly being sold on underground forums for $80,000. This exploit, which is claimed to be distinct from CVE-2025-6218, reportedly functions on the latest version of WinRAR and earlier iterations. The availability of such an exploit poses a significant [&#8230;]",
        "Date": "2025-07-14",
        "Content": "A critical zero-day remote code execution (RCE) vulnerability allegedly affecting the popular file compression software WinRAR is reportedly being sold on underground forums for $80,000. This exploit, which is claimed to be distinct from CVE-2025-6218, reportedly functions on the latest version of WinRAR and earlier iterations. The availability of such an exploit poses a significant threat to millions of users globally who rely on WinRAR for handling compressed files, potentially allowing attackers to execute arbitrary code on vulnerable systems.\nThe origin of this alleged zero-day exploit is currently unknown, though the offering suggests a sophisticated development capability. The sale is purportedly being facilitated through a forum’s guarantor service, a common practice in illicit marketplaces to ensure transactions between parties.\nTags:\nCyberSecurity\nexploit\nRCE\nvulnerability\nWinRAR\nZero-Day"
    }
]