[
    {
        "Title": "Windows 10 KB5062554 update breaks emoji panel search feature",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb5062554-update-breaks-emoji-panel-search-feature/",
        "Summary": "The search feature for the Windows 10 emoji panel is broken after installing the KB5062554 cumulative update released Tuesday, making it not possible to look up emojis by name or keyword. [...]",
        "Date": "2025-07-13",
        "Content": "The search feature for the Windows 10 emoji panel is broken after installing the KB5062554 cumulative update released Tuesday, making it not possible to look up emojis by name or keyword.\nWindows includes an emoji panel that allows you to select emojis to insert into text or search for an emoji using keywords.\nOn Tuesday, Microsoft released Windows updates to fix bugs and security vulnerabilities as part of the\nJuly 2025 Patch Tuesday\n.\nSince installing the\nWindows 10 KB5062554 update\n, numerous users report they are unable to use the search feature of the emoji picker to find and insert emojis into their writing.\n\"After installing the July 2025 cumulative update (KB5062554), the emoji picker still mostly works – you can call it up with (Win + .) and clicking an emoji pastes it correctly – but the emoji search function is completely bricked,\" a Windows 10 user posted to\nReddit\n.\n\"The moment you type anything in the searchbar you get the \"We couldn't find this one\" error.\"\nBleepingComputer can confirm that the search feature in the Windows 10 emoji panel worked before installing the KB5062554 update. However, after installing the update, the feature no longer worked, now stating \"We couldn't find this one,\" no matter what we typed.\nBroken search feature in Windows 10 emoji panel\nSource: BleepingComputer\nWindows 10\nreaches end of support\non October 14, 2025, with technical support, feature updates, and security updates no longer provided by Microsoft for free.\nEnterprise and consumers can\npurchase extended updates\n, but this only extends Windows 10 security updates for one year for consumers and up to three years for businesses.\nWhile Microsoft will likely fix this bug in the coming months, they are pushing people to upgrade to Windows 11, where they are focusing all of their development.\nBleepingComputer contacted Microsoft to see if they plan on fixing this bug, and will update the story when we receive a response.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nWindows 10 KB5062554 cumulative update released with 13 changes, fixes\nWindows 10 KB5060533 cumulative update released with 7 changes, fixes\nWindows 10 KB5058379 update triggers BitLocker recovery on some devices\nMicrosoft July 2025 Patch Tuesday fixes one zero-day, 137 flaws\nMicrosoft confirms Family Safety blocks Google Chrome from launching"
    },
    {
        "Title": "Google Gemini flaw hijacks email summaries for phishing",
        "Link": "https://www.bleepingcomputer.com/news/security/google-gemini-flaw-hijacks-email-summaries-for-phishing/",
        "Summary": "Google Gemini for Workspace can be exploited to generate email summaries that appear legitimate but include malicious instructions or warnings that direct users to phishing sites without using attachments or direct links. [...]",
        "Date": "2025-07-13",
        "Content": "Google Gemini for Workspace can be exploited to generate email summaries that appear legitimate but include malicious instructions or warnings that direct users to phishing sites without using attachments or direct links.\nSuch an attack leverages indirect prompt injections that are hidden inside an email and obeyed by Gemini when generating the message summary.\nDespite similar prompt attacks being reported since 2024 and safeguards being implemented to block misleading responses, the technique remains successful.\nAttack through Gemini\nA prompt-injection attack on Google's Gemini model was\ndisclosed through 0din\n, Mozilla's bug bounty program for generative AI tools, by researcher Marco Figueroa, GenAI Bug Bounty Programs Manager at Mozilla.\nThe process involves creating an email with an invisible directive for Gemini. An attacker can hide the malicious instruction in the body text at the end of the message using HTML and CSS that sets the font size to zero and its color to white.\nCrafting the malicious email\nSource: 0DIN\nThe malicious instruction will not be rendered in Gmail, and because there are no attachments or links present, the message is highly likely to reach the potential target's inbox.\nIf the recipient opens the email and asks Gemini to generate a summary of the email, Google's AI tool will parse the invisible directive and obey it.\nAn example provided by Figueroa shows Gemini following the hidden instruction and includes a security warning about the user's Gmail password being compromised, along with a support phone number.\nGemini summary result served to the user\nSource: 0DIN\nAs many users are likely to trust Gemini's output as part of Google Workspace functionality, chances are high for this alert to be considered a legitimate warning instead of a malicious injection.\nFigueroa offers a few detections and mitigation methods that security teams can apply to prevent such attacks. One way is to remove, neutralize, or ignore content that is styled to be hidden in the body text.\nAnother approach is to implement a post-processing filter that scans Gemini output for urgent messages, URLs, or phone numbers, flagging the message for further review.\nUsers should also be aware that Gemini summaries should not be considered authoritative when it comes to security alerts.\nBleepingComputer has contacted Google to ask about defenses that prevent or mitigate such attacks, and a spokesperson directed us to a Google\nblog post\non security measures against prompt injection attacks.\n\"We are constantly hardening our already robust defenses through red-teaming exercises that train our models to defend against these types of adversarial attacks,\" a Google spokesperson told BleepingComputer.\nThe company representative clarified to BleepingComputer that some of the mitigations are in the process of being implemented or are about to be deployed.\nGoogle has seen no evidence of incidents manipulating Gemini in the way demonstrated in Figueroa's report, the spokesperson said.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nGoogle rolls out text-to-image model Imagen 4 for free\nGoogle releases Gemini CLI with free Gemini 2.5 Pro\nGoogle’s upcoming Gemini Kingfall is allegedly a coding beast\nOpenAI says GPT-5 will unify breakthroughs from different models\nChatGPT is testing disruptive Study Together feature"
    }
]