[
    {
        "Title": "NightEagle APT Exploits Microsoft Exchange Flaw to Target China's Military and Tech Sectors",
        "Link": "https://thehackernews.com/2025/07/nighteagle-apt-exploits-microsoft.html",
        "Summary": "Cybersecurity researchers have shed light on a previously undocumented threat actor called NightEagle (aka APT-Q-95) that has been observed targeting Microsoft Exchange servers as a part of a zero-day exploit chain designed to target government, defense, and technology sectors in China.\nAccording to QiAnXin's RedDrip Team, the threat actor has been active since 2023 and has switched network",
        "Date": "2025-07-04",
        "Content": "Cybersecurity researchers have shed light on a previously undocumented threat actor called\nNightEagle\n(aka APT-Q-95) that has been observed targeting Microsoft Exchange servers as a part of a zero-day exploit chain designed to target government, defense, and technology sectors in China.\nAccording to QiAnXin's RedDrip Team, the threat actor has been active since 2023 and has switched network infrastructure at an extremely fast rate. The findings were presented at\nCYDES 2025\n, the third edition of Malaysia's National Cyber Defence & Security Exhibition and Conference held between July 1 and 3, 2025.\n\"It seems to have the speed of an eagle and has been operating at night in China,\" the cybersecurity vendor\nsaid\n, explaining the rationale behind naming the adversary NightEagle.\nAttacks mounted by the threat actor have singled out entities operating in the high-tech, chip semiconductors, quantum technology, artificial intelligence, and military verticals with the main goal of gathering intelligence, QiAnXin added.\nThe company also noted that it began an investigation after it discovered a bespoke version of the Go-based\nChisel\nutility on one of its customer's endpoints which was configured to automatically start every four hours as part of a scheduled task.\n\"The attacker modified the source code of the open-source Chisel intranet penetration tool, hard-coded the execution parameters, used the specified username and password, established a socks connection with the 443 end of the specified C&C address, and mapped it to the specified port of the C&C host to achieve the intranet penetration function,\" it said in a report.\nIt's said that the trojan is delivered by means of a .NET loader, which, in turn, is implanted into the Internet Information Server (IIS) service of the Microsoft Exchange Server. Further analysis has determined the presence of a zero-day that enabled the attackers to obtain the machineKey and gain unauthorized access to the Exchange Server.\n\"The attacker used the key to deserialize the Exchange server, thereby implanting a Trojan into any server that complies with the Exchange version, and remotely reading the mailbox data of any person,\" the report said.\nQiAnXin claimed that the activity was likely the work of a threat actor from North America given that the attacks took place between 9 p.m. and 6 a.m. Beijing time. The Hacker News has reached out to Microsoft for further comment, and we will update the story if we get a response.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Your AI Agents Might Be Leaking Data — Watch this Webinar to Learn How to Stop It",
        "Link": "https://thehackernews.com/2025/07/your-ai-agents-might-be-leaking-data.html",
        "Summary": "Generative AI is changing how businesses work, learn, and innovate. But beneath the surface, something dangerous is happening. AI agents and custom GenAI workflows are creating new, hidden ways for sensitive enterprise data to leak—and most teams don’t even realize it.\nIf you’re building, deploying, or managing AI systems, now is the time to ask: Are your AI agents exposing confidential data",
        "Date": "2025-07-04",
        "Content": "Generative AI is changing how businesses work, learn, and innovate. But beneath the surface, something dangerous is happening. AI agents and custom GenAI workflows are creating\nnew, hidden ways for sensitive enterprise data to leak\n—and most teams don't even realize it.\nIf you're building, deploying, or managing AI systems, now is the time to ask: Are your AI agents exposing confidential data without your knowledge?\nMost GenAI models don't intentionally leak data. But here's the problem: these agents are often plugged into corporate systems—pulling from SharePoint, Google Drive, S3 buckets, and internal tools to give smart answers.\nAnd that's where the risks begin.\nWithout tight access controls, governance policies, and oversight,\na well-meaning AI can accidentally expose sensitive information\nto the wrong users—or worse, to the internet.\nImagine a chatbot revealing internal salary data. Or an assistant surfacing unreleased product designs during a casual query. This isn't hypothetical. It's already happening.\nLearn How to Stay Ahead — Before a Breach Happens\nJoin the free live webinar \"\nSecuring AI Agents and Preventing Data Exposure in GenAI Workflows\n,\" hosted by Sentra's AI security experts. This session will explore how AI agents and GenAI workflows can unintentionally leak sensitive data—and what you can do to stop it before a breach occurs.\nThis isn't just theory. This session dives into\nreal-world AI misconfigurations\nand what caused them—from excessive permissions to blind trust in LLM outputs.\nYou'll learn:\nThe most common points where GenAI apps accidentally leak enterprise data\nWhat attackers are exploiting in AI-connected environments\nHow to tighten access without blocking innovation\nProven frameworks to secure AI agents before things go wrong\nWho Should Join?\nThis session is built for people making AI happen:\nSecurity teams\nprotecting company data\nDevOps engineers\ndeploying GenAI apps\nIT leaders\nresponsible for access and integration\nIAM & data governance pros\nshaping AI policies\nExecutives and AI product owners\nbalancing speed with safety\nIf you're working anywhere near AI, this conversation is essential.\nGenAI is incredible. But it's also unpredictable. And the same systems that help employees move faster can accidentally move sensitive data into the wrong hands.\nWatch this Webinar\nThis webinar gives you the tools to move forward with confidence—not fear.\nLet's make your AI agents powerful\nand\nsecure.\nSave your spot now and learn\nwhat it takes to protect your data in the GenAI era.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Critical Sudo Vulnerabilities Let Local Users Gain Root Access on Linux, Impacting Major Distros",
        "Link": "https://thehackernews.com/2025/07/critical-sudo-vulnerabilities-let-local.html",
        "Summary": "Cybersecurity researchers have disclosed two security flaws in the Sudo command-line utility for Linux and Unix-like operating systems that could enable local attackers to escalate their privileges to root on susceptible machines.\nA brief description of the vulnerabilities is below -\n\nCVE-2025-32462 (CVSS score: 2.8) - Sudo before 1.9.17p1, when used with a sudoers file that specifies a host",
        "Date": "2025-07-04",
        "Content": "Cybersecurity researchers have disclosed two security flaws in the Sudo command-line utility for Linux and Unix-like operating systems that could enable local attackers to escalate their privileges to root on susceptible machines.\nA brief description of the vulnerabilities is below -\nCVE-2025-32462\n(CVSS score: 2.8) - Sudo before 1.9.17p1, when used with a sudoers file that specifies a host that is neither the current host nor ALL, allows listed users to execute commands on unintended machines\nCVE-2025-32463\n(CVSS score: 9.3) - Sudo before 1.9.17p1 allows local users to obtain root access because \"\n/etc/nsswitch.conf\n\" from a user-controlled directory is used with the --chroot option\nSudo is a\ncommand-line tool\nthat allows low-privileged users to run commands as another user, such as the superuser. By executing instructions with sudo, the idea is to enforce the principle of least privilege, permitting users to carry out administrative actions without the need for elevated permissions.\nThe command is\nconfigured\nthrough a file called \"/etc/sudoers,\" which\ndetermines\n\"who can run what commands as what users on what machines and can also control special things such as whether you need a password for particular commands.\"\nStratascale researcher Rich Mirch, who is credited with discovering and reporting the flaws,\nsaid\nCVE-2025-32462 has managed to slip through the cracks for over 12 years. It is rooted in the Sudo's \"-h\" (host) option that makes it possible to list a user's sudo privileges for a different host. The feature was enabled in September 2013.\nHowever, the identified bug made it possible to execute any command allowed by the remote host to be run on the local machine as well when running the Sudo command with the host option referencing an unrelated remote host.\n\"This primarily affects sites that use a common sudoers file that is distributed to multiple machines,\" Sudo project maintainer Todd C. Miller\nsaid\nin an advisory. \"Sites that use LDAP-based sudoers (including SSSD) are similarly impacted.\"\nCVE-2025-32463, on the other hand, leverages Sudo's \"-R\" (chroot) option to run arbitrary commands as root, even if they are not listed in the sudoers file. It's also a critical-severity flaw.\n\"The default Sudo configuration is vulnerable,\" Mirch\nsaid\n. \"Although the vulnerability involves the Sudo chroot feature, it does not require any Sudo rules to be defined for the user. As a result, any local unprivileged user could potentially escalate privileges to root if a vulnerable version is installed.\"\nIn other words, the flaw permits an attacker to trick sudo into loading an arbitrary shared library by creating an \"/etc/nsswitch.conf\" configuration file under the user-specified root directory and potentially run malicious commands with elevated privileges.\nMiller\nsaid\nthe chroot option will be removed completely from a future release of Sudo and that supporting a user-specified root directory is \"error-prone.\"\nFollowing responsible disclosure on April 1, 2025, the vulnerabilities have been addressed in Sudo version 1.9.17p1 released late last month. Advisories have also been issued by various Linux distributions, since Sudo comes installed on many of them -\nCVE-2025-32462\n-\nAlmaLinux 8\n,\nAlmaLinux 9\n,\nAlpine Linux\n,\nAmazon Linux\n,\nDebian\n,\nGentoo\n,\nOracle Linux\n,\nRed Hat\n,\nSUSE\n, and\nUbuntu\nCVE-2025-32463\n-\nAlpine Linux\n,\nAmazon Linux\n,\nDebian\n,\nGentoo\n,\nRed Hat\n,\nSUSE\n, and\nUbuntu\nUsers are advised to apply the necessary fixes and ensure that the Linux desktop distributions are updated with the latest packages.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Google Ordered to Pay $314M for Misusing Android Users' Cellular Data Without Permission",
        "Link": "https://thehackernews.com/2025/07/google-ordered-to-pay-314m-for-misusing.html",
        "Summary": "Google has been ordered by a court in the U.S. state of California to pay $314 million over charges that it misused Android device users' cellular data when they were idle to passively send information to the company.\nThe verdict marks an end to a legal class-action complaint that was originally filed in August 2019.\nIn their lawsuit, the plaintiffs argued that Google's Android operating system",
        "Date": "2025-07-04",
        "Content": "Google has been ordered by a court in the U.S. state of California to pay $314 million over charges that it misused Android device users' cellular data when they were idle to passively send information to the company.\nThe verdict marks an end to a\nlegal\nclass-action complaint\nthat was originally filed in August 2019.\nIn their lawsuit, the plaintiffs argued that Google's Android operating system leverages users' cellular data to transmit a \"variety of information to Google\" without their permission, even when their devices are kept in an idle state.\n\"Although Google could make it so that these transfers happen only when the phones are connected to Wi-Fi, Google instead designed these transfers so they can also take place over a cellular network,\" they said.\n\"Google's unauthorized use of their cellular data violates California law and requires Google to compensate Plaintiffs for the value of the cellular data that Google uses for its own benefit without their permission.\"\nThe transfers, the plaintiffs argued, occur when Google properties are open and operating in the background, even in situations where a user has closed all Google apps, and their device is dormant, thereby misappropriating users' cellular data allowances.\nIn one instance, the plaintiffs found that a Samsung Galaxy S7 device with the default settings and the standard pre-loaded apps, and connected to a new Google account, sent and received 8.88 MB/day of cellular data, out of which 94% of the communications were between Google and the device.\nThe information exchange happened approximately 389 times within a span of 24 hours. The transferred information mainly consisted of log files containing operating system metrics, network state, and the list of open apps.\n\"Log files are typically not time-sensitive, and transmission of them could easily be delayed until Wi-Fi is available,\" according to court documents.\n\"Google could also program Android to allow users to enable passive transfers only when they are on Wi-Fi connections, but apparently it has chosen not to do so. Instead, Google has chosen to simply take advantage of Plaintiffs' cellular data allowances.\"\nThat's not all. The court complaint also cited another 2018 experiment that found that an Android device that was \"outwardly dormant and stationary\" but had the Chrome web browser app opened and in the background resulted in about 900 passive transfers in 24 hours.\nIn comparison, a stationary and untouched iPhone with the Safari browser open in the background sent \"significantly less information,\" and noted that Apple's operating system gives users greater control when it comes to passive information transfers.\nFollowing a trial that commenced on June 2, 2025, the jury sided with the plaintiffs, stating the tech giant was liable for performing these passive data transfers and causing them to shoulder what they said were \"mandatory and unavoidable burdens [...] for Google's benefit and convenience.\"\nIn a statement to Reuters, Google\nsaid\nit would appeal the decision and contended the data transfers are related to \"services that are critical to the security, performance, and reliability of Android devices.\" The company also pointed out that it discloses the transfers in its terms of use agreement and obtains consent for them.\nThe jury decision comes nearly two months after the company\nagreed\nto pay nearly $1.4 billion to settle two lawsuits in the state of Texas that accused it of tracking users' personal location and maintaining their facial recognition data without consent.\nThe development also follows a statement from Meta that it's appealing a\nEuropean Commission's decision\nin April 2025 that its\npay-or-consent model\nviolates the region's Digital Markets Act (DMA),\nfining it €200 million\n($227 million).\n\"The decision mandates that Meta must offer a less personalized ads service for free, disregarding cost, impact, or effectiveness, and imposes a potentially unviable business model,\" the company\nsaid\n.\n\"This overlooks the commercial reality that, in a market economy, Meta deserves fair compensation for the valuable and innovative services that users choose to use – a principle essential to sustaining innovation and economic growth.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Google's AI video maker Veo 3 is now available via $20 Gemini",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/googles-ai-video-maker-veo-3-is-now-available-via-20-gemini/",
        "Summary": "Google says Veo 3, which is the company's state-of-the-art video generator, is now shipping to everyone using the Gemini app with a $20 subscription. [...]",
        "Date": "2025-07-04",
        "Content": "Google says Veo 3, which is the company's state-of-the-art video generator, is now shipping to everyone using the Gemini app with a $20 subscription.\nPreviously, Veo 3 was only available in the United States via Flow, but you can now try it inside the Gemini app in India, Indonesia, and all of Europe.\nGoogle\nsays\nyou'll get 3 video generations per day and limit resets every 24 hours.\nTo get started, you need to subscribe to the $20 Gemini AI Pro plan.\nOnce done, open the Gemini app or Gemini.google.com, and select video. Then, you need to describe your video, including the story, context, characters, and you can even write your own dialogues.\nGemini will create a video with sound in minutes.\nUnfortunately, as I mentioned, you can only create 3 videos a day, but that might change in the future.\nVeo 3 isn't free, but since it's part of Google Cloud,\nyou can use it for free by subscribing to the $300 trial\noffered by Google.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nGoogle releases Gemini CLI with free Gemini 2.5 Pro\nGoogle rolls out text-to-image model Imagen 4 for free\nGoogle’s upcoming Gemini Kingfall is allegedly a coding beast\nGoogle Chrome to use on-device AI to detect tech support scams\nGoogle rolls out Veo 3 video generator, try it for free using credits"
    },
    {
        "Title": "ChatGPT Deep Research tests new connectors for more context",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-deep-research-tests-new-connectors-for-more-context/",
        "Summary": "ChatGPT Deep Research, which is an AI research tool to automate research, is getting support for new connectors (integrations), including Slack. [...]",
        "Date": "2025-07-04",
        "Content": "ChatGPT Deep Research, which is an AI research tool to automate research, is getting support for new connectors (integrations), including Slack.\nDeep Research is an AI agent that automates research for you. You just need to give it a brief prompt with all the necessary details, and it will crawl the internet to write a research paper.\nAs\nspotted\nby Tibor on X, ChatGPT has references to a new connector called 'Slack.'\nOnce integrated, ChatGPT can crawl your Slack messages and use them in the context of research.\nReferences to Slack as a connector on ChatGPT\nIt's unclear if OpenAI has teamed up with Slack or if the company is relying on Slack APIs, which have several limitations.\nThere might be a few use cases for Slack integration. For example, you can allow ChatGPT to access your organisation's chat and use the message in the context of research.\nOpenAI does not train data on your personal information when the privacy toggle is turned on in the Settings.\nSlack isn't the only new connector coming to ChatGPT. OpenAI also added Canva support to Deep Research.\nIn addition, OpenAI recently started testing connectors support for ChatGPT search, so you could use the\nAI to summarize and search emails\nby connecting Gmail.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nChatGPT's AI coder Codex now lets you choose the best solution\nChatGPT o3 API 80% price drop has no impact on performance\nOpenAI plans to ship an interesting ChatGPT product by 2026\nChatGPT Deep Research can now pull data from Dropbox and Box\nOpenAI plans to combine multiple models into GPT-5"
    },
    {
        "Title": "Ingram Micro suffers global outage as internal systems inaccessible",
        "Link": "https://www.bleepingcomputer.com/news/security/ingram-micro-suffers-global-outage-as-internal-systems-inaccessible/",
        "Summary": "IT giant Ingram Micro is experiencing a global outage that is impacting its websites and internal systems, with customers concerned that it may be a cyberattack after the company remains silent on the cause of the issues. [...]",
        "Date": "2025-07-04",
        "Content": "IT giant Ingram Micro is experiencing a global outage that is impacting its websites and internal systems, with customers concerned that it may be a cyberattack after the company remains silent on the cause of the issues.\nIngram Micro is one of the largest business-to-business technology distributors and service providers in the world, offering hardware, software, cloud, logistics, and training solutions to resellers and managed service providers worldwide.\nThe company employs around 24,000 people and generated approximately $48 billion in revenue in 2024.\nIngram Micro's outage started Thursday morning, with the website going offline and customers unable to place orders.\nBleepingComputer was informed last night that some of Ingram Micro's internal systems are also inaccessible to employees.\nVisiting the ingrammicro.com website now displays either a generic access restricted message from Akamai, a networking vendor used by Ingram Micro, or a maintenance message, shown below.\nMaintenance message shown on Ingram Micro's website\nSource: BleepingComputer\nDo you have information about this or another cyberattack? If you want to share the information, you can contact us securely and confidentially on Signal at LawrenceA.11, via email at lawrence.abrams@bleepingcomputer.com, or by using our\ntips form\n.\nIngram Micro customers\nshared on Reddit\nthat the company is being silent as to what is causing the outage, with employees also left in the dark.\nSome people claimed they were told a cyberattack, potentially ransomware, is behind the outage, but BleepingComputer has not been able to determine if these claims are valid.\nHowever, an extended outage and the shutting down of internal systems are common indicators of a breach of some sort.\nBleepingComputer contacted Ingram Micro about the outage and will update the story if we receive a response.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nMicrosoft investigates ongoing SharePoint Online access issues\nGoogle links massive cloud outage to API management issue\nMicrosoft confirms auth issues affecting Microsoft 365 users\nCloudflare: Outage not caused by security incident, data is safe\nGoogle Cloud and Cloudflare hit by widespread service outages"
    },
    {
        "Title": "Hacker leaks Telefónica data allegedly stolen in a new breach",
        "Link": "https://www.bleepingcomputer.com/news/security/hacker-leaks-telef-nica-data-allegedly-stolen-in-a-new-breach/",
        "Summary": "A hacker is threatening to leak 106GB of data allegedly stolen from Spanish telecommunications company Telefónica in a breach that the company did not acknowledge. [...]",
        "Date": "2025-07-04",
        "Content": "A hacker is threatening to leak 106GB of data allegedly stolen from Spanish telecommunications company Telefónica in a breach that the company did not acknowledge.\nThe threat actor has leaked a 2.6GB archive that unpacks into five gigabytes of data with a little over 20,000 files to prove that the breach occurred.\nPartial leak with data allegedly stolen from Telefónica\n​\nThe breach allegedly occurred on May 30 and the hacker claims they had 12 hours of uninterrupted data exfiltration before defenders revoked access.\nThe hacker claiming responsibility for the attack is known as \"Rey\" and is a member of the Hellcat Ransomware group - responsible for another\nbreach at Telefónica in January\nthrough an internal Jira development and ticketing server.\nRey told BleepingComputer that they exfiltrated 385,311 files totaling 106.3GB of internal communications (e.g. tickets, emails), purchase orders, internal logs, customer records, and employee data.\nThey also said that the May 30 breach was possible because of a Jira misconfiguration after the company dealt with the previous compromise.\nBleepingComputer tried on multiple occasions since June 3rd to reach out to Telefónica over email. We also contacted several C-suite employees but received no acknowledgment of the May 30 breach.\nThe only response we received came from a Telefónica O2 employee, who dismissed the alleged incident as an extortion attempt using outdated information from a previously known incident.\nTelefónica O2 is the Spanish company’s brand for its telecommunications businesses in the U.K. and Germany.\nRey shared with BleepingComputer a sample and file tree of the data allegedly stolen from Telefónica on May 30. Some of the files included invoices to business clients in multiple countries, including Hungary, Germany, Spain, Chile, and Peru.\nIn the files we received there were email addresses for employees in Spain, Germany, Peru, Argentina, and Chile, and invoices for business partners or customers in European countries.\nThe most recent file we could find in all the info Rey shared was from 2021, though, which seems to confirm what the company representative told us.\nHowever, the hacker is adamant about the data coming from a new breach from May 30. To prove their point, they started leaking a part of the allegedly stolen files.\n“Since Telefonica has been denying a recent 106 GB breach containing data from its internal infrastructure, I am releasing 5 GB here as proof. Soon, I will publish the full file tree, and over the next few weeks, if Telefonica does not comply, the entire archive will be released. ;)” - Rey said.\nThreat actor announces Telefónica leak of 106GB\nThe data was initially distributed using the PixelDrain storage and data transfer services but it was removed after a few hours for legal reasons.\nThe threat actor later distributed another download link from Kotizada, a service then turned to another service, Kotizada, which Google Chrome flags as a dangerous site and strongly recommends users to avoid it.\nUntil Telefónica provides an official statement, it is unclear if this is a new breach consisting of old data. However, from BleepingComputer's findings, some of the email addresses in the leak belong to active employees.\nThe HellCat hacking group is not new on the scene and they are typically focused on targeting Jira servers. They are responsible for multiple attacks at high-profile companies.\nThey claimed compromises at Swiss global solutions provider\nAscom\n, Jaguar Land Rover, Affinitiv\nSchneider Electric\n, and\nOrange Group\n.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nPolice dismantles investment fraud ring stealing €10 million\nSpain arrests hackers who targeted politicians and journalists\nJohnson Controls starts notifying people affected by 2023 breach\nEuropol helps disrupt $540 million crypto investment fraud ring\nWhole Foods supplier UNFI restores core systems after cyberattack"
    },
    {
        "Title": "In Other News: Hacker Helps Kill Informants, Crylock Developer Sentenced, Ransomware Negotiator Probed",
        "Link": "https://www.securityweek.com/in-other-news-hacker-helps-kill-informants-crylock-developer-sentenced-ransomware-negotiator-probed/",
        "Summary": "<p>Noteworthy stories that might have slipped under the radar: drug cartel hires hacker to identify FBI informants, prison time for Russian ransomware developer, ransomware negotiator investigated. </p>\n<p>The post <a href=\"https://www.securityweek.com/in-other-news-hacker-helps-kill-informants-crylock-developer-sentenced-ransomware-negotiator-probed/\">In Other News: Hacker Helps Kill Informants, Crylock Developer Sentenced, Ransomware Negotiator Probed</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/in-other-news-hacker-helps-kill-informants-crylock-developer-sentenced-ransomware-negotiator-probed/"
    },
    {
        "Title": "Knight Knox Manchester Property Investment Firm Allegedly Targeted by Qilin Ransomware",
        "Link": "https://dailydarkweb.net/knight-knox-manchester-property-investment-firm-allegedly-targeted-by-qilin-ransomware/",
        "Summary": "The Qilin ransomware group has allegedly claimed responsibility for a significant cyberattack on Knight Knox, a prominent property investment firm headquartered in Manchester. The company, with a 20-year history in the sector, is a key player in the UK property market, specializing in sourcing high-yield investment opportunities for a global client base. Knight Knox&#8217;s role [&#8230;]",
        "Date": "2025-07-04",
        "Content": "The Qilin ransomware group has allegedly claimed responsibility for a significant cyberattack on Knight Knox, a prominent property investment firm headquartered in Manchester. The company, with a 20-year history in the sector, is a key player in the UK property market, specializing in sourcing high-yield investment opportunities for a global client base. Knight Knox’s role as a facilitator of substantial property investments makes the security of its data of paramount importance to its numerous clients and partners.\nThe origin of the attack is allegedly the Qilin ransomware gang, a group known for its sophisticated and financially motivated cybercrimes. In their claim, the group asserts they have exfiltrated a large volume of sensitive information. The alleged breach involves 100.00 GB of data, encompassing some 100,000 files. This incident is another example of the escalating trend of ransomware attacks targeting companies with valuable client and financial data.\nWhile the full scope of the compromised data has not been officially confirmed, based on the nature of Knight Knox’s business, the allegedly leaked files could contain a trove of sensitive information. The data allegedly stolen from the property investment specialist includes:\nFinancial Documents\nClient Information\nProject Details\nCompany and Employee Data\nTags:\nAlleged Attack\nCyberSecurity\ndata-breach\nKnight Knox\nManchester\nproperty investment\nQilin\nransomware"
    },
    {
        "Title": "Ancient Bitcoin Worth Over $2 Billion on the Move After 14 Years of Dormancy",
        "Link": "https://dailydarkweb.net/ancient-bitcoin-worth-over-2-billion-on-the-move-after-14-years-of-dormancy/",
        "Summary": "A significant amount of Bitcoin, mined in the early days of the cryptocurrency&#8217;s existence, has been transferred for the first time in over 14 years, sparking widespread discussion and speculation within the crypto community. Two wallets, which had been inactive since 2011, collectively moved 20,000 BTC, a sum now valued at approximately $2.18 billion. This [&#8230;]",
        "Date": "2025-07-04",
        "Content": "A significant amount of Bitcoin, mined in the early days of the cryptocurrency’s existence, has been transferred for the first time in over 14 years, sparking widespread discussion and speculation within the crypto community. Two wallets, which had been inactive since 2011, collectively moved 20,000 BTC, a sum now valued at approximately $2.18 billion. This substantial movement of “Satoshi-era” coins, a term referring to the period when Bitcoin’s pseudonymous creator Satoshi Nakamoto was still active, has drawn keen interest from market observers.\nThe transactions occurred separately but close together, with each wallet transferring 10,000 BTC to new, previously unused addresses. The identity of the owner or owners of these wallets remains a mystery, as is common in the world of cryptocurrency. The funds’ re-emergence after such a prolonged period of inactivity has led to various theories. These range from an early adopter finally deciding to cash in or redistribute their holdings to a simple security measure of moving the assets to more modern and secure wallet addresses.\nWhile the ultimate intention behind the transfers is unknown, the event highlights the immense returns early Bitcoin investors have experienced. The movement did not cause immediate, drastic price fluctuations, but it serves as a potent reminder of the large, dormant caches of Bitcoin that exist. Such events often fuel debates about potential market impacts should these long-held assets be liquidated. For now, the crypto world watches closely to see if these ancient coins will be moved again or if they will enter another long period of hibernation.\nTags:\nBitcoin\nBlockchain\nBTC\nCrypto Market\ncryptocurrency\nDigital Currency\nSatoshi Era"
    },
    {
        "Title": "VoIP Provider Apntelecom Allegedly Breached by Imncrew Ransomware Group",
        "Link": "https://dailydarkweb.net/voip-provider-apntelecom-allegedly-breached-by-imncrew-ransomware-group/",
        "Summary": "The Imncrew ransomware group has allegedly targeted Asia Pacific Network (Apntelecom), a Texas-based premier provider of VoIP services. Apntelecom is a significant entity in the telecommunications sector, offering Tier-1 carrier services to the US and other continents. With a major facility in Los Angeles and offices in the Philippines, the company plays a crucial role [&#8230;]",
        "Date": "2025-07-04",
        "Content": "The Imncrew ransomware group has allegedly targeted Asia Pacific Network (Apntelecom), a Texas-based premier provider of VoIP services. Apntelecom is a significant entity in the telecommunications sector, offering Tier-1 carrier services to the US and other continents. With a major facility in Los Angeles and offices in the Philippines, the company plays a crucial role in supporting the global call center industry, making this alleged breach particularly noteworthy.\nFollowing the initial claim, the ransomware operators have now purportedly published data allegedly stolen from the company’s network on their leak site. The publication of data, marked by a “Time’s up!” message, suggests that any negotiations for a ransom payment have failed or were not initiated. The attackers have made the data available for download, posing a significant risk to the company and its clients.\nThe leaked data allegedly includes a total of 167 GB of internal data.\nTags:\nApntelecom\ncyber-attack\nCyberSecurity\ndata-breach\nImncrew\nransomware\nVoIP"
    },
    {
        "Title": "Allianz Seguros Spain Allegedly Breached – Database of 4.6 Million Offered for Sale",
        "Link": "https://dailydarkweb.net/allianz-seguros-spain-allegedly-breached-database-of-4-6-million-offered-for-sale/",
        "Summary": "A threat actor has allegedly put a database containing 4.6 million rows of data belonging to Allianz Seguros, the Spanish division of the global insurance giant Allianz, up for sale. The post, which appeared on a cybercrime forum, claims the data was breached on June 19, 2025. Allianz is a major player in the global [&#8230;]",
        "Date": "2025-07-04",
        "Content": "A threat actor has allegedly put a database containing 4.6 million rows of data belonging to Allianz Seguros, the Spanish division of the global insurance giant Allianz, up for sale. The post, which appeared on a cybercrime forum, claims the data was breached on June 19, 2025. Allianz is a major player in the global insurance and asset management industry, and its Spanish branch, Allianz Seguros, is one of the leading insurance companies in the country, providing services to millions of customers. A breach of this magnitude could have significant consequences for the individuals whose information has been compromised.\nThe seller is asking for €20,000 in cryptocurrency for the database and has provided a list of data headers to prove the authenticity of the leak. The exposure of such sensitive personal and policy information places the alleged victims at high risk for sophisticated phishing attacks, identity theft, and other fraudulent activities. The data allegedly for sale includes a wide range of personally identifiable information (PII).\nThe compromised data allegedly includes:\nPolicy ID and number\nTax Identification Number (NIF)\nFull name\nFull address and postal code\nPhone numbers\nTags:\nallegedly\nAllianz\ncyberattack\ndata-breach\nInsurance\nPII\nSpain"
    },
    {
        "Title": "Nifloat Hatzuna Ltd. and Vynopsis Allegedly Breached by Handala Hack Team",
        "Link": "https://dailydarkweb.net/nifloat-hatzuna-ltd-and-vynopsis-allegedly-breached-by-handala-hack-team/",
        "Summary": "The hacktivist group known as Handala Hack Team has allegedly claimed responsibility for cyberattacks on two Israeli companies, Nifloat Hatzuna Ltd. and Vynopsis, leading to a significant data breach. Nifloat Hatzuna Ltd. is a catering and logistics contractor reportedly responsible for providing food services to sensitive locations, including government buildings and detention centers. The compromise [&#8230;]",
        "Date": "2025-07-04",
        "Content": "The hacktivist group known as Handala Hack Team has allegedly claimed responsibility for cyberattacks on two Israeli companies, Nifloat Hatzuna Ltd. and Vynopsis, leading to a significant data breach. Nifloat Hatzuna Ltd. is a catering and logistics contractor reportedly responsible for providing food services to sensitive locations, including government buildings and detention centers. The compromise of such an entity raises serious security concerns due to the nature of its clientele and the access it may have.\nIn a separate attack, the group also allegedly targeted Vynopsis, a prominent company that specializes in creating automated financial news videos for brokers and investors. Vynopsis is a key player in the financial technology sector, providing white-label video solutions that are built on algorithms and trust. The breach of their systems could undermine confidence among their partners and users who rely on them for timely and secure financial market updates. The attackers claim to have exfiltrated hundreds of gigabytes of data from the two companies.\nThe group has allegedly leaked a substantial amount of data from both entities. The information purportedly stolen from Nifloat Hatzuna Ltd. includes:\nProcurement orders\nDelivery logs\nStaff lists\nInvoices\nKitchen schedules\nFrom Vynopsis, the data allegedly exposed includes:\nSource Code\nUser templates\nInvestor summaries\nCustom branding files\nInternal tech logs\nTags:\nCyberSecurity\ndata-breach\ndata-leak\nHandala\nIsrael\nNifloat Hatzuna Ltd\nVynopsis"
    },
    {
        "Title": "Sensitive Strategic Data of Schrödinger GmbH Allegedly Offered for Sale Online",
        "Link": "https://dailydarkweb.net/sensitive-strategic-data-of-schrodinger-gmbh-allegedly-offered-for-sale-online/",
        "Summary": "Internal records from Schrödinger GmbH, the German arm of the computational chemistry software giant Schrödinger, Inc., have allegedly been put up for sale by a threat actor. As a key technology partner for major pharmaceutical and biotech companies, the firm handles sensitive information. The alleged sale involves approximately 9GB of the company&#8217;s internal financial and [&#8230;]",
        "Date": "2025-07-04",
        "Content": "Internal records from Schrödinger GmbH, the German arm of the computational chemistry software giant Schrödinger, Inc., have allegedly been put up for sale by a threat actor. As a key technology partner for major pharmaceutical and biotech companies, the firm handles sensitive information. The alleged sale involves approximately 9GB of the company’s internal financial and operational data, reportedly spanning a period from 2018 to 2025, which has been advertised on a data leak forum.\nThe seller claims the extensive dataset contains highly strategic and sensitive information. The compromised information allegedly includes thousands of detailed financial invoices from a variety of suppliers, employee expense reports containing personal details, and account reconciliation documents with banking information. The leak purportedly provides deep insights into the company’s multinational operations, marketing expenditures, and strategic collaborations with pharmaceutical giants.\nAmong the data allegedly for sale are:\nFinancial Invoices from suppliers like Amazon Business and Merck KGaA.\nEmployee Expense Reports with names, personnel numbers, and travel details.\nAccount Reconciliation and SEPA payment reports with IBAN and BIC details.\nLegal Contracts and strategic collaboration documents.\nMultinational Operational and Logistics Data.\nTags:\nCyberSecurity\ndata for sale\nSchrödinger\nsensitive-data\nvendor risk"
    },
    {
        "Title": "Major Italian Financial Services Firm doValue Allegedly Breached – 16TB of Data Advertised",
        "Link": "https://dailydarkweb.net/major-italian-financial-services-firm-dovalue-allegedly-breached-16tb-of-data-advertised/",
        "Summary": "A threat actor has allegedly infiltrated the network of doValue, a leading Italian financial services company, and is claiming to have exfiltrated over 16 terabytes of sensitive data. The massive data cache, which allegedly includes information from doValue and its numerous subsidiaries across Southern Europe, was advertised for sale on a cybercrime forum. The perpetrator [&#8230;]",
        "Date": "2025-07-04",
        "Content": "A threat actor has allegedly infiltrated the network of doValue, a leading Italian financial services company, and is claiming to have exfiltrated over 16 terabytes of sensitive data. The massive data cache, which allegedly includes information from doValue and its numerous subsidiaries across Southern Europe, was advertised for sale on a cybercrime forum. The perpetrator claims the data was sourced from the company’s entire Active Directory network, encompassing both database and file servers, suggesting a deep and widespread compromise of the firm’s digital infrastructure.\ndoValue is a major player in the European financial sector, specializing in the management of credit and real estate assets for banks and investors, with a primary focus on non-performing loans (NPLs). Headquartered in Italy, the Group operates in Spain, Portugal, Greece, and Cyprus, managing billions of euros in assets. The critical nature of its business means the company handles vast amounts of sensitive financial and personal data, making it a high-value target for cybercriminals. The alleged breach affects not only the parent company but also key subsidiaries including Italfondiario, doBank, doNext, and Altamira, amplifying the potential impact across multiple regions.\nAccording to the threat actor’s post, the stolen data is extensive, and they have provided file tree listings from the compromised domains as a form of proof. The allegedly impacted internal domains include:\naltamira.local\ndobank.italfondiario.com\ndovalue.it\ndovaluegroup.local\nIBIS.italfondiario.com\nitalfondiario.com\nTags:\nAlleged Attack\ncyberattack\nCyberSecurity\ndata-breach\ndata-leak\ndoValue\nFinancial Services\nItaly"
    }
]