[
    {
        "Title": "Hackers Use Facebook Ads to Spread JSCEAL Malware via Fake Cryptocurrency Trading Apps",
        "Link": "https://thehackernews.com/2025/07/hackers-use-facebook-ads-to-spread.html",
        "Summary": "Cybersecurity researchers are calling attention to an ongoing campaign that distributes fake cryptocurrency trading apps to deploy a compiled V8 JavaScript (JSC) malware called JSCEAL that can capture data from credentials and wallets.\nThe activity leverages thousands of malicious advertisements posted on Facebook in an attempt to redirect unsuspecting victims to counterfeit sites that instruct",
        "Date": "2025-07-30",
        "Content": "Cybersecurity researchers are calling attention to an ongoing campaign that distributes fake cryptocurrency trading apps to deploy a compiled V8 JavaScript (JSC) malware called\nJSCEAL\nthat can capture data from credentials and wallets.\nThe activity leverages thousands of malicious advertisements posted on Facebook in an attempt to redirect unsuspecting victims to counterfeit sites that instruct them to install the bogus apps, according to Check Point. These ads are shared either via stolen accounts or newly created ones.\n\"The actors separate the installer's functionality into different components and most notably move some functionality to the JavaScript files inside the infected websites,\" the company\nsaid\nin an analysis. \"A modular, multi-layered infection flow enables the attackers to adapt new tactics and payloads at every stage of the operation.\"\nIt's worth noting that some aspects of the activity were previously documented by\nMicrosoft in April 2025\nand WithSecure as recently as this month, with the latter tracking it as\nWEEVILPROXY\n. According to the Finnish security vendor, the campaign has been active since March 2024.\nThe attack chains have been found to adopt novel anti-analysis mechanisms that rely on script-based fingerprinting, before delivering the final JSC payload.\n\"The threat actors implemented a unique mechanism that requires both the malicious site and the installer to run in parallel for successful execution, which significantly complicates analysis and detection efforts,\" the Israeli cybersecurity company noted.\nClicking on the link in the Facebook ads triggers a redirection chain, ultimately leading the victim to a fake landing page mimicking a legitimate service like TradingView or a decoy website, if the target's IP address is not within a desired range or the referrer is not Facebook.\nThe website also includes a JavaScript file that attempts to communicate with a localhost server on port 30303, in addition to hosting two other JavaScript scripts that are responsible for tracking the installation process and initiating POST requests that are handled by the components within the MSI installer.\nFor its part, the installer file downloaded from the site unpacks a number of DLL libraries, while simultaneously initiating HTTP listeners on localhost:30303 to process incoming POST requests from the phony site. This interdependency also means that the infection chain fails to proceed further if any of these components doesn't work.\n\"To ensure the victim does not suspect abnormal activity, the installer opens a webview using msedge_proxy.exe to direct the victim to the legitimate website of the application,\" Check Point said.\nThe DLL modules are designed to parse the POST requests from the website and gather system information and commence the fingerprinting process, after which the captured information is exfiltrated to the attacker in the form of a JSON file by means of a PowerShell backdoor.\nIf the victim host is deemed valuable, the infection chain moves to the final stage, leading to the execution of the JSCEAL malware by leveraging Node.js.\nThe malware, besides establishing connections with a remote server to receive further instructions, sets up a local proxy with the goal of intercepting the victim's web traffic and injecting malicious scripts into banking, cryptocurrency, and other sensitive websites to steal their credentials in real-time.\nOther functions of JSCEAL include gathering system information, browser cookies, auto-fill passwords, Telegram account data, screenshots, keystrokes, as well as conducting adversary-in-the-middle (AitM) attacks and manipulating cryptocurrency wallets. It can also act as a remote access trojan.\n\"This sophisticated piece of malware is designed to gain absolute control of the victim machine, while being resilient against conventional security tools,\" Check Point said. \"The combination of compiled code and heavy obfuscation, while displaying a wide variety of functionality, made analysis efforts challenging and time-consuming.\"\n\"Using JSC files allows attackers to simply and effectively conceal their code, helping it evade security mechanisms, and making it difficult to analyze.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "FunkSec Ransomware Decryptor Released Free to Public After Group Goes Dormant",
        "Link": "https://thehackernews.com/2025/07/funksec-ransomware-decryptor-released.html",
        "Summary": "Cybersecurity experts have released a decryptor for a ransomware strain called FunkSec, allowing victims to recover access to their files for free.\n\"Because the ransomware is now considered dead, we released the decryptor for public download,\" Gen Digital researcher Ladislav Zezula said.\nFunkSec, which emerged towards the end of 2024, has claimed 172 victims, according to data from",
        "Date": "2025-07-30",
        "Content": "Cybersecurity experts have released a decryptor for a ransomware strain called FunkSec, allowing victims to recover access to their files for free.\n\"Because the ransomware is now considered dead, we released the decryptor for public download,\" Gen Digital researcher Ladislav Zezula\nsaid\n.\nFunkSec\n, which emerged towards the end of 2024, has\nclaimed 172 victims\n, according to data from Ransomware.live. The vast majority of targeted entities are located in the U.S., India, and Brazil, with technology, government, and education being the top three sectors attacked by the group.\nAn analysis of FunkSec by Check Point earlier this January\nfound\nsigns that the encryptor was developed with assistance from artificial intelligence (AI) tools. The group has not added any new victims to its data leak site since March 18, 2025, suggesting that the group may no longer be active.\nIt's also believed that the group consisted of inexperienced hackers seeking visibility and recognition by uploading leaked datasets associated with previous hacktivism campaigns.\nFunkSec was built using Rust, a fast and efficient programming language that's now popular among newer ransomware groups. Other families, like BlackCat and Agenda, also use Rust to help their attacks run quickly and avoid detection. FunkSec relies on the orion-rs library (version 0.17.7) for encryption, using the Chacha20 and Poly1305 algorithms to lock files during its routine.\n\"This hash-based method ensures integrity of encryption parameters: the encryption key, n-once, block lengths, and encrypted data itself,\" Zezula noted. \"Files are encrypted per-blocks of 128 bytes, adding 48 bytes of extra metadata to each block, which means that encrypted files are about 37% bigger than the originals.\"\nGen Digital did not disclose how it was able to develop a decryptor and if it entailed the exploitation of a cryptographic weakness that makes it possible to reverse the encryption process. The decryptor can be\naccessed\nvia the No More Ransom project.\nVictims looking to recover their data should first confirm that encrypted files match FunkSec's signature, typically identified by the .funksec extension or unique metadata padding. The No More Ransom portal provides basic usage steps, but administrators are advised to back up affected files before attempting decryption in case of partial recovery or file corruption.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Product Walkthrough: A Look Inside Pillar's AI Security Platform",
        "Link": "https://thehackernews.com/2025/07/product-walkthrough-look-inside-pillars.html",
        "Summary": "In this article, we will provide a brief overview of Pillar Security's platform to better understand how they are tackling AI security challenges. \nPillar Security is building a platform to cover the entire software development and deployment lifecycle with the goal of providing trust in AI systems. Using its holistic approach, the platform introduces new ways of detecting AI threats, beginning",
        "Date": "2025-07-30",
        "Content": "In this article, we will provide a brief overview of\nPillar Security's platform\nto better understand how they are tackling AI security challenges.\nPillar Security is building a platform to cover the entire software development and deployment lifecycle with the goal of providing trust in AI systems. Using its holistic approach, the platform introduces new ways of detecting AI threats, beginning at pre-planning stages and going all the way through runtime. Along the way, users gain visibility into the security posture of their applications while enabling safe AI execution.\nPillar is uniquely suited to the challenges inherent in AI security. Co-founder and CEO Dor Sarig comes from a cyber-offensive background, having spent a decade leading security operations for governmental and enterprise organizations. In contrast, co-founder and CTO Ziv Karlinger spent over ten years developing defensive techniques, securing against financial cybercrime and securing supply chains. Together, their red team-blue team approach forms the foundation of Pillar Security and is instrumental in mitigating threats.\nThe Philosophy Behind the Approach\nBefore diving into the platform, it's important to understand the underlying approach taken by Pillar. Rather than developing a siloed system where each piece of the platform focuses on a single area, Pillar offers a holistic approach. Each component within the platform enriches the next, creating a closed feedback loop that enables security to adapt to each unique use case.\nThe detections found in the posture management section of the platform are enriched by data detected in the discovery section. Likewise, adaptive guardrails that are utilized during runtime are built on insights from threat modeling and red teaming. This dynamic feedback loop ensures that live defenses are optimized as new vulnerabilities are discovered. This approach creates a powerful, holistic and contextual-based defense against threats to AI systems - from build to runtime.\nAI Workbench: Threat Modeling Where AI Begins\nThe Pillar Security platform begins at what they call the AI workbench. Before any code is written, this secure playground for threat modeling allows security teams to experiment with AI use cases and proactively map potential threats. This stage is crucial to ensure that organizations align their AI systems with corporate policies and regulatory demands.\nDevelopers and security teams are guided through a structured threat modeling process, generating potential attack scenarios specific to the application use case. Risks are aligned with the application's business context, and the process is aligned with established frameworks such as STRIDE, ISO, MITRE ATLAS, OWASP Top Ten for LLMs, and\nPillar's own SAIL framework\n. The goal is to build security and trust into the design from day one.\nAI Discovery: Real-Time Visibility into AI Assets\nAI sprawl\nis a complex challenge for security and governance teams. They lack visibility into how and where AI is being used within their development and production environments.\nPillar takes a unique approach to AI security that goes beyond the CI/CD pipeline and the traditional SDLC. By integrating directly with code repositories, data platforms, AI/ML frameworks, IdPs and local environments, it can automatically find and catalog every AI asset within the organization. The platform displays a full inventory of AI apps, including models, tools, datasets, MCP servers, coding agents, meta prompts, and more. This visibility guides teams, helping form the foundation of the organizational security policy and enabling a clear understanding of the business use case, including what the application does and how the organization uses it.\nFigure 1: Pillar Security automatically discovers all AI assets across the organization and flags unmonitored components to prevent security blind spots.\nAI-SPM: Mapping and Managing AI Risk\nAfter identifying all AI assets, Pillar is able to understand the security posture by analyzing each of the assets. During this stage, the platform's AI Security Posture Management (AI-SPM) conducts a robust static and dynamic analysis of all AI assets and their interconnections.\nBy analyzing the AI assets, Pillar creates visual representations of the identified Agentic systems, their components and their associated attack surfaces. Furthermore, it identifies supply chain, data poisoning and model/prompt/tool level risks. These insights, which appear within the platform, enable teams to prioritize threats, as it show exactly how a threat actor may move through the system.\nFigure 2: Pillar's Policy Center provides a centralized dashboard for monitoring enterprise-wide AI compliance posture\nAI Red Teaming: Simulating Attacks Before They Happen\nRather than waiting until the application is fully built, Pillar promotes a trust-by-design approach, enabling AI teams to test as they build.\nThe platform runs simulated attacks that are tailored to the AI system use case, by leveraging common techniques like prompt injections and jailbreaking to sophisticated attacks targeting business logic vulnerabilities. These Red Team activities help identify whether an AI agent can be manipulated into giving unauthorized refunds, leaking sensitive data, or executing unintended tool actions. This process not only evaluates the model, but also the broader agentic application and its integration with external tools and APIs.\nPillar also offers a unique capability through red teaming for tool use. The platform integrates threat modeling with dynamic tool activation, rigorously testing how chained tool and API calls might be weaponized in realistic attack scenarios. This advanced approach reveals vulnerabilities that traditional prompt-based testing methods are unable to detect.\nFor enterprises using third-party and embedded AI apps, such as copilots, or custom chatbots where they don't have access to the underlying code, Pillar offers black-box, target-based red teaming. With just a URL and credentials, Pillar's adversarial agents can stress-test any accessible AI application whether internal or external. These agents simulate real-world attacks to probe data boundaries and uncover exposure risks, enabling organizations to confidently assess and secure third-party AI systems without needing to integrate or customize them.\nFigure 3: Pillar's tailored red teaming tests real-world attack scenarios against an AI application's specific use case and business logic\nGuardrails: Runtime Policy Enforcement That Learns\nAs AI applications move into production, real-time security controls become essential. Pillar addresses this need with a system of adaptive guardrails that monitor inputs and outputs during runtime, designed to enforce security policies without interrupting application performance.\nUnlike static rule sets or traditional firewalls, these guardrails are model agnostic, application-centric and continuously evolve. According to Pillar, they draw on telemetry data, insights gathered during red teaming, and threat intelligence feeds to adapt in real time to emerging attack techniques. This allows the platform to adjust its enforcement based on each application's business logic and behavior, and be highly precise with alerts.\nDuring the walkthrough, we saw how guardrails can be finely tuned to prevent misuse, such as data exfiltration or unintended actions, while preserving the AI's intended behavior. Organizations can enforce their AI policy and custom code-of-conduct rules across applications with confidence that security and functionality will coexist.\nFigure 4: Pillar's adaptive guardrails monitor runtime activity to detect and flag malicious use and policy violations\nSandbox: Containing Agentic Risk\nOne of the most critical concerns is excessive agency. When agents can perform actions beyond their intended scopes, it can lead to unintended consequences.\nPillar addresses this during the Operate phase through secure sandboxing. AI agents, including advanced systems like coding agents and MCP servers, run inside tightly controlled environments. These isolated runtimes apply zero-trust principles to separate agents from critical infrastructure and sensitive data, while still enabling them to operate productively. Any unexpected or malicious behavior is contained without impacting the larger system. Every action is captured and logged in detail, giving teams a granular forensic trail that can be analyzed after the fact. With this containment strategy, organizations can safely give AI agents the room they need to operate.\nAI Telemetry: Observability from Prompt to Action\nSecurity doesn't stop once the application is live. Throughout the lifecycle, Pillar continuously collects telemetry data across the entire AI stack. Prompts, agent actions, tool calls, and contextual metadata are all logged in real time.\nThis telemetry powers deep investigations and compliance tracking. Security teams can trace incidents from symptom to root cause, understand anomalous behavior, and ensure AI systems are operating within policy boundaries. It's not enough to know what happened. It's about understanding why something took place and how to prevent it from happening again.\nDue to the sensitivity of the telemetry data, Pillar can be deployed on the customer cloud for full data control.\nFinal Thoughts\nPillar stands apart through a combination of technical depth, real-world insight, and enterprise-grade flexibility.\nFounded by leaders in both offensive and defensive cybersecurity, the team has a proven track record of pioneering research that has uncovered critical vulnerabilities and produced detailed real-world attack reports. This expertise is embedded into the platform at every level.\nPillar also takes a holistic approach to AI security that extends beyond the CI/CD pipeline. By integrating security into the planning and coding phases and connecting directly to code repositories, data platforms and local environments, Pillar gains early and deep visibility into the systems being built. This context enables more precise risk analysis and highly targeted red team testing as development progresses.\nThe platform is powered by the industry's largest AI threat intelligence feed, enriched by over 10 million real-world interactions. This threat data fuels automated testing, risk modeling, and adaptive defenses that evolve with the threat landscape.\nFinally, Pillar is built for flexible deployment. It can run on premises, in hybrid environments, or fully in the cloud, giving customers full control over sensitive data, prompts, and proprietary models. This is a critical advantage for regulated industries where data residency and security are paramount.\nTogether, these capabilities make Pillar a powerful and practical foundation for secure AI adoption at scale, helping innovative organizations manage AI-specific risks and gain trust in their AI systems.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Apple Patches Safari Vulnerability Also Exploited as Zero-Day in Google Chrome",
        "Link": "https://thehackernews.com/2025/07/apple-patches-safari-vulnerability-also.html",
        "Summary": "Apple on Tuesday released security updates for its entire software portfolio, including a fix for a vulnerability that Google said was exploited as a zero-day in the Chrome web browser earlier this month.\nThe vulnerability, tracked as CVE-2025-6558 (CVSS score: 8.8), is an incorrect validation of untrusted input in the browser's ANGLE and GPU components that could result in a sandbox escape via",
        "Date": "2025-07-30",
        "Content": "Apple on Tuesday\nreleased\nsecurity updates for its entire software portfolio, including a fix for a vulnerability that Google said was exploited as a zero-day in the Chrome web browser earlier this month.\nThe vulnerability, tracked as\nCVE-2025-6558\n(CVSS score: 8.8), is an incorrect validation of untrusted input in the browser's ANGLE and GPU components that could result in a sandbox escape via a crafted HTML page.\nWhile there are no details on how the issue has been weaponized by threat actors, Google acknowledged that an \"exploit for CVE-2025-6558 exists in the wild.\" Clément Lecigne and Vlad Stolyarov of Google's Threat Analysis Group (TAG) have been credited with discovering and reporting the shortcoming.\nThe iPhone maker, in its latest round of software updates, also included patches for CVE-2025-6558, stating the vulnerability impacts the WebKit browser engine that powers its Safari browser.\n\"This is a vulnerability in open-source code and Apple Software is among the affected projects,\" the company said in an advisory, adding it could be exploited to result in an unexpected crash of Safari when processing maliciously crafted web content.\nThe bug has been addressed in the following versions -\niOS 18.6 and iPadOS 18.6\n- iPhone XS and later, iPad Pro 13-inch, iPad Pro 12.9-inch 3rd generation and later, iPad Pro 11-inch 1st generation and later, iPad Air 3rd generation and later, iPad 7th generation and later, and iPad mini 5th generation and later\niPadOS 17.7.9\n- iPad Pro 12.9-inch 2nd generation, iPad Pro 10.5-inch, and iPad 6th generation\nmacOS Sequoia 15.6\n- Macs running macOS Sequoia\ntvOS 18.6\n- Apple TV HD and Apple TV 4K (all models)\nwatchOS 11.6\n- Apple Watch Series 6 and later\nvisionOS 2.6\n- Apple Vision Pro\nWhile there is no evidence that the vulnerability has been used to target Apple device users, it's always a good practice to update to the latest versions of the software for optimal protection.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Critical Dahua Camera Flaws Enable Remote Hijack via ONVIF and File Upload Exploits",
        "Link": "https://thehackernews.com/2025/07/critical-dahua-camera-flaws-enable.html",
        "Summary": "Cybersecurity researchers have disclosed now-patched critical security flaws in the firmware of Dahua smart cameras that, if left unaddressed, could allow attackers to hijack control of susceptible devices.\n\"The flaws, affecting the device's ONVIF protocol and file upload handlers, allow unauthenticated attackers to execute arbitrary commands remotely, effectively taking over the device,\"",
        "Date": "2025-07-30",
        "Content": "Cybersecurity researchers have disclosed now-patched critical security flaws in the firmware of Dahua smart cameras that, if left unaddressed, could allow attackers to hijack control of susceptible devices.\n\"The flaws, affecting the device's\nONVIF protocol\nand file upload handlers, allow unauthenticated attackers to execute arbitrary commands remotely, effectively taking over the device,\" Bitdefender\nsaid\nin a report shared with The Hacker News.\nThe vulnerabilities, tracked as\nCVE-2025-31700\nand\nCVE-2025-31701\n(CVSS scores: 8.1), affect the following devices running versions with built timestamps before April 16, 2025 -\nIPC-1XXX Series\nIPC-2XXX Series\nIPC-WX Series\nIPC-ECXX Series\nSD3A Series\nSD2A Series\nSD3D Series\nSDT2A Series\nSD2C Series\nIt's worth noting that users can view the build time by logging in to the web interface of the device and then navigating to\nSettings -> System Information -> Version\n.\nBoth shortcomings are classified as buffer overflow vulnerabilities that could be exploited by sending specially crafted malicious packets, resulting in denial-of-service or remote code execution (RCE).\nSpecifically, CVE-2025-31700 has been described as a stack-based buffer overflow in the Open Network Video Interface Forum (ONVIF) request handler, while CVE-2025-31701 concerns an overflow bug in the RPC file upload handler.\n\"Some devices may have deployed protection mechanisms such as Address Space Layout Randomization (ASLR), which reduces the likelihood of successful RCE exploitation,\" Dahua\nsaid\nin an alert released last week. \"However, denial-of-service (DoS) attacks remain a concern.\"\nGiven that these models are used for video surveillance in retail, casinos, warehouses, and residential settings, the flaws can have significant consequences as they are unauthenticated and exploitable over the local network.\n\"Devices exposed to the internet through port forwarding or UPnP are especially at risk,\" the Romanian cybersecurity company said. \"Successful exploitation provides root-level access to the camera with no user interaction. Because the exploit path bypasses firmware integrity checks, attackers can load unsigned payloads or persist via custom daemons, making cleanup difficult.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Chinese Firms Linked to Silk Typhoon Filed 15+ Patents for Cyber Espionage Tools",
        "Link": "https://thehackernews.com/2025/07/chinese-firms-linked-to-silk-typhoon.html",
        "Summary": "Chinese companies linked to the state-sponsored hacking group known as Silk Typhoon (aka Hafnium) have been identified as behind over a dozen technology patents, shedding light on the shadowy cyber contracting ecosystem and its offensive capabilities.\nThe patents cover forensics and intrusion tools that enable encrypted endpoint data collection, Apple device forensics, and remote access to",
        "Date": "2025-07-30",
        "Content": "Chinese companies linked to the state-sponsored hacking group known as\nSilk Typhoon\n(aka Hafnium) have been identified as behind over a dozen technology patents, shedding light on the shadowy cyber contracting ecosystem and its offensive capabilities.\nThe patents cover forensics and intrusion tools that enable encrypted endpoint data collection, Apple device forensics, and remote access to routers and smart home devices, SentinelOne said in a new report shared with The Hacker News.\n\"This new insight into the Hafnium-affiliated firms' capabilities highlights an important deficiency in the threat actor attribution space: threat actor tracking typically links campaigns and clusters of activity to a named actor,\" Dakota Cary, China-focused strategic advisor for SentinelLabs,\nsaid\n.\n\"Our research demonstrates the strength in identifying not only the individuals behind attacks, but the companies they work for, the capabilities those companies have, and how those capabilities fortify the initiatives of the state entities who contract with these firms.\"\nThe findings build upon the U.S. Department of Justice's (DoJ)\nJuly 2025 indictment\nof Xu Zewei and Zhang Yu, who, working on behalf of China's Ministry of State Security (MSS), are accused of orchestrating the\nwidespread exploitation campaign\nin 2021 aimed at Microsoft Exchange Server using then-zero-days dubbed ProxyLogon.\nCourt documents alleged that Zewei worked for a company named Shanghai Powerock Network Co. Ltd., while Yu was employed at Shanghai Firetech Information Science and Technology Company, Ltd. Both individuals are said to have operated under the discretion of the Shanghai State Security Bureau (SSSB).\nInterestingly, Natto Thoughts reported that Powerock deregistered its business on April 7, 2021, a little over a month after Microsoft pointed fingers at China for the zero-day exploitation activity. Zewei would then go on to\njoin\nChaitin Tech, another prominent cybersecurity firm, only to change jobs again and begin working as an IT manager at Shanghai GTA Semiconductor Ltd.\nIt's worth mentioning here at this stage that Yin Kecheng, a hacker tied to Silk Typhoon, is said to have been employed at a third Chinese firm named Shanghai Heiying Information Technology Company, Limited, which was established by Zhou Shuai, a Chinese patriotic hacker and purported data broker.\n\"Shanghai Firetech worked on specific tasking handed down from MSS officers,\" Cary explained. \"Shanghai Firetech and co-conspirators earned an on-going, trusting relationship with the MSS's premier regional office, the SSSB.\"\n\"This 'directed' nature of the relationship between the SSSB and these two companies contours the tiered system of offensive hacking outfits in China.\"\nFurther investigation into the web of connections between the individuals and their companies has\nuncovered patents\nfiled by Shanghai Firetech and Shanghai Siling Commerce Consulting Center, a firm jointly founded by Yu and Yin Wenji, CEO of Shanghai Firetech to collect \"evidence\" from Apple devices, routers, and defensive equipment.\nThere is also evidence to suggest that Shanghai Firetech is also engaged in developing solutions that could enable close access operations against individuals of interest.\n\"The variety of tools under the control of Shanghai Firetech exceeds those attributed to Hafnium and Silk Typhoon publicly,\" Cary said. \"The capabilities may have been sold to other regional MSS offices, and thus not attributed to Hafnium, despite being owned by the same corporate structure.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Google Launches DBSC Open Beta in Chrome and Enhances Patch Transparency via Project Zero",
        "Link": "https://thehackernews.com/2025/07/google-launches-dbsc-open-beta-in.html",
        "Summary": "Google has announced that it's making a security feature called Device Bound Session Credentials (DBSC) in open beta to ensure that users are safeguarded against session cookie theft attacks.\nDBSC, first introduced as a prototype in April 2024, is designed to bind authentication sessions to a device so as to prevent threat actors from using stolen cookies to sign-in to victims' accounts and gain",
        "Date": "2025-07-30",
        "Content": "Google has announced that it's making a security feature called\nDevice Bound Session Credentials (DBSC)\nin open beta to ensure that users are safeguarded against session cookie theft attacks.\nDBSC, first\nintroduced\nas a prototype in April 2024, is designed to bind authentication sessions to a device so as to prevent threat actors from using stolen cookies to sign-in to victims' accounts and gain unauthorized access from a separate device under their control.\n\"Available in the Chrome browser on Windows, DBSC strengthens security after you are logged in and helps bind a session cookie – small files used by websites to remember user information – to the device a user authenticated from,\" Andy Wen, senior director of product management at Google Workspace,\nsaid\n.\nDBSC is not only meant to secure user accounts post-authentication. It makes it a lot more difficult for bad actors to reuse session cookies and improves session integrity.\nThe company also noted that\npasskey support\nis now generally available to more than 11 million Google Workspace customers, along with expanded admin controls to audit enrollment and restrict passkeys to physical security keys.\nLastly, Google intends to roll out a shared signals framework (\nSSF\n) receiver in closed beta for select customers in order to enable the exchange of crucial security signals in near real-time using the OpenID standard.\n\"This framework acts as a robust system for 'transmitters' to promptly inform 'receivers' about significant events, facilitating a coordinated response to security threats,\" Wen said.\n\"Beyond threat detection and response, signal sharing also allows for the general sharing of different properties, such as device or user information, further enhancing the overall security posture and collaborative defense mechanisms.\"\nGoogle Project Zero Unveils Reporting Transparency\nThe development comes as Google Project Zero, a security team within the company that's tasked with hunting zero-day vulnerabilities, announced a new trial policy called Reporting Transparency to address what has been described as an upstream patch gap.\nWhile patch gap typically refers to the time period between when a fix is released for a vulnerability and a user installs the appropriate update, upstream patch gap denotes the timespan where an upstream vendor has a fix available but downstream customers are yet to integrate the patch and ship it to end users.\nTo close this upstream patch app, Google said it's adding a new step where it intends to publicly share the discovery of a vulnerability within a week of reporting it to the relevant vendor.\nThis information is expected to include the vendor or open-source project that received the report, the affected product, the date the report was filed, and when the 90-day disclosure deadline expires. The\ncurrent list\nincludes two Microsoft Windows bugs, one flaw in Dolby Unified Decoder, and three issues in Google BigWave.\n\"The primary goal of this trial is to shrink the upstream patch gap by increasing transparency,\" Project Zero's Tim Willis\nsaid\n. \"By providing an early signal that a vulnerability has been reported upstream, we can better inform downstream dependents. For our small set of issues, they will have an additional source of information to monitor for issues that may affect their users.\"\nGoogle further said it plans to apply this principle to\nBig Sleep\n, an artificial intelligence (AI) agent that was launched last year as part of a collaboration between DeepMind and Google Project Zero to augment vulnerability discovery.\nThe search behemoth also stressed that no technical details, proof-of-concept code, or any other information that could \"materially assist\" bad actors will be released until the deadline.\nWith the latest approach, Google Project Zero said it hopes to move the needle on releasing patches to the devices, systems, and services relied on by end users in a timely fashion and bolster the overall security ecosystem.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Hackers Exploit SAP Vulnerability to Breach Linux Systems and Deploy Auto-Color Malware",
        "Link": "https://thehackernews.com/2025/07/hackers-exploit-sap-vulnerability-to.html",
        "Summary": "Threat actors have been observed exploiting a now-patched critical SAP NetWeaver flaw to deliver the Auto-Color backdoor in an attack targeting a U.S.-based chemicals company in April 2025.\n\"Over the course of three days, a threat actor gained access to the customer's network, attempted to download several suspicious files and communicated with malicious infrastructure linked to Auto-Color",
        "Date": "2025-07-30",
        "Content": "Threat actors have been observed exploiting a now-patched critical SAP NetWeaver flaw to deliver the Auto-Color backdoor in an attack targeting a U.S.-based chemicals company in April 2025.\n\"Over the course of three days, a threat actor gained access to the customer's network, attempted to download several suspicious files and communicated with malicious infrastructure linked to Auto-Color malware,\" Darktrace\nsaid\nin a report shared with The Hacker News.\nThe vulnerability in question is\nCVE-2025-31324\n, a severe unauthenticated file upload bug in SAP NetWeaver that enables remote code execution (RCE). It was\npatched\nby SAP in April.\nAuto-Color, first\ndocumented\nby Palo Alto Networks Unit 42 earlier this February, functions akin to a remote access trojan, enabling remote access to compromised Linux hosts. It was observed in attacks targeting universities and government organizations in North America and Asia between November and December 2024.\nThe malware has been found to hide its malicious behavior should it fail to connect to its command-and-control (C2) server, a sign that the threat actors are looking to evade detection by giving the impression that it's benign.\nIt supports various features, including reverse shell, file creation and execution, system proxy configuration, global payload manipulation, system profiling, and even self-removal when a kill switch is triggered.\nThe incident detected by Darktrace took place on April 28, when it was alerted to the download of a suspicious ELF binary on an internet-exposed machine likely running SAP NetWeaver. That said, initial signs of scanning activity are said to have occurred at least three days prior.\n\"CVE-2025-31324 was leveraged in this instance to launch a second-stage attack, involving the compromise of the internet-facing device and the download of an ELF file representing the Auto-Color malware,\" the company said.\n\"From initial intrusion to the failed establishment of C2 communication, the Auto-Color malware showed a clear understanding of Linux internals and demonstrated calculated restraint designed to minimize exposure and reduce the risk of detection.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Scattered Spider Hacker Arrests Halt Attacks, But Copycat Threats Sustain Security Pressure",
        "Link": "https://thehackernews.com/2025/07/scattered-spider-hacker-arrests-halt.html",
        "Summary": "Google Cloud's Mandiant Consulting has revealed that it has witnessed a drop in activity from the notorious Scattered Spider group, but emphasized the need for organizations to take advantage of the lull to shore up their defenses.\n\"Since the recent arrests tied to the alleged Scattered Spider (UNC3944) members in the U.K., Mandiant Consulting hasn't observed any new intrusions directly",
        "Date": "2025-07-30",
        "Content": "Google Cloud's Mandiant Consulting has revealed that it has witnessed a drop in activity from the notorious Scattered Spider group, but emphasized the need for organizations to take advantage of the lull to shore up their defenses.\n\"Since the recent\narrests tied to the alleged Scattered Spider (UNC3944) members\nin the U.K., Mandiant Consulting hasn't observed any new intrusions directly attributable to this specific threat actor,\" Charles Carmakal, CTO of Mandiant Consulting at Google Cloud, told The Hacker News in a statement.\n\"This presents a critical window of opportunity that organizations must capitalize on to thoroughly study the tactics UNC3944 wielded so effectively, assess their systems, and reinforce their security posture accordingly.\"\nCarmakal also warned businesses not to \"let their guard down entirely,\" as other threat actors like\nUNC6040\nare employing similar social engineering tactics as Scattered Spider to breach target networks.\n\"While one group may be temporarily dormant, others won't relent,\" Carmakal added.\nThe development comes as the tech giant\ndetailed\nthe financially motivated hacking group's aggressive targeting of VMware ESXi hypervisors in attacks targeting retail, airline, and transportation sectors in North America.\nThe U.S. government, alongside Canada and Australia, has also released an updated advisory outlining Scattered Spider's updated tradecraft obtained as part of investigations conducted by the Federal Bureau of Investigation (FBI) as recently as this month.\n\"Scattered Spider threat actors have been known to use various ransomware variants in data extortion attacks, most recently including\nDragonForce\nransomware,\" the agencies\nsaid\n.\n\"These actors frequently use social engineering techniques such as phishing, push bombing, and subscriber identity module swap attacks to obtain credentials, install remote access tools, and bypass multi-factor authentication. Scattered Spider threat actors consistently use proxy networks [T1090] and rotate machine names to further hamper detection and response.\"\nThe group has also been observed posing as employees to persuade IT and/or help desk staff to provide sensitive information, reset the employee's password, and transfer the employee's multi-factor authentication (MFA) to a device under their control.\nThis marks a shift from the threat actors impersonating help desk personnel in phone calls or SMS messages to obtain employee credentials or instruct them to run commercial remote access tools enabling initial access. In other instances, the hackers have acquired employee or contractor credentials on illicit marketplaces such as Russia Market.\nFurthermore, the governments called out Scattered Spider's use of readily available malware tools like Ave Maria (aka Warzone RAT), Raccoon Stealer, Vidar Stealer, and Ratty RAT to facilitate remote access and gather sensitive information, as well as cloud storage service Mega for data exfiltration.\n\"In many instances, Scattered Spider threat actors search for a targeted organization's Snowflake access to exfiltrate large volumes of data in a short time, often running thousands of queries immediately,\" per the advisory.\n\"According to trusted third-parties, where more recent incidents are concerned, Scattered Spider threat actors may have deployed DragonForce ransomware onto targeted organizations' networks – thereby encrypting VMware Elastic Sky X integrated (ESXi) servers.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "ShinyHunters behind Salesforce data theft attacks at Qantas, Allianz Life, and LVMH",
        "Link": "https://www.bleepingcomputer.com/news/security/shinyhunters-behind-salesforce-data-theft-attacks-at-qantas-allianz-life-and-lvmh/",
        "Summary": "A wave of data breaches impacting companies like Qantas, Allianz Life, LVMH, and Adidas has been linked to the ShinyHunters extortion group, which has been using voice phishing attacks to steal data from Salesforce CRM instances. [...]",
        "Date": "2025-07-30",
        "Content": "A wave of data breaches impacting companies like Qantas, Allianz Life, LVMH, and Adidas has been linked to the ShinyHunters extortion group, which has been using voice phishing attacks to steal data from Salesforce CRM instances.\nIn June, Google's Threat Intelligence Group (GTIG) warned that threat actors tracked as UNC6040 were\ntargeting Salesforce customers in social engineering attacks\n.\nIn these attacks, the threat actors impersonated IT support staff in phone calls to targeted employees, attempting to persuade them into visiting Salesforce's connected app setup page. On this page, they were told to enter a \"connection code\", which linked a malicious version of Salesforce's Data Loader OAuth app to the target's Salesforce environment.\nIn some cases, the Data Loader component was renamed to \"My Ticket Portal,\" to make it more convincing in the attacks.\nPrompt to enter connection code\nSource: Google\nGTIG says that these attacks were usually conducted through vishing (voice phishing), but credentials and MFA tokens were also stolen through phishing pages that impersonated Okta login pages.\nAround the time of this report, multiple companies reported data breaches involving third-party customer service or cloud-based CRM systems.\nLVMH subsidiaries\nLouis Vuitton\n,\nDior\n, and\nTiffany & Co.\neach disclosed unauthorized access to a customer information database, with\nTiffany Korea notifying customers\nthe attackers breached a \"vendor platform used for managing customer data.\"\nAdidas\n,\nQantas\n, and\nAllianz Life\nalso reported breaches involving third-party systems, with Allianz confirming it was a third-party customer relationship management platform.\n\"On July 16, 2025, a malicious threat actor gained access to a third-party, cloud-based CRM system used by Allianz Life Insurance Company of North America (Allianz Life),\" an Allianz Life spokesperson told BleepingComputer.\nWhile BleepingComputer has learned that the Qantas data breach also involved a third-party customer relationship management platform, the company will not confirm it is Salesforce. However,\nprevious reporting\nfrom local media claims the data was stolen from Qantas' Salesforce instance.\nFurthermore, court documents state that the threat actors targeted \"\nAccounts\n\" and \"\nContacts\n\" database tables, both of which are Salesforce objects.\nWhile none of these companies have publicly named Salesforce, BleepingComputer has since confirmed that all were targeted in the same campaign detailed by Google.\nThe attacks have not led to public extortion or data leaks yet, with BleepingComputer learning that the threat actors are attempting to privately extort companies over email, where they name themselves as ShinyHunters.\nIt is believed that when these extortion attempts fail, the threat actors will release stolen information in a long wave of leaks, similar to ShinyHunter's previous\nSnowflake attacks\n.\nWho is ShinyHunters\nThe breaches have caused confusion among the cybersecurity community and the media, including BleepingComputer, with the attacks attributed to Scattered Spider (tracked by Mandiant as UNC3944), as those threat actors were also targeting the\naviation\n,\nretail\n, and\ninsurance\nsectors around the same time and demonstrated similar tactics.\nHowever, threat actors associated with Scattered Spider tend to perform full-blown network breaches, culminating with data theft and, sometimes, ransomware. ShinyHunters, tracked as UNC6040, on the other hand, tends to focus more on data-theft extortion attacks targeting a particular cloud platform or web application.\nIt is BleepingComputer's and some security researchers' belief that both UNC6040 and UNC3944 consist of overlapping members that communicate within the same online communities. The threat group is also believed to overlap with \"The Com,\" a network of experienced English-speaking cybercriminals.\n\"According to Recorded Future intelligence, the overlapping TTPs between known Scattered Spider and ShinyHunters attacks indicate likely some crossover between the two groups,\" Allan Liska, an Intelligence Analyst for Recorded Future, told BleepingComputer.\nOther researchers have told BleepingComputer that ShinyHunters and Scattered Spider appear to be operating in lockstep, targeting the same industries at the same time, making it harder to attribute attacks.\nSome also believe that both groups have ties to threat actors from the now-defunct\nLapsus$ hacking group\n, with reports indicating that one of the\nrecently arrested Scattered Spider hackers\nwas\nalso in Lapsus$\n.\nAnother theory is that ShinyHunters is acting as an extortion-as-a-service, where they extort companies on behalf of other threat actors in exchange for a revenue share, similar to how ransomware-as-a-service gangs operate.\nThis theory is supported by previous conversations BleepingComputer has had with ShinyHunters, where they claimed not to be behind a breach, but just acting as the seller of the stolen data.\nThese breaches include\nPowerSchool\n,\nOracle Cloud\n, the\nSnowflake data-theft attacks\n,\nAT&T\n,\nNitroPDF\n,\nWattpad\n,\nMathWay\n, and\nmany more\n.\nShinyHunters leaking attempting to sell AT&T data breach\nSource: BleepingComputer\nTo muddy the waters further, there have been\nnumerous arrests\nof people linked to the name \"ShinyHunters,\" including those who have been arrested for the\nSnowflake data-theft attacks\n,\nbreaches at PowerSchool\n, and the\noperation of the Breached v2 hacking forum\n.\nYet even after these arrests, new attacks occur with companies receiving extortion emails stating, \"We are ShinyHunters,\" referring to themselves as a \"collective.\"\nProtecting Salesforce instances from attacks\nIn a statement to BleepingComputer, Salesforce emphasized that the platform itself was not compromised, but rather, customers' accounts are being breached via social engineering.\n\"Salesforce has not been compromised, and the issues described are not due to any known vulnerability in our platform. While Salesforce builds enterprise-grade security into everything we do, customers also play a critical role in keeping their data safe — especially amid a rise in sophisticated phishing and social engineering attacks,\" Salesforce told BleepingComputer.\n\"We continue to encourage all customers to follow security best practices, including enabling multi-factor authentication (MFA), enforcing the principle of least privilege, and carefully managing connected applications. For more information, please visit:\nhttps://www.salesforce.com/blog/protect-against-social-engineering/\n.\"\nSalesforce is urging customers to strengthen their security posture by:\nEnforcing trusted IP ranges for logins\nFollowing the principle of least privilege for app permissions\nEnabling multi-factor authentication (MFA)\nRestricting use of connected apps and managing access policies\nUsing Salesforce Shield for advanced threat detection, event monitoring, and transaction policies\nAdding a designated Security Contact for incident communication\nFurther details on these mitigations can be found in Salesforce's guidance linked above.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide"
    },
    {
        "Title": "Hackers target Python devs in phishing attacks using fake PyPI site",
        "Link": "https://www.bleepingcomputer.com/news/security/hackers-target-python-devs-in-phishing-attacks-using-fake-pypi-site/",
        "Summary": "The Python Software Foundation warned users this week that threat actors are trying to steal their credentials in phishing attacks using a fake Python Package Index (PyPI) website. [...]",
        "Date": "2025-07-30",
        "Content": "The Python Software Foundation warned users this week that threat actors are trying to steal their credentials in phishing attacks using a fake Python Package Index (PyPI) website.\nPyPI is a repository for Python packages, accessible at pypi.org, that offers a centralized platform for developers to distribute and install third-party software libraries. It hosts hundreds of thousands of packages and is the default source for Python's package management tools.\n\"PyPI has not been hacked, but users are being targeted by a phishing attack that attempts to trick them into logging in to a fake PyPI site. Over the past few days, users who have published projects on PyPI with their email in package metadata may have received an email titled '[PyPI] Email verification' from the email address noreply@pypj.org,\" the\nPyPI admin Mike Fiedler cautioned\n.\n\"This is not a security breach of PyPI itself, but rather a phishing attempt that exploits the trust users have in PyPI. The email instructs users to follow a link to verify their email address, which leads to a phishing site that looks like PyPI but is not the official site.\"\nAfter opening the malicious website, the targeted users will be prompted to sign in, with the requests sent back to PyPI to trick the users into believing they have logged in to PyPI.\nHowever, the attackers are instead harvesting their credentials, which will likely be used in future attacks to infect Python packages they've uploaded to PyPI with malware or to upload new malicious packages onto the platform.\nFake pypj[.]org site (BleepingComputer)\n​The PyPI admins have also added a banner to PyPI's homepage, warning users of this phishing attack, and are now working to find a way to disrupt this ongoing campaign.\n\"We are also waiting for CDN providers and name registrars to respond to the trademark and abuse notifications we have sent them regarding the phishing site,\" Fiedler added.\nPython developers and PyPI users who have received these phishing emails are advised not to click the embedded links and to delete the email immediately.\nThose who have already entered their credentials on the pypj[.]org phishing site, should immediately change their PyPI password and inspect their accounts' Security History for suspicious or unexpected activity.\nIn February, the Python Software Foundation\nintroduced 'Project Archival\n,' a new system designed to help PyPI publishers archive their projects, indicating to users that no updates are expected.\nPyPI was also\nforced to temporarily suspend user registration\nand the creation of new projects in March 2024 due to a malware campaign linked to threat actors who uploaded hundreds of new malicious packages masquerading as legitimate projects.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nHow attackers are still phishing \"phishing-resistant\" authentication\nThreat actors try to downgrade FIDO2 MFA auth in PoisonSeed phishing attack\nCISA and FBI warn of escalating Interlock ransomware attacks\nGoogle Gemini flaw hijacks email summaries for phishing\nFBI: Cybercriminals steal health data posing as fraud investigators"
    },
    {
        "Title": "SafePay ransomware threatens to leak 3.5TB of Ingram Micro data",
        "Link": "https://www.bleepingcomputer.com/news/security/safepay-ransomware-threatens-to-leak-35tb-of-ingram-micro-data/",
        "Summary": "The SafePay ransomware gang is threatening to leak 3.5TB of data belonging to IT giant Ingram Micro, allegedly stolen from the company's compromised systems earlier this month. [...]",
        "Date": "2025-07-30",
        "Content": "The SafePay ransomware gang is threatening to leak 3.5TB of data belonging to IT giant Ingram Micro, allegedly stolen from the company's compromised systems earlier this month.\nIngram Micro is one of the world's largest business-to-business service providers and technology distributors, offering a wide range of solutions to resellers and managed service providers worldwide, including hardware, software, cloud services, logistics, and training.\nWhile BleepingComputer\nfirst reported\non July 5 that SafePay was behind this incident, the ransomware gang didn't claim responsibility for the attack until earlier this week, when it added the tech giant to its dark web leak portal.\nSafePay ransomware is a private operation that surfaced in September 2024 and has since added over 260 victims to its leak site; however, the actual number is likely larger, as only victims who don't pay are listed.\nThey're also known for stealing sensitive documents before encrypting victims' systems and threatening to leak this stolen data on the dark web if a ransom is not paid.\nSince the start of the year, SafePay has become\none of the most active ransomware groups\n, filling the gap left by LockBit and BlackCat (ALPHV) ransomware.\nIngram Micro entry on SafePay's leak site (BleepingComputer)\nAs BleepingComputer reported earlier this month, Ingram Micro also\nsuffered a global outage\ncaused by the SafePay ransomware attack, with employees told to work from home and the company's website and ordering systems taken offline.\nSince then, BleepingComputer\nhas learned\nthat the company has been working on restoring VPN access to employees and has also performed a company-wide password and multi-factor authentication (MFA) reset.\nIngram Micro quickly recovered from the incident, restoring many of the internal systems and platforms impacted by the attack within days, allowing employees greater access to its ordering system.\n\"Ingram Micro is pleased to report that we are now operational across all countries and regions where we transact business. Our teams continue to perform at a swift pace to serve and support our customers and vendor partners,\" Ingram\nMicro\nannounced\njust four days after disclosing the attack.\nHowever, the company has yet to confirm that SafePay ransomware was behind the breach and whether the attackers stole data from its compromised systems.\nAn Ingram Micro spokesperson was not immediately available for comment when BleepingComputer reached out for more information earlier today.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nIngram Micro starts restoring systems after ransomware attack\nIngram Micro outage caused by SafePay ransomware attack\nHunters International ransomware shuts down, releases free decryptors\nHunters International shifts from ransomware to pure data extortion\nDOJ investigates ex-ransomware negotiator over extortion kickbacks"
    },
    {
        "Title": "Hackers actively exploit critical RCE in WordPress Alone theme",
        "Link": "https://www.bleepingcomputer.com/news/security/hackers-actively-exploit-critical-rce-in-wordpress-alone-theme/",
        "Summary": "Threat actors are actively exploiting a critical unauthenticated arbitrary file upload vulnerability in the WordPress theme 'Alone,' to achieve remote code execution and perform a full site takeover. [...]",
        "Date": "2025-07-30",
        "Content": "Threat actors are actively exploiting a critical unauthenticated arbitrary file upload vulnerability in the WordPress theme 'Alone,' to achieve remote code execution and perform a full site takeover.\nWordfence is reporting the malicious activity, saying it has blocked over 120,000 exploitation attempts targeting its customers.\nThe WordPress security firm also reports that the attacks started several days before public disclosure of the flaw, indicating that threat actors are monitoring changelogs and patches to discover trivially exploitable issues before alerts are sent to website owners.\nThe vulnerability, tracked under CVE-2025-5394, impacts all versions of Alone up to 7.8.3. The vendor, Bearsthemes, fixed it in Alone version 7.8.5, released on June 16, 2025.\nThe problem stems from the theme's 'alone_import_pack_install_plugin()' function, which lacks nonce checks and is exposed via the wp_ajax_nopriv_ hook.\nThe function allows plugin installation via AJAX, and accepts a remote source URL in the POST data, enabling unauthenticated users to trigger plugin installations from remote URLs.\nAccording to Wordfence, attackers leverage the flaw to upload webshells inside ZIP archives, deploy password-protected PHP backdoors that allow persistent remote command execution via HTTP requests, or create hidden administrator users.\nIn some cases, the attackers even install full-featured file managers that give them complete control over the site's databases.\nGiven the above, signs of compromise include the appearance of new admin users, suspicious ZIP/plugin folders, and requests to 'admin-ajax.php?action=alone_import_pack_install_plugin.'\nWordfence logged tens of thousands of exploitation attempts from the IP addresses 193.84.71.244, 87.120.92.24, 146.19.213.18, and 2a0b:4141:820:752::2, so these should be blocked immediately.\nVolume of exploitation attempts against Alone-powered sites\nSource: Wordfence\nAlone is a premium theme with nearly\n10,000 sales on the Envato market\n, primarily used by non-profits such as charities, NGOs, fundraising organizations, and social organizations.\nAlthough Wordfence submitted a report to Bearsthemes as early as May 30, 2025, they did not hear back, so they escalated the issue to the Envato team on June 12.\nFour days later, the vendor released a fixed version of Alone, v7.8.5, which is the recommended update target for all users.\nLast month, another premium WordPress theme, Motors, was\ntargeted by hackers\nwho exploited a user validation flaw to hijack administrator accounts on vulnerable websites.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nCisco: Maximum-severity ISE RCE flaws now exploited in attacks\nNew Fortinet FortiWeb hacks likely linked to public RCE exploits\nHackers exploit OttoKit WordPress plugin flaw to add admin accounts\nHackers are exploiting critical RCE flaw in Wing FTP Server\nWordPress Motors theme flaw mass-exploited to hijack admin accounts"
    },
    {
        "Title": "Hackers plant 4G Raspberry Pi on bank network in failed ATM heist",
        "Link": "https://www.bleepingcomputer.com/news/security/hackers-plant-4g-raspberry-pi-on-bank-network-in-failed-atm-heist/",
        "Summary": "The UNC2891 hacking group, also known as LightBasin, used a 4G-equipped Raspberry Pi hidden in a bank's network to bypass security defenses in a newly discovered attack. [...]",
        "Date": "2025-07-30",
        "Content": "The UNC2891 hacking group, also known as LightBasin, used a 4G-equipped Raspberry Pi hidden in a bank's network to bypass security defenses in a newly discovered attack.\nThe single-board computer was physically connected to the ATM network switch, creating an invisible channel into the bank's internal network, allowing the attackers to move laterally and deploy backdoors.\nAccording to\nGroup-IB\n, which discovered the intrusion while investigating suspicious activity on the network, the goal of the attack was to spoof ATM authorization and perform fraudulent withdrawals of cash.\nWhile LightBasin failed at that, the incident is a rare example of an advanced hybrid (physical+remote access) attack that employed several anti-forensics techniques to maintain a high degree of stealthiness.\nThe particular group is notorious for attacking banking systems, as Mandiant highlighted in a 2022 report presenting the then-new\nUnix kernel rootkit \"Caketap,\"\ncreated for running on Oracle Solaris systems used in the financial sector.\nCaketap manipulates Payment Hardware Security Module (HSM) responses, specifically the card verification messages, to authorize fraudulent transactions that the bank's systems would otherwise block.\nActive since 2016, LightBasin has also successfully\nattacked telecommunication systems\nfor years, using the TinyShell open-source backdoor to move traffic between networks and route it through specific mobile stations.\nRaspberry $i\nIn the latest case, LightBasin gained physical access to a bank branch either on their own or by bribing a rogue employee who helped them to install a Raspberry Pi with a 4G modem on the same network switch as the ATM.\nThe device's outbound internet connectivity capabilities enabled the attackers to maintain persistent remote access to the bank's internal network while bypassing perimeter firewalls.\nThe Raspberry Pi hosted the TinyShell backdoor which the attacker leveraged for establishing an outbound command-and-control (C2) channel via mobile data.\nIn the subsequent phases of the attack, the threat actors moved laterally to the Network Monitoring Server, which had extensive connectivity to the bank's data center.\nOverview of the LightBasin attack\nSource: Group-IB\nFrom there, the attacker also pivoted to the Mail Server, which had direct internet access, and enabled persistence even when the Raspberry Pi was discovered and removed.\nThe backdoors used in lateral movement were named as 'lightdm' to mimic the legitimate LightDM display manager found on Linux systems, hence appearing inoccuous.\nAnother element that contributed to the attack's high degree of stealth was LightBasin mounting alternative filesystems like tmpfs and ext4 over the '/proc/[pid]' paths of the malicious processes, essentially obscuring the related metadata from forensics tools.\nBased on Group-IB's investigation, the Network Monitoring Server inside the bank network was found beaconing every 600 seconds to the Raspberry Pi on port 929, indicating that the device served as a pivot host.\nThe researchers say the attackers' ultimate goal was to deploy the Caketap rootkit, but that plan was foiled before it could materialize.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nEmployee gets $920 for credentials used in $140 million bank heist\nBitoPro exchange links Lazarus hackers to $11 million crypto heist\nInstagram ads mimicking BMO, EQ Bank are finance scams"
    },
    {
        "Title": "Apple patches security flaw exploited in Chrome zero-day attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/apple-patches-security-flaw-exploited-in-chrome-zero-day-attacks/",
        "Summary": "Apple has released security updates to address a high-severity vulnerability that has been exploited in zero-day attacks targeting Google Chrome users. [...]",
        "Date": "2025-07-30",
        "Content": "Apple has released security updates to address a high-severity vulnerability that has been exploited in zero-day attacks targeting Google Chrome users.\nTracked as\nCVE-2025-6558\n, the security bug is due to the incorrect validation of untrusted input in the ANGLE (Almost Native Graphics Layer Engine) open-source graphics abstraction layer, which processes GPU commands and translates OpenGL ES API calls to Direct3D, Metal, Vulkan, and OpenGL.\nThe vulnerability enables remote attackers to execute arbitrary code within the browser's GPU process via specially crafted HTML pages, potentially allowing them to escape the sandbox that isolates browser processes from the underlying operating system.\nVlad Stolyarov and Clément Lecigne of Google's Threat Analysis Group (TAG), a team of security experts dedicated to defending Google customers against state-sponsored attacks, discovered CVE-2025-6558 in June and reported it to the Google Chrome team, who\npatched it\non July 15 and tagged it as actively exploited in attacks.\nWhile Google has yet to provide further information on these attacks, Google TAG frequently discovers zero-day flaws exploited by government-sponsored threat actors in targeted campaigns aimed at deploying spyware on devices of high-risk individuals, including dissidents, opposition politicians, and journalists.\nOn Tuesday, Apple released WebKit security updates to address the CVE-2025-6558 vulnerability for the following software and devices:\niOS 18.6 and iPadOS 18.6\n: iPhone XS and later, iPad Pro 13-inch, iPad Pro 12.9-inch 3rd generation and later, iPad Pro 11-inch 1st generation and later, iPad Air 3rd generation and later, iPad 7th generation and later, and iPad mini 5th generation and later\nmacOS Sequoia 15.6\n: Macs running macOS Sequoia\niPadOS 17.7.9\n: iPad Pro 12.9-inch 2nd generation, iPad Pro 10.5-inch, and iPad 6th generation\ntvOS 18.6\n: Apple TV HD and Apple TV 4K (all models)\nvisionOS 2.6\n: Apple Vision Pro\nwatchOS 11.6\n: Apple Watch Series 6 and later\n\"Processing maliciously crafted web content may lead to an unexpected Safari crash,\" Apple\nexplained\nwhen describing the impact of CVE-2025-6558 successful exploitation. \"This is a vulnerability in open source code and Apple Software is among the affected projects.\"\nOn July 22, the Cybersecurity and Infrastructure Security Agency (CISA), the U.S. cyber defense agency, also\nadded\nthis security bug to its\ncatalog of vulnerabilities\nknown to be exploited in attacks, requiring federal agencies to patch their software by August 12.\nWhile the Binding Operational Directive (BOD) 22-01, which mandates federal agencies to secure their systems, only applies to federal agencies, CISA advised all network defenders to prioritize patching the CVE-2025-6558 vulnerability as soon as possible.\n\"These types of vulnerabilities are frequent attack vectors for malicious cyber actors and pose significant risks to the federal enterprise,\" the cybersecurity agency warned last week.\nApple has also patched five zero-day flaws exploited in targeted attacks since the start of the year, including one zero-day in January (\nCVE-2025-24085\n), one in February (\nCVE-2025-24200\n), a third in March (\nCVE-2025-24201\n), and two more in April (\nCVE-2025-31200 and CVE-2025-31201\n).\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nGoogle fixes actively exploited sandbox escape zero day in Chrome\nGoogle patches new Chrome zero-day bug exploited in attacks\nHackers actively exploit critical RCE in WordPress Alone theme\nMicrosoft: macOS Sploitlight flaw leaks Apple Intelligence data\nHackers exploit SAP NetWeaver bug to deploy Linux Auto-Color malware"
    },
    {
        "Title": "New Lenovo UEFI firmware updates fix Secure Boot bypass flaws",
        "Link": "https://www.bleepingcomputer.com/news/security/new-lenovo-uefi-firmware-updates-fix-secure-boot-bypass-flaws/",
        "Summary": "Lenovo is warning about high-severity BIOS flaws that could allow attackers to potentially bypass Secure Boot in all-in-one desktop PC models that use customized Insyde UEFI (Unified Extensible Firmware Interface). [...]",
        "Date": "2025-07-30",
        "Content": "Lenovo is warning of high-severity BIOS flaws that could let attackers bypass Secure Boot on all-in-one desktops using customized Insyde UEFI firmware.\nDevices confirmed to be impacted are IdeaCentre AIO 3 24ARR9 and 27ARR9, and the Yoga AIO 27IAH10, 32ILL10, and 32IRH8.\nUEFI is the modern replacement for the traditional PC BIOS, acting as a firmware interface between the computer's hardware and the OS, controlling early initialization and booting.\nThe flaws, discovered by Binarly, mirror those the researchers uncovered earlier this month, which impacted\ndozens of Gigabyte motherboard models\n, enabling local attackers to execute arbitrary code in System Management Mode (SMM).\nThe SMM is a CPU mode that is separate from the operating system (OS) and hypervisor, running with higher privileges at a lower level (Ring-2). Exploiting flaws in SMM could help attackers plant 'undetectable' malware, bypassing OS-level security defenses, such as SecureBoot.\nInsydeH2O is one of the most widely deployed commercial UEFI BIOS frameworks used in OEM laptops and desktops.\nInsyde also\npublished a bulletin\nexplaining that the flaws arise from OEM-specific customizations made by Lenovo in InsydeH2O UEFI firmware images, and do not apply to all systems using InsydeH2O UEFI.\n\"The newly identified Lenovo vulnerabilities arise from the same recurring challenges tied to inconsistencies within the software supply chain,\" commented Binarly's Alex Matrosov to BleepingComputer.\n\"All six vulnerabilities were found in System Management Mode (SMM)‑level code, the invisible layer of firmware that loads before your operating system and persists after every re‑image, making them perfect launch pads for stealthy implants and Secure Boot bypasses.\"\nThe six flaws are summarized as follows:\nCVE-2025-4421\n: bug in an SMI handler (Callback7 via EfiSmiServices) allows an attacker to write to an attacker-controlled SMRAM address using an unvalidated RSI register, leading to SMM privilege escalation and persistent firmware compromise (CVSS score: 8.2)\nCVE-2025-4422\n: bug in an SMI handler (EfiSmiServices, via gEfiSmmCpuProtocol and EfiPcdProtocol) can lead to SMM memory corruption and privilege escalation. (CVSS score: 8.2)\nCVE-2025-4423\n: bug in an SMI handler (SetupAutomationSmm) allows arbitrary memory writes in SMM, leading to SMM privilege escalation and code execution. (CVSS score: 8.2)\nCVE-2025-4424\n: improper input validation in an SMI handler (SetupAutomationSmm) allows unsanitized calls to SmmSetVariable, leading to firmware settings manipulation. (CVSS score: 6)\nCVE-2025-4425\n: stack buffer overflow in an SMI handler (SetupAutomationSmm) can lead to SMM privilege escalation and arbitrary code execution. (CVSS score: 8.2)\nCVE-2025-4426\n: bug in an SMI handler (SetupAutomationSmm) leaks SMRAM contents, enabling sensitive information disclosure. (CVSS score: 6)\nBinarly reported the vulnerabilities to Lenovo on April 8, 2025, and received confirmation from the company on June 16. The coordinated disclosure was published yesterday, following the expiration of the 90-day disclosure window.\nLenovo has\nreleased firmware security updates\nfor IdeaCenter AIO 3 models, urging users to upgrade to version O6BKT1AA.\nYoga AIO updates aren't currently available, but the computer vendor plans to release fixes between September 30 and November 30, 2025.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nGigabyte motherboards vulnerable to UEFI malware bypassing Secure Boot\nHPE warns of hardcoded passwords in Aruba access points\nLovense sex toy app flaw leaks private user email addresses\nHackers actively exploit critical RCE in WordPress Alone theme\nApple patches security flaw exploited in Chrome zero-day attacks"
    },
    {
        "Title": "AI Cuts vCISO Workload by 68% as Demand Skyrockets, New Report Finds",
        "Link": "https://www.bleepingcomputer.com/news/security/ai-cuts-vciso-workload-by-68-percent-as-demand-skyrockets-new-report-finds/",
        "Summary": "AI is reshaping vCISO services—and SMBs are fueling the surge. Cynomi's 2025 report shows 3x adoption growth and major workload drops as MSPs and MSSPs scale cybersecurity like never before. Learn more in the 2025 State of the vCISO Report. [...]",
        "Date": "2025-07-30",
        "Content": "Once reserved for large enterprises, cybersecurity has become a top priority for businesses of all sizes. SMBs are driving surging demand for vCISO services to address growing threats and tightening regulations. And with AI, service providers can address these needs more efficiently and at scale.\nThese are some of the findings of\nthe 2025 State of the vCISO Report\n, commissioned by\nCynomi\n, the leading AI-powered vCISO platform. The report provides an in-depth look into the evolving vCISO market and the broader advanced cybersecurity services ecosystem.\nNow in its third year, the report highlights how the SMB security services landscape is shifting fast. It shows how a once-supplementary service has now become foundational. It also explores the transformative role of AI in shaping cybersecurity delivery.\nBelow, we highlight key findings from the report, covering what SMBs are demanding, how MSPs and MSSPs are responding, and the growing potential of AI-powered vCISO services.\nWe highly recommend exploring\nthe full report\nfor deeper, actionable insights and a clear view of what lies ahead for security service providers.\nFigure 1: Demand for Advanced Cybersecurity Services Among SMB Clients\n3x Increase in vCISO Adoption among MSPs and MSSPs\nAs cyberattacks grow in frequency and sophistication and regulatory pressures intensify, SMBs are turning to vCISO services in record numbers. This surge in demand isn’t surprising: vCISO offerings provide a flexible, cost-effective way for organizations to access high-level cybersecurity expertise without the overhead of a full-time executive.\nWhat is surprising is the pace of adoption. A striking 79% of providers now report high demand among SMBs for vCISO services, surpassing interest in other offerings like compliance readiness and cyber insurance support.\nService providers are moving quickly to keep up. In just one year, vCISO adoption among MSPs and MSSPs has skyrocketed by 319%, jumping from 21% in 2024 to 67% in 2025.\nAnd the momentum isn’t slowing. 74% of remaining providers say they plan to launch vCISO services by year’s end.\nThe State of the Virtual CISO 2025\nDemand for advanced cybersecurity services is reaching record highs. And with AI, vCISO providers are cutting workloads and speeding up delivery like never before.\nIf you’re an MSP or MSSP considering or already offering vCISO services, this report is a must-read.\nDownload the Report\nvCISO Business Benefits Are Clear and Widespread\nMeeting this rising demand presents a significant revenue opportunity for service providers. The report finds that MSPs and MSSPs who meet SMB needs and develop a vCISO offering, can see significant concrete business gains.\nThese include improved upsell of additional products and services (41%), increased margins (40%), a larger customer base (39%), the ability to access new prospects, and direct boost to recurring revenue.\nJust as importantly, vCISO services deliver real security value to end customers. This transforms providers into trusted strategic, long-term business partners, not just temporary vendors.\nFigure 2: Impact of Offering vCISO Services\n*Question allowed more than one answer and as a result, percentages will add up to more than 100%\nInterestingly, these benefits appear to be widely recognized, even among providers who haven’t yet launched vCISO services. Many cite differentiation, upsell potential, and improved profitability as key motivators for future adoption.\nThis broad awareness aligns with the strong momentum expected among MSPs and MSSPs planning to introduce vCISO offerings later this year.\nBarriers Remain, But They’re Operational, Not Strategic\nWhat’s holding back MSPs and MSSPs from adopting vCISO services faster?\nAmong providers yet to launch vCISO offerings, the biggest hurdles are concerns about profitability or ROI (35%), high initial investment (33%), and lack of skilled cybersecurity personnel (32%)\nHowever, these barriers are logistical, and not conceptual. The value of vCISO services is clear, and technology is increasingly positioned to help bridge these gaps (see below).\nWith the majority of non-adopters planning to launch by the end of 2025 or early 2026, it’s evident that a market-wide shift is already in motion.\nAI Is Changing the vCISO Game\nUnsurprisingly, and yet remarkably, the impact of AI has not skipped the vCISO ecosystem.\nToday, 81% of MSPs and MSSPs already leverage AI or automation in their vCISO delivery, with another 15% planning to adopt within the next year.\nAI is being used to automate, enhance and provide services like reporting automation and insights, remediation planning, compliance readiness and monitoring, risk and security assessments, task prioritization, and more.\nThe impact? Faster, more efficient and scalable deliveries. The average workload drop is 68%, with 42% of providers reporting an 81–100% reduction in manual workloads.\nThis shift enables teams to support more clients without compromising quality, proving just how dramatically AI is enhancing day-to-day operations and driving new levels of efficiency.\nWhat’s Next? AI-Enabled vCISO Scale and Strategic Growth\nWith both current and planned AI adoption gaining momentum, the direction is clear: AI is becoming the standard for driving cybersecurity efficiency. As adoption accelerates, its impact on the quality, speed and scalability of vCISO services is set to grow exponentially, reshaping how cybersecurity is delivered.\nLooking ahead, AI is no longer just the domain of early adopters. Rather, it’s becoming central to the growth roadmap for nearly every service provider in the market.\nReady to explore the full report?\nDownload the full State of the vCISO 2025 Report.\nSponsored and written by\nCynomi\n."
    },
    {
        "Title": "Silk Typhoon Linked to Powerful Offensive Tools, PRC-Backed Companies",
        "Link": "https://www.darkreading.com/threat-intelligence/silk-typhoon-powerful-offensive-tools-prc",
        "Summary": "An unsealed indictment associated with the Chinese threat group shows its members worked for companies closely aligned with the PRC as part of a larger contractor ecosystem.",
        "Date": "2025-07-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/silk-typhoon-powerful-offensive-tools-prc"
    },
    {
        "Title": "The CrowdStrike Outage Was Bad, but It Could Have Been Worse",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/crowdstrike-outage-was-bad-could-have-been-worse",
        "Summary": "A year after the largest outage in IT history, organizations need to make an active effort to diversify their technology and software vendors and create a more resilient cyber ecosystem moving forward.",
        "Date": "2025-07-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/crowdstrike-outage-was-bad-could-have-been-worse"
    },
    {
        "Title": "ChatGPT, GenAI Tools Open to 'Man in the Prompt' Browser Attack",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/attackers-use-browser-extensions-inject-ai-prompts",
        "Summary": "A brand-new cyberattack vector allows threat actors to use a poisoned browser extension to inject malicious prompts into all of the top generative AI tools on the market, including ChatGPT, Gemini, and others.",
        "Date": "2025-07-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/attackers-use-browser-extensions-inject-ai-prompts"
    },
    {
        "Title": "African Orgs Fall to Mass Microsoft SharePoint Exploits",
        "Link": "https://www.darkreading.com/cyber-risk/african-orgs-mass-microsoft-sharepoint-exploits",
        "Summary": "The National Treasury of South Africa is among the half-dozen known victims in South Africa — along with other nations — of the mass compromise of on-premises Microsoft SharePoint servers.",
        "Date": "2025-07-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/african-orgs-mass-microsoft-sharepoint-exploits"
    },
    {
        "Title": "Scammers Unleash Flood of Slick Online Gaming Sites",
        "Link": "https://krebsonsecurity.com/2025/07/scammers-unleash-flood-of-slick-online-gaming-sites/",
        "Summary": "Fraudsters are flooding Discord and other social media platforms with ads for hundreds of polished online gaming and wagering websites that lure people with free credits and eventually abscond with any cryptocurrency funds deposited by players. Here's a closer look at the social engineering tactics and remarkable traits of this sprawling network of more than 1,200 scam sites.",
        "Date": "2025-07-30",
        "Content": "Fraudsters are flooding Discord and other social media platforms with ads for hundreds of polished online gaming and wagering websites that lure people with free credits and eventually abscond with any cryptocurrency funds deposited by players. Here’s a closer look at the social engineering tactics and remarkable traits of this sprawling network of more than 1,200 scam sites.\nThe scam begins with deceptive ads posted on social media that claim the wagering sites are working in partnership with popular social media personalities, such as Mr. Beast, who recently launched a gaming business called Beast Games. The ads invariably state that by using a supplied “promo code,” interested players can claim a $2,500 credit on the advertised gaming website.\nAn ad posted to a Discord channel for a scam gambling website that the proprietors falsely claim was operating in collaboration with the Internet personality Mr. Beast. Image: Reddit.com.\nThe gaming sites all require users to create a free account to claim their $2,500 credit, which they can use to play any number of extremely polished video games that ask users to bet on each action. At the scam website gamblerbeast[.]com, for example, visitors can pick from dozens of games like B-Ball Blitz, in which you play a basketball pro who is taking shots from the free throw line against a single opponent, and you bet on your ability to sink each shot.\nThe financial part of this scam begins when users try to cash out any “winnings.” At that point, the gaming site will reject the request and prompt the user to make a “verification deposit” of cryptocurrency — typically around $100 — before any money can be distributed. Those who deposit cryptocurrency funds are soon asked for additional payments.\nHowever, any “winnings” displayed by these gaming sites are a complete fantasy, and players who deposit cryptocurrency funds will never see that money again. Compounding the problem, victims likely will soon be peppered with come-ons from “recovery experts” who peddle dubious claims on social media networks about being able to retrieve funds lost to such scams.\nKrebsOnSecurity first learned about this network of phony betting sites from a Discord user who asked to be identified only by their screen name: “Thereallo” is a 17-year-old developer who operates multiple Discord servers and said they began digging deeper after users started complaining of being inundated with misleading spam messages promoting the sites.\n“We were being spammed relentlessly by these scam posts from compromised or purchased [Discord] accounts,” Thereallo said. “I got frustrated with just banning and deleting, so I started to investigate the infrastructure behind the scam messages. This is not a one-off site, it’s a scalable criminal enterprise with a clear playbook, technical fingerprints, and financial infrastructure.”\nAfter comparing the code on the gaming sites promoted via spam messages, Thereallo found they all invoked the same API key for an online chatbot that appears to be in limited use or else is custom-made. Indeed, a scan for that API key at the threat hunting platform Silent Push reveals at least 1,270 recently-registered and active domains whose names all invoke some type of gaming or wagering theme.\nThe “verification deposit” stage of the scam requires the user to deposit cryptocurrency in order to withdraw their “winnings.”\nThereallo said the operators of this scam empire appear to generate a unique Bitcoin wallet for each gaming domain they deploy.\n“This is a decoy wallet,” Thereallo explained. “Once the victim deposits funds, they are never able to withdraw any money. Any attempts to contact the ‘Live Support’ are handled by a combination of AI and human operators who eventually block the user. The chat system is self-hosted, making it difficult to report to third-party service providers.”\nThereallo discovered another feature common to all of these scam gambling sites [hereafter referred to simply as “scambling” sites]: If you register at one of them and then very quickly try to register at a sister property of theirs from the same Internet address and device, the registration request is denied at the second site.\n“I registered on one site, then hopped to another to register again,” Thereallo said. Instead, the second site returned an error stating that a new account couldn’t be created for another 10 minutes.\nThe scam gaming site spinora dot cc shares the same chatbot API as more than 1,200 similar fake gaming sites.\n“They’re tracking my VPN IP across their entire network,” Thereallo explained. “My password manager also proved it. It tried to use my dummy email on a site I had never visited, and the site told me the account already existed. So it’s definitely one entity running a single platform with 1,200+ different domain names as front-ends. This explains how their support works, a central pool of agents handling all the sites. It also explains why they’re so strict about not giving out wallet addresses; it’s a network-wide policy.”\nIn many ways, these scambling sites borrow from the playbook of “pig butchering” schemes, a rampant and far more elaborate crime in which people are gradually lured by flirtatious strangers online into investing in fraudulent cryptocurrency trading platforms.\nPig butchering scams are typically powered by people in Asia who have been kidnapped and threatened with physical harm or worse unless they sit in a cubicle and scam Westerners on the Internet all day. In contrast, these scambling sites tend to steal far less money from individual victims, but their cookie-cutter nature and automated support components may enable their operators to extract payments from a large number of people in far less time, and with considerably less risk and up-front investment.\nSilent Push’s Zach Edwards said the proprietors of this scambling empire are spending big money to make the sites look and feel like some fancy new type of casino.\n“That’s a very odd type of pig butchering network and not like what we typically see, with much lower investments in the sites and lures,” Edwards said.\nHere is a list of all domains that Silent Push found were using the scambling network’s chat API.\n\r\n         This entry was posted on Wednesday 30th of July 2025 02:46 PM \r\n         \nthe part about ‘you can instantly claim a $2500’ doesn’t seem all that polished. a toefl examiner [if any humans still exist at ets] might ‘suggest’ the author was likely of asian origin. go figure.\n“We just need $100 to verify you’re a real person so we can send you all this freeeee gooold!”\nGambling lol.  It universally pits the dumbest parts of the brain against the rest of it…\nThis will always work on a certain type of person.  Call me now for your free tarot reading.\nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "Senate Committee Advances Trump Nominee to Lead CISA",
        "Link": "https://www.securityweek.com/senate-committee-advances-trump-nominee-to-lead-cybersecurity-agency-that-protects-election-systems/",
        "Summary": "<p>Committee Members voted to recommend Sean Plankey for director of the Cybersecurity and Infrastructure Security Agency.</p>\n<p>The post <a href=\"https://www.securityweek.com/senate-committee-advances-trump-nominee-to-lead-cybersecurity-agency-that-protects-election-systems/\">Senate Committee Advances Trump Nominee to Lead CISA</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/senate-committee-advances-trump-nominee-to-lead-cybersecurity-agency-that-protects-election-systems/"
    },
    {
        "Title": "BlinkOps Raises $50 Million for Agentic Security Automation Platform",
        "Link": "https://www.securityweek.com/blinkops-raises-50-million-for-agentic-security-automation-platform/",
        "Summary": "<p>BlinkOps has announced a Series B funding round that brings the total raised by the company for its micro-agents builder to $90 million. </p>\n<p>The post <a href=\"https://www.securityweek.com/blinkops-raises-50-million-for-agentic-security-automation-platform/\">BlinkOps Raises $50 Million for Agentic Security Automation Platform</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/blinkops-raises-50-million-for-agentic-security-automation-platform/"
    },
    {
        "Title": "Legion Emerges From Stealth With $38 Million in Funding",
        "Link": "https://www.securityweek.com/legion-emerges-from-stealth-with-38-million-in-funding/",
        "Summary": "<p>Legion has raised $38 million in seed and Series A funding for its browser-native AI Security Operations Center (SOC) platform.</p>\n<p>The post <a href=\"https://www.securityweek.com/legion-emerges-from-stealth-with-38-million-in-funding/\">Legion Emerges From Stealth With $38 Million in Funding</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/legion-emerges-from-stealth-with-38-million-in-funding/"
    },
    {
        "Title": "Scattered Spider Activity Drops Following Arrests, but Others Adopting Group’s Tactics",
        "Link": "https://www.securityweek.com/scattered-spider-activity-drops-following-arrests-but-others-adopting-groups-tactics/",
        "Summary": "<p>Multiple financially motivated threat actors are targeting backup systems and employing Scattered Spider’s social engineering techniques.</p>\n<p>The post <a href=\"https://www.securityweek.com/scattered-spider-activity-drops-following-arrests-but-others-adopting-groups-tactics/\">Scattered Spider Activity Drops Following Arrests, but Others Adopting Group&#8217;s Tactics</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/scattered-spider-activity-drops-following-arrests-but-others-adopting-groups-tactics/"
    },
    {
        "Title": "Palo Alto Networks to Acquire CyberArk for $25 Billion",
        "Link": "https://www.securityweek.com/palo-alto-networks-to-acquire-cyberark-for-25-billion/",
        "Summary": "<p>Strategic acquisitions marks Palo Alto Networks' formal entry into the identity security space and accelerates its platform strategy.</p>\n<p>The post <a href=\"https://www.securityweek.com/palo-alto-networks-to-acquire-cyberark-for-25-billion/\">Palo Alto Networks to Acquire CyberArk for $25 Billion</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/palo-alto-networks-to-acquire-cyberark-for-25-billion/"
    },
    {
        "Title": "Telecom Giant Orange Hit by Cyberattack",
        "Link": "https://www.securityweek.com/telecom-giant-orange-hit-by-cyberattack/",
        "Summary": "<p>Orange was targeted by hackers in an attack that resulted in the disruption of services offered to corporate and individual customers. </p>\n<p>The post <a href=\"https://www.securityweek.com/telecom-giant-orange-hit-by-cyberattack/\">Telecom Giant Orange Hit by Cyberattack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/telecom-giant-orange-hit-by-cyberattack/"
    },
    {
        "Title": "Cyata Emerges From Stealth With $8.5 Million in Funding",
        "Link": "https://www.securityweek.com/cyata-emerges-from-stealth-with-8-5-million-in-funding/",
        "Summary": "<p>The Israeli startup helps organizations identify, monitor, and control AI agents across their environments.</p>\n<p>The post <a href=\"https://www.securityweek.com/cyata-emerges-from-stealth-with-8-5-million-in-funding/\">Cyata Emerges From Stealth With $8.5 Million in Funding</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cyata-emerges-from-stealth-with-8-5-million-in-funding/"
    },
    {
        "Title": "Cost of Data Breach in US Rises to $10.22 Million, Says Latest IBM Report",
        "Link": "https://www.securityweek.com/cost-of-data-breach-in-us-rises-to-10-22-million-says-latest-ibm-report/",
        "Summary": "<p>The global average cost of a breach fell to $4.44 million (the first decline in five years), but the average US cost rose to a record $10.22 million.</p>\n<p>The post <a href=\"https://www.securityweek.com/cost-of-data-breach-in-us-rises-to-10-22-million-says-latest-ibm-report/\">Cost of Data Breach in US Rises to $10.22 Million, Says Latest IBM Report</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cost-of-data-breach-in-us-rises-to-10-22-million-says-latest-ibm-report/"
    },
    {
        "Title": "Flaw in Vibe Coding Platform Base44 Exposed Private Enterprise Applications",
        "Link": "https://www.securityweek.com/flaw-in-vibe-coding-platform-base44-exposed-private-enterprise-applications/",
        "Summary": "<p>Base44 owner Wix quickly patched a critical authentication bypass vulnerability discovered by researchers at Wiz.</p>\n<p>The post <a href=\"https://www.securityweek.com/flaw-in-vibe-coding-platform-base44-exposed-private-enterprise-applications/\">Flaw in Vibe Coding Platform Base44 Exposed Private Enterprise Applications</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/flaw-in-vibe-coding-platform-base44-exposed-private-enterprise-applications/"
    },
    {
        "Title": "Minnesota Activates National Guard in Response to Cyberattack",
        "Link": "https://www.securityweek.com/minnesota-activates-national-guard-in-response-to-cyberattack/",
        "Summary": "<p>Minnesota Governor Tim Walz called in the National Guard to assist the City of Saint Paul in responding to a cyberattack.</p>\n<p>The post <a href=\"https://www.securityweek.com/minnesota-activates-national-guard-in-response-to-cyberattack/\">Minnesota Activates National Guard in Response to Cyberattack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/minnesota-activates-national-guard-in-response-to-cyberattack/"
    },
    {
        "Title": "UAE Equestrian Federation Data Allegedly Breached",
        "Link": "https://dailydarkweb.net/uae-equestrian-federation-data-allegedly-breached/",
        "Summary": "The UAE Equestrian and Racing Federation (UAEERF), the official governing body for equestrian sports in the United Arab Emirates, has allegedly suffered a significant data breach. A threat actor has claimed responsibility on a dark web forum, stating they gained access to the federation&#8217;s systems by tricking an employee. This social engineering attack reportedly compromised [&#8230;]",
        "Date": "2025-07-30",
        "Content": "The UAE Equestrian and Racing Federation (UAEERF), the official governing body for equestrian sports in the United Arab Emirates, has allegedly suffered a significant data breach. A threat actor has claimed responsibility on a dark web forum, stating they gained access to the federation’s systems by tricking an employee. This social engineering attack reportedly compromised a vast amount of sensitive personal and financial information belonging to the federation’s members, including riders, owners, and trainers.\nThe data, allegedly totaling over 93,000 records, was posted online and appears to contain highly sensitive details. The leaked information allegedly includes full names, Emirates ID numbers, bank account details (including IBANs), phone numbers, physical addresses, and email addresses. The breach also exposed detailed records related to horse registrations, hotel bookings for events, and user profiles, painting a comprehensive picture of the federation’s operations and its members’ private information.\nThe threat actor shared a list of compromised database files, highlighting the breadth of the exposed data. The leak contains specific information about riders, horse owners, trainers, and even event participants, dating back over a decade in some cases. The files include:\nbankdetails.csv\nhorseregentries2013-2014.csv\nhorseregentries2015-2016.csv\nhotel_bookings.csv\nownerregentries.csv\nriderregentries2013-2014.csv\nriderregentries.csv\ntrainerrenewal.csv\nuserprofile.csv\nview_transferdetails.csv\nvw_hotelbookings_list.csv\nvw_ownerprofiles.csv\nvw_portalusers.csv\nvw_riderprofiles.csv\nvw_trainerprofiles.csv\nwc_participants.csv\nwv_teams.csv\nTags:\nbank details\nCyberSecurity\ndata-breach\nPersonal Data\nsocial engineering\nUAE\nUAEERF"
    },
    {
        "Title": "Family Service League Targeted by INC Ransom – Sensitive Data of Vulnerable Citizens Allegedly Compromised",
        "Link": "https://dailydarkweb.net/family-service-league-targeted-by-inc-ransom-sensitive-data-of-vulnerable-citizens-allegedly-compromised/",
        "Summary": "The INC Ransom group has allegedly added the Family Service League (FSL) to its list of victims, claiming a significant data breach. FSL is a major non-profit social service agency headquartered in Long Island, New York, providing crucial support to over 60,000 of the region&#8217;s most vulnerable residents. With a history dating back to 1926 [&#8230;]",
        "Date": "2025-07-30",
        "Content": "The INC Ransom group has allegedly added the Family Service League (FSL) to its list of victims, claiming a significant data breach. FSL is a major non-profit social service agency headquartered in Long Island, New York, providing crucial support to over 60,000 of the region’s most vulnerable residents. With a history dating back to 1926 and an reported annual revenue of $60 million, the organization runs numerous programs addressing issues like mental health, addiction, and homelessness, making it a cornerstone of the community.\nIn a post on their dark web leak site dated July 30, 2025, the cybercriminals claimed to have breached FSL’s network and exfiltrated 100GB of files. The group threatened to publish the data soon, stating that the compromised information is highly confidential. The potential exposure of this data could severely impact the privacy and safety of the thousands of individuals and families who rely on FSL for support.\nThe attackers allege the stolen data includes:\nSensitive Data\nMedical Data\nPersonal Data\nTags:\nCyberSecurity\ndata-breach\nFamily Service League\nFSL\nINC Ransom\nNew York\nransomware\nsocial services"
    },
    {
        "Title": "Brazilian Healthcare Federation Federassantas Allegedly Breached",
        "Link": "https://dailydarkweb.net/brazilian-healthcare-federation-federassantas-allegedly-breached/",
        "Summary": "A significant data breach has allegedly struck a major Brazilian healthcare organization. The victim has been identified as the Federação das Santas Casas e Hospitais Filantrópicos de Minas Gerais (Federassantas), the federation representing non-profit and charitable hospitals in the state of Minas Gerais, Brazil. This organization plays a crucial role in the region&#8217;s healthcare system, [&#8230;]",
        "Date": "2025-07-30",
        "Content": "A significant data breach has allegedly struck a major Brazilian healthcare organization. The victim has been identified as the Federação das Santas Casas e Hospitais Filantrópicos de Minas Gerais (Federassantas), the federation representing non-profit and charitable hospitals in the state of Minas Gerais, Brazil. This organization plays a crucial role in the region’s healthcare system, coordinating and supporting numerous medical institutions. A threat actor has posted claims of the breach on a dark web forum, asserting they have exfiltrated a large volume of sensitive information.\nThe incident, which the perpetrator claims occurred on or around July 28, 2025, allegedly resulted in the theft of a comprehensive dataset spanning from 2017 to 2025. The threat actor is threatening to leak the full database if their demands for payment are not met, a common tactic in data extortion schemes. The data posted on the forum allegedly includes:\nEmails\nPasswords\nTravel expenses, fuel, food, social gatherings, and employee payments\nIPs, logs, and addresses\nComplete data on all member hospitals, including payment and default information\nThis breach poses a severe risk not only to the federation’s operations but also to its member hospitals and their employees. The exposure of such detailed financial, personal, and operational information could lead to widespread fraud, targeted phishing attacks, and significant disruption to essential healthcare services across the state of Minas Gerais. The incident underscores the increasing targeting of critical infrastructure, particularly the healthcare sector, by cybercriminals.\nTags:\nBrazil\nCyberSecurity\ndark web\ndata-breach\nFederassantas\nHealthcare"
    },
    {
        "Title": "Bangladesh Government Portal Suffers Major Data Breach – 4.1 Million Citizens Records Allegedly for Sale",
        "Link": "https://dailydarkweb.net/bangladesh-government-portal-suffers-major-data-breach-4-1-million-citizens-records-allegedly-for-sale/",
        "Summary": "A threat actor has allegedly put the sensitive personal information of 4.1 million Bangladeshi citizens up for sale on a dark web forum. The data was reportedly exfiltrated from the Office of the Registrar General, Birth &#38; Death Registration portal (orgbdr.portal.gov.bd), a critical government body responsible for maintaining the vital records of the country&#8217;s population. [&#8230;]",
        "Date": "2025-07-30",
        "Content": "A threat actor has allegedly put the sensitive personal information of 4.1 million Bangladeshi citizens up for sale on a dark web forum. The data was reportedly exfiltrated from the Office of the Registrar General, Birth & Death Registration portal (orgbdr.portal.gov.bd), a critical government body responsible for maintaining the vital records of the country’s population. This entity plays a fundamental role in the civil registration system of Bangladesh, making the breach a significant concern for national security and citizen privacy.\nThe threat actor claims the breach occurred in July 2025 and is offering a massive database containing 4.1 million records to the highest bidder. The compromised data allegedly includes a wide range of highly sensitive Personally Identifiable Information (PII). A sample provided by the seller indicates that the leaked records contain detailed information on citizens, posing a severe risk of identity theft, financial fraud, and targeted phishing campaigns against the affected individuals.\nThe leaked data allegedly includes the following details:\nFull Name\nNational ID (NID)\nDate of Birth (DOB)\nFull Address\nFather’s Name\nPhone Number\nLife Status (Alive/Deceased)\nRegistration ID\nRegistration Date\nTags:\nBangladesh\nCyberSecurity\ndata-breach\ngovernment\nPII"
    },
    {
        "Title": "German Manufacturer RUKU Tore – Türen Allegedly Targeted by Global Ransomware",
        "Link": "https://dailydarkweb.net/german-manufacturer-ruku-tore-turen-allegedly-targeted-by-global-ransomware/",
        "Summary": "The Global ransomware group has allegedly claimed responsibility for a cyberattack against RUKU Tore + Türen GmbH, a prominent German manufacturer. The announcement appeared on the threat actor&#8217;s dark web blog, indicating that the company&#8217;s data has been compromised. RUKU has a long-standing reputation, with over 160 years of experience in high-quality woodworking, specializing in [&#8230;]",
        "Date": "2025-07-30",
        "Content": "The Global ransomware group has allegedly claimed responsibility for a cyberattack against RUKU Tore + Türen GmbH, a prominent German manufacturer. The announcement appeared on the threat actor’s dark web blog, indicating that the company’s data has been compromised. RUKU has a long-standing reputation, with over 160 years of experience in high-quality woodworking, specializing in doors and gates. The company is known for its craftsmanship and works with partners both domestically and internationally.\nAccording to the post made by the ransomware group, the stolen data is scheduled to be released on August 13, 2025, if their demands are not met. The attackers have published a countdown timer on their blog, increasing the pressure on the German company. At this time, the specific types of data that were allegedly exfiltrated during the security incident have not been detailed by the group. The claim marks another instance of a well-established European industrial company being targeted by organized cybercriminals.\nTags:\ncyberattack\ndata-breach\nGermany\nglobal\nransomware\nRUKU"
    },
    {
        "Title": "Cegid Suffers Data Breach – 74,000 Customer Records Allegedly Leaked",
        "Link": "https://dailydarkweb.net/cegid-suffers-data-breach-74000-customer-records-allegedly-leaked/",
        "Summary": "Cegid, a major European leader in cloud-based business management solutions, is at the center of a significant data breach allegation. Founded in 1983 and headquartered in Lyon, France, Cegid has grown into a global powerhouse, providing critical software for finance, ERP, human resources, and payroll to over 750,000 clients in 130 countries. The company, a [&#8230;]",
        "Date": "2025-07-30",
        "Content": "Cegid, a major European leader in cloud-based business management solutions, is at the center of a significant data breach allegation. Founded in 1983 and headquartered in Lyon, France, Cegid has grown into a global powerhouse, providing critical software for finance, ERP, human resources, and payroll to over 750,000 clients in 130 countries. The company, a vital technology partner for businesses of all sizes, reported revenues of nearly €1 billion in 2024. Given its role in handling sensitive financial and employee data, the claims of a breach are particularly alarming.\nThe news broke on a dark web forum today, July 30, 2025, where a threat actor announced the sale of a database allegedly exfiltrated from Cegid’s systems. The seller claims the database contains 74,000 customer records, with a focus on clients in France, Belgium, and Spain. The exposure of such information could lead to sophisticated phishing campaigns, identity theft, and financial fraud against the affected companies and individuals.\nAccording to the forum post, the compromised data is extensive and highly sensitive. The threat actor listed the following data types as being part of the leak:\nCustomer ID\nCustomer Reference\nCompany Name\nContact Person’s First and Last Name\nLast Connection Date\nPhone Number\nEmail Address\nRIB (Bank Account Identity Details)\nBank Invoice\nTags:\nBelgium\nCegid\nCyberSecurity\ndark web\ndata-breach\nERP\nFrance\nPII\nSoftware\nSpain"
    },
    {
        "Title": "Dollar Tree Allegedly Hit by INC Ransom – 1.2 TB of Sensitive Data Exposed",
        "Link": "https://dailydarkweb.net/dollar-tree-allegedly-hit-by-inc-ransom-1-2-tb-of-sensitive-data-exposed/",
        "Summary": "The INC Ransom group has allegedly breached Dollar Tree, a major Fortune 200 company. Dollar Tree is a prominent discount retail giant operating over 16,700 stores across the United States and Canada under the brands Dollar Tree, Family Dollar, and Dollar Tree Canada. The threat actors claim to have stolen 1.2TB of data during the [&#8230;]",
        "Date": "2025-07-30",
        "Content": "The INC Ransom group has allegedly breached Dollar Tree, a major Fortune 200 company. Dollar Tree is a prominent discount retail giant operating over 16,700 stores across the United States and Canada under the brands Dollar Tree, Family Dollar, and Dollar Tree Canada. The threat actors claim to have stolen 1.2TB of data during the attack and have begun leaking files as proof. This incident also appears to heavily involve data from 99 Cents Only Stores, whose intellectual property and store leases were recently acquired by Dollar Tree following the former’s bankruptcy.\nThe data samples allegedly leaked by the ransomware group suggest a severe breach impacting both corporate and personal information. The exposure of these files could lead to significant privacy violations for employees and poses serious legal and reputational risks for the retail corporation. The type of compromised data allegedly includes a vast array of sensitive documents.\nThe allegedly leaked data includes:\nEmployee Personally Identifiable Information (PII), including a passport card\nConfidential employment offer letters containing salary information\nHuman Resources documents, such as associate separation forms\nInternal records detailing harassment and discrimination allegations\nConfidential legal communications with law firms\nSigned Non-Disclosure Agreements (NDAs)\nInternal company handbooks and policies\nTags:\n99 Cents Only Stores\nCyberSecurity\ndata-breach\nDollar Tree\nINC Ransom\nPII\nRetail"
    },
    {
        "Title": "Lebanese Auto Supplier Jean Bakhos Allegedly Suffers Data Leak",
        "Link": "https://dailydarkweb.net/lebanese-auto-supplier-jean-bakhos-allegedly-suffers-data-leak/",
        "Summary": "A significant data breach has allegedly struck Jean Bakhos Spare Parts, a prominent automotive parts dealer based in Beirut, Lebanon. The company, which specializes in parts for high-end vehicle brands such as Mercedes, BMW, Range Rover, Mini, Land Rover, and Smart, has become the latest victim of a cyberattack. The incident came to light after [&#8230;]",
        "Date": "2025-07-30",
        "Content": "A significant data breach has allegedly struck Jean Bakhos Spare Parts, a prominent automotive parts dealer based in Beirut, Lebanon. The company, which specializes in parts for high-end vehicle brands such as Mercedes, BMW, Range Rover, Mini, Land Rover, and Smart, has become the latest victim of a cyberattack. The incident came to light after a threat actor posted an advertisement on a dark web forum, offering a comprehensive customer database for sale.\nThe cybercriminal claims the database contains 213,000 non-duplicate entries, exposing a vast amount of sensitive customer and vehicle information. According to the forum post, the compromised data is in a CSV format and includes highly specific details that could be exploited by malicious actors for various fraudulent activities, including targeted phishing, identity theft, and vehicle-related scams.\nThe leaked information allegedly includes the following details for each customer:\nFull Name\nAddress\nVehicle Make and Model\nYear of Production\nModel Generation\nVehicle Identification Number (VIN)\nPhone Number\nTags:\nAutomotive\nCyberSecurity\ndata-breach\nJean Bakhos\nleaked data\nLebanon"
    }
]