[
    {
        "Title": "Threat Actor Mimo Targets Magento and Docker to Deploy Crypto Miners and Proxyware",
        "Link": "https://thehackernews.com/2025/07/threat-actor-mimo-targets-magento-and.html",
        "Summary": "The threat actor behind the exploitation of vulnerable Craft Content Management System (CMS) instances has shifted its tactics to target Magento CMS and misconfigured Docker instances.\nThe activity has been attributed to a threat actor tracked as Mimo (aka Hezb), which has a long history of leveraging N-day security flaws in various web applications to deploy cryptocurrency miners.\n\"Although",
        "Date": "2025-07-23",
        "Content": "The threat actor behind the exploitation of vulnerable Craft Content Management System (CMS) instances has shifted its tactics to target Magento CMS and misconfigured Docker instances.\nThe activity has been attributed to a threat actor tracked as\nMimo\n(aka Hezb), which has a long history of leveraging N-day security flaws in various web applications to deploy cryptocurrency miners.\n\"Although Mimo's primary motivation remains financial, through cryptocurrency mining and bandwidth monetization, the sophistication of their recent operations suggests potential preparation for more lucrative criminal activities,\" Datadog Security Labs\nsaid\nin a report published this week.\nMimo's exploitation of CVE-2025-32432, a critical security flaw in Craft CMS, for cryptojacking and proxyjacking was\ndocumented\nby Sekoia in May 2025.\nNewly observed attack chains associated with the threat actor involve the abuse of undetermined PHP-FPM vulnerabilities in Magento e-commerce installations to obtain initial access, and then using it to drop\nGSocket\n, a legitimate open-source penetration testing tool, to\nestablish persistent access\nto the host by means of a reverse shell.\n\"The initial access vector is PHP-FPM command injection via a Magento CMS plugin, indicating that Mimo possesses multiple exploit capabilities beyond previously observed adversarial tradecraft,\" researchers Ryan Simon, Greg Foss, and Matt Muir said.\nIn an attempt to sidestep detection, the GSocket binary masquerades as a legitimate or kernel-managed thread so that it blends in with other processes that may be running on the system.\nAnother notable technique employed by the attackers is the use of in-memory payloads using\nmemfd_create()\nso as to launch an ELF binary loader called \"4l4md4r\" without leaving any trace on disk. The loader is then responsible for deploying the IPRoyal proxyware and the XMRig miner on the compromised machine but not before modifying the \"/etc/ld.so.preload\" file to inject a rootkit to conceal the presence of these artifacts.\nThe distribution of a miner and\nproxyware\nunderscores a two-pronged approach adopted by Mimo to maximize financial gain. The distinct revenue generation streams ensure that compromised machines' CPU resources are hijacked to mine cryptocurrency, while the victims' unused internet bandwidth is monetized for illicit residential proxy services.\n\"Furthermore, the use of proxyware, which typically consumes minimal CPU, enables stealthy operation that prevents detection of the additional monetization even if the crypto miner's resource usage is throttled,\" the researchers said. \"This multi-layered monetization also enhances resilience: even if the crypto miner is detected and removed, the proxy component may remain unnoticed, ensuring continued revenue for the threat actor.\"\nDatadog said it also observed the threat actors abusing misconfigured Docker instances that are publicly accessible to spawn a new container, within which a malicious command is executed to fetch an additional payload from an external server and execute it.\nWritten in Go, the modular malware comes fitted with capabilities to achieve persistence, conduct file system I/O operations, terminate processes, perform in-memory execution. It also serves as a dropper for GSocket and IPRoyal, and attempts to propagate to other systems via SSH brute-force attacks.\n\"This demonstrates the threat actor's willingness to compromise a diverse range of services – not just CMS providers – to achieve their objectives,\" Datadog said.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "New Coyote Malware Variant Exploits Windows UI Automation to Steal Banking Credentials",
        "Link": "https://thehackernews.com/2025/07/new-coyote-malware-variant-exploits.html",
        "Summary": "The Windows banking trojan known as Coyote has become the first known malware strain to exploit the Windows accessibility framework called UI Automation (UIA) to harvest sensitive information.\n\"The new Coyote variant is targeting Brazilian users, and uses UIA to extract credentials linked to 75 banking institutes' web addresses and cryptocurrency exchanges,\" Akamai security researcher Tomer",
        "Date": "2025-07-23",
        "Content": "The Windows banking trojan known as\nCoyote\nhas become the first known malware strain to exploit the Windows accessibility framework called\nUI Automation\n(UIA) to harvest sensitive information.\n\"The new Coyote variant is targeting Brazilian users, and uses UIA to extract credentials linked to 75 banking institutes' web addresses and cryptocurrency exchanges,\" Akamai security researcher Tomer Peled\nsaid\nin an analysis.\nCoyote, first revealed by Kaspersky in 2024, is\nknown\nfor targeting Brazilian users. It comes with capabilities to log keystrokes, capture screenshots, and serve overlays on top of login pages associated with financial enterprises.\nPart of the Microsoft .NET Framework, UIA is a legitimate feature offered by Microsoft to allow screen readers and other assistive technology products to programmatically access user interface (UI) elements on a desktop.\nThat UIA can be a potential pathway for abuse, including data theft, was previously\ndemonstrated\nas a proof-of-concept (PoC) by Akamai in December 2024, with the web infrastructure company noting that it could be used to steal credentials or execute code.\nIn some ways, Coyote's latest modus operandi mirrors the various\nAndroid banking trojans\nthat have been spotted in the wild, which often weaponize the operating system's accessibility services to obtain valuable data.\nAkamai's analysis found that the malware invokes the GetForegroundWindow() Windows API in order to extract the active window's title and compare it against a hard-coded list of web addresses belonging to targeted banks and cryptocurrency exchanges.\n\"If no match is found Coyote will then use UIA to parse through the UI child elements of the window in an attempt to identify browser tabs or address bars,\" Peled explained. \"The content of these UI elements will then be cross-referenced with the same list of addresses from the first comparison.\"\nAs many as 75 different financial institutions are targeted by the latest version of the malware, up from 73\ndocumented\nby Fortinet FortiGuard Labs earlier this January.\n\"Without UIA, parsing the sub-elements of another application is a nontrivial task,\" Akamai added. \"To be able to effectively read the contents of sub-elements within another application, a developer would need to have a very good understanding of how the specific target application is structured.\"\n\"Coyote can perform checks, regardless of whether the malware is online or operating in an offline mode. This increases the chances of successfully identifying a victim's bank or crypto exchange and stealing their credentials.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Kerberoasting Detections: A New Approach to a Decade-Old Challenge",
        "Link": "https://thehackernews.com/2025/07/kerberoasting-detections-new-approach.html",
        "Summary": "Security experts have been talking about Kerberoasting for over a decade, yet this attack continues to evade typical defense methods. Why? It’s because existing detections rely on brittle heuristics and static rules, which don’t hold up for detecting potential attack patterns in highly variable Kerberos traffic. They frequently generate false positives or miss “low-and-slow” attacks altogether.&",
        "Date": "2025-07-23",
        "Content": "Security experts have been talking about\nKerberoasting\nfor over a decade, yet this attack continues to evade typical defense methods. Why? It's because existing detections rely on brittle heuristics and static rules, which don't hold up for detecting potential attack patterns in highly variable Kerberos traffic. They frequently generate false positives or miss \"low-and-slow\" attacks altogether.\nIs there a better and more accurate way for modern organizations to detect subtle anomalies within irregular Kerberos traffic?\nThe BeyondTrust research team\nsought to answer this question by combining security research insights with advanced statistics. This article offers a high-level look into the driving forces behind our research and our process of developing and testing a new statistical framework for improving Kerberos anomaly detection accuracy and reducing false positives.\nAn Introduction to Kerberoasting Attacks\nKerberoasting attacks take advantage of the Kerberos network authentication protocol within Windows Active Directory environments. The Kerberos authentication process works as follows:\n1. AS-REQ:\nA user logs in and requests a Ticket Granting Ticket (TGT).\n2. AS-REP:\nThe Authentication Server verifies the user's credentials and issues a TGT.\n3. TGS-REQ:\nWhen the user wants to request access to a service, they request a Ticket Granting Service Ticket (TGS) using the previously received TGT. This action is recorded as Windows Event 4769\n[1]\non the domain controller.\n4. TGS-REP:\nThe TGS verifies the request and issues a TGS, which is encrypted using the password hash of the service account associated with the requested service.\n5. KRB-AP-REQ:\nFor the user to authenticate against a service using the TGS ticket, they send it to the application server, which then takes various actions to verify the user's legitimacy and allow access to the requested service.\nAttackers aim to exploit this process because Kerberos service tickets are encrypted with the hash of the service account's password. To take advantage of Kerberos tickets, attackers first leverage LDAP (Lightweight Directory Access Protocol) to query the directory for any AD accounts that have Service Principal Names (SPNs) associated with them. An attacker will then request Ticket Granting Service (TGS) tickets for these accounts, which can be done without any administrative rights. Once they have requested these service tickets, they can crack the hash offline to uncover the credentials of the service account. Access to a service account can then enable the attacker to move laterally, escalate privileges, or exfiltrate data.\nThe Shortcomings of Typical Heuristic Methods\nMany organizations have heuristic-based detection methods in place to flag irregular Kerberos behavior. One common method is volume-based detection, which can flag a spike in TGS request activity from a single account. If an attacker requests TGS tickets for all service principal names they can find using LDAP, this detection method will likely identify this spike as suspicious activity. Another method, encryption-type analysis, can detect if an attacker attempts to downgrade the encryption of the requested TGS tickets from the default AES to a weaker type, such as RC4 or DES, in hopes of making their own job easier when they start to\ncrack the hash\n.\nWhile both of these static rule-based methods can work in some cases, they produce a notorious number of false positives. Additionally, they don't factor in the user's behaviors and irregularities unique to each organization's domain configurations.\nA Statistical Model for Detecting Kerberoasting Attacks\nWith these limitations in mind, the BeyondTrust research team sought to find a method that would both improve anomaly detection capabilities and reduce false positives. We found statistical modeling to be the best method, in which a model would be created that could estimate probability distribution based on contextual data patterns. The ability to predict normal user behavior would be key to flagging any abnormalities.\nOur team laid out four constraints for our prospective statistical model, based on existing Kerberoasting research\n[2, 3]\n:\nExplainability\n: The ability to interpret the output with respect to a recognized, normalized, and easy to explain and track measure.\nUncertainty\n: The ability to reflect sample size and confidence in estimates, as opposed to the output being a simple binary indicator.\nScalability\n: The ability to limit the amount of cloud computing and data storage needed for updating model parameters per run.\nNonstationarity\n: The capacity to adapt to trends or other data changes over time, and incorporating these shifts into how anomalies are defined\nThe BeyondTrust research team worked to build out a model that aligned with the above constraints, eventually developing a model that groups similar ticket-request patterns into distinct clusters and then uses histogram bins to track the frequency of certain activity levels over time.\nThe goal\n: to learn what 'normal' looks like for each cluster. We aimed to reduce false positives by grouping these like data patterns together, as events that could look suspicious in isolation would become normal when compared to similar data patterns.\nKerberoasting Statistical Model: Results\nThe team then tested the model across 50 days of data or roughly 1,200 hourly evaluation periods. The model's results are as follows:\nConsistently achieved processing times under 30 seconds, including histogram updates, clustering operations, score calculations, percentile ranking, and result storage.\nIdentified six anomalies with notable temporal patterns, such as uncorrelated spikes in narrow time windows, increased variance, and significant temporary shifts. Two were identified as penetration tests, one was the team's simulated Kerberoasting attack, and three were related to large changes in Active Directory infrastructure that caused inadvertent spikes in Kerberos service ticket requests.\nHandled extreme variability in heavy-tailed accounts exceptionally well, appropriately down-weighting anomaly scores after observing just two consecutive spikes through dynamic sliding window updates and real-time percentile ranking. This level of adaptability is notably faster than standard anomaly detection methods\nAfter conducting this research, the BeyondTrust research team was able to report early success by combining security expertise with advanced statistical techniques. Because there are inherent limitations of pure anomaly detection methodologies, collaboration between experts in security and data science was necessary for this success. While statisticians can create an adaptive model that takes variable behaviors into consideration, security researchers can offer needed context for identifying notable features within flagged events.\nConclusion\nAltogether, this research proves that, even when considering decade-old attack patterns like Kerberoasting, there are clear paths forward in iterating and evolving on detection and response capabilities. Alongside considering the possibilities of novel detection capabilities, such as the ones described in this research, teams should also evaluate proactive identity security measures that reduce Kerberoasting risks before they ever occur.\nSome solutions with\nidentity threat detection and respon\nse (ITDR) capabilities, such as\nBeyondTrust Identity Security Insights\n, can help teams proactively identify accounts that are vulnerable to Kerberoasting due to improper use of service principals and the use of weak ciphers.\nPrecise, proactive measures, combined with smarter, more context-aware detection models, are essential as security teams continuously work to cut through noise and stay ahead of growing complexity and scale.\nAbout the Authors:\nChristopher Calvani, Associate Security Researcher, BeyondTrust\nChristopher Calvani\nis a Security Researcher on BeyondTrust's research team, where he blends vulnerability research with detection engineering to help customers stay ahead of emerging threats. A recent graduate of the Rochester Institute of Technology with a B.S. in Cybersecurity, Christopher previously supported large‑scale infrastructure at Fidelity Investments as a Systems Engineer intern and advanced DevSecOps practices at Stavvy.\nCole Sodja, Principal Data Scientist, BeyondTrust\nCole Sodja\nis a Principal Data Scientist at BeyondTrust with over 20 years of applied statistics experience across major technology companies including Amazon and Microsoft. He specializes in time series analysis, bringing deep expertise in forecasting, changepoint detection, and behavioral monitoring to complex business challenges.\nReferences\nEvent ID 4769: A Kerberos service ticket was requested (\nMicrosoft Learn\n)\nKerberos Authentication in Windows: A Practical Guide to Analyzing the TGT Exchange (\nSemantic Scholar PDF\n)\nKerberos-based Detection of Lateral Movement in Windows Environments (\nScitepress 2020 Conference Paper\n)\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Google Launches OSS Rebuild to Expose Malicious Code in Widely Used Open-Source Packages",
        "Link": "https://thehackernews.com/2025/07/google-launches-oss-rebuild-to-expose.html",
        "Summary": "Google has announced the launch of a new initiative called OSS Rebuild to bolster the security of the open-source package ecosystems and prevent software supply chain attacks.\n\"As supply chain attacks continue to target widely-used dependencies, OSS Rebuild gives security teams powerful data to avoid compromise without burden on upstream maintainers,\" Matthew Suozzo, Google Open Source Security",
        "Date": "2025-07-23",
        "Content": "Google has announced the launch of a new initiative called\nOSS Rebuild\nto bolster the security of the open-source package ecosystems and prevent software supply chain attacks.\n\"As supply chain attacks continue to target widely-used dependencies, OSS Rebuild gives security teams powerful data to avoid compromise without burden on upstream maintainers,\" Matthew Suozzo, Google Open Source Security Team (GOSST),\nsaid\nin a blog post this week.\nThe project aims to provide build provenance for packages across the Python Package Index (Python), npm (JS/TS), and Crates.io (Rust) package registries, with plans to extend it to other open-source software development platforms.\nWith OSS Rebuild, the idea is to leverage a combination of declarative build definitions, build instrumentation, and network monitoring capabilities to produce trustworthy security metadata, which can then be used to validate the package's origin and ensure it has not been tampered with.\n\"Through automation and heuristics, we determine a prospective build definition for a target package and rebuild it,\" Google said. \"We semantically compare the result with the existing upstream artifact, normalizing each one to remove instabilities that cause bit-for-bit comparisons to fail (e.g., archive compression).\"\nOnce the package is reproduced, the build definition and outcome is published via\nSLSA Provenance\nas an attestation mechanism that allows users to reliably verify its origin, repeat the build process, and even customize the build from a known-functional baseline.\nIn scenarios where automation isn't able to fully reproduce the package, OSS Rebuild offers a manual build specification that can be used instead.\nOSS Rebuild, the tech giant noted, can help detect different categories of supply chain compromises, including -\nPublished packages that contain code not present in the public source repository (e.g.,\n@solana/web3.js\n)\nSuspicious build activity (e.g.,\ntj-actions/changed-files\n)\nUnusual execution paths or suspicious operations embedded within a package that are challenging to identify through manual review (e.g.,\nXZ Utils\n)\nBesides securing the software supply chain, the solution can improve Software Bills of Materials (SBOMs), speed up vulnerability response, strengthen package trust, and eliminate the need for CI/CD platforms to be in charge of an organization's package security.\n\"Rebuilds are derived by analyzing the published metadata and artifacts and are evaluated against the upstream package versions,\" Google\nsaid\n. \"When successful, build attestations are published for the upstream artifacts, verifying the integrity of the upstream artifact and eliminating many possible sources of compromise.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "CISA Orders Urgent Patching After Chinese Hackers Exploit SharePoint Flaws in Live Attacks",
        "Link": "https://thehackernews.com/2025/07/cisa-orders-urgent-patching-after.html",
        "Summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA), on July 22, 2025, added two Microsoft SharePoint flaws, CVE-2025-49704 and CVE-2025-49706, to its Known Exploited Vulnerabilities (KEV) catalog, based on evidence of active exploitation.\nTo that end, Federal Civilian Executive Branch (FCEB) agencies are required to remediate identified vulnerabilities by July 23, 2025.\n\"CISA is",
        "Date": "2025-07-23",
        "Content": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA), on July 22, 2025,\nadded\ntwo Microsoft SharePoint flaws, CVE-2025-49704 and CVE-2025-49706, to its Known Exploited Vulnerabilities (\nKEV\n) catalog, based on evidence of active exploitation.\nTo that end, Federal Civilian Executive Branch (FCEB) agencies are required to remediate identified vulnerabilities by July 23, 2025.\n\"CISA is aware of active exploitation of a spoofing and RCE vulnerability chain involving CVE-2025-49706 and CVE-2025-49704, enabling unauthorized access to on-premise SharePoint servers,\" the agency\nsaid\nin an updated advisory.\nThe inclusion of the two shortcomings, a spoofing vulnerability and a remote code execution vulnerability collectively tracked as ToolShell, to the KEV catalog comes after Microsoft\nrevealed\nthat Chinese hacking groups like Linen Typhoon and Violet Typhoon leveraged these flaws to breach on-premises SharePoint servers since July 7, 2025.\nAs of writing, the tech giant's own advisories only list CVE-2025-53770 as being exploited in the wild. What's more, it describes the four flaws as below -\nCVE-2025-49704 – SharePoint Remote Code Execution\nCVE-2025-49706 – SharePoint Post-auth Remote Code Execution\nCVE-2025-53770 – SharePoint ToolShell Authentication Bypass and Remote Code Execution\nCVE-2025-53771 – SharePoint ToolShell Path Traversal\nThe fact that CVE-2025-53770 is both an authentication bypass and a remote code execution bug indicates that CVE-2025-53771 is not necessary to build the exploit chain. CVE-2025-53770 and CVE-2025-53771 are assessed to be patch bypasses for CVE-2025-49704 and CVE-2025-49706, respectively.\n\"The root cause [of CVE-2025-53770] is a combination of two bugs: An authentication bypass (CVE-2025-49706) and an insecure deserialization vulnerability (CVE-2025-49704),\" the Akamai Security Intelligence Group\nsaid\n.\nThe attack chains observed so far entail the exploitation of SharePoint flaws to deploy a web shell that allows the threat actors to retrieve and steal MachineKey data. Symantec said it also identified post-exploitation activity in which adversaries ran an encoded PowerShell command to download a file named \"client.exe\" from an external server and save it locally as \"debug.js.\"\n\"The executable was likely renamed as debug.js in order to make it look benign and avoid raising suspicions,\" the Broadcom-owned company\nsaid\n, adding the binary is then used to run a Windows batch script that captures system information and cryptographic secrets.\nWhen reached for comment regarding the exploitation status of CVE-2025-53771 and other flaws, a Microsoft spokesperson told The Hacker News that the information published in its advisories is correct \"at the time of original publication\" and that it does not typically update post-release.\n\"Microsoft also assists CISA with the Known Exploited Vulnerabilities Catalog which provides regularly updated information on exploited vulnerabilities,\" the spokesperson added.\nThe development comes as watchTowr Labs told the publication that it has internally devised a method exploiting CVE-2025-53770 such that it bypasses Antimalware Scan Interface (AMSI), a mitigation step outlined by Microsoft to prevent unauthenticated attacks.\n\"This has allowed us to continue identifying vulnerable systems even after mitigations like AMSI have been applied,\" watchTowr CEO Benjamin Harris said. \"AMSI was never a silver bullet, and this outcome was inevitable. But we're concerned to hear that some organizations are choosing to 'enable AMSI' instead of patching. This is a very bad idea.\"\n\"Now that exploitation has been linked to nation-state actors, it would be naive to think they could leverage a SharePoint zero-day but somehow not bypass AMSI. Organizations must patch. Should go without saying – all the public PoCs will trigger AMSI, and mislead organizations into believing the mitigations are comprehensive/the host is no longer vulnerable. This would be incorrect.\"\nUpdate\nWhen contacted for comment, CISA said it's still early in the incident response, adding it's continually assessing the scope and impact associated with the SharePoint Server flaws.\n\"CISA continues to work in lockstep with Microsoft, as well as federal and other partners, to address and mitigate the active exploitation of multiple vulnerabilities impacting Microsoft on-site SharePoint servers,\" said Acting Executive Assistant Director for Cybersecurity, Chris Butera, in a statement shared with The Hacker News.\nThe agency also said it's aware of federal agencies and State, Local, Tribal, and Territorial (SLTT) partners affected by the activity, and that it's working with them to assess the scope and mitigate the risk as appropriate. According to latest estimates, about 400 government agencies, corporations, and other entities\nhave been compromised\n.\n(The story was updated after publication to include a response from CISA.)\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "CISA Warns: SysAid Flaws Under Active Attack Enable Remote File Access and SSRF",
        "Link": "https://thehackernews.com/2025/07/cisa-warns-sysaid-flaws-under-active.html",
        "Summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) added two security flaws impacting SysAid IT support software to its Known Exploited Vulnerabilities (KEV) catalog, based on evidence of active exploitation.\nThe vulnerabilities in question are listed below -\n\nCVE-2025-2775 (CVSS score: 9.3) - An improper restriction of XML external entity (XXE) reference vulnerability in the",
        "Date": "2025-07-23",
        "Content": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA)\nadded\ntwo security flaws impacting SysAid IT support software to its Known Exploited Vulnerabilities (\nKEV\n) catalog, based on evidence of active exploitation.\nThe vulnerabilities in question are listed below -\nCVE-2025-2775\n(CVSS score: 9.3) - An improper restriction of XML external entity (XXE) reference vulnerability in the Checkin processing functionality, allowing for administrator account takeover and file read primitives\nCVE-2025-2776\n(CVSS score: 9.3) - An improper restriction of XML external entity (XXE) reference vulnerability in the Server URL processing functionality, allowing for administrator account takeover and file read primitives\nBoth shortcomings were\ndisclosed\nby watchTowr Labs researchers Sina Kheirkhah and Jake Knott back in May, alongside\nCVE-2025-2777\n(CVSS score: 9.3), a pre-authenticated XXE within the /lshw endpoint.\nThe three vulnerabilities were addressed by SysAid in the on-premise version 24.4.60 build 16 released in early March 2025.\nThe cybersecurity firm noted that the vulnerabilities could allow attackers to inject unsafe XML entities into the web application, resulting in a Server-Side Request Forgery (SSRF) attack, and in some cases, remote code execution when chained with\nCVE-2024-36394\n, a command injection flaw revealed by CyberArk last June.\nIt's currently not known how CVE-2025-2775 and CVE-2025-2776 are being exploited in real-world attacks. Nor is any information available regarding the identity of the threat actors, their end goals, or the scale of these efforts.\nTo safeguard against the active threat, Federal Civilian Executive Branch (FCEB) agencies are required to apply the necessary fixes by August 12, 2025.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Brave blocks Windows Recall from screenshotting your browsing activity",
        "Link": "https://www.bleepingcomputer.com/news/security/brave-blocks-windows-recall-from-screenshotting-your-browsing-activity/",
        "Summary": "Brave Software says its privacy-focused browser will block Microsoft's Windows Recall from capturing screenshots of Brave windows by default to protect users' privacy. [...]",
        "Date": "2025-07-23",
        "Content": "Brave Software says its privacy-focused browser will block Microsoft's Windows Recall from capturing screenshots of Brave windows by default to protect users' privacy.\nWindows Recall is an opt-in Windows feature that takes screenshots of active windows every few seconds, analyzes them, and enables Windows 11 users to search for text within the snapshots using natural language. The goal is to make it easy for users to quickly find information about past activities in Windows.\nHowever, the feature has\nsparked widespread criticism\nfor potentially exposing sensitive data of Windows users, including passwords, emails, health records, and financial information.\nMicrosoft later increased security by providing methods for software providers to opt out of Windows Recall and by securing data with Windows Hello Enhanced Sign-in Security (ESS).\nBrave has now decided to proactively enable a technical feature that prevents Recall from capturing the contents of its windows.\n\"Given Brave's focus on privacy-maximizing defaults and what is at stake here (your entire browsing history), we have proactively disabled Recall for all Brave tabs,\" reads a new\nBrave announcement\n.\n\"We think it's vital that your browsing activity on Brave does not accidentally end up in a persistent database, which is especially ripe for abuse in highly-privacy-sensitive cases such as intimate partner violence.\"\nA\nBrave GitHub issue\nexplains that developers have utilized Microsoft's\nSetInputScope API\nand set the input scope to IS_PRIVATE for all browser windows. This tells Windows that the content should not be captured or indexed by Recall.\n\"Microsoft says that a Web browser can use SetInputScope to set the scope to be IS_PRIVATE to make sure that Recall doesn't save the user's browsing history,\" reads the Brave GitHub issue.\n\"We can force that to be true for all windows in renderer_widget_host_view.\"\nThe change is already live in Brave Nightly builds and will roll out to stable releases in the coming weeks. For those who wish to use Recall, you can enable it through Brave's settings.\nIn May, encrypted messenger\nSignal also blocked Windows Recall\nby enabling the DRM management flag in the program, which prevents Microsoft's software from taking screenshots of the program.\nHowever, this method could cause issues with accessibility software, such as screen readers, so Signal also provides a way to turn off this setting.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nMicrosoft confirms Family Safety blocks Google Chrome from launching\nProton launches privacy-respecting encrypted AI assistant Lumo\nWindows 11 KB5062660 update brings new 'Windows Resilience' features\nMicrosoft mistakenly tags Windows Firewall error log bug as fixed\nWindows 11 gets new Black Screen of Death, auto recovery tool"
    },
    {
        "Title": "Proton launches privacy-respecting encrypted AI assistant Lumo",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/proton-launches-privacy-respecting-encrypted-ai-assistant-lumo/",
        "Summary": "Proton has launched a new tool called Lumo, offering a privacy-first AI assistant that does not log user conversations and doesn't use their prompts for training. [...]",
        "Date": "2025-07-23",
        "Content": "Proton has launched a new tool called Lumo, offering a privacy-first AI assistant that does not log user conversations and doesn't use their prompts for training.\nProton is a Swiss company behind proven privacy and security tools and services, including Proton Mail, Proton VPN, and Proton Drive. In June 2024, it transitioned to a\nnon-profit structure\n, putting user privacy over profits.\nThe introduction of Lumo aligns with this mission, as Proton claims this AI tool is designed to provide help without tracking users, retaining or sharing their data, and hiding risky functions in closed-source code.\nInstead, Lumo is based on open-source large language models (LLMs) and utilizes Proton's open-source encryption scheme. Proton also released the tool's complete source code, so it's fully transparent to the community.\nLumo's default setting is not to search online, delete all chats upon closing, and not store conversations on the server-side.\n\"Other AI companies keep a record of all your conversations on their servers, leaving this information vulnerable to data leaks or exploitation for profit,\"\nreads the announcement\n.\n\"Lumo doesn't keep any logs of your conversations server side, and any chats you save can only be decrypted on your device.\"\nLumo's interface resembles those of mainstream LLM services, while the tool supports file uploads with full encryption support.\nLumo's main interface\nSource: Proton\nFor ultimate security, direct uploads from\nProton Drive\nare also supported.\nUploading documents on Lumo\nSource: Proton\nLumo's infrastructure is located in Europe, where the GDPR applies, so no sensitive data is transmitted to jurisdictions with weaker data protection regulations.\nLumo is available at\nlumo.proton.me\nor as an app for\nAndroid\nand iOS devices.\nLumo on mobile\nSource: Proton\nThe service is offered via three account tiers, summarized as follows:\nGuest\n: No need for a Proton account, but limited to a certain number of questions weekly. Does not offer the option to retain conversations.\nFree\n: Proton account required. Adds file uploads, increases question number limits, and offers basic chat history encryption.\nPlus\n: Costs $12.99/month. Unlocks all features, including unlimited chats, extended encrypted chat history, unlimited favorite chats, and the ability to upload multiple large files.\nAt launch, Lumo supports and responds in English, French, German, Spanish, and Italian, with additional languages to be added gradually.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nOpenAI confirms threat actors use ChatGPT to write malware\nZero-click AI data leak flaw uncovered in Microsoft 365 Copilot\nChatGPT is rolling out 'personality' toggles to become your assistant\nChatGPT's GPT-5-reasoning-alpha model spotted ahead of launch\nOpenAI: GPT-5 is coming, \"we'll see\" if it creates a shockwave"
    },
    {
        "Title": "Hackers fooled Cognizant help desk, says Clorox in $380M cyberattack lawsuit",
        "Link": "https://www.bleepingcomputer.com/news/security/hackers-fooled-cognizant-help-desk-says-clorox-in-380m-cyberattack-lawsuit/",
        "Summary": "Clorox is suing IT giant Cognizant for gross negligence, alleging it enabled a massive August 2023 cyberattack by resetting an employee's password for a hacker without first verifying their identity. [...]",
        "Date": "2025-07-23",
        "Content": "Clorox is suing IT giant Cognizant for gross negligence, alleging it enabled a massive August 2023 cyberattack by resetting an employee's password for a hacker without first verifying their identity.\nThe incident was first made public in September 2023, reportedly carried out by hackers associated with Scattered Spider, who utilized a social engineering attack to breach the company.\nThe lawsuit says Cognizant provided IT services to Clorox, including service desk support and identity management, which was the point of compromise that led to a\ndevastating and costly cyberattack\nfor the company.\nClorox is a major consumer goods company, best known for household cleaning products, bleach, disinfectants, and personal care items. Cognizant is a global IT services and consulting company, providing cloud services, software development, and cybersecurity.\nAccording to the complaint, from 2013 to 2023, Cognizant was contracted by Clorox to handle its IT operations.\n\"Cognizant provided the service desk (\"Service Desk\") that Clorox employees could contact when they needed password recovery or reset assistance,\" reads the complaint shared with BleepingComputer.\n\"Cognizant's operation of the Service Desk came with a simple, common-sense requirement: never reset anyone's credentials without properly authenticating them first. Clorox made this easy for Cognizant by providing them with straight-forward procedures to follow whenever providing credential recovery or reset assistance.\"\nHowever, the complaint alleges that on August 11, 2023, recordings show that a cybercriminal called Cognizant's Service Desk multiple times, pretending to be a Clorox representative requesting password and multi-factor authentication resets.\n\"At no point during any of the calls did the Agent verify that the caller was in fact Employee 1. At no point did the Agent follow Clorox's credential support procedures—either the pre-2023 procedure or the January 2023 update—before changing the password for the cybercriminal. The Agent further reset Employee 1's MFA credentials multiple times without any identity verification at all. And at no point did the Agent send the required emails to the employee or the employee's manager to alert them of the password reset. \"Clorox claims in the complaint.\nThis type of social engineering attack has become the hallmark of Scattered Spider attacks, recently used in UK retail attacks on\nMarks & Spencer\nand\nCo-op\n.\nAfter allegedly failing to verify the caller's actual identity, Cognizant reset the credentials and multi-factor authentication (MFA) for the hacker, granting them access to Clorox's IT network.\nTo make matters worse, Clorox alleges that the threat actors used the same playbook to reset the password and MFA for another employee who worked in IT security, which was done without verification once again. This reportedly gave the attackers privileged access to the network, which they used to spread to further devices.\nTranscript of call between hacker and service desk\nSource: Clorox complaint against Cognizant\nClorox states that Cognizant's actions paralyzed its corporate network, halted manufacturing, and caused widespread product shortages and business interruption.\nIn addition to this, Clorox described Cognizant's response and recovery support as overly incompetent, resulting in delays in the application of containment measures, failure to shut down compromised accounts, and sending underqualified personnel on premises.\n\"The resulting Cyberattack was debilitating. It paralyzed Clorox's corporate network and crippled business operations,\"\ndescribes the legal complaint\n.\n\"And to make matters worse, when Clorox called on Cognizant to provide incident response and disaster recovery support services, Cognizant botched its response and compounded the damage it had already caused.\"\nClorox's complaint alleges breach of contract due to Cognizant's failure to meet ITSA obligations, breach of good faith and fair dealing, gross negligence, and intentional misrepresentation of staff training on the client's credential reset procedures.\nFor these actions, which resulted in hundreds of millions of dollars in lost sales due to business disruption, as well as reputational damage with long-term consequences, Clorox is seeking $49 million in direct remediation damages and $380,000,000 in total damages.\nBleepingComputer attempted to contact Cognizant for a comment on the lawsuit, but the listed press address was returned with a delivery failure.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nGoogle sues to disrupt BadBox 2.0 botnet infecting 10 million devices\nU.S. Army soldier pleads guilty to extorting 10 tech, telecom firms\nFour arrested in UK over M&S, Co-op, Harrods cyberattacks\nTreasury sanctions North Korean over IT worker malware scheme\nUS disrupts North Korean IT worker \"laptop farm\" scheme in 16 states"
    },
    {
        "Title": "ChatGPT is rolling out 'personality' toggles to become your assistant",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-is-rolling-out-personality-toggles-to-become-your-assistant/",
        "Summary": "OpenAI is rolling out a new \"personality\" feature on the ChatGPT web app. This allows you to choose between multiple personalities, such as \"Robot.\" [...]",
        "Date": "2025-07-23",
        "Content": "OpenAI is\nrolling\nout a new \"personality\" feature on the ChatGPT web app. This allows you to choose between multiple personalities, such as \"Robot.\"\nChatGPT is pretty good at coding and reasoning, but it falls a bit short on personality. On the other hand, Microsoft Copilot feels a bit more personal, but that could change soon.\nWith the personality feature, which is slowly rolling out to some users across the world, you can personalize how ChatGPT interacts with you.\nBy default, ChatGPT is cheerful and adaptive, but you can switch to \"Cynic,\" which is a personality where ChatGPT has traits like critical and sarcastic.\nIf you want GPT to stop praising you for all your questions, this mode is for you.\nOther modes include \"Robot,\" which is efficient and blunt.\nThen, we have the \"Listener\" personality, which is thoughtful and supportive. The last personality is \"Sage,\" which is nerdy and enthusiastic.\nCustomize ChatGPT\nSource: BleepingComputer\nTo try the feature, you need to click on the profile icon and then select \"Customize ChatGPT.\"\nThen, you can select the personality and make other changes to ChatGPT.\nThis feature is still rolling out, and it may not show up for everyone just yet.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nChatGPT's GPT-5-reasoning-alpha model spotted ahead of launch\nOpenAI: GPT-5 is coming, \"we'll see\" if it creates a shockwave\nOpenAI's image model gets built-in style feature on ChatGPT\nOpenAI says GPT-5 will unify breakthroughs from different models\nChatGPT is testing disruptive Study Together feature"
    },
    {
        "Title": "NPM package ‘is’ with 2.8M weekly downloads infected devs with malware",
        "Link": "https://www.bleepingcomputer.com/news/security/npm-package-is-with-28m-weekly-downloads-infected-devs-with-malware/",
        "Summary": "The popular NPM package 'is' has been compromised in a supply chain attack that injected backdoor malware, giving attackers full access to compromised devices. [...]",
        "Date": "2025-07-23",
        "Content": "The popular NPM package 'is' has been compromised in a supply chain attack that injected backdoor malware, giving attackers full access to compromised devices.\nThis occurred after maintainer accounts were hijacked via phishing, followed by unauthorized owner changes that went unnoticed for several hours, potentially compromising many developers who downloaded the new releases.\nThe 'is' package is a lightweight JavaScript utility library that provides a wide variety of type checking and value validation functions.\nThe software has over 2.8 million weekly downloads on the NPM package index. It is used extensively as a low-level utility dependency in development tools, testing libraries, build systems, and backend and CLI projects.\nOn July 19, 2025, the package's primary maintainer, John Harband, announced that versions 3.3.1 through 5.0.0 contained malware and were removed roughly 6 hours after threat actors submitted them to npm.\nThis was the result of the same\nNPM supply chain attack\nthat used the fake domain' npnjs[.]com' to snatch maintainer credentials and then publish laced versions of popular packages.\nBesides 'is,' the following packages were confirmed to be pushing malware, compromised in the same attack:\neslint-config-prettier (8.10.1, 9.1.1, 10.1.6, 10.1.7)\neslint-plugin-prettier (4.2.2, 4.2.3)\nsynckit (0.11.9)\n@pkgr/core (0.2.8)\nnapi-postinstall (0.3.1)\ngot-fetch (5.1.11, 5.1.12)\nSocket reports that 'is' contains a cross-platform JavaScript malware loader that opens a WebSocket-based backdoor, enabling remote code execution.\n\"Once active, it queries Node's os module to collect the hostname, operating system, and CPU details, and captures all environment variables from process.env,\"\nexplains Socket.\n\"It then dynamically imports the ws library to exfiltrate this data over a WebSocket connection.\"\n\"Every message received over the socket is treated as executable JavaScript, giving the threat actor an instant, interactive remote shell.\"\nThe researchers also analyzed the payload in 'eslint' and the rest of the packages, finding a Windows infostealer called 'Scavanger' which targets sensitive information stored in web browsers.\nThe malware features evasion mechanisms such as indirect syscalls, encrypted command and control (C2) communications, but it may trigger security warnings in Chrome due to flag manipulation.\nBased on the attack pattern, the threat actors may have compromised additional maintainer credentials and are preparing to experiment with stealthier payloads on new software packages.\nTo prevent this, maintainers should reset their passwords and rotate all tokens immediately, and developers should only use known-to-be-safe versions from before July 18, 2025.\nAuto-updating should be turned off, while lockfiles can be used to freeze releases on specific dependency versions.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nLumma infostealer malware returns after law enforcement disruption\nPopular npm linter packages hijacked via phishing to drop malware\nNorth Korean XORIndex malware hidden in 67 malicious npm packages\nDozens of malicious packages on NPM collect host and network data\nnpm 'accidentally' removes Stylus package, breaks builds and pipelines"
    },
    {
        "Title": "US nuclear weapons agency hacked in Microsoft SharePoint attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/us-nuclear-weapons-agency-hacked-in-microsoft-sharepoint-attacks/",
        "Summary": "Unknown threat actors have breached the National Nuclear Security Administration's network in attacks exploiting a recently patched Microsoft SharePoint zero-day vulnerability chain. [...]",
        "Date": "2025-07-23",
        "Content": "Unknown threat actors have breached the National Nuclear Security Administration's network in attacks exploiting a recently patched Microsoft SharePoint zero-day vulnerability chain.\nNNSA is a semi-autonomous U.S. government agency part of the Energy Department that maintains the country's nuclear weapons stockpile and is also tasked with responding to nuclear and radiological emergencies within the United States and abroad.\nA Department of Energy spokesperson confirmed in a statement that hackers gained access to NNSA networks last week.\n\"On Friday, July 18th, the exploitation of a Microsoft SharePoint zero-day vulnerability began affecting the Department of Energy, including the NNSA,\" Department of Energy Press Secretary Ben Dietderich told BleepingComputer. \"The Department was minimally impacted due to its widespread use of the Microsoft M365 cloud and very capable cybersecurity systems.\"\nDietderich added that only \"a very small number of systems were impacted\" and that \"all impacted systems are being restored.\"\nAs first reported by\nBloomberg\n, sources within the agency also noted that there's no evidence of sensitive or classified information compromised in the breach.\nThe APT29 Russian state-sponsored threat group, the hacking division of the Russian Foreign Intelligence Service (SVR), also\nbreached the U.S. nuclear weapons agency\nin 2019 using a trojanized SolarWinds Orion update.\nAttacks linked to Chinese state hackers, over 400 servers breached\nOn Tuesday, Microsoft and Google linked the widespread attacks targeting a Microsoft SharePoint zero-day vulnerability chain (known as\nToolShell\n) to Chinese state-sponsored hacking groups.\n\"Microsoft has observed two named Chinese nation-state actors, Linen Typhoon and Violet Typhoon exploiting these vulnerabilities targeting internet-facing SharePoint servers,\"\nMicrosoft said\n.\n\"In addition, we have observed another China-based threat actor, tracked as Storm-2603, exploiting these vulnerabilities. Investigations into other actors also using these exploits are still ongoing.\"\nDutch cybersecurity firm Eye Security\nfirst detected the zero-day attacks\non Friday, stating that at least 54 organizations had already been compromised, including national government entities and multinational companies.\nCybersecurity firm Check Point later revealed that it\nhad spotted signs of exploitation going back to July 7th\ntargeting dozens of government, telecommunications, and technology organizations in North America and Western Europe.\nSince then, Eye Security CTO Piet Kerkhofs told BleepingComputer that the number of compromised entities, \"most of them already compromised for some time already,\" is much larger. According to the cybersecurity company's statistics, the threat actors behind these attacks have already infected at least 400 servers with malware and breached 148 organizations worldwide.\nCISA also\nadded the CVE-2025-53770 remote code execution flaw\n, part of the ToolShell exploit chain, to its catalog of exploited vulnerabilities, ordering U.S. federal agencies to secure their systems within a day.\nUpdate July 23, 12:18 EDT:\nAdded Energy Department statement.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nMicrosoft links Sharepoint ToolShell attacks to Chinese hackers\nMicrosoft SharePoint zero-day exploited in RCE attacks, no patch available\nMicrosoft releases emergency patches for SharePoint RCE flaws exploited in attacks\nGrocery wholesale giant United Natural Foods hit by cyberattack\nSolarWinds hackers breach US nuclear weapons agency"
    },
    {
        "Title": "OpenAI confirms ChatGPT's new study feature, helps with exams",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-confirms-chatgpts-new-study-feature-helps-with-exams/",
        "Summary": "OpenAI is testing a new 'Study together' feature, and today, a new announcement within the ChatGPT web app confirms it. [...]",
        "Date": "2025-07-23",
        "Content": "BleepingComputer previously\nreported\nthat OpenAI is testing a new 'Study together' feature, and today, a new announcement within the ChatGPT web app confirms it.\nThis\nannouncement\nis titled 'Study and Learn,' and it looks like the feature will be called Study Together.\nWith the Study Together feature on ChatGPT, you'll be able to get homework help or break down complex problems.\nBut how is it exactly different from existing prompt engineering, such as \"explain this concept to me in an easy way\"?\nIt doesn't look like Study Together is a new model, but it's an art of prompt engineering and formatting.\nUnlike traditional ChatGPT answers, Study Together provides a step-by-step guide to learning anything. You can break down complex problems with approachable, guided explanations.\nOn top of that, you can prepare for tests, test your knowledge with quizzes on any topic.\nYou can also go deep on any topic and ask any question.\nThis feature will begin rolling out to everyone in the coming hours or days.\nAs BleepingComputer\npreviously reported\n, Claude and Gemini are also testing a similar feature, as they bet on the online education market.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nOpenAI's ChatGPT-powered browser is codenamed 'Aura'\nChatGPT's AI coder Codex now lets you choose the best solution\nChatGPT o3 API 80% price drop has no impact on performance\nOpenAI plans to ship an interesting ChatGPT product by 2026\nChatGPT is rolling out 'personality' toggles to become your assistant"
    },
    {
        "Title": "How to harden your Active Directory against Kerberoasting",
        "Link": "https://www.bleepingcomputer.com/news/security/how-to-harden-your-active-directory-against-kerberoasting/",
        "Summary": "Kerberoasting gives attackers offline paths to crack service account password, without triggering alerts. Learn from Specops Software how to protect your Active Directory with stronger SPN password policies and reduced attack surfaces. [...]",
        "Date": "2025-07-23",
        "Content": "Kerberoasting is a common attack targeting Microsoft Active Directory, enabling attackers to compromise service accounts with low risk of detection. Because it manipulates legitimate accounts, it can be highly effective. However, robust password security can keep the criminals at bay.\nFirst, what is Kerberoasting?\nThe name comes from ‘Kerberos’\n, the authentication protocol used in Active Directory, which verifies a user’s identity or that of a computer requesting access to resources.\nKerberoasting is a privilege escalation attack where a perpetrator in control of a standard Windows user account attempts to crack the password for an account with a Service Principle Name (SPN); if successful, they can then escalate their attacks to threaten any part of the architecture connected to the targeted account.\nMulti-pronged attack\nHow does an attack work in practice? It’s slightly complex, but there are five key stages:\nThe attacker begins by exploiting an existing Windows user account in Active Directory. They may have gained access to this account using any of the traditional, nefarious methods, such as stealing credentials via phishing or malware.\nThey then identify an account on the active directory with an SPN attached, using tools such as GhostPack’s Rubeus. These service accounts are dangerous because they often have high-level permissions or domain administrator access.\nUsing the account they control, the attacker requests a service ticket from the ticket granting service (TGS) in Active Directory. This ticket contains the SPN in focus and is encrypted with the hash of the target account’s password.\nThe attacker takes the ticket offline, concealing their activities: there is no longer any unusual network traffic that might give them away.\nFinally, the perpetrator uses brute force techniques to attempt to crack the SPN password hash, enabling them to recover plaintext service-account passwords. They can then access anything that account can access.\nSecure your Active Directory passwords with Specops Password Policy\nVerizon’s Data Breach Investigation Report found stolen credentials are involved in 44.7% of breaches.\nEffortlessly secure Active Directory with compliant password policies, blocking 4+ billion compromised passwords, boosting security, and slashing support hassles!\nTry it for free\nAdversary advantages\nKerberoasting is a complex process, with a range of tools available online to both detect accounts with an associated SPN and to then break into the ticket. However, it has significant advantages for attackers:\nThey can exploit any user account to request a ticket from the AD. One account is just as dangerous as another.\nBecause they attempt to crack the password hash offline, they can essentially keep trying to crack the password hash without detection. Tools like John the Ripper or Hashcat can be deployed.\nKerberoasting doesn’t rely on malware, meaning traditional solutions like antivirus software aren’t effective.\nHow to protect your Active Directory\nIt’s easy to see why Kerberoasting would appeal to cybercriminals. However, organizations can take steps to protect their AD from the danger.\nEnforce robust SPN passwords:\nEach SPN-enabled account should be protected by long, random, non-reusable passwords. If it’s 25 characters or more, the chances of a successful Kerberoasting attack are hugely diminished.\nUse AES encryption for service tickets:\nAES-based encryption is more secure than efforts based on RC4\n. When you configure domain controllers and Kerberos settings to favor AES256 over legacy RC4 encryption, you hugely increase the cost and difficulty of cracking ticket hashes.\nReduce SPN footprint:\nIt’s wise to audit your existing SPN-enabled accounts, consolidating duplicate accounts or disabling them altogether. The goal is to minimize the number of individual SPN credentials that you need to protect.\nGroup Managed Service Accounts (gMSAs) can also be useful\n, automating password management for additional security.\nControl privileges:\nRestrict service accounts to only the permissions they require, ensuring they aren’t members of high-privilege groups. Tiered administration models can also ensure that compromised SPNs can’t be escalated to domain-wide privileges.\nMonitor Kerberos traffic for anomalies:\nKeep an eye out for early-stage Kerberoasting reconnaissance efforts. For instance, security information and event management (SIEM) solutions can be configured to detect unusual patterns, such as spikes in TGS requests for a single SPN.\nScan your AD for stale accounts\nSpecops Password Auditor\nis a read-only tool that lets proactively scan for weak, reused, and breached passwords in your Active Directory environment. It help audit service accounts in the domain for password security and help give visibility to service accounts with administrator permissions.\nYour exportable report gives you a full\nview of stale accounts\nin your organizations, which are often a starting point for Kerberoasting attacks.\nDownload your free tool here\n.\nPrevent Kerberoasting attacks\nKerberoasting is a complex form of attack, built across different stages. However, one thing is certain: password security sits at the heart of your defense.\nThis works on two major levels.\nFirst, before attackers can request a service ticket tied to an SPN account, they need to have access to another user account that they can manipulate. They target this through well-known means, such as phishing or malware.\nMulti-factor authentication (MFA)\nis also key to protecting accounts against this danger, with passwords a key component.\nBy ensuring your passwords meet the most stringent security demands, you can protect your organization – and its employees – from the first stage of a Kerberoasting attack.\nSecond, there’s the attack itself. As we’ve seen, Kerberoasting and brute force tactics struggle against lengthy, unique passwords of 25 characters or more. By ensuring all your SPN-linked accounts are protected by such passwords, you take a huge step towards securing your Active Directory.\nSpecops Password Policy\nmakes it easy to block weak passwords and enforce the creation of strong, unique passphrases. On top if that, it continuously scans your AD against a growing list of over 4 billion compromised passwords, alerting end users if their password is found to be breached.\nInterested to know how this could work in your environment?\nGet in touch for a demo\n.\nSponsored and written by\nSpecops Software\n."
    },
    {
        "Title": "OpenAI prepares Sora 2 to take on Google's Veo 3",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-prepares-sora-2-to-take-on-googles-veo-3/",
        "Summary": "OpenAI has had enough of Google's Veo 3 dominating generative AI videos and is now working on Sora 2, the successor to Sora. [...]",
        "Date": "2025-07-23",
        "Content": "OpenAI has had enough of Google's Veo 3 dominating generative AI videos and is now working on Sora 2, the successor to Sora.\nAs\nspotted\non X, OpenAI's servers now include references to \"Sora 2,\" which makes it obvious that OpenAI has developed a new generative video model.\nSora shipped on December 9, 2024, and it's been more than six months since it was last updated.\nSora is also no longer the talk of the town, but it was recently in the news when Microsoft added it to Bing Video Creator for free.\nBleepingComputer understands that Sora 2 isn't yet ready for public rollout, and we might learn more about it from OpenAI in the coming weeks.\nMeanwhile, Google has\nannounced\nthat Veo 3 is now free for college students with the Gemini AI Pro plan.\nIf you're not a college student,\nyou can use Google Cloud's free credit\n, then sign up for Vertex AI development mode and use Veo 3.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nOpenAI, Anthropic, Google may disrupt education market with new AI tools\nGoogle rolls out Veo 3 video generator, try it for free using credits\nChatGPT will analyze Gmail emails, manage schedule on Google Calendar\nChatGPT is rolling out 'personality' toggles to become your assistant\nOpenAI confirms ChatGPT's new study feature, helps with exams"
    },
    {
        "Title": "Ukraine arrests suspected admin of XSS Russian hacking forum",
        "Link": "https://www.bleepingcomputer.com/news/security/ukraine-arrests-suspected-admin-of-xss-russian-hacking-forum/",
        "Summary": "The suspected administrator of the Russian-speaking hacking forum XSS.is was arrested by the Ukrainian authorities yesterday at the request of the Paris public prosecutor's office. [...]",
        "Date": "2025-07-23",
        "Content": "The suspected administrator of the Russian-speaking hacking forum XSS.is was arrested by the Ukrainian authorities yesterday at the request of the Paris public prosecutor's office.\nXSS.is is a Russian-speaking cybercrime forum that has been active since 2013 and is widely regarded as\none of the major online hubs\nfor cybercriminal activity, with over 50,000 registered users.\nThe platform was used to sell malware, access to compromised systems,\nadvertise ransomware-as-a-service (RaaS)\nplatforms, and discuss illegal activities.\nThe French authorities state that the investigation was opened roughly four years ago, uncovering activities related to ransomware and other cybercrimes, which yielded multi-million-dollar profits.\nThis was despite the forum publicly\nbanning all ransomware topics\non the platform in May 2021.\n\"The investigation, opened on July 2, 2021, by the cybercrime division of the Paris prosecutor's office and assigned to the Cybercrime Brigade of the judicial police of the Paris police prefecture, led to the implementation of judicial wiretaps on the Jabber server thesecure.biz,\" reads the announcement.\n\"The intercepted messages revealed numerous illicit activities related to cybercrime and ransomware, and established that they had generated at least 7 million dollars in profit.\"\nJabber is an encrypted messaging platform that utilizes the XMPP protocol and is popular among threat actors as a means of communication. According to the French police, they were able to breach the 'thesecure.biz' server to spy on communications between users on the platform.\nThese surveilled communications led to the opening of a judicial investigation on November 9, 2021, for complicity in attacks on data processing systems, extortion, and criminal conspiracy.\nA second later interception identified the forum's alleged administrator, leading to on-site deployment of agents in September 2024. The suspect was arrested yesterday by Ukrainian police, in the presence of French officers and with the\nassistance of Europol\n.\nImage from the arrest and computers' examination\nSource: Europol\nXSS forum members posted concerns this morning that the site was taken over by law enforcement after being unable to reply to existing threads about it.\nSoon after, the site was officially taken offline by law enforcement, displaying a message stating, \"This domain has been seized by la Brigade de Lutte Contre la Cybercriminalité with assistance of the SBU Cyber Department.\"\nXSS hacking forum seized by law enforcement\nSource: BleepingComputer\nWith potential access to the forum backend and the arrest of the suspected administrator of XSS, it is likely that the authorities now hold incriminating evidence against other members of the forum, which may lead to more actions in the future.\nIn any case, this development is likely to have a chilling effect on the activity at XSS, as users fearing exposure to law enforcement will turn to other sites.\nThe XSS admin arrest comes shortly after the French police\narrested five operators of BreachForum\n, another major cybercrime platform, which included the notorious hacker and data broker known as 'IntelBroker.'\nUpdate 7/23/25: Article updated to reflect that XSS has now been seized by law enforcement.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nBreachForums hacking forum operators reportedly arrested in France\nRyuk ransomware’s initial access expert extradited to the U.S.\nPolice disrupt “Diskstation” ransomware gang attacking NAS devices\nRussian pro basketball player arrested for alleged role in ransomware attacks\nHacker 'IntelBroker' charged in US for global data theft breaches"
    },
    {
        "Title": "CISA warns of hackers exploiting SysAid vulnerabilities in attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/cisa-warns-of-hackers-exploiting-sysaid-vulnerabilities-in-attacks/",
        "Summary": "CISA has warned that attackers are actively exploiting two security vulnerabilities in the SysAid IT service management (ITSM) software to hijack administrator accounts. [...]",
        "Date": "2025-07-23",
        "Content": "CISA has warned that attackers are actively exploiting two security vulnerabilities in the SysAid IT service management (ITSM) software to hijack administrator accounts.\nThe two unauthenticated XML External Entity (XXE) flaws, tracked as CVE-2025-2775 and CVE-2025-2776, were reported by watchTowr Labs security researchers in December 2024 and\npatched in March\nwith the release of SysAid On-Prem version 24.4.60.\nOne month later, watchTowr Labs also\npublished proof-of-concept code\n, showing that the SysAid vulnerabilities are trivial to exploit and allow attackers to retrieve local files containing sensitive information.\nWhile CISA didn't share any additional details regarding these ongoing attacks, it did\nadd the two vulnerabilities\nto its\nKnown Exploited Vulnerabilities Catalog\n, giving Federal Civilian Executive Branch (FCEB) agencies three weeks to patch their systems by August 12 as mandated by the November 2021 Binding Operational Directive (BOD) 22-01.\nAlthough BOD 22-01 primarily targets U.S. federal agencies, the cybersecurity agency encourages all organizations, including private companies, to prioritize patching the two actively exploited flaws as soon as possible.\n\"These types of vulnerabilities are frequent attack vectors for malicious cyber actors and pose significant risks to the federal enterprise,\" CISA warned.\nSysAid On-Prem is hosted on customers' infrastructure, enabling IT teams to manage various services within an organization. According to Shadowserver data,\ndozens of SysAid instances\nare currently exposed online, most of them from North America and Europe.\nExposed SysAid servers (Shadowserver)\nCISA has found no evidence that the two security flaws were exploited in ransomware attacks. However, the FIN11 financially motivated cybercrime group\nexploited a SysAid vulnerability (CVE-2023-47246)\nin 2023 to deploy Clop ransomware on compromised servers in zero-day attacks.\nSysAid has over 5,000 customers and more than 10 million users across 140 countries worldwide, serving a diverse range of clients, from small businesses to Fortune 500 enterprises, including high-profile companies such as Xerox, IKEA, Coca-Cola, Honda, Michelin, and Motorola.\nThe company didn't reply to a request for comment when BleepingComputer reached out earlier today.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nCISA tags Citrix Bleed 2 as exploited, gives agencies a day to patch\nCISA: AMI MegaRAC bug enabling server hijacks exploited in attacks\nCISA warns of attackers exploiting Linux flaw with PoC exploit\nCISA warns of ConnectWise ScreenConnect bug exploited in attacks\nCISA and FBI warn of escalating Interlock ransomware attacks"
    },
    {
        "Title": "npm 'accidentally' removes Stylus package, breaks builds and pipelines",
        "Link": "https://www.bleepingcomputer.com/news/security/npm-accidentally-removes-stylus-package-breaks-builds-and-pipelines/",
        "Summary": "npm has taken down all versions of the Stylus library and replaced them with a \"security holding\" page, breaking pipelines and builds worldwide that rely on the package. [...]",
        "Date": "2025-07-23",
        "Content": "npm has taken down all versions of the real Stylus library and replaced them with a \"security holding\" page, breaking pipelines and builds worldwide that rely on the package.\nA security placeholder webpage is typically displayed when malicious packages and libraries are removed by the admins of npmjs.com, the world's largest software registry primarily used for JavaScript and Node.js development.\nBut that isn't quite the case for Stylus: a legitimate \"revolutionary\" library receiving 3 million weekly downloads and providing an expressive way for devs to generate CSS.\nStylus 'accidentally banned by npmjs'\nAs of a few hours ago, npmjs has removed all versions of the Stylus package and published a \"security holding package\" page in its place.\nAll versions of 'stylus' removed and replaced with a 'security placeholder' page\n(npmjs.com)\n\"Stylus was accidentally banned by npmjs,\"\nearlier stated\nStylus developer Lei Chen in a GitHub issue. The project maintainer is \"currently waiting for npmjs to restore access to Stylus.\"\n\"I am the current maintainer of Stylus. The Stylus library has been flagged as malicious..., which has caused many [libraries] and frameworks that depend on Stylus to fail to install,\" also\nposted\nChen on X (formerly Twitter). \"Please help me retweet this msg in the hope that the npmjs official team will take notice of this issue.\"\nStylus' original npmjs page (shown below) indicates that the legitimate library is a \"revolutionary new language\" for CSS development and nets close to 3 million downloads weekly.\nStylus package on npm receives millions of downloads\n(BleepingComputer)\nSurely enough, developers of different projects relying on Stylus chimed in:\n\"My builds are failing so my software updates don't publish because this administrative error,\"\nposted\none developer.\nPackages like\ntypescript-plugin-css-modules\n(downloaded up to 500,000 times weekly) also rely on Stylus,\nnoted\nfull-stack developer Chanuka Asanka:\n\"Pipelines are failing. Does anyone know whether npm/yarn provides any early notice when they are going to do such thing?\"\nStylus is depended-upon by large projects\n(BleepingComputer)\n\"I was deploying Frappe/ERPNext like I usually do with the CI/CD pipeline and it failed suddenly,\"\nwrote\na Docker developer in a Frappe forums thread.\nSingapore-based developer Haseeb Elahi\ncautioned\nthat Stylus \"is dependency of the official Angular 12 package. I am sure thousands of Angular builds are broken.\"\nAnd, he is not wrong.\nAngular CLI's GitHub repository had users\nshare their error logs\nafter builds started breaking due to the now-non-existent Stylus dependency.\nWhat\nreally\nhappened?\nTypically, packages are taken down on npm for violating one or more of their open source\nterms of service\n, and fairly commonly for containing malicious code. But that is not the case for Stylus—all versions of which appear to be clean and functional.\nTom Abai, a security researcher at supply chain security firm Mend.io, has it figured out.\nWhile investigating the development, Abai\nconfirmed\nthat at least the most recent version (0.64.0) of Stylus was \"clean,\" but something odd stood out in connection with the package:\nMend.io researcher shedding light on the development\n(Tom Abai via X)\n\"...one weird thing came [up] in our investigation, and that this owner\npanyakor\n..., that looks like he was part of the stylus npm package owners, published 3 malicious packages last week...\" wrote Abai.\nnpmjs.com, like many open source development platforms, allows multiple maintainers to be listed for and contribute to a package. While Chen may be the primary developer of Stylus, there are other npm accounts listed under maintainers.\n\"Panya, who is one of the maintainers of the stylus package, published them, and because of that, his account was banned, and all the packages that were connected to him were yanked, including the Stylus one. So that's the story here. A big false alarm by NPM,\" states Abai.\nBleepingComputer further confirmed that the npm account '\npanya\n' was indeed listed among maintainers on npmjs.com for Stylus as well as the 3 packages listed in Abai's post that are otherwise unrelated to Stylus.\nThe packages flagged by Abai:\n@pwa-ib/eslint-plugin-compat\n,\n@blocks-shared/desktop-title\n,\n@tui-react-internal/select-account-icon\n, published by 'panya', now require authentication to access on the npmjs.com registry and are therefore restricted from the public view.\nBleepingComputer was, however, able to obtain and peek into these packages, and we can confirm Abai's findings.\nFor example, the \"extract.js\" file in\n@blocks-shared/desktop-title\nis a proof-of-concept\ndependency confusion\nexploit that the industry has seen several times by now:\nDependency confusion PoC code seen in a package published by a Stylus co-maintainer\n(BleepingComputer)\nAccording to\nsupply chain security firm Socket, npm account 'panya' had been a maintainer for (and/or published) at least 12 packages in the past:\nnpm account panya has been associated with 12 packages\n(Socket.dev)\nAt the time of writing, though, the account has no packages listed under it, indicating that the registry likely purged all of its PoC exploits and removed Stylus in the process, by accident.\nWhat can you do?\nLuckily, the Stylus developer and the open source community members have\nshared detailed tips in the meantime\nfor npm and yarn developers relying on Stylus to maintain access to the library and restore their builds.\nnpm developers can opt to reference the stylus package \"dynamically by specifying a branch, tag, or commit hash in the\ndependencies\nsection of\npackage.json\n,\" states Chen, such as:\n{\r\n  \"dependencies\": {\r\n    \"stylus\": \"github:stylus/stylus#version-you-need\"\r\n  }\r\n}\nUsing overrides is another option for npm developers:\n\"You can override the\nstylus\npackage version used by other dependencies by specifying it in the\noverrides\nsection (supported in npm v8.3.0 and later)\"\n{\r\n  \"overrides\": {\r\n    \"stylus\": \"github:stylus/stylus#version-you-need\"\r\n  }\r\n}\n\"Note\n: Ensure the specified tag, branch, or commit (e.g.,\n0.54.4\n) exists in the\nstylus/stylus\nrepository. Clear the npm cache (\nnpm cache clean --force\n) if you encounter issues with outdated dependencies.\"\nTo summarize, Chen reiterates:\n\"Stylus does not contain malicious code; this has been confirmed.\nnpmmirror.com\n(a non-profit mirror sponsored by Alibaba) has resumed access [to the library].\nIt is unclear whether this is a coincidence, but a tool called Stylus Tools component has been\nreported to have a CVE\n.\nPanya\n(the former maintainer of Stylus) used their own account to release a package containing malicious code (for security research purposes? I am unsure), but did not release a new version of Stylus containing malicious code.\nWe are awaiting official action from npmjs. Yes, we are waiting for them to handle it.\nA workaround has been provided in the comments. Please apply it as needed.\"\n\"Some personal thoughts: if your company has been affected by Stylus, you need to reevaluate the relationship between npmjs and npm mirror and design a more reliable development process,\" wrote the maintainer.\nBleepingComputer approached the npm registry and its parent organization, GitHub, for comment before publishing, but we were only referred to the now-withdrawn\nadvisory\nthat had earlier referred to Stylus as \"malware.\"\nChen, however, acknowledged receiving a response from the organization and that was working on restoring access to the project:\n\"Thanks for taking the time to let us know. It appears a maintainer associated with the stylus package published a malicious package which resulted in the account being suspended and associated packages being removed.\nOur engineers are currently working on restoring stylus, we will update you when this has been completed.\nPlease let us know if we can help in any other way.\nRegards,\nGitHub Trust & Safety\"\nIn the past, open source developers have made headlines for breaking builds by\npulling their libraries\nfrom registries over disagreements or outright\ncorrupting their code in protest\n.\nThis incident marks the first notable instance of a registry taking down an entire legitimate project in what appears to be an administrative error.\nUpdate, 23-Jul-2025 10:40 AM ET: Added excerpt from email response sent to Chen by GitHub.\nUpdate, 23-Jul-2025 04:25 PM ET: Added link to now-withdrawn GitHub advisory.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nPopular npm linter packages hijacked via phishing to drop malware\nNPM package ‘is’ with 2.8M weekly downloads infected devs with malware\nNorth Korean XORIndex malware hidden in 67 malicious npm packages\nWordPress Gravity Forms developer hacked to push backdoored plugins\nMicrosoft open-sources VS Code Copilot Chat extension on GitHub"
    },
    {
        "Title": "Operator of Jetflix illegal streaming service gets 7 years in prison",
        "Link": "https://www.bleepingcomputer.com/news/technology/operator-of-jetflix-illegal-streaming-service-gets-7-years-in-prison/",
        "Summary": "The ringleader of the Jetflicks illegal paid streaming operation, a massive service with tens of thousands of subscribers, was sentenced to seven years in prison. [...]",
        "Date": "2025-07-23",
        "Content": "The ringleader of the Jetflicks illegal paid streaming operation, a massive service with tens of thousands of subscribers, was sentenced to seven years in prison.\nTogether with four other accomplices, 42-year-old Kristopher Lee Dallmann of Las Vegas, Nevada, was convicted in June 2024 of conspiracy to commit copyright infringement.\nDallmann was also found guilty by a federal jury of money laundering, criminal copyright infringement by distribution, and criminal copyright infringement by public performance.\n\"Dallmann reaped millions of dollars in profit from the operation. The government conservatively estimated the value of the copyright infringement in the case at $37.5 million,\" the Justice Department\nsaid\n.\n\"This included the approximate retail value of the defendants' reproduction of infringing works to create the Jetflicks inventory as well as the approximate retail value of the streams of pirated television episodes that the defendants provided to subscribers.\"\nDuring the trial, evidence revealed that the piracy ring used automated software and scripts to scan global websites for pirated content. This illegal content was then downloaded, processed, stored, and made available on servers in the United States and Canada for tens of thousands of paid subscribers to stream or download.\nJetflicks homepage in 2013 (Internet Archive)\n​The Jetflicks illegal streaming service also often delivered episodes to subscribers the day after they aired on television and was designed to work across various devices and platforms.\nJetflicks operated for 12 years, from 2007 until its shutdown by the FBI in 2019, and offered over 10,500 movies and 183,000 TV episodes to its subscribers at its peak, all of which were pirated from platforms like Netflix, Hulu, Vudu, and Amazon Prime.\n\"This scheme generated millions of dollars in criminal profits, and hurt thousands of U.S. companies and individuals who owned the copyrights to these shows but never received a penny in compensation from Jetflicks,\" said Acting Assistant Attorney General Matthew R. Galeotti.\n\"By building and running one of the largest unauthorized streaming services in the U.S., these individuals not only stole from content creators and legitimate streaming services, they undermined the integrity of our economy and the rule of law,\" added Assistant Director Jose A. Perez of the FBI Criminal Investigative Division.\nIn December 2024, the Alliance for Creativity and Entertainment (ACE) also\ntook down Vietnam-based Markkystreams\n, one of the world's largest live sports streaming piracy networks, which received over 821 million visits last year.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide"
    },
    {
        "Title": "Banking Trojan Coyote Abuses Windows UI Automation",
        "Link": "https://www.darkreading.com/cyber-risk/banking-trojan-coyote-windows-ui-automation",
        "Summary": "It's the first known instance of malware that abuses the UIA framework and has enabled dozens of attacks against banks and crypto exchanges in Brazil.",
        "Date": "2025-07-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/banking-trojan-coyote-windows-ui-automation"
    },
    {
        "Title": "Dark Web Hackers Moonlight as Travel Agents",
        "Link": "https://www.darkreading.com/remote-workforce/dark-web-hackers-moonlight-travel-agents",
        "Summary": "Hackers are using stolen goods such as credit cards and loyalty points to book travel for sometimes unsuspecting clients, and remote workers, SMBs, travel brands, and others are at risk.",
        "Date": "2025-07-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/dark-web-hackers-moonlight-travel-agents"
    },
    {
        "Title": "Department of Education Site Mimicked in Phishing Scheme",
        "Link": "https://www.darkreading.com/threat-intelligence/department-of-education-site-phishing-scheme",
        "Summary": "An ongoing phishing campaign is using fake versions of the department's G5 grant portal, taking advantage of political turmoil associated with the DoE's 1,400 layoffs.",
        "Date": "2025-07-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/department-of-education-site-phishing-scheme"
    },
    {
        "Title": "Stop AI Bot Traffic: Protecting Your Organization's Website",
        "Link": "https://www.darkreading.com/threat-intelligence/stop-ai-bot-traffic-protecting-organizations",
        "Summary": "As crawlers and bots bog down websites in the era of AI, some researchers say that the solution for the Internet's most vulnerable websites is already here.",
        "Date": "2025-07-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/stop-ai-bot-traffic-protecting-organizations"
    },
    {
        "Title": "US Nuclear Agency Hacked in Microsoft SharePoint Frenzy",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/us-nuclear-agency-hacked-microsoft-sharepoint",
        "Summary": "Threat actors are piling on the zero-day vulnerabilities in SharePoint, including at least three Chinese nation-state cyber-espionage groups.",
        "Date": "2025-07-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/us-nuclear-agency-hacked-microsoft-sharepoint"
    },
    {
        "Title": "Lumma Stealer Is Back &amp; Stealthier Than Ever",
        "Link": "https://www.darkreading.com/endpoint-security/lumma-stealer-stealthier-than-ever",
        "Summary": "The operators of the popular and prolific malware wasted no time in regrouping after an FBI takedown in May, and they're back to their old tricks.",
        "Date": "2025-07-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/lumma-stealer-stealthier-than-ever"
    },
    {
        "Title": "Why ISO 42001 Matters for AI Governance at Scale",
        "Link": "https://www.darkreading.com/cyber-risk/why-iso-42001-matters-ai-governance",
        "Summary": "How a new international standard is shaping the future of responsible AI development and deployment.",
        "Date": "2025-07-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/why-iso-42001-matters-ai-governance"
    },
    {
        "Title": "China Introduces National Cyber ID Amid Privacy Concerns",
        "Link": "https://www.darkreading.com/cyber-risk/china-introduces-national-cyber-id-privacy-concerns",
        "Summary": "China officially rolled out a voluntary Internet identity system to protect citizens' online identities and personal information, but critics worry about privacy and surveillance.",
        "Date": "2025-07-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/china-introduces-national-cyber-id-privacy-concerns"
    },
    {
        "Title": "OpenAI’s Sam Altman Warns of AI Voice Fraud Crisis in Banking",
        "Link": "https://www.securityweek.com/openais-sam-altman-warns-of-ai-voice-fraud-crisis-in-banking/",
        "Summary": "<p>AI voice clones can impersonate people in a way that Altman said is increasingly “indistinguishable from reality” and will require new methods for verification.</p>\n<p>The post <a href=\"https://www.securityweek.com/openais-sam-altman-warns-of-ai-voice-fraud-crisis-in-banking/\">OpenAI’s Sam Altman Warns of AI Voice Fraud Crisis in Banking</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/openais-sam-altman-warns-of-ai-voice-fraud-crisis-in-banking/"
    },
    {
        "Title": "Should We Trust AI? Three Approaches to AI Fallibility",
        "Link": "https://www.securityweek.com/should-we-trust-ai-three-approaches-to-ai-fallibility/",
        "Summary": "<p>Experts unpack the risks of trusting agentic AI, arguing that fallibility, hype, and a lack of transparency demand caution—before automation outpaces our understanding.</p>\n<p>The post <a href=\"https://www.securityweek.com/should-we-trust-ai-three-approaches-to-ai-fallibility/\">Should We Trust AI? Three Approaches to AI Fallibility</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/should-we-trust-ai-three-approaches-to-ai-fallibility/"
    },
    {
        "Title": "France Says Administrator of Cybercrime Forum XSS Arrested in Ukraine",
        "Link": "https://www.securityweek.com/france-says-administrator-of-cybercrime-forum-xss-arrested-in-ukraine/",
        "Summary": "<p>French authorities announced that an alleged admin of XSS.is, one of the longest-running cybercrime forums, has been arrested in Ukraine.</p>\n<p>The post <a href=\"https://www.securityweek.com/france-says-administrator-of-cybercrime-forum-xss-arrested-in-ukraine/\">France Says Administrator of Cybercrime Forum XSS Arrested in Ukraine</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/france-says-administrator-of-cybercrime-forum-xss-arrested-in-ukraine/"
    },
    {
        "Title": "UK’s Ransomware Payment Ban: Bold Strategy or Dangerous Gamble?",
        "Link": "https://www.securityweek.com/uks-ransomware-payment-ban-bold-strategy-or-dangerous-gamble/",
        "Summary": "<p>Critics warn that a ban on ransomware payments may lead to dangerous unintended consequences, including forcing victims into secrecy or incentivizing attackers to shift tactics. </p>\n<p>The post <a href=\"https://www.securityweek.com/uks-ransomware-payment-ban-bold-strategy-or-dangerous-gamble/\">UK’s Ransomware Payment Ban: Bold Strategy or Dangerous Gamble?</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/uks-ransomware-payment-ban-bold-strategy-or-dangerous-gamble/"
    },
    {
        "Title": "Coyote Banking Trojan First to Abuse Microsoft UIA",
        "Link": "https://www.securityweek.com/coyote-banking-trojan-first-to-abuse-microsoft-uia/",
        "Summary": "<p>Akamai’s analysis of the Coyote malware revealed that it abuses Microsoft’s UIA accessibility framework to obtain data.</p>\n<p>The post <a href=\"https://www.securityweek.com/coyote-banking-trojan-first-to-abuse-microsoft-uia/\">Coyote Banking Trojan First to Abuse Microsoft UIA</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/coyote-banking-trojan-first-to-abuse-microsoft-uia/"
    },
    {
        "Title": "Organizations Warned of Interlock Ransomware Attacks",
        "Link": "https://www.securityweek.com/organizations-warned-of-interlock-ransomware-attacks/",
        "Summary": "<p>The US government has issued an alert on the Interlock ransomware, which targets organizations via drive-by download attacks.</p>\n<p>The post <a href=\"https://www.securityweek.com/organizations-warned-of-interlock-ransomware-attacks/\">Organizations Warned of Interlock Ransomware Attacks</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/organizations-warned-of-interlock-ransomware-attacks/"
    },
    {
        "Title": "Critical Vulnerabilities Patched in Sophos Firewall",
        "Link": "https://www.securityweek.com/critical-vulnerabilities-patched-in-sophos-firewall/",
        "Summary": "<p>Sophos has patched five vulnerabilities in Sophos Firewall that could allow remote attackers to execute arbitrary code.</p>\n<p>The post <a href=\"https://www.securityweek.com/critical-vulnerabilities-patched-in-sophos-firewall/\">Critical Vulnerabilities Patched in Sophos Firewall</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/critical-vulnerabilities-patched-in-sophos-firewall/"
    },
    {
        "Title": "High-Severity Flaws Patched in Chrome, Firefox",
        "Link": "https://www.securityweek.com/high-severity-flaws-patched-in-chrome-firefox/",
        "Summary": "<p>Fresh security updates for Chrome and Firefox resolve multiple high-severity memory safety vulnerabilities.</p>\n<p>The post <a href=\"https://www.securityweek.com/high-severity-flaws-patched-in-chrome-firefox/\">High-Severity Flaws Patched in Chrome, Firefox</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/high-severity-flaws-patched-in-chrome-firefox/"
    },
    {
        "Title": "Lumma Stealer Malware Returns After Takedown Attempt",
        "Link": "https://www.securityweek.com/lumma-stealer-malware-returns-after-takedown-attempt/",
        "Summary": "<p>The Lumma Stealer is back after Microsoft and law enforcement took action to significantly disrupt the malware’s infrastructure.</p>\n<p>The post <a href=\"https://www.securityweek.com/lumma-stealer-malware-returns-after-takedown-attempt/\">Lumma Stealer Malware Returns After Takedown Attempt</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/lumma-stealer-malware-returns-after-takedown-attempt/"
    },
    {
        "Title": "Hackers Start Exploiting Critical Cisco ISE Vulnerabilities",
        "Link": "https://www.securityweek.com/hackers-start-exploiting-critical-cisco-ise-vulnerabilities/",
        "Summary": "<p>Cisco says it is aware of attempted exploitation of critical ISE vulnerabilities leading to unauthenticated remote code execution.</p>\n<p>The post <a href=\"https://www.securityweek.com/hackers-start-exploiting-critical-cisco-ise-vulnerabilities/\">Hackers Start Exploiting Critical Cisco ISE Vulnerabilities</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/hackers-start-exploiting-critical-cisco-ise-vulnerabilities/"
    },
    {
        "Title": "Play Ransomware Allegedly Targets DA Whitacre Construction and Ka Logistics",
        "Link": "https://dailydarkweb.net/play-ransomware-allegedly-targets-da-whitacre-construction-and-ka-logistics/",
        "Summary": "The Play ransomware group has allegedly added two new US-based companies to its dark web leak site, claiming successful cyberattacks. The group has threatened to publish stolen data if their ransom demands are not met, setting a deadline of July 27, 2025. The victims operate in the construction and logistics sectors, highlighting the indiscriminate nature [&#8230;]",
        "Date": "2025-07-23",
        "Content": "The Play ransomware group has allegedly added two new US-based companies to its dark web leak site, claiming successful cyberattacks. The group has threatened to publish stolen data if their ransom demands are not met, setting a deadline of July 27, 2025. The victims operate in the construction and logistics sectors, highlighting the indiscriminate nature of these attacks which can disrupt critical supply chain and infrastructure-related services.\nThe targeted organizations are:\n🇺🇸\nDA Whitacre Construction:\nA United States-based firm specializing in both commercial and residential construction projects.\n🇺🇸\nKa Logistics:\nA family-owned American trucking and freight transportation company with over a decade of experience in the logistics industry.\nThe threat actors claim to have exfiltrated a significant amount of sensitive information from both companies. The allegedly stolen data includes a wide range of confidential files, which could have severe consequences for the companies, their employees, and their clients if released publicly. The group has listed the following types of data as compromised:\nPrivate and personal confidential data\nClient documents\nBudget, payroll, and accounting information\nTax documents\nEmployee and client IDs\nFinancial information\nTags:\nConstruction\ncyberattack\ndata-breach\nLogistics\nPlay Ransomware\nUSA"
    },
    {
        "Title": "Major Indian Infrastructure Firm Simplex Infrastructures Allegedly Hit by Data Breach",
        "Link": "https://dailydarkweb.net/major-indian-infrastructure-firm-simplex-infrastructures-allegedly-hit-by-data-breach/",
        "Summary": "Simplex Infrastructures Ltd., a major Indian engineering and construction company, has allegedly been hit by a significant data breach. A threat actor posted on a dark web forum claiming to have leaked approximately 33GB of sensitive data exfiltrated from the company&#8217;s systems. The company is known for its involvement in large-scale projects across transportation, energy, [&#8230;]",
        "Date": "2025-07-23",
        "Content": "Simplex Infrastructures Ltd., a major Indian engineering and construction company, has allegedly been hit by a significant data breach. A threat actor posted on a dark web forum claiming to have leaked approximately 33GB of sensitive data exfiltrated from the company’s systems. The company is known for its involvement in large-scale projects across transportation, energy, and real estate sectors in India and abroad. The attacker claims to have accessed files from the company’s mail and backup servers, with the breach allegedly occurring on Wednesday, July 23, 2025.\nThe leaked data dump appears to contain highly sensitive corporate and employee information. A sample shared by the threat actor suggests a significant exposure of personally identifiable information (PII). The contents of the leak allegedly include:\nTwo large database backup files from the company’s backup server.\nA mail server database dump that includes 649 user credentials.\nA file containing Linux server credentials.\nThis breach could pose a severe risk to the company’s operational security, exposing internal communications, employee data, and potentially confidential project details.\nTags:\ncyberattack\ndata-breach\ndata-leak\nIndia\nSimplex Infrastructures"
    },
    {
        "Title": "Mous Customer Data Allegedly Leaked –  54,000 Records Up for Sale on Dark Web",
        "Link": "https://dailydarkweb.net/mous-customer-data-allegedly-leaked-54000-records-up-for-sale-on-dark-web/",
        "Summary": "A threat actor has posted on a dark web forum claiming to have breached Mous, a popular UK-based company known for its highly protective and stylish phone cases and tech accessories. The company, which has built a strong brand reputation through viral marketing campaigns showcasing the durability of its products, is now allegedly the victim [&#8230;]",
        "Date": "2025-07-23",
        "Content": "A threat actor has posted on a dark web forum claiming to have breached Mous, a popular UK-based company known for its highly protective and stylish phone cases and tech accessories. The company, which has built a strong brand reputation through viral marketing campaigns showcasing the durability of its products, is now allegedly the victim of a significant data breach. The actor is attempting to sell a database containing what they claim are 54,013 unique customer records.\nThe seller posted the offer on July 23, 2025, stating the data was freshly obtained in a new breach this month. To prove their claim, the threat actor included a sample of the data, which appears to contain sensitive personally identifiable information (PII) from an international customer base. The database is being offered for a price of $500.\nThe compromised information allegedly includes a variety of sensitive customer details that could be exploited for phishing campaigns, identity theft, and other malicious activities. The data types listed for sale include:\nFull Name\nEmail Address\nPhysical Address\nPhone Number\nTags:\nCyberSecurity\ndark web\ndata-breach\ne-commerce\nMous\nPII\ntech accessories"
    }
]