[
    {
        "Title": "Hackers Use GitHub Repositories to Host Amadey Malware and Data Stealers, Bypassing Filters",
        "Link": "https://thehackernews.com/2025/07/hackers-use-github-repositories-to-host.html",
        "Summary": "Threat actors are leveraging public GitHub repositories to host malicious payloads and distribute them via Amadey as part of a campaign observed in April 2025.\n\"The MaaS [malware-as-a-service] operators used fake GitHub accounts to host payloads, tools, and Amadey plug-ins, likely as an attempt to bypass web filtering and for ease of use,\" Cisco Talos researchers Chris Neal and Craig Jackson",
        "Date": "2025-07-17",
        "Content": "Threat actors are leveraging\npublic GitHub repositories\nto host malicious payloads and distribute them via Amadey as part of a campaign observed in April 2025.\n\"The MaaS [malware-as-a-service] operators used fake GitHub accounts to host payloads, tools, and Amadey plug-ins, likely as an attempt to bypass web filtering and for ease of use,\" Cisco Talos researchers Chris Neal and Craig Jackson\nsaid\nin a report published today.\nThe cybersecurity company said the attack chains leverage a malware loader called\nEmmenhtal\n(aka PEAKLIGHT) to deliver Amadey, which, for its part, downloads various custom payloads from public GitHub repositories operated by the threat actors.\nThe activity shares tactical similarities with an email phishing campaign that used invoice payment and billing-related lures to\ndistribute\nSmokeLoader via Emmenhtal in February 2025 in attacks targeting Ukrainian entities.\nBoth Emmenhtal and Amadey function as a downloader for secondary payloads like information stealers, although the latter has also been\nobserved\ndelivering ransomware like LockBit 3.0 in the past.\nAnother crucial distinction between the two malware families is that unlike Emmenhtal, Amadey can collect system information and can be extended feature-wise with an array of DLL plugins that enable a specific functionality, such as credential theft or screenshot capture.\nCisco Talos' analysis of the April 2025 campaign has uncovered three GitHub accounts (Legendary99999, DFfe9ewf, and Milidmdds) being used to host Amadey plugins, secondary payloads, and other malicious attack scripts, including Lumma Stealer, RedLine Stealer, and Rhadamanthys Stealer. The accounts have since been taken down by GitHub.\nSome of the JavaScript files present in the GitHub repositories have been found to be identical to the Emmenthal scripts employed in the SmokeLoader campaign, the primary difference being the payloads downloaded. Specifically, the Emmenhtal loader files in the repositories serve as a delivery vector for Amadey, AsyncRAT, and a legitimate copy of PuTTY.exe.\nAlso discovered in the GitHub repositories is a Python script that likely represents an evolution of Emmenhtal, incorporating an embedded PowerShell command to download Amadey from a hard-coded IP address.\nIt's believed that the GitHub accounts used to stage the payloads are part of a larger MaaS operation that abuses Microsoft's code hosting platform for malicious purposes.\nThe disclosure comes as Trellix detailed a phishing campaign that propagates another malware loader known as\nSquidLoader\nin cyber attacks directed against financial services institutions in Hong Kong. Additional artifacts unearthed by the security vendor suggest related attacks may be underway in Singapore and Australia.\nSquidLoader attack chain\nSquidLoader is a formidable threat owing to the diverse array of anti-analysis, anti-sandbox, and anti-debug techniques packed into it, allowing it to evade detection and hinder investigation efforts. It can also establish communication with a remote server to send information about the infected host and inject the next-stage payload.\n\"SquidLoader employs an attack chain culminating in the deployment of a Cobalt Strike beacon for remote access and control,\" security researcher Charles Crofford\nsaid\n. \"Its intricate anti-analysis, anti-sandbox, and anti-debugging techniques, coupled with its sparse detection rates, pose a significant threat to targeted organizations.\"\nThe findings also follow the discovery of a wide range of social engineering campaigns that are engineered to distribute various malware families -\nAttacks likely undertaken by a financially motivated group referred to as UNC5952 that\nleverage\ninvoice themes in emails to serve malicious droppers that lead to the deployment of a downloader called CHAINVERB that, in turn, delivers the ConnectWise ScreenConnect remote access software\nAttacks that\nemploy\ntax-related decoys to trick recipients into clicking on a link that ultimately delivers a ConnectWise ScreenConnect installer under the pretext of launching a PDF document\nAttacks that\nmake use of\nU.S. Social Security Administration (SSA) themes to harvest user credentials or install trojanized version of ConnectWise ScreenConnect, following which victims are instructed to install and sync Microsoft's Phone Link app to possibly collect text messages and two-factor authentication codes sent to the connected mobile device\nAttacks that\nleverage\na phishing kit called Logokit to enable credential harvesting by creating lookalike login pages and hosting them on Amazon Web Services (AWS) infrastructure to bypass detection, while simultaneously integrating Cloudflare Turnstile CAPTCHA verification to create a false sense of security and legitimacy\nAttacks that\nmake use of\nanother custom Python Flask-based\nphishing kit\nto facilitate credential theft with minimal technical effort\nAttacks codenamed Scanception that\nemploy\nQR codes in PDF email attachments to direct users to credential harvesting pages mimicking the Microsoft login portal\nAttacks that employ the\nClickFix\ntactic to deliver\nRhadamanthys Stealer\nand\nNetSupport RAT\nAttacks that\nutilize\ncloaking-as-a-service (CaaS) offerings like Hoax Tech and JS Click Cloaker to conceal phishing and malicious websites from security scanners and show them only to intended victims as a way to fly under the radar\nAttacks that\nleverage\nHTML and JavaScript to craft malicious realistic-looking emails that can bypass user suspicion and traditional detection tools\nAttacks targeting B2B service providers that\nmake use of\nScalable Vector Graphics (SVG) image files in phishing emails and which embed obfuscated JavaScript to facilitate redirects to attacker-controlled infrastructure using the window.location.href function once they are opened in a web browser\nAccording to data compiled by Cofense, the use of QR codes accounted for 57% of campaigns with advanced Tactics, Techniques, and Procedures (TTPs) in 2024. Other notable methods include the use of password-protected archive attachments in emails to get around secure email gateways (SEG).\n\"By password-protecting the archive, threat actors prevent SEGs and other methods from scanning its contents and detecting what is typically a clearly malicious file,\" Cofense researcher Max Gannon\nsaid\n.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Hackers Exploit Apache HTTP Server Flaw to Deploy Linuxsys Cryptocurrency Miner",
        "Link": "https://thehackernews.com/2025/07/hackers-exploit-apache-http-server-flaw.html",
        "Summary": "Cybersecurity researchers have discovered a new campaign that exploits a known security flaw impacting Apache HTTP Server to deliver a cryptocurrency miner called Linuxsys.\nThe vulnerability in question is CVE-2021-41773 (CVSS score: 7.5), a high-severity path traversal vulnerability in Apache HTTP Server version 2.4.49 that could result in remote code execution.\n\"The attacker leverages",
        "Date": "2025-07-17",
        "Content": "Cybersecurity researchers have discovered a new campaign that exploits a known security flaw impacting Apache HTTP Server to deliver a cryptocurrency miner called\nLinuxsys\n.\nThe vulnerability in question is\nCVE-2021-41773\n(CVSS score: 7.5), a high-severity\npath traversal vulnerability\nin Apache HTTP Server version 2.4.49 that could result in remote code execution.\n\"The attacker leverages compromised legitimate websites to distribute malware, enabling stealthy delivery and evasion of detection,\" VulnCheck\nsaid\nin a report shared with The Hacker News.\nThe infection sequence, observed earlier this month and originating from an Indonesian IP address\n103.193.177[.]152\n, is designed to drop a next-stage payload from \"repositorylinux[.]org\" using curl or wget.\nThe payload is a shell script that's responsible for downloading the Linuxsys cryptocurrency miner from five different legitimate websites, suggesting that the threat actors behind the campaign have managed to compromise third-party infrastructure to facilitate the distribution of the malware.\n\"This approach is clever because victims connect to legitimate hosts with valid SSL certificates, making detection less likely,\" VulnCheck noted. \"Additionally, it provides a layer of separation for the downloader site ('repositorylinux[.]org') since the malware itself isn't hosted there.\"\nThe sites also host another shell script named \"cron.sh\" that ensures that the miner is launched automatically upon a system reboot. Cybersecurity firm said it also identified two Windows executables on the hacked sites, raising the possibility that the attackers are also going after Microsoft's desktop operating system.\nIt's worth noting that attacks distributing the Linuxsys miner have previously\nexploited\na critical security flaw in OSGeo GeoServer GeoTools (CVE-2024-36401, CVSS score: 9.8), as documented by Fortinet FortiGuard Labs in September 2024.\nInterestingly, the shell script dropped following the exploitation of the flaw was downloaded from \"repositorylinux[.]com,\" with comments in the source code written in Sundanese, an Indonesian language. The same shell script has been\ndetected\nin the wild as far back as December 2021.\nSome of the other vulnerabilities exploited to deliver the miner in recent years include -\nCVE-2023-22527\n, a template injection vulnerability in Atlassian Confluence Data Center and Confluence Server\nCVE-2023-34960\n, a command injection vulnerability in Chamilo Learning Management Systems (LMS)\nCVE-2023-38646\n, a command injection vulnerability in Metabase\nCVE-2024-0012 and CVE-2024-9474\n, are authentication bypass and privilege escalation vulnerabilities in Palo Alto Networks firewalls\n\"All of this indicates that the attacker has been conducting a long-term campaign, employing consistent techniques such as n-day exploitation, staging content on compromised hosts, and coin mining on victim machines,\" VulnCheck said.\n\"Part of their success comes from careful targeting. They appear to avoid low interaction honeypots and require high interaction to observe their activity. Combined with the use of compromised hosts for malware distribution, this approach has largely helped the attacker avoid scrutiny.\"\nExchange Servers Targeted by GhostContainer Backdoor\nThe development comes as Kaspersky\ndisclosed\ndetails of a campaign that's targeting government entities in Asia, likely with a N-day security flaw in Microsoft Exchange Server, to deploy a bespoke backdoor dubbed\nGhostContainer\n. It's suspected that the attacks may have exploited a now-patched remote code execution bug in Exchange Server (\nCVE-2020-0688\n, CVSS score: 8.8).\nThe \"sophisticated, multi-functional backdoor\" can be \"dynamically extended with arbitrary functionality through the download of additional modules,\" the Russian company said, adding \"the backdoor grants the attackers full control over the Exchange server, allowing them to execute a range of malicious activities.\"\nThe malware is equipped to parse instructions that can execute shellcode, download files, read or delete files, run arbitrary commands, and load additional .NET byte code. It also incorporates a web proxy and tunneling module.\nIt's suspected that the activity may have been part of an advanced persistent threat (APT) campaign aimed at high-value organizations, including high-tech companies, in Asia.\nNot much is known about who is behind the attacks, although they are assessed to be highly skilled owing to their in-depth understanding of Microsoft Exchange Server and their ability to transform publicly available code into advanced espionage tools.\n\"The GhostContainer backdoor does not establish a connection to any [command-and-control] infrastructure,\" Kaspersky said. \"Instead, the attacker connects to the compromised server from the outside, and their control commands are hidden within normal Exchange web requests.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Europol Disrupts NoName057(16) Hacktivist Group Linked to DDoS Attacks Against Ukraine",
        "Link": "https://thehackernews.com/2025/07/europol-disrupts-noname05716-hacktivist.html",
        "Summary": "An international operation coordinated by Europol has disrupted the infrastructure of a pro-Russian hacktivist group known as NoName057(16) that has been linked to a string of distributed denial-of-service (DDoS) attacks against Ukraine and its allies.\nThe actions have led to the dismantling of a major part of the group's central server infrastructure and more than 100 systems across the world.",
        "Date": "2025-07-17",
        "Content": "An international operation coordinated by Europol has\ndisrupted\nthe infrastructure of a pro-Russian hacktivist group known as NoName057(16) that has been linked to a string of distributed denial-of-service (DDoS) attacks against Ukraine and its allies.\nThe\nactions\nhave led to the dismantling of a major part of the group's central server infrastructure and more than 100 systems across the world. The joint effort also included two arrests in France and Spain, searches of two dozen homes in Spain, Italy, Germany, the Czech Republic, France and Poland, and the issuance of arrest warrants for six Russian nationals.\nThe effort, codenamed Operation Eastwood, took place between July 14 and 17, and involved authorities from Czechia, France, Finland, Germany, Italy, Lithuania, Poland, Spain, Sweden, Switzerland, the Netherlands, and the United States. The investigation was also supported by Belgium, Canada, Estonia, Denmark, Latvia, Romania and Ukraine.\nNoName057(16) has been\noperational\nsince March 2022, acting as a pro-Kremlin collective that mobilizes ideologically motivated sympathizers on Telegram to launch DDoS attacks against websites using a special program called\nDDoSia\nin exchange for a cryptocurrency payment in an effort to keep them incentivized. It sprang up shortly after Russia's invasion of Ukraine.\nFive individuals from Russia have been\nadded\nto the E.U. Most Wanted list for allegedly supporting NoName57(16) -\nAndrey Muravyov (aka DaZBastaDraw)\nMaxim Nikolaevich Lupin (aka s3rmax)\nOlga Evstratova (aka olechochek, olenka)\nMihail Evgeyevich Burlakov (aka Ddosator3000, darkklogo)\nAndrej Stanislavovich Avrosimow (aka ponyaska)\n\"BURLAKOV is suspected of being a central member of the group 'NoName057(16)' and as such of having made a significant contribution to performing DDoS attacks on various institutions in Germany and other countries,\" according to a description posted on the Most Wanted fugitives site.\n\"In particular, he is suspected of assuming a leading role within the group under the pseudonym 'darkklogo' and in this role of having taken decisions including on the development and further optimisation of software for the strategic identification of targets and for developing the attack software, as well as having executed payments relating to renting illicit servers.\"\nEvstratova, also believed to be a core member of the group, has been accused of taking on responsibilities to optimize the DDoSia attack software. Avrosimow has been attributed to 83 cases of computer sabotage.\nEuropol said officials have reached out to more than 1,000 individuals who are believed to be supporters of the cybercrime network, notifying them of the criminal liability they bear for orchestrating DDoS attacks using automated tools.\n\"In addition to the activities of the network, estimated at over 4,000 supporters, the group was also able to construct their own botnet made up of several hundred servers, used to increase the attack load,\" Europol noted.\n\"Mimicking game-like dynamics, regular shout-outs, leaderboards, or badges provided volunteers with a sense of status. This gamified manipulation, often targeted at younger offenders, was emotionally reinforced by a narrative of defending Russia or avenging political events.\"\nIn recent years, threat actors have been observed staging a series of attacks aimed at Swedish authorities and bank websites, as well as against 250 companies and institutions in Germany over the course of 14 separate waves since November 2023.\nLast July, Spain's La Guardia Civil\narrested\nthree suspected members of the group for participating in \"denial-of-service cyber attacks against public institutions and strategic sectors of Spain and other NATO countries.\"\nThe development comes as Russian hacktivist groups like Z-Pentest, Dark Engine, and Sector 16 are increasingly training their sights on critical infrastructure, going beyond DDoS attacks and website defacements that are typically associated with ideologically motivated cyber attacks.\n\"The groups have aligned messaging, coordinated timing, and shared targeting priorities, suggesting deliberate collaboration supporting Russian strategic cyber objectives,\" Cyble\nsaid\n.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "CTEM vs ASM vs Vulnerability Management: What Security Leaders Need to Know in 2025",
        "Link": "https://thehackernews.com/2025/07/ctem-vs-asm-vs-vulnerability-management.html",
        "Summary": "The modern-day threat landscape requires enterprise security teams to think and act beyond traditional cybersecurity measures that are purely passive and reactive, and in most cases, ineffective against emerging threats and sophisticated threat actors. Prioritizing cybersecurity means implementing more proactive, adaptive, and actionable measures that can work together to effectively address the",
        "Date": "2025-07-17",
        "Content": "The modern-day threat landscape requires enterprise security teams to think and act beyond traditional cybersecurity measures that are purely passive and reactive, and in most cases, ineffective against emerging threats and sophisticated threat actors. Prioritizing cybersecurity means implementing more proactive, adaptive, and actionable measures that can work together to effectively address the threats that most affect your business.\nIdeally, these measures should include the implementation of a Continuous Threat Exposure Management (CTEM) program, Vulnerability Management, and Attack Surface Management (ASM), which are all very different from one another, yet overlap. With\nCTEM\n, vulnerability management, and ASM, it’s not a question of which one is “better” or “more effective”, as they complement each other uniquely. By adopting all three, security teams get the continuous visibility and context they need to proactively boost defenses, giving them a leg up over threat actors.\nRead on to discover how the CTEM vs VM vs ASM triad could be the optimal investment for your security-aware organization.\nWhat is Vulnerability Management (VM)?\nVulnerability management is the process of identifying, analyzing, remediating, and managing cybersecurity vulnerabilities across an organization’s IT ecosystem. A well-defined VM process is crucial to proactively identifying and resolving vulnerabilities before adversaries can exploit them to better defend organizations against common cyberattacks.\nVM is an ongoing process that typically includes the following phases:\nVulnerability discovery\nVulnerability assessment and prioritization\nVulnerability resolution\nVulnerability reassessment\nVM improvement\nWhat is Attack Surface Management (ASM)?\nAttack Surface Management\nor ASM is the practice of continuously identifying and prioritizing assets at their most critical attacker entry points across the organization’s attack surface. It is like VM in the sense that both aim to discover, analyze, remediate, and monitor the vulnerabilities within an organization’s attack surface.\nHowever, ASM takes a broader more holistic approach to enterprise security. So where the main goal of VM is to identify and manage known vulnerabilities within known assets, ASM aims to discover and manage all potential entry points for attackers – including those that are unknown.\nIn addition, ASM enables organizations to identify and address vulnerabilities before they can be exploited. ASM tools are intelligent since they can not only discover exposed assets but also provide deep contextual insights into those assets and their critical attacker entry points. By providing deeper contextual insights across the entire attack surface, ASM complements VM and helps strengthen security defenses.\nAs with VM, ASM is an ongoing and cyclical process that typically includes multiple, overlapping phases:\nAsset discovery\nAsset inventory and classification\nVulnerability identification and risk assessment\nAsset prioritization and risk scoring\nVulnerability remediation and reporting\nWhat is Continuous Threat Exposure Management (CTEM)?\nContinuous Threat Exposure Management, often shortened to\nCTEM\n, is a systematic approach to discover, prioritize, validate, and respond to security exposures. A CTEM program provides the structure and framework modern organizations need to proactively and continually monitor their external surfaces, assess the vulnerabilities in those surfaces, and mobilize responses and cross-functional resources to reduce security risks.\nEffective, ongoing CTEM is a five-stage process. These stages are:\nScope for cybersecurity threats (identify the internal and external attack surfaces)\nDiscover assets and build a risk profile for each asset\nPrioritize threats by urgency, security, and level of risk\nTest and validate vulnerabilities with real-world attack simulations\nMobilize resources for vulnerability and threat remediation\nCTEM, VM, and ASM: Overlapping and Complementary Security Approaches\nIt’s important to understand that CTEM is not a stand-alone tool or a single technology-based solution. Rather, it is a\nholistic, proactive\n, and\niterative approach to security\nthat leverages multiple tools and technologies to deliver improved security outcomes.\nAs we have seen, the CTEM lifecycle begins with identifying the organization’s attack surfaces. Here’s where risk-based ASM solutions and VM tools come in. VM tools facilitate vulnerability identification and prioritization, but ASM tools provide visibility into all exposed assets – both known and unknown – and their associated risks.\nThe most effective CTEM programs combine VM and ASM techniques and tools. They also incorporate other offensive security techniques like Pen Testing as a Service (\nTop Pen testing Companies\n),\nred teaming\n, and\nAdversarial Exposure Validation\n(AEV).\nThese technologies mutually reinforce each other to inform risk identification and remediation, manage the organization’s attack surface, and strengthen its security posture. Together, they help to create a holistic CTEM program that provides:\nReal-time visibility into assets and risk exposure for continuous protection\nContext- and risk-informed vulnerability prioritization for more effective resource allocation and remediation\nReal-world vulnerability simulations that highlight the potential impact of the real-world exploitation of identified vulnerabilities\nCentralized insights and actionable recommendations to manage security exposures across the entire digital environment\nOptimize your Security Posture with BreachLock’s Unified Platform for CTEM\nAs we have seen, CTEM, VM, and ASM are not isolated processes or programs. Rather, they overlap with each other to provide more comprehensive visibility into the threat landscape and stronger protection from all kinds of attacks. However, managing different point solutions for VM, ASM, PTaaS, etc. can be complicated and burdensome for security teams.\nBreachLock seamlessly consolidates VM, ASM, and PTaaS solutions into a unified interface to support your holistic CTEM program. It can also consolidate your assets, vulnerabilities, and test findings, map your entire attack surface, unify security testing, and validate attack paths to both ease\nand\npower your security processes.\nBreachLock’s integrated CTEM approach provides a single source of truth that will empower you to:\nGet a complete view of the attack surface\nAccelerate vulnerability and threat remediation\nScale with your environment, no matter its size or complexity\nEnable faster, context-driven decision-making\nGet a clear, comprehensive view of security investments and outcomes\nMature your security program\nDiscover how BreachLock’s solutions align with the five-stage CTEM framework to elevate your defense strategy.\nContact us\nfor a free demo.\nAbout BreachLock\nBreachLock is a global leader in offensive security, delivering scalable and continuous security testing. Trusted by global enterprises, BreachLock provides human-led and AI-powered attack surface management, penetration testing, red teaming, and adversarial exposure validation (AEV) services that help security teams stay ahead of adversaries. With a mission to make proactive security the new standard, BreachLock is shaping the future of cybersecurity through automation, data-driven intelligence, and expert-driven execution.\nKnow Your Risk. Contact BreachLock today!\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Chinese Hackers Target Taiwan's Semiconductor Sector with Cobalt Strike, Custom Backdoors",
        "Link": "https://thehackernews.com/2025/07/chinese-hackers-target-taiwans.html",
        "Summary": "The Taiwanese semiconductor industry has become the target of spear-phishing campaigns undertaken by three Chinese state-sponsored threat actors.\n\"Targets of these campaigns ranged from organizations involved in the manufacturing, design, and testing of semiconductors and integrated circuits, wider equipment and services supply chain entities within this sector, as well as financial investment",
        "Date": "2025-07-17",
        "Content": "The Taiwanese semiconductor industry has become the target of spear-phishing campaigns undertaken by three Chinese state-sponsored threat actors.\n\"Targets of these campaigns ranged from organizations involved in the manufacturing, design, and testing of semiconductors and integrated circuits, wider equipment and services supply chain entities within this sector, as well as financial investment analysts specializing in the Taiwanese semiconductor market,\" Proofpoint\nsaid\nin a report published Wednesday.\nThe activity, per the enterprise security firm, took place between March and June 2025. They have been attributed to three China-aligned clusters it tracks as UNK_FistBump, UNK_DropPitch, and UNK_SparkyCarp.\nUNK_FistBump is said to have targeted semiconductor design, packaging, manufacturing, and supply chain organizations in employment-themed phishing campaigns that resulted in the delivery of Cobalt Strike or a C-based custom backdoor dubbed\nVoldemort\nthat has been previously used in attacks aimed at over 70 organizations globally.\nThe attack chain involves the threat actor posing as a graduate student in emails sent to recruitment and human resources personnel, seeking job opportunities at the targeted company.\nThe messages, likely sent from compromised accounts, include a purported resume (a LNK file masquerading as a PDF) that, when opened, triggers a multi-stage sequence that either leads to the deployment of Cobalt Strike or Voldemort. Simultaneously, a decoy document is displayed to the victim to avoid raising suspicion.\nThe use of Voldemort has been attributed by Proofpoint to a threat actor called TA415, which overlaps with the prolific Chinese nation-state group referred to as APT41 and Brass Typhoon. That said, the Voldemort activity linked to UNK_FistBump is assessed to be distinct from TA415 due to differences in the loader used to drop Cobalt Strike and the reliance on a hard-coded IP address for command-and-control.\nUNK_DropPitch, on the other hand, has been observed striking individuals in multiple major investment firms who focus on investment analysis, particularly within the Taiwanese semiconductor industry. The phishing emails, sent in April and May 2025, embed a link to a PDF document, which, upon opening, downloads a ZIP file containing a malicious DLL payload that's launched using DLL side-loading.\nThe rogue DLL is a backdoor codenamed HealthKick that's capable of executing commands, capturing the results of those runs, and exfiltrating them to a C2 server. In another attack detected in late May 2025, the same DLL side-loading approach has been put to use to spawn a TCP reverse shell that establishes contact with an actor-controlled VPS server 45.141.139[.]222 over TCP port 465.\nThe reverse shell serves as a pathway for the attackers to conduct reconnaissance and discovery steps, and if deemed of interest, drop the Intel Endpoint Management Assistant (EMA) for remote control via the C2 domain \"ema.moctw[.]info.\"\n\"This UNK_DropPitch targeting is exemplary of intelligence collection priorities spanning less obvious areas of the semiconductor ecosystem beyond just design and manufacturing entities,\" Proofpoint said.\nFurther analysis of the threat actor infrastructure has revealed that two of the servers have been configured as SoftEther VPN servers, an open-source VPN solution\nwidely\nused\nby\nChinese hacking groups\n. An additional connection to China comes from the reuse of a TLS certificate for one of the C2 servers. This certificate has been tied in the past in connection with malware families like\nMoonBounce\nand\nSideWalk\n(aka ScrambleCross).\nThat said, it's currently not known if the reuse stems from a custom malware family shared across multiple China-aligned threat actors, such as SideWalk, or due to shared infrastructure provisioning across these groups.\nThe third cluster, UNK_SparkyCarp, is characterized by credential phishing attacks that single out an unnamed Taiwanese semiconductor company using a bespoke adversary-in-the-middle (\nAitM\n) kit. The campaign was spotted in March 2025.\n\"The phishing emails masqueraded as account login security warnings and contained a link to the actor-controlled credential phishing domain accshieldportal[.]com, as well as a tracking beacon URL for acesportal[.]com,\" Proofpoint said, adding the threat actor had previously targeted the company in November 2024.\nThe company said it also observed UNK_ColtCentury, which is also called\nTAG-100\nand\nStorm-2077\n, sending benign emails to legal personnel at a Taiwanese semiconductor organization in an effort to build trust and ultimately deliver a remote access trojan known as Spark RAT.\n\"This activity likely reflects China's strategic priority to achieve semiconductor self-sufficiency and decrease reliance on international supply chains and technologies, particularly in light of U.S. and Taiwanese export controls,\" the company said.\n\"These emerging threat actors continue to exhibit long-standing targeting patterns consistent with Chinese state interests, as well as TTPs and custom capabilities historically associated with China-aligned cyber espionage operations.\"\nSalt Typhoon Goes After U.S. National Guard\nThe development comes as NBC News\nreported\nthat the Chinese state-sponsored hackers tracked as\nSalt Typhoon\n(aka Earth Estries, Ghost Emperor, and UNC2286) broke into at least one U.S. state's National Guard, signaling an expansion of its targeting. The breach is said to have lasted for no less than nine months between March and December 2024.\nThe breach \"likely provided Beijing with data that could facilitate the hacking of other states' Army National Guard units, and possibly many of their state-level cybersecurity partners,\" a June 11, 2025, report from the U.S. Department of Defense (DoD) said.\n\"\nSalt Typhoon\nextensively compromised a US state's Army National Guard's network and, among other things, collected its network configuration and its data traffic with its counterparts' networks in every other U.S. state and at least four U.S. territories.\"\nThe threat actor also exfiltrated configuration files associated with other U.S. government and critical infrastructure entities, including two state government agencies, between January and March 2024. That same year, Salt Typhoon leveraged its access to a U.S. state's Army National Guard network to harvest administrator credentials, network traffic diagrams, a map of geographic locations throughout the state, and PII of its service members.\nThese network configuration files could enable further computer network exploitation of other networks, including data capture, administrator account manipulation, and lateral movement between networks, the report said.\nInitial access has been found to be facilitated by the exploitation of known security vulnerabilities in Cisco (\nCVE-2018-0171, CVE-2023-20198, and CVE-2023-20273\n) and Palo Alto Networks (\nCVE-2024-3400\n) appliances.\n\"Salt Typhoon access to Army National Guard networks in these states could include information on state cyber defense posture as well as the personally identifiable information (PII) and work locations of state cybersecurity personnel – data that could be used to inform future cyber-targeting efforts.\"\nEnsar Seker, CISO at SOCRadar, said in a statement that the attack is a yet another reminder that advanced persistent threat actors are going after federal agencies and state-level components, which may have a more varied security posture.\n\"The revelation that Salt Typhoon maintained access to a U.S. National Guard network for nearly a year is a serious escalation in the cyber domain,\" Seker said. \"This isn't just an opportunistic intrusion. It reflects deliberate, long-term espionage designed to quietly extract strategic intelligence.\"\n\"The group's sustained presence suggests they were gathering more than just files, they were likely mapping infrastructure, monitoring communication flows, and identifying exploitable weak points for future use. What's deeply concerning is that this activity went undetected for so long in a military environment. It raises questions about visibility gaps, segmentation policies, and detection capabilities in hybrid federal-state defense networks.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Cisco Warns of Critical ISE Flaw Allowing Unauthenticated Attackers to Execute Root Code",
        "Link": "https://thehackernews.com/2025/07/cisco-warns-of-critical-ise-flaw.html",
        "Summary": "Cisco has disclosed a new maximum-severity security vulnerability impacting Identity Services Engine (ISE) and Cisco ISE Passive Identity Connector (ISE-PIC) that could permit an attacker to execute arbitrary code on the underlying operating system with elevated privileges.\nTracked as CVE-2025-20337, the shortcoming carries a CVSS score of 10.0 and is similar to CVE-2025-20281, which was patched",
        "Date": "2025-07-17",
        "Content": "Cisco has disclosed a new maximum-severity security vulnerability impacting Identity Services Engine (ISE) and Cisco ISE Passive Identity Connector (ISE-PIC) that could permit an attacker to execute arbitrary code on the underlying operating system with elevated privileges.\nTracked as CVE-2025-20337, the shortcoming carries a CVSS score of 10.0 and is similar to\nCVE-2025-20281\n, which was patched by the networking equipment major late last month.\n\"Multiple vulnerabilities in a specific API of Cisco ISE and Cisco ISE-PIC could allow an unauthenticated, remote attacker to execute arbitrary code on the underlying operating system as root. The attacker does not require any valid credentials to exploit these vulnerabilities,\" the company\nsaid\nin an updated advisory.\n\"These vulnerabilities are due to insufficient validation of user-supplied input. An attacker could exploit these vulnerabilities by submitting a crafted API request. A successful exploit could allow the attacker to obtain root privileges on an affected device.\"\nKentaro Kawane of GMO Cybersecurity has been credited with discovering and reporting the flaw. Kawane was previously\nacknowledged\nfor two other critical Cisco ISE flaws (CVE-2025-20286 and CVE-2025-20282) and another\ncritical bug\nin Fortinet FortiWeb (CVE-2025-25257)\nCVE-2025-20337 affects ISE and ISE-PIC releases 3.3 and 3.4, regardless of device configuration. It does not impact ISE and ISE-PIC release 3.2 or earlier. The issue has been patched in the following versions -\nCisco ISE or ISE-PIC Release 3.3 (Fixed in 3.3 Patch 7)\nCisco ISE or ISE-PIC Release 3.4 (Fixed in 3.4 Patch 2)\nThere is no evidence that the vulnerability has been exploited in a malicious context. That said, it's always a good practice to ensure that systems are kept up-to-date to avoid potential threats.\nThe disclosure comes as The Shadowserver Foundation\nreported\nthat threat actors are likely exploiting\npublicly released exploits\nassociated with CVE-2025-25257 to drop web shells on susceptible Fortinet FortiWeb instances since July 11, 2025.\nAs of July 15, there are\nestimated\nto be 77 infected instances, down from 85 the day before. The majority of the compromises are concentrated around North America (44), Asia (14), and Europe (13).\nData from the attack surface management platform Censys shows that there are 20,098 Fortinet FortiWeb appliances online, excluding honeypots, although it's currently not known how many of these are vulnerable to CVE-2025-25257.\n\"This flaw enables unauthenticated attackers to execute arbitrary SQL commands via crafted HTTP requests, leading to remote code execution (RCE),\" Censys\nsaid\n.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Citrix Bleed 2 exploited weeks before PoCs as Citrix denied attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/citrix-bleed-2-exploited-weeks-before-pocs-as-citrix-denied-attacks/",
        "Summary": "A critical Citrix NetScaler vulnerability, tracked as CVE-2025-5777 and dubbed \"CitrixBleed 2,\" was actively exploited nearly two weeks before proof-of-concept (PoC) exploits were made public, despite Citrix stating that there was no evidence of attacks. [...]",
        "Date": "2025-07-17",
        "Content": "A critical Citrix NetScaler vulnerability, tracked as CVE-2025-5777 and dubbed \"CitrixBleed 2,\" was actively exploited nearly two weeks before\nproof-of-concept (PoC) exploits were made public\n, despite Citrix stating that there was no evidence of attacks.\nGreyNoise has confirmed its honeypots detected targeted exploitation from IP addresses located in China on June 23, 2025.\n\"GreyNoise has observed active exploitation attempts against CVE-2025-5777 (CitrixBleed 2), a memory overread vulnerability in Citrix NetScaler. Exploitation began on June 23 — nearly two weeks before a public proof-of-concept (PoC) was released on July 4,\"\nexplains GreyNoise\n.\n\"We created a tag on July 7 to track this activity. Because GreyNoise retroactively associates pre-tag traffic with new tags, prior exploitation attempts are now visible in the GreyNoise Visualizer.\"\nGreyNoise graph showing unique IPs targeting Citrix Bleed 2\nSource: BleepingComputer\nGreyNoise confirmed to the U.S. Cybersecurity and Infrastructure Security Agency (CISA) on July 9 that the flaw was actively exploited, causing the cyber agency to add it to its Known Exploited Vulnerabilities (KEV) catalog and\ngiving federal agencies one day to patch the flaw\n.\nDespite these early signs and\nrepeated warnings\nfrom security researcher Kevin Beaumont, Citrix had still not acknowledged active exploitation in its\nsecurity advisory for CVE-2025-5777\n. It only quietly updated its\nJune 26 blog post\non July 11, after it appeared in the KEV database the day before.\nCitrix finally released\nanother blog post\non July 15 on how to evaluate NetScaler logs for indicators of compromise.\nHowever, even with this, the company has been under fire for not being transparent and sharing IOCs that researchers have told BleepingComputer were previously shared with the company.\nCitrix has also not responded to BleepingComputer's questions about why the original CVE-2025-5777 advisory still does not acknowledge exploitation.\nThe Citrix Bleed 2 vulnerability\nCitrix Bleed 2 is a critical 9.3 severity vulnerability caused by insufficient input validation, which allows attackers to send malformed POST requests to NetScaler appliances during login attempts.\nThis is exploited by omitting the equal sign in the \"login=\" parameter, causing the device to leak 127 bytes of memory. Researchers from Horizon3 and WatchTowr demonstrated that repeated requests can be used to expose sensitive data such as valid session tokens.\nThese tokens can then be used to hijack Citrix sessions and gain unauthorized access to internal resources.\nSecurity researcher Kevin Beaumont has previously stated that repeated POST requests to\n/doAuthentication.do\nin NetScaler logs is a good indication that someone is attempting to exploit the flaw, especially when the request includes a Content-Length: 5 header.\nOther indications include log entries showing user logoffs where the username consists of unusual characters, such as \"#\", or memory contents printed into incorrect fields.\nBeaumont also warned that Citrix's guidance fails to fully clear compromised sessions.\nWhile Citrix recommends terminating ICA and PCoIP sessions using\nkill icaconnection -all\nand\nkill pcoipConnection -all\n, Beaumont advises also to terminate other session types that may have hijacked sessions:\nkill pcoipConnection -all\r\nkill icaconnection -all\r\nkill rdpConnection -all\r\nkill sshConnection -all\r\nkill telnetConnection -all\r\nkill connConnection -all\r\nkill aaa session -all\nAdmins should also review all sessions before terminating them to check for suspicious logins, such as unexpected IP address changes or unauthorized users.\nCitrix's\nJuly 15 blog post\nshares further guidance on identifying signs of exploitation, such as log entries showing the following messages:\n\"Authentication is rejected for\"\n\"AAA Message\"\nNon-ASCII byte values (0x80–0xFF)\nSession logs can also be manually inspected for unusual IP address changes associated with the same session. For example, in VPN logs, a mismatch between the client_ip and the source IP address may indicate that a session was hijacked.\nIn a recent post, Beaumont states that he has been tracking the exploitation since June, with over 120 companies already compromised by the flaw.\n\"Access started June 20 2025, with access ramping up from June 21 to this as of writing,\"\nwarns Beaumont\n.\n\"I think the activity I see may be one threat actor group — there may be more. They are careful in selecting victims, profiling Netscaler before attacking to make sure it is a real box — e.g. they didn't fall into any of my honeypots.\"\nThe researcher also warns that Citrix's own Web Application Firewall currently does not detect exploitation of CVE-2025-5777. However,\nImperva reports\nthat their product has detected over 11.5 million attempts to exploit this flaw, with 40% targeting the financial sector.\nCitrix has released patches for NetScaler ADC and Gateway versions and is strongly urging immediate upgrades.\nThere are no mitigations beyond patching, and customers running EOL versions (12.1 and 13.0) should upgrade to supported builds.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nCISA tags Citrix Bleed 2 as exploited, gives agencies a day to patch\nPublic exploits released for Citrix Bleed 2 NetScaler flaw, patch now\nCitrix Bleed 2 flaw now believed to be exploited in attacks\nNew Fortinet FortiWeb hacks likely linked to public RCE exploits\nHackers exploit OttoKit WordPress plugin flaw to add admin accounts"
    },
    {
        "Title": "VMware fixes four ESXi zero-day bugs exploited at Pwn2Own Berlin",
        "Link": "https://www.bleepingcomputer.com/news/security/vmware-fixes-four-esxi-zero-day-bugs-exploited-at-pwn2own-berlin/",
        "Summary": "VMware fixed four vulnerabilities in VMware ESXi, Workstation, Fusion, and Tools that were exploited as zero-days during the Pwn2Own Berlin 2025 hacking contest in May 2025. [...]",
        "Date": "2025-07-17",
        "Content": "VMware fixed four vulnerabilities in VMware ESXi, Workstation, Fusion, and Tools that were exploited as zero-days during the Pwn2Own Berlin 2025 hacking contest in May 2025.\nThree of the patched flaws have a severity rating of 9.3, as they allow programs running in a guest virtual machine to execute commands on the host. These flaws are tracked as CVE-2025-41236, CVE-2025-41237, and CVE-2025-41238.\nThese flaws are described in the\nsecurity advisory\nas:\nCVE-2025-41236\n: VMware ESXi, Workstation, and Fusion contain an integer-overflow vulnerability in the VMXNET3 virtual network adapter. Nguyen Hoang Thach of STARLabs SG used this flaw at Pwn2Own.\nCVE-2025-41237\n: VMware ESXi, Workstation, and Fusion contain an integer-underflow in VMCI (Virtual Machine Communication Interface) that leads to an out-of-bounds write. This flaw was used by Corentin BAYET of REverse Tactics at Pwn2Own.\nCVE-2025-41238\n: VMware ESXi, Workstation, and Fusion contain a heap-overflow vulnerability in the PVSCSI (Paravirtualized SCSI) controller that leads to an out of-bounds write. A malicious actor with local administrative privileges on a virtual machine may exploit this issue to execute code as the virtual machine's VMX process running on the host. Thomas Bouzerar and Etienne Helluy-Lafont of Synacktiv at Pwn2Own used this flaw.\nThe fourth flaw, tracked as CVE-2025-41239, received a 7.1 rating as it is an information disclosure. It was also discovered by Corentin BAYET of REverse Tactics, who chained with CVE-2025-41237 during the hacking contest.\nVMware has not provided any workarounds, and the only way to fix these vulnerabilities is to install the new versions of the software.\nIt should be noted that CVE-2025-41239 impacts VMware Tools for Windows, which requires a\ndifferent upgrade process\n.\nThese vulnerabilities were demonstrated as zero-days during the Pwn2Own Berlin 2025 hacking contest, where security researchers collected $1,078,750 after exploiting 29 zero-day vulnerabilities.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nHackers earn $1,078,750 for 28 zero-days at Pwn2Own Berlin\nMozilla fixes Firefox zero-days exploited at hacking contest\nRuckus Networks leaves severe flaws unpatched in management devices\nMicrosoft July 2025 Patch Tuesday fixes one zero-day, 137 flaws\nApple fixes two zero-days exploited in targeted iPhone attacks"
    },
    {
        "Title": "Microsoft Teams voice calls abused to push Matanbuchus malware",
        "Link": "https://www.bleepingcomputer.com/news/security/microsoft-teams-voice-calls-abused-to-push-matanbuchus-malware/",
        "Summary": "The Matanbuchus malware loader has been seen being distributed through social engineering over Microsoft Teams calls impersonating IT helpdesk. [...]",
        "Date": "2025-07-17",
        "Content": "The Matanbuchus malware loader has been seen being distributed through social engineering over Microsoft Teams calls impersonating IT helpdesk.\nMatanbuchus is a malware-as-a-service operation seen promoted on the dark web first in\nearly 2021\n. It was advertised as a $2,500 Windows loader that executes malicious payloads directly in memory to evade detection.\nIn June 2022, threat analyst\nBrad Duncan reported\nthat the malware loader was being used to deliver Cobalt Strike beacons in a large-scale malspam campaign.\nResearchers at Morphisec endpoint threat prevention company found that the latest analyzed version of Matanbuchus includes enhanced evasion, obfuscation, and post-compromise capabilities.\nMicrosoft Teams abuse\nMicrosoft Teams has been abused\nover the past years\nto breach organizations using social engineering to deliver the first stage malware.\nTypically, attackers infiltrate the chat and trick users into downloading a malicious file that then introduces the initial payload on system.\nIn 2023, a researcher created a\nspecialized tool\nthat exploited\nbugs in the software\nto allow malware delivery from external accounts.\nLast year,\nDarkGate malware operators\nabused Microsoft Teams to deliver their loader onto targets who used lax ‘External Access’ settings.\nAccording to Morphisec, operators of the latest Matanbuchus variant, 3.0, also show a preference for Microsoft Teams for initial access.\nThe attacker initiates an external Microsoft Teams call, posing as a legitimate IT helpdesk, convincing the target to launch Quick Assist, the remote support tool built into Windows.\nQuick Assist enables the attacker to gain interactive remote access and follow up by instructing the user to execute a PowerShell script.\nThis script downloads and extracts a ZIP archive with three files that are used to launch the Matanbuchus loader on the device via DLL side-loading.\nMatanbuchus attack chain\nSource: Morphisec\nMatanbuchus 3.0\nMorphisec reports that Matanbuchus 3.0 introduces several new features and enhancements. The developers switched the command-and-control (C2) communication and string obfuscation from RC4 to Salsa20\nThe payloads are now launched in memory, and there is a new anti-sandbox verification routine to make sure that the malware runs only on the defined locales.\nInstead of calling Windows API functions, the malware now executes syscalls via custom shellcode that bypasses Windows API wrappers and EDR hooks, hiding actions that are commonly monitored by security tools.\nAPI calls are further obfuscated by using the ‘MurmurHash3’ non-cryptographic hash function, which makes reverse engineering and static analysis more difficult.\nRegarding Matanbuchus 3.0 post-infection capabilities, it can execute CMD commands, PowerShell, or EXE, DLL, MSI, and shellcode payloads.\nThe malware collects details such as username, domain, OS build information, running EDR/AV processes, and the elevation status of its process (admin or regular user).\nMorphisec's anlysis found that the malware checks the running processes to identify security tools on the system, noting that the exection methods sent back from the C2 \"are likely dependent on the current security stack of the victim.\"\nThe researchers published a\ndetailed technical analysis\nof the malware and say that Matanbuchus has developed \"into a sophisticated threat.\"\nThey also provide indicators of compromise that include malware samples and domains used by the malware.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nNew wave of ‘fake interviews’ use 35 npm packages to spread malware\nDanaBot malware operators exposed via C2 bug added in 2022\nScattered Spider: Three things the news doesn’t tell you\nAndroid malware Crocodilus adds fake contacts to spoof trusted callers\nGoogle sues to disrupt BadBox 2.0 botnet infecting 10 million devices"
    },
    {
        "Title": "Google sues to disrupt BadBox 2.0 botnet infecting 10 million devices",
        "Link": "https://www.bleepingcomputer.com/news/security/google-sues-to-disrupt-badbox-20-botnet-infecting-10-million-devices/",
        "Summary": "Google has filed a lawsuit against the anonymous operators of the Android BadBox 2.0 malware botnet, accusing them of running a global ad fraud scheme against the company's advertising platforms. [...]",
        "Date": "2025-07-17",
        "Content": "Google has filed a lawsuit against the anonymous operators of the Android BadBox 2.0 malware botnet, accusing them of running a global ad fraud scheme against the company's advertising platforms.\nThe BadBox 2.0 malware botnet is a cybercrime operation that utilizes infected Android Open Source Project (AOSP) devices, including smart TVs, streaming boxes, and other connected devices that lack security protections, such as Google Play Protect.\nThese devices become infected either by threat actors purchasing low-cost AOSP devices, modifying the operating system to include the BadBox 2 malware, and then reselling them online, or by tricking users into downloading and installing malicious apps on their devices that contain the malware.\nThe malware then becomes a backdoor that connects to command-and-control (C2) servers operated by the attackers, where it receives commands to execute on the device.\nOnce compromised, devices become part of the BadBox 2.0 botnet, where they are turned into residential proxies sold to other cybercriminals without the victims' knowledge or are used to conduct ad fraud.\nGoogle's lawsuit primarily focuses on the ad fraud component, which the botnet commonly conducts against the company's advertising platforms.\nThis ad fraud is done in three ways:\nHidden ad rendering\n: Fake \"evil twin\" apps are silently installed on infected devices to load hidden ads in the background on attacker-controlled websites with Google ads, generating fraudulent ad revenue for the operation.\nWeb-based game sites\n: Bots are instructed to launch invisible web browsers and play rigged games that rapidly trigger Google ad views. Each ad view results in revenue for the attacker-controlled publisher accounts.\nSearch ad click fraud\n: Bots are instructed to perform search queries on attacker-operated websites that utilize AdSense for Search, generating advertising revenue from advertisements shown in the retrieved search results.\nIn December 2024, the\noriginal BadBox botnet was disrupted by Germany\nafter the country blocked communication between the infected devices and their command and control (C2) infrastructure by sinkholing DNS queries.\nHowever, that did not stop the criminal enterprise, as the threat actors quickly launched BadBox 2.0, which is now believed to have\ninfected over 10 million Android-based devices\nas of April 2025. Google's\ncomplaint\nsays that there are more than 170,000 infected devices in New York state alone.\nGoogle's complaint states that it has already terminated thousands of publisher accounts linked to the operation, but warns that the botnet continues to grow and poses an increasing cybersecurity risk.\n\"If the BadBox 2.0 Scheme is not disrupted, it will continue to proliferate,\" warns Google.\n\"The BadBox 2.0 Enterprise will continue to generate revenue, will use those proceeds to expand its reach, producing new devices and new malware to fuel its criminal activity, and Google will be forced to continue expending substantial financial resources to investigate and combat the Enterprise's fraudulent activity.\"\nBecause the defendants are unknown and believed to reside in China, Google is pursuing relief under the Computer Fraud and Abuse Act and the Racketeer Influenced and Corrupt Organizations (RICO) Act.\nThe company seeks damages and a permanent injunction to dismantle the malware infrastructure and prevent the further spread of the malware.\nIncluded in the complaint is a list of over 100 internet domains that are part of the cybercrime operation's infrastructure.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nFBI: BADBOX 2.0 Android malware infects millions of consumer devices\nAndroid malware Konfety uses malformed APKs to evade detection\nGoogle reveals details on Android’s Advanced Protection for Chrome\nAndroid malware Anatsa infiltrates Google Play to target US banks\nMalware on Google Play, Apple App Store stole your photos—and crypto"
    },
    {
        "Title": "LameHug malware uses AI LLM to craft Windows data-theft commands in real-time",
        "Link": "https://www.bleepingcomputer.com/news/security/lamehug-malware-uses-ai-llm-to-craft-windows-data-theft-commands-in-real-time/",
        "Summary": "A novel malware family named LameHug is using a large language model (LLM) to generate commands to be executed on compromised Windows systems. [...]",
        "Date": "2025-07-17",
        "Content": "A novel malware family named LameHug is using a large language model (LLM) to generate commands to be executed on compromised Windows systems.\nLameHug was discovered by Ukraine’s national cyber incident response team (CERT-UA) and attributed the attacks to Russian state-backed threat group APT28 (a.k.a. Sednit, Sofacy, Pawn Storm, Fancy Bear, STRONTIUM, Tsar Team, Forest Blizzard).\nThe malware is written in Python and relies on the\nHugging Face\nAPI to interact with the\nQwen 2.5-Coder-32B-Instruct\nLLM, which can generate commands according to the given prompts.\nCreated by Alibaba Cloud, the LLM is open-source and designed specifically to generate code, reasoning, and follow coding-focused instructions. It can convert natural language descriptions into executable code (in multiple languages) or shell commands.\nCERT-UA found LameHug after receiving\nreports\non July 10 about malicious emails sent from compromised accounts and impersonating ministry officials, attempting to distribute the malware to executive government bodies.\nMalicious email attempting LameHug infection\nSource: CERT-UA\nThe emails carry a ZIP attachment that contains a LameHub loader. CERT-UA has seen at least three variants named ‘Attachment.pif,’ ‘AI_generator_uncensored_Canvas_PRO_v0.9.exe,’ and ‘image.py.’\nThe Ukrainian agency attributes this activity with medium confidence to the\nRussian threat group APT28\n.\nIn the observed attacks, LameHug was tasked with executing system reconnaissance and data theft commands, generated dynamically via prompts to the LLM.\nThese AI-generated commands were used by LameHug to collect system information and save it to a text file (info.txt), recursively search for documents on key Windows directories (Documents, Desktop, Downloads), and exfiltrate the data using SFTP or HTTP POST requests.\nPrompts sent to the LLM for command generation\nSource: CERT-UA\nLameHug is the first malware publicly documented to include LLM support to carry out the attacker's tasks.\nFrom a technical perspective, it could usher in a new attack paradigm where threat actors can adapt their tactics during a compromise without needing new payloads.\nFurthermore, using Hugging Face infrastructure for command and control purposes may help with making communication stealthier, keeping the intrusion undetected for a longer period.\nBy using dynamically generated commands can also help the malware remain undetected by security software or static analisys tools that look for hardcoded commands.\nCERT-UA did not state whether the LLM-generated commands executed by LameHug were successful.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nOpenAI confirms threat actors use ChatGPT to write malware\nZero-click AI data leak flaw uncovered in Microsoft 365 Copilot\nMicrosoft open-sources VS Code Copilot Chat extension on GitHub\nAPT28 hackers use Signal chats to launch new malware attacks on Ukraine\nNew PathWiper data wiper malware hits critical infrastructure in Ukraine"
    },
    {
        "Title": "Hacker steals $27 million in BigONE exchange crypto breach",
        "Link": "https://www.bleepingcomputer.com/news/security/hacker-steals-27-million-in-bigone-exchange-crypto-breach/",
        "Summary": "Cryptocurrency exchange BigONE announced that it suffered a security breach, in which hackers stole various digital assets valued at $27 million. [...]",
        "Date": "2025-07-17",
        "Content": "Cryptocurrency exchange BigONE disclosed that hackers stole various digital assets valued at $27 million in an attack yesterday.\nThe platform announced that private keys and user data remain unaffected by the intrusion and any customers that incurred losses will be reimbursed from available reserves.\n“In the early hours of July 16, BigONE detected abnormal movements involving a portion of the platform’s assets,”\nreads the announcement\n.\n“Upon investigation, it was confirmed to be the result of a third-party attack targeting our hot wallet.”\nThe company assured users that the attack method was identified and fully contained. BigONE partnered with security firm SlowMist to track the stolen funds and monitor their movement across blockchains.\n“BigONE will fully cover all losses incurred from this incident. User assets will not be affected in any material way,” the exchange said.\nA few hours later, BigONE administrators\nannounced\nthat deposit and trading services had been fully restored following the cyberattack, and withdrawal and OTC functions will be re-enabled shortly (haven’t as of writing).\nAlso, no information has been shared about how exactly the threat actors hacked the exchange and stole the funds but SlowMist said that the exchange was the victim of a supply-chain attack.\nMeanwhile, blockchain observatory\nLookochain reports\nthat the hackers have already engaged in money laundering and exchanged the stolen assets for 120 Bitcoin, 1272 Ether, 2,625 Solana, and 23.3 million Tron.\nBlockchain crime investigator\nZachXBT commented\non the incident, underlining BigONE’s role in processing significant volumes of proceeds coming from romance baiting and investment scams, saying that such hacks may help bring “a natural cleanse” in the space.\nRecord year for crypto theft\nEarlier today,\nChainalysis published\nits 2025 mid-year crypto crime report, reporting that over $2.17 billion has been stolen so far, already more than all of 2024.\nCryptocurrency losses per year\nSource: Chainalysis\nByBit's $1.5B hack\nplayed a key role in achieving this record-breaking figure, giving\nNorth Korean threat actors\nthe leading position so far this year.\nChainalysis highlighted a notable trend where hackers now focus more on personal wallets, which account for 23.35% of all stolen funds this year.\nThe blockchain intelligence firm also presented cases of physical violence for crypto-theft, which are also on the rise, correlating with Bitcoin price increases.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nHacker steals $223 million in Cetus Protocol cryptocurrency heist\nDozens of fake wallet add-ons flood Firefox store to drain crypto\nUS recovers $225 million of crypto stolen in investment scams\nBitoPro exchange links Lazarus hackers to $11 million crypto heist\nPro-Israel hackers hit Iran's Nobitex exchange, burn $90M in crypto"
    },
    {
        "Title": "Chinese hackers breached National Guard to steal network configurations",
        "Link": "https://www.bleepingcomputer.com/news/security/chinese-hackers-breached-national-guard-to-steal-network-configurations/",
        "Summary": "The Chinese state-sponsored hacking group known as Salt Typhoon breached and remained undetected in a U.S. Army National Guard network for nine months in 2024, stealing network configuration files and administrator credentials that could be used to compromise other government networks. [...]",
        "Date": "2025-07-17",
        "Content": "The Chinese state-sponsored hacking group known as Salt Typhoon breached and remained undetected in a U.S. Army National Guard network for nine months in 2024, stealing network configuration files and administrator credentials that could be used to compromise other government networks.\nSalt Typhoon is a Chinese state-sponsored hacking group that is believed to be affiliated with China's Ministry of State Security (MSS) intelligence agency. The hacking group has gained notoriety over the past two years for its wave of attacks on telecommunications and broadband providers worldwide, including\nAT&T, Verizon, Lumen\n,\nCharter, Windstream\n, and\nViasat\n.\nThe goal of some of these attacks was to gain access to sensitive call logs, private communications, and law-enforcement wiretap systems used by the U.S. government.\nNational Guard network breached for nine months\nA June 11\nDepartment of Homeland Security memo\n, first\nreported by NBC\n, says that Salt Typhoon breached a U.S. state's Army National Guard network for nine months between March and December 2024.\nDuring this time, the hackers stole network diagrams, configuration files, administrator credentials, and personal information of service members that could be used to breach National Guard and government networks in other states.\n\"Between March and December 2024, Salt Typhoon extensively compromised a US state's Army National Guard's network and, among other things, collected its network configuration and its data traffic with its counterparts' networks in every other US state and at least four US territories, according to a DOD report,\" reads the memo.\n\"This data also included these networks' administrator credentials and network diagrams—which could be used to facilitate follow-on Salt Typhoon hacks of these units.\"\nThe memo further states that Salt Typhoon has previously utilized stolen network topologies and configuration files to compromise critical infrastructure and U.S. government agencies.\n\"Salt Typhoon has previously used exfiltrated network configuration files to enable cyber intrusions elsewhere,\" continued the memo.\n\"Between January and March 2024, Salt Typhoon exfiltrated configuration files associated with other U.S. government and critical infrastructure entities, including at least two U.S. state government agencies. At least one of these files later informed their compromise of a vulnerable device on another U.S. government agency's network.\"\nNetwork configuration files contain the settings, security profiles, and credentials configured on networking devices, such as routers, firewalls, and VPN gateways. This information is valuable to an attacker, as it can be used to identify paths to and credentials for other sensitive networks that are typically not accessible via the Internet.\nThe DHS warns that between 2023 and 2024, Salt Typhoon stole 1,462 network configuration files associated with approximately 70 U.S. government and critical infrastructure entities from 12 sectors.\nWhile it was not disclosed how Salt Typhoon breached the National Guard network, Salt Typhoon is known for targeting old vulnerabilities in networking devices,\nsuch as Cisco routers\n.\nThe DHS memo shared the following vulnerabilities that Salt Typhoon leveraged in the past to breach networks:\nCVE-2018-0171\n:\nA critical flaw in Cisco IOS and IOS XE Smart Install that allows remote code execution via specially crafted TCP packets.\nCVE-2023-20198\n:\nA zero-day affecting Cisco IOS XE web UI that permits unauthenticated remote access to devices.\nCVE-2023-20273\n:\nA privilege escalation flaw also targeting IOS XE that allows hackers to execute commands as root. This flaw has been seen chained with CVE-2023-20198 to maintain persistence.\nCVE-2024-3400\n:\nA command injection vulnerability in Palo Alto Networks' PAN-OS GlobalProtect, which allows unauthenticated attackers to execute commands on devices.\nDOH also shared the following IP addresses that have been used by Salt Typhoon when exploiting the above vulnerabilities:\n43.254.132[.]118\r\n146.70.24[.]144\r\n176.111.218[.]190\r\n113.161.16[.]130\r\n23.146.242[.]131\r\n58.247.195[.]208\nIn previous attacks, the hackers exploited unpatched Cisco routers in telecom environments to gain access to infrastructure. The attackers used this access to spy on communications of U.S. political campaigns and lawmakers.\nAs part of these attacks, the threat actors deployed custom malware named\nJumblePath\nand\nGhostSpider\nto surveil telecom networks.\nThe DHS memo urges National Guard and government cybersecurity teams to ensure these flaws have been patched and to turn off unnecessary services, segment SMB traffic, implement SMB signing, and enforce access controls.\nA National Guard Bureau spokesperson confirmed the breach to NBC but declined to share specifics, stating that it had not disrupted federal or state missions.\nChina's embassy in Washington did not deny the attack but stated the U.S. had not provided \"conclusive and reliable evidence\" that Salt Typhoon is linked to the Chinese government.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nSalt Typhoon hackers backdoor telcos with new GhostSpider malware\nCanada says Salt Typhoon hacked telecom firm via Cisco flaw\nTelecom giant Viasat breached by China's Salt Typhoon hackers\nCzechia blames China for Ministry of Foreign Affairs cyberattack\nLouis Vuitton says regional data breaches tied to same cyberattack"
    },
    {
        "Title": "Max severity Cisco ISE bug allows pre-auth command execution, patch now",
        "Link": "https://www.bleepingcomputer.com/news/security/max-severity-cisco-ise-bug-allows-pre-auth-command-execution-patch-now/",
        "Summary": "A critical vulnerability (CVE-2025-20337) in Cisco's Identity Services Engine (ISE) could be exploited to let an unauthenticated attacker store malicious files, execute arbitrary code, or gain root privileges on vulnerable devices. [...]",
        "Date": "2025-07-17",
        "Content": "A critical vulnerability (CVE-2025-20337) in Cisco's Identity Services Engine (ISE) could be exploited to let an unauthenticated attacker store malicious files, execute arbitrary code, or gain root privileges on vulnerable devices.\nThe security issue received the maximum severity rating, 10 out of 10, and is caused by insufficient user-supplied input validation checks.\nIt was discovered by Kentaro Kawane, a researcher at the Japanese cybersecurity service GMO Cybersecurity by Ierae, and reported Trend Micro's Zero Day Initiative (ZDI).\nA remote unauthenticated attacker could leverage it by submitting a specially crafted API request\nThe vulnerability was added via an\nupdate to the security bulletin\nfor CVE-2025-20281 and CVE-2025-20282, two\nsimilar RCE vulnerabilities\nthat also received the maximum severity score, that impact ISE and ISE-PIC versions 3.4 and 3.3.\n\"These vulnerabilities affect Cisco ISE and ISE-PIC releases 3.3 and 3.4, regardless of device configuration,\" the vendor notes for CVE-2025-20281 and CVE-2025-20337, adding that \"these vulnerabilities do not affect Cisco ISE and ISE-PIC Release 3.2 or earlier.\"\nAny of the three security issues can be exploited independently.\nCisco also warns that customers who applied the patches for CVE-2025-20281 and CVE-2025-20282 are not covered from CVE-2025-20337, and need to upgrade to ISE 3.3 Patch 7 or ISE 3.4 Patch 2.\nThe product versions below are the only ones currently confirmed to address all three maximum severity vulnerabilities. Workarounds or other mitigations are not available.\nCisco ISE or ISE-PIC Release\nFirst Fixed Release for CVE-2025-20281\nFirst Fixed Release for CVE-2025-20282\nFirst Fixed Release for CVE-2025-20337\n3.2 and earlier\nNot vulnerable\nNot vulnerable\nNot vulnerable\n3.3\n3.3 Patch 7\nNot vulnerable\n3.3 Patch 7\n3.4\n3.4 Patch 2\n3.4 Patch 2\n3.4 Patch 2\nAlthough no exploitation of any of the three critical vulnerabilities has been observed in the wild as of yet, it is recommended that system administrators take immediate action to mitigate the risks.\nAlso yesterday, Cisco released four security advisories for less severe vulnerabilities (medium to high severity rating) in several of its products:\nCVE-2025-20274\n: High-severity arbitrary file upload vulnerability impacting Cisco Unified Intelligence Center, including Unified CCX bundles. Authenticated users with Report Designer privileges can upload malicious files and potentially execute them as root. Fixed in versions 12.5(1) SU ES05 and 12.6(2) ES05.\nCVE-2025-20272\n: Medium-severity blind SQL injection vulnerability in Cisco Prime Infrastructure and EPNM. Low-privileged users can exploit REST APIs to extract unauthorized database content. Resolved in Prime Infrastructure 3.10.6 SU2 and EPNM versions 8.0.1 and 8.1.1.\nCVE-2025-20283, CVE-2025-20284, CVE-2025-20285\n: Medium-severity authenticated RCE and IP access restriction bypass vulnerabilities in Cisco ISE and ISE-PIC. High-privileged users can execute commands as root or log in from unauthorized IPs. Affects versions 3.3 and 3.4; fixed in 3.3 Patch 7 and 3.4 Patch 2.\nCVE-2025-20288\n: Medium-severity SSRF vulnerability in Cisco Unified Intelligence Center, exploitable without authentication. Allows attackers to send arbitrary internal requests via the affected system. Impacts versions 12.5 and 12.6, including Unified CCX bundles. Fixed in 12.5(1) SU ES05 and 12.6(2) ES05.\nCisco notes that there no workarounds for any of the above vulnerabilities and advises customers to determine their risk exposure based on the vendor's information and ensure that the devices have enough memory before considering an upgrade.\nAdditionally, administrators should test and confirm that current configurations for hardware and software components are properly supported by the newer Cisco product release.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nExploit details for max severity Cisco IOS XE flaw now public\nHackers are exploiting critical RCE flaw in Wing FTP Server\nCisco warns of max severity RCE flaws in Identity Services Engine\nSitecore CMS exploit chain starts with hardcoded 'b' password\nNew Veeam RCE flaw lets domain users hack backup servers"
    },
    {
        "Title": "Cisco Discloses '10' Flaw in ISE, ISE-PIC — Patch Now",
        "Link": "https://www.darkreading.com/application-security/cisco-cvss-10-flaw-ise-ise-pic-patch-now",
        "Summary": "Cisco just disclosed a critical severity flaw in its ISE and ISE-PIC products, joining two similar bugs disclosed last month.",
        "Date": "2025-07-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/cisco-cvss-10-flaw-ise-ise-pic-patch-now"
    },
    {
        "Title": "Printer Security Gaps: A Broad, Leafy Avenue to Compromise",
        "Link": "https://www.darkreading.com/endpoint-security/printer-security-gaps-compromise",
        "Summary": "Security teams aren't patching firmware promptly, no one's vetting the endpoints before purchase, and visibility into potential dangers is limited — despite more and more cyberattackers targeting printers as a matter of course.",
        "Date": "2025-07-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/printer-security-gaps-compromise"
    },
    {
        "Title": "Armenian Extradited to US Over Ryuk Ransomware",
        "Link": "https://www.darkreading.com/threat-intelligence/armenian-extradited-ryuk-ransomware",
        "Summary": "The suspect faces three charges for his alleged crimes that could earn him up to five years in federal prison, and a heap of fines.",
        "Date": "2025-07-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/armenian-extradited-ryuk-ransomware"
    },
    {
        "Title": "Why Cybersecurity Still Matters for America's Schools",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/why-cybersecurity-still-matters-americas-schools",
        "Summary": "Cyberattacks on educational institutions are growing. But with budget constraints and funding shortfalls, leadership teams are questioning whether — and how — they can keep their institutions safe.",
        "Date": "2025-07-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/why-cybersecurity-still-matters-americas-schools"
    },
    {
        "Title": "China-Backed Salt Typhoon Hacks US National Guard for Nearly a Year",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/salt-typhoon-hacks-us-national-guard",
        "Summary": "Between March and December of last year, infamous Chinese state-sponsored APT Salt Typhoon gained access to sensitive US National Guard data.",
        "Date": "2025-07-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/salt-typhoon-hacks-us-national-guard"
    },
    {
        "Title": "Watch on Demand: Cloud & Data Security Summit – Tackling Exposed Attack Surfaces in the Cloud",
        "Link": "https://www.securityweek.com/virtual-event-preview-cloud-data-security-summit-2025-tackling-exposed-attack-surfaces-in-the-cloud/",
        "Summary": "<p>Virtual event brings together leading experts, practitioners, and innovators for a full day of insightful discussions and tactical guidance on evolving threats and real-world defense strategies in cloud security. </p>\n<p>The post <a href=\"https://www.securityweek.com/virtual-event-preview-cloud-data-security-summit-2025-tackling-exposed-attack-surfaces-in-the-cloud/\">Watch on Demand: Cloud &amp; Data Security Summit – Tackling Exposed Attack Surfaces in the Cloud</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/virtual-event-preview-cloud-data-security-summit-2025-tackling-exposed-attack-surfaces-in-the-cloud/"
    },
    {
        "Title": "Empirical Security Raises $12 Million for AI-Driven Vulnerability Management",
        "Link": "https://www.securityweek.com/empirical-security-raises-12-million-for-ai-driven-vulnerability-management/",
        "Summary": "<p>Cybersecurity startup Empirical Security has raised $12 million in seed funding for its vulnerability management platform. </p>\n<p>The post <a href=\"https://www.securityweek.com/empirical-security-raises-12-million-for-ai-driven-vulnerability-management/\">Empirical Security Raises $12 Million for AI-Driven Vulnerability Management</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/empirical-security-raises-12-million-for-ai-driven-vulnerability-management/"
    },
    {
        "Title": "Armenian Man Extradited to US Over Ryuk Ransomware Attacks",
        "Link": "https://www.securityweek.com/armenian-man-extradited-to-us-over-ryuk-ransomware-attacks/",
        "Summary": "<p>Karen Serobovich Vardanyan pleaded not guilty to charges related to his alleged role in the Ryuk ransomware operation.</p>\n<p>The post <a href=\"https://www.securityweek.com/armenian-man-extradited-to-us-over-ryuk-ransomware-attacks/\">Armenian Man Extradited to US Over Ryuk Ransomware Attacks</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/armenian-man-extradited-to-us-over-ryuk-ransomware-attacks/"
    },
    {
        "Title": "Mobile Forensics Tool Used by Chinese Law Enforcement Dissected",
        "Link": "https://www.securityweek.com/mobile-forensics-tool-used-by-chinese-law-enforcement-dissected/",
        "Summary": "<p>Deployed on mobile devices confiscated by Chinese law enforcement, Massistant can collect user information, files, and location.</p>\n<p>The post <a href=\"https://www.securityweek.com/mobile-forensics-tool-used-by-chinese-law-enforcement-dissected/\">Mobile Forensics Tool Used by Chinese Law Enforcement Dissected</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/mobile-forensics-tool-used-by-chinese-law-enforcement-dissected/"
    },
    {
        "Title": "Trial Opens Against Meta CEO Mark Zuckerberg and Other Leaders Over Facebook Privacy Violations",
        "Link": "https://www.securityweek.com/trial-opens-against-meta-ceo-mark-zuckerberg-and-other-leaders-over-facebook-privacy-violations/",
        "Summary": "<p>An $8 billion class action investors’ lawsuit against Meta stemming from the 2018 privacy scandal involving the Cambridge Analytica political consulting firm.</p>\n<p>The post <a href=\"https://www.securityweek.com/trial-opens-against-meta-ceo-mark-zuckerberg-and-other-leaders-over-facebook-privacy-violations/\">Trial Opens Against Meta CEO Mark Zuckerberg and Other Leaders Over Facebook Privacy Violations</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/trial-opens-against-meta-ceo-mark-zuckerberg-and-other-leaders-over-facebook-privacy-violations/"
    },
    {
        "Title": "VMware Flaws That Earned Hackers $340,000 at Pwn2Own Patched",
        "Link": "https://www.securityweek.com/vmware-flaws-that-earned-hackers-340000-at-pwn2own-patched/",
        "Summary": "<p>Four CVEs disclosed at the Pwn2Own Berlin 2025 hacking competition have been patched in VMware products.</p>\n<p>The post <a href=\"https://www.securityweek.com/vmware-flaws-that-earned-hackers-340000-at-pwn2own-patched/\">VMware Flaws That Earned Hackers $340,000 at Pwn2Own Patched</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/vmware-flaws-that-earned-hackers-340000-at-pwn2own-patched/"
    },
    {
        "Title": "Cisco Patches Another Critical ISE Vulnerability",
        "Link": "https://www.securityweek.com/cisco-patches-another-critical-ise-vulnerability/",
        "Summary": "<p>Cisco has released patches for multiple vulnerabilities, including a critical flaw in Cisco ISE that leads to remote code execution (RCE).</p>\n<p>The post <a href=\"https://www.securityweek.com/cisco-patches-another-critical-ise-vulnerability/\">Cisco Patches Another Critical ISE Vulnerability</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cisco-patches-another-critical-ise-vulnerability/"
    },
    {
        "Title": "Oracle Patches 200 Vulnerabilities With July 2025 CPU",
        "Link": "https://www.securityweek.com/oracle-patches-200-vulnerabilities-with-july-2025-cpu/",
        "Summary": "<p>Oracle’s July 2025 Critical Patch Update contains 309 security patches that address approximately 200 unique CVEs.</p>\n<p>The post <a href=\"https://www.securityweek.com/oracle-patches-200-vulnerabilities-with-july-2025-cpu/\">Oracle Patches 200 Vulnerabilities With July 2025 CPU</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/oracle-patches-200-vulnerabilities-with-july-2025-cpu/"
    },
    {
        "Title": "Cambodia Makes 1,000 Arrests in Latest Crackdown on Cybercrime",
        "Link": "https://www.securityweek.com/cambodia-makes-1000-arrests-in-latest-crackdown-on-cybercrime/",
        "Summary": "<p>More than 1,000 suspects were arrested in raids in at least five provinces between Monday and Wednesday, according to Information Minister Neth Pheaktra and police.</p>\n<p>The post <a href=\"https://www.securityweek.com/cambodia-makes-1000-arrests-in-latest-crackdown-on-cybercrime/\">Cambodia Makes 1,000 Arrests in Latest Crackdown on Cybercrime</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cambodia-makes-1000-arrests-in-latest-crackdown-on-cybercrime/"
    },
    {
        "Title": "INC Ransom Allegedly Adds 8 More International Firms to Victim List",
        "Link": "https://dailydarkweb.net/inc-ransom-allegedly-adds-8-more-international-firms-to-victim-list/",
        "Summary": "Notorious ransomware group INC Ransom has allegedly breached a diverse set of eight international companies, posting claims of the attacks online throughout Thursday, July 17, 2025. In a bold move, the threat actors published not only the names of their victims but also specific details about their operations and revenue, a tactic designed to add [&#8230;]",
        "Date": "2025-07-17",
        "Content": "Notorious ransomware group INC Ransom has allegedly breached a diverse set of eight international companies, posting claims of the attacks online throughout Thursday, July 17, 2025. In a bold move, the threat actors published not only the names of their victims but also specific details about their operations and revenue, a tactic designed to add pressure and credibility to their threats. The list of targets spans multiple continents and industries, from a non-profit healthcare provider in Belgium to a historic manufacturer in the UK and a national importer in Canada, demonstrating the indiscriminate nature of modern cyber threats.\nThe group’s leak site, which details the alleged victims, paints a vivid picture of the compromised organizations. The data allegedly exfiltrated could pose a significant risk, potentially exposing sensitive corporate, employee, and customer information. The victims, according to the group’s posts, include:\nHuize Sint-Augustinus (Belgium):\nA non-profit residential care organization with a reported revenue of $16.3 million and 45 employees, providing essential services to the elderly.\nHTC Högtryckscenter (Sweden):\nA long-standing Swedish supplier of industrial high-pressure washers, electric work vehicles, and street vacuums, serving municipalities and industrial clients since 1984.\nCrompton Lamps (UK):\nOne of the world’s oldest lamp manufacturers, founded in 1878, with a rich history of providing lighting for prestigious sites like Windsor Castle and a reported revenue of $7.9 million.\nWing Poh Hardware PTE LTD (Singapore):\nA leading Singaporean distributor of industrial, automotive, and garden tools from major international brands, with 30 years of experience and a revenue of $5.8 million.\nSouth East Country Vets (Australia):\nA veterinary service in Australia with an $8 million revenue, providing a wide range of care for companion animals, equines, and livestock.\nTERENCE C RINGLAND & CO PTY LTD (Australia):\nAn Australian professional services firm specializing in accounting, tax preparation, and bookkeeping, with a reported revenue of $5 million.\nComet Strip Enterprises Ltd (Canada):\nA leading Canadian national importer of over 13,000 seasonal and general merchandise products, including Christmas and Halloween items, with a $5 million revenue.\nVitec:\nA provider of contact center solutions designed to help businesses optimize customer satisfaction, training, and service experiences, reportedly generating $5 million in revenue.\nThis campaign utilizes a double-extortion strategy, where the attackers allegedly steal sensitive data before encrypting the victim’s network. The public release of internal information, such as revenue figures, is a powerful intimidation tool used to coerce companies into paying the ransom demand to prevent the full-scale leak of their data. This incident serves as a stark reminder that businesses of all sizes and sectors are vulnerable, and the consequences of a breach can extend far beyond simple financial loss to severe reputational and operational damage.\nTags:\nCrompton Lamps\ncyber-attack\nCyberSecurity\ndata-breach\nINC Ransom\ninternational\nransomware"
    },
    {
        "Title": "‘Operation Eastwood’ Dismantles Pro-Russian DDoS Group NoName057",
        "Link": "https://dailydarkweb.net/operation-eastwood-dismantles-pro-russian-ddos-group-noname057/",
        "Summary": "An international law enforcement operation, dubbed &#8216;Operation Eastwood,&#8217; has successfully disrupted the activities of the pro-Russian cybercrime network known as NoName057(16). The operation, coordinated by Europol and Eurojust, targeted the group&#8217;s infrastructure, which was allegedly used to carry out a series of Distributed Denial-of-Service (DDoS) attacks. The victims of these attacks were primarily entities in [&#8230;]",
        "Date": "2025-07-17",
        "Content": "An international law enforcement operation, dubbed ‘Operation Eastwood,’ has successfully disrupted the activities of the pro-Russian cybercrime network known as NoName057(16). The operation, coordinated by Europol and Eurojust, targeted the group’s infrastructure, which was allegedly used to carry out a series of Distributed Denial-of-Service (DDoS) attacks. The victims of these attacks were primarily entities in Ukraine and countries that have shown support for Ukraine, including many EU Member States. The group’s targets were diverse and included government institutions, critical infrastructure, and private companies, with the attacks allegedly timed to coincide with significant political events to maximize their disruptive impact.\nNoName057 is described as a pro-Russian hacktivist group that emerged after the start of the full-scale invasion of Ukraine. The group allegedly operated by recruiting Russian-speaking sympathizers through online channels and social media. They are accused of using gamified manipulation and cryptocurrency rewards to incentivize supporters to participate in their DDoS campaigns, which aimed to overwhelm their targets’ websites and online services with a flood of internet traffic. The group allegedly used a tool called ‘DDoSia’ to coordinate these attacks, leveraging a network of supporters to amplify their impact.\nThe global operation involved law enforcement and judicial authorities from twelve countries, including the United States. The coordinated action led to the disruption of over one hundred computer systems and the takedown of a significant part of the group’s central server infrastructure. Law enforcement authorities conducted 24 house searches, questioned 13 individuals, and made two arrests. In a significant development, authorities have issued seven international arrest warrants and have now publicly identified five key fugitives on Europol’s ‘Most Wanted’ list. The individuals sought are Andrey Muravyov, Maxim Lupin, Olga Evstratova, Mihail Evgeyevich Burlakov, and Andrej Stanislavovich Avrosimow. While the group’s main activity was DDoS attacks, the provided information does not mention any specific data leaks.\nTags:\nCritical Infrastructure\nCyberSecurity\nDDoS attacks\nEuropol\nhacktivism\nItaly\nMost Wanted\nNoName057\nOperation Eastwood\npro-Russian hackers\nRussia\nUkraine"
    },
    {
        "Title": "DEVMAN Ransomware Group Allegedly Breaches Thai Ministry of Labour",
        "Link": "https://dailydarkweb.net/devman-ransomware-group-allegedly-breaches-thai-ministry-of-labour/",
        "Summary": "The Thai Ministry of Labour (MOL) has allegedly become the latest victim of the notorious DEVMAN ransomware group. The group has claimed to have exfiltrated 300GB of sensitive data and is demanding a $15 million ransom. The Ministry of Labour is a critical government body in Thailand, responsible for overseeing labor relations, social security, and [&#8230;]",
        "Date": "2025-07-17",
        "Content": "The Thai Ministry of Labour (MOL) has allegedly become the latest victim of the notorious DEVMAN ransomware group. The group has claimed to have exfiltrated 300GB of sensitive data and is demanding a $15 million ransom. The Ministry of Labour is a critical government body in Thailand, responsible for overseeing labor relations, social security, and employment services for the nation’s workforce. The potential compromise of such an institution raises serious concerns about the security of sensitive citizen and government data.\nThe DEVMAN group, known for its double-extortion tactics of encrypting files and threatening to leak stolen data, announced the breach on its dark web leak site. While the full extent and nature of the compromised data have not been publicly disclosed, the attackers have pointed to specific government domains as evidence of their intrusion. This incident highlights the persistent and evolving threat that ransomware poses to public sector organizations worldwide, often crippling essential government services and exposing sensitive information.\nThis attack serves as a stark reminder of the importance of robust cybersecurity measures for government agencies. The Thai government has not yet issued a formal statement regarding the alleged breach. The long-term consequences of this attack could be significant, potentially leading to identity theft, financial fraud, and a loss of public trust if sensitive personal and employment-related data is released.\nTags:\nCyberSecurity\ndata-breach\nDEVMAN\ngovernment\nMinistry of Labour\nransomware\nThailand"
    },
    {
        "Title": "Qilin Ransomware Allegedly Breaches Spanish Consulting Firm Joseantonio Rodriguez and US Manufacturing Company Specialty Components",
        "Link": "https://dailydarkweb.net/qilin-ransomware-allegedly-breaches-spanish-consulting-firm-joseantonio-rodriguez-and-us-manufacturing-company-specialty-components/",
        "Summary": "Qilin ransomware group has allegedly targeted two organizations: Joseantonio Rodriguez, a long-standing Spanish consulting firm, and Specialty Components, a US-based manufacturer of precision air bearings. Joseantonio Rodriguez, with over 40 years of experience, offers a wide array of services including tax, accounting, labor, legal consulting, insurance brokerage, and real estate agency services across multiple offices [&#8230;]",
        "Date": "2025-07-17",
        "Content": "Qilin ransomware group has allegedly targeted two organizations: Joseantonio Rodriguez, a long-standing Spanish consulting firm, and Specialty Components, a US-based manufacturer of precision air bearings. Joseantonio Rodriguez, with over 40 years of experience, offers a wide array of services including tax, accounting, labor, legal consulting, insurance brokerage, and real estate agency services across multiple offices in Spain. Specialty Components, established for over 30 years, is a crucial player in semiconductor manufacturing, providing highly specialized components and metal optics. The alleged attacks highlight the persistent threat posed by ransomware groups to diverse industries globally.\nThe full extent of the compromised data is still being assessed, but the attackers allegedly claim to have exfiltrated sensitive information from both entities. The incident underscores the critical need for robust cybersecurity measures across all sectors, regardless of geographical location or industry focus, as even well-established and specialized companies can become targets for sophisticated cyber threats.\nLeaked Data Titles:\nFinancial Statements\nTax Documents\nLegal Consultations\nInsurance Documents\nCompany Registrations\nEmployee Data\nClient Information\nDesign Specifications\nManufacturing Schematics\nProprietary Product Information\nTags:\ncyberattack\nCyberSecurity\ndata-breach\nJoseantonio Rodriguez\nQilin Ransomware\nransomware\nSpain\nSpecialty Components\nUSA"
    }
]