[
    {
        "Title": "Microsoft Links Ongoing SharePoint Exploits to Three Chinese Hacker Groups",
        "Link": "https://thehackernews.com/2025/07/microsoft-links-ongoing-sharepoint.html",
        "Summary": "Microsoft has formally tied the exploitation of security flaws in internet-facing SharePoint Server instances to two Chinese hacking groups called Linen Typhoon and Violet Typhoon as early as July 7, 2025, corroborating earlier reports.\nThe tech giant said it also observed a third China-based threat actor, which it tracks as Storm-2603, weaponizing the flaws as well to obtain initial access to",
        "Date": "2025-07-22",
        "Content": "Microsoft has formally tied the exploitation of security flaws in internet-facing SharePoint Server instances to two Chinese hacking groups called Linen Typhoon and Violet Typhoon\nas early as July 7, 2025\n, corroborating earlier reports.\nThe tech giant said it also observed a third China-based threat actor, which it tracks as Storm-2603, weaponizing the flaws as well to obtain initial access to target organizations.\n\"With the rapid adoption of these exploits, Microsoft assesses with high confidence that threat actors will continue to integrate them into their attacks against unpatched on-premises SharePoint systems,\" the tech giant\nsaid\nin a report published today.\nA brief description of the threat activity clusters is below -\nLinen Typhoon\n(aka\nAPT27\n, Bronze Union, Emissary Panda, Iodine, Lucky Mouse, Red Phoenix, and UNC215), which is active since 2012 and has been previously attributed to malware families like SysUpdate, HyperBro, and PlugX\nViolet Typhoon\n(aka APT31, Bronze Vinewood, Judgement Panda, Red Keres, and Zirconium), which is active since 2015 and has been previously attributed attacks targeting the United States, Finland, and Czechia\nStorm-2603\n, a suspected China-based threat actor that has deployed Warlock and LockBit ransomware in the past\nThe vulnerabilities, which affect on-premises SharePoint servers, have been found to leverage incomplete fixes for CVE-2025-49706, a spoofing flaw, and CVE-2025-49704, a remote code execution bug. The bypasses have been assigned the CVE identifiers CVE-2025-53771 and CVE-2025-53770, respectively.\nIn the attacks observed by Microsoft, the threat actors have been found exploiting on-premises SharePoint servers through a POST request to the ToolPane endpoint, resulting in an authentication bypass and remote code execution.\nAs disclosed by other cybersecurity vendors, the infection chains pave the way for the deployment of a web shell named \"spinstall0.aspx\" (aka spinstall.aspx, spinstall1.aspx, or spinstall2.aspx) that allows the adversaries to retrieve and steal MachineKey data.\nCybersecurity researcher Rakesh Krishnan said \"three distinct Microsoft Edge invocations were identified\" during forensic analysis of a SharePoint exploit. This includes Network Utility Process, Crashpad Handler, and GPU Process.\n\"Each serves a unique function within Chromium's architecture, yet collectively reveals a strategy of behavioral mimicry and sandbox evasion,\" Krishnan\nnoted\n, while also calling attention to the web shell's use of Google's Client Update Protocol (\nCUP\n) to \"blend malicious traffic with benign update checks.\"\nTo mitigate the risk posed by the threat, it's essential that users apply the latest update for SharePoint Server Subscription Edition, SharePoint Server 2019, and SharePoint Server 2016, rotate SharePoint server ASP.NET machine keys, restart Internet Information Services (IIS), and deploy Microsoft Defender for Endpoint or equivalent solutions.\nIt's also recommended to integrate and enable Antimalware Scan Interface (AMSI) and Microsoft Defender Antivirus (or similar solutions) for all on-premises SharePoint deployments and configure AMSI to enable Full Mode.\n\"Additional actors may use these exploits to target unpatched on-premises SharePoint systems, further emphasizing the need for organizations to implement mitigations and security updates immediately,\" Microsoft said.\nWhile the confirmation from Microsoft is the latest hacking campaign linked to China, it is also the second time Beijing-aligned threat actors have targeted the Windows maker. In March 2021, the adversarial collective tracked as Silk Typhoon (aka Hafnium) was tied to a\nmass-exploitation activity\nthat leveraged multiple then-zero-days in Exchange Server.\nEarlier this month, a 33-year-old Chinese national, Xu Zewei, was\narrested\nin Italy and charged with carrying out cyber attacks against American organizations and government agencies by weaponizing the Microsoft Exchange Server flaws, which came to be known as ProxyLogon.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Cisco Confirms Active Exploits Targeting ISE Flaws Enabling Unauthenticated Root Access",
        "Link": "https://thehackernews.com/2025/07/cisco-confirms-active-exploits.html",
        "Summary": "Cisco on Monday updated its advisory of a set of recently disclosed security flaws in Identity Services Engine (ISE) and ISE Passive Identity Connector (ISE-PIC) to acknowledge active exploitation.\n\"In July 2025, the Cisco PSIRT [Product Security Incident Response Team], became aware of attempted exploitation of some of these vulnerabilities in the wild,\" the company said in an alert.\nThe",
        "Date": "2025-07-22",
        "Content": "Cisco on Monday updated its advisory of a set of recently disclosed security flaws in Identity Services Engine (ISE) and ISE Passive Identity Connector (ISE-PIC) to acknowledge active exploitation.\n\"In July 2025, the Cisco PSIRT [Product Security Incident Response Team], became aware of attempted exploitation of some of these vulnerabilities in the wild,\" the company\nsaid\nin an alert.\nThe network equipment vendor did not disclose which vulnerabilities have been weaponized in real-world attacks, the identity of the threat actors exploiting them, or the scale of the activity.\nCisco ISE plays a central role in network access control, managing which users and devices are allowed onto corporate networks and under what conditions. A compromise at this layer could give attackers unrestricted access to internal systems, bypassing authentication controls and logging mechanisms—turning a policy engine into an open door.\nThe vulnerabilities outlined in the alert are all critical-rated bugs (CVSS scores: 10.0) that could allow an unauthenticated, remote attacker to issue commands on the underlying operating system as the root user -\nCVE-2025-20281\nand\nCVE-2025-20337\n- Multiple vulnerabilities in a specific API that could allow an unauthenticated, remote attacker to execute arbitrary code on the underlying operating system as root\nCVE-2025-20282\n- A vulnerability in an internal API that could allow an unauthenticated, remote attacker to upload arbitrary files to an affected device and then execute those files on the underlying operating system as root\nWhile the first two flaws are the result of insufficient validation of user-supplied input, the latter stems from a lack of file validation checks that would prevent uploaded files from being placed in privileged directories on an affected system.\nAs a result, an attacker could leverage these shortcomings by submitting a crafted API request (for CVE-2025-20281 and CVE-2025-20337) or uploading a crafted file to the affected device (for CVE-2025-20282).\nIn light of active exploitation, it's essential that customers upgrade to a fixed software release as soon as possible to remediate these vulnerabilities. These flaws are exploitable remotely without authentication, placing unpatched systems at high risk of pre-auth remote code execution—a top-tier concern for defenders managing critical infrastructure or compliance-driven environments.\nSecurity teams should also review system logs for suspicious API activity or unauthorized file uploads, especially in externally exposed deployments.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Credential Theft and Remote Access Surge as AllaKore, PureRAT, and Hijack Loader Proliferate",
        "Link": "https://thehackernews.com/2025/07/credential-theft-and-remote-access.html",
        "Summary": "Mexican organizations are still being targeted by threat actors to deliver a modified version of AllaKore RAT and SystemBC as part of a long-running campaign.&nbsp;\nThe activity has been attributed by Arctic Wolf Labs to a financially motivated hacking group called Greedy Sponge. It's believed to be active since early 2021, indiscriminately targeting a wide range of sectors, such as retail,",
        "Date": "2025-07-22",
        "Content": "Mexican organizations are still being targeted by threat actors to deliver a modified version of AllaKore RAT and SystemBC as part of a long-running campaign.\nThe activity has been attributed by Arctic Wolf Labs to a financially motivated hacking group called\nGreedy Sponge\n. It's believed to be active since early 2021, indiscriminately targeting a wide range of sectors, such as retail, agriculture, public sector, entertainment, manufacturing, transportation, commercial services, capital goods, and banking.\n\"The AllaKore RAT payload has been heavily modified to enable the threat actors to send select banking credentials and unique authentication information back to their command-and-control (C2) server, for the purpose of conducting financial fraud,\" the cybersecurity company\nsaid\nin an analysis published last week.\nDetails of the campaign were\nfirst documented\nby the BlackBerry Research and Intelligence Team (which is now part of Arctic Wolf) in January 2024, with the attacks employing phishing or drive-by compromises to distribute booby-trapped ZIP archives that ultimately facilitate the deployment of AllaKore RAT.\nAttack chains analyzed by Arctic Wolf show that the remote access trojan is designed to optionally deliver secondary payloads like\nSystemBC\n, a\nC-based malware\nthat turns compromised Windows hosts into\nSOCKS5 proxies\nto allow attackers to communicate with their C2 servers.\nBesides dropping potent proxy tools, Greedy Sponge has also refined and updated its tradecraft to incorporate improved geofencing measures as of mid-2024 in an attempt to thwart analysis.\n\"Historically, geofencing to the Mexican region took place in the first stage, via a .NET downloader included in the trojanized Microsoft software installer (MSI) file,\" the company said. \"This has now been moved server-side to restrict access to the final payload.\"\nThe latest iteration sticks to the same approach as before, distributing ZIP files (\"Actualiza_Policy_v01.zip\") containing a legitimate Chrome proxy executable and a trojanized MSI file that's engineered to drop\nAllaKore RAT\n, a malware with capabilities for keylogging, screenshot capture, file download/upload, and remote control.\nThe MSI file is configured to deploy a .NET downloader, which is responsible for retrieving and launching the remote access trojan from an external server (\"manzisuape[.]com/amw\"), and a PowerShell script for cleanup actions.\nThis is not the first time AllaKore RAT has been used in attacks targeting Latin America. In May 2024, HarfangLab and Cisco Talos\nrevealed\nthat an AllaKore variant known as AllaSenha (aka CarnavalHeist) has been used to single out Brazilian banking institutions by threat actors from the country.\n\"Having spent those four years-plus actively targeting Mexican entities, we would deem this threat actor persistent, but not particularly advanced,\" Arctic Wolf said. \"The strictly financial motivation of this actor coupled with their limited geographic targeting is highly distinctive.\"\n\"Additionally, their operational longevity points to probable operational success – meaning they've found something that works for them, and they are sticking with it. Greedy Sponge has held the same infrastructure models for the duration of their campaigns.\"\nAttack Flow of Campaign Using Ghost Crypt\nThe development comes as eSentire detailed a May 2025 phishing campaign that employed a new\ncrypter-as-a-service\noffering known as Ghost Crypt to deliver and run\nPureRAT\n.\n\"Initial access was gained through social engineering, where the threat actor impersonated a new client and sent a PDF containing a link to a Zoho WorkDrive folder containing malicious zip files,\" the Canadian company\nnoted\n. \"The attacker also created a sense of urgency by calling the victim and requesting that they extract and execute the file immediately.\"\nFurther examination of the attack chain has revealed that the malicious file contains a DLL payload that's encrypted with Ghost Crypt, which then extracts and injects the trojan (i.e., the DLL) into a legitimate Windows csc.exe process using a technique called\nprocess hypnosis injection\n.\nGhost Crypt, which was first advertised by an eponymous threat actor on cybercrime forums on April 15, 2025, offers the ability to bypass Microsoft Defender Antivirus, and serve several stealers, loaders, and trojans like Lumma, Rhadmanthys, StealC, BlueLoader, PureLoader, DCRat, and XWorm, among others.\nThe discovery also follows the\nemergence\nof a new version of\nNeptune RAT\n(aka MasonRAT) that's distributed via JavaScript file lures, allowing the threat actors to extract sensitive data, take screenshots, log keystrokes, drop\nclipper malware\n, and download additional DLL payloads.\nIn recent months, cyber attacks have employed malicious Inno Setup installers that serve as a conduit for\nHijack Loader\n(aka IDAT Loader), which then delivers the RedLine information stealer.\nThe attack \"leverages Inno Setup's Pascal scripting capabilities to retrieve and execute the next-stage payload in a compromised or targeted host,\" the Splunk Threat Research Team\nsaid\n. \"This technique closely resembles the approach used by a well-known malicious Inno Setup loader called\nD3F@ck Loader\n, which follows a similar infection pattern.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "How to Advance from SOC Manager to CISO?",
        "Link": "https://thehackernews.com/2025/07/how-to-advance-from-soc-manager-to-ciso.html",
        "Summary": "Making the move from managing a security operations center (SOC) to being a chief information security officer (CISO) is a significant career leap. Not only do you need a solid foundation of tech knowledge but also leadership skills and business smarts.&nbsp;\nThis article will guide you through the practical steps and skills you’ll need to nab an executive cybersecurity job and make the",
        "Date": "2025-07-22",
        "Content": "Making the move from managing a security operations center (SOC) to being a chief information security officer (CISO) is a significant career leap. Not only do you need a solid foundation of tech knowledge but also leadership skills and business smarts.\nThis article will guide you through the practical steps and skills you'll need to nab an executive cybersecurity job and make the promotion from SOC manager to CISO a reality.\nIs the CISO role right for you?\nIt's always a good idea to think about how you could move up and grow in your career. Aspiring to be a CISO can be a great career move.\nAdditionally, certain operational tasks in cybersecurity, especially in a SOC, are becoming increasingly automated, making it vital to develop strategic and leadership skills to stay ahead. Having ambitious goals helps you, as a SOC analyst or lead, stay relevant and valuable in what is a constantly changing field.\nHowever, the role of CISO is significantly different from other roles in cybersecurity and comes with its own set of challenges. So, while it is a good option, it's not the only path and might not suit everyone's strengths and career goals. It's my hope that this article will lay out what being a CISO is all about so you can determine if it's the path you want to take.\nKey skills for executive growth\nFor those looking to take on executive and leadership roles like CISO, it's essential to develop skills beyond the scope of your typical IT role.\nHaving a comprehensive IT background is a significant advantage, especially when it comes to security vulnerabilities and how to respond to incidents. But you can't focus solely on technical expertise at the expense of vital leadership, communication, and strategic thinking skills needed for the position of CISO.\nRemember: You'll have to relay complex security matters to stakeholders outside IT, and do so in a way that they can easily understand the issues at stake.\nLet's break down areas you'll need for the role of executive.\nStrategic thinking\nStrategic thinking demands a firm grip on the organization's core operations, particularly how it generates revenue and its key value streams. This perspective allows security professionals to align their efforts with business objectives, rather than operating in isolation.\nBusiness acumen\nThis is related to strategic thinking but emphasizes knowledge of risk management and finance. Security leaders must factor in financial impacts to justify security investments and manage risks effectively.\nBalancing security measures with user experience and system availability is another critical aspect. If security policies are too strict, productivity can suffer; if they're too permissive, the company can be exposed to threats. Decisions must consider the impact of security actions on the broader business environment.\nCommunication\nEffective communication is vital for translating technical details into language senior stakeholders can grasp and act upon. This means avoiding jargon and abbreviations to convey information in a simplistic manner that resonates with multiple stakeholders, including executives who may not have a deep technical background.\nCommunicating the impact of security initiatives in clear, concise language ensures decisions are well-informed and support company goals.\nService management\nYou will have to ensure technical services meet business requirements, particularly in managing service delivery, implementing change, and resolving issues. All of this is essential for a secure and efficient IT infrastructure.\nKnowledge of risk management as mentioned above, is fundamental in identifying, assessing, and mitigating risks. It helps align security strategies with business goals, facilitating informed decisions and resource allocation.\nCompliance\nBeing aware of compliance requirements, involving adherence to regulatory and industry standards (e.g., GDPR, HIPAA, NIS2, PCI DSS), is critical for ensuring legal and ethical operations. Understanding these mandates helps in implementing appropriate security controls and policies.\nExposure to legal aspects, such as data privacy laws and intellectual property rights, broadens the perspective necessary for the CISO role and interactions with both external and internal bodies such as the\nGRC\nwithin your organization. Here, formal education, including a degree in computer science or cybersecurity, combined with continuous learning via industry courses and certifications, strengthens your expertise; it also prepares you for leadership responsibilities and demonstrates your readiness to take on the challenges that come with the job.\nPractical advice for career transition\nTo successfully transition and advance your cybersecurity career, you'll need to take concrete strategic steps toward a CISO role.\nGaining visibility, building influence, and getting promoted\nTo advance your cybersecurity career, make your value known. Share your contributions and accomplishments, both within your team and also with other departments and leadership.\nWhen presenting data, make it actionable by showing how the information drives improvements and supports business goals via tactical metrics and simple language. Also, actively look for opportunities to contribute to broader initiatives and offer solutions to challenges that extend beyond your current role and responsibilities.\nTo set yourself apart as someone ready for a promotion to the executive level, take initiative and demonstrate a willingness to lead.\nAvoiding common pitfalls\nOne common mistake is to communicate based on your or another person's assumptions. Always verify information, and remember, opinions are not facts.\nAnother pitfall is believing your angle or viewpoint is the only correct one. Other perspectives exist and hold value.\nAs much as possible, embrace a collaborative approach, focused on building consensus and defining the right direction rather than prioritizing speed. This means engaging in open discussions, listening to feedback, and working towards a shared understanding. This will yield a stronger foundation for initiatives and avoid potential disagreements or misinterpretations down the road.\nWhat exactly does being a CISO entail?\nTo succeed at the executive level, you need to be aware of the nuances of the CISO job, expectations depending on your company's structure, and the different roles you'll have to fulfill before being entrusted with the title of CISO.\nWho does your CISO report to?\nThe reporting structure of a chief information security officer varies widely across organizations. Often, the CISO reports to the chief information officer (CIO). In this structure, security is seen as a subset of IT, focusing on the technical aspects of protecting data and systems.\nHowever, as cybersecurity risks become more business-critical, CISOs are increasingly reporting to the chief financial officer (CFO) or the chief risk officer (CRO). Reporting to the CFO emphasizes the financial impact of security breaches and the need for risk-based security investments. But if you're reporting to the CRO, you'll need to highlight the enterprise-wide risk management perspective, ensuring security is integrated into broader organizational risk strategies.\nThe reporting line significantly influences the CISO's priorities and scope of authority, reflecting a company's overall security maturity and approach to risk. It's a good idea to consider your own company's structure and how it aligns with your career goals and potential advancement.\nWhat changes at the top: Roles & expectations\nTransitioning from a technical lead to an executive role like CISO entails a complete shift in expectations.\nAs a technical lead, the focus is primarily on hands-on implementation, troubleshooting, and technical problem-solving. At the executive level, the emphasis shifts to strategy, leadership, and business alignment.\nCISOs are expected to develop and execute a comprehensive security strategy that protects the organization's assets while enabling business operations. This is where decision-making becomes more strategic, requiring CISOs to balance risk mitigation with business objectives.\nThey must also effectively communicate technical risks to senior management in terms of their business impact. This covers everything from budgeting and policy development to regulatory compliance and security team management.\nKey roles & responsibilities above technical lead\nAdvancement from technical lead to CISO involves several intermediate roles; each one has distinct responsibilities and demands a higher level of leadership, strategic thinking, and business savvy.\nA\nSOC manager\noversees the daily operations of the security operations center. That means making sure incident detection and response are efficient and effective. Responsibilities here include managing staff, developing processes, and reporting on metrics.\nA\ndirector of security\ntypically has a broader scope, handling multiple security functions like network security, application security, and vulnerability management. Directors develop security programs, manage budgets, and ensure compliance with regulations.\nThe\nCISO\nis the top security executive, responsible for the overall security strategy and posture of the organization. They align security with business goals, manage risk, and communicate with executive leadership.\nBecoming a CISO is a progressive journey of developing skills and taking on broader responsibilities.\nSummary and key takeaways\nThe journey from a SOC analyst or manager to CISO is a significant undertaking. You're not just becoming a better expert but evolving into a leader who can align security with business objectives.\nEmbracing a leadership mindset involves more than just managing tasks. You need to inspire teams, influence stakeholders, and drive strategic decisions. All of this takes communication skills, strategic thinking, and business acumen to manage risks effectively and communicate complex technical information in simple terms.\nBe proactive in seeking visibility and influence within your organization and avoid common pitfalls like making assumptions and prioritizing speed over consensus.\nFinally, understand the reporting structure and evolving expectations of a CISO. By setting long-term goals and embracing a leadership mindset, you can successfully navigate the transition to a CISO and thrive in what is both a challenging and rewarding role.\nAdaptive AI for the SOC\nInterested in learning how you can build a modern SOC that focuses your analysts on real threats, eliminating false positives and alert fatigue? Radiant Security's\nadaptive AI SOC platform\ncan autonomously triage ALL alert types (without any pre-training required), dynamically generating a tailored response for every threat that can be reviewed by human analysts and implemented in 1 click or automatically.\nTo see Radiant in action, book a demo\nhere\n.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Hackers Exploit SharePoint Zero-Day Since July 7 to Steal Keys, Maintain Persistent Access",
        "Link": "https://thehackernews.com/2025/07/hackers-exploit-sharepoint-zero-day.html",
        "Summary": "The recently disclosed critical Microsoft SharePoint vulnerability has been under exploitation as early as July 7, 2025, according to findings from Check Point Research.\nThe cybersecurity company said it observed first exploitation attempts targeting an unnamed major Western government, with the activity intensifying on July 18 and 19, spanning government, telecommunications, and software",
        "Date": "2025-07-22",
        "Content": "The recently disclosed\ncritical Microsoft SharePoint vulnerability\nhas been under exploitation as early as July 7, 2025, according to findings from Check Point Research.\nThe cybersecurity company\nsaid\nit observed first exploitation attempts targeting an unnamed major Western government, with the activity intensifying on July 18 and 19, spanning government, telecommunications, and software sectors in North America and Western Europe.\nCheck Point also said the exploitation efforts originated from three different IP addresses – 104.238.159[.]149, 107.191.58[.]76, and 96.9.125[.]147 – one of which was previously tied to the weaponization of security flaws in Ivanti Endpoint Manager Mobile (EPMM) appliances (\nCVE-2025-4427 and CVE-2025-4428\n).\n\"We're witnessing an urgent and active threat: a critical zero-day in SharePoint on-prem is being exploited in the wild, putting thousands of global organizations at risk,\" Lotem Finkelstein, Director of Threat Intelligence at Check Point Research, told The Hacker News.\n\"Our team has confirmed dozens of compromise attempts across government, telecom, and tech sectors since July 7. We strongly urge enterprises to update their security systems immediately – this campaign is both sophisticated and fast-moving.\"\nThe attack chains have been observed leveraging CVE-2025-53770, a newly patched remote code execution flaw in SharePoint Server, and chaining it with CVE-2025-49706, a spoofing vulnerability that was patched by Microsoft as part of its July 2025 Patch Tuesday update, to gain initial access and escalate privileges.\nIt's worth mentioning at this stage that there are two sets of vulnerabilities in SharePoint that have come to light this month -\nCVE-2025-49704\n(CVSS score: 8.8) - Microsoft SharePoint Remote Code Execution Vulnerability (Fixed on July 8, 2025)\nCVE-2025-49706\n(CVSS score: 7.1) - Microsoft SharePoint Server Spoofing Vulnerability (Fixed on July 8, 2025)\nCVE-2025-53770\n(CVSS score: 9.8) - Microsoft SharePoint Server Remote Code Execution Vulnerability\nCVE-2025-53771\n(CVSS score: 7.1) - Microsoft SharePoint Server Spoofing Vulnerability\nCVE-2025-49704 and CVE-2025-49706, collectively referred to as ToolShell, is an exploitation chain that can lead to remote code execution on SharePoint Server instances. They were\noriginally disclosed\nby Viettel Cyber Security during the Pwn2Own 2025 hacking competition earlier this May.\nCVE-2025-53770 and CVE-2025-53771, which became public knowledge over the weekend, have been described as variants of CVE-2025-49704 and CVE-2025-49706, respectively, indicating that they are bypasses for the original fixes put in place by Microsoft earlier this month.\nThis is evidenced by the fact that Microsoft\nacknowledged\nactive attacks exploiting \"vulnerabilities partially addressed by the July Security Update.\" The company also noted in its advisories that the updates for CVE-2025-53770 and CVE-2025-53771 include \"more robust protections\" than the updates for CVE-2025-49704 and CVE-2025-49706. However, it bears noting that CVE-2025-53771 has not been flagged by Redmond as actively exploited in the wild.\n\"CVE-2025-53770 exploits a weakness in how Microsoft SharePoint Server handles the deserialization of untrusted data,\" Martin Zugec, technical solutions director at Bitdefender,\nsaid\n. \"Attackers are leveraging this flaw to gain unauthenticated remote code execution.\"\nThis, in turn, is achieved by deploying malicious ASP.NET web shells that programmatically extract sensitive cryptographic keys. These stolen keys are subsequently leveraged to craft and sign malicious __VIEWSTATE payloads, thereby establishing persistent access and enabling the execution of arbitrary commands on SharePoint Server.\nAccording to Bitdefender telemetry, in-the-wild exploitation has been detected in the United States, Canada, Austria, Jordan, Mexico, Germany, South Africa, Switzerland, and the Netherlands, suggesting widespread abuse of the flaw.\nPalo Alto Networks Unit 42, in its own analysis of the campaign, said it observed commands being run to execute a Base64-encoded PowerShell command, which creates a file at the location \"C:\\PROGRA~1\\COMMON~1\\MICROS~1\\WEBSER~1\\16\\TEMPLATE\\LAYOUTS\\spinstall0.aspx\" and then parses its content.\n\"The spinstall0.aspx file is a web shell that can execute various functions to retrieve ValidationKeys, DecryptionKeys, and the CompatabilityMode of the server, which are needed to forge ViewState Encryption keys,\" Unit 42\nsaid\nin a threat brief.\nContent of spinstall0.aspx\nIn an advisory issued Monday, SentinelOne said it first detected exploitation on July 17, with the cybersecurity company identifying three \"distinct attack clusters,\" including state-aligned threat actors, engaging in reconnaissance and early-stage exploitation activities.\nTargets of the campaigns include technology consulting, manufacturing, critical infrastructure, and professional services tied to sensitive architecture and engineering organizations.\n\"The early targets suggest that the activity was initially carefully selective, aimed at organizations with strategic value or elevated access,\" researchers Simon Kenin, Jim Walter, and Tom Hegel\nsaid\n.\nAnalysis of the attack activity has revealed the use of a password-protected ASPX web shell (\"xxx.aspx\") on July 18, 2025, at 9:58 a.m. GMT. The web shell supports three functions: Authentication via an embedded form, command execution via cmd.exe, and file upload.\nSubsequent exploitation efforts have been found to employ the \"spinstall0.aspx\" web shell to extract and expose sensitive cryptographic material from the host.\nSpinstall0.aspx is \"not a traditional command web shell but rather a reconnaissance and persistence utility,\" the researchers explained. \"This code extracts and prints the host's MachineKey values, including the ValidationKey, DecryptionKey, and cryptographic mode settings -- information critical for attackers seeking to maintain persistent access across load-balanced SharePoint environments or to forge authentication tokens.\"\nUnlike other web shells that are typically dropped on internet-exposed servers to facilitate remote access, spinstall0.aspx appears to be designed with the sole intention of gathering cryptographic secrets that could then be used to forge authentication or session tokens across SharePoint instances.\nThese attacks, per\nCrowdStrike\n, commence with a specially crafted HTTP POST request to an accessible SharePoint server via the\n\"/_layouts/15/ToolPane.aspx\" endpoint\nthat attempts to write spinstall0.aspx via PowerShell. The company said it blocked hundreds of exploitation attempts across more than 160 customer environments.\nSentinelOne also discovered a cluster dubbed \"no shell\" that took a \"more advanced and stealthy approach\" to other threat actors by opting for in-memory .NET module execution without dropping any payloads on disk. The activity originated from the IP address 96.9.125[.]147.\n\"This approach significantly complicates detection and forensic recovery, underscoring the threat posed by fileless post-exploitation techniques,\" the company said, positing that it's either a \"skilled red team emulation exercise or the work of a capable threat actor with a focus on evasive access and credential harvesting.\"\nIt's currently not known who is behind the attack activity, although Google-owned Mandiant has\nattributed\nthe early-exploitation to a China-aligned hacking group.\nData from Censys\nshows\nthat there are 9,762 on-premises SharePoint servers online, although it's currently not known if all of them are susceptible to the flaws. Given that SharePoint servers are a lucrative target for threat actors due to the nature of sensitive organizational data stored in them, it's essential that users move quickly to\napply the fixes\n, rotate the keys, and restart the instances.\n\"We assess that at least one of the actors responsible for the early exploitation is a China-nexus threat actor,\" Charles Carmakal, CTO, Mandiant Consulting at Google Cloud,\nsaid\nin a post on LinkedIn. \"We're aware of victims in several sectors and global geographies. The activity primarily involved the theft of machine key material which could be used to access victim environments after the patch has been applied.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Lumma infostealer malware returns after law enforcement disruption",
        "Link": "https://www.bleepingcomputer.com/news/security/lumma-infostealer-malware-returns-after-law-enforcement-disruption/",
        "Summary": "The Lumma infostealer malware operation is gradually resuming activities following a massive law enforcement operation in May, which resulted in the seizure of 2,300 domains and parts of its infrastructure. [...]",
        "Date": "2025-07-22",
        "Content": "The Lumma infostealer malware operation is gradually resuming activities following a massive law enforcement operation in May, which resulted in the seizure of 2,300 domains and parts of its infrastructure.\nAlthough the Lumma malware-as-a-service (MaaS) platform suffered significant disruption from the\nlaw enforcement action\n, as confirmed by\nearly June reports\non infostealer activity, it didn't shut down.\nThe operators immediately acknowledged the situation on XSS forums, but claimed that their central server had not been seized (although it had been remotely wiped), and restoration efforts were already underway.\nLumma admin's first message after the law enforcement action\nSource: Trend Micro\nGradually, the MaaS built up again and regained trust within the cybercrime community, and is now facilitating infostealing operations on multiple platforms again.\nAccording to Trend Micro analysts, Lumma has almost returned to pre-takedown activity levels, with the cybersecurity firm's telemetry indicating a rapid rebuilding of infrastructure.\n\"Following the law enforcement action against Lumma Stealer and its associated infrastructure, our team has observed clear signs of a resurgence in Lumma's operations,\"\nreads the Trend Micro report\n.\n\"Network telemetry indicates that Lumma's infrastructure began ramping up again within weeks of the takedown.\"\nNew Lumma C2 domains\nSource: Trend Micro\nTrend Micro reports that Lumma still uses legitimate cloud infrastructure to mask malicious traffic, but has now shifted from Cloudflare to alternative providers, most notably the Russian-based Selectel, to avoid takedowns.\nThe researchers have highlighted four distribution channels that Lumma currently uses to achieve new infections, indicating a full-on return to multifaceted targeting.\nFake cracks/keygens\n: Fake software cracks and keygens are promoted via malvertising and manipulated search results. Victims are directed to deceptive websites that fingerprint their system using Traffic Detection Systems (TDS) before serving the Lumma Downloader.\nClickFix\n: Compromised websites display fake CAPTCHA pages that trick users into running PowerShell commands. These commands load Lumma directly into memory, helping it evade file-based detection mechanisms.\nGitHub\n: Attackers are actively creating GitHub repositories with AI-generated content advertising fake game cheats. These repos host Lumma payloads, like \"TempSpoofer.exe,\" either as executables or in ZIP files.\nYouTube/Facebook\n: Current Lumma distribution also involves YouTube videos and Facebook posts promoting cracked software. These links lead to external sites hosting Lumma malware, which sometimes abuses trusted services like sites.google.com to appear credible.\nMalicious GitHub repository (left) and YouTube video (right) distributing Lumma payloads\nSource: Trend Micro\nThe re-emergence of Lumma as a significant threat demonstrates that law enforcement action, devoid of arrests or at least indictments, is ineffective in stopping these determined threat actors.\nMaaS operations, such as Lumma, are incredibly profitable, and the leading operators behind them likely view law enforcement action as routine obstacles they merely have to navigate.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nMicrosoft Teams voice calls abused to push Matanbuchus malware\n‘Russian Market’ emerges as a go-to shop for stolen credentials\nAtomic macOS infostealer adds backdoor for persistent attacks\n'Stargazers' use fake Minecraft mods to steal player passwords\nDiscord flaw lets hackers reuse expired invites in malware campaign"
    },
    {
        "Title": "Windows 11 KB5062660 update brings new 'Windows Resilience' features",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5062660-update-brings-new-windows-resilience-features/",
        "Summary": "​​Microsoft has released the KB5062660 preview cumulative update for Windows 11 24H2 with twenty-nine new features or changes, with many gradually rolling out, such as the new Black Screen of Death and Quick Machine Recovery tool. [...]",
        "Date": "2025-07-22",
        "Content": "​​Microsoft has released the KB5062660 preview cumulative update for Windows 11 24H2 with twenty-nine new features or changes, with many gradually rolling out, such as the new Black Screen of Death and Quick Machine Recovery tool.\nThe\nKB5062660\nupdate is part of the company's optional non-security preview updates schedule, which releases updates at the end of each month to test new fixes and features coming to next month's August Patch Tuesday.\nUnlike regular Patch Tuesday cumulative updates, monthly non-security preview updates do not include security updates and are optional.\nYou can install the KB5062660 update by opening\nSettings\n, clicking on\nWindows Update,\nand then\n\"Check for Updates\n.\"\nBecause this is an optional update, you will be asked if you want to install it by clicking the \"Download and install\" link unless you have the \"Get the latest updates as soon as they're they're available\" option enabled, which will cause the update to automatically install.\nKB5062660 preview update (BleepingCoputer)\nYou can also manually download and install the KB5062660 preview update from the\nMicrosoft Update Catalog\n.\nWindows 11 KB5062660 highlights\nOnce installed, this optional cumulative release will update Windows 11 24H2 systems to build 26100.4770.\nThe July 2025 preview update features many new additions that are gradually rolling out, including\nnew Windows Resiliency Initiative features\n—the new Black Screen of Death and the Quick Machine Recovery tool.\nMicrosoft's Windows Resiliency Initiative is a new effort by Microsoft to make Windows more stable, self-healing, and faster to recover from critical failures.\nWindows 11 users can enable Quick Machine Recovery by navigating to\nSettings\n>\nSystem\n>\nRecovery\n>\nQuick Machine Recovery settings\n.\nQuick Machine Recovery settings\nSource: BleepingComputer\nThe complete list of changes is below.\n[Recall]\nNew!\nRecall is now available in the European Economic Area (EEA). For more info, see\nRetrace your steps with Recall\n. In the EEA, Recall supports exporting snapshots to share with trusted third-party apps and websites. When saving snapshots is turned on for the first time, a unique Recall export code appears. This code is required to decrypt exported snapshots and is shown only once during initial setup. Microsoft doesn’t store or recover this code. To export, go to\nSettings\n>\nPrivacy & Security\n>\nRecall & Snapshots\n>\nAdvanced Settings\nand authenticate with Windows Hello. Choose to export past snapshots (from the last 7 days, 30 days, or all) or start a continuous export. Third-party apps can access exported snapshots only when both the export code and folder path are provided. If you lose or compromise the export code, reset Recall to generate a new one.\nNew!\nFor all Recall users worldwide, you can now reset Recall and delete all its data. Go to\nSettings\n>\nPrivacy & Security\n>\nRecall & Snapshots\nto find a new advanced settings page. There, you’ll see a reset button that deletes all your snapshots and restores Recall to its default settings.\n[Click to Do]\nNew!\n1\nPractice in Reading Coach\nis a new Click to Do text action that helps you improve reading fluency and pronunciation. Select text on your screen, choose\nPractice in Reading Coach\n, and read the text aloud. Reading Coach gives you feedback and shows where to improve. To use this feature,\ninstall the free Microsoft Reading Coach app from the Microsoft Store\n.\nNew!\n1\nRead with Immersive Reader\nis a new text action in Click to Do that displays text in a focused, distraction-free environment. It helps improve reading and writing for all skill levels and abilities. You can adjust text size, spacing, font, and background theme, have text read aloud, break words into syllables, and highlight parts of speech. The picture dictionary shows images for unfamiliar words. To use this feature,\ninstall the free Microsoft Reading Coach application from the Microsoft Store.\nNew!\n1\nWith the\nDraft with Copilot in Word\ntext action, you can quickly turn any recognized text into a full draft. Whether it’s a sentence in an email or a snippet on your screen, press\nWin\n+\nClick\non the recognized text, then select\nDraft with Copilot in Word\n. No more blank pages. No more writer’s block. Just momentum. To use “Draft with Copilot in Word” a Microsoft 365 Copilot subscription is required.\nNew!\n1\nClick to Do on Copilot+ PCs now supports actions through Microsoft Teams. When you select an email address recognized by Click to Do on your screen, you can choose to send a Teams message or schedule a Teams meeting. These options make it easy to ask a question or set up time to talk without interrupting your workflow.\n[Settings]\nNew!\n1\nThe\nnew agent in Settings\nis part of the Copilot+ PC experience and is designed to address one of the most common frustrations: finding and changing settings on your PC. You can describe what you need help with, such as “how to control my PC by voice” or “my mouse pointer is too small,” and the agent will suggest steps to resolve the issue. The agent uses AI on your PC to understand your request and, with your permission, can automate and complete tasks for you. This experience is rolling out to Snapdragon-powered Copilot+ PCs, with support for AMD and Intel™-powered PCs coming soon. It currently works only if your primary display language is set to English.\nNew!\nOn non-Copilot+ PCs, the Settings app now shows the Search box at the top center to make searching easier and more consistent.\nFixed: If your PC is set to ‘\nDo nothing’\nwhen you close the lid (under\nSettings\n>\nSystem\n>\nPower and Battery\n) and the Settings window is left open when you close the lid, reopening the lid might cause the Settings window to stop responding. It might become unresponsive to input or resizing and instead just display your accent color.\nFixed: Settings might stop responding when you try to save Wi-Fi network credentials.\n[Windows Resiliency Initiative]\nThe following changes are part of the\nWindows Resiliency Initiative\nannounced at Ignite 2024:\nNew!\nQuick machine recovery\nis now available. When enabled, it automatically detects and fixes widespread issues on Windows 11 devices using the Windows Recovery Environment (WinRE). This reduces downtime and avoids the need for manual fixes. If a device experiences a widespread boot issue, it enters WinRE, connects to the internet, and Microsoft can deliver a targeted fix through Windows Update.\nIT admins\ncan enable or customize this experience for their organization through the Intune Settings Catalog UI using the\nRemoteRemediationCSP\n. There is also a dedicated quick machine recovery settings page available under\nSystem\n>\nRecovery\n>\nQuick machine recovery\n. Today, it’s enabled by default for home users.\nNew!\nA more streamlined interface appears during an unexpected restart. This updated design aligns with Windows 11’s visual style and helps you return to work faster. The screen displays a more readable layout while keeping the technical details visible. This screen appears with a black background.\n[Start menu]\nNew!\nWe are adding a Boolean option to the Configure Start Pins policy to allow admins to apply Start menu pins once. This means that a user will receive admin pins on day 0 but can then make any changes to their Start pinned layout and have those changes safeguarded\n.\nThese changes can be optionally applied through the existing\nconfiguration Service Provider (CSP)\n.\n[Snap]\nNew!\nImprovements make it easier to learn and use Snap in Windows 11. Inline messages now appear when you accidentally open the Snap Bar by dragging an app to the upper center of your desktop or open the Snap menu by hovering over the Minimize or Maximize button. These messages provide helpful tips on Snap app windows and show keyboard shortcuts.\n[Windows Search]\nNew!\nWindows Search settings are now easier to find. Instead of two separate pages for settings (“Search permissions” and “Searching Windows”), you can find everything in one place under\nSettings\n>\nPrivacy & security\n>\nSearch\n. This new page has a modern look and a better layout, so you can quickly view and manage all your Windows Search settings.\n[Input]\nNew!\nThe Gamepad layout of the Windows touch keyboard now includes enhanced controller navigation and improved focus handling for child keys, menus, word suggestions, language switching, and settings. A new Gamepad keyboard, designed for gaming, also supports PIN sign-in on the Windows lock screen. It offers controller shortcuts for quick PIN entry and full navigation for those who prefer not to use shortcuts.\n[File Explorer]\nFixed: If you open\nMore options\nin File Explorer to view the full list of folders for the current path, the dropdown menu might not display completely, making the bottom part inaccessible.\nFixed: File operation progress dialogs might stop appearing when displayed from apps.\nFixed: Syncing more SharePoint sites to File Explorer might slow performance when navigating folders or opening the context menu. This can also affect how quickly files launch.\n[Desktop icons\n] Fixed: If you have an app pinned to your desktop and it updates, the app icon might not display correctly and instead show a white page.\n[Notifications]\nFixed: When you select a Windows notification, it might not bring the related app to the foreground as expected—for example, this can happen with Outlook notifications.\nThe good news is that some fixes are available immediately with the KB5058502 update, which include:\n[Authentication]\nFixed: This update addresses an issue that affects the Local Security Authority Subsystem Service (LSASS). LSASS might stop responding during machine password changes with specific audit settings.\n[File Explorer]\nFixed: File Explorer Home might unexpectedly only display a single folder (for example, Desktop), rather than the expected content with recent files and more.\n[File system]\nFixed: This update addresses an issue in the Resilient File System (ReFS) where using backup applications on large files could occasionally result in system memory becoming fully exhausted.\n[Graphics]\nAn issue where external graphics cards connected through Thunderbolt weren’t always recognized in some cases.\n[Input (know issue)]\nFixed: An issue when using the\nMicrosoft Changjie\nIME (input method editor) for Traditional Chinese might cause problems such as not being able to form or select words, unresponsive spacebar or blank key, incorrect word output, or a broken candidate window display. This can occur after installing\nKB5062553\n.\nFixed: This update addresses an issue that affects Phonetic input methods, including the Hindi Phonetic Input keyboard and the Marathi Phonetic keyboard, which might not work correctly after installing\nKB5062553\n.\n[Stability issue]\nThis update addresses an issue observed in rare cases after installing the May 2025 security update and subsequent updates causing devices to experience stability issues. Some devices became unresponsive and stopped responding in specific scenarios.\n[Windows Firewall]\nFixed: This update addresses an issue found in Event Viewer as Event 2042 for Windows Firewall with Advanced Security. The event appears as \"Config Read Failed\" with the message \"More data is available.\" For more information about this issue, see \"Error events are logged for Windows Firewall\" in the\nWindows Health Dashboard\n.\nMicrosoft states that there are no known issues with this update, which finally resolves a\nbug that displayed incorrect Event 2042 errors\nfor Windows Firewall with Advanced Security in Event Viewer.\nThe full release notes for KB5062660 can be found in this\nsupport bulletin\n.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nWindows 11 gets new Black Screen of Death, auto recovery tool\nWindows 11 KB5060829 update released with 38 new changes, fixes\nWindows 11 KB5058499 update rolls out new Share and Click to Do features\nMicrosoft mistakenly tags Windows Firewall error log bug as fixed\nWindows KB5064489 emergency update fixes Azure VM launch issues"
    },
    {
        "Title": "Windows 11 gets new Black Screen of Death, auto recovery tool",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-gets-new-black-screen-of-death-auto-recovery-tool/",
        "Summary": "Microsoft is rolling out significant changes to Windows 11 24H2 as part of the Windows Resilience Initiative, designed to reduce downtime and help devices recover from serious failures, as well as an overhaul of the all-too-familiar BSOD crash screens. [...]",
        "Date": "2025-07-22",
        "Content": "Microsoft is rolling out significant changes to Windows 11 24H2 as part of the Windows Resilience Initiative, designed to reduce downtime and help devices recover from serious failures, as well as an overhaul of the all-too-familiar BSOD crash screens.\nMicrosoft's Windows Resiliency Initiative is a new effort by Microsoft to make Windows more stable, self-healing, and faster to recover from critical failures. This initiative is in direct response to recent incidents that caused widespread disruptions and crashes due to flawed updates, like the global CrowdStrike content update outage.\nMicrosoft has now announced that it has replaced the Windows Blue Screen of Death with a new Black Screen of Death, featuring a revamped interface.\n\"The new UI is simpler, and more aligned with Windows 11's design language,\" explains Microsoft.\n\"It removes the frowny face and QR code, and instead presents a short, readable message with the stop code and faulty driver information. We've also added a hex version of the stop code to make it easier to search for help – a common user request.\"\nRegardless of its color, it is still a BSOD crash screen\nSource: Microsoft\nMicrosoft also announced the new Quick Machine Recovery feature, which aims to resolve boot failures without requiring manual intervention.\nWhen a system is unable to boot and enters the Windows Recovery Environment (WinRE), it can now automatically connect to a network, check for applicable fixes from Windows Update, and apply them if available.\nThis new feature can be used to automatically disable known faulty drivers or remove software that is preventing Windows from starting, all without human intervention and with a fix pushed from Microsoft's servers.\n\"Once enabled, the feature activates during critical boot failures,\" explains Microsoft.\n\"It uses the secure and connected Windows recovery environment to scan Windows Update for applicable fixes published by Microsoft. If a matching remediation for a widespread issue is available, it is applied automatically, restoring the device without requiring manual intervention.\"\nQuick Machine Recovery flow\nSource: Microsoft\nThis feature aims to prevent massive Windows outages, such as the one we saw when CrowdStrike pushed out a\nfaulty content update that crashed over 8.5 million Windows devices\nand could only be fixed with\nmanual intervention\n.\nThis new feature is available in Windows 11 Home, Pro, Education, and Enterprise editions starting with the 24H2 update build 26100.4770 after installing the KB5062660 update, released today.\nQuick Machine Recovery is enabled by default on Home devices and can be manually configured or disabled by IT admins on managed devices using Intune, ReAgentC.exe, or other supported policy tools.\nMicrosoft says it will further enhance the tool in the future by including advanced IT admin tools for remediation management, monitoring, additional policy and rollout controls.\nAs part of the Windows Resiliency Initiative, Microsoft is also working with antivirus and EDR vendors to move their drivers outside of the Windows Kernel to prevent crashes from faulty drivers.\nMicrosoft is currently\ntesting this new Windows endpoint security platform\nwith a set of partners.\nUpdate 7/22/25: Updated story to reflect it was a faulty CrowdStrike content update, not driver.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nMicrosoft adds quick machine recovery to Windows 11 settings\nMicrosoft mistakenly tags Windows Firewall error log bug as fixed\nWindows KB5064489 emergency update fixes Azure VM launch issues\nWindows 11 now uses JScript9Legacy engine for improved security\nMicrosoft fixes ‘Print to PDF’ feature broken by Windows update"
    },
    {
        "Title": "Coyote malware abuses Windows accessibility framework for data theft",
        "Link": "https://www.bleepingcomputer.com/news/security/coyote-malware-abuses-windows-accessibility-framework-for-data-theft/",
        "Summary": "A new variant of the banking trojan 'Coyote' has begun abusing a Windows accessibility feature, Microsoft's UI Automation framework, to identify which banking and cryptocurrency exchange sites are accessed on the device for potential credential theft. [...]",
        "Date": "2025-07-22",
        "Content": "A new variant of the banking trojan 'Coyote' has begun abusing a Windows accessibility feature, Microsoft's UI Automation framework, to identify which banking and cryptocurrency exchange sites are accessed on the device for potential credential theft.\nMicrosoft UIA is a Windows accessibility framework designed to allow assistive technologies to interact with, inspect, and control user interface (UI) elements in applications.\nWindows apps expose their UI elements through a UI Automation tree, and the UIA API provides a way to traverse it, query the properties of each element, and interact with it.\nAkamai researchers\nhad warned\nabout the possibility of Windows UIA being abused to steal credentials in December 2024, highlighting that the technique evades endpoint detection and response (EDR) protections.\nNow, the same researchers report that they have seen attacks leveraging the technique in the wild since February 2025, marking the first real-world case of malware abusing Microsoft UIA for data theft.\nCoyote evolution and UIA abuse\nCoyote is a banking trojan that attempts to steal credentials for 75 banking and cryptocurrency exchange apps, primarily targeting Brazilian users.\nThe malware was first documented in February 2024, utilizing tactics such as keylogging and phishing overlays, and has undergone significant development since then.\nAkamai reports that, while the latest Coyote variant continues to steal data using traditional methods for hardcoded apps, it has added UIA abuse when the user opens web-based banking or cryptocurrency services in a browser.\nIf Coyote cannot identify a target via the window title, it uses UIA to extract the web address from within the browser's UI elements (tabs or address bars). Finally, it compares it against a hardcoded list of 75 targeted services.\n\"If no match is found, Coyote will then use UIA to parse through the UI child elements of the window in an attempt to identify browser tabs or address bars,\" explains Akamai in the report.\n\"The content of these UI elements will then be cross-referenced with the same list of addresses from the first comparison.\"\nSome of the banks and exchanges that are identified using this method are Banco do Brasil, CaixaBank, Banco Bradesco, Santander, Original bank, Sicredi, Banco do Nordeste, Expanse apps, and Cryptocurrency (Binance, Electrum, Bitcoin, Foxbit, and others).\nAlthough the abuse of this Windows accessibility feature stops at the reconnaissance phase, Akamai shared a proof-of-concept demonstration of how UIA can also be abused to steal inputted credentials for these sites.\nDemonstrating how Microsoft's UIA can be abused for credential theft\nSource: Akamai\nBleepingComputer has contacted Microsoft to ask about the potential introduction of safeguards to stop the abuse of UIA on Windows, but a comment wasn't immediately available.\nAccessibility systems are designed to be powerful, allowing people with disabilities to fully utilize the capabilities of their devices. However, this power also invites malicious use.\nIn Android, this problem has taken massive proportions, with malware abusing Accessibility Services extensively. Over the years, Google has\nimplemented\nmultiple measures\nto address this issue\n.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nAndroid malware Anatsa infiltrates Google Play to target US banks\nGodfather Android malware now uses virtualization to hijack banking apps\nMicrosoft Teams voice calls abused to push Matanbuchus malware\nGoogle sues to disrupt BadBox 2.0 botnet infecting 10 million devices\nLameHug malware uses AI LLM to craft Windows data-theft commands in real-time"
    },
    {
        "Title": "CISA and FBI warn of escalating Interlock ransomware attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/cisa-and-fbi-warn-of-escalating-interlock-ransomware-attacks/",
        "Summary": "CISA and the FBI warned on Tuesday of increased Interlock ransomware activity targeting businesses and critical infrastructure organizations in double extortion attacks. [...]",
        "Date": "2025-07-22",
        "Content": "CISA and the FBI warned on Tuesday of increased Interlock ransomware activity targeting businesses and critical infrastructure organizations in double extortion attacks.\nToday's advisory\nwas jointly authored with the Department of Health and Human Services (HHS) and the Multi-State Information Sharing and Analysis Center (MS-ISAC) and it provides network defenders with indicators of compromise (IOCs) collected during investigations of incidents as recent as June 2025, along with mitigation measures to protect their networks against this ransomware gang's attacks.\nInterlock\nis a relatively new ransomware operation that emerged in September 2024 and has since targeted victims worldwide across various industry sectors, with a particular focus on the healthcare sector.\nThe threat actors were also previously\nlinked to ClickFix attacks\n, where they impersonate IT tools for initial network access, as well as malware attacks in which they\ndeployed a remote access trojan called NodeSnake\non the networks of U.K. universities.\nRecently, the cybercrime group claimed responsibility for\nbreaching DaVita\n, a Fortune 500 company specializing in kidney care, resulting in the theft and leak of 1.5 terabytes of data from their systems, as well as for\nhacking Kettering Health\n, a healthcare giant that operates over 120 outpatient facilities and employs more than 15,000 people.\n​While investigating their attacks, the FBI has observed the Interlock gang using some unusual tactics and pressuring their victims in double extortion attacks.\n\"FBI observed actors obtaining initial access via drive-by download from compromised legitimate websites, which is an uncommon method among ransomware groups,\" the advisory reads.\n\"Interlock actors employ a double extortion model in which actors encrypt systems after exfiltrating data, which increases pressure on victims to pay the ransom to both get their data decrypted and prevent it from being leaked.\"\nEarlier this month, the ransomware group was also observed\nadopting the new FileFix technique\nto drop remote access trojan (RAT) malware. FileFix is a social engineering attack in which the attackers weaponize trusted Windows UI elements, including the Windows File Explorer and HTML Applications (.HTA), to trick their targets into executing malicious PowerShell or JavaScript code without displaying any security warnings.\nTo defend their networks against Interlock ransomware attacks, security teams are advised to implement Domain Name System (DNS) filtering, web access firewalls, and train users to recognize social engineering attempts.\nDefenders are also urged to keep systems, software, and firmware up to date and segment networks to limit access from compromised devices.\nAdditionally, organizations need to establish identity, credential, and access management (ICAM) policies and require multifactor authentication (MFA) for all services when possible.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nNew Phobos and 8base ransomware decryptor recover files for free\nInterlock ransomware adopts new FileFix attack to push malware\nKettering Health confirms Interlock ransomware behind cyberattack\nInterlock ransomware claims Kettering Health breach, leaks stolen data\nKettering Health hit by system-wide outage after ransomware attack"
    },
    {
        "Title": "Major European healthcare network discloses security breach",
        "Link": "https://www.bleepingcomputer.com/news/security/major-european-healthcare-network-discloses-security-breach/",
        "Summary": "AMEOS Group, an operator of a massive healthcare network in Central Europe, has announced it has suffered a security breach that may have exposed customer, employee, and partner information. [...]",
        "Date": "2025-07-22",
        "Content": "AMEOS Group, an operator of a massive healthcare network in Central Europe, has announced it has suffered a security breach that may have exposed customer, employee, and partner information.\nThe organization published a statement on its website, as required by Article 34 of the General Data Protection Regulation (GDPR), which mandates a public notice in the event of a data breach.\nAMEOS is a Zurich-based healthcare provider that employs 18,000 staff in over 100 hospitals, clinics, rehabilitation centers, and nursing homes located across Switzerland, Germany, and Austria.\nIt is one of the largest private hospital groups in the broader DACH region, with over 10,000 beds and annual revenue exceeding $1.4 billion.\nAMEOS informs that, despite the \"extensive security measures\" in place, external actors gained unauthorized access to its IT systems and accessed sensitive information.\n\"Data belonging to patients, employees, and partners—as well as contact information relating to you or your company—may have been affected due to unauthorized access,\"\nreads the announcement\n.\n\"It cannot be ruled out that this data may be misused on the internet to the detriment of those affected or made accessible to third parties.\"\nIn response, AMEOS has shut down all IT systems and terminated all external and internal network connections. Additionally, it reinforced existing measures and contracted external IT and forensic experts to aid with response efforts.\nThe data protection authorities in the countries have been informed accordingly, and a criminal complaint was filed with the police.\nPeople who have received care at AMEOS facilities are advised to remain vigilant against phishing and scam attempts.\nTo date, there are no signs that the accessed data has been disseminated online, stated the healthcare provider.\nThe investigation is still underway, and AMEOS has promised to provide updates as new information becomes available.\n\"Currently, we have no specific evidence of an actual leak of your individual personal data,\" states the organization.\n\"You will be informed immediately upon completion of the ongoing review and investigation measures via this page.\"\nAt the time of writing, no major ransomware groups have taken responsibility for the attack at AMEOS. The organization did not specify if the attack involved data encryption, so the type of incident and the perpetrators are unknown.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nHealthcare SaaS firm says data breach impacts 5.4 million patients\nDior begins sending data breach notifications to U.S. customers\nBitcoin Depot breach exposes data of nearly 27,000 crypto users\nIdeaLab confirms data stolen in ransomware attack last year\nQantas discloses cyberattack amid Scattered Spider aviation breaches"
    },
    {
        "Title": "Cisco: Maximum-severity ISE RCE flaws now exploited in attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/cisco-maximum-severity-ise-rce-flaws-now-exploited-in-attacks/",
        "Summary": "Cisco is warning that three recently patched critical remote code execution vulnerabilities in Cisco Identity Services Engine (ISE) are now being actively exploited in attacks. [...]",
        "Date": "2025-07-22",
        "Content": "Cisco is warning that three recently patched critical remote code execution vulnerabilities in Cisco Identity Services Engine (ISE) are now being actively exploited in attacks.\nAlthough the vendor did not specify how they were being exploited and whether they were successful, applying the security updates as soon as possible is now critical.\n“In July 2025, the Cisco PSIRT became aware of attempted exploitation of some of these vulnerabilities in the wild,”\nreads the updated advisory\n.\n“Cisco continues to strongly recommend that customers upgrade to a fixed software release to remediate these vulnerabilities.”\nCisco Identity Services Engine (ISE) is a platform that enables large organizations to control network access and enforce security policies.\nThe maximum severity flaws were first disclosed by the vendor on June 25, 2025 (\nCVE-2025-20281 and CVE-2025-20282\n) and July 16, 2025 (\nCVE-2025-20337\n).\nHere’s a brief description of the flaws:\nCVE-2025-20281\n: Critical unauthenticated remote code execution vulnerability in Cisco Identity Services Engine (ISE) and ISE Passive Identity Connector (ISE-PIC). An attacker can send crafted API requests to execute arbitrary commands as root on the underlying OS, without authentication. Fixed in ISE 3.3 Patch 7 and 3.4 Patch 2.\nCVE-2025-20282:\nCritical unauthenticated arbitrary file upload and execution vulnerability in Cisco ISE and ISE-PIC Release 3.4. Lack of file validation allows attackers to upload malicious files into privileged directories and execute them as root. Fixed in ISE 3.4 Patch 2.\nCVE-2025-20337:\nCritical unauthenticated remote code execution vulnerability affecting Cisco ISE and ISE-PIC. Exploitable via specially crafted API requests due to insufficient input validation, allowing attackers to gain root access without credentials. Fixed in ISE 3.3 Patch 7 and 3.4 Patch 2.\nAll three are rated at maximum severity (CVSS score: 10.0) and are remotely exploitable without requiring authentication, making them valuable targets for hackers seeking to gain a foothold on corporate networks.\nCisco previously released two separate hot patches for the three flaws due to the time difference in their discovery. To mitigate all of them at once, admins are recommended to take the following action:\nISE 3.3 users must upgrade to Patch 7\nISE 3.4 users must upgrade to Patch 2\nThose on ISE 3.2 or earlier are not affected and do not need to take any action.\nThere are no workarounds for the three vulnerabilities, so applying the updates is the only recommended course of action.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nMax severity Cisco ISE bug allows pre-auth command execution, patch now\nHackers are exploiting critical RCE flaw in Wing FTP Server\nCisco warns of max severity RCE flaws in Identity Services Engine\nExploit details for max severity Cisco IOS XE flaw now public\nHackers are exploiting critical flaw in vBulletin forum software"
    },
    {
        "Title": "UK to ban public sector orgs from paying ransomware gangs",
        "Link": "https://www.bleepingcomputer.com/news/security/uk-to-ban-public-sector-orgs-from-paying-ransomware-gangs/",
        "Summary": "The United Kingdom's government is planning to ban public sector and critical infrastructure organizations from paying ransoms after ransomware attacks. [...]",
        "Date": "2025-07-22",
        "Content": "The United Kingdom's government is planning to ban public sector and critical infrastructure organizations from paying ransoms after ransomware attacks.\nThe list of entities that would have to follow the new proposed legislation includes local councils, schools, and the publicly funded National Health Service (NHS).\n\"Ransomware is estimated to cost the UK economy millions of pounds each year, with recent high-profile ransomware attacks highlighting the severe operational, financial, and even life-threatening risks. The ban would target the business model that fuels cyber criminals' activities and makes the vital services the public rely on a less attractive target for ransomware groups,\" the UK government\nsaid\n.\n\"We're determined to smash the cyber criminal business model and protect the services we all rely on as we deliver our Plan for Change. By working in partnership with industry to advance these measures, we are sending a clear signal that the UK is united in the fight against ransomware,\" Security Minister Dan Jarvis added.\nUnder these new measures, businesses not covered by the proposed ban will be required to notify the government if they intend to make a ransom payment, seeking guidance on whether such payments could violate laws regarding transfers to sanctioned cybercriminal groups, many of them based in Russia.\nA mandatory reporting system is also being developed to provide law enforcement with essential information to track down attackers and support the victims.\nThe announcement follows the UK government's\npublic consultation\nin January, which proposed a targeted ban on ransomware payments for all public sector bodies and critical national infrastructure, as well as measures to prevent ransomware payments and require mandatory reporting of ransomware incidents.\nAs noted at the time, ransomware is considered the greatest cybercrime threat in the UK and is treated as a risk to the UK's national security by both the National Cyber Security Centre (NCSC) and the National Crime Agency (NCA).\nIn recent years, multiple high-profile UK organizations have been hit by ransomware attacks, including\nthe NHS\nand the\nBritish Library\n.\nMore recently,\nBleepingComputer first reported\nthat British retailer giant Marks & Spencer (M&S) was breached in an April ransomware attack where a DragonForce encryptor was used to encrypt virtual machines on VMware ESXi hosts, forcing M&S to\nstop accepting online orders\nand leading to a significant\nimpact on business operations\nat its 1,400 stores.\nThe Co-op experienced\nanother cyber incident,\nconfirming\nthat the attackers stole data from many current and former members.\nHarrods also disclosed\nthat it was forced to restrict internet access to some sites after threat actors attempted to breach its network.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nPolice disrupt “Diskstation” ransomware gang attacking NAS devices\nU.S. warns of Iranian cyber threats on critical infrastructure\nSwitzerland says government data stolen in ransomware attack\nUK fines 23andMe for ‘profoundly damaging’ breach exposing genetics data\nMarks & Spencer faces $402 million profit hit after cyberattack"
    },
    {
        "Title": "Microsoft links Sharepoint ToolShell attacks to Chinese hackers",
        "Link": "https://www.bleepingcomputer.com/news/security/microsoft-sharepoint-toolshell-attacks-linked-to-chinese-hackers/",
        "Summary": "Hackers with ties to the Chinese government have been linked to a recent wave of widespread attacks targeting a Microsoft SharePoint zero-day vulnerability chain. [...]",
        "Date": "2025-07-22",
        "Content": "Several hacking groups with ties to the Chinese government have been linked to a recent wave of widespread attacks targeting a Microsoft SharePoint zero-day vulnerability chain.\nThey used this exploit chain (dubbed \"ToolShell\") to breach dozens of organizations worldwide after hacking into their on-premise SharePoint servers.\n\"Microsoft has observed two named Chinese nation-state actors, Linen Typhoon and Violet Typhoon exploiting these vulnerabilities targeting internet-facing SharePoint servers,\"\nMicrosoft said\nin a Tuesday report. \"In addition, we have observed another China-based threat actor, tracked as Storm-2603, exploiting these vulnerabilities. Investigations into other actors also using these exploits are still ongoing.\"\n\"We assess that at least one of the actors responsible for this early exploitation is a China-nexus threat actor. It's critical to understand that multiple actors are now actively exploiting this vulnerability,\" Charles Carmakal, CTO of Google Cloud's Mandiant Consulting, told BleepingComputer yesterday.\nOn Friday, Dutch cybersecurity firm Eye Security\nfirst spotted zero-day attacks\nexploiting the CVE-2025-49706 and CVE-2025-49704 vulnerabilities (first demoed\nduring the Berlin Pwn2Own hacking contest\nby Viettel Cyber Security researchers).\nThe company told BleepingComputer that at least 54 organizations had already been compromised, including several multinational companies and national government entities.\nCybersecurity firm Check Point also revealed on Monday that it\ndiscovered the first signs of exploitation on July 7th\n, adding that the attackers targeted dozens of entities across the government, telecommunications, and software sectors in North America and Western Europe.\nMicrosoft patched the two flaws as part of the\nJuly Patch Tuesday updates\nand assigned two new CVE IDs (CVE-2025-53770 and CVE-2025-53771) over the weekend for zero-days used by threat actors to compromise fully patched SharePoint servers. Since then, it\nreleased emergency patches\nfor SharePoint Subscription Edition, SharePoint 2019, and SharePoint 2016 to address both RCE flaws.\nPoC exploit now available\nThis week, after Microsoft released security patches for all impacted SharePoint versions, a\nCVE-2025-53770 proof-of-concept exploit\nwas also released on GitHub, making it easier for more threat actors and hacking groups to join ongoing attacks.\nCISA has also added the CVE-2025-53770 remote code execution vulnerability to its Known Exploited Vulnerability catalog, ordering federal agencies to apply patches one day after they were released.\n\"This exploitation activity, publicly reported as 'ToolShell,' provides unauthenticated access to systems and enables malicious actors to fully access SharePoint content, including file systems and internal configurations, and execute code over the network,\" the cybersecurity agency\nsaid\n.\n\"Microsoft is responding quickly, and we are working with the company to help notify potentially impacted entities about recommended mitigations. CISA encourages all organizations with on-premise Microsoft SharePoint servers to take immediate recommended action.\"\nToday, Microsoft also shared the following indicators of compromise (IOCs) to help defenders identify compromised SharePoint servers on their network:\n134.199.202[.]205\n: IP address exploiting SharePoint vulnerabilities\n104.238.159[.]149\n: IP address exploiting SharePoint vulnerabilities\n188.130.206[.]168\n: IP address exploiting SharePoint vulnerabilities\n131.226.2[.]6\n: Post-exploitation C2\nSpinstall0.aspx\n: Web shell used by threat actors (also named spinstall.aspx, spinstall1.aspx, and spinstall2.aspx)\nc34718cbb4c6.ngrok-free[.]app/file.ps1\n: Ngrok tunnel delivering PowerShell to C2\nUpdate July 22, 09:11 EDT:\nAdded Microsoft attribution.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nMicrosoft SharePoint zero-day exploited in RCE attacks, no patch available\nMicrosoft releases emergency patches for SharePoint RCE flaws exploited in attacks\nChinese hackers breach US local governments using Cityworks zero-day\nNew CrushFTP zero-day exploited in attacks to hijack servers\nVMware fixes four ESXi zero-day bugs exploited at Pwn2Own Berlin"
    },
    {
        "Title": "Microsoft: Windows Server KB5062557 causes cluster, VM issues",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-server-kb5062557-causes-cluster-vm-issues/",
        "Summary": "Microsoft is asking businesses to reach out for support to mitigate a known issue causing Cluster service and VM restart issues after installing this month's Windows Server 2019 security updates. [...]",
        "Date": "2025-07-22",
        "Content": "Microsoft is asking businesses to reach out for support to mitigate a known issue causing Cluster service and VM restart issues after installing this month's Windows Server 2019 security updates.\nAs the company explains in a private advisory seen by BleepingComputer, the Cluster service (a system component essential to cluster operation) might fail to function correctly after installing the\nKB5062557 update\nreleased on July 8th.\nThe same bug is also causing some nodes to fail when attempting to rejoin their cluster and triggering errors on systems where administrators have enabled the BitLocker Windows security feature on Cluster Shared Volumes (CSV) drives.\n\"After installing the July Windows security update (the Originating KBs listed above), the Cluster Service on Windows Server 2019 might repeatedly stop and restart, causing nodes to fail to rejoin the cluster or enter quarantine states, virtual machines to experience multiple restarts, and frequent Event ID 7031 errors within event logs,\" Redmond explained.\nWhile a mitigation is available for organizations affected by this known issue, Microsoft has yet to roll it out to customers. Until the fix is generally available, the company asks those impacted to reach out to business support for help addressing these problems.\n\"If you need help to manage this issue on your organization and apply a mitigation, please contact Microsoft's Support for business,\" Microsoft said.\n\" We are working to include the resolution in a future Windows update. Once the update with the resolution is released, organizations will not need to install and configure the mitigation provided from Microsoft's Support for business.\"\nEarlier this month, Redmond\naddressed a widespread issue\naffecting Windows Server Update Services (WSUS) that prevented organizations from deploying the latest Windows updates due to Microsoft Update sync problems.\nThe July 2024 cumulative updates have also\nresolved an issue triggered by the June 2025 security updates\n, which caused the DHCP service to freeze on some Windows Server systems.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nNew Windows Server emergency updates fix container launch issue\nMicrosoft fixes Windows Server auth issues caused by April updates\nWindows Server emergency update fixes Hyper-V VM freezes, restart issues\nMicrosoft: June Windows Server security updates cause DHCP issues\nMicrosoft fixes unreachable Windows Server domain controllers"
    },
    {
        "Title": "3 China Nation-State Actors Target SharePoint Bugs",
        "Link": "https://www.darkreading.com/application-security/3-china-nation-state-actors-sharepoint-bugs",
        "Summary": "Hackers and cybercrime groups are part of a virtual feeding frenzy, after Microsoft's recent disclosure of new vulnerabilities in on-premises editions of SharePoint Server.",
        "Date": "2025-07-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/3-china-nation-state-actors-sharepoint-bugs"
    },
    {
        "Title": "Dell Breached by Extortion Group, Says Data Stolen Was 'Fake'",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/dell-breached-data-stolen-fake",
        "Summary": "The World Leaks group accessed and released data from the company's Customer Solution Center, which is separated from customer and partner systems and stores primarily &quot;synthetic&quot; datasets used for demos and testing, Dell said.",
        "Date": "2025-07-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/dell-breached-data-stolen-fake"
    },
    {
        "Title": "Darktrace Acquires Mira Security for Network Visibility",
        "Link": "https://www.darkreading.com/threat-intelligence/darktrace-acquires-mira-security-network-visibility",
        "Summary": "The acquisition gives the British cybersecurity solutions provider more insights into encrypted network traffic and additional decryption capabilities.",
        "Date": "2025-07-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/darktrace-acquires-mira-security-network-visibility"
    },
    {
        "Title": "Critical Infrastructure Security Is a Critical Concern",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/critical-infrastructure-security-critical-concern",
        "Summary": "To be truly resilient in the ever-growing threat landscape, organizations need to balance protection with preparation.",
        "Date": "2025-07-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/critical-infrastructure-security-critical-concern"
    },
    {
        "Title": "Coast Guard Issues Cybersecurity Rule for Maritime Transport Safety",
        "Link": "https://www.darkreading.com/threat-intelligence/marine-transportation-final-cyber-rule",
        "Summary": "The cybersecurity requirements follow an extended timeline over the next two years, and are meant to secure US shipping ports from disruption by malicious actors.",
        "Date": "2025-07-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/marine-transportation-final-cyber-rule"
    },
    {
        "Title": "China-Backed APT41 Cyberattack Surfaces in Africa",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/china-backed-apt41-attack-africa",
        "Summary": "Up to now, the prolific China-sponsored cyber-espionage group has been mostly absent from the region, but a sophisticated and highly targeted attack on an African IT company shows Beijing is branching out.",
        "Date": "2025-07-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/china-backed-apt41-attack-africa"
    },
    {
        "Title": "Microsoft Says Chinese APTs Exploited ToolShell Zero-Days Weeks Before Patch",
        "Link": "https://www.securityweek.com/microsoft-says-chinese-apts-exploited-toolshell-zero-days-weeks-before-patch/",
        "Summary": "<p>Microsoft says the Chinese threat actors Linen Typhoon, Violet Typhoon, and Storm-2603 have been exploiting the ToolShell zero-days.</p>\n<p>The post <a href=\"https://www.securityweek.com/microsoft-says-chinese-apts-exploited-toolshell-zero-days-weeks-before-patch/\">Microsoft Says Chinese APTs Exploited ToolShell Zero-Days Weeks Before Patch</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/microsoft-says-chinese-apts-exploited-toolshell-zero-days-weeks-before-patch/"
    },
    {
        "Title": "Reclaiming Control: How Enterprises Can Fix Broken Security Operations",
        "Link": "https://www.securityweek.com/reclaiming-control-how-enterprises-can-fix-broken-security-operations/",
        "Summary": "<p>Once a manageable function, security operations has become a battlefield of complexity.</p>\n<p>The post <a href=\"https://www.securityweek.com/reclaiming-control-how-enterprises-can-fix-broken-security-operations/\">Reclaiming Control: How Enterprises Can Fix Broken Security Operations</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/reclaiming-control-how-enterprises-can-fix-broken-security-operations/"
    },
    {
        "Title": "Dell Says Data Leaked by Hackers Is Fake",
        "Link": "https://www.securityweek.com/hackers-leak-fake-dell-data/",
        "Summary": "<p>Dell confirms the compromise of a demo environment containing synthetic data after hackers leak allegedly stolen information.</p>\n<p>The post <a href=\"https://www.securityweek.com/hackers-leak-fake-dell-data/\">Dell Says Data Leaked by Hackers Is Fake</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/hackers-leak-fake-dell-data/"
    },
    {
        "Title": "Vulnerabilities Expose Helmholz Industrial Routers to Hacking",
        "Link": "https://www.securityweek.com/vulnerabilities-expose-helmholz-industrial-routers-to-hacking/",
        "Summary": "<p>Eight vulnerabilities, including ones allowing full control over a device, have been discovered and patched in Helmholz REX 100 industrial routers. </p>\n<p>The post <a href=\"https://www.securityweek.com/vulnerabilities-expose-helmholz-industrial-routers-to-hacking/\">Vulnerabilities Expose Helmholz Industrial Routers to Hacking</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/vulnerabilities-expose-helmholz-industrial-routers-to-hacking/"
    },
    {
        "Title": "Darktrace Acquires Mira Security",
        "Link": "https://www.securityweek.com/darktrace-acquires-mira-security/",
        "Summary": "<p>AI-powered cybersecurity company Darktrace has acquired network traffic visibility provider Mira Security.</p>\n<p>The post <a href=\"https://www.securityweek.com/darktrace-acquires-mira-security/\">Darktrace Acquires Mira Security</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/darktrace-acquires-mira-security/"
    },
    {
        "Title": "Dior Says Personal Information Stolen in Cyberattack",
        "Link": "https://www.securityweek.com/dior-says-personal-information-stolen-in-cyberattack/",
        "Summary": "<p>Dior says hackers accessed personal information in a January 2025 intrusion. No payment information was compromised.</p>\n<p>The post <a href=\"https://www.securityweek.com/dior-says-personal-information-stolen-in-cyberattack/\">Dior Says Personal Information Stolen in Cyberattack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/dior-says-personal-information-stolen-in-cyberattack/"
    },
    {
        "Title": "UK Sanctions Russian Hackers Tied to Assassination Attempts",
        "Link": "https://www.securityweek.com/uk-sanctions-russian-hackers-tied-to-assassination-attempts/",
        "Summary": "<p>The UK government has sanctioned three Russian APTs and 18 individuals for their involvement in cyber operations against Ukraine, NATO allies, and EU.</p>\n<p>The post <a href=\"https://www.securityweek.com/uk-sanctions-russian-hackers-tied-to-assassination-attempts/\">UK Sanctions Russian Hackers Tied to Assassination Attempts</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/uk-sanctions-russian-hackers-tied-to-assassination-attempts/"
    },
    {
        "Title": "ToolShell Zero-Day Attacks on SharePoint: First Wave Linked to China, Hit High-Value Targets",
        "Link": "https://www.securityweek.com/toolshell-zero-day-attacks-on-sharepoint-first-wave-linked-to-china-hit-high-value-targets/",
        "Summary": "<p>More details emerged on the ToolShell zero-day attacks targeting SharePoint servers, but confusion remains over the vulnerabilities.</p>\n<p>The post <a href=\"https://www.securityweek.com/toolshell-zero-day-attacks-on-sharepoint-first-wave-linked-to-china-hit-high-value-targets/\">ToolShell Zero-Day Attacks on SharePoint: First Wave Linked to China, Hit High-Value Targets</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/toolshell-zero-day-attacks-on-sharepoint-first-wave-linked-to-china-hit-high-value-targets/"
    },
    {
        "Title": "Indonesian Port Operator Pelindo Subsidiary Allegedly Breached – Sensitive Data and Source Code for Sale",
        "Link": "https://dailydarkweb.net/indonesian-port-operator-pelindo-subsidiary-allegedly-breached-sensitive-data-and-source-code-for-sale/",
        "Summary": "A threat actor has allegedly put the source code and a 300 MB database belonging to a subsidiary of PT Pelabuhan Indonesia (Pelindo), Indonesia&#8217;s state-owned port operator, up for sale on a dark web forum. The targeted entity appears to be PT Tanjung Emas Daya Sejahtera (TEDS), a company majority-owned by a Pelindo subsidiary, which [&#8230;]",
        "Date": "2025-07-22",
        "Content": "A threat actor has allegedly put the source code and a 300 MB database belonging to a subsidiary of PT Pelabuhan Indonesia (Pelindo), Indonesia’s state-owned port operator, up for sale on a dark web forum. The targeted entity appears to be PT Tanjung Emas Daya Sejahtera (TEDS), a company majority-owned by a Pelindo subsidiary, which provides services related to port operations. The breach allegedly involves an application named “TEDS TALY,” version 1.624. Pelindo is a critical entity in Indonesia’s infrastructure, managing a vast network of ports and logistics services, making any breach a significant concern for national trade and security.\nThe cybercriminal posted a list of the data types allegedly contained within the stolen database, which includes a vast amount of highly sensitive Personally Identifiable Information (PII). The exposure of such detailed personal and financial data could lead to severe consequences for the individuals affected, including identity theft, targeted phishing attacks, and financial fraud. The threat actor is offering the data for sale via a Telegram channel.\nThe alleged leak includes the following data fields:\nFull Name\nEmployee Identification Number (NIP)\nFamily Card Number (NIK KK) and National ID Card Number (NIK KTP)\nGender, Marital Status, and Date of Birth\nFull Address details (City, District, Village)\nTaxpayer Identification Number (NPWP)\nEducation and Major/Field of Study\nPhone Number and Email Address\nParent’s/Mother’s Name\nReligion\nBRI Bank Account Number\nScanned files of Diplomas, National ID Cards, Family Cards, and Health Certificates\nTags:\nCyberSecurity\ndark web\ndata-breach\nIndonesia\nPelindo\nPII\nsource code"
    },
    {
        "Title": "Washington D.C. Real Estate Giant WC Smith Allegedly Breached – Over 1TB of Data for Sale Online",
        "Link": "https://dailydarkweb.net/washington-d-c-real-estate-giant-wc-smith-allegedly-breached-over-1tb-of-data-for-sale-online/",
        "Summary": "A major Washington, D.C.-based real estate development and property management firm, WC Smith, has allegedly fallen victim to a significant data breach. A threat actor has posted an advertisement on a cybercrime forum claiming to be selling sensitive data belonging to the company. WC Smith has been a prominent player in the capital&#8217;s real estate [&#8230;]",
        "Date": "2025-07-22",
        "Content": "A major Washington, D.C.-based real estate development and property management firm, WC Smith, has allegedly fallen victim to a significant data breach. A threat actor has posted an advertisement on a cybercrime forum claiming to be selling sensitive data belonging to the company. WC Smith has been a prominent player in the capital’s real estate market for over five decades, focusing on creating and managing residential communities and is known for its long-standing commitment to developing neighborhoods throughout the region.\nThe cybercriminal claims to have exfiltrated a massive trove of data, totaling over 1.3 Terabytes. The actor provided a screenshot of the directory structure as proof of the breach, which indicates the compromised information is extensive and could impact the company’s operations and its clients. The company itself has not yet made a public statement regarding the alleged incident.\nThe data being offered for sale allegedly includes a wide range of corporate files. Based on the folder names shared by the threat actor, the compromised data appears to contain critical company information. The specific data sets listed for sale include:\nDBSage (35.9GB)\nSharedDisk2 (3.7GB)\nSQL_Backup (35.7GB)\nwcs-fs1 (801.4GB)\nwcscfs1 (424.0GB)\nTags:\ncyberattack\ndata for sale\ndata-breach\nreal estate\nWashington DC\nWC Smith"
    },
    {
        "Title": "Sensitive Government Database of Argentine Children and Adolescents (R.E.U.N.A) Allegedly Leaked Online",
        "Link": "https://dailydarkweb.net/sensitive-government-database-of-argentine-children-and-adolescents-r-e-u-n-a-allegedly-leaked-online/",
        "Summary": "A threat actor has allegedly leaked a sensitive database belonging to Argentina&#8217;s Unified Statistical Registry of Children and Adolescents (R.E.U.N.A). The organization functions as a critical national registry, centralizing data on children and adolescents to protect their rights and facilitate state intervention and protection policies. The exposure of this information poses a significant risk to [&#8230;]",
        "Date": "2025-07-22",
        "Content": "A threat actor has allegedly leaked a sensitive database belonging to Argentina’s Unified Statistical Registry of Children and Adolescents (R.E.U.N.A). The organization functions as a critical national registry, centralizing data on children and adolescents to protect their rights and facilitate state intervention and protection policies. The exposure of this information poses a significant risk to the safety and privacy of minors across the country.\nThe leak allegedly consists of two separate databases. The first and larger database, containing over 460,000 records, includes highly personal and sensitive information. The second, smaller database contains over 7,000 records related to personnel or individuals with access to the system. The data was posted on a dark web forum, making it available for download.\nThe compromised information allegedly includes a wide range of deeply personal data points on minors. The leaked fields reportedly include:\nFull names, national identity document numbers (DNI), and unique tax identification numbers (CUIL)\nDates of birth, gender, and self-perceived gender\nResidential addresses, including province, municipality, and neighborhood\nHealth insurance details and specific health issues\nFamily and professional references, judicial case status, and other personal observations\nTags:\nArgentina\nchild protection\nCyberSecurity\ndata-breach\ndata-leak\ngovernment\nR.E.U.N.A"
    },
    {
        "Title": "Indonesian Regional Bank PT BPR Serang Allegedly Breached – Customer Loan Data For Sale",
        "Link": "https://dailydarkweb.net/indonesian-regional-bank-pt-bpr-serang-allegedly-breached-customer-loan-data-for-sale/",
        "Summary": "A significant data breach has allegedly hit PT Bank Perkreditan Rakyat (BPR) Serang, a regional development bank based in Serang, Indonesia. A threat actor has posted a database containing sensitive customer and loan information for sale on a dark web forum. The bank, which operates as a Regional Owned Enterprise (BUMD), plays a crucial role [&#8230;]",
        "Date": "2025-07-22",
        "Content": "A significant data breach has allegedly hit PT Bank Perkreditan Rakyat (BPR) Serang, a regional development bank based in Serang, Indonesia. A threat actor has posted a database containing sensitive customer and loan information for sale on a dark web forum. The bank, which operates as a Regional Owned Enterprise (BUMD), plays a crucial role in the local economy by providing financial services, primarily to civil servants and private sector employees in the Banten province.\nThe breach exposes highly sensitive financial and personal data of the bank’s customers. The actor behind the sale released a sample of the data to prove the authenticity of their claims. The compromised information appears to be recent, with data entries dated as recently as mid-July 2025. This incident raises serious concerns about the security of financial data held by regional institutions and the potential for financial fraud and identity theft targeting the affected individuals.\nThe leaked database allegedly contains a wide array of personally identifiable information (PII) and financial details. The data fields listed for sale include:\nFull Name (NAMA)\nAddress (ALAMAT)\nPhone Number (NO HP)\nNational Identity Number (NIK)\nPlace of Work (TEMPAT BEKERJA)\nLoan details including amount (PLAFOND), outstanding debt (BAKIDEBET), interest rate (BUNGA), and payment status.\nLoan product details and account officer information.\nVarious internal codes such as branch, loan, and customer IDs.\nTags:\nBanking\nCyberSecurity\ndata-breach\ndata-leak\nFinance\nIndonesia\nPII\nPT BPR Serang"
    },
    {
        "Title": "French CRM Provider MyClic.fr Allegedly Breached – Database of 1.8 Million for Sale",
        "Link": "https://dailydarkweb.net/french-crm-provider-myclic-fr-allegedly-breached-database-of-1-8-million-for-sale/",
        "Summary": "A threat actor has allegedly leaked the entire database of MyClic.fr, a French company specializing in Customer Relationship Management (CRM) and Enterprise Resource Planning (ERP) software solutions. MyClic provides cloud-based tools for managing sales, projects, invoicing, and training activities, making it a crucial service provider for many businesses, particularly in the service and training sectors [&#8230;]",
        "Date": "2025-07-22",
        "Content": "A threat actor has allegedly leaked the entire database of MyClic.fr, a French company specializing in Customer Relationship Management (CRM) and Enterprise Resource Planning (ERP) software solutions. MyClic provides cloud-based tools for managing sales, projects, invoicing, and training activities, making it a crucial service provider for many businesses, particularly in the service and training sectors across France. The breach, which the seller claims occurred on July 22, 2025, has resulted in a database containing a purported 1.8 million unique lines of data being put up for sale on a hacking forum.\nThe significance of this alleged breach lies in the highly sensitive nature of the data managed by a CRM/ERP provider. An analysis of the sample data provided by the threat actor reveals that the leak contains extensive personal and corporate information. The exposed data could be used by malicious actors for a wide range of attacks, including sophisticated phishing campaigns, identity theft, and corporate espionage, targeting both MyClic’s employees and their extensive client base.\nBased on the sample files, the allegedly leaked data includes:\nUser account details including logins, email addresses, and hashed passwords.\nFull names of contacts and company directors.\nCorporate information such as company names, addresses, and SIRET (French business registration) numbers.\nContact details including email addresses and telephone numbers.\nClient addresses, postal codes, and city information.\nTags:\nCRM\nCyberSecurity\ndata-breach\ndatabase leak\nERP\nFrance\nMyClic.fr"
    },
    {
        "Title": "Major Gaming PC Builder iBUYPOWER Allegedly Hit by Lynx Ransomware",
        "Link": "https://dailydarkweb.net/major-gaming-pc-builder-ibuypower-allegedly-hit-by-lynx-ransomware/",
        "Summary": "The prominent American custom PC manufacturer, iBUYPOWER, has allegedly become the latest target of the Lynx ransomware group. A post dated July 21, 2025, on the cybercriminal group&#8217;s dark web leak site, claims a significant data breach, threatening to release a &#8220;Full data leak&#8221; from the company&#8217;s servers. The group has set a countdown timer [&#8230;]",
        "Date": "2025-07-22",
        "Content": "The prominent American custom PC manufacturer, iBUYPOWER, has allegedly become the latest target of the Lynx ransomware group. A post dated July 21, 2025, on the cybercriminal group’s dark web leak site, claims a significant data breach, threatening to release a “Full data leak” from the company’s servers. The group has set a countdown timer on their post, adding pressure to the renowned PC builder.\niBUYPOWER, based in California, has been a cornerstone of the PC gaming community since 1999. The company is celebrated for building high-performance custom gaming systems for a wide range of customers, from professional esports players and game developers to everyday consumers. Its long-standing partnerships with tech giants such as Intel, NVIDIA, AMD, and Microsoft have solidified its reputation as a key player in the PC gaming industry. The attackers noted the company’s substantial income, which they allege to be $540,000,000, underscoring the high-value nature of the target.\nThe Lynx ransomware group, known for its double-extortion tactics, encrypts and exfiltrates sensitive data before demanding a ransom. The group’s post concerning iBUYPOWER claims to have executed a “Full data leak,” though specific details or proof of the allegedly stolen data were not immediately available in the initial disclosure. This incident highlights the persistent and evolving threat that ransomware gangs pose to major corporations, disrupting operations and compromising sensitive company and customer information.\nTags:\nCyberSecurity\ndata-breach\nGaming\niBUYPOWER\nLynx\nPC gaming\nransomware\nUSA"
    },
    {
        "Title": "Arcus Ransomware Group Allegedly Breaches SubsCorp and Protech Medical",
        "Link": "https://dailydarkweb.net/arcus-ransomware-group-allegedly-breaches-subscorp-and-protech-medical/",
        "Summary": "The Arcus ransomware group has allegedly added two new victims to its dark web leak site, targeting organizations in completely different sectors and geographical locations. The group has claimed responsibility for cyberattacks against a food service company in Colombia and a medical supply firm in the United Kingdom, initiating a public countdown for each. The [&#8230;]",
        "Date": "2025-07-22",
        "Content": "The Arcus ransomware group has allegedly added two new victims to its dark web leak site, targeting organizations in completely different sectors and geographical locations. The group has claimed responsibility for cyberattacks against a food service company in Colombia and a medical supply firm in the United Kingdom, initiating a public countdown for each.\nThe attacks, which appeared on the group’s portal on July 22, 2025, threaten to first sell and then publicly leak the allegedly stolen data if the ransom demands are not met within the stipulated deadlines. This double-extortion tactic is common among modern ransomware gangs, designed to increase pressure on victims to pay. The targeted entities are diverse, indicating that no industry is safe from these opportunistic attacks.\nThe victims listed by the Arcus group are:\n🇨🇴\nSubsCorp:\nA company based in Barranquilla, Colombia, that operates within the Special Food Services sector.\n🇬🇧\nProtech Medical:\nA United Kingdom-based supplier of medical equipment, specializing in pre-heparinised blood gas syringes and capillary tubes for immediate shipment from their warehouse.\nTags:\nArcus\nColombia\ncyber-attack\nCyberSecurity\ndata-breach\nProtech Medical\nransomware\nSubsCorp\nUnited Kingdom"
    },
    {
        "Title": "Dubai Real Estate Giant Binghatti Allegedly Breached – Sensitive Customer Data for Sale",
        "Link": "https://dailydarkweb.net/dubai-real-estate-giant-binghatti-allegedly-breached-sensitive-customer-data-for-sale/",
        "Summary": "A threat actor has allegedly put a vast trove of data belonging to Binghatti, a major real estate development company headquartered in Dubai, United Arab Emirates, up for sale on a hacking forum. Binghatti is a prominent player in the UAE&#8217;s property market, known for its extensive portfolio of residential and commercial projects. The alleged [&#8230;]",
        "Date": "2025-07-22",
        "Content": "A threat actor has allegedly put a vast trove of data belonging to Binghatti, a major real estate development company headquartered in Dubai, United Arab Emirates, up for sale on a hacking forum. Binghatti is a prominent player in the UAE’s property market, known for its extensive portfolio of residential and commercial projects. The alleged breach exposes the sensitive personal and financial information of its international clientele, raising significant concerns about privacy and security.\nThe seller claims the data was exfiltrated from a sales manager’s account and includes a wide array of highly confidential information. To substantiate their claims, the threat actor shared several sample files, including screenshots of reservation agreements, customer passports, bank transfer confirmations, and property floor plans. The post on the forum advertises the following types of data for sale:\nCustomer Personal Information\n: Including full names, email addresses, mobile numbers, nationalities, and residency status.\nOfficial Documents\n: Scans of customer passports and Emirates ID cards.\nSales and Property Details\n: Full sales orders with information such as unit numbers, project names, property prices, discounts, and payment plans.\nFinancial Information\n: Bank transaction files and payment advice documents detailing customer payments.\nSigned Agreements\n: Complete reservation agreements containing purchaser details, property specifics, and signatures.\nThe dataset, which reportedly includes a file with over 350 customer records and hundreds of individual document files, poses a severe risk to the individuals affected. The threat actor explicitly highlighted the data’s potential use for malicious activities, including investment fraud and other scams. The exposure of such detailed personal and financial data could lead to targeted financial fraud, identity theft, and sophisticated phishing campaigns against Binghatti’s customers.\nTags:\nBinghatti\nCyberSecurity\ndata-breach\ndata-leak\nPersonal Information\nreal estate\nUAE"
    },
    {
        "Title": "Inc Ransom Allegedly Breaches Eight International Organizations",
        "Link": "https://dailydarkweb.net/inc-ransom-allegedly-breaches-eight-international-organizations/",
        "Summary": "The ransomware group known as Inc Ransom has allegedly added eight new victims to its data leak site, showcasing a continued campaign targeting a wide array of industries across North America and Europe. The list of victims includes companies and organizations from the legal, manufacturing, insurance, software, and non-profit sectors. This diverse targeting underscores the [&#8230;]",
        "Date": "2025-07-22",
        "Content": "The ransomware group known as Inc Ransom has allegedly added eight new victims to its data leak site, showcasing a continued campaign targeting a wide array of industries across North America and Europe. The list of victims includes companies and organizations from the legal, manufacturing, insurance, software, and non-profit sectors. This diverse targeting underscores the opportunistic nature of the group’s attacks, affecting organizations of various sizes and functions.\nThe threat actors claim to have successfully breached the following entities:\n🇺🇸\nReizen Law Group:\nA U.S.-based law firm specializing in personal injury cases.\n🇨🇦\nASI Group Ltd.\n: A Canadian company that is an industry leader in underwater inspection, maintenance, and repair services.\n🇩🇪\nNeues Leben\n: A German educational and religious organization offering theological courses and mission work information.\n🇺🇸\nHitachi T&D Solutions, Inc.:\nA U.S.-based premier international supplier of high-voltage electrical equipment.\n🇺🇸\nNational Boat Owners Association (NBOA)\n: One of the largest marine insurance agencies in the United States, providing coverage and services for boaters.\n🇺🇸\nCSaaS\n: A U.S. software and managed IT services company offering custom-hosted solutions.\n🇺🇸\nHeartLine Oklahoma\n: A non-profit organization in the U.S. that connects community members to health, housing, and other essential services.\n🇺🇸\nDTX Studio\n: A California-based company that provides software for dental professionals.\nAs proof of compromise, the ransomware group has published file listings for some of the victims, detailing the types of sensitive information allegedly exfiltrated. For HeartLine Oklahoma, the leaked data appears to include highly sensitive operational and personnel files. For the National Boat Owners Association (NBOA), the leak allegedly contains extensive financial and personal documents. The publication of such detailed file structures suggests a significant data breach with potentially severe consequences for the affected organizations and their clients.\nAllegedly leaked data from HeartLine Oklahoma includes:\nHuman Resources (HR) documents and forms\nDisciplinary action records\nEmployee lists and staff phone lists\nCrisis Intervention Department files\nStandard Operating Procedures and disaster plans\nCall logs and chat transcripts\nAllegedly leaked data from the National Boat Owners Association (NBOA) includes:\nAccounting and budget files\nTax documents, including personal and federal tax returns\nBalance sheets and income statements\nPersonal user folders containing mortgage approval documents and W2s\nInsurance policy and claims information\nTags:\nASI Group\nCSaaS\ncyber-attack\nCyberSecurity\ndata-breach\nDTX Studio\nHeartLine Oklahoma\nHitachi T&D Solutions\nINC Ransom\nNBOA\nNeues Leben\nransomware\nReizen Law Group"
    },
    {
        "Title": "Financial Tech Giant SilverLake Axis Allegedly Breached – 423GB of Data for Sale",
        "Link": "https://dailydarkweb.net/financial-tech-giant-silverlake-axis-allegedly-breached-423gb-of-data-for-sale/",
        "Summary": "SilverLake Axis, a major global player in the financial technology sector, is allegedly the latest victim of a significant data breach. The company, which provides critical enterprise solutions to over 370 financial institutions across 80 countries, may have had a vast amount of sensitive data exfiltrated and put up for sale on a cybercrime forum. [&#8230;]",
        "Date": "2025-07-22",
        "Content": "SilverLake Axis, a major global player in the financial technology sector, is allegedly the latest victim of a significant data breach. The company, which provides critical enterprise solutions to over 370 financial institutions across 80 countries, may have had a vast amount of sensitive data exfiltrated and put up for sale on a cybercrime forum. A threat actor has claimed to be in possession of 423GB of data belonging to the Malaysia-based corporation, raising serious concerns given the company’s integral role in the international banking and financial services industry.\nThe threat actor’s post details the contents of the massive data cache, which allegedly includes highly sensitive corporate information. The sale listing claims the data comprises not only internal documentation, API documentation, and credentials but also the company’s entire network topology and numerous SQL scripts. Furthermore, the actor claims to have source code and images from a wide array of the company’s software projects, which appear to be core components of financial and banking systems. An investigation into the claims is expected, but the potential exposure of such critical infrastructure and client project data could have severe repercussions.\nThe allegedly leaked data includes:\nInternal documentation\nEntire network topology\nAPI documentation\nSQL scripts\nCredentials\nSource code and image logs for projects related to client banking systems, payment gateways, e-wallets, and core financial solutions.\nTags:\ncyber-attack\nCyberSecurity\ndata-breach\nfinancial technology\nSilverLake Axis"
    }
]