[
    {
        "Title": "Critical Vulnerability in Anthropic's MCP Exposes Developer Machines to Remote Exploits",
        "Link": "https://thehackernews.com/2025/07/critical-vulnerability-in-anthropics.html",
        "Summary": "Cybersecurity researchers have discovered a critical security vulnerability in artificial intelligence (AI) company Anthropic's Model Context Protocol (MCP) Inspector project that could result in remote code execution (RCE) and allow an attacker to gain complete access to the hosts.\nThe vulnerability, tracked as CVE-2025-49596, carries a CVSS score of 9.4 out of a maximum of 10.0.\n\"This is one",
        "Date": "2025-07-01",
        "Content": "Cybersecurity researchers have discovered a critical security vulnerability in artificial intelligence (AI) company Anthropic's Model Context Protocol (\nMCP\n) Inspector project that could result in remote code execution (RCE) and allow an attacker to gain complete access to the hosts.\nThe vulnerability, tracked as\nCVE-2025-49596\n, carries a CVSS score of 9.4 out of a maximum of 10.0.\n\"This is one of the first critical RCEs in Anthropic's MCP ecosystem, exposing a new class of browser-based attacks against AI developer tools,\" Oligo Security's Avi Lumelsky\nsaid\nin a report published last week.\n\"With code execution on a developer's machine, attackers can steal data, install backdoors, and move laterally across networks - highlighting serious risks for AI teams, open-source projects, and enterprise adopters relying on MCP.\"\nMCP, introduced by Anthropic in November 2024, is an open protocol that standardizes the way large language model (LLM) applications integrate and share data with external data sources and tools.\nThe\nMCP Inspector\nis a developer tool for testing and debugging MCP servers, which expose specific capabilities through the protocol and allow an AI system to access and interact with information beyond its training data.\nIt contains two components, a client that provides an interactive interface for testing and debugging, and a proxy server that bridges the web UI to different MCP servers.\nThat said, a key security consideration to keep in mind is that the server should not be exposed to any untrusted network as it has permission to spawn local processes and can connect to any specified MCP server.\nThis aspect, coupled with the fact that the default settings developers use to spin up a local version of the tool come with \"significant\" security risks, such as missing authentication and encryption, opens up a new attack pathway, per Oligo.\n\"This misconfiguration creates a significant attack surface, as anyone with access to the local network or public internet can potentially interact with and exploit these servers,\" Lumelsky said.\nThe attack plays out by chaining a known security flaw affecting modern web browsers, dubbed 0.0.0.0 Day, with a cross-site request forgery (CSRF) vulnerability in Inspector (CVE-2025-49596) to run arbitrary code on the host simply upon visiting a malicious website.\n\"Versions of MCP Inspector below 0.14.1 are vulnerable to remote code execution due to lack of authentication between the Inspector client and proxy, allowing unauthenticated requests to launch MCP commands over stdio,\" the developers of MCP Inspector\nsaid\nin an advisory for CVE-2025-49596.\n0.0.0.0 Day is a\n19-year-old vulnerability\nin modern web browsers that could enable malicious websites to breach local networks. It takes advantage of the browsers' inability to securely handle the IP address 0.0.0.0, leading to code execution.\n\"Attackers can exploit this flaw by crafting a malicious website that sends requests to localhost services running on an MCP server, thereby gaining the ability to execute arbitrary commands on a developer's machine,\" Lumelsky explained.\n\"The fact that the default configurations expose MCP servers to these kinds of attacks means that many developers may be inadvertently opening a backdoor to their machine.\"\nSpecifically, the proof-of-concept (PoC) makes use of the Server-Sent Events (SSE) endpoint to dispatch a malicious request from an attacker-controlled website to achieve RCE on the machine running the tool even if it's listening on localhost (127.0.0.1).\nThis works because the IP address 0.0.0.0 tells the operating system to listen on all IP addresses assigned to the machine, including the local loopback interface (i.e., localhost).\nIn a hypothetical attack scenario, an attacker could set up a fake web page and trick a developer into visiting it, at which point, the malicious JavaScript embedded in the page would send a request to 0.0.0.0:6277 (the default port on which the proxy runs), instructing the MCP Inspector proxy server to execute arbitrary commands.\nThe attack can also leverage\nDNS rebinding techniques\nto create a forged DNS record that points to 0.0.0.0:6277 or 127.0.0.1:6277 in order to bypass security controls and gain RCE privileges.\nFollowing responsible disclosure in April 2025, the vulnerability was addressed by the project maintainers on June 13 with the release of\nversion 0.14.1\n. The fixes add a session token to the proxy server and incorporate origin validation to completely plug the attack vector.\n\"Localhost services may appear safe but are often exposed to the public internet due to network routing capabilities in browsers and MCP clients,\" Oligo said.\n\"The mitigation adds Authorization which was missing in the default prior to the fix, as well as\nverifying the Host and Origin headers\nin HTTP, making sure the client is really visiting from a known, trusted domain. Now, by default, the server blocks DNS rebinding and CSRF attacks.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "TA829 and UNK_GreenSec Share Tactics and Infrastructure in Ongoing Malware Campaigns",
        "Link": "https://thehackernews.com/2025/07/ta829-and-unkgreensec-share-tactics-and.html",
        "Summary": "Cybersecurity researchers have flagged the tactical similarities between the threat actors behind the RomCom RAT and a cluster that has been observed delivering a loader dubbed TransferLoader.\nEnterprise security firm Proofpoint is tracking the activity associated with TransferLoader to a group dubbed UNK_GreenSec and the RomCom RAT actors under the moniker TA829. The latter is also known by the",
        "Date": "2025-07-01",
        "Content": "Cybersecurity researchers have flagged the tactical similarities between the threat actors behind the\nRomCom RAT\nand a cluster that has been observed delivering a loader dubbed\nTransferLoader\n.\nEnterprise security firm Proofpoint is tracking the activity associated with TransferLoader to a group dubbed\nUNK_GreenSec\nand the RomCom RAT actors under the moniker\nTA829\n. The latter is also known by the names CIGAR, Nebulous Mantis, Storm-0978, Tropical Scorpius, UAC-0180, UAT-5647, UNC2596, and Void Rabisu.\nThe company said it discovered UNK_GreenSec as part of its investigation into TA829, describing it as using an \"unusual amount of similar infrastructure, delivery tactics, landing pages, and email lure themes.\"\nTA829 is something of an unusual hacking group in the threat landscape given its ability to conduct both espionage as well as financially motivated attacks. The Russia-aligned hybrid group has also been linked to the\nzero-day exploitation of security flaws\nin Mozilla Firefox and Microsoft Windows to deliver RomCom RAT in attacks aimed at global targets.\nEarlier this year, PRODAFT\ndetailed\nthe threat actors' use of bulletproof hosting providers, living-off-the-land (LOTL) tactics, and encrypted command-and-control (C2) communications to sidestep detection.\nTransferLoader, on the other hand, was\nfirst documented\nby Zscaler ThreatLabz in connection with a February 2025 campaign that delivered the\nMorpheus ransomware\nagainst an unnamed American law firm.\nProofpoint noted that campaigns undertaken by both TA829 and UNK_GreenSec rely on REM Proxy services that are deployed on compromised MikroTik routers for their upstream infrastructure. That said, the exact method used to breach these devices is not known.\n\"REM Proxy devices are likely rented to users to relay traffic,\" the Proofpoint threat research team\nsaid\n. \"In observed campaigns, both TA829 and UNK_GreenSec use the service to relay traffic to new accounts at freemail providers to then send to targets. REM Proxy services have also been used by TA829 to initiate similar campaigns via compromised email accounts.\"\nGiven that the format of the sender addresses are similar -- e.g., ximajazehox333@gmail.com and hannahsilva1978@ukr.net -- it's believed that the threat actors are likely using some sort of an email builder utility that facilitates the en masse creation and sending of phishing emails via REM Proxy nodes.\nThe messages act as a conduit to deliver a link, which is either directly embedded in the body or within a PDF attachment. Clicking on the link initiates a series of redirections via Rebrandly that ultimately take the victim to a fake Google Drive or Microsoft OneDrive page, while filtering out machines that have been flagged as sandboxes or deemed not of interest to the attackers.\nIt's at this stage that the attack chains splinter into two, as the adversary infrastructure to which the targets are redirected is different, ultimately paving the way for TransferLoader in the case of UNK_GreenSec and a malware strain called SlipScreen in the case of TA829.\n\"TA829 and UNK_GreenSec have both deployed Putty's PLINK utility to set up SSH tunnels, and both used IPFS services to host those utilities in follow-on activity,\" Proofpoint noted.\nSlipScreen is a first-stage loader that's designed to decrypt and load shellcode directly into memory and initiate communications with a remote server, but only after a Windows Registry check to ensure the targeted computer has at least 55 recent documents based on the \"HKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\RecentDocs\" key.\nThe infection sequence is then used to deploy a\ndownloader\nnamed MeltingClaw (aka\nDAMASCENED PEACOCK\n) or RustyClaw, which is then used to drop backdoors like ShadyHammock or DustyHammock, with the former being used to launch SingleCamper (aka SnipBot), an updated version of RomCom RAT.\nDustyHammock, besides running reconnaissance commands on an infected system, comes fitted with the ability to download additional payloads hosted on the InterPlanetary File System (\nIPFS\n) network.\nCampaigns propagating TransferLoader have been found to leverage job opportunity-themed messages to trick victims into clicking on a link that ostensibly leads to a PDF resume, but, in reality, results in the download of TransferLoader from an IPFS webshare.\nTransferLoader's primary objective is to fly under the radar and serve more malware, such as Metasploit and Morpheus ransomware, a rebranded version of\nHellCat ransomware\n.\n\"Unlike the TA829 campaigns, the TransferLoader campaigns' JavaScript components redirected users to a different PHP endpoint on the same server, which allows the operator to conduct further server-side filtering,\" Proofpoint said. \"UNK_GreenSec used a dynamic landing page, often irrelevant to the OneDrive spoof, and redirected users to the final payload that was stored on an IPFS webshare.\"\nThe overlapping tradecraft between TA829 and UNK_GreenSec raises one of the four possibilities -\nThe threat actors are procuring distribution and infrastructure from the same third-party provider\nTA829 acquires and distributes infrastructure on its own, and has provided these services to UNK_GreenSec\nUNK_GreenSec is the infrastructure provider that typically offers its warez to TA829, but decided to temporarily use it to deliver its own malware, TransferLoader\nTA829 and UNK_GreenSec are one and the same, and TransferLoader is a new addition to their malware arsenal\n\"In the current threat landscape, the points at which cybercrime and espionage activity overlap continue to increase, removing the distinctive barriers that separate criminal and state actors,\" Proofpoint said. \"Campaigns, indicators, and threat actor behaviors have converged, making attribution and clustering within the ecosystem more challenging.\"\n\"While there is not sufficient evidence to substantiate the exact nature of the relationship between TA829 and UNK_GreenSec, there is very likely a link between the groups.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "New Flaw in IDEs Like Visual Studio Code Lets Malicious Extensions Bypass Verified Status",
        "Link": "https://thehackernews.com/2025/07/new-flaw-in-ides-like-visual-studio.html",
        "Summary": "A new study of integrated development environments (IDEs) like Microsoft Visual Studio Code, Visual Studio, IntelliJ IDEA, and Cursor has revealed weaknesses in how they handle the extension verification process, ultimately enabling attackers to execute malicious code on developer machines.\n\"We discovered that flawed verification checks in Visual Studio Code allow publishers to add functionality",
        "Date": "2025-07-01",
        "Content": "A new study of integrated development environments (IDEs) like Microsoft Visual Studio Code, Visual Studio, IntelliJ IDEA, and Cursor has revealed weaknesses in how they handle the extension verification process, ultimately enabling attackers to execute malicious code on developer machines.\n\"We discovered that flawed verification checks in Visual Studio Code allow publishers to add functionality to extensions while maintaining the verified icon,\" OX Security researchers Nir Zadok and Moshe Siman Tov Bustan\nsaid\nin a report shared with The Hacker News. \"This results in the potential for malicious extensions to appear verified and approved, creating a false sense of trust.\"\nSpecifically, the analysis found that Visual Studio Code sends an HTTP POST request to the domain \"marketplace.visualstudio[.]com\" to determine if an extension is verified or otherwise.\nThe exploitation method essentially involves creating a malicious extension with the same verifiable values as an already verified extension, such as that of Microsoft, and bypassing trust checks.\nAs a result, it allows rogue extensions to appear verified to unsuspecting developers, while also containing code capable of executing operating system commands.\nFrom a security standpoint, this is a classic case of extension sideloading abuse, where bad actors distribute plugins outside the official marketplace. Without proper code signing enforcement or trusted publisher verification, even legitimate-looking extensions can hide dangerous scripts.\nFor attackers, this opens up a low-barrier entry point to achieve remote code execution—a risk that's especially serious in development environments where sensitive credentials and source code are often accessible.\nIn a proof-of-concept (PoC) demonstrated by the cybersecurity company, the extension was configured to open the Calculator app on a Windows machine, thereby highlighting its ability to execute commands on the underlying host.\nBy identifying the values used in verification requests and modifying them, it was found that it's possible to create a VSIX package file such that it causes the malicious extension to appear legitimate.\nOX Security said it was able to reproduce the flaw across other IDEs like IntelliJ IDEA and Cursor by modifying the values used for verification without making them lose their verified status.\nIn response to responsible disclosures, Microsoft said the behavior is by design and that the changes will prevent the VSIX extension from being published to the Marketplace owing to extension signature verification that's enabled by default across all platforms.\nHowever, the cybersecurity company found the flaw to be exploitable as recently as June 29, 2025. The Hacker News has reached out to Microsoft for comment, and we will update the story if we hear back.\nThe findings once again show that relying solely on the verified symbol of extensions can be risky, as attackers can trick developers into running malicious code without their knowledge. To mitigate such risks, it's advised to install extensions directly from official marketplaces as opposed to using VSIX extension files shared online.\n\"The ability to inject malicious code into extensions, package them as VSIX/ZIP files, and install them while maintaining the verified symbols across multiple major development platforms poses a serious risk,\" the researchers said. \"This vulnerability particularly impacts developers who install extensions from online resources such as GitHub.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "A New Maturity Model for Browser Security: Closing the Last-Mile Risk",
        "Link": "https://thehackernews.com/2025/07/a-new-maturity-model-for-browser.html",
        "Summary": "Despite years of investment in Zero Trust, SSE, and endpoint protection, many enterprises are still leaving one critical layer exposed: the browser.\nIt’s where 85% of modern work now happens. It’s also where copy/paste actions, unsanctioned GenAI usage, rogue extensions, and personal devices create a risk surface that most security stacks weren’t designed to handle. For security leaders who know",
        "Date": "2025-07-01",
        "Content": "Despite years of investment in Zero Trust, SSE, and endpoint protection, many enterprises are still leaving one critical layer exposed: the browser.\nIt's where 85% of modern work now happens. It's also where copy/paste actions, unsanctioned GenAI usage, rogue extensions, and personal devices create a risk surface that most security stacks weren't designed to handle. For security leaders who know this blind spot exists but lack a roadmap to fix it, a new framework may help.\nThe Secure Enterprise Browser Maturity Guide: Safeguarding the Last Mile of Enterprise Risk\n, authored by cybersecurity researcher Francis Odum, offers a pragmatic model to help CISOs and security teams assess, prioritize, and operationalize browser-layer security. It introduces a clear progression from basic visibility to real-time enforcement and ecosystem integration, built around real-world threats, organizational realities, and evolving user behavior.\nWhy the Browser Has Become the Security Blind Spot\nOver the past three years, the browser has quietly evolved into the new endpoint of the enterprise. Cloud-first architectures, hybrid work, and the explosive growth of SaaS apps have made it the primary interface between users and data.\n85% of the workday now happens inside the browser\n90% of companies allow access to corporate apps from BYOD devices\n95% report experiencing browser-based cyber incidents\n98% have seen BYOD policy violations\nAnd while most security programs have hardened identity layers, firewalls, and email defenses, the browser remains largely ungoverned. It's where sensitive data is copied, uploaded, pasted, and sometimes leaked, with little or no monitoring.\nTraditional Tools Weren't Built for This Layer\nThe guide breaks down why existing controls struggle to close the gap:\nDLP\nscans files and email, but misses in-browser copy/paste and form inputs.\nCASB\nprotects sanctioned apps, but not unsanctioned GenAI tools or personal cloud drives.\nSWGs\nblock known bad domains, but not dynamic, legitimate sites running malicious scripts.\nEDR\nwatches the OS, not the browser's DOM.\nThis reflects what is described as the \"last mile\" of enterprise IT, the final stretch of the data path where users interact with content and attackers exploit the seams.\nGenAI Changed the Game\nA core theme of the guide is how browser-based GenAI usage has exposed a new class of invisible risk. Users routinely paste proprietary code, business plans, and customer records into LLMs with no audit trail.\n65% of enterprises admit they have no control over what data goes into GenAI tools\nPrompts are effectively unsanctioned API calls\nTraditional DLP, CASB, and EDR tools offer no insight into these flows\nThe browser is often the only enforcement point that sees the prompt\nbefore\nit leaves the user's screen.\nThe Secure Enterprise Browser Maturity Model\nTo move from reactive response to structured control, the guide introduces a three-stage maturity model for browser-layer security:\nStage 1: Visibility\n\"You can't protect what you can't see.\"\nOrganizations at this stage begin by illuminating browser usage across devices, especially unmanaged ones.\nInventory browsers and versions across endpoints\nCapture telemetry: uploads, downloads, extension installs, session times\nDetect anomalies (e.g., off-hours SharePoint access, unusual copy/paste behavior)\nIdentify shadow SaaS and GenAI usage without blocking it yet\nQuick wins here include audit-mode browser extensions, logging from SWGs, and flagging outdated or unmanaged browsers.\nStage 2: Control & Enforcement\nOnce visibility is in place, teams begin actively managing risk within the browser:\nEnforce identity-bound sessions (e.g., block personal Gmail login from corp session)\nControl uploads/downloads to/from sanctioned apps\nBlock or restrict unvetted browser extensions\nInspect browser copy/paste actions using DLP classifiers\nDisplay just-in-time warnings (e.g., \"You're about to paste PII into ChatGPT\")\nThis stage is about\nprecision\n: applying the right policies in real-time, without breaking user workflows.\nStage 3: Integration & Usability\nAt full maturity, browser-layer telemetry becomes part of the larger security ecosystem:\nEvents stream into SIEM/XDR alongside network and endpoint data\nRisk scores influence IAM and ZTNA decisions\nBrowser posture is integrated with DLP classifications and compliance workflows\nDual browsing modes (work vs. personal) preserve privacy while enforcing policy\nControls extend to contractors, third parties, and BYOD—at scale\nIn this phase, security becomes invisible but impactful, reducing friction for users and mean-time-to-response for the SOC.\nA Strategic Roadmap, Not Just a Diagnosis\nThe guide doesn't just diagnose the problem, it helps security leaders build an actionable plan:\nUse the browser security checklist to benchmark current maturity\nIdentify fast, low-friction wins in Stage 1 (e.g., telemetry, extension audits)\nDefine a control policy roadmap (start with GenAI usage and risky extensions)\nAlign telemetry and risk scoring with existing detection and response pipelines\nEducate users with inline guidance instead of blanket blocks\nIt also includes practical insights on governance, change management, and rollout sequencing for global teams.\nWhy This Guide Matters\nWhat makes this model especially timely is that it doesn't call for a rip-and-replace of existing tools. Instead, it complements Zero Trust and SSE strategies by closing the final gap where humans interact with data.\nSecurity architecture has evolved to protect where data lives. But to protect where data moves, copy, paste, prompt, upload, we need to rethink the last mile.\nThe Secure Enterprise Browser Maturity Guide\nis available now for security leaders ready to take structured, actionable steps to protect their most overlooked layer.\nDownload the full guide\nand benchmark your browser-layer maturity.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Chrome Zero-Day CVE-2025-6554 Under Active Attack — Google Issues Security Update",
        "Link": "https://thehackernews.com/2025/07/google-patches-critical-zero-day-flaw.html",
        "Summary": "Google has released security updates to address a vulnerability in its Chrome browser for which an exploit exists in the wild.\nThe zero-day vulnerability, tracked as CVE-2025-6554 (CVSS score: N/A), has been described as a type confusing flaw in the V8 JavaScript and WebAssembly engine.\n\"Type confusion in V8 in Google Chrome prior to 138.0.7204.96 allowed a remote attacker to perform arbitrary",
        "Date": "2025-07-01",
        "Content": "Google has released security updates to address a vulnerability in its Chrome browser for which an exploit exists in the wild.\nThe zero-day vulnerability, tracked as CVE-2025-6554 (CVSS score: N/A), has been described as a type confusing flaw in the V8 JavaScript and WebAssembly engine.\n\"Type confusion in V8 in Google Chrome prior to 138.0.7204.96 allowed a remote attacker to perform arbitrary read/write via a crafted HTML page,\" according to a\ndescription\nof the bug on the NIST's National Vulnerability Database (NVD).\nType confusion vulnerabilities can have\nsevere consequences\nas they can be exploited to trigger unexpected software behavior, resulting in the execution of arbitrary code and program crashes.\nZero-day bugs like this are especially risky because attackers often start using them before a fix is available. In real-world attacks, these flaws can let hackers install spyware, launch drive-by downloads, or quietly run harmful code — sometimes just by getting someone to open a malicious website.\nClément Lecigne of Google's Threat Analysis Group (TAG) has been credited with discovering and reporting the flaw on June 25, 2025, signaling that it may have been weaponized in highly targeted attacks — possibly involving nation-state actors or surveillance operations. TAG typically detects and investigates serious threats like government-backed attacks.\nThe tech giant also noted that the issue was mitigated the next day by means of a configuration change that was pushed out to the Stable channel across all platforms. For everyday users, that means the threat may not be widespread yet, but it's still urgent to patch — especially if you're in roles handling sensitive or high-value data.\nGoogle has not released any additional details about the vulnerability and who may have exploited it, but\nacknowledged\nthat \"an exploit for CVE-2025-6554 exists in the wild.\"\nCVE-2025-6554 is the fourth zero-day vulnerability in Chrome to be addressed by Google since the start of the year after\nCVE-2025-2783\n,\nCVE-2025-4664\n, and\nCVE-2025-5419\n. However, it bears noting that there is no clarity on whether CVE-2025-4664 has been abused in a malicious context.\nTo safeguard against potential threats, it's advised to update their Chrome browser to versions 138.0.7204.96/.97 for Windows, 138.0.7204.92/.93 for macOS, and 138.0.7204.96 for Linux.\nIf you're unsure whether your browser is up to date, go to Settings > Help > About Google Chrome — it should trigger the latest update automatically. For businesses and IT teams managing multiple endpoints, enabling automatic patch management and monitoring browser version compliance is critical.\nUsers of other Chromium-based browsers such as Microsoft Edge, Brave, Opera, and Vivaldi are also advised to apply the fixes as and when they become available.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "U.S. Arrests Facilitator in North Korean IT Worker Scheme; Seizes 29 Domains and Raids 21 Laptop Farms",
        "Link": "https://thehackernews.com/2025/07/us-arrests-key-facilitator-in-north.html",
        "Summary": "The U.S. Department of Justice (DoJ) on Monday announced sweeping actions targeting the North Korean information technology (IT) worker scheme, leading to the arrest of one individual and the seizure of 29 financial accounts, 21 fraudulent websites, and nearly 200 computers.\nThe coordinated action saw searches of 21 known or suspected \"laptop farms\" between June 10 and 17, 2025, across 14 states",
        "Date": "2025-07-01",
        "Content": "The U.S. Department of Justice (DoJ) on Monday announced sweeping actions targeting the North Korean information technology (IT) worker scheme, leading to the arrest of one individual and the seizure of 29 financial accounts, 21 fraudulent websites, and nearly 200 computers.\nThe coordinated action saw searches of 21 known or suspected \"laptop farms\" between June 10 and 17, 2025, across 14 states in the U.S. that were put to use by North Korean IT workers to remotely connect to victim networks via company-provided laptop computers.\n\"The North Korean actors were assisted by individuals in the United States, China, United Arab Emirates, and Taiwan, and successfully obtained employment with more than 100 U.S. companies,\" the DoJ\nsaid\n.\nThe North Korean IT worker scheme has become one of the crucial cogs in the Democratic People's Republic of North Korea (DPRK) revenue generation machine in a manner that bypasses international sanctions. The fraudulent operation, described by cybersecurity company DTEX as a\nstate-sponsored crime syndicate\n, involves North Korean actors obtaining employment with U.S. companies as remote IT workers, using a mix of stolen and fictitious identities.\nOnce they land a job, the IT workers receive regular salary payments and gain access to proprietary employer information, including export controlled U.S. military technology and virtual currency. In one incident, the IT workers are alleged to have secured jobs at an unnamed Atlanta-based blockchain research and development company and stole over $900,000 in digital assets.\nNorth Korean IT workers are a serious threat because not only do they generate illegal revenues for the Hermit Kingdom through \"legitimate\" work, but they also weaponize their insider access to harvest sensitive data, steal funds, and even\nextort their employers\nin exchange for not publicly disclosing their data.\n\"These schemes target and steal from U.S. companies and are designed to evade sanctions and fund the North Korean regime's illicit programs, including its weapons programs,\" said Assistant Attorney General John A. Eisenberg of the Department's National Security Division.\nLast month, the DoJ said it had filed a civil forfeiture complaint in the U.S. District Court for the District of Columbia that targeted over $7.74 million in cryptocurrency, non-fungible tokens (NFTs), and other digital assets linked to the global IT worker scheme.\n\"North Korea remains intent on funding its weapons programs by defrauding U.S. companies and exploiting American victims of identity theft,\" said Assistant Director Roman Rozhavsky of the FBI Counterintelligence Division. \"North Korean IT workers posing as U.S. citizens fraudulently obtained employment with American businesses so they could funnel hundreds of millions of dollars to North Korea's authoritarian regime.\"\nChief among the actions announced Monday includes the arrest of U.S. national Zhenxing \"Danny\" Wang of New Jersey, who has been accused of perpetrating a multi-year fraud scheme in collusion with co-conspirators to get remote IT work with U.S. companies, ultimately generating more than $5 million in revenue.\nOther individuals who participated in the scheme include six Chinese and two Taiwanese nationals -\nJing Bin Huang (靖斌 黄)\nBaoyu Zhou (周宝玉)\nTong Yuze (佟雨泽)\nYongzhe Xu (徐勇哲 and يونجزهي أكسو)\nZiyou Yuan (زيو)\nZhenbang Zhou (周震邦)\nMengting Liu (劉 孟婷), and\nEnchia Liu (刘恩)\nAccording to the indictment, the defendants and other co-conspirators compromised the identities of more than 80 U.S. individuals to obtain remote jobs at more than 100 U.S. companies between 2021 and October 2024. The overseas IT workers are believed to have been assisted by U.S.-based facilitators, Kejia \"Tony\" Wang, Zhenxing \"Danny\" Wang, and at least four others, with Kejia Wang even traveling to China in 2023 to meet overseas co-conspirators and IT workers and discuss the scheme.\nTo trick the companies into thinking that the remote workers are based in the U.S., Wang et al received and hosted the company-issued laptops at their residences, and enabled the North Korean threat actors to connect to these devices using\nKVM\n(short for \"keyboard-video-mouse\") switches like PiKVM or TinyPilot.\n\"Kejia Wang and Zhenxing Wang also created shell companies with corresponding websites and financial accounts, including Hopana Tech LLC, Tony WKJ LLC, and Independent Lab LLC, to make it appear as though the overseas IT workers were affiliated with legitimate U.S. businesses,\" the DoJ said. \"Kejia Wang and Zhenxing Wang established these and other financial accounts to receive money from victimized U.S. companies, much of which was subsequently transferred to overseas co‑conspirators.\"\nIn return for providing these services, Wang and his co-conspirators are estimated to have received no less than $696,000 from the IT workers.\nSeparately, the Northern District of Georgia unsealed a five-count wire fraud and money laundering indictment charging four North Korean nationals, Kim Kwang Jin (김관진), Kang Tae Bok (강태복), Jong Pong Ju (정봉주), and Chang Nam Il (창남일), with stealing more than $900,000 from the blockchain company located in Atlanta.\nCourt documents\nallege\nthat the defendants traveled to the United Arab Emirates on North Korean documents in October 2019 and worked together as a team. Sometime between December 2020 and May 2021, Kim Kwang Jin and Jong Pong Ju were hired as developers by the blockchain company and a Serbian virtual token company, respectively. Then, acting on the recommendation of Jong Pong Ju, the Serbian company hired Chang Nam Il.\nAfter Kim Kwang Jin and Jong Pong Ju gained their employers' trust and were assigned projects that granted them access to the firm's virtual currency assets, the threat actors proceeded to steal the assets in February and March 2022, in one case altering the source code associated with two of the company's smart contracts.\nThe stolen proceeds were then laundered using a cryptocurrency mixer service known as Tornado Cash and eventually transferred to virtual currency exchange accounts controlled by Kang Tae Bok and Chang Nam Il. These accounts, the DoJ said, were opened using fraudulent Malaysian identification documents.\n\"These arrests are a powerful reminder that the threats posed by DPRK IT workers extend beyond revenue generation,\" Michael \"Barni\" Barnhart, Principal i3 Insider Risk Investigator at DTEX, told The Hacker News in a statement. \"Once inside, they can conduct malicious activity from within trusted networks, posing serious risks to national security and companies worldwide.\"\n\"The U.S. government's actions [...] are absolutely top notch and a critical step in disrupting this threat. DPRK actors are increasingly utilizing front companies and trusted third parties to slip past traditional hiring safeguards, including observed instances of those in sensitive sectors like government and the defense industrial base. Organizations must look beyond their applicant portals and reassess trust across their entire talent pipeline because the threat is adapting as we are.\"\nMicrosoft Suspends 3,000 Email Accounts Tied to IT Workers\nMicrosoft, which has been tracking the IT worker threat under the moniker Jasper Sleet (previously Storm-0287) since 2020, said it has suspended 3,000 known Outlook/Hotmail accounts created by the threat actors as part of its broader efforts to disrupt North Korean cyber operations. The activity cluster is also tracked as Nickel Tapestry, Wagemole, and UNC5267.\nThe worker fraud scheme starts with setting up identities such that they match the geolocation of their target organizations, after which they are digitally fleshed out through social media profiles and fabricated portfolios on developer-oriented platforms like GitHub to give the personas a veneer of legitimacy.\nThe tech giant called out the IT workers' exploitation of artificial intelligence (AI) tools to\nenhance images and change voices\nin order to boost the credibility of their job profiles and appear more authentic to employers. The IT workers have also been found to set up fake profiles on LinkedIn to communicate with recruiters and apply for jobs.\n\"These highly skilled workers are most often located in North Korea, China, and Russia, and use tools such as virtual private networks (VPNs) and remote monitoring and management (RMM) tools together with witting accomplices to conceal their locations and identities,\" the Microsoft Threat Intelligence team\nsaid\n.\nAnother noteworthy tactic embraced by Jasper Sleet revolves around posting facilitator job ads under the guise of remote job partnerships to help IT workers secure employment, pass identity checks, and work remotely. As the relationship with the facilitators grows, they may also be tasked with creating a bank account for the IT workers, or purchasing mobile phone numbers or SIM cards.\nFurthermore, the witting accomplices are responsible for validating the IT workers' bogus identities during the employment verification process using online background check service providers. The submitted documents include fake or stolen drivers' licenses, social security cards, passports, and permanent resident identification cards.\nAs a way to counter the threat, Microsoft said it has developed a custom machine learning solution powered by proprietary threat intelligence that can surface suspicious accounts exhibiting behaviors that align with known DPRK tradecraft for follow-on actions.\n\"North Korea's fraudulent remote worker scheme has since evolved, establishing itself as a well-developed operation that has allowed North Korean remote workers to infiltrate technology-related roles across various industries,\" Redmond said. \"In some cases, victim organizations have even reported that remote IT workers were some of their most talented employees.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft Removes Password Management from Authenticator App Starting August 2025",
        "Link": "https://thehackernews.com/2025/07/microsoft-removes-password-management.html",
        "Summary": "Microsoft has said that it's ending support for passwords in its Authenticator app starting August 1, 2025.\nMicrosoft’s move is part of a much larger shift away from traditional password-based logins. The company said the changes are also meant to streamline autofill within its two-factor authentication (2FA) app, making the experience simpler and more secure.Over the past few years, Microsoft",
        "Date": "2025-07-01",
        "Content": "Microsoft has said that it's ending support for passwords in its Authenticator app starting August 1, 2025.\nMicrosoft's move is part of a much larger shift away from traditional password-based logins. The company said the changes are also meant to streamline autofill within its two-factor authentication (2FA) app, making the experience simpler and more secure.\nOver the past few years, Microsoft has been pushing for a passwordless future using technologies like\npasskeys\n, Windows Hello, and FIDO2-based authentication. These methods offer better protection against\nphishing\nand password reuse, which are still major attack vectors. While it may feel like a hassle at first, this change is actually aimed at reducing your risk in the long run.\n\"Starting July 2025, the autofill feature in Authenticator will stop working, and from August 2025, passwords will no longer be accessible in Authenticator,\" Microsoft\nsaid\nin a support document for Authenticator.\nIt's worth noting that Microsoft has already removed the ability to add or import new passwords in the app as of last month. However, the option to save passwords through autofill will continue to work in July.\nThat said, the feature isn't going away entirely. Instead, the saved passwords and addresses will now be synced with users' Microsoft accounts, allowing them to be accessed via the Edge web browser by setting it as the default autofill provider.\n\"After August 2025, your saved passwords will no longer be accessible in Authenticator and any generated passwords not saved will be deleted,\" Redmond\nsaid\n.\nAnother key aspect to note is that the changes do not apply to passkeys. Users who have enabled passkeys for their Microsoft accounts are required to\nenable Authenticator\nas their passkey provider. Disabling Authenticator will also have the side effect of disabling passkeys.\nIf you've been using the Authenticator app mainly for autofill or to store passwords across devices, now's a good time to switch to a dedicated password manager like Edge, Apple iCloud Keychain, Bitwarden, or Google Password Manager. These tools support syncing, biometric unlock, and encrypted backups.\nYou can export your passwords from Authenticator and import them into your new service. Just remember to set your chosen app as the default autofill provider on your mobile device to keep logins working smoothly.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "AT&T rolls out \"Wireless Lock\" feature to block SIM swap attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/atandt-rolls-out-wireless-lock-feature-to-block-sim-swap-attacks/",
        "Summary": "AT&amp;T has launched a new security feature called \"Wireless Lock\" that protects customers from SIM swapping attacks by preventing changes to their account information and the porting of phone numbers while the feature is enabled. [...]",
        "Date": "2025-07-01",
        "Content": "AT&T has launched a new security feature called \"Wireless Lock\" that protects customers from SIM swapping attacks by preventing changes to their account information and the porting of phone numbers while the feature is enabled.\nThis new feature has been available for some customers for almost a year and has now been rolled out to all AT&T customers.\nSIM swap attacks are when cybercriminals port, or move, a targeted phone number to a device under their control. This allows them to intercept the target's calls, texts, and multi-factor authentication codes to breach further accounts, such as email, banking, and cryptocurrency wallets.\nIn some cases, threat actors conduct SIM swap attacks by tricking or bribing telecom employees into transferring numbers from customers' SIM cards to a new device.\nWith the\nnew AT&T feature\n, customers can log in to the company's mobile app or website to \"lock\" their number, preventing anyone, including AT&T employees, from porting the number to a new SIM card or transferring it to another provider unless the setting is first disabled.\nThe feature also protects other types of information, such as changing billing information, authorized users, and changing phone numbers. Business accounts receive additional features, including the ability to exempt certain lines from the lock or restrict specific account changes when enabled.\nWireless Lock features by account type\nSource: AT&T\nWhile it is good to see that AT&T has finally released this feature, it comes late, as other carriers,\nsuch as Verizon\n, have had it for almost 5 years.\nSIM swap attacks have been linked to numerous security incidents over the past five years.\nIn 2020, Joseph James O'Connor, aka 'PlugwalkJoke,' pleaded guilty to conducting SIM swap attacks that resulted in the theft of $794,000 in cryptocurrency.\nIn 2021,\nT-Mobile warned some customers\nthat attackers conducted SIM swap attacks to compromise other accounts they owned. In 2023, hackers exploited a\ndata breach at Google Fi\nto carry out SIM swaps.\nThreat actors, like those associated with\nScattered Spider\n, have been\ncharged in the U.S. for using SIM swaps\nto infiltrate corporate networks.\nOther recent attacks include\neSIM hijacking campaigns\nwhere criminals activated electronic SIMs in victims' names to seize control of numbers.\nHowever, it is not always third-party hackers who conduct the SIM swap attacks.\nLast year, Verizon and T-Mobile employees began receiving texts on their personal and work phones, trying to\nbribe them with $300 to perform SIM swaps\n.\nIn 2023, the\nFCC adopted new rules\nto require stricter identity verification during SIM swaps and number transfers.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nOld AT&T data leak repackaged to link SSNs, DOBs to 49M phone numbers\nSK Telecom says malware breach lasted 3 years, impacted 27 million numbers\nMobile carrier Cellcom confirms cyberattack behind extended outages"
    },
    {
        "Title": "Microsoft open-sources VS Code Copilot Chat extension on GitHub",
        "Link": "https://www.bleepingcomputer.com/news/security/microsoft-open-sources-vs-code-copilot-chat-extension-on-github/",
        "Summary": "Microsoft has released the source code for the GitHub Copilot Chat extension for VS Code under the MIT license. [...]",
        "Date": "2025-07-01",
        "Content": "Microsoft has released the source code for the GitHub Copilot Chat extension for VS Code under the MIT license.\nThis provides the community access to the full implementation of the chat-based coding assistant, including the implementation of “agent mode,” what contextual data is sent to large language models (LLMs), and the design of system prompts.\nThe GitHub\nrepository hosting the code\nalso details telemetry collection mechanisms, addressing long-standing questions about data transparency in AI-assisted coding tools.\nThe move is considered as the\nfirst milestone\nin the tech giant’s plan to integrate AI features directly into the popular open-source code editor, a roadmap that was first outlined in May 2025.\nVisual Studio Code, launched in 2015, is one of the most widely used code editors globally and a flagship open-source project from Microsoft. It is built on the Electron framework and supports a wide range of programming languages and extensions.\nGitHub Copilot Chat is an AI assistant extension for VS Code, allowing developers to chat with a GPT4-based model inside the editor to get help with coding tasks.\nGiven the meteoric rise of LLM-assisted coding and trends like “vibe coding,” the extension has reached high levels of popularity with more than\n35 million installations\non the VSCode Marketplace.\nThe Copilot Chat Extension active on the VS Code IDE\nSource: GitHub\nAs the VS Code team\nexplained previously\n, shifts in AI tooling landscape like the rapid growth of the open-source AI ecosystem and a more level playing field for all have reduced the need for secrecy around prompt engineering and UI design.\nAt the same time, increased targeting of development tools by malicious actors has increased the need for crowdsourcing contributions to rapidly pinpoint problems and develop effective fixes. Essentially, openness is now considered superior from a security perspective.\nIt is important to note that the code for the original GitHub Copilot extension that powers inline code completions remains closed for now. However, Microsoft confirmed plans to transition its functionality into the open Copilot Chat extension over the coming months, consolidating all major AI features into a single open-source module.\nWith the Copilot Chat extension now publicly available on GitHub, developers are invited to explore the code, contribute, and provide their feedback. Also available is a\nFAQ\nand complete documentation to guide developers through the architecture and development process.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nGoogle Cloud donates A2A AI protocol to the Linux Foundation\nOpenAI confirms threat actors use ChatGPT to write malware\nZero-click AI data leak flaw uncovered in Microsoft 365 Copilot\nGoogle rolls out text-to-image model Imagen 4 for free\nClaude catches up to ChatGPT with built-in memory support"
    },
    {
        "Title": "Kelly Benefits says 2024 data breach impacts 550,000 customers",
        "Link": "https://www.bleepingcomputer.com/news/security/kelly-benefits-says-2024-data-breach-impacts-550-000-customers/",
        "Summary": "Kelly & Associates Insurance Group (dba Kelly Benefits) is informing more than half a million people of a data breach that compromised their personal information. [...]",
        "Date": "2025-07-01",
        "Content": "Kelly & Associates Insurance Group (dba Kelly Benefits) is informing more than half a million people of a data breach that compromised their personal information.\nThe Maryland-based health and life insurance agency has issued an update on a security incident it suffered last year between December 12-17, when unauthorized actors breached its IT systems and stole files.\nOn April 9, 2025, the company\nstated\nthat the incident impacted 32,234 individuals. The figure was revised multiple times until the final tally shared with\nauthorities in the U.S.\ncounted 553,660 individuals.\nKelly Benefits is a provider of benefits consulting, enrollment technology, payroll administration, HRIS, compliance support, and carrier management.\nAs multiple organizations across the country contract the firm's services, determining the scope of the data breach and the exact number of impacted people was  a complicated task.\nThe organization’s latest update lists a total of 46 entities impacted by the data breach, including healthcare giants like:\nUnited Healthcare\nAetna Life Insurance Company (CVS Health)\nCareFirst BlueCross BlueShield\nHumana Insurance ACE\nThe Guardian Life Insurance Company of America\nMutual of Omaha Insurance Company\nOneAmerica Financial Partners, Inc.\nThe\ndata breach notice\nsent to impacted individuals yesterday informs recipients of the specific data types impacted by the breach, which vary per person.\nHowever, the\ngeneral notice published on the site\nsays that the compromised info may contain full names, Social Security number, tax ID number, date of birth, medical information, health insurance information, and financial account information.\nExposure of this information puts people at risk, as they can become victims of phishing attacks, social engineering, and scams. Impacted individuals are advised to exercise increased vigilance against unsolicited communications.\nTo mitigate the risk, Kelly Benefits offers all letter recipients 12-month free of charge credit monitoring and identity theft protection services through IDX identity theft protection.\nPotentially impacted individuals are also advised to consider placing a security freeze on their credit report and closely monitor their accounts for suspicious activity.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nHealthcare SaaS firm says data breach impacts 5.4 million patients\nEsse Health says recent data breach affects over 263,000 patients\nMcLaren Health Care says data breach impacts 743,000 patients\nSensata Technologies says personal data stolen by ransomware gang\nAscension says recent data breach affects over 430,000 patients"
    },
    {
        "Title": "Aeza Group sanctioned for hosting ransomware, infostealer servers",
        "Link": "https://www.bleepingcomputer.com/news/security/aeza-group-sanctioned-for-hosting-ransomware-infostealer-servers/",
        "Summary": "The U.S. Department of the Treasury has sanctioned Russian hosting company Aeza Group and four operators for allegedly acting as a bulletproof hosting company for ransomware gangs, infostealer operations, darknet drug markets, and Russian disinformation campaigns. [...]",
        "Date": "2025-07-01",
        "Content": "The U.S. Department of the Treasury has sanctioned Russian hosting company Aeza Group and four operators for allegedly acting as a bulletproof hosting company for ransomware gangs, infostealer operations, darknet drug markets, and Russian disinformation campaigns.\nThe Treasury's Office of Foreign Assets Control (OFAC) claims that Aeza's services were utilized by the BianLian ransomware gang, for RedLine infostealer panels, and by BlackSprut, a Russian darknet marketplace that sold drugs to individuals in the United States and worldwide.\nA bulletproof hosting service (BPH) is a company that deliberately ignores abuse complaints and law enforcement takedown requests, providing a safe environment for cybercriminals to host malware and conduct attacks.\nAeza was\npreviously linked\nto a Russian disinformation campaign known as \"\nDoppelgänger\n,\" which cloned legitimate European and U.S. media sites to distribute propaganda targeting Western audiences.\nOFAC has\nalso sanctioned\nfour individuals who the U.S. says are the primary operators of the Aeza Group:\nArsenii Aleksandrovich Penzev\n(Penzev) is the CEO and 33% owner of Aeza Group.\nYurii Meruzhanovich Bozoyan\n(Bozoyan) is the general director and 33% owner of Aeza Group.\nVladimir Vyacheslavovich Gast\n(Gast) serves as the technical director for Aeza Group and collaborates closely with Penzev and Bozoyan.\nIgor Anatolyevich Knyazev\n(Knyazev) is the 33% owner of Aeza Group and manages the company in the absence of Penzev and Bozoyan.\nAll four individuals and related companies, Aeza International Ltd., Aeza Logistic LLC, and Cloud Solutions LLC, will now have their assets frozen in the U.S., and U.S. companies are prohibited from doing business with them or the Aeza Group.\nRussian media\npreviously reported\nthat Bozoyan, Penzev, and other staff members were arrested in April for \"illegal banking activities as part of an organized criminal group\" and the hosting of the BlackSprut drugs marketplace.\nThe Treasury Department states that these sanctions build upon the agency's previous action in February, which\nsanctioned the ZServers\nand\nXhost bulletproof hosting providers\nused by the LockBit ransomware gang and other cybercriminals.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nEuropean Union sanctions Stark Industries for enabling cyberattacks\nRussia’s throttling of Cloudflare makes sites inaccessible\nAPT28 hackers use Signal chats to launch new malware attacks on Ukraine\nRevil ransomware members released after time served on carding charges\nRussian hackers bypass Gmail MFA using stolen app passwords"
    },
    {
        "Title": "New FileFix attack runs JScript while bypassing Windows MoTW alerts",
        "Link": "https://www.bleepingcomputer.com/news/security/new-filefix-attack-runs-jscript-while-bypassing-windows-motw-alerts/",
        "Summary": "A new FileFix attack allows executing malicious scripts while bypassing the Mark of the Web (MoTW) protection in Windows by exploiting how browsers handle saved HTML webpages. [...]",
        "Date": "2025-07-01",
        "Content": "A new FileFix attack allows executing malicious scripts while bypassing the Mark of the Web (MoTW) protection in Windows by exploiting how browsers handle saved HTML webpages.\nThe technique, was devised by security researcher mr.d0x Last week, the researcher showed how the\nfirst FileFix method\nworked as an alternative to 'ClickFix' attacks by tricking users into pasting a disguised PowerShell command into the File Explorer address bar.\nThe attack involves a phishing page to trick the victim into copying a malicious PowerShell command. Once they past it into File Explorer, Windows executes the PowerShell, making it a very subtle attack.\nWith the\nnew FileFix attack\n, an attacker would use social engineering to trick the user into saving an HTML page (using Ctrl+S) and renaming it to .HTA, which auto-executes embedded JScript via mshta.exe.\nHTML Applications (.HTA) are considered legacy technology. This Windows file type can be used to execute HTML and scripting content using the legitimate mshta.exe in the context of the current user.\nThe researcher found that when HTML files are saved as \"Webpage, Complete\" (with MIME type text/html), they do not receive the MoTW tag, allowing script execution without warnings for the user.\nWhen the victim opens the .HTA file, the embedded malicious script runs immediately without any warning.\nThe highest-friction part of the attack is the social engineering step, where victims need to be tricked into saving a webpage and renaming it.\nOne way around this is by designing a more effective bait, such as malicious website prompting users to save multi-factor authentication (MFA) codes to maintain future access to a service.\nThe page would instruct the user to press Ctrl+S (Save As), choose \"Webpage, Complete,\" and save the file as 'MfaBackupCodes2025.hta.'\nExample of the malicious page\nSource: mr.d0x\nAlthough this require more interaction, if the malicious webpage looks genuine and the user doesn't have a deep understanding of file extensions and security warnings, they could still fall for it.\nAn effective defense strategy against this variant of the FileFix attack is to disable or remove the 'mshta.exe' binary from your environment (found in C:\\Windows\\System32 and C:\\Windows\\SysWOW64).\nAdditionally, consider enabling file extension visibility on Windows and blocking HTML attachments on email.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nInternational Criminal Court hit by new 'sophisticated' cyberattack\nJohnson Controls starts notifying people affected by 2023 breach\nU.S. warns of Iranian cyber threats on critical infrastructure\nWhole Foods supplier UNFI restores core systems after cyberattack\nHawaiian Airlines discloses cyberattack, flights not affected"
    },
    {
        "Title": "International Criminal Court hit by new 'sophisticated' cyberattack",
        "Link": "https://www.bleepingcomputer.com/news/security/international-criminal-court-hit-by-new-sophisticated-cyberattack/",
        "Summary": "On Monday, the International Criminal Court (ICC) announced that it's investigating a new \"sophisticated\" cyberattack that targeted its systems last week. [...]",
        "Date": "2025-07-01",
        "Content": "On Monday, the International Criminal Court (ICC) announced that it's investigating a new \"sophisticated\" cyberattack that targeted its systems last week.\nIn a statement yesterday, the ICC revealed that it had contained a \"sophisticated and targeted\" cybersecurity incident, which was discovered by systems in place to detect cyberattacks targeting its systems.\n\"This incident, the second of this type against the ICC in recent years, was swiftly discovered, confirmed and contained, through the Court's alert and response mechanisms. A Court-wide impact analysis is being carried out, and steps are already being taken to mitigate any effects of the incident,\"\nthe ICC said\n.\n\"The Court considers it essential to inform the public and its States Parties about such incidents as well as efforts to address them, and calls for continued support in the face of such challenges.\"\nAt the moment, the ICC has yet to provide more information regarding the nature of the cyberattack, its impact on the ICC's systems, or whether the attackers were able to access or exfiltrate any data or files.\n​When asked to provide additional details regarding this incident, spokesperson Fadi El-Adballah told BleepingComputer that the ICC cannot provide further details or information beyond what had been shared in the Monday press release.\nSeptember 2023 cybersecurity incident\nThis is the second cyberattack targeting the ICC in recent years, following the disclosure of\nanother cybersecurity incident\nin September 2023.\nRoughly one month later, the ICC shared more information about the September 2023 incident, stating that its systems\nhad been breached for the purpose of cyber espionage\n.\n\"The evidence available thus far indicates a targeted and sophisticated attack with the objective of espionage. The attack can therefore be interpreted as a serious attempt to undermine the Court's mandate,\" the international tribunal said.\nThe court found no evidence linking the 2023 breach to a specific espionage group, and the impact of the attack remains unclear, with no indication that data entrusted to the ICC was compromised.\nThe ICC also added at the time that the attack came at a moment of \"broader and heightened security concerns for the Court,\" including \"daily and persistent attempts to attack and disrupt its systems\" and an \"almost successful attempt to infiltrate a hostile intelligence officer into the Court under the guise of an intern.\"\nEstablished in 2002, the ICC is an international tribunal based in The Hague, Netherlands, that investigates and prosecutes serious crimes that affect the international community, such as war crimes, genocide, and crimes against humanity.\nFor example, in March 2023, it\nissued an arrest warrant\nfor Russian President Vladimir Putin related to crimes associated with Russia's invasion of Ukraine, and\nanother one\nin November for Israeli Prime Minister Benjamin Netanyahu for alleged war crimes during the Palestine conflict.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nNew FileFix attack runs JScript while bypassing Windows MoTW alerts\nJohnson Controls starts notifying people affected by 2023 breach\nU.S. warns of Iranian cyber threats on critical infrastructure\nWhole Foods supplier UNFI restores core systems after cyberattack\nHawaiian Airlines discloses cyberattack, flights not affected"
    },
    {
        "Title": "US disrupts North Korean IT worker \"laptop farm\" scheme in 16 states",
        "Link": "https://www.bleepingcomputer.com/news/security/us-disrupts-north-korean-it-worker-laptop-farm-scheme-in-16-states/",
        "Summary": "The U.S. Department of Justice (DoJ) announced coordinated law enforcement actions against North Korean government's fund raising operations using remote IT workers. [...]",
        "Date": "2025-07-01",
        "Content": "The U.S. Department of Justice (DoJ) announced coordinated law enforcement actions against North Korean government's fund raising operations using remote IT workers.\nNorth Korean workers use stolen or fake identities created with the help of AI tools to get hired by more than 100 companies in the U.S., believing they employed experts from other Asian countries or the U.S. Their salaries are usually sent to the DPRK regime.\nAccording to court documents, two individuals, Kejia Wang and Zhenxing “Danny” Wang, compromised the identities of more than 80 U.S. citizens to help North Korean workers obtain remote jobs at U.S. companies.\nThe two created multiple shell companies (e.g. Hopana Tech LLC, Tony WKJ LLC, Independent Lab LLC), financial accounts, and fake websites to make it look like the workers were affiliated with legitimate U.S. businesses.\n“Danny” Wang, who has been arrested, also hosted company-issued laptops in U.S. homes, connected to KVM switches, and provided remote access to remote DPRK workers.\nIt is estimated that the particular operation generated more than $5 million in illicit revenue, while U.S. companies incurred an estimated $3 million in financial damages.\nIn addition to the monetary losses, the DoJ also mentions that sensitive data, including U.S. military tech regulated under ITAR, was accessed and exfiltrated by the North Koreans.\nThe\nlaw enforcement operation\n, part of the broader “DPRK RevGen: Domestic Enabler Initiative,” ran from October 2024 until June 2025.\nIt resulted in multiple searchers at 29 suspected “laptop farms” across 16 states. The authorities also seized 29 financial accounts, 21 fake websites supporting the IT workers, and two hundred computers they used in their work.\nIn addition to the Wangs acting as U.S.-based facilitators, the following individuals have been indicted for their involvement in IT worker schemes:\nJing Bin Huang (Chinese national)\nBaoyu Zhou (Chinese national)\nTong Yuze (Chinese national)\nYongzhe Xu Chinese national)\nZiyou Yuan (Chinese national)\nZhenbang Zhou (Chinese national)\nMengting Liu (Taiwanese national)\nEnchia Liu (Taiwanese national)\nAuthorities also\nidentified four North Korean nationals\n- Kim Kwang Jin, Kang Tae Bok, Jong Pong Ju (aka ‘Bryan Cho’) and Chang Nam Il (aka ‘Peter Xiao’), who were charged with wire fraud and money laundering for working remotely at U.S. companies under false identities.\nKim Kwang Jin is highlighted as a central figure, who worked at an Atlanta-based blockchain research and development firm since December 2020.\nIn March 2022, he took advantage of his position to modify the source code in two of his employer’s smart contracts, enabling the theft of cryptocurrency worth approximately $740,000 at the time, subsequently laundered through mixers like Tornado Cash.\nThese four North Koreans remain at large, and the ‘Rewards for Justice’ program has\nannounced $5,000,0000 in rewards\nfor credible information about their current location.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nEuropol helps disrupt $540 million crypto investment fraud ring\nBitoPro exchange links Lazarus hackers to $11 million crypto heist\nRyuk ransomware’s initial access expert extradited to the U.S.\nNorth Korean hackers deepfake execs in Zoom call to spread Mac malware\nOperation Secure disrupts global infostealer malware operations"
    },
    {
        "Title": "Esse Health says recent data breach affects over 263,000 patients",
        "Link": "https://www.bleepingcomputer.com/news/security/esse-health-says-recent-data-breach-affects-over-263-000-patients/",
        "Summary": "Esse Health, a healthcare provider based in St. Louis, Missouri, is notifying over 263,000 patients that their personal and health information was stolen in an April cyberattack. [...]",
        "Date": "2025-07-01",
        "Content": "Esse Health, a healthcare provider based in St. Louis, Missouri, is notifying over 263,000 patients that their personal and health information was stolen in an April cyberattack.\nAs the largest independent physicians' group in the Greater St. Louis area, Esse Health operates 50 locations and employs over 100 physicians.\nThe organization was made aware of a breach after the attackers took down some primary patient-facing network systems and its phone systems on April 21.\nImpacted systems were brought back online until June 2, when Esse Health\nupdated a notification\non its website to inform patients they could again reach out via all regular channels, including text messages, phone calls, and the patient portal.\n\"Based on the investigation, a cybercriminal gained access to our network on April 21, 2025. While in our network, the cybercriminal was able to view and copy certain files,\" Esse Health privacy officer Jaime L. Bremerkamp\nsays\nin breach notification letters sent to 263,601 affected individuals.\n\"As part of our investigation, we conducted a time-intensive review of the files involved to determine the types of data present and to whom it related. This review identified that information related to you may have been contained in those files.\"\nAccording to a\nfiling\nwith Maine's Attorney General on Monday, the attackers stole a wide range of sensitive data for each impacted patient, including personal information (e.g., name, address, date of birth), health insurance information, medical record number, patient account number, and some health information.\nEsse Health also stated that it found no evidence of stolen social security numbers and confirmed that its NextGen electronic medical record system was not breached.\nThose affected are advised to review their account statements and monitor their credit reports for suspicious activity that may be linked to identity theft and fraud attempts. Esse Health also provides them with free identity protection services through data breach and recovery services provider IDX if they enroll by September 25, 2025.\nWhile Esse Health has yet to reveal the nature of the attack, restoration efforts spanning multiple months suggest a ransomware attack, where some of its systems were encrypted after the threat actors stole documents containing patients' data. However, no ransomware operation has claimed responsibility for the breach since April.\nAn Esse Health spokesperson was not immediately available for comment when BleepingComputer reached out for more details earlier today.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nKelly Benefits says 2024 data breach impacts 550,000 customers\nHealthcare SaaS firm says data breach impacts 5.4 million patients\nAscension says recent data breach affects over 430,000 patients\nAscension discloses new data breach after third-party hacking incident\nJohnson Controls starts notifying people affected by 2023 breach"
    },
    {
        "Title": "Johnson Controls starts notifying people affected by 2023 breach",
        "Link": "https://www.bleepingcomputer.com/news/security/johnson-controls-starts-notifying-people-affected-by-2023-breach/",
        "Summary": "Building automation giant Johnson Controls is notifying individuals whose data was stolen in a massive ransomware attack that impacted the company's operations worldwide in September 2023. [...]",
        "Date": "2025-07-01",
        "Content": "Building automation giant Johnson Controls is notifying individuals whose data was stolen in a massive ransomware attack that impacted the company's operations worldwide in September 2023.\nJohnson Controls is a multinational conglomerate that develops and manufactures industrial control systems, security equipment, HVAC systems, and fire safety equipment for buildings. The company employs over 100,000 people through its corporate operations and subsidiaries across 150 countries, reporting sales of $27.4 billion in 2024.\nAs BleepingComputer first reported,\nJohnson Controls was hit by a ransomware attack\nin September 2023, following a breach of the company's Asian offices in February 2023 and subsequent lateral movement through its network.\n\"Based on our investigation, we determined that an unauthorized actor accessed certain Johnson Controls systems from February 1, 2023 to September 30, 2023 and took information from those systems,\" the company\nsays\nin data breach notification letters filed with California's Attorney General, redacted to conceal what information was stolen in the attack.\n\"After becoming aware of the incident, we terminated the unauthorized actor's access to the affected systems. In addition, we engaged third-party cybersecurity specialists to further investigate and resolve the incident. We also notified law enforcement and publicly disclosed the incident in filings on September 27, 2023; November 13, 2023; and December 14, 2023.\"\nThe cyberattack forced Johnson Controls to shut down large portions of its IT infrastructure after the threat actors encrypted many devices, which affected its operations worldwide and customer-facing systems.\nJohnson Controls confirmed in a January 2024 SEC filing that the cyberattack was orchestrated by a ransomware gang that also stole documents from compromised systems during the breach.\nWhile the firm didn't attribute the incident to a specific ransomware operation, the attack was linked to the Dark Angels ransomware group based on a sample of a VMware ESXi encryptor deployed during the breach, which stated that it was used against Johnson Controls.\nDark Angels ransom note (BleepingComputer)\n​BleepingComputer was also told that the ransom note linked to a negotiation chat where the ransomware gang demanded $51 million for a decryptor and to delete data stolen from Johnson Controls' network.\nThe ransomware operators also encrypted the company's VMware ESXi virtual machines during the attack and claimed to have stolen over 27 TB of documents containing corporate data.\nAt the time, the company stated that expenses related to incident response and remediation\nhad already reached $27 million\n, but also noted that it expected this amount to increase as the investigation and remediation efforts progressed.\nDark Angels\n, the ransomware operation behind Johnson Controls' 2023 breach, surfaced in May 2022 when it began targeting organizations worldwide in double-extortion attacks. In these attacks, the group steals sensitive data and uses it to pressure victims under the threat of publishing it online on its dark web leak site, called Dunghill Leaks.\nThey also deploy ransomware to encrypt all devices on the network after gaining access to the Windows domain controller, using Windows and VMware ESXi encryptors based on leaked Babuk ransomware source code.\nHowever, cybersecurity researcher MalwareHunterTeam told BleepingComputer that the Linux encryptor used in the Johnson Controls attack was the same as others used by Ragnar Locker ransomware since 2021.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nKrispy Kreme says November data breach impacts over 160,000 people\nKettering Health confirms Interlock ransomware behind cyberattack\nU.S. warns of Iranian cyber threats on critical infrastructure\nSwitzerland says government data stolen in ransomware attack\nRetail giant Ahold Delhaize says data breach affects 2.2 million people"
    },
    {
        "Title": "Google fixes fourth actively exploited Chrome zero-day of 2025",
        "Link": "https://www.bleepingcomputer.com/news/security/google-fixes-fourth-actively-exploited-chrome-zero-day-of-2025/",
        "Summary": "Google has released emergency updates to patch another Chrome zero-day vulnerability exploited in attacks, marking the fourth such flaw fixed since the start of the year. [...]",
        "Date": "2025-07-01",
        "Content": "Google has released emergency updates to patch another Chrome zero-day vulnerability exploited in attacks, marking the fourth such flaw fixed since the start of the year.\n\"Google is aware that an exploit for CVE-2025-6554 exists in the wild,\" the browser vendor said in a\nsecurity advisory\nissued on Monday. \"This issue was mitigated on 2025-06-26 by a configuration change pushed out to Stable channel across all platforms.\"\nThe company fixed the zero-day for users in the Stable Desktop channel, with new versions rolling out worldwide to Windows (138.0.7204.96/.97), Mac (138.0.7204.92/.93), and Linux users (138.0.7204.96) one day after the issue was reported to Google.\n​​​The bug was discovered by Clément Lecigne of Google's Threat Analysis Group (TAG), a collective of security researchers focused on defending Google customers from state-sponsored and other similar attacks.\nGoogle TAG frequently discovers zero-day exploits deployed by government-sponsored threat actors in targeted attacks to infect high-risk individuals, including opposition politicians, dissidents, and journalists, with spyware.\nAlthough the security updates patching CVE-2025-6554 could take days or weeks to reach all users, according to Google, they were immediately available when BleepingComputer checked for updates earlier today.\nUsers who prefer not to update manually can also rely on their web browser to automatically check for new updates and install them after the next launch.\nThe zero-day bug fixed today is a high-severity\ntype confusion\nweakness in the Chrome V8 JavaScript engine. While such flaws generally lead to browser crashes after successful exploitation by reading or writing memory out of buffer bounds, attackers can also exploit them to execute arbitrary code on unpatched devices.\nEven though Google stated that this vulnerability was exploited in the wild, the company has yet to share technical details or additional information regarding these attacks.\n\"Access to bug details and links may be kept restricted until a majority of users are updated with a fix. We will also retain restrictions if the bug exists in a third party library that other projects similarly depend on, but haven't yet fixed,\" Google said.\nThis is the fourth actively exploited Google Chrome zero-day fixed since the start of the year, with three more patched in March, May, and June.\nThe first, a high-severity sandbox escape flaw (CVE-2025-2783) reported by Kaspersky's Boris Larin and Igor Kuznetsov,\nwas used in espionage attacks\ntargeting Russian government organizations and media outlets with malware.\nGoogle released another set of emergency security updates in May to address a Chrome zero-day (CVE-2025-4664) that can allow attackers\nto hijack accounts\n. One month later, the company\naddressed an out-of-bounds read and write weakness\nin Chrome's V8 JavaScript engine discovered by Google TAG's Benoît Sevens and Clément Lecigne.\nIn 2024,\nGoogle patched a total of 10 zero-day vulnerabilities\nthat were either exploited in attacks or demoed during Pwn2Own hacking competitions.\n8 Common Threats in 2025\nWhile cloud attacks may be growing more sophisticated, attackers still succeed with surprisingly simple techniques.\nDrawing from Wiz's detections across thousands of organizations, this report reveals 8 key techniques used by cloud-fluent threat actors.\nGet the Report\nRelated Articles:\nGoogle patches new Chrome zero-day bug exploited in attacks\nCISA tags recently patched Chrome bug as actively exploited\nGoogle fixes Android zero-day exploited by Serbian authorities\nGoogle tags a tenth Chrome zero-day as exploited this year\nHackers exploited Windows WebDav zero-day to drop malware"
    },
    {
        "Title": "Like SEO, LLMs May Soon Fall Prey to Phishing Scams",
        "Link": "https://www.darkreading.com/cyber-risk/seo-llms-fall-prey-phishing-scams",
        "Summary": "Just as attackers have used SEO techniques to poison search engine results, they could rinse and repeat with artificial intelligence and the responses LLMs generate from user prompts.",
        "Date": "2025-07-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/seo-llms-fall-prey-phishing-scams"
    },
    {
        "Title": "LevelBlue Acquires Trustwave, Forms World's Largest Independent MSSP",
        "Link": "https://www.darkreading.com/cybersecurity-operations/levelblue-trustwave-forms-largest-independent-mssp",
        "Summary": "As the largest managed security services provider, the combined entity will offer cyber consulting, managed detection and response, and incident response services.",
        "Date": "2025-07-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/levelblue-trustwave-forms-largest-independent-mssp"
    },
    {
        "Title": "Scope, Scale of Spurious North Korean IT Workers Emerges",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/scope-scale-spurious-north-korean-it-workers",
        "Summary": "Microsoft warns thousands of North Korean workers have infiltrated tech, manufacturing, and transportation sectors to steal money and data.",
        "Date": "2025-07-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/scope-scale-spurious-north-korean-it-workers"
    },
    {
        "Title": "Ransomware Reshaped How Cyber Insurers Perform Security Assessments",
        "Link": "https://www.darkreading.com/cybersecurity-operations/ransomware-reshaped-how-cyber-insurers-perform-security-assessments",
        "Summary": "Cyber insurance companies were forced to adapt once ransomware skyrocketed and highlighted crucial security weaknesses among organizations in all sectors.",
        "Date": "2025-07-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/ransomware-reshaped-how-cyber-insurers-perform-security-assessments"
    },
    {
        "Title": "We've All Been Wrong: Phishing Training Doesn't Work",
        "Link": "https://www.darkreading.com/endpoint-security/phishing-training-doesnt-work",
        "Summary": "Teaching employees to detect malicious emails isn't really having an impact. What other options do organizations have?",
        "Date": "2025-07-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/phishing-training-doesnt-work"
    },
    {
        "Title": "DoJ Disrupts North Korean IT Worker Scheme Across Multiple US States",
        "Link": "https://www.darkreading.com/threat-intelligence/doj-disrupts-north-korean-it-worker-scheme",
        "Summary": "The US also conducted searches of 29 &quot;laptop farms&quot; across 16 states and seized 29 financial accounts used to launder funds.",
        "Date": "2025-07-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/doj-disrupts-north-korean-it-worker-scheme"
    },
    {
        "Title": "Chrome Zero-Day, 'FoxyWallet' Firefox Attacks Threaten Browsers",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/browsers-targeted-chrome-zero-day-malicious-firefox-extensions",
        "Summary": "Separate threats to popular browsers highlight the growing security risk for enterprises presented by the original gateway to the Web, which remains an integral tool for corporate users.",
        "Date": "2025-07-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/browsers-targeted-chrome-zero-day-malicious-firefox-extensions"
    },
    {
        "Title": "How Businesses Can Align Cyber Defenses With Real Threats",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/how-businesses-can-align-cyber-defenses-real-threats",
        "Summary": "Companies that understand the motivations of their attackers and position themselves ahead of the competition will be in the best place to protect their business operations, brand reputation, and their bottom line.",
        "Date": "2025-07-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/how-businesses-can-align-cyber-defenses-real-threats"
    },
    {
        "Title": "Critical Microsens Product Flaws Allow Hackers to Go ‘From Zero to Hero’",
        "Link": "https://www.securityweek.com/critical-microsens-product-flaws-allow-hackers-to-go-from-zero-to-hero/",
        "Summary": "<p>CISA has informed organizations about critical authentication bypass and remote code execution vulnerabilities in Microsens NMP Web+.</p>\n<p>The post <a href=\"https://www.securityweek.com/critical-microsens-product-flaws-allow-hackers-to-go-from-zero-to-hero/\">Critical Microsens Product Flaws Allow Hackers to Go &#8216;From Zero to Hero&#8217;</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/critical-microsens-product-flaws-allow-hackers-to-go-from-zero-to-hero/"
    },
    {
        "Title": "LevelBlue to Acquire Trustwave to Create Major MSSP",
        "Link": "https://www.securityweek.com/levelblue-to-acquire-trustwave-to-create-largest-mssp/",
        "Summary": "<p>LevelBlue has announced plans to acquire Trustwave to create the largest pure-play managed security services provider (MSSP).</p>\n<p>The post <a href=\"https://www.securityweek.com/levelblue-to-acquire-trustwave-to-create-largest-mssp/\">LevelBlue to Acquire Trustwave to Create Major MSSP</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/levelblue-to-acquire-trustwave-to-create-largest-mssp/"
    },
    {
        "Title": "Cloudflare Puts a Default Block on AI Web Scraping",
        "Link": "https://www.securityweek.com/cloudflare-puts-a-default-block-on-ai-web-scraping/",
        "Summary": "<p>The move could reshape how LLM developers gather information — and force new deals between creators and AI companies.</p>\n<p>The post <a href=\"https://www.securityweek.com/cloudflare-puts-a-default-block-on-ai-web-scraping/\">Cloudflare Puts a Default Block on AI Web Scraping</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cloudflare-puts-a-default-block-on-ai-web-scraping/"
    },
    {
        "Title": "263,000 Impacted by Esse Health Data Breach",
        "Link": "https://www.securityweek.com/263000-impacted-by-esse-health-data-breach/",
        "Summary": "<p>Esse Health says the personal information of over 263,000 individuals was stolen in an April 2025 cyberattack.</p>\n<p>The post <a href=\"https://www.securityweek.com/263000-impacted-by-esse-health-data-breach/\">263,000 Impacted by Esse Health Data Breach</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/263000-impacted-by-esse-health-data-breach/"
    },
    {
        "Title": "Thousands of Citrix NetScaler Instances Unpatched Against Exploited Vulnerabilities",
        "Link": "https://www.securityweek.com/thousands-of-citrix-netscaler-instances-unpatched-against-exploited-vulnerabilities/",
        "Summary": "<p>Many Citrix NetScaler systems are exposed to attacks exploiting the vulnerabilities tracked as CVE-2025-5777 and CVE-2025-6543.</p>\n<p>The post <a href=\"https://www.securityweek.com/thousands-of-citrix-netscaler-instances-unpatched-against-exploited-vulnerabilities/\">Thousands of Citrix NetScaler Instances Unpatched Against Exploited Vulnerabilities</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/thousands-of-citrix-netscaler-instances-unpatched-against-exploited-vulnerabilities/"
    },
    {
        "Title": "Iranian Hackers’ Preferred ICS Targets Left Open Amid Fresh US Attack Warning",
        "Link": "https://www.securityweek.com/iranian-hackers-preferred-ics-targets-left-open-amid-fresh-us-attack-warning/",
        "Summary": "<p>The US government is again warning about potential Iranian cyberattacks as researchers find that hackers’ favorite ICS targets remain exposed.</p>\n<p>The post <a href=\"https://www.securityweek.com/iranian-hackers-preferred-ics-targets-left-open-amid-fresh-us-attack-warning/\">Iranian Hackers&#8217; Preferred ICS Targets Left Open Amid Fresh US Attack Warning</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/iranian-hackers-preferred-ics-targets-left-open-amid-fresh-us-attack-warning/"
    },
    {
        "Title": "US Storms 29 Laptop Farms in Crackdown on North Korean IT Worker Schemes",
        "Link": "https://www.securityweek.com/us-storms-29-laptop-farms-in-crackdown-on-north-korean-it-worker-schemes/",
        "Summary": "<p>The US has made 29 searches of known or suspected laptop farms supporting North Korean individuals posing as US IT workers.</p>\n<p>The post <a href=\"https://www.securityweek.com/us-storms-29-laptop-farms-in-crackdown-on-north-korean-it-worker-schemes/\">US Storms 29 Laptop Farms in Crackdown on North Korean IT Worker Schemes</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/us-storms-29-laptop-farms-in-crackdown-on-north-korean-it-worker-schemes/"
    },
    {
        "Title": "Chrome 138 Update Patches Zero-Day Vulnerability",
        "Link": "https://www.securityweek.com/chrome-138-update-patches-zero-day-vulnerability/",
        "Summary": "<p>Google has released a Chrome 138 update that patches a high-severity vulnerability with an exploit in the wild.</p>\n<p>The post <a href=\"https://www.securityweek.com/chrome-138-update-patches-zero-day-vulnerability/\">Chrome 138 Update Patches Zero-Day Vulnerability</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chrome-138-update-patches-zero-day-vulnerability/"
    }
]