[
    {
        "Title": "Iran-Linked DCHSpy Android Malware Masquerades as VPN Apps to Spy on Dissidents",
        "Link": "https://thehackernews.com/2025/07/iran-linked-dchspy-android-malware.html",
        "Summary": "Cybersecurity researchers have unearthed new Android spyware artifacts that are likely affiliated with the Iranian Ministry of Intelligence and Security (MOIS) and have been distributed to targets by masquerading as VPN apps and Starlink, a satellite internet connection service offered by SpaceX.\nMobile security vendor Lookout said it discovered four samples of a surveillanceware tool it tracks",
        "Date": "2025-07-21",
        "Content": "Cybersecurity researchers have unearthed new Android spyware artifacts that are likely affiliated with the Iranian Ministry of Intelligence and Security (MOIS) and have been distributed to targets by masquerading as VPN apps and Starlink, a satellite internet connection service offered by SpaceX.\nMobile security vendor Lookout said it discovered four samples of a surveillanceware tool it tracks as\nDCHSpy\none week after the onset of the Israel-Iran conflict last month. Exactly how many people may have installed these apps is not clear.\n\"DCHSpy collects WhatsApp data, accounts, contacts, SMS, files, location, and call logs, and can record audio and take photos,\" security researchers Alemdar Islamoglu and Justin Albrecht\nsaid\n.\nFirst detected in July 2024, DCHSpy is assessed to be the handiwork of\nMuddyWater\n, an Iranian nation-state group tied to MOIS. The hacking crew is also called Boggy Serpens, Cobalt Ulster, Earth Vetala, ITG17, Mango Sandstorm (formerly Mercury), Seedworm, Static Kitten, TA450, and Yellow Nix.\nEarly iterations of DCHSPy have been identified targeting English and Farsi speakers via Telegram channels using themes that run counter to the Iranian regime. Given the use of VPN lures to advertise the malware, it's likely that dissidents, activists, and journalists are a target of the activity.\nIt's suspected that the newly identified DCHSpy variants are being deployed against adversaries in the wake of the recent conflict in the region by passing them off as seemingly useful services like Earth VPN (\"com.earth.earth_vpn\"), Comodo VPN (\"com.comodoapp.comodovpn\"), and Hide VPN (\"com.hv.hide_vpn\").\nInterestingly, one of the Earth VPN app samples has been\nfound\nto be distributed in the form of APK files using the name \"starlink_vpn(1.3.0)-3012 (1).apk,\" indicating that the malware is likely being spread to targets using Starlink-related lures.\nIt's worth noting that Starlink's satellite internet service was\nactivated\nin Iran last month amid a government-imposed\ninternet blackout\n. But, weeks later, the country's parliament\nvoted\nto\noutlaw\nits use over unauthorized operations.\nA modular trojan, DCHSpy is equipped to collect a wide range of data, including account signed-in to the device, contacts, SMS messages, call logs, files, location, ambient audio, photos, and WhatsApp information.\nDCHSpy also shares infrastructure with another Android malware known as\nSandStrike\n, which was flagged by Kaspersky in November 2022 as targeting Persian-speaking individuals by posing as seemingly harmless VPN applications.\nThe discovery of DCHSpy is the latest instance of Android spyware that has been used to target individuals and entities in the Middle East. Other documented malware strains include\nAridSpy\n,\nBouldSpy\n,\nGuardZoo\n,\nRatMilad\n, and\nSpyNote\n.\n\"DCHSpy uses similar tactics and infrastructure as SandStrike,\" Lookout said. \"It is distributed to targeted groups and individuals by leveraging malicious URLs shared directly over messaging apps such as Telegram.\"\n\"These most recent samples of DCHSpy indicate continued development and usage of the surveillanceware as the situation in the Middle East evolves, especially as Iran cracks down on its citizens following the ceasefire with Israel.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "China-Linked Hackers Launch Targeted Espionage Campaign on African IT Infrastructure",
        "Link": "https://thehackernews.com/2025/07/china-linked-hackers-launch-targeted.html",
        "Summary": "The China-linked cyber espionage group tracked as APT41 has been attributed to a new campaign targeting government IT services in the African region.\n\"The attackers used hardcoded names of internal services, IP addresses, and proxy servers embedded within their malware,\" Kaspersky researchers Denis Kulik and Daniil Pogorelov said. \"One of the C2s [command-and-control servers] was a captive",
        "Date": "2025-07-21",
        "Content": "The China-linked cyber espionage group tracked as\nAPT41\nhas been attributed to a new campaign targeting government IT services in the African region.\n\"The attackers used hardcoded names of internal services, IP addresses, and proxy servers embedded within their malware,\" Kaspersky researchers Denis Kulik and Daniil Pogorelov\nsaid\n. \"One of the C2s [command-and-control servers] was a captive SharePoint server within the victim's infrastructure.\"\nAPT41 is the moniker\nassigned\nto a prolific Chinese nation-state hacking group that's known for targeting organizations spanning multiple sectors, including telecom and energy providers, educational institutions, healthcare organizations and IT energy companies in more than three dozen countries.\nWhat makes the campaign noteworthy is its focus on Africa, which, as the Russian cybersecurity vendor noted, \"had experienced the least activity\" from this specific threat actor. That said, the findings line up with\nprevious observations\nfrom Trend Micro that the continent has found itself in its crosshairs since late 2022.\nKaspersky said it began an investigation after it found \"suspicious activity\" on multiple workstations associated with an unnamed organization's IT infrastructure that involved the attackers running commands to ascertain the availability of their C2 server, either directly or via an internal proxy server within the compromised entity.\n\"The source of the suspicious activity turned out to be an unmonitored host that had been compromised,\" the researchers noted. \"\nImpacket\nwas executed on it in the context of a service account. After the Atexec and WmiExec modules finished running, the attackers temporarily suspended their operations.\"\nSoon after, the attackers are said to have harvested credentials associated with privileged accounts to facilitate privilege escalation and lateral movement, ultimately deploying Cobalt Strike for C2 communication using DLL side-loading.\nThe malicious DLLs incorporate a check to verify the language packs installed on the host and proceed with the execution only if the following language packs are not detected: Japanese, Korean (South Korea), Chinese (Mainland China), and Chinese (Taiwan).\nThe attack is also characterized by the use of a hacked SharePoint server for C2 purposes, using it to send commands that are run by a C#-based malware uploaded to the victim hosts.\n\"They distributed files named agents.exe and agentx.exe via the SMB protocol to communicate with the server,\" Kaspersky explained. \"Each of these files is actually a C# trojan whose primary function is to execute commands it receives from a web shell named CommandHandler.aspx, which is installed on the SharePoint server.\"\nThis method blends traditional malware deployment with living-off-the-land tactics, where trusted services like SharePoint are turned into covert control channels. These behaviors align with techniques categorized under MITRE ATT&CK, including T1071.001 (Web Protocols) and T1047 (WMI), making them difficult to detect using signature-based tools alone.\nFurthermore, the threat actors have been spotted carrying out follow-on activity on machines deemed valuable post initial reconnaissance. This is accomplished by running a cmd.exe command to download from an external resource a malicious HTML Application (HTA) file containing embedded JavaScript and run it using mshta.exe.\nThe exact nature of the payload delivered via the external URL, a domain impersonating GitHub (\"github.githubassets[.]net\") so as to evade detection, is currently unknown. However, an analysis of one of the previously distributed scripts shows that it's designed to spawn a reverse shell, thereby granting the attackers the ability to execute commands on the infected system.\nAlso put to use in the attacks are stealers and credential-harvesting utilities to gather sensitive data and exfiltrate the details via the SharePoint server. Some of the tools deployed by the adversary are listed below -\nPillager\n, albeit a modified version, to steal credentials from browsers, databases, and administrative utilities like MobaXterm; source code; screenshots; chat sessions and data; email messages; SSH and FTP sessions; list of installed apps; output of the systeminfo and tasklist commands; and account information from chat apps and email clients\nCheckout to steal information about downloaded files and credit card data saved in web browsers like Yandex, Opera, OperaGX, Vivaldi, Google Chrome, Brave, and Cốc Cốc.\nRawCopy to copy raw registry files\nMimikatz to dump account credentials\n\"The attackers wield a wide array of both custom-built and publicly available tools,\" Kaspersky said. \"Specifically, they use penetration testing tools like Cobalt Strike at various stages of an attack.\"\n\"The attackers are quick to adapt to their target's infrastructure, updating their malicious tools to account for specific characteristics. They can even leverage internal services for C2 communication and data exfiltration.\"\nThis operation also highlights the blurred line between red team tools and real-world adversary simulation, where threat actors use public frameworks like Impacket, Mimikatz, and Cobalt Strike alongside custom implants. These overlaps pose challenges for detection teams focused on lateral movement, credential access, and defense evasion across Windows environments.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "⚡ Weekly Recap: SharePoint 0-Day, Chrome Exploit, macOS Spyware, NVIDIA Toolkit RCE and More",
        "Link": "https://thehackernews.com/2025/07/weekly-recap-sharepoint-0-day-chrome.html",
        "Summary": "Even in well-secured environments, attackers are getting in—not with flashy exploits, but by quietly taking advantage of weak settings, outdated encryption, and trusted tools left unprotected.\nThese attacks don’t depend on zero-days. They work by staying unnoticed—slipping through the cracks in what we monitor and what we assume is safe. What once looked suspicious now blends in, thanks to",
        "Date": "2025-07-21",
        "Content": "Even in well-secured environments, attackers are getting in—not with flashy exploits, but by quietly taking advantage of weak settings, outdated encryption, and trusted tools left unprotected.\nThese attacks don't depend on zero-days. They work by staying unnoticed—slipping through the cracks in what we monitor and what we assume is safe. What once looked suspicious now blends in, thanks to modular techniques and automation that copy normal behavior.\nThe real concern? Control isn't just being challenged—it's being quietly taken. This week's updates highlight how default settings, blurred trust boundaries, and exposed infrastructure are turning everyday systems into entry points.\n⚡ Threat of the Week\nCritical SharePoint Zero-Day Actively Exploited (Patch Released Today)\n— Microsoft has released fixes to address two security flaws in SharePoint Server that have come under active exploitation in the wild to breach dozens of organizations across the world. Details of exploitation emerged over the weekend, prompting Microsoft to issue an advisory for CVE-2025-53770 and CVE-2025-53771, which are now assessed to be patch bypasses for two other SharePoint flaws tracked as CVE-2025-49704 and CVE-2025-49706, an exploit chain dubbed ToolShell that could be leveraged to achieve remote code execution on on-premises SharePoint servers. The two vulnerabilities were addressed by Microsoft earlier this month as part of its Patch Tuesday update. It's currently not known who is behind the mass-exploitation activity.\nSecure your LLMs Against Real-World Threats\nLLMs are showing up everywhere — from customer support to code generation. But most security tools weren't built for the risks they bring.  The LLM Security Best Practices Cheat Sheet is a practical guide to help you identify, mitigate, and prevent the most critical LLM security risks across your AI stack.\nDownload Now ➝\n🔔 Top News\nGoogle Ships Patch for Actively Exploited Chrome Flaw\n— Google out patches to resolve a high-severity vulnerability in Chrome browser (CVE-2025-6558) that has come under active exploitation in the wild, making it the fifth zero-day to be either actively abused or demonstrated as a proof-of-concept (PoC) since the start of the year. The vulnerability is an incorrect validation of untrusted input in the browser's ANGLE and GPU components that could allow an attacker to potentially perform a sandbox escape via a crafted HTML page. The issue has been addressed in versions 138.0.7204.157/.158 for Windows and Apple macOS, and 138.0.7204.157 for Linux.\nCritical NVIDIA Container Toolkit Flaw Disclosed\n— A critical vulnerability in NVIDIA Container Toolkit (CVE-2025-23266) could be exploited to achieve code execution with elevated permissions. \"A successful exploit of this vulnerability might lead to escalation of privileges, data tampering, information disclosure, and denial-of-service,\" the GPU maker said. Wiz, which disclosed the flaw, said the shortcoming could be trivially exploited to access, steal, or manipulate the sensitive data and proprietary models of all other customers running on the same shared hardware by means of a three-line exploit.\nNew CrushFTP Bug Comes Under Attack\n— CrushFTP revealed that a critical flaw in its file transfer software (CVE-2025-54309) has been exploited in the wild, with unknown threat actors reverse engineering its source code to discover the bug and target devices that are yet to be updated to the latest versions. The issue affects all versions of CrushFTP 10 before 10.8.5 and 11 before 11.3.4_23. \"The attack vector was HTTP(S) for how they could exploit the server,\" CrushFTP said. \"We had fixed a different issue related to AS2 in HTTP(S) not realizing that a prior bug could be used like this exploit was. Hackers apparently saw our code change, and figured out a way to exploit the prior bug.\"\nGolden dMSA Attack in Windows Server 2025 Enables Cross-Domain Attacks\n— Cybersecurity researchers disclosed a \"critical design flaw\" in delegated Managed Service Accounts (dMSAs) introduced in Windows Server 2025 that could enable cross-domain lateral movement and persistent access to all managed service accounts and their resources across Active Directory indefinitely. \"The attack leverages a critical design flaw: A structure that's used for the password-generation computation contains predictable time-based components with only 1,024 possible combinations, making brute-force password generation computationally trivial,\" Semperis researcher Adi Malyanker said.\nGoogle Big Sleep AI Agent Flags Critical SQLite Flaw Before Exploitation\n— Big Sleep, an artificial intelligence (AI) agent launched by Google last year as a collaboration between DeepMind and Google Project Zero, facilitated the discovery of a critical security flaw in SQLite (CVE-2025-6965) that was previously only known to attackers as a zero-day and was on the verge of exploitation. Google described it as the first time an AI agent has been used to \"directly foil efforts to exploit a vulnerability in the wild.\"\nThreat Actors Target EoL SonicWall SMA 100 Devices\n— Unknown intruders codenamed UNC6148 are targeting fully patched end-of-life SonicWall Secure Mobile Access (SMA) 100 series appliances and deploying a novel, persistent backdoor and rootkit called OVERWATCH. Many key details about the campaign are currently unknown. For starters, Google said it does not have enough data to determine where the threat actors are based, or what their motives are. Second, the attacks are exploiting leaked local administrator credentials on the targeted devices for initial access. But it has been unable to pinpoint how the attackers managed to obtain the credentials used in the attack. While it's possible that they were sourced from infostealer logs or credential marketplaces, the company noted it's more likely that the attackers leveraged a known vulnerability. It's also unclear precisely what the attackers are trying to accomplish after they take control of a device. The lack of information largely stems from how OVERWATCH functions, which allows the attackers to selectively remove log entries to hinder forensic investigation. The investigation also found that UNC6148 also managed to deploy a reverse shell on infected devices, something that should not normally be possible, leading to speculations that a zero-day might have been in play. The findings once again show network appliances are popular attacker targets, as they offer a way to gain access to high-value networks.\n‎️‍🔥 Trending CVEs\nHackers are quick to jump on newly discovered software flaws – sometimes within hours. Whether it's a missed update or a hidden bug, even one unpatched CVE can open the door to serious damage. Below are this week's high-risk vulnerabilities making waves. Review the list, patch fast, and stay a step ahead.\nThis week's list includes —\nCVE-2025-53770, CVE-2025-53771\n(Microsoft SharePoint Server),\nCVE-2025-37103\n(HPE Instant On Access Points),\nCVE-2025-54309\n(CrushFTP),\nCVE-2025-23266\n,\nCVE-2025-23267\n(NVIDIA Container Toolkit),\nCVE-2025-20337\n(Cisco Identity Services Engine and ISE Passive Identity Connector),\nCVE-2025-6558\n(Google Chrome),\nCVE-2025-6965\n(SQLite),\nCVE-2025-5333\n(Broadcom Symantec Endpoint Management Suite), CVE-2025-6965 (SQLite),\nCVE-2025-48384\n(Git CLI),\nCVE-2025-4919\n(Mozilla Firefox),\nCVE-2025-53833\n(LaRecipe),\nCVE-2025-53506\n(Apache Tomcat),\nCVE-2025-41236\n(Broadcom VMware ESXi, Workstation, and Fusion),\nCVE-2025-27210, CVE-2025-27209\n(Node.js),\nCVE-2025-53906\n(Vim),\nCVE-2025-50067\n(Oracle Application Express),\nCVE-2025-30751\n(Oracle Database),\nCVE-2025-6230, CVE-2025-6231, CVE-2025-6232\n(Lenovo Vantage),\nCVE-2024-13972, CVE-2025-7433, CVE-2025-7472\n(Sophos Intercept X for Windows),\nCVE-2025-27212\n(Ubiquiti UniFi Access),\nCVE-2025-4657\n(Lenovo Protection Driver),\nCVE-2025-2500\n(Hitachi Energy Asset Suite),\nCVE-2025-6023, CVE-2025-6197\n(Grafana),\nCVE-2025-40776, CVE-2025-40777\n(BIND 9),\nCVE-2025-33043, CVE-2025-2884, CVE-2025-3052\n(Gigabyte), and\nCVE-2025-31019\n(Password Policy Manager plugin).\n📰 Around the Cyber World\nRussian Sentenced to 3 Years in Prison in the Netherlands for Sharing Data\n— A Rotterdam court\nsentenced\na 43-year-old Russian to three years in prison for breaching international sanctions by sharing sensitive ASML information from Dutch semiconductor chip machine maker ASML and NXP with a person in Russia. At his trial on June 26, the suspect admitted to copying files last year and sending them to a person in Russia using the Signal messaging app. While the name of the defendant was not disclosed, Reuters\nreported\nin February 2025 that the perpetrator was German Aksenov, and that he had contact with Russia's FSB intelligence service. He was\ncharged\nwith IP theft and sanctions violations in December 2024.\nU.K. NCSC Launches Vulnerability Research Initiative\n— The U.K. National Cyber Security Centre (NCSC) announced a new Vulnerability Research Initiative (VRI) that aims to strengthen relations with external cybersecurity experts. \"The VRI's mission is to strengthen the UK's ability to carry out VR,\" the NCSC\nsaid\n. \"We work with the best external vulnerability researchers to deliver a deep understanding of security on a wide range of  technologies we care about.​ The external VRI community also supports us in having tools and tradecraft for vulnerability discovery.\"\nStorm-1516 Spreads Disinformation in Europe\n— A Kremlin-linked disinformation group tracked as Storm-1516 has been masquerading as real journalists and publishing fake articles on spoofed news websites to spread false narratives in France, Armenia, Germany, Moldova, and Norway. The threat actors used the names and photos of legitimate reporters to lend credibility to the bogus articles, per the\nGnida Project\n. Another pro-Russia disinformation campaign known as Operation Overload (aka Matryoshka or Storm-1679) has been observed leveraging consumer-grade artificial intelligence tools to fuel a \"content explosion\" focused around exacerbating existing tensions around global elections, Ukraine, and immigration, among other controversial issues. The activity, operating since 2023, has a track record of disseminating false narratives by impersonating media outlets with the apparent aim of sowing discord in democratic countries. \"This marks a shift toward more scalable, multilingual, and increasingly sophisticated propaganda tactics,\" Reset Tech and Check First\nsaid\n. \"The campaign has substantially amped up the production of new content in the past eight months, signalling a shift toward faster, more scalable content creation methods.\" Some of the images used in the campaign are believed to have been generated using Flux AI, a text-to-image generator developed by Black Forest Labs. The company\ntold\nWIRED that it has built \"multiple layers of safeguards\" to prevent abuse and that it's committed to working with social media platforms and authorities to ward off unlawful misuse.\nSLOW#TEMPEST Campaign's Evolving Techniques Detailed\n— The threat actors behind a malware campaign called\nSLOW#TEMPEST\nhave been observed using DLL-sideloading techniques to launch a malicious DLL, while relying on Control Flow Graph (CFG) obfuscation and dynamic function calls to conceal the code in the loader DLL. The primary goal of the DLL is to unpack and launch an embedded payload directly in memory only if the target machine has at least 6 GB of RAM. \"The SLOW#TEMPEST campaign's evolution highlights malware obfuscation techniques, specifically dynamic jumps and obfuscated function calls,\" Palo Alto Networks Unit 42\nsaid\n. \"The success of the SLOW#TEMPEST campaign using these techniques demonstrates the potential impact of advanced obfuscation on organizations, making detection and mitigation significantly more challenging.\"\nAbacus Market Shutters After Likely Exit Scam\n— The darknet marketplace known as Abacus Market has suddenly closed its operations, rendering all its infrastructure, including its clearnet mirror, inaccessible. The development comes after Abacus Market users began reporting withdrawal issues in late June 2025. Blockchain intelligence firm TRM Labs\nsaid\nthe marketplace's creators may have possibly pulled off an exit scam and disappeared with users' funds, although the possibility of a law enforcement seizure hasn't been ruled out. Abacus's exit follows the June 16, 2025,\nseizure\nof\nArchetyp Market\nby Europol. Abacus Market launched in September 2021 as Alphabet Market, before it rebranded to its current name two months later. The marketplace is estimated to have generated anywhere between $300 million and $400 million in cryptocurrency sales, spanning illicit drugs, counterfeit items, and stolen cards. ​​According to data from\nChainlysis\n, Abacus Market's revenue has increased significantly, growing by 183.2% YoY in 2024.\nMITRE Announces AADAPT for Cryptocurrency Security\n— The MITRE Corporation launched Adversarial Actions in Digital Asset Payment Technologies, aka\nAADAPT\n, a\ncybersecurity framework\nfor addressing vulnerabilities in digital financial systems such as cryptocurrency. It's modeled after the MITRE ATT&CK framework. \"AADAPT provides developers, policymakers, and financial organizations with a structured methodology for identifying, analyzing, and mitigating potential risks associated with digital asset payments,\" MITRE\nsaid\n. \"By using insights derived from real-world attacks as cited by more than 150 sources from government, industry, and academia, the AADAPT framework identifies adversarial tactics, techniques, and procedures linked to digital asset payment technologies, including consensus algorithms and smart contracts.\"\nU.S. Ex-Army soldier Pleads Guilty to Hacking 10 Telcos\n— Former U.S. Army soldier Cameron John Wagenius (aka kiberphant0m and cyb3rph4nt0m) pleaded guilty to hacking and extorting at least 10 telecommunications companies between April 2023 and December 2024. The 21-year-old \"conspired with others to defraud at least 10 victim organizations by obtaining login credentials for the organizations' protected computer networks,\" the U.S. Department of Justice (DoJ)\nsaid\n. \"The conspirators obtained these credentials using a hacking tool that they called SSH Brute, among other means. They used Telegram group chats to transfer stolen credentials and discuss gaining unauthorized access to victim companies' networks.\" The threat actors behind the scheme then extorted the victim organizations both privately and on cybercrime forums such as BreachForums and XSS.is by offering to sell the stolen data for thousands of dollars. Some of the data was eventually sold and used to perpetuate other frauds, including SIM-swapping. Wagenius et al are said to have attempted to extort at least $1 million from victim data owners. The attacks took place while Wagenius was on active duty, the DoJ said. Court documents show that the defendant Googled for phrases like \"can hacking be treason\" and \"U.S. military personnel defecting to Russia.\" In February 2025, Wagenius\npleaded guilty\nto conspiracy to commit wire fraud, extortion in relation to computer fraud, aggravated identity theft, and unlawful transfer of confidential phone records information. He is scheduled for sentencing on October 6, 2025. His alleged co-conspirators, Connor Moucka and John Binns, were\nindicted\nin November 2024.\nSigned Drivers in Malicious Campaigns\n— Since 2020, no less than 620 signed drivers, 80 certificates, and 60 Windows Hardware Compatibility Program (\nWHCP\n) accounts have been associated with threat actor campaigns. The majority of drivers have been signed by 131 Chinese companies. In 2022 alone, over 250 drivers and roughly 34 certificates and WHCP accounts were identified as potentially compromised. The findings show that \"kernel-level attacks remain highly attractive to threat actors despite Microsoft's improved defenses, due to the highest level of privileges on the compromised system and control they offer to attackers,\" Group-IB\nsaid\n, adding it found overlap in the signing infrastructure across different malware campaigns, such as those using POORTRY and RedDriver. Some of the notable malware strains using kernel loaders for added stealth include Festi, FiveSys, FK_Undead, and BlackMoon. \"Attackers leverage many signing certificates and WHCP accounts by exploiting legitimate processes like the WHCP and Extended Validation (EV) certificates. This includes those belonging to compromised or fraudulently registered organizations, signing malicious drivers, bypassing established security measures, and exploiting the trust model inherent in signed kernel drivers,\" the company noted.\nTeleMessage SGNL Flaw Seeing Exploitation Activity\n— Threat actors are actively attempting to exploit a security flaw in TeleMessage SGNL, an enterprise messaging system modeled after Signal, used by government agencies and enterprises alike to achieve secure communications. The vulnerability,\nCVE-2025-48927\n, can be used to leak sensitive information, including plaintext usernames, passwords, and other data. According to\nGreyNoise\n, exploitation efforts are\ncoming from 25 IP addresses\nover the past 30 days. The majority of the IP addresses are from France, followed by Singapore, Germany, Hong Kong, and India. The attacks target the United States, Singapore, India, Mexico, and Brazil.\nMicrosoft Stops Relying on Chinese Engineers for Defense Cloud Support\n— Microsoft changed its practices to ensure that engineers in China no longer provide technical support to U.S. defense clients using the company's Azure cloud services. The revamps came after a ProPublica investigation\nrevealed\nthat Microsoft has been using Chinese engineers to help maintain U.S. Department of Defense systems, potentially exposing sensitive data to the Chinese government. \"In response to concerns raised earlier this week about US-supervised foreign engineers, Microsoft has made changes to our support for US Government customers to assure that no China-based engineering teams are providing technical assistance for DoD Government cloud and related services,\" the company\nsaid\n.\nJapan Authorities Release Free Phobos and 8Base Decryptor\n— Japan's National Police Agency\npublished\na free decryption tool and a guide in English for organizations impacted by the Phobos and 8Base ransomware attacks. Earlier this February, two Russian nationals accused of using the Phobos ransomware to attack more than 1,000 entities were\ncharged\nas part of a global law enforcement takedown. Phobos launched in December 2018, with a modified version called 8Base gaining prominence in 2023.\nAndroid Allows Gemini Access Third-Party Apps\n— Google has implemented a change that will allow its Gemini artificial intelligence (AI) chatbot to interact with other apps installed on Android devices, such as Phone, Messages, and others, even if users have turned off \"\nGemini Apps Activity\n.\" According to a\nsupport document\nfrom the company, \"Even when Gemini Apps Activity is off, your conversations will be saved with your account for up to 72 hours. This lets Google provide the service and process any feedback. This activity won't appear in your Gemini Apps Activity.\" The update went into effect this month.\nEvilPanel Phishing Toolkit Detailed\n— Cybersecurity researchers have discovered a new phishing toolkit called EvilPanel that's built on Evilginx and provides a web interface for launching multi-factor authentication (MFA)-bypassing attacks. \"EvilPanel wraps all of Evilginx's powerful AiTM capabilities into a sleek, user-friendly web interface, eliminating the need for manual configuration and lowering the barrier to entry for would-be attackers,\" Abnormal AI\nsaid\n. \"EvilPanel's core phishing functionality follows the Evilginx model – i.e., it maintains the login flow by acting as a transparent proxy.\"\nKatz Stealer and Octalyn Stealer Detailed\n— Cybersecurity company SentinelOne is warning that threat actors are increasingly adopting an information stealer called\nKatz Stealer\nowing to its \"robust credential and data discovery with theft capabilities as well as modern evasion and anti-analysis features.\" It described the stealer as a \"combination of credential theft and modern malware design.\" Offered under a Malware-as-a-Service (MaaS) model for a mere $50 per month (or $360 for a whole year), stealers such as Katz are turnkey tools that lower the barrier to entry for pulling off malicious attacks. A notable feature of Katz Stealer is its ability to defeat Chromium's app-bound encryption to gain access to and extract credentials and cookies. \"Katz Stealer is not a 'one shot' infostealer; it is designed to continually exfiltrate the victim's data,\" SentinelOne\nsaid\n. \"The malware not only extracts data found on a targeted system at the point of infection but also as data updated, changed, or freshly introduced.\" Another new stealer masquerades as an educational tool called Octalyn Forensic Toolkit, but acts as a credential stealer, harvesting browser data, Discord and Telegram tokens, VPN configurations, gaming accounts, and cryptocurrency wallet artifacts. \"Its modular C++ payload, Delphi-based builder, Telegram-based C2, and secondary payload delivery capability make it a potent tool for threat actors,\" CYFIRMA\nsaid\n. \"The use of obfuscation, Windows persistence techniques, and structured data theft highlights a deliberate effort to evade detection and maximize impact.\"\nArmenia Passes Use of Facial Recognition Technology by Police\n— Armenia's parliament has\npassed\ncontroversial amendments to the country's Law on Police, granting the Ministry of Internal Affairs access to a nationwide network of real-time surveillance cameras that are equipped with facial recognition technology. The cameras will operate across state and municipal buildings, public transport, airports, and parking areas. The law is set to take effect on August 9, 2025. The CSO Meter\nsaid\nthe law \"lacks clear legal safeguards, public oversight, and proper regulation of artificial intelligence (AI) technologies,\" posing a risk to citizens' privacy.\nScammers Using MaisonReceipts to Create Fake Receipts\n— Fraudsters are using tools like MaisonReceipts to generate counterfeit receipts for over 21 well-known retail brands in multiple currencies (USD, EUR, GBP). They are used by groups that resell counterfeit or stolen items, presenting them as authentic using bogus receipts. \"The service is marketed through subscription-based websites, social media accounts, and encrypted messaging platforms, with features that make the fraudulent receipts appear convincing enough to deceive consumers and online marketplaces,\" Group-IB\nsaid\n.\nPyPI Blocks inbox.ru Email Domain\n— A recent spam campaign against PyPI has prompted the maintainers of the Python Package Index (PyPI) repository to ban the use of the \"inbox.ru\" email domain during new registrations as well as adding extra email addresses. \"The campaign created over 250 new user accounts, publishing over 1,500 new projects on PyPI, leading to end-user confusion, abuse of resources, and potential security issues,\" PyPI\nsaid\n. \"All relevant projects have been removed from PyPI, and accounts have been disabled.\"\nSilver Fox Actor Creates Fake Websites for Malware Delivery\n— The threat actor known as\nSilver Fox\n, which is known for targeting Chinese-speaking individuals and entities, has created over 2,800 domains since June 2023, with 266 of the over 850 identified domains since December 2024 actively distributing malware. These fake websites act as a delivery vector for Windows-specific malware and masquerade as application download sites and software update prompts. \"The consistent operational timing across all hours with high influxes during Chinese working hours, in addition to other factors, suggests a combination of automated and likely human-driven approach to their activities,\" DomainTools\nsaid\n.\nArrested Scattered Spider Members Released on Bail\n— A British court has\nreleased\nfour members of the Scattered Spider group on bail. They were\narrested\nlast week on suspicion of Computer Misuse Act offenses, blackmail, money laundering, and participating in the activities of an organized crime group. They've been charged with hacking U.K. retailers Marks & Spencer, Co-op, and Harrods.\nArmenian National Charged with Ryuk Ransomware Attacks\n— An Armenian man\nextradited\nfrom Ukraine to the United States has been charged over his alleged role in Ryuk ransomware attacks between March 2019 and September 2020. Karen Serobovich Vardanyan was arrested in Kyiv in April, and was extradited to the United States on June 18. Vardanyan has been\ncharged\nwith conspiracy, fraud in connection with computers, and extortion in connection with computers. He has been charged alongside Levon Georgiyovych Avetisyan, 45, who is also an Armenian national facing the same charges. He is currently detained in France and is expected to be extradited as well. Vardanyan and his accomplices received about 1,610 bitcoins from victims, valued at more than $15 million at the time of payment. Two Ukrainians — 53-year-olds Oleg Nikolayevich Lyulyava and Andrii Leonydovich Prykhodchenko — were also charged in connection with Ryuk activity but remain at large.\n$2.17B Stolen from Crypto Services in 2025\n— Hackers and\nscammers\nhave\nstolen\nover $2.17 billion in crypto assets in the first half of this year, with North Korea's\n$1.5 billion hack of Bybit\naccounting for the majority of the assets. Data from TRM Labs\nshows\nthat $2.1 billion was stolen across at least 75 distinct hacks and exploits. A total of $801,315,669 was lost across 144 incidents in Q2 2025, per\nCertiK\n. Wallet compromise emerged as the most costly attack vector in H1 2025, with $1,706,937,700 stolen across 34 incidents. \"So far in 2025, significant concentrations of stolen fund victims have emerged in the U.S., Germany, Russia, Canada, Japan, Indonesia, and South Korea,\" Chainalysis\nsaid\n. \"Personal wallet compromises make up a growing share of total ecosystem value stolen over time.\"\nJapan Targeted by North Korea and China in 2024\n— Japanese organizations have been targeted by North Korean threat actors to distribute malware families like\nBeaverTail, InvisibleFerret\n, and\nRokRAT\n, as well as by Chinese hacking groups such as Mustang Panda, Stone Panda, MirrorFace, Teleboyi, and UNC5221. The China-linked attacks led to the deployment of backdoors and trojans like\nANEL\nand\nPlugX\n, Macnica\nsaid\n.\nRainbow Hyena Goes After Russian Firms\n— The threat actor known as Rainbow Hyena targeted Russian healthcare and IT organizations using phishing emails containing malicious attachments to distribute a C++-based custom backdoor called PhantomRemote. \"The backdoor collects information about the compromised system, loads other executables from the C2 server, and runs commands via the cmd.exe interpreter,\" BI.ZONE\nsaid\n.\nMigration to Post-Quantum Cryptography is Uneven\n— About 6% of all 186 million SSH servers on the internet already use\nquantum-safe encryption\n, according to a\nnew report\nfrom Forescout Research - Vedere Labs. \"Three quarters of OpenSSH versions on the internet still run versions released between 2015 and 2022 that do not support quantum-safe encryption,\" the company\nsaid\n. \"If regulators mandate quantum-safe encryption in the near future, organizations will face serious gaps. Outdated infrastructure will become a compliance and security risk.\"\nBrazilian Police Arrest IT Worker for $100 Million Cyber Theft\n— Authorities in Brazil arrested a suspect in connection with a cyber attack that diverted more than $100 million from the country's banking systems. Per a\nreport\nfrom Associated Press, the suspect has been identified as João Roque, an IT employee of a software company named C&M and he allegedly helped unknown threat actors gain unauthorized access to Brazil's instant payment system, known as\nPIX\n, by\nselling his credentials\nto them earlier this year for about $2,700 in two separate cash payments. Once the cybercriminals breached the company's network, they carried out fraudulent PIX transactions. It's believed that the losses could go up further, as the loss refers to just one financial institution that contracted with C&M.\nItalian Police Arrest Diskstation Ransomware Gang\n— Italian police have\narrested\na 44-year-old Romanian for carrying out cyber attacks against Italian companies as part of a law enforcement effort called Operation Elicius. The unidentified man is alleged to be the leader of the\nDiskStation Security\nransomware group, which has targeted Synology network-attached storage (NAS) devices since 2021. He faces charges of unauthorized access to computer systems and extortion.\nSamsung Announces KEEP to Store Sensitive Data\n— Samsung\nannounced\na number of security and privacy updates to its Galaxy smartphones with One UI 8, including support for quantum-resistant Wi-Fi connections using\nML‑KEM\nand a new architecture called Knox Enhanced Encrypted Protection (KEEP) that creates encrypted, app-specific storage environments for storing data. KEEP also integrates with Samsung's Personal Data Engine (PDE) and Knox Vault, the company's hardware security environment, to enable personalized artificial intelligence (AI) features by analyzing users' data on-device.\nCambodia Arrests Over 1,000 Amid Crackdown on Online Scams\n— Cambodian authorities have\narrested\nmore than 1,000 suspects linked to\nonline scams\nin an effort to\ncrack down on cybercrime operations\nin the country. Those detained included over 200 Vietnamese, 27 Chinese, and 75 suspects from Taiwan and 85 Cambodians in the capital Phnom Penh and the southern city of Sihanoukville. About 270 Indonesians, including 45 women, were arrested in Poipet. In a related development, Thai officials raided properties connected to a Cambodian senator and business tycoon, Kok An, in relation to a local network of cyber scam call centers.\n🎥 Cybersecurity Webinars\nFrom Autofill to Alarm Bells: Securing Identity in the Age of AI\n— Logins got easier—but trust got harder. As AI reshapes digital identity, users are questioning how their data is used and who's really behind the screen. In this session, discover how top brands are tackling AI-driven identity risks while rebuilding trust with smarter, privacy-first authentication strategies.\nHow Attackers Hijack Your Dependencies—and What DevSecOps Teams Must Do Now\n— Your Python environment is under attack—quietly, and from within. In 2025, repo hijacks, poisoned packages, and typosquatting aren't rare edge cases—they're part of the threat landscape. This webinar shows developers and DevSecOps leaders how to lock down the Python supply chain before compromised dependencies take down your systems.\nYour AI Copilot May Be Letting Attackers In — Learn How to Lock Down the Identity Layer\n— AI copilots are boosting productivity—and attackers are using the same power to break your identity perimeter. From API abuse to synthetic logins, the identity layer is under siege. Join Okta to learn how to secure AI-powered workflows, detect AI-driven threats, and make identity your strongest line of defense in 2025.\n🔧 Cybersecurity Tools\nOSINTMap\n— It is a lightweight tool that helps you quickly find and use popular OSINT resources. It organizes hundreds of investigation links—like people search, domain lookups, and breach checkers—into one easy-to-browse local dashboard. Ideal for anyone doing OSINT work, it saves time by keeping everything in one place.\nNortixMail\n— It is an open-source, self‑hosted disposable email server that makes burner addresses easy—without the usual email server headache. You can spin it up with Docker or manually, generate temporary email addresses on demand, and view messages via a clean web interface. Since it keeps messages locally and doesn't rely on third-party services, it's a great tool for testing, avoiding spam, or protecting your inbox during risky sign‑ups.\nDisclaimer: These newly released tools are for educational use only and haven't been fully audited. Use at your own risk—review the code, test safely, and apply proper safeguards.\n🔒 Tip of the Week\nMap Known Vulnerabilities Automatically Across Your Stack —\nAttackers often use Windows Scheduled Tasks to stay hidden on systems. Some go a step further by removing key registry values like SD (Security Descriptor) or Index, making their tasks invisible to common tools like Task Scheduler, schtasks, or even Autoruns. These hidden tasks still run in the background and can be used for persistence or malware delivery.\nTo check for visible tasks, tools like Autoruns (by Sysinternals) and TaskSchedulerView (by NirSoft) are great starting points. They show active tasks and let you spot unusual ones. But hidden tasks require deeper digging. You can use PowerShell to scan the registry path HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Schedule\\TaskCache\\Tree and look for tasks with missing SD values.\nFor more advanced checks, use Sysmon to track changes in the TaskCache registry and ProcMon to monitor registry activity in real time. Look for suspicious task names, missing values, or tasks with an Index of 0. Also, set alerts for Event ID 4698, which logs new scheduled task creation.\nIn short: use both visual tools and registry checks to uncover hidden scheduled tasks. Regular scans, baseline comparisons, and basic alerting can help catch threats early—before they do damage.\nConclusion\nWhat's becoming clearer each week is that attacker sophistication isn't the exception—it's the baseline. AI-driven reconnaissance, credential abuse, and signal mimicry are no longer advanced—they're routine.\nAnd as coordination gaps persist across security teams, the boundary between low-level noise and high-impact intrusions continues to blur. The result isn't just a faster compromise—it's a deeper erosion of trust. If trust was once a strength, it's now a surface that attackers exploit.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Assessing the Role of AI in Zero Trust",
        "Link": "https://thehackernews.com/2025/07/assessing-role-of-ai-in-zero-trust.html",
        "Summary": "By 2025, Zero Trust has evolved from a conceptual framework into an essential pillar of modern security. No longer merely theoretical, it’s now a requirement that organizations must adopt. A robust, defensible architecture built on Zero Trust principles does more than satisfy baseline regulatory mandates. It underpins cyber resilience, secures third-party partnerships, and ensures uninterrupted",
        "Date": "2025-07-21",
        "Content": "By 2025, Zero Trust has evolved from a conceptual framework into an essential pillar of modern security. No longer merely theoretical, it's now a requirement that organizations must adopt. A robust, defensible architecture built on Zero Trust principles does more than satisfy baseline regulatory mandates. It underpins cyber resilience, secures third-party partnerships, and ensures uninterrupted business operations. In turn,\nmore than 80% of organizations\nplan to implement Zero Trust strategies by 2026,\naccording to a recent Zscaler report\n.\nIn the context of Zero Trust, artificial intelligence (AI) can assist greatly as a tool for implementing automation around adaptive trust and continuous risk evaluation. In a Zero Trust architecture, access decisions must adapt continuously to changing factors such as device posture, user behavior, location, workload sensitivity, and more. This constant evaluation generates massive volumes of data, far beyond what human teams can process alone.\nAI is key to managing that scale, playing a critical role across all five of\nCISA's Zero Trust pillars\n—identity, devices, networks, applications, and data. By filtering signal from noise, AI can help detect intrusions, identify malware, and apply behavioral analytics to flag anomalies that would be nearly impossible to catch manually. For example, if a user suddenly downloads sensitive files at 2 a.m. from an unusual location, AI models trained on behavioral baselines can flag the event, assess the risk, and trigger actions like reauthentication or session termination. This enables adaptive trust: access that adjusts in real time based on risk, supported by automation so the system can respond immediately without waiting on human intervention.\nPredictive vs. Generative AI: Different Tools, Different Purposes\nThere are two primary categories of AI relevant to Zero Trust: predictive models and generative models.\nPredictive AI\n, including machine learning and deep learning, is trained on historical data to identify patterns, behaviors, and early indicators of compromise. These models power detection and prevention systems—such as EDRs, intrusion detection platforms, and behavioral analytics engines—that help catch threats early in the attack chain. When it comes to Zero Trust, predictive AI supports the control plane by feeding real-time signals into dynamic policy enforcement. It enables continuous evaluation of access requests by scoring context: is the device compliant? Is the login location unusual? Is the behavior consistent with baseline activity?\nGenerative AI\n, such as large language models like ChatGPT and Gemini, serves a different purpose. These systems are not predictive and don't enforce controls. Instead, they support human operators by summarizing information, generating queries, accelerating scripting, and providing faster access to relevant context. In high-tempo security environments, this functionality helps reduce friction and allows analysts to triage and investigate more efficiently.\nAgentic AI\ntakes large language models beyond support roles into active participants in security workflows. By wrapping an LLM in a lightweight \"agent\" that can call APIs, execute scripts, and adapt its behavior based on real-time feedback, you gain a self-driving automation layer that orchestrates complex Zero Trust tasks end to end. For example, an agentic AI could automatically gather identity context, adjust network micro-segmentation policies, spin up temporary access workflows, and then revoke privileges once a risk threshold is cleared, all without manual intervention. This evolution not only accelerates response times, but also ensures consistency and scalability, letting your team focus on strategic threat hunting while routine enforcement and remediation happen reliably in the background.\nThese approaches all have a place in a Zero Trust model. Predictive AI enhances automated enforcement by driving real-time risk scoring. Generative AI enables defenders to move faster and make better-informed decisions, especially in time-sensitive or high-volume scenarios. Agentic AI brings orchestration and end-to-end automation into the mix, letting you automatically adjust policies, remediate risks, and revoke privileges without manual intervention. The strength of a Zero Trust architecture lies in applying it where it fits best.\nHuman-Machine Teaming: Working in Tandem\nDespite their growing roles, AI models alone can't serve as the sole \"brain\" of a Zero Trust architecture. Predictive AI, generative AI, and agentic AI each act more like specialized co-pilot analysts—surfacing patterns, summarizing context, or orchestrating workflows based on real-time signals. True Zero Trust still relies on human-defined policy logic, rigorous system-level design, and ongoing oversight to ensure that automated actions align with your security objectives.\nThat's especially important because AI is not immune to manipulation. The\nSANS Critical AI Security Guidelines\noutline risks, including model poisoning, inference tampering, and vector database manipulation—all of which can be used to subvert Zero Trust enforcement if the AI system is blindly trusted. This is why our\nSANS SEC530 Defensible Security Architecture & Engineering: Implementing Zero Trust for the Hybrid Enterprise\ncourse emphasizes the concept of human-machine teaming. AI automates data analysis and response recommendations, but humans must set boundaries and validate those outputs within the broader security architecture. Whether that means writing tighter enforcement rules or segmenting access to model outputs, the control stays with the operator.\nThis model of collaboration is increasingly being recognized as the most sustainable way forward. Machines can outpace humans when it comes to processing volume, but they may lack certain business context, creativity, and ethical reasoning that only humans bring. Practitioners – \"all-around defenders\", as I like to call them - remain essential not just for incident response, but for designing resilient enforcement strategies, interpreting ambiguous scenarios, and making the judgment calls that machines can't. The future of Zero Trust isn't AI replacing human. It's AI amplifying the human, surfacing actionable insight, accelerating investigation, and scaling enforcement decisions without removing human control.\nReady for More Insight?\nFor a deeper dive on AI's role in Zero Trust,\nSANS Certified Instructor Josh Johnson\nwill be teaching SEC530 at our\nSANS DC Metro Fall 2025 live training event\n(Sept. 29-Oct. 4, 2025) in Rockville, MD. The event cultivates a dynamic learning environment that features industry-leading hands-on labs, simulations, and exercises, all geared towards practical application.\nRegister for SANS DC Metro Fall 2025 here\n.\nNote:\nThis article was written and contributed by\nIsmael Valenzuela\n, SANS Senior Instructor and Vice President of Threat Research and Intelligence at Arctic Wolf.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "PoisonSeed Hackers Bypass FIDO Keys Using QR Phishing and Cross-Device Sign-In Abuse",
        "Link": "https://thehackernews.com/2025/07/poisonseed-hackers-bypass-fido-keys.html",
        "Summary": "Cybersecurity researchers have disclosed a novel attack technique that allows threat actors to downgrade Fast IDentity Online (FIDO) key protections by deceiving users into approving authentication requests from spoofed company login portals.FIDO keys are hardware- or software-based authenticators designed to eliminate phishing by binding logins to specific domains using public-private key",
        "Date": "2025-07-21",
        "Content": "Cybersecurity researchers have disclosed a novel attack technique that allows threat actors to downgrade Fast IDentity Online (\nFIDO\n) key protections by deceiving users into approving authentication requests from spoofed company login portals.\nFIDO keys are hardware- or software-based authenticators designed to eliminate phishing by binding logins to specific domains using public-private key cryptography. In this case, attackers exploit a legitimate feature—cross-device sign-in—to trick victims into unknowingly authenticating malicious sessions.\nThe activity, observed by Expel as part of a phishing campaign in the wild, has been attributed to a threat actor named\nPoisonSeed\n, which was recently flagged as leveraging compromised credentials associated with customer relationship management (CRM) tools and bulk email providers to send spam messages containing cryptocurrency seed phrases and drain victims' digital wallets.\n\"The attacker does this by taking advantage of cross-device sign-in features available with FIDO keys,\" researchers Ben Nahorney and Brandon Overstreet\nsaid\n. \"However, the bad actors in this case are using this feature in adversary-in-the-middle (AitM) attacks.\"\nThis technique doesn't work in all scenarios. It specifically targets users authenticating via cross-device flows that don't enforce strict proximity checks—such as Bluetooth or local device attestation. If a user's environment mandates hardware security keys plugged directly into the login device, or uses platform-bound authenticators (like Face ID tied to the browser context), the attack chain breaks.\nCross-device sign-in\nallows users to sign-in on a device that does not have a passkey using a second device that does hold the cryptographic key, such as a mobile phone.\nThe attack chain documented by Expel commences with a phishing email that lures recipients to log into a fake sign-in page mimicking the enterprise's Okta portal. Once the victims enter their credentials, the sign-in information is stealthily relayed by the bogus site to the real login page.\nThe phishing site then instructs the legitimate login page to use the hybrid transport method for authentication, which causes the page to serve a QR code that's subsequently sent back to the phishing site and presented to the victim.\nShould the user scan the QR code with the authenticator app on their mobile device, it allows the attackers to gain unauthorized access to the victim's account.\n\"In the case of this attack, the bad actors have entered the correct username and password and requested cross-device sign-in,\" Expel said.\n\"The login portal displays a QR code, which the phishing site immediately captures and relays back to the user on the fake site. The user scans it with their MFA authenticator, the login portal and the MFA authenticator communicate, and the attackers are in.\"\nWhat makes the attack noteworthy is that it gets around protections offered by FIDO keys and enables threat actors to obtain access to users' accounts. The compromise method does not exploit any flaw in the FIDO implementation. Rather, it abuses a legitimate feature to downgrade the authentication process.\nWhile FIDO2 is designed to resist phishing, its cross-device login flow—known as hybrid transport—can be misused if proximity verification like Bluetooth is not enforced. In this flow, users can log in on a desktop by scanning a QR code with a mobile device that holds their passkey.\nHowever, attackers can intercept and relay that QR code in real time via a phishing site, tricking users into approving the authentication on a spoofed domain. This turns a secure feature into a phishing loophole—not due to a protocol flaw, but due to its flexible implementation.\nExpel also said it observed a separate incident where a threat actor enrolled their own FIDO key after compromising an account through a phishing email and resetting the user's password.\nTo better protect user accounts, organizations should pair FIDO2 authentication with checks that verify the device being used. When possible, logins should happen on the same device holding the passkey, which limits phishing risk. Security teams should watch for unusual QR code logins or new passkey enrollments. Account recovery options should use phishing-resistant methods, and login screens—especially for cross-device sign-ins—should show helpful details like location, device type, or clear warnings to help users spot suspicious activity.\nIf anything, the findings underscore the need for adopting phishing-resistant authentication at all steps in an account lifecycle, including during recovery phases, as using an authentication method that's susceptible to phishing can undermine the entire identity infrastructure.\n\"AitM attacks against FIDO keys and attacker-controlled FIDO keys are just the latest in a long line of examples where bad actors and defenders up the ante in the fight to compromise/protect user accounts,\" the researchers added.\n(The story was updated after publication to make it more clear that the attack technique does not bypass FIDO protections and that it downgrades the authentication to a method that's susceptible to phishing.)\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft Releases Urgent Patch for SharePoint RCE Flaw Exploited in Ongoing Cyber Attacks",
        "Link": "https://thehackernews.com/2025/07/microsoft-releases-urgent-patch-for.html",
        "Summary": "Microsoft on Sunday released security patches for an actively exploited security flaw in SharePoint and also disclosed details of another vulnerability that it said has been addressed with \"more robust protections.\"\nThe tech giant acknowledged it's \"aware of active attacks targeting on-premises SharePoint Server customers by exploiting vulnerabilities partially addressed by the July Security",
        "Date": "2025-07-21",
        "Content": "Microsoft on Sunday\nreleased\nsecurity patches for an\nactively exploited security flaw in SharePoint\nand also disclosed details of another vulnerability that it said has been addressed with \"more robust protections.\"\nThe tech giant acknowledged it's \"aware of active attacks targeting on-premises SharePoint Server customers by exploiting vulnerabilities partially addressed by the July Security Update.\"\nCVE-2025-53770\n(CVSS score: 9.8), as the exploited Vulnerability is tracked, concerns a case of remote code execution that arises due to the deserialization of untrusted data in on-premise versions of Microsoft SharePoint Server.\nThe newly disclosed shortcoming is a spoofing flaw in SharePoint (\nCVE-2025-53771\n, CVSS score: 6.3). An anonymous researcher has been credited with discovering and reporting the bug.\n\"Improper limitation of a pathname to a restricted directory ('path traversal') in Microsoft Office SharePoint allows an authorized attacker to perform spoofing over a network,\" Microsoft said in an advisory released on July 20, 2025.\nMicrosoft also noted that CVE-2025-53770 and CVE-2025-53771 are related to two other SharePoint vulnerabilities documented by CVE-2025-49704 and CVE-2025-49706, which could be chained to achieve remote code execution. The exploit chain, referred to as ToolShell, was patched as part of the company's July 2025 Patch Tuesday update.\n\"The update for CVE-2025-53770 includes more robust protections than the update for CVE-2025-49704,\" the Windows maker said. \"The update for CVE-2025-53771 includes more robust protections than the update for CVE-2025-49706.\"\nIt's worth noting that Microsoft previously characterized CVE-2025-53770 as a variant of CVE-2025-49706. When reached for comment about this discrepancy, a Microsoft spokesperson told The Hacker News that \"it is prioritizing getting updates out to customers while also correcting any content inaccuracies as necessary.\"\nThe company also said that the current published content is correct and that the previous inconsistency does not impact the company's guidance for customers.\nBoth the identified flaws apply to on-premises SharePoint Servers only, and do not impact SharePoint Online in Microsoft 365. The issues have been addressed in the versions below (for now) -\nMicrosoft SharePoint Server 2019 (\n16.0.10417.20027\n)\nMicrosoft SharePoint Enterprise Server 2016 (\n16.0.5508.1000\n)\nMicrosoft SharePoint Server Subscription Edition\nMicrosoft SharePoint Server 2019 Core\nMicrosoft SharePoint Server 2016 (TBD)\nTo mitigate potential attacks, customers are recommended to -\nUse supported versions of on-premises SharePoint Server (SharePoint Server 2016, 2019, and SharePoint Subscription Edition)\nApply the latest security updates\nEnsure the Antimalware Scan Interface (AMSI) is turned on and enable\nFull Mode\nfor optimal protection, along with an appropriate antivirus solution such as Defender Antivirus\nDeploy Microsoft Defender for Endpoint protection, or equivalent threat solutions\nRotate SharePoint Server ASP.NET machine keys\n\"After applying the latest security updates above or enabling AMSI, it is critical that customers rotate SharePoint server ASP.NET machine keys and restart IIS on all SharePoint servers,\" Microsoft said. \"If you cannot enable AMSI, you will need to rotate your keys after you install the new security update.\"\nThe development comes as Eye Security told The Hacker News that at least 54 organizations have been compromised, including banks, universities, and government entities. Active exploitation is said to have commenced around July 18, according to the company.\nThe U.S. Cybersecurity and Infrastructure Security Agency (CISA), for its part,\nadded\nCVE-2025-53770 to its Known Exploited Vulnerabilities (\nKEV\n) catalog, requiring Federal Civilian Executive Branch (FCEB) agencies to apply the fixes by July 21, 2025.\nPalo Alto Networks Unit 42, which is also tracking what it described as a \"high-impact, ongoing threat campaign,\" said government, schools, healthcare, including hospitals, and large enterprise companies are at immediate risk.\n\"Attackers are bypassing identity controls, including MFA and SSO, to gain privileged access,\" Michael Sikorski, CTO and Head of Threat Intelligence for Unit 42 at Palo Alto Networks, told The Hacker News. \"Once inside, they're exfiltrating sensitive data, deploying persistent backdoors, and stealing cryptographic keys. The attackers have leveraged this vulnerability to get into systems and are already establishing their foothold.\n\"If you have SharePoint on-prem exposed to the internet, you should assume that you have been compromised at this point. Patching alone is insufficient to fully evict the threat. What makes this especially concerning is SharePoint's deep integration with Microsoft's platform, including their services like Office, Teams, OneDrive and Outlook, which have all the information valuable to an attacker. A compromise doesn't stay contained—it opens the door to the entire network.\"\nThe cybersecurity vendor has also classified it as a high-severity, high-urgency threat, urging organizations running on-premises Microsoft SharePoint servers to apply the necessary patches with immediate effect, rotate all cryptographic material, and engage in incident response efforts.\n\"An immediate, band-aid fix would be to unplug your Microsoft SharePoint from the internet until a patch is available,\" Sikorski added. \"A false sense of security could result in prolonged exposure and widespread compromise.\"\n(This is a developing story. Please check back for more details.)\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Hard-Coded Credentials Found in HPE Instant On Devices Allow Admin Access",
        "Link": "https://thehackernews.com/2025/07/hard-coded-credentials-found-in-hpe.html",
        "Summary": "Hewlett-Packard Enterprise (HPE) has released security updates to address a critical security flaw affecting Instant On Access Points that could allow an attacker to bypass authentication and gain administrative access to susceptible systems.\nThe vulnerability, tracked as CVE-2025-37103, carries a CVSS score of 9.8 out of a maximum of 10.0.\n\"Hard-coded login credentials were found in HPE",
        "Date": "2025-07-21",
        "Content": "Hewlett-Packard Enterprise (HPE) has released security updates to address a critical security flaw affecting Instant On Access Points that could allow an attacker to bypass authentication and gain administrative access to susceptible systems.\nThe vulnerability, tracked as CVE-2025-37103, carries a CVSS score of 9.8 out of a maximum of 10.0.\n\"Hard-coded login credentials were found in HPE Networking Instant On Access Points, allowing anyone with knowledge of it to bypass normal device authentication,\" the company\nsaid\nin an advisory.\n\"Successful exploitation could allow a remote attacker to gain administrative access to the system.\"\nAlso patched by HPE is an authenticated command injection flaw in the command-line interface of the HPE Networking Instant On Access Points (CVE-2025-37102, CVSS score: 7.2) that a remote attacker could exploit with elevated permissions to run arbitrary commands on the underlying operating system as a privileged user.\nThis also means that an attacker could fashion CVE-2025-37103 and CVE-2025-37102 into an exploit chain, allowing them to obtain administrative access and inject malicious commands into the command-line interface for follow-on activity.\nThe company credited ZZ from Ubisectech Sirius Team for discovering and reporting the two issues. Both vulnerabilities have been resolved in HPE Networking Instant On software version 3.2.1.0 and above.\nHPE also noted in its advisory that other devices, such as HPE Networking Instant On Switches, are not affected.\nWhile there is no evidence that either of the flaws has come under active exploitation, users are advised to apply the updates as soon as possible to mitigate potential threats.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "3,500 Websites Hijacked to Secretly Mine Crypto Using Stealth JavaScript and WebSocket Tactics",
        "Link": "https://thehackernews.com/2025/07/3500-websites-hijacked-to-secretly-mine.html",
        "Summary": "A new attack campaign has compromised more than 3,500 websites worldwide with JavaScript cryptocurrency miners, marking the return of browser-based cryptojacking attacks once popularized by the likes of CoinHive.&nbsp;\nAlthough the service has since shuttered after browser makers took steps to ban miner-related apps and add-ons, researchers from the c/side said they found evidence of a stealthy",
        "Date": "2025-07-21",
        "Content": "A new attack campaign has compromised more than 3,500 websites worldwide with JavaScript cryptocurrency miners, marking the return of browser-based cryptojacking attacks once popularized by the likes of\nCoinHive\n.\nAlthough the service has since\nshuttered\nafter browser makers took steps to ban miner-related apps and add-ons, researchers from the c/side said they found evidence of a stealthy miner packed within obfuscated JavaScript that assesses the computational power of a device and spawns background Web Workers to execute mining tasks in parallel without raising any alarm.\nMore importantly, the activity has been found to leverage WebSockets to fetch mining tasks from an external server, so as to dynamically adjust the mining intensity based on the device capabilities and accordingly throttle resource consumption to maintain stealth.\n\"This was a stealth miner, designed to avoid detection by staying below the radar of both users and security tools,\" security researcher Himanshu Anand\nsaid\n.\nThe net result of this approach is that users would unknowingly mine cryptocurrency while browsing the compromised website, turning their computers into covert crypto generation machines without their knowledge or consent. Exactly how the websites are breached to facilitate in-browser mining is currently not known.\nFurther dissection has determined that over 3,500 websites have been ensnared in the sprawling illicit crypto mining effort, with the domain hosting the JavaScript miner also linked to\nMagecart credit card skimmers\nin the past, indicating attempts on the part of the attackers to diversify their payloads and revenue streams.\nThe use of the same domains to deliver both miner and credit/debit card exfiltration scripts indicates the ability of the threat actors to weaponize JavaScript and stage opportunistic attacks aimed at unsuspecting site visitors.\n\"Attackers now prioritize stealth over brute-force resource theft, using obfuscation, WebSockets, and infrastructure reuse to stay hidden,\" c/side said. \"The goal isn't to drain devices instantly, it is to persistently siphon resources over time, like a digital vampire.\"\nThe findings coincide with a\nMagecart skimming campaign\ntargeting East Asian e-commerce websites using the OpenCart content management system (CMS) to inject a fake payment form during checkout and collect financial information, including bank details, from victims. The captured information is then exfiltrated to the attacker's server.\nIn recent weeks, client-side and website-oriented attacks have been found to take different forms -\nUtilizing JavaScript embeds that\nabuse\nthe callback parameter associated with a legitimate Google OAuth endpoint (\"accounts.google[.]com/o/oauth2/revoke\") to redirect to an obfuscated JavaScript payload that creates a malicious WebSocket connection to an attacker-controlled domain\nUsing Google Tag Manager (\nGTM\n) script directly\ninjected\ninto the WordPress database (i.e., wp_options and wp_posts tables) in order to load remote JavaScript that redirects visitors to over 200 sites to spam domains\nCompromising a WordPress site's\nwp-settings.php file\nto include a malicious PHP script directly from a ZIP archive that connects to a command-and-control (C2) server and ultimately leverages the site's search engine rankings to inject spammy content and boost their sketchy sites in search results\nInjecting malicious code into a\nWordPress site theme's footer PHP script\nto server browser redirects\nUsing a fake WordPress plugin named after the\ninfected domain\nto evade detection and spring into action only when search engine crawlers are detected in order to serve spam content designed to manipulate search engine results\nDistributing\nbackdoored versions\nof the WordPress plugin Gravity Forms (affecting only versions 2.9.11.1 and 2.9.12) through the official download page in a supply chain attack that contacts an external server to fetch additional payloads and adds an admin account that gives the attacker complete control of the website\n\"If installed, the malicious code modifications will block attempts to update the package and attempt to reach an external server to download additional payload,\" RocketGenius, the team behind Gravity Forms,\nsaid\n.\n\"If it succeeds in executing this payload, it will then attempt to add an administrative account. That opens a back door to a range of other possible malicious actions, such as expanding remote access, additional unauthorized arbitrary code injections, manipulation of existing admin accounts, and access to stored WordPress data.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Intel announces end of Clear Linux OS project, archives GitHub repos",
        "Link": "https://www.bleepingcomputer.com/news/security/intel-announces-end-of-clear-linux-os-project-archives-github-repos/",
        "Summary": "The Clear Linux OS team has announced the shutdown of the project, marking the end of its 10-year existence in the open-source ecosystem. [...]",
        "Date": "2025-07-21",
        "Content": "The Clear Linux OS team has announced the shutdown of the project, marking the end of its 10-year existence in the open-source ecosystem.\nClear Linux is a Linux distribution developed and maintained by Intel, featuring aggressive optimizations for Intel hardware. Binaries are compiled using tuning flags designed explicitly for Intel CPUs.\nIt was a minimalist, modular OS that utilized software bundles for faster app installation and automatic performance tuning for optimal speed and power efficiency.\nThe distribution was primarily aimed at software developers, performance enthusiasts, and those working in cloud or server environments.\nIn an announcement to the Clear Linux forums, the team says the project will no longer receive security patches or any other updates. Therefore, its user base should migrate to other distributions for safety.\n\"Effective immediately, Intel will no longer provide security patches, updates, or maintenance for Clear Linux OS, and the Clear Linux OS GitHub repository will be archived in read-only mode,\"\nreads the announcement\n.\n\"So, if you're currently using Clear Linux OS, we strongly recommend planning your migration to another actively maintained Linux distribution as soon as possible to ensure ongoing security and stability.\"\nAlthough Intel has not officially explained why it's shutting down the project, it could be due to low user adoption coupled with a high maintenance burden.\nConsidering that Clear Linux OS relied on its own package management and update system, as it is not a fork of another distribution, it required substantial engineering resources to provide user support.\nAnother key point may be Intel's ongoing efforts to consolidate and\ntighten its operations\n, scaling back niche internal projects that don't provide strategic value, and focusing more on new targets, such as\nagentic AI\n.\nAlthough Clear Linux OS is now abandoned, the team behind it says it will remain invested in the Linux ecosystem and continue to provide Intel hardware optimizations that can be applied to other distributions and open-source software.\nIf you rely on Clear Linux OS, you are recommended to migrate to another distribution as soon as possible, as the lack of updates means the system will become vulnerable to flaws with known/public exploits in a short time.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nArch Linux pulls AUR packages that installed Chaos RAT malware\nHunters International ransomware shuts down, releases free decryptors\nCISA warns of attackers exploiting Linux flaw with PoC exploit\nNew Linux udisks flaw lets attackers get root on major Linux distros\nKali Linux 2025.2 released with 13 new tools, car hacking updates"
    },
    {
        "Title": "Ring denies breach after users report suspicious logins",
        "Link": "https://www.bleepingcomputer.com/news/security/ring-denies-breach-after-users-report-suspicious-logins/",
        "Summary": "Ring is warning that a backend update bug is responsible for customers seeing a surge in unauthorized devices logged into their account on May 28th. [...]",
        "Date": "2025-07-21",
        "Content": "Ring is warning that a backend update bug is responsible for customers seeing a surge in unauthorized devices logged into their account on May 28th.\nOn May 28th, many Ring customers reported seeing unusual devices logged into their accounts from various locations worldwide, leading them to believe their accounts had been hacked.\nLast week, Ring posted to Facebook stating that they are aware \"of a bug that incorrectly displays prior login dates as May 28, 2025.\"\nRing also updated its status page to say that these unauthorized logins are caused by a bug in a backend update that was released.\n\"We are aware of an issue where information is displaying inaccurately in Control Center,\"\nreads Ring's status page\n.\n\"This is the result of a backend update, and we're working to resolve this. We have no reason to believe this is the result of unauthorized access to customer accounts.\"\nThese false login entries were all\ndated May 28, 2025\n, which lends some weight to Rings statement that this was a backend issue rather than a global hacking incident.\nHowever, customers are not buying Ring's explanation, reporting that they saw unknown devices, strange IP addresses, and countries that they never visited listed in their Authorized Client Devices list, so they couldn't be previous logins.\n\"Absolute bollocks with your 'bug' I don't even know Derbhille or is she anyway associated with our ring camera or family? Just admit you've been hacked and yous are gonna amend this,\" a customer\nposted to X\n, while sharing a screenshot of login from a device named \"derbhile's iPhone.\"\n\"I find it interesting that it's just a \"bug\" yet one of my several unknown logins from that date was a log in from Spain… I'm in Texas so doesn't seem like just a bug or log ins on prior devices because I can assure you I have never been to Spain,\" another customer posted to Facebook.\nThe sense that Amazon is hiding an actual security incident is further enhanced by the fact that a backend update should be easy to reverse. Yet, three days later, people are still seeing logins from devices they don't recognize.\nTo make matters worse, some users report seeing live view activity during times when no one in the household has accessed the app, and others report not receiving\nsecurity alerts\nor multi-factor authentication prompts when new devices are added.\nUser reports on Facebook\nSource: BleepingComputer\nWhile this could be a bug displaying incorrect device names and logins, Ring should clearly state this, as it has instead stated that it was the user's previous logins.\nBleepingComputer contacted Ring to inquire about the situation and why people are seeing devices and countries that they have never owned or been to, and thus cant be previous logins.\nRing users should review authorized devices from the app's\nControl Center\n>\nAuthorized Client Devices\nsection. If any devices or logins are not recognized, they should be removed immediately.\nIt would also be prudent to change your account password and enable two-factor authentication from the Account Settings.\nBleepingComputer will update our story with any response we receive from Ring.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nHPE warns of hardcoded passwords in Aruba access points\nGigabyte motherboards vulnerable to UEFI malware bypassing Secure Boot\nNVIDIA shares guidance to defend GDDR6 GPUs against Rowhammer attacks\nHikvision Canada ordered to cease operations over security risks\nGet started in an Amazon dropshipping business with this course deal"
    },
    {
        "Title": "ExpressVPN bug leaked user IPs in Remote Desktop sessions",
        "Link": "https://www.bleepingcomputer.com/news/security/expressvpn-bug-leaked-user-ips-in-remote-desktop-sessions/",
        "Summary": "ExpressVPN has fixed a flaw in its Windows client that caused Remote Desktop Protocol (RDP) traffic to bypass the virtual private network (VPN) tunnel, exposing the users' real IP addresses. [...]",
        "Date": "2025-07-21",
        "Content": "ExpressVPN has fixed a flaw in its Windows client that caused Remote Desktop Protocol (RDP) traffic to bypass the virtual private network (VPN) tunnel, exposing the users' real IP addresses.\nOne of the key premises of a VPN is masking a user's IP address, allowing users to stay anonymous online, and in some cases, bypass censorship. Failing to do so is a severe technical failure for a VPN product.\nExpressVPN is a leading VPN service provider, consistently rated among the top VPN services, and used by millions worldwide. It utilizes RAM-only servers that don't retain user data and adheres to an audited no-logs policy.\nOn April 25, 2025, a security researcher known as \"Adam-X\" reported a vulnerability through ExpressVPN's bug bounty program that exposed RDP and other TCP traffic transmitted over port 3389.\nUpon investigating, the ExpressVPN team found that the issue was caused by remnants of debug code used for internal testing being mistakenly included in production builds, specifically, from 12.97 (released four months ago) to 12.101.0.2-beta.\n\"If a user established a connection using RDP, that traffic could bypass the VPN tunnel,\"\nreported ExpressVPN in an announcement\n.\n\"This did not affect encryption, but it meant that traffic from RDP connections wasn't routed through ExpressVPN as expected.\"\n\"As a result, an observer, like an ISP or someone on the same network, could have seen not only that the user was connected to ExpressVPN, but also that they were accessing specific remote servers over RDP—information that would normally be protected.\"\nA patch was made available with ExpressVPN version 12.101.0.45, released on June 18, 2025.\nThe privacy firm notes that the security lapse did not compromise encryption on the tunnels, and the leak scenarios only affect those using Remote Desktop Protocol (RDP), which they consider to be low-risk for their customers.\n\"As mentioned above, in practice, this issue would most commonly have affected users actively using RDP—a protocol that's generally not used by typical consumers,\" reads ExpressVPN's advisory.\n\"Given that ExpressVPN's user base is made up predominantly of individual users rather than enterprise customers, the number of affected users is likely small.\"\nRDP is a Microsoft network protocol that enables users to remotely control Windows systems over a network, used by IT administrators, remote workers, and enterprises.\nStill, it is recommended that users upgrade their Windows clients to version 12.101.0.45 for ultimate protection.\nExpressVPN states that it will strengthen its internal build checks to prevent similar bugs from being introduced in production in the future, including enhanced automation in development testing.\nLast year, ExpressVPN faced another issue causing\nDNS request leaks\nwhen users enabled the 'slipt tunneling' feature on the Windows client.\nThe feature was temporarily disabled until a fix was implemented in a future release.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nTop VPN services of 2025: A comprehensive guide\nIngram Micro outage caused by SafePay ransomware attack\nGet AdGuard’s VPN at a Black Friday price in July in this deal\nGermany asks Google, Apple to remove DeepSeek AI from app stores\nSonicWall warns of trojanized NetExtender stealing VPN logins"
    },
    {
        "Title": "Veeam Recovery Orchestrator users locked out after MFA rollout",
        "Link": "https://www.bleepingcomputer.com/news/technology/veeam-recovery-orchestrator-users-locked-out-after-mfa-rollout/",
        "Summary": "Veeam warned customers today that a recently released Recovery Orchestrator version blocks Web UI logins after enabling multi-factor authentication (MFA). [...]",
        "Date": "2025-07-21",
        "Content": "Veeam warned customers today that a recently released version of Recovery Orchestrator blocks Web UI logins after enabling multi-factor authentication (MFA).\nVeeam Recovery Orchestrator\n(VRO) is an automated disaster recovery and orchestration solution that helps organizations automate, document, test, and execute recovery plans in the event of disasters such as data loss, site failures, or ransomware attacks.\nAs the company explained in a Monday advisory, this known issue affects VRO build 7.2.1.286, which was available for download between July 8th and July 17th, and has been fixed with the release of version 7.2.1.290.\nWhile the new version addresses the MFA lockout issue, customers who installed the buggy VRO version are advised to contact technical support for assistance.\n\"After enabling MFA within Veeam Recovery Orchestrator, attempting to login to the Web UI is no longer possible. An issue was discovered in Veeam Recovery Orchestrator build 7.2.1.286 that can causes a lockout of the UI when MFA is enabled.\" Veeam\nexplains\n.\n\"Customers who installed Veeam Recovery Orchestrator build 7.2.1.286 should not install 7.2.1.290 or rollback their upgrade, and instead are encouraged to contact support for a fix to resolve this issue.\"\nVeeam is also\ninvestigating a known issue\nthat causes connection errors on Windows 11 24H2 systems when restoring from Veeam Recovery Media. While the root cause is not yet known, Veeam believes that the most likely cause is a change within the\nKB5051987 Windows 11 February update\n.\nAs the company explained in March when it acknowledged this bug, on affected systems, the Veeam Agent for Windows will display network connection failures\nwhen attempting\nto\nrestore files\nfrom a Veeam Backup & Replication backup server or an SMB network share.\nVeeam's products are used by over 550,000 customers worldwide, including 67% of Global 2,000 and 77% of all Fortune 500 companies.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nThreat actors downgrade FIDO2 MFA auth in PoisonSeed phishing attack\nThe MFA You Trust Is Lying to You – and Here's How Attackers Exploit It\nMicrosoft investigates ongoing SharePoint Online access issues\nMicrosoft asks users to ignore Windows Firewall config errors\nMicrosoft fixes ‘Print to PDF’ feature broken by Windows update"
    },
    {
        "Title": "Dior begins sending data breach notifications to U.S. customers",
        "Link": "https://www.bleepingcomputer.com/news/security/dior-begins-sending-data-breach-notifications-to-us-customers/",
        "Summary": "The House of Dior (Dior) is sending data breach notifications to U.S. customers informing them that a May cybersecurity incident compromised their personal information. [...]",
        "Date": "2025-07-21",
        "Content": "The House of Dior (Dior) is sending data breach notifications to U.S. customers informing them that a May cybersecurity incident compromised their personal information.\nDior is a French luxury fashion house, part of the LVMH (Moët Hennessy Louis Vuitton) group, which is the world's largest luxury conglomerate.\nThe Dior brand alone generates an annual revenue of over $12 billion, operating hundreds of boutiques worldwide.\nThe security incident occurred on January 26, 2025, but the company only became aware of it on May 7, 2025, launching internal investigations to determine its scope and impact.\n\"Our investigation determined that an unauthorized party was able to gain access to a Dior database that contained information about Dior clients on January 26, 2025,\" reads the\nnotice sent to affected individuals\n.\n\"Dior promptly took steps to contain the incident, and we have no evidence of subsequent unauthorized access to Dior systems.\"\nBased on the findings of the investigation, the following information has been exposed:\nFull names\nContact details\nPhysical address\nDate of birth\nPassport or government ID number (in some cases)\nSocial Security Number (in some cases)\nThe company clarifies that no payment details, such as bank account or payment card information, were contained in the compromised database, so this information remains safe.\nLaw enforcement was notified accordingly, while third-party cybersecurity experts were engaged to help contain the incident.\nRecipients of the data breach notification are advised to remain vigilant for scams and phishing attempts, and to closely monitor the activity in their financial accounts to identify and report any suspicious activity.\nMeanwhile, the letter encloses instructions on enrolling in a 24-month credit monitoring and identity theft protection package free of charge, redeemable until October 31, 2025.\nThe date of the incident matches that of a previous disclosure by Dior, which\nconfirmed impact in South Korea and China\n.\nLouis Vuitton, also a brand of the LVMH group,\nrecently disclosed a data breach\nthat impacted customers in the UK, South Korea, and Turkey.\nAlthough a spokesperson for the firm didn't respond to our requests for clarification, BleepingComputer learned that the incidents at Louis Vuitton and Dior were part of the same cyberattack.\nThe attack is believed to be linked to the ShinyHunters extortion group, which gained access to LVMH customer information by breaching a third-party vendor's database.\nIf that is the case, Louis Vuitton is likely to follow with a similar disclosure concerning U.S. customers.\nBleepingComputer has contacted Dior to learn how many U.S. customers were impacted, but we have not yet received a response.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nBitcoin Depot breach exposes data of nearly 27,000 crypto users\nIdeaLab confirms data stolen in ransomware attack last year\nQantas discloses cyberattack amid Scattered Spider aviation breaches\nHealthcare SaaS firm says data breach impacts 5.4 million patients\nHacker steals 1 million Cock.li user records in webmail data breach"
    },
    {
        "Title": "Over 1,000 CrushFTP servers exposed to ongoing hijack attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/over-1-000-crushftp-servers-exposed-to-ongoing-hijack-attacks/",
        "Summary": "Over 1,000 CrushFTP instances currently exposed online are vulnerable to hijack attacks that exploit a critical security bug, providing admin access to the web interface. [...]",
        "Date": "2025-07-21",
        "Content": "Over 1,000 CrushFTP instances currently exposed online are vulnerable to hijack attacks that exploit a critical security bug, providing admin access to the web interface.\nThe security vulnerability (\nCVE-2025-54309\n) is due to mishandled AS2 validation and impacts all CrushFTP versions below 10.8.5 and 11.3.4_23. The vendor\ntagged the flaw as actively exploited\nin the wild on July 19th, noting that attacks may have begun earlier, although it has yet to find evidence to confirm this.\n\"July 18th, 9AM CST there is a 0-day exploit seen in the wild. Possibly it has been going on for longer, but we saw it then. Hackers apparently reverse engineered our code and found some bug which we had already fixed,\" reads\nCrushFTP's advisory\n\"They are exploiting it for anyone who has not stayed current on new versions. As always we recommend regularly and frequent patching. Anyone who had kept up to date was spared from this exploit.\"\nHowever, CrushFTP added last week that servers that have been kept up to date are not vulnerable to attacks, stating that customers who use a demilitarized zone (DMZ) instance to isolate their main server aren't impacted by this vulnerability.\nThe company also recommends reviewing upload and download logs for unusual activity, as well as enabling automatic updates and whitelisting IPs for server and admin access to further mitigate exploitation attempts.\nAccording to scans from the security threat monitoring platform Shadowserver, approximately 1,040 CrushFTP instances\nremain unpatched against CVE-2025-54309\nand are vulnerable to attacks.\nUnpatched CrushFTP servers (Shadowserver)\nShadowServer is\nnow notifying\nCrushFTP customers that their servers are unprotected against ongoing CVE-2025-54309 exploitation, exposing their contents to data theft attempts.\nWhile it's unclear if these ongoing attacks deploy malware or were used for data theft, managed file transfer solutions like CrushFTP\nhave been high-value targets\nfor ransomware gangs in recent years.\nFor instance, the Clop cybercrime gang alone\nhas been linked to multiple data theft campaigns targeting zero-day flaws in\nAccelion FTA\n,\n​​​​​\nGoAnywhere MFT\n,\nMOVEit Transfer\n, and, most recently,\nCleo\nsoftware.\nOne year ago, in April 2024, CrushFTP also\npatched an actively exploited zero-day\n(tracked as CVE-2024-4040\n)\nthat allowed unauthenticated attackers to escape the user's virtual file system (VFS) and download system files.\nAt the time, the cybersecurity company CrowdStrike\nfound evidence\nthat the attacks, which targeted CrushFTP instances at multiple U.S. organizations and focused on intelligence gathering, were likely politically motivated.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nNew CrushFTP zero-day exploited in attacks to hijack servers\nMicrosoft SharePoint zero-day exploited in RCE attacks, no patch available\nPopular npm linter packages hijacked via phishing to drop malware\nHackers scanning for TeleMessage Signal clone flaw exposing passwords\nCitrix Bleed 2 exploited weeks before PoCs as Citrix denied attacks"
    },
    {
        "Title": "Learn 14 Languages from Babbel with this exclusive StackSocial deal",
        "Link": "https://www.bleepingcomputer.com/news/security/learn-14-languages-from-babbel-with-this-exclusive-stacksocial-deal/",
        "Summary": "Learning a new language doesn't have to mean night classes, bulky textbooks, or boring apps. With Babbel, you can pick up real-world conversation skills through short, fun, and practical lessons. And right now, you can get a lifetime subscription for only $159 (regularly $599). [...]",
        "Date": "2025-07-21",
        "Content": "Learning a new language doesn’t have to mean night classes, bulky textbooks, or boring apps. With Babbel, you can pick up real-world conversation skills through short, fun, and practical lessons. And right now, you can get a\nlifetime subscription\nfor only $159 (regularly $599).\nWhy Babbel?\nBabbel gives you lifetime access to lessons in 14 languages, including\nFrench\nSpanish\nGerman\nItalian\nPortuguese\nSwedish\nTurkish\nAnd that’s just a small sample. You’re not limited to just one either, so you can explore at your own pace and switch things up whenever you want. It’s a great option if you’re planning to travel, want to connect with family, or just enjoy learning something new.\nThe lessons are short and practical, focusing on real conversation rather than academic grammar drills. You’ll learn how to get around a city, order food, shop, and navigate basic social situations. Each lesson takes about 10 to 15 minutes, which makes it easy to work into your routine. You can squeeze one in during a lunch break or while you’re waiting for the pasta water to boil.\nOne of the coolest things Babbel does that many other platforms don’t is its AI conversation partner. You can practice speaking and get responses in real time in your chosen language, and Babbel’s speech recognition tool will even give you feedback. It’s an easy, low-pressure way to build confidence speaking out loud. There are also personalized review sessions to help you remember what you’ve learned and keep building from it.\nUse code LEARN by July 24 at 11:59 p.m. PT to get a\nBabbel lifetime subscription\nfor $159.\nPrices subject to change.\nDisclosure: This is a StackCommerce deal in partnership with BleepingComputer.com. In order to participate in this deal or giveaway you are required to register an account in our StackCommerce store. To learn more about how StackCommerce handles your registration information please see the\nStackCommerce Privacy Policy\n. Furthermore, BleepingComputer.com earns a commission for every sale made through StackCommerce.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nLast chance to get Babbel lifetime access with our exclusive coupon\nSpeak a new language in weeks with this Babbel deal\nLifetime access to Babbel language courses available via StackSocial\nLearn 150+ languages with this uTalk deal, the app aimed to make you fluent\nGet unlimited access to all Rosetta Stone languages in this deal"
    },
    {
        "Title": "Dell confirms breach of test lab platform by World Leaks extortion group",
        "Link": "https://www.bleepingcomputer.com/news/security/dell-confirms-breach-of-test-lab-platform-by-world-leaks-extortion-group/",
        "Summary": "A newly rebranded extortion gang known as \"World Leaks\" breached one of Dell's product demonstration platforms earlier this month and is now trying to extort the company into paying a ransom. [...]",
        "Date": "2025-07-21",
        "Content": "Update 7/21/25: Added that World Leaks has now leaked some of the stolen data.\nA newly rebranded extortion gang known as \"World Leaks\" breached one of Dell's product demonstration platforms earlier this month and is now trying to extort the company into paying a ransom.\nDell acknowledged the incident to BleepingComputer, confirming that the threat actor had breached its\nCustomer Solution Centers\nplatform, which is used to demonstrate Dell products and solutions to customers.\n\"A threat actor recently gained access to our Solution Center, an environment designed to demonstrate our products and test proofs-of-concept for Dell's commercial customers,\" Dell told BleepingComputer.\n\"It is intentionally separated from customer and partner systems, as well as Dell's networks and is not used in the provision of services to Dell customers.\"\n\"Data used in the solution center is primarily synthetic (fake) data, publicly available datasets used solely for product demonstration purposes or Dell scripts, systems data, non-sensitive information and testing outputs. Based on our ongoing investigation, the data obtained by the threat actor is primarily synthetic, publicly available or Dell systems/test data.\"\nWhile World Leaks likely believe it contains valuable data, as it includes sample medical data and financial information, this data is reportedly entirely fabricated. BleepingComputer has learned that the only legitimate data stolen in the attack is a very outdated contact list.\nThe Dell Customer Solution Centers are partitioned from the rest of Dell's customer-facing network and internal systems, with customers shown multiple warnings not to upload private data to the labs.\nBleepingComputer asked Dell how the company was breached, but was told it would not share this information as the breach is still under investigation. When asked about the ransom demand, Dell said it had nothing further to share.\nWorld Leaks is\na rebrand of the Hunters International ransomware\n, which shifted its focus away from file encryption toward pure data extortion.\nHunters International was launched in late 2023 as a ransomware operation and was flagged as a\npossible rebrand of Hive\ndue to code similarities.\nSince then, the threat actors have claimed over 280 attacks against organizations worldwide.\nIn January 2025, Hunters International rebranded as World Leaks, citing concerns that ransomware is no longer profitable and risky.\nInstead, the threat actors now focus on stealing data in extortion attacks, utilizing a custom-made data exfiltration tool.\nSince its launch, World Leaks has published data from 49 organizations on its data leak site. They have not listed Dell at this time.\nWorld Leaks affiliates are also\nlinked to the recent exploitation\nof end-of-life SonicWall SMA 100 devices, where threat actors installed a custom OVERSTEP rootkit.\nYutaka Sejiyama, a threat researcher at Macnica, told BleepingComputer that 10 out of the 46 companies posted on World Leaks' data leak site had been using an SMA 100.\nWorld Leaks publishes stolen data\nAfter publishing our story, World Leaks released samples of the stolen data, claiming to have exfiltrated 1.3 TB of data.\nDell entry on World Leaks site\nSource: BleepingComputer\nWhile BleepingComputer did not review all of the data, most of it appears to be configuration scripts, backups, and system data associated with various IT deployments on the platform.\nSome of this data does appear to contain passwords used internally when provisioning equipment, but there does not appear to be any sensitive corporate or customer data in the leaked files.\nBleepingComputer contacted Dell about the leak and will update our story if we hear back.\nThe Board Report Deck CISOs Actually Use\nCISOs know that getting board buy-in starts with a clear, strategic view of how cloud security drives business value.\nThis free, editable board report deck helps security leaders present risk, impact, and priorities in clear business terms. Turn security updates into meaningful conversations and faster decision-making in the boardroom.\nDownload the template to get started today\nRelated Articles:\nHunters International ransomware shuts down, releases free decryptors\nHunters International shifts from ransomware to pure data extortion\nRussian alcohol retailer WineLab closes stores after ransomware attack\nLouis Vuitton says regional data breaches tied to same cyberattack\nChinese hackers breached National Guard to steal network configurations"
    },
    {
        "Title": "Microsoft releases emergency patches for SharePoint RCE flaws exploited in attacks",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-releases-emergency-patches-for-sharepoint-rce-flaws-exploited-in-attacks/",
        "Summary": "Microsoft has released emergency SharePoint security updates for two zero-day vulnerabilities tracked as CVE-2025-53770 and CVE-2025-53771 that have compromised services worldwide in \"ToolShell\" attacks. [...]",
        "Date": "2025-07-21",
        "Content": "Microsoft has released emergency SharePoint security updates for two zero-day vulnerabilities tracked as CVE-2025-53770 and CVE-2025-53771 that have compromised services worldwide in \"ToolShell\" attacks.\nIn May, during the\nBerlin Pwn2Own hacking contest\n, researchers exploited a zero-day vulnerability chain called \"ToolShell,\" which enabled them to achieve remote code execution in Microsoft SharePoint.\nThese flaws were fixed as part of the\nJuly Patch Tuesday updates\n; however, threat actors were able to discover two zero-day vulnerabilities that bypassed Microsoft's patches for the previous flaws.\nUsing these flaws, the threat actors have been conducting\nToolShell attacks on SharePoint servers worldwide\n, impacting over 54 organizations so far.\nEmergency updates released\nMicrosoft has now rushed out emergency out-of-band security updates for Microsoft SharePoint Subscription Edition, SharePoint 2019, and SharePoint 2016 that fix both the\nCVE-2025-53770\nand\nCVE-2025-53771\nflaws.\n\"Yes, the update for CVE-2025-53770 includes more robust protections than the update for CVE-2025-49704. The update for CVE-2025-53771 includes more robust protections than the update for CVE-2025-49706,\" reads a note in Microsoft advisories.\nMicrosoft SharePoint admins should install the following security updates immediately, depending on the version:\nThe\nKB5002754 update\nfor Microsoft SharePoint Server 2019 Core and\nKB5002753\nfor the Microsoft SharePoint Server 2019 Language Pack.\nThe\nKB5002760 update\nfor Microsoft SharePoint Enterprise Server 2016 and\nKB5002759\nfor the Microsoft SharePoint Enterprise Server 2016 Language Pack.\nThe\nKB5002768 update\nfor Microsoft SharePoint Subscription Edition.\nAfter installing the updates,\nMicrosoft urges\nadmins to rotate the SharePoint machine keys using the following steps:\nSharePoint admins can rotate machine keys using one of the two methods below:\nManually via PowerShell\nTo update the machine keys for a web application using PowerShell and deploy them to a SharePoint farm:\nGenerate the machine key in PowerShell using\nSet-SPMachineKey -WebApplication <SPWebApplicationPipeBind>\n.\nDeploy the machine key to the farm in PowerShell using\nUpdate-SPMachineKey -WebApplication <SPWebApplicationPipeBind>\n.\nManually via Central Admin\nTrigger the Machine Key Rotation timer job by performing the following steps:\nNavigate to the\nCentral Administration\nsite.\nGo to\nMonitoring\n->\nReview job definition.\nSearch for\nMachine Key Rotation Job\nand select\nRun Now.\nAfter the rotation has completed,\nrestart IIS\non all SharePoint servers using iisreset.exe.\nIt is also advised to analyze your logs and file system for the presence of malicious files or attempts at exploitation.\nThis includes:\nCreation of C:\\PROGRA~1\\COMMON~1\\MICROS~1\\WEBSER~1\\16\\TEMPLATE\\LAYOUTS\\spinstall0.aspx file.\nIIS logs showing a POST request to _layouts/15/ToolPane.aspx?DisplayMode=Edit&a=/ToolPane.aspx and a HTTP referer of _layouts/SignOut.aspx.\nMicrosoft has shared the following Microsoft 365 Defender query to check if the spinstall0.aspx file was created on your server.\neviceFileEvents\r\n| where FolderPath has \"MICROS~1\\\\WEBSER~1\\\\16\\\\TEMPLATE\\\\LAYOUTS\"\r\n| where FileName =~ \"spinstall0.aspx\"\r\nor FileName has \"spinstall0\"\r\n| project Timestamp, DeviceName, InitiatingProcessFileName, InitiatingProcessCommandLine, FileName, FolderPath, ReportId, ActionType, SHA256\r\n| order by Timestamp desc\nIf the file exists, then a full investigation should be conducted on the breached server and your network to ensure the threat actors did not spread to other devices.\nUpdate 7/21/25: Added security update for SharePoint 2016 and updated PowerShell commands to use correct instructions.\nCloud Detection & Response for Dummies\nContain emerging threats in real time - before they impact your business.\nLearn how cloud detection and response (CDR) gives security teams the edge they need in this practical, no-nonsense guide.\nGet the Guide\nRelated Articles:\nMicrosoft SharePoint zero-day exploited in RCE attacks, no patch available\nMicrosoft July 2025 Patch Tuesday fixes one zero-day, 137 flaws\nMicrosoft June 2025 Patch Tuesday fixes exploited zero-day, 66 flaws\nWindows 10 KB5060533 cumulative update released with 7 changes, fixes\nNew CrushFTP zero-day exploited in attacks to hijack servers"
    },
    {
        "Title": "Malicious Implants Are Coming to AI Components, Applications",
        "Link": "https://www.darkreading.com/application-security/malicious-implants-ai-components-applications",
        "Summary": "A red teamer is publishing research next month about how weaknesses in modern security products lay the groundwork for stealthy implants in AI-powered applications.",
        "Date": "2025-07-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/malicious-implants-ai-components-applications"
    },
    {
        "Title": "Europol Sting Leaves Russian Cybercrime's 'NoName057(16)' Group Fractured",
        "Link": "https://www.darkreading.com/threat-intelligence/europol-sting-russian-cybercrime-noname05716",
        "Summary": "National authorities have issued seven arrest warrants in total relating to the cybercrime collective known as NoName057(16), which recruits followers to carry out DDoS attacks on perceived enemies of Russia.",
        "Date": "2025-07-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/europol-sting-russian-cybercrime-noname05716"
    },
    {
        "Title": "Microsoft Rushes Emergency Patch for Actively Exploited SharePoint 'ToolShell' Bug",
        "Link": "https://www.darkreading.com/remote-workforce/microsoft-rushes-emergency-fix-exploited-sharepoint-toolshell-flaw",
        "Summary": "Malicious actors already have already pounced on the zero-day vulnerability, tracked as CVE-2025-53770, to compromise US government agencies and other businesses in ongoing and widespread attacks.",
        "Date": "2025-07-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/microsoft-rushes-emergency-fix-exploited-sharepoint-toolshell-flaw"
    },
    {
        "Title": "Containment as a Core Security Strategy",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/containment-core-security-strategy",
        "Summary": "We cannot keep reacting to vulnerabilities as they emerge. We must assume the presence of unknown threats and reduce the blast radius that they can affect.",
        "Date": "2025-07-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/containment-core-security-strategy"
    },
    {
        "Title": "Microsoft Fix Targets Attacks on SharePoint Zero-Day",
        "Link": "https://krebsonsecurity.com/2025/07/microsoft-fix-targets-attacks-on-sharepoint-zero-day/",
        "Summary": "On Sunday, July 20, Microsoft Corp. issued an emergency security update for a vulnerability in SharePoint Server that is actively being exploited to compromise vulnerable organizations. The patch comes amid reports that malicious hackers have used the Sharepoint flaw to breach U.S. federal and state agencies, universities, and energy companies.",
        "Date": "2025-07-21",
        "Content": "On Sunday, July 20, Microsoft Corp. issued an emergency security update for a vulnerability in SharePoint Server that is actively being exploited to compromise vulnerable organizations. The patch comes amid reports that malicious hackers have used the SharePoint flaw to breach U.S. federal and state agencies, universities, and energy companies.\nImage: Shutterstock, by Ascannio.\nIn an advisory about the SharePoint security hole, a.k.a. CVE-2025-53770, Microsoft said it is aware of active attacks targeting on-premises SharePoint Server customers and exploiting vulnerabilities that were only partially addressed by the July 8, 2025 security update.\nThe Cybersecurity & Infrastructure Security Agency (CISA) concurred, saying CVE-2025-53770 is a variant on a flaw Microsoft patched earlier this month (CVE-2025-49706). Microsoft notes the weakness applies only to SharePoint Servers that organizations use in-house, and that SharePoint Online and Microsoft 365 are not affected.\nThe Washington Post reported on Sunday that the U.S. government and partners in Canada and Australia are investigating the hack of SharePoint servers, which provide a platform for sharing and managing documents. The Post reports at least two U.S. federal agencies have seen their servers breached via the SharePoint vulnerability.\nAccording to CISA, attackers exploiting the newly-discovered flaw are retrofitting compromised servers with a backdoor dubbed “ToolShell” that provides unauthenticated, remote access to systems. CISA said ToolShell enables attackers to fully access SharePoint content — including file systems and internal configurations — and execute code over the network.\nResearchers at Eye Security said they first spotted large-scale exploitation of the SharePoint flaw on July 18, 2025, and soon found dozens of separate servers compromised by the bug and infected with ToolShell. In a blog post, the researchers said the attacks sought to steal SharePoint server ASP.NET machine keys.\n“These keys can be used to facilitate further attacks, even at a later date,” Eye Security warned. “It is critical that affected servers rotate SharePoint server ASP.NET machine keys and restart IIS on all SharePoint servers. Patching alone is not enough. We strongly advise defenders not to wait for a vendor fix before taking action. This threat is already operational and spreading rapidly.”\nMicrosoft’s advisory says the company has issued updates for SharePoint Server Subscription Edition and SharePoint Server 2019, but that it is still working on updates for supported versions of SharePoint 2019 and SharePoint 2016.\nCISA advises vulnerable organizations to enable the anti-malware scan interface (AMSI) in SharePoint, to deploy Microsoft Defender AV on all SharePoint servers, and to disconnect affected products from the public-facing Internet until an official patch is available.\nThe security firm Rapid7 notes that Microsoft has described CVE-2025-53770 as related to a previous vulnerability — CVE-2025-49704, patched earlier this month — and that CVE-2025-49704 was part of an exploit chain demonstrated at the Pwn2Own hacking competition in May 2025. That exploit chain invoked a second SharePoint weakness — CVE-2025-49706 — which Microsoft unsuccessfully tried to fix in this month’s Patch Tuesday.\nMicrosoft also has issued a patch for a related SharePoint vulnerability — CVE-2025-53771; Microsoft says there are no signs of active attacks on CVE-2025-53771, and that the patch is to provide more robust protections than the update for CVE-2025-49706.\nThis is a rapidly developing story. Any updates will be noted with timestamps.\n\r\n         This entry was posted on Monday 21st of July 2025 10:45 AM \r\n         \nLast March, the FBI was tasked to review roughly 100,000 documents relating to the Epstein case. The spreadsheet detailing the number of times President Trump was mentioned was done in Excel on an internal SharePoint server. I’m wondering if it might have been vulnerable to compromise. https://www.muellershewrote.com/p/the-epstein-cover-up-at-the-fbi\nMaybe, but without chain of custody and documented handling, you couldn’t trust it to be legit.\nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "Iranian APT Targets Android Users With New Variants of DCHSpy Spyware",
        "Link": "https://www.securityweek.com/new-variants-of-dchspy-spyware-used-by-iranian-apt-to-target-android-users/",
        "Summary": "<p>Iranian APT MuddyWater has been using new versions of the DCHSpy Android surveillance tool since the beginning of the conflict with Israel.</p>\n<p>The post <a href=\"https://www.securityweek.com/new-variants-of-dchspy-spyware-used-by-iranian-apt-to-target-android-users/\">Iranian APT Targets Android Users With New Variants of DCHSpy Spyware</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/new-variants-of-dchspy-spyware-used-by-iranian-apt-to-target-android-users/"
    },
    {
        "Title": "Marketing, Law Firms Say Data Breaches Impact Over 200,000 People",
        "Link": "https://www.securityweek.com/marketing-law-firms-say-data-breaches-impact-over-200000-people/",
        "Summary": "<p>Cierant Corporation and Zumpano Patricios independently disclosed data breaches, each impacting more than 200,000 individuals.</p>\n<p>The post <a href=\"https://www.securityweek.com/marketing-law-firms-say-data-breaches-impact-over-200000-people/\">Marketing, Law Firms Say Data Breaches Impact Over 200,000 People</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/marketing-law-firms-say-data-breaches-impact-over-200000-people/"
    },
    {
        "Title": "Surveillance Firm Bypasses SS7 Protections to Retrieve User Location",
        "Link": "https://www.securityweek.com/surveillance-firm-bypasses-ss7-protections-to-retrieve-user-location/",
        "Summary": "<p>A surveillance company was caught using an SS7 bypass technique to trick wireless carriers into divulging users’ locations.</p>\n<p>The post <a href=\"https://www.securityweek.com/surveillance-firm-bypasses-ss7-protections-to-retrieve-user-location/\">Surveillance Firm Bypasses SS7 Protections to Retrieve User Location</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/surveillance-firm-bypasses-ss7-protections-to-retrieve-user-location/"
    },
    {
        "Title": "750,000 Impacted by Data Breach at The Alcohol & Drug Testing Service",
        "Link": "https://www.securityweek.com/750000-impacted-by-data-breach-at-the-alcohol-drug-testing-service/",
        "Summary": "<p>The Alcohol &#038; Drug Testing Service (TADTS) says personal information was stolen in a July 2024 ransomware attack.</p>\n<p>The post <a href=\"https://www.securityweek.com/750000-impacted-by-data-breach-at-the-alcohol-drug-testing-service/\">750,000 Impacted by Data Breach at The Alcohol &#038; Drug Testing Service</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/750000-impacted-by-data-breach-at-the-alcohol-drug-testing-service/"
    },
    {
        "Title": "Microsoft Patches ‘ToolShell’ Zero-Days Exploited to Hack SharePoint Servers",
        "Link": "https://www.securityweek.com/microsoft-patches-toolshell-zero-days-exploited-to-hack-sharepoint-servers/",
        "Summary": "<p>Microsoft has started releasing updates to fix the exploited SharePoint zero-days tracked as CVE-2025-53770 and CVE-2025-53771.</p>\n<p>The post <a href=\"https://www.securityweek.com/microsoft-patches-toolshell-zero-days-exploited-to-hack-sharepoint-servers/\">Microsoft Patches &#8216;ToolShell&#8217; Zero-Days Exploited to Hack SharePoint Servers</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/microsoft-patches-toolshell-zero-days-exploited-to-hack-sharepoint-servers/"
    },
    {
        "Title": "Exploited CrushFTP Zero-Day Provides Admin Access to Servers",
        "Link": "https://www.securityweek.com/exploited-crushftp-zero-day-provides-admin-access-to-servers/",
        "Summary": "<p>Hackers are exploiting a zero-day vulnerability in CrushFTP to gain administrative privileges on vulnerable servers via HTTPS.</p>\n<p>The post <a href=\"https://www.securityweek.com/exploited-crushftp-zero-day-provides-admin-access-to-servers/\">Exploited CrushFTP Zero-Day Provides Admin Access to Servers</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-07-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/exploited-crushftp-zero-day-provides-admin-access-to-servers/"
    },
    {
        "Title": "Tech Giant Dell Allegedly Hit by WorldLeaks Ransomware – 1.3 TB of Data at Risk",
        "Link": "https://dailydarkweb.net/tech-giant-dell-allegedly-hit-by-worldleaks-ransomware-1-3-tb-of-data-at-risk/",
        "Summary": "The notorious data extortion group known as WorldLeaks has allegedly breached the systems of Dell, the American multinational technology corporation. On their leak site, the group claims to have exfiltrated 1.3 terabytes of sensitive data and is now attempting to extort a ransom from the company to prevent its public release. This incident has placed [&#8230;]",
        "Date": "2025-07-21",
        "Content": "The notorious data extortion group known as WorldLeaks has allegedly breached the systems of Dell, the American multinational technology corporation. On their leak site, the group claims to have exfiltrated 1.3 terabytes of sensitive data and is now attempting to extort a ransom from the company to prevent its public release. This incident has placed Dell, a titan in the global computer and IT services industry, in the crosshairs of a significant cybersecurity event.\nDell is a household name and a critical supplier of technology solutions for millions of consumers, corporations, and government agencies worldwide. The alleged breach, publicized by a post from WorldLeaks, claims the theft of critical internal data. As proof of their intrusion, the attackers have shared a file list containing directory paths from what appear to be Dell’s internal servers across multiple geographic regions. The origin of the attack is the WorldLeaks group, a rebrand of the “Hunters International” operation that focuses solely on data theft and extortion.\nThe sample data provided by the threat actors suggests a wide range of information may have been compromised. An analysis of the file paths indicates the data could include:\nInternal IT backup files\nData from user directories\nConfiguration files for various systems\nSensor and system logs\nPotentially sensitive information related to company Proof-of-Concept (POC) projects\nIn a statement, Dell confirmed it was investigating an incident related to a test lab platform but stated it had not found evidence of a significant risk to customer data. The incident nevertheless underscores the growing trend of extortion-only attacks, where cybercriminals forgo ransomware encryption in favor of stealing and leveraging sensitive data for financial gain.\nTags:\nAlleged Attack\nCyberSecurity\ndata extortion\ndata-breach\nDell\nHunters International\nransomware\ntechnology\nWorldLeaks"
    },
    {
        "Title": "Parisian Tour Agency ‘Come to Paris’ Allegedly Breached – Admin Access for Sale",
        "Link": "https://dailydarkweb.net/parisian-tour-agency-come-to-paris-allegedly-breached-admin-access-for-sale/",
        "Summary": "A threat actor has allegedly put administrative access to the website of &#8220;Come to Paris&#8221; up for sale on a clandestine forum. Come to Paris is a prominent online travel agency that provides booking services for a wide range of Parisian attractions, including museums, monuments, cruises, and shows, making it a key platform for tourists [&#8230;]",
        "Date": "2025-07-21",
        "Content": "A threat actor has allegedly put administrative access to the website of “Come to Paris” up for sale on a clandestine forum. Come to Paris is a prominent online travel agency that provides booking services for a wide range of Parisian attractions, including museums, monuments, cruises, and shows, making it a key platform for tourists visiting the French capital. The asking price for exclusive access to the company’s backend systems is listed at $1,000.\nThe seller provided screenshots as proof of access, which appear to show a live administrative panel. One image reveals a customer database allegedly containing over 400,000 individual client records. The compromised information could be highly sensitive, potentially exposing a significant number of international and local tourists to risks such as identity theft and targeted phishing campaigns. This incident highlights the critical need for robust security measures, especially for companies handling large volumes of personal and travel-related data.\nBased on the evidence shared by the threat actor, the following customer information is allegedly accessible:\nFull Name\nE-mail Address\nTelephone Number\nLanguage\nCompany / Association\nFull Address (Street, Country, Postal Code, City)\nTags:\nadmin panel\nCome to Paris\nCyberSecurity\ndata-breach\nFrance\nhacked\ntourism"
    },
    {
        "Title": "Qilin Ransomware Allegedly Breaches Thai Manufacturer Adiantes",
        "Link": "https://dailydarkweb.net/qilin-ransomware-allegedly-breaches-thai-manufacturer-adiantes/",
        "Summary": "The Qilin ransomware group has allegedly targeted Adiantes, a prominent Thailand-based manufacturer specializing in premium sustainable leather goods. Formerly known as Krusell Thailand Co Ltd, Adiantes produces high-quality handmade items such as handbags and accessories for a diverse international clientele, with significant markets in Thailand, Japan, and Germany. The company is recognized for its bespoke [&#8230;]",
        "Date": "2025-07-21",
        "Content": "The Qilin ransomware group has allegedly targeted Adiantes, a prominent Thailand-based manufacturer specializing in premium sustainable leather goods. Formerly known as Krusell Thailand Co Ltd, Adiantes produces high-quality handmade items such as handbags and accessories for a diverse international clientele, with significant markets in Thailand, Japan, and Germany. The company is recognized for its bespoke product design and commitment to ethical production, making this alleged breach a potential threat to its operational integrity and client relationships.\nThreat actors have allegedly released a trove of sensitive data exfiltrated from the company’s systems. The leak appears to be comprehensive, exposing the inner workings of Adiantes’ business, from financial dealings to proprietary product information. The compromised data allegedly includes sensitive financial documents, detailed customer sales information, and the personal identification of at least one employee, highlighting a severe privacy and security failure. This incident could have significant repercussions, impacting not only Adiantes but also its international partners whose design and order information may now be exposed.\nThe allegedly leaked data includes:\nFinancial documents, including invoices, tax forms, and internal audit letters\nCustomer sales data, detailing orders, pricing, and profit margins\nConfidential product design specifications and technical drawings for clients\nProduction and inventory management spreadsheets\nEmployee Personally Identifiable Information (PII), including a national ID card\nTags:\nAdiantes\nCyberSecurity\ndata-leak\nKrusell\nManufacturing\nPII\nQilin\nransomware\nThailand"
    },
    {
        "Title": "HIV Patient Data from RS Polri Kramat Jati Allegedly For Sale on Dark Web",
        "Link": "https://dailydarkweb.net/hiv-patient-data-from-rs-polri-kramat-jati-allegedly-for-sale-on-dark-web/",
        "Summary": "A user on a dark web forum has allegedly posted a sensitive database belonging to the Indonesian National Police Hospital, also known as RS Polri Kramat Jati. The hospital, formally named Bhayangkara Hospital Level I R. Said Soekanto, is a major medical facility under the Indonesian National Police (Polri). It is considered a vital piece [&#8230;]",
        "Date": "2025-07-21",
        "Content": "A user on a dark web forum has allegedly posted a sensitive database belonging to the Indonesian National Police Hospital, also known as RS Polri Kramat Jati. The hospital, formally named Bhayangkara Hospital Level I R. Said Soekanto, is a major medical facility under the Indonesian National Police (Polri). It is considered a vital piece of national infrastructure, providing services to the general public and serving as the primary referral hospital for high-ranking government officials, including the president, ministers, and state guests.\nThe threat actor claims to have obtained a significant amount of highly confidential patient information from the hospital’s HIV/AIDS Information System. The alleged breach exposes the personal and medical records of thousands of patients, which could lead to severe privacy violations and personal distress. The origin of the data appears to be a direct compromise of the hospital’s systems, with the information now being offered on a notorious dark web forum known for trading in stolen data.\nThe data, allegedly stolen from the hospital, is categorized into two main files. The cybercriminal claims the leaked files contain:\nHIV Patient Personal Data (38,064 records)\nPatient Visit Data (2,133 records)\nTags:\nCyberSecurity\ndark web\ndata-breach\nHealthcare\nIndonesia\nNational Police"
    },
    {
        "Title": "Direwolf Ransomware Group Claims Attacks on Akribis Systems, Pergamon Status, Anadolu Hastaneleri, and Universidad Mayor",
        "Link": "https://dailydarkweb.net/direwolf-ransomware-group-claims-attacks-on-akribis-systems-pergamon-status-anadolu-hastaneleri-and-universidad-mayor/",
        "Summary": "The Direwolf ransomware group has allegedly claimed responsibility for cyberattacks against four international organizations, listing them on its dark web data leak site. The group is threatening to publish gigabytes of sensitive files and has reportedly already released initial data samples to validate their claims. The targeted entities come from diverse industries and locations, indicating [&#8230;]",
        "Date": "2025-07-21",
        "Content": "The Direwolf ransomware group has allegedly claimed responsibility for cyberattacks against four international organizations, listing them on its dark web data leak site. The group is threatening to publish gigabytes of sensitive files and has reportedly already released initial data samples to validate their claims. The targeted entities come from diverse industries and locations, indicating a broad and opportunistic attack campaign.\nThe victims allegedly targeted by the group are:\n🇸🇬\nAkribis Systems:\nA Singapore-based global designer and manufacturer of direct drive motors and high-precision positioning systems. The group claims to have exfiltrated 650 GB of data.\n🇹🇷\nAnadolu Hastaneleri:\nA prominent hospital and healthcare clinic group operating in Turkey. The attackers allegedly stole 240 GB of files, including patient data.\n🇨🇱\nUniversidad Mayor:\nA major private university located in Chile. The breach allegedly involves 50 GB of data, including the personal information of one million individuals.\n🇹🇷\nPergamon Status Dis Ticaret A S:\nA Turkish company operating in the banking and foreign trade finance industry. The group claims to have stolen 50 GB of critical financial data.\nAccording to the ransomware group’s timeline, sample files were published on July 20th. The group has set a deadline of July 30, 2025, for the full public release of all stolen documents if their ransom demands are not met. The data allegedly exfiltrated contains highly sensitive corporate, employee, and customer information across all victims.\nAllegedly Leaked Data from Akribis Systems:\nLegal and Financial Documents\nCustomer Information and Business Contracts\nDesign Drawings\nBank Transactions and Statements\nAccounting and Audit Files\nEmployment Contracts and Confidentiality Agreements\nAllegedly Leaked Data from Anadolu Hastaneleri:\nPatient Case Transaction Databases\nResource and Patient Case Data\nOther unspecified databases\nAllegedly Leaked Data from Universidad Mayor:\nMicrosoft SQL Server Data\nPersonal Information (Name, Home Address, Date Of Birth, Telephone Number)\nStudent Documents Data\nAllegedly Leaked Data from Pergamon Status Dis Ticaret A S:\nOracle Data\nFinancial Data\nImport And Export Data\nTax Data\nAudit Data\nTags:\nAkribis Systems\nAnadolu Hastaneleri\nChile\ncyberattack\nCyberSecurity\ndata-breach\ndata-leak\nDirewolf\nPergamon Status\nransomware\nSingapore\nTurkey\nUniversidad Mayor"
    }
]