[
    {
        "Title": "North Korean Hackers Spread Malware via Fake Crypto Firms and Job Interview Lures",
        "Link": "https://thehackernews.com/2025/04/north-korean-hackers-spread-malware-via.html",
        "Summary": "North Korea-linked threat actors behind the Contagious Interview have set up front companies as a way to distribute malware during the fake hiring process.\n\"In this new campaign, the threat actor group is using three front companies in the cryptocurrency consulting industry—BlockNovas LLC (blocknovas[.] com), Angeloper Agency (angeloper[.]com), and SoftGlide LLC (softglide[.]co)—to spread",
        "Date": "2025-04-25",
        "Content": "North Korea-linked threat actors behind the\nContagious Interview\nhave set up front companies as a way to distribute malware during the fake hiring process.\n\"In this new campaign, the threat actor group is using three front companies in the cryptocurrency consulting industry—BlockNovas LLC (blocknovas[.] com), Angeloper Agency (angeloper[.]com), and SoftGlide LLC (softglide[.]co)—to spread malware via 'job interview lures,\" Silent Push\nsaid\nin a deep-dive analysis.\nThe activity, the cybersecurity company said, is being used to distribute three different known malware families,\nBeaverTail, InvisibleFerret\n, and\nOtterCookie\n.\nContagious Interview is one of the several job-themed social engineering campaigns orchestrated by North Korea to entice targets into downloading cross-platform malware under the pretext of coding assignment or fixing an issue with their browser when turning on camera during a video assessment.\nThe activity is tracked by the broader cybersecurity community under the monikers CL-STA-0240, DeceptiveDevelopment, DEV#POPPER, Famous Chollima, UNC5342, and Void Dokkaebi.\nThe use of front companies for malware propagation, complemented by setting up fraudulent accounts on Facebook, LinkedIn, Pinterest, X, Medium, GitHub, and GitLab, marks a new escalation for the threat actors, who have been observed using various job boards to lure victims.\n\"The BlockNovas front company has 14 people allegedly working for them, however many of the employee personas [...] appear to be fake,\" Silent Push said. \"When viewing the 'About Us' page of blocknovas[.]com via the Wayback Machine, the group claimed to have been operating for '12+ years' – which is 11 years longer than the business has been registered.\"\nThe attacks lead to the deployment of a JavaScript stealer and loader called BeaverTail, which is then used to drop a Python backdoor referred to as InvisibleFerret that can establish persistence on Windows, Linux, and macOS hosts. Select infection chains have also been found to serve another malware codenamed OtterCookie via the same JavaScript payload used to launch BeaverTail.\nBlockNovas has been observed leveraging video assessments to distribute\nFROSTYFERRET and GolangGhost\nusing ClickFix-related lures, a tactic that was detailed earlier this month by Sekoia, which is tracking the activity under the name ClickFake Interview.\nBeaverTail is configured to contact an external server (\"lianxinxiao[.]com\") for command-and-control (C2) to serve InvisibleFerret as the follow-up payload. It comes with various features to harvest system information, launch a reverse shell, download additional modules to steal browser data, files, and initiate the installation of the AnyDesk remote access software.\nFurther analysis of the malicious infrastructure has revealed the presence of a \"Status Dashboard\" hosted on one of BlockNovas' subdomains to maintain visibility into four of their domains: lianxinxiao[.]com, angeloperonline[.]online, and softglide[.]co.\nA separate subdomain, mail.blocknovas[.]com domain, has also been found to be hosting an open-source, distributed password cracking management system called\nHashtopolis\n. The\nfake recruitment drives\nhave led to at least one developer getting their MetaMask wallet\nallegedly compromised\nin September 2024.\nThat's not all. The threat actors also appear to be hosting a tool named Kryptoneer on the domain attisscmo[.]com that offers the ability to connect to cryptocurrency wallets such as Suiet Wallet, Ethos Wallet, and Sui Wallet.\n\"It's possible that North Korean threat actors have made additional efforts to target the Sui blockchain, or this domain may be used within job application processes as an example of the 'crypto project' being worked on,\" Silent Push said.\nBlockNovas, according to an independent report published by Trend Micro, also advertised in December 2024 an open position for a senior software engineer on LinkedIn, specifically targeting Ukrainian IT professionals.\nAs of April 23, 2025, the BlockNovas domain has been seized by the U.S. Federal Bureau of Investigation (FBI) as part of a law enforcement action against North Korean cyber actors for using it to \"deceive individuals with fake job postings and distribute malware.\"\nBesides using services like\nAstrill VPN\nand residential proxies to obfuscate their infrastructure and activities, a noteworthy aspect of the malicious activity is the use of artificial intelligence (AI)-powered tools like Remaker to create profile pictures.\nThe cybersecurity company, in its analysis of the Contagious Interview campaign, said it identified five Russian IP ranges that have been used to carry out the operation. These IP addresses are obscured by a VPN layer, a proxy layer, or an RDP layer.\n\"The Russian IP address ranges, which are concealed by a large anonymization network that uses commercial VPN services, proxy servers, and numerous VPS servers with RDP, are assigned to two companies in Khasan and Khabarovsk,\" security researchers Feike Hacquebord and Stephen Hilt\nsaid\n.\n\"Khasan is a mile from the North Korea-Russia border, and Khabarovsk is known for its economic and cultural ties with North Korea.\"\nIf Contagious Interview is one side of the coin, the other is the fraudulent IT worker threat known as\nWagemole\n, which refers to a tactic that involves crafting fake personas using AI to get their IT workers hired remotely as employees at major companies.\nThese efforts have dual motivations, designed to steal sensitive data and pursue financial gain by funneling a chunk of the monthly salaries back to the Democratic People's Republic of Korea (DPRK).\n\"Facilitators are now using GenAI-based tools to optimize every step in the process of applying and interviewing for roles and to aid DPRK nationals attempting to maintain this employment,\" Okta\nsaid\n.\n\"These GenAI-enhanced services are required to manage the scheduling of job interviews with multiple DPRK candidate personas by a small cadre of facilitators. These services use GenAI in everything from tools that transcribe or summarize conversations, to real-time translation of voice and text.\"\nTelemetry data gathered by Trend Micro points to the Pyongyang-aligned threat actors working from China, Russia, and Pakistan, while using the Russian IP ranges to connect to dozens of VPS servers over RDP and then perform tasks like interacting on job recruitment sites and accessing cryptocurrency-related services.\n\"Given that a significant portion of the deeper layers of the North Korean actors' anonymization network is in Russia, it is plausible, with low to medium confidence, that some form of intentional cooperation or infrastructure sharing exists between North Korea and Russian entities,\" the company said.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "New Critical SAP NetWeaver Flaw Exploited to Drop Web Shell, Brute Ratel Framework",
        "Link": "https://thehackernews.com/2025/04/sap-confirms-critical-netweaver-flaw.html",
        "Summary": "Threat actors are likely exploiting a new vulnerability in SAP NetWeaver to upload JSP web shells with the goal of facilitating unauthorized file uploads and code execution.&nbsp;\n\"The exploitation is likely tied to either a previously disclosed vulnerability like CVE-2017-9844 or an unreported remote file inclusion (RFI) issue,\" ReliaQuest said in a report published this week.\nThe cybersecurity",
        "Date": "2025-04-25",
        "Content": "Threat actors are likely exploiting a new vulnerability in SAP NetWeaver to upload JSP web shells with the goal of facilitating unauthorized file uploads and code execution.\n\"The exploitation is likely tied to either a previously disclosed vulnerability like\nCVE-2017-9844\nor an unreported remote file inclusion (RFI) issue,\" ReliaQuest\nsaid\nin a report published this week.\nThe cybersecurity said the possibility of a zero-day stems from the fact that several of the impacted systems were already running the latest patches.\nThe flaw is assessed to be rooted in the \"/developmentserver/metadatauploader\" endpoint in the NetWeaver environment, enabling unknown threat actors to upload malicious JSP-based web shells in the \"servlet_jsp/irj/root/\" path for persistent remote access and deliver additional payloads.\nPut differently, the lightweight JSP web shell is configured to upload unauthorized files, enable entrenched control over the infected hosts, execute remote code, and siphon sensitive data.\nSelect incidents have been observed using the\nBrute Ratel C4\npost-exploitation framework, as well as a well-known technique called\nHeaven's Gate\nto bypass endpoint protections.\nAt least in one case, the threat actors took several days to progress from successful initial access to follow-on exploitation, raising the possibility that the attacker may be an initial access broker (IAB) that's obtaining and selling access to other threat groups on underground forums.\n\"Our investigation revealed a troubling pattern, suggesting that adversaries are leveraging a known exploit and pairing it with a mix of evolving techniques to maximize their impact,\" ReliaQuest said.\n\"SAP solutions are often used by government agencies and enterprises, making them high-value targets for attackers. As SAP solutions are often deployed on-premises, security measures for these systems are left to users; updates and patches that are not applied promptly are likely to expose these systems to greater risk of compromise.\"\nCoincidentally, SAP has also\nreleased\nan update to address a maximum severity security flaw (CVE-2025-31324, CVSS score: 10.0) that an attacker could exploit to upload arbitrary files.\n\"SAP NetWeaver Visual Composer Metadata Uploader is not protected with a proper authorization, allowing an unauthenticated agent to upload potentially malicious executable binaries that could severely harm the host system,\" an\nadvisory\nfor the vulnerability reads.\nIt's likely that CVE-2025-31324 refers to the same unreported security defect given that the former also affects the metadata uploader component.\nThe disclosure comes a little over a month after the U.S. Cybersecurity and Infrastructure Security Agency (CISA)\nwarned\nof active exploitation of another high-severity NetWeaver flaw (CVE-2017-12637) that could allow an attacker to obtain sensitive SAP configuration files.\nUpdate\nReliaQuest has confirmed to The Hacker News that the malicious activity detailed above is indeed leveraging a new security vulnerability that's now being tracked as CVE-2025-31324.\n\"This vulnerability, which we identified during our investigation published on April 22, 2025, was initially suspected to be a remote file inclusion (RFI) issue,\" the company said. \"However, SAP later confirmed it as an unrestricted file upload vulnerability, allowing attackers to upload malicious files directly to the system without authorization.\"\nIn a separate report, SAP security firm Onapsis said the vulnerability is exploitable through HTTP/HTTPS, allowing attackers to send carefully crafted POST requests targeting the \"/developmentserver/metadatauploader\" endpoint without requiring any authentication.\n\"Exploitation happens via a POST request to the vulnerable component,\" Onapsis CTO JP Perez-Etchegoyen\nsaid\n. \"Upon successful exploitation, threat actors are able to upload arbitrary files. Threat actors have been observed uploading web shells to vulnerable systems.\"\nThe web shells grant the threat actor the ability to execute arbitrary commands in system context, with the privileges of the <sid>adm Operating System user, giving them full access to all SAP resources. The attacks have not been attributed to a specific threat group.\n\"With <sid>adm access, the attacker gains unauthorized access to the underlying SAP Operating System using the user and privileges of the processes running in the SAP Application Server, implying full access to any SAP resource, including the SAP system database without any restrictions, permitting them to take several actions,\" the company added.\nUsers are advised to check for the presence of the following indicators of compromise (IoCs) to determine if they have been affected -\nC:\\usr\\sap\\<SID>\\<InstanceID>\\j2ee\\cluster\\apps\\sap.com\\irj\\servlet_jsp\\irj\\root\nC:\\usr\\sap\\<SID>\\<InstanceID>\\j2ee\\cluster\\apps\\sap.com\\irj\\servlet_jsp\\irj\\work\nC:\\usr\\sap\\<SID>\\<InstanceID>\\j2ee\\cluster\\apps\\sap.com\\irj\\servlet_jsp\\irj\\work\\sync\nProjectDiscovery has released\ntwo\nnuclei templates\nto detect CVE-2025-31324 so as to verify if users are vulnerable or not and also determine if their instances are compromised by the JSP web shell backdoor used by threat actors.\n(The story was updated after publication to confirm the exploitation of a new zero-day flaw and additional details shared by Onapsis.)\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Why NHIs Are Security's Most Dangerous Blind Spot",
        "Link": "https://thehackernews.com/2025/04/why-nhis-are-securitys-most-dangerous.html",
        "Summary": "When we talk about identity in cybersecurity, most people think of usernames, passwords, and the occasional MFA prompt. But lurking beneath the surface is a growing threat that does not involve human credentials at all, as we witness the exponential growth of Non-Human Identities (NHIs).&nbsp;\nAt the top of mind when NHIs are mentioned, most security teams immediately think of Service Accounts.",
        "Date": "2025-04-25",
        "Content": "When we talk about identity in cybersecurity, most people think of usernames, passwords, and the occasional MFA prompt. But lurking beneath the surface is a growing threat that does not involve human credentials at all, as we witness the exponential growth of Non-Human Identities (NHIs).\nAt the top of mind when NHIs are mentioned, most security teams immediately think of\nService Accounts\n. But NHIs go far beyond that. You've got\nService Principals\n,\nSnowflake Roles\n,\nIAM Roles\n, and platform-specific constructs from AWS, Azure, GCP, and more. The truth is, NHIs can vary just as widely as the services and environments in your modern tech stack, and managing them means understanding this diversity.\nThe real danger lies in how these identities authenticate.\nSecrets: The Currency of Machines\nNon-Human Identities, for the most part, authenticate using\nsecrets\n: API keys, tokens, certificates, and other credentials that grant access to systems, data, and critical infrastructure. These secrets are what attackers want most. And shockingly, most companies have no idea how many secrets they have, where they're stored, or who is using them.\nThe\nState of Secrets Sprawl 2025\nrevealed two jaw-dropping stats:\n23.7 million\nnew secrets were leaked on public GitHub in 2024 alone\nAnd\n70%\nof the secrets leaked in 2022 are\nstill valid today\nWhy is this happening?\nA part of the story is that\nthere's no MFA for machines\n. No verification prompt. When a developer creates a token, they often grant it wider access than needed, just to make sure things work.\nExpiration dates? Optional. Some secrets are created with 50-year validity windows. Why? Because teams don't want the app to break next year. They choose speed over security.\nThis creates a massive blast radius. If one of those secrets leaks, it can unlock everything from production databases to cloud resources, without triggering any alerts.\nDetecting compromised NHIs is much harder than with humans. A login from Tokyo at 2 am might raise red flags for a person, but machines talk to each other 24/7 from all over the world.\nMalicious activity blends right in\n.\nMany of these secrets act like invisible backdoors, enabling lateral movement, supply chain attacks, and undetected breaches.\nThe Toyota incident\nis a perfect example — one leaked secret can take down a global system.\nThis is why\nattackers love NHIs and their secrets\n. The permissions are too often high, the visibility is commonly low, and the consequences can be huge.\nThe Rise of the Machines (and Their Secrets)\nThe shift to cloud-native, microservices-heavy environments has introduced\nthousands\nof NHIs per organization. NHIs now outnumber human identities from\n50:1 to a 100:1\nratio, and this is only expected to increase. These digital workers connect services, automate tasks, and drive AI pipelines — and every single one of them needs secrets to function.\nBut unlike human credentials:\nSecrets are hardcoded in codebases\nShared across multiple tools and teams\nLying dormant in legacy systems\nPassed to AI agents with minimal oversight\nThey often\nlack expiration\n,\nownership\n, and\nauditability\n.\nThe result? Secrets sprawl. Overprivileged access. And one tiny leak away from a massive breach.\nWhy the Old Playbook Doesn't Work Anymore\nLegacy identity governance and PAM tools were built for human users, an era when everything was centrally managed. These tools still do a fine job enforcing password complexity, managing break-glass accounts, and governing access to internal apps. But NHIs break this model completely.\nHere's why:\nIAM and PAM\nare designed for human identities, often tied to individuals and protected with MFA. NHIs, on the other hand, are decentralized — created and managed by developers across teams, often outside of any central IT or security oversight. Many organizations today are running multiple vaults, with no unified inventory or policy enforcement.\nSecrets Managers\nhelp you store secrets — but they won't help you when secrets are leaked across your infrastructure, codebases, CI/CD pipelines, or even public platforms like GitHub or Postman. They're not designed to detect, remediate, or investigate exposure.\nCSPM tools\nfocus on the cloud, but secrets are everywhere. They're in source control management systems, messaging platforms, developer laptops, and unmanaged scripts. When secrets leak, it's not just a hygiene issue — it's a\nsecurity incident\n.\nNHIs don't follow traditional identity lifecycles\n. There's often no onboarding, no offboarding, no clear owner, and no expiration. They linger in your systems, under the radar, until something goes wrong.\nSecurity teams are left chasing shadows, manually trying to piece together where a secret came from, what it accesses, and whether it's even still in use. This reactive approach doesn't scale, and it leaves your organization dangerously exposed.\nThis is where\nGitGuardian NHI Governance\ncomes into play.\nGitGuardian NHI Governance: Mapping the Machine Identity Maze\nGitGuardian has taken its deep expertise in secrets detection and remediation and turned it into something much more powerful: a complete governance layer for machine identities and their credentials.\nHere's what makes it stand out:\nA Map for the Mess\nThink of it as an end-to-end\nvisual graph\nof your entire secrets landscape. The map connects the dots between:\nWhere secrets are stored (e.g., HashiCorp Vault, AWS Secrets Manager)\nWhich services consume them\nWhat systems do they access\nWho owns them\nWhether they've been leaked internally or used in public code\nFull Lifecycle Control\nNHI Governance goes beyond visibility. It enables\ntrue lifecycle management\nof secrets — tracking their creation, usage, rotation, and revocation.\nSecurity teams can:\nSet automated rotation policies\nDecommission unused/orphaned credentials\nDetect secrets that haven't been accessed in months (aka zombie credentials)\nSecurity and Compliance, Built In\nThe platform also includes a\npolicy engine\nthat helps teams enforce consistent controls across all vaults and benchmark themselves against standards like\nOWASP Top 10\n.\nYou can track:\nVault coverage across teams and environments\nSecrets hygiene metrics (age, usage, rotation frequency)\nOverprivileged NHIs\nCompliance posture drifts over time\nAI Agents: The New Wild West\nA big driver of this risk is\nRAG (Retrieval-Augmented Generation)\n, where AI answers questions using your internal data. It's useful, but if secrets are hiding in that data, they can be surfaced by mistake.\nAI agents are being plugged into everything — Slack, Jira, Confluence, internal docs — to unlock productivity. But with each new connection, the risk of\nsecret sprawl\ngrows.\nSecrets aren't just leaking from code anymore. They show up in docs, tickets, messages, and when AI agents access those systems, they can accidentally expose credentials in responses or logs.\nWhat can go wrong?\nSecrets stored in Jira, Notion, Slack, etc, are getting leaked\nAI logs capturing sensitive inputs and outputs\nDevs and third-party vendors storing unsanitized logs\nAccess control breakdowns across systems\nOne of the most forward-looking aspects of the GitGuardian platform is that it can help fix AI-driven secret sprawl:\nScans all connected sources — including messaging platforms, tickets, wikis, and internal apps — to detect secrets that might be exposed to AI\nShows you where AI agents are accessing data, and flags unsafe paths that could lead to leaks\nCleans up logs, removing secrets before they get stored or passed around in ways that put the organization at risk\nAI is moving fast.\nBut secrets are leaking faster.\nThe Bottom Line: You Can't Defend What You Don't Govern\nWith NHI Governance, GitGuardian is offering a blueprint for organizations to bring order to chaos and control to an identity layer that's long been left in the dark.\nWhether you're trying to:\nMap out your secrets ecosystem\nMinimize attack surface\nEnforce zero trust principles across machines\nOr just sleep better at night\nThe GitGuardian platform might just be your new best friend.\nBecause in a world where identities\nare\nthe perimeter,\nignoring non-human identities is no longer an option\n.\nWant to see NHI Governance in action?\nRequest a Demo\nor check out the\nfull product overview\nat GitGuardian.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Researchers Identify Rack::Static Vulnerability Enabling Data Breaches in Ruby Servers",
        "Link": "https://thehackernews.com/2025/04/researchers-identify-rackstatic.html",
        "Summary": "Cybersecurity researchers have disclosed three security flaws in the Rack Ruby web server interface that, if successfully exploited, could enable attackers to gain unauthorized access to files, inject malicious data, and tamper with logs under certain conditions.\nThe vulnerabilities, flagged by cybersecurity vendor OPSWAT, are listed below -\n\nCVE-2025-27610 (CVSS score: 7.5) - A path traversal",
        "Date": "2025-04-25",
        "Content": "Cybersecurity researchers have disclosed three security flaws in the\nRack\nRuby web server interface that, if successfully exploited, could enable attackers to gain unauthorized access to files, inject malicious data, and tamper with logs under certain conditions.\nThe vulnerabilities,\nflagged\nby cybersecurity vendor OPSWAT, are listed below -\nCVE-2025-27610\n(CVSS score: 7.5) - A path traversal vulnerability that could be used to gain access to all files under the specified root: directory, assuming an attacker can determine the paths to those files\nCVE-2025-27111\n(CVSS score: 6.9) - An improper neutralization of carriage return line feeds (\nCRLF\n) sequences and improper output neutralization for logs vulnerability that could be used to manipulate log entries and distort log files\nCVE-2025-25184\n(CVSS score: 5.7) - An improper neutralization of carriage return line feeds (CRLF) sequences and improper output neutralization for logs vulnerability that could be used to manipulate log entries and inject malicious data\nSuccessful exploitation of the flaws could permit an attacker to obscure attack traces, read arbitrary files, and inject malicious code.\n\"Among these vulnerabilities, CVE-2025-27610 is particularly severe, as it could enable unauthenticated attackers to retrieve sensitive information, including configuration files, credentials, and confidential data, thereby leading to data breaches,\" OPSWAT said in a report shared with The Hacker News.\nThe shortcoming stems from the fact that\nRack::Static\n, a middleware that's used to serve static content like JavaScript, stylesheets, and images, does not sanitize user-supplied paths before serving files, leading to a scenario where an attacker can provide a specially crafted path to access files outside of the static file directory.\n\"Specifically, when the :root parameter is not explicitly defined, Rack defaults this value to the current working directory by assigning it the value of Dir.pwd, implicitly designating it as the web root directory for the Rack application,\" OPSWAT said.\nAs a result, if the :root option is either undefined or misconfigured relative to the :urls option, an unauthenticated attacker could weaponize CVE-2025-27610 through path traversal techniques to access sensitive files outside the intended web directory.\nTo mitigate the risk posed by the flaw, it's advised to update to the latest version. If immediate patching is not an option, it's recommended to remove usage of Rack::Static, or ensure that root: points at a directory path that only contains files that should be accessed publicly.\nCritical Flaw in Infodraw Media Relay Service\nThe disclosure comes as a critical security defect has been unearthed in the Infodraw Media Relay Service (MRS) that allows reading or deletion of arbitrary files via a path traversal vulnerability (CVE-2025-43928, CVSS score: 9.8) in the username parameter in the login page of the system.\nInfodraw is an Israeli maker of mobile video surveillance solutions that are used to transmit audio, video, and GPS data over telecommunications networks. According to the\ncompany's website\n, its devices are used by law enforcement, private investigations, fleet management, and public transport in many countries.\n\"A trivial Path Traversal vulnerability allows it to read out any file from systems for unauthenticated attackers,\" security researcher Tim Philipp Schäfers said in a statement shared with The Hacker News. \"Furthermore an 'Arbitrary File Deletion Vulnerability' exists that allows attackers to delete any file from the system.\"\nThe flaw, which enables login with a username like \"../../../../,\" affects both Windows and Linux versions of MRS. That said, the security defect continues to remain unpatched. Vulnerable systems in Belgium and Luxembourg have been taken offline following responsible disclosure.\n\"Affected organizations are primarily advised to take the application offline immediately (since, despite early warnings, no manufacturer patch is available, and it is considered possible that the vulnerability will be exploited by malicious actors in the near future),\" Philipp Schäfers\nsaid\n.\n\"If this is not possible, systems should be further protected with additional measures (such as using a VPN or specific IP unlocking).\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "DslogdRAT Malware Deployed via Ivanti ICS Zero-Day CVE-2025-0282 in Japan Attacks",
        "Link": "https://thehackernews.com/2025/04/dslogdrat-malware-deployed-via-ivanti.html",
        "Summary": "Cybersecurity researchers are warning about a new malware called DslogdRAT that's installed following the exploitation of a now-patched security flaw in Ivanti Connect Secure (ICS).\nThe malware, along with a web shell, were \"installed by exploiting a zero-day vulnerability at that time, CVE-2025-0282, during attacks against organizations in Japan around December 2024,\" JPCERT/CC researcher Yuma",
        "Date": "2025-04-25",
        "Content": "Cybersecurity researchers are warning about a new malware called DslogdRAT that's installed following the exploitation of a now-patched security flaw in Ivanti Connect Secure (ICS).\nThe malware, along with a web shell, were \"installed by exploiting a zero-day vulnerability at that time, CVE-2025-0282, during attacks against organizations in Japan around December 2024,\" JPCERT/CC researcher Yuma Masubuchi\nsaid\nin a report published Thursday.\nCVE-2025-0282\nrefers to a critical security flaw in ICS that could allow unauthenticated remote code execution. It was addressed by Ivanti in early January 2025.\nHowever, the shortcoming has been exploited as a zero-day by a China-nexus cyber espionage group dubbed UNC5337 to deliver the SPAWN ecosystem of malware, as well as other tools like DRYHOOK and PHASEJAM. The deployment of the latter two malware strains has not been attributed to any known threat actor.\nSince then, both JPCERT/CC and the U.S. Cybersecurity and Infrastructure Security Agency (CISA) have revealed the exploitation of the same vulnerability to deliver updated versions of SPAWN called\nSPAWNCHIMERA\nand\nRESURGE\n.\nEarlier this month, Google-owned Mandiant also\nrevealed\nthat another security flaw in ICS (CVE-2025-22457) has been weaponized to distribute SPAWN, a malware attributed to another Chinese hacking group referred to as UNC5221.\nJPCERT/CC said it's currently not clear if the attacks using DslogdRAT is part of the same campaign involving the SPAWN malware family operated by UNC5221.\nThe attack sequence outlined by the agency entails the exploitation of CVE-2025-0282 to deploy a Perl web shell, which then serves as a conduit to deploy additional payloads, including DslogdRAT.\nDslogdRAT, for its part, initiates contact with an external server over a socket connection to send basic system information and awaits further instructions that allow it to execute shell commands, upload/download files, and use the infected host as a proxy.\nThe disclosure comes as threat intelligence firm GreyNoise\nwarned\nof a \"9X spike in suspicious scanning activity\" targeting ICS and Ivanti Pulse Secure (IPS) appliances from more than\n270 unique IP addresses\nin the past 24 hours and over\n1,000 unique IP addresses\nin the last 90 days.\nOf these 255 IP addresses have been classified as malicious and 643 have been flagged as suspicious. The malicious IPs have been observed using TOR exit nodes and suspicious IPs are linked to lesser-known hosting providers. The United States, Germany, and the Netherlands account for the top three source countries.\n\"This surge may indicate coordinated reconnaissance and possible preparation for future exploitation,\" the company said. \"While no specific CVEs have been tied to this scanning activity yet, spikes like this often precede active exploitation.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Windows 11's Recall AI is now rolling out on Copilot+ PCs",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-11s-recall-ai-is-now-rolling-out-on-copilot-plus-pcs/",
        "Summary": "Microsoft has confirmed that Windows Recall is rolling out to everyone with Windows 11 KB5055627 on Copilot+ PCs. [...]",
        "Date": "2025-04-25",
        "Content": "Microsoft has\nconfirmed\nthat Windows Recall is rolling out to everyone with Windows 11 KB5055627 on Copilot+ PCs.\nRecall is an AI-powered feature that captures your screen, so you can quickly find and jump back into what you have seen before on your PC.\nAs Microsoft\ndescribes\n, you can use Recall to \"recall\" the moment you saw on your PC.\nWindows Recall UI\nFor example, if you were working on a PowerPoint presentation on financial operations, but you don't remember the name of the .ppt, you can use everyday language to describe the file, and Recall will find it for you.\nRecall is able to find a photo, link, or message because it sees everything you can see on the screen.\nRecall is shipping after nearly a year of announcement\nRecall was originally announced in\nMay 2024\nas the flagship feature of Windows 11 and Snapdragon-powered \"AI\" PCs.\nAt that time, Microsoft touted Recall as one of the best use cases of AI on Windows 11, but security researchers\nnoted\nthat Recall is a privacy nightmare that captures your passwords and stores them in plain text.\nMicrosoft pulled back Recall AI and promised to address the privacy and security concerns by testing it with Windows Insiders.\nThe company also made Recall completely optional and upgraded the model to filter out passwords or other sensitive information.\nAfter nearly one year of delay, Recall is now included in Windows 11 Build 26100 for PCs with Snapdragon Copilot+ PCs.\nRecall will begin rolling out to everyone with the May 2025 Patch Tuesday Update.\nRelated Articles:\nWindows 11 KB5055523 & KB5055528  cumulative updates released\nMicrosoft adds hotpatching support to Windows 11 Enterprise\nWindows 11 KB5053598 & KB5053602 cumulative updates released\nWindows 11 KB5055627 update released with 30 new changes, fixes\nWindows 11 April update unexpectedly creates new 'inetpub' folder"
    },
    {
        "Title": "Windows 11 KB5055627 update released with 30 new changes, fixes",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5055627-update-released-with-30-new-changes-fixes/",
        "Summary": "​​Microsoft has released the KB5055627 preview cumulative update for Windows 11 24H2 with many new features gradually rolling out, and some new bug fixes for everyone. [...]",
        "Date": "2025-04-25",
        "Content": "​​Microsoft has released the KB5055627 preview cumulative update for Windows 11 24H2 with many new features gradually rolling out, and some new bug fixes for everyone.\nThe\nKB5055627\nupdate is part of the company's optional non-security preview updates schedule, which pushes updates at the end of each month to let Windows admins test bug fixes, improvements, and features that will roll out during next month's May Patch Tuesday release.\nUnlike regular Patch Tuesday cumulative updates, monthly non-security preview updates do not include security updates.\nYou can install the KB5055627 update by opening\nSettings\n, clicking on\nWindows Update,\nand then on\n'Check for Updates\n.'\nBecause this is an optional update, you will be asked if you want to install it by clicking the 'Download and install' link unless you have the \"Get the latest updates as soon as they're available\" option enabled, which will cause the update to automatically install.\nKB5055627 preview update (BleepingCoputer)\nYou can also manually download and install the KB5055627 preview update from the\nMicrosoft Update Catalog\n.\nWindows 11 KB5055627 highlights\nOnce installed, this optional cumulative release will update Windows 11 24H2 systems to build 26100.3915.\nThe April 2025 preview update comes with a lot of new features that are gradually rolling out, with many focused on Microsoft Copilot+ PCs:\n[\nRecall (preview)\n]\nNew!\nYou work across so many apps, sites, and documents it can be hard to remember where you saw something you want to get back to. Recall (preview) saves you time by offering an entirely new way to search for things you’ve seen or done on your PC securely. With the AI capabilities of Copilot+ PCs, it’s now possible to quickly find and get back to any app, website, image, or document just by describing its content. To use Recall, you will need to opt-in to save snapshots, which are images of your activity, and enroll in Windows Hello to confirm your presence so only you can access your snapshots. You are always in control of what snapshots are saved and can pause saving snapshots at any time. As you use your Copilot+ PC throughout the day working on documents or presentations, taking video calls, and context switching across activities, Recall will take regular snapshots and help you find things faster and easier. When you need to find or get back to something you’ve done previously, open Recall and authenticate with Windows Hello. When you’ve found what you were looking for, you can reopen the application, website, or document, or use Click to Do to act on any image or text in the snapshot you found.\nThe feature is rolling out in early 2025 to most markets and then to the European Economic Area later this year.\n[\nClick to Do (preview\n)\n]\nNew!\nClick to Do (preview) makes it easier than ever for you to take immediate action on whatever catches your eye on-screen on your Copilot+ PC, saving you time by helping complete tasks inline and quickly getting you to the app that can best complete the job. For example, select an image using Click to Do to take actions like erasing objects using the Photos app or remove the background using Paint. To use Click to Do, simply use\nWindows key\n+\nmouse click\nor\nWindows key\n+\nQ.\nYou can also enter through the Snipping Tool menu and print screen or searching “Click to Do” in the search box on the Windows taskbar.\nNew!\nOn Snapdragon-powered Copilot+ PCs, Click to Do includes intelligent text actions. Use\nWindows key\n+\nmouse click\nor\nWindows key\n+\nQ\nto select a text block and then drag to select the text that you want. You’ll see options to Summarize or to help you Rewrite your text, so it sounds more causal or more formal. These text actions leverage the capabilities of Phi Silica, the on-device Small Language Model (SLM) that is built right into Windows.\nNew!\nEasily open Click to Do when you swipe from the rightmost edge of your display.\nNew!\nThe policies for managing Click to Do in a commercial environment.  IT admins can learn more by viewing Manage Click to Do.\n[\nImproved Windows Search\n]\nNew!\nFinding your documents, photos, and settings across Windows 11 is easier on Copilot+ PCs with improved Windows Search, powered by semantic indexing models along with traditional lexical indexing. Whether it’s searching in File Explorer, in Windows Search on your taskbar, or in Settings— just type what’s on your mind to find it on your Copilot+ PC. You no longer need to remember file names, exact words in file content, or settings names. Searching for settings like “change my theme” will work within the Settings app for now. Thanks to the power of the 40+ TOPS NPU onboard Copilot+ PCs, these search improvements work even when you’re not connected to the internet. To find more info, see\nSearching indexing in Windows\n. Now available on AMD and Intel-powered Copilot+ PCs.\nNew!\nLocating your photos stored and saved in the cloud is getting simpler on\nCopilot+ PCs\n. You can use your own words in the search box at the upper-right corner of File Explorer like “summer picnics.” In addition to photos stored locally on your Copilot+ PC, photos from the cloud will show up in the search results together. Exact matches for your keywords within the text of your cloud files will also show in the search results. You can try this experience out today with your personal OneDrive when signed in with your Microsoft account and connected to the internet. Now available on AMD and Intel-powered Copilot+ PCs.\n[Narrator]\nNew!\nKeep track of what Narrator has spoken and access it for quick reference. With speech recap, you can quickly access spoken content, follow along with live transcription, and copy what Narrator last said—\nall with simple keyboard shortcuts\n.\n[Phone Link]\nNew!\nYou can do even more with your Windows PC and your mobile device with direct access to cross-device features from the Start menu. For example, you can make phone calls, send SMS messages, access your photos, or share content between your mobile device and PC.\n[Widgets]\nNew!\nWeb developers can use their existing content to create interactive widgets that can be added to multiple widgets surfaces. For more info, see\nWeb widget providers\n.\nNew!\nThere are some new updates to the new Widgets on Lock experience for devices in the European Economic Area (EEA). In addition to accessibility and craftsmanship improvements, the Lock screen weather widget now supports customization. To configure your weather widget, go to\nSettings\n>\nPersonalization\n>\nLock screen\nand select the “Customize widget” option from the weather widget more options menu. More widgets will be customizable in the future.\n[File Explorer]\nNew!\nPivot-based curated views on File Explorer Home that supports ease of access of Microsoft 365 content on Windows. Be more productive and get highly relevant content at your fingertips on File Explorer Home.\nFixed: As part of our ongoing commitment to improving File Explorer accessibility, this release includes increased support for the text scaling (\nSettings\n>\nAccessibility\n>\nText size\n) across File Explorer, File Open/Save dialogs and the copy dialogs.\nFixed: Improved the performance of extracting zipped files, particularly in the case where you’re unzipping a large number of small files.\nFixed: The address bar in File Explorer might unexpectedly not show a path after opening.\n[Settings]\nNew!\nManage which apps Windows recommends actions, go to\nSettings\n>\nApps\n>\nActions on Copilot+ PCs\n.\n[Windows Studio Effects]\nNew!\nThe Studio Effects automatic framing filter turns on after the initial use of the camera, if your PC\nsupports Studio Effects\nand you have not used Studio Effects previously.\n[Start]\nFixed: You can’t use touch gestures to view the list of apps pinned in the Start menu.\nFixed: The\nSign out\nand\nMore options\nbuttons in the Start menu account manager might not be visible with increased text size.\n[Taskbar]\nFixed: The underlines beneath the app icons in the taskbar may remain visible even after the apps have been closed.\nFixed: If you use the arrow keys after pressing the\nWindows key\n+\nT\n, the arrows move in the wrong direction for Arabic and Hebrew display languages.\n[Desktop icons]\nThe logic for apps pinned to the desktop has been updated, so that\npackaged apps\nno longer show an accent colored backplate. For example, if you were to drag and drop Snipping Tool from the apps list in Start to the desktop the icons should be bigger and easier to see now.\n[Display]\nFixed: You might need to press the\nWIN\n+\nP\nkeyboard shortcut twice to switch topologies.\n[ExtFloodFill]\nFixed: There's an uncommon issue with ExtFloodFill where a horizontal line might appear in the incorrect location in Win32 applications.\n[Graphics]\nFixed: External graphics cards connected over Thunderbolt might unexpectedly not be discoverable in some cases.\n[Hyper-V Manager]\nFixed: Hyper-V Manager unexpectedly shows 0% CPU usage for VMs\nThe good news is that there are some fixes that are available immediately with the KB5055627 update, which include:\n[Blue screen error]\nFixed: This update resolves an issue observed after installing the April 2025 Windows security update and restarting the device. Affected devices encountered a\nblue screen exception\nwith error code 0x18B indicating a\nSECURE_KERNEL_ERROR\n.\n[Dynamic Host Configuration Protocol (DHCP Client)]\nFixed: This update addresses an issue affecting internet connectivity on devices after resuming from sleep mode. Users might experience intermittent internet connections.\n[File Systems]\nFixed: This update addresses an issue when the operating system stops unexpectedly, and an error message appears on a blue screen during normal usage with a user profile redirected to a network VHD(X).\n[Imaging\n] Fixed: This update addresses an issue where some content pages with JPEG images were not displaying.\n[Windows Hello]\nFixed: This update addresses an edge case issue where Windows Hello doesn’t work on devices with specific security features enabled, preventing users from logging in with facial recognition or PIN. This issue was observed after performing a\nPush button reset\nor\nReset this PC\nfrom\nSettings\n>\nSystem\n>\nRecovery\nand selecting\nKeep my Files\nand\nLocal install\n.\n[Windows Setup]\nFixed: If you install Windows 11, version 24H2 with Windows Setup and run System Preparation (Sysprep) afterwards, the boot file configuration is not properly updated, resulting in push-button reset options not working.\n[Windows Update]\nThe Windows Update settings page and the Start menu power button will now show an estimated time for how long your PC will be offline to install updates from Windows Update.\nMicrosoft is aware of two long-standing issues with KB5055627, one causing some Citrix components to block the updates from installing. A temporary workaround is available on this\nCitrix documentation page\n.\nThe second affects Roblox players on Windows Arm devices and prevents them from downloading the game from the Microsoft Store. As a workaround, they can download Roblox directly from www.roblox.com.\nThe full release notes for KB5055627 can be found in this\nsupport bulletin\n.\nRelated Articles:\nWindows 10 KB5055612 preview update fixes a GPU bug in WSL2\nWindows 11 KB5053656 update released with 38 changes and fixes\nWindows 11 KB5053598 & KB5053602 cumulative updates released\nWindows 11's Recall AI is now rolling out on Copilot+ PCs\nWindows 11 April update unexpectedly creates new 'inetpub' folder"
    },
    {
        "Title": "Craft CMS RCE exploit chain used in zero-day attacks to steal data",
        "Link": "https://www.bleepingcomputer.com/news/security/craft-cms-rce-exploit-chain-used-in-zero-day-attacks-to-steal-data/",
        "Summary": "Two vulnerabilities impacting Craft CMS were chained together in zero-day attacks to breach servers and steal data, with exploitation ongoing, according to CERT Orange Cyberdefense. [...]",
        "Date": "2025-04-25",
        "Content": "Two vulnerabilities impacting Craft CMS were chained together in zero-day attacks to breach servers and steal data, with exploitation ongoing, according to CERT Orange Cyberdefense.\nThe vulnerabilities were discovered by Orange Cyberdefense's CSIRT, which was called in to investigate a compromised server.\nAs part of the investigation, they discovered that two zero-day vulnerabilities impacting Craft CMS were exploited to breach the server:\nCVE-2025-32432:\nA remote code execution (RCE) vulnerability in Craft CMS.\nCVE-2024-58136:\nAn input validation flaw in the Yii framework used by Craft CMS.\nAccording to a report by SensePost, the ethical hacking team of Orange Cyberdefense, the threat actors chained both of these vulnerabilities together to breach servers and upload a PHP file manager.\nThe attack begins with the exploitation of CVE-2025-32432, which allows attackers to send a specially crafted request containing a \"return URL\" as a parameter that is saved in a PHP session file. This session name is sent to the visitor as part of the response to the HTTP request.\nRequest to store return URL in Craft CMS session\nSource: SensePost\nThe second stage of the attack leveraged a flaw in the Yii framework (CVE-2024-58136), which Craft CMS utilizes. To exploit this flaw, the attacker sent a malicious JSON payload that caused the PHP code in the session file to be executed on the server.\nThis allowed the attacker to install a PHP-based file manager on the server to compromise the system further.\nOrange told BleepingComputer that they saw additional compromise steps, including additional uploads of backdoors and data exfiltration. More information about this post-exploitation activity will be detailed in an upcoming blog post.\nThe Yii developers ultimately\nfixed the CVE-2024-58136 flaw\nin version Yii 2.0.52 released on April 9th.\nCraft CMS also\nfixed the CVE-2025-32432 flaw\nin versions 3.9.15, 4.14.15, and 5.6.17 on April 10th. While they did not update Yii to the latest version in Craft CMS, Orange says that the attack chain is still fixed.\n\"Today, the 2.0.51 (vulnerable) is still by default in Craft. However, with the CVE-2025-32432 fix, the Yii issue cannot be triggerable now,\" Orange told BleepingComputer.\nCraft CMS recommends that admins perform the following steps if they believe their site has been compromised:\nRefresh your security key in case it has already been captured. You can run the php craft setup/security-key command and copy the updated CRAFT_SECURITY_KEY environment variable to all production environments.\nIf you have any other private keys stored as environment variables (e.g. S3 or Stripe), refresh those as well.\nRotate your database credentials.\nOut of an abundance of caution, you may want to force all your users to reset their passwords in case your database is compromised. You can do that by running php craft resave/users --set passwordResetRequired --to \"fn() => true\".\nFor full indicators of compromise, including IP addresses and file names, you can\nview the appendix\nin SensePost's report.\nIn February,\nCISA also tagged\na code injection (RCE) flaw tracked as CVE-2025-23209 in Craft CMS 4 and 5 as being exploited in attacks.\nRelated Articles:\nSAP fixes suspected NetWeaver zero-day exploited in attacks\nCISA flags Craft CMS code injection flaw as exploited in attacks\nLazarus hackers breach six companies in watering hole attacks\nApple fixes two zero-days exploited in targeted iPhone attacks\nIvanti Connect Secure zero-days exploited to deploy custom malware"
    },
    {
        "Title": "Marks & Spencer pauses online orders after cyberattack",
        "Link": "https://www.bleepingcomputer.com/news/security/marks-and-spencer-pauses-online-orders-after-cyberattack/",
        "Summary": "British retailer giant Marks & Spencer (M&amp;S) has suspended online orders while working to recover from a recently disclosed cyberattack. [...]",
        "Date": "2025-04-25",
        "Content": "British retailer giant Marks & Spencer (M&S) has suspended online orders while working to recover from a recently disclosed cyberattack.\nThe multinational retailer operates over 1,400 stores, employs 64,000 employees globally, and sells various products, including clothing, food, and home goods.\nM&S, which reported revenues of £13 billion for FY24, is listed on the London Stock Exchange (LSE) and is included in the FTSE100 Index, the UK's best-known stock market index.\n\"As part of our proactive management of a cyber incident, we have made the decision to pause taking orders via our M&S.com websites and apps. Our product range remains available to browse online. We are truly sorry for this inconvenience. Our stores are open to welcome customers,\" the company\nsaid in a Friday update\n.\n\"All orders will be held by stores for the foreseeable due to the ongoing cyber issues regardless of when the last date for collection is,\" it added in a\nTwitter reply\nto a customer complaint.\nOn Wednesday, M&S also\ninformed customers\nthat the cyberattack disrupted some of its services, including contactless payments and Click & Collect orders in stores, and it was also causing delays in online order delivery. The company also announced that the incident forced it to take some processes offline to protect partners, suppliers, and its business operations.\n\"We are incredibly grateful for the understanding and support that our customers, colleagues, partners and suppliers have shown. We are working hard to restore our services and minimise disruption and are being supported by industry-leading experts,\" it added.\nMarks & Spence suspends online orders (BleepingComputer)\nM&S first\ndisclosed the cybersecurity incident\nin a Tuesday London Stock Exchange press release, stating that its team is working with external cybersecurity experts to manage and resolve the situation.\nNo ransomware operations or other threat groups have claimed responsibility for the M&S attack, and an eventual data leak isn't expected soon because threat actors usually take some time to pressure victims into paying ransom demands.\nHowever, if a ransomware gang has been behind this attack, its operators have likely stolen M&S data to be used as further extortion leverage.\nBleepingComputer has contacted Marks & Spencer with questions about the attack earlier this week, and we'll update the story if we receive a reply.\nRelated Articles:\nMarks & Spencer confirms a cyberattack as customers face delayed orders\nPhishing detection is broken: Why most attacks feel like a zero day\nGovtech giant Conduent confirms client data stolen in January cyberattack\nWestern Sydney University discloses security breaches, data leak\nRoyal Mail investigates data leak claims, no impact on operations"
    },
    {
        "Title": "Mobile provider MTN says cyberattack compromised customer data",
        "Link": "https://www.bleepingcomputer.com/news/security/mobile-provider-mtn-says-cyberattack-compromised-customer-data/",
        "Summary": "African mobile giant MTN Group announced that a cybersecurity incident has compromised the personal information of some of its subscribers in certain countries. [...]",
        "Date": "2025-04-25",
        "Content": "African mobile giant MTN Group announced that a cybersecurity incident has compromised the personal information of some of its subscribers in certain countries.\nMTN Group (formerly M-Cell) is Africa's largest mobile network operator, with a strong Asian market presence. The company has nearly 300 million subscribers across 20 countries and an annual revenue surpassing $11 billion.\nThe telecom giant noted that its network and billing systems weren't impacted by the attack, though an investigation to determine the exact scope and impact is ongoing.\n\"MTN Group would like to inform stakeholders that it has experienced a cybersecurity incident that resulted in unauthorised access to personal information of some MTN customers in certain markets,\"\nreads the announcement\n.\n\"Our core network, billing systems, and financial services infrastructure remain secure and fully operational.\"\nHowever, MTN says that an 'unknown third-party' claims to have accessed data from the company.\nRegarding those claims, the telecom firm notes that its investigation hasn't confirmed a compromise to customer wallets and accounts, so it's unclear exactly what has been exposed.\nMTN says it has informed the South African Police and its country's relevant regulatory and data protection authorities to support its investigations. Affected customers will also be notified soon.\nMeanwhile, MTN advises customers to follow these measures to protect themselves from attacks:\nPlace a fraud alert on your credit report via any major credit bureau.\nKeep MTN, MoMo, and banking apps/devices updated.\nUse strong, unique passwords and change them regularly.\nAvoid clicking on suspicious or unexpected messages/links.\nNever share passwords, PINs, or OTPs via phone, text, or email.\nEnable multifactor authentication wherever possible.\nAt the time of writing, no ransomware actors have claimed responsibility for an attack at MTN.\nBleepingComputer has contacted the African telecommunication services provider to ask which markets were impacted, but we are still waiting for a response.\nRelated Articles:\nSK Telecom warns customer USIM data exposed in malware attack\nBaltimore City Public Schools data breach affects over 31,000 people\nFBI seeks help to unmask Salt Typhoon hackers behind telecom breaches\nInterlock ransomware claims DaVita attack, leaks stolen data\nFrederick Health data breach impacts nearly 1 million patients"
    },
    {
        "Title": "Windows \"inetpub\" security fix can be abused to block future updates",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-inetpub-security-fix-can-be-abused-to-block-future-updates/",
        "Summary": "A recent Windows security update that creates an 'inetpub' folder has introduced a new weakness allowing attackers to prevent the installation of future updates. [...]",
        "Date": "2025-04-25",
        "Content": "A recent Windows security update that creates an ‘inetpub’ folder has introduced a new weakness allowing attackers to prevent the installation of future updates.\nAfter people installed this month's\nMicrosoft Patch Tuesday\nsecurity updates, Windows users\nsuddenly found an \"inetpub\" folder\nowned by the SYSTEM account created in the root of the system drive, normally the C: drive.\nIt was strange to see this folder created as it is normally used to hold files associated with Microsoft's Internet Information Service web server, which was not installed on these devices.\nIn an update to a\nsecurity advisory\n, Microsoft later confirmed that the C:\\inetpub folder was part of a fix for a Windows Process Activation elevation of privilege vulnerability tracked as CVE-2025-21204, with the company\nwarning not to delete the folder\n.\n\"After installing the updates listed in the Security Updates table for your operating system, a new %systemdrive%\\inetpub folder will be created on your device,\"\nconfirmed Microsoft\n.\n\"This folder should not be deleted regardless of whether Internet Information Services (IIS) is active on the target device. This behavior is part of changes that increase protection and does not require any action from IT admins and end users.\"\nHowever, cybersecurity expert Kevin Beaumont has demonstrated that this folder can be abused to prevent further Windows updates from being installed if it is created a certain way.\n\"I've discovered this fix introduces a denial of service vulnerability in the Windows servicing stack that allows non-admin users to stop all future Windows security updates,\" Kevin Beaumont.\nIn a new report,\nBeaumont says\nthat Windows users, even those without administrative privileges, can create a junction between C:\\inetpub and a Windows file, like C:\\windows\\system32\\notepad.exe using the following command.\nmklink /j c:\\inetpub c:\\windows\\system32\\notepad.exe\nA Windows junction is a special type of folder that redirects access to another folder on the same or another drive, making it appear as though the content exists in both locations.\nWhen asked why this junction is preventing the update from being installed, Beaumont says he believes it's because the update expects a folder rather than a file.\n\"It works with basically any file, I think it's because the servicing stack expects c:\\inetpub to be a directory - but mklink allows you to make a junction to a file,\" Beaumont told BleepingComputer.\nAccording to\nMicrosoft's documentation\n, junctions are meant to be links between folders rather than between files. However, as you can see from the image earlier in the article, it is still possible to create one as shown in the image below.\nC:\\inetpub junction pointing to C:\\Windows\\system32\\notepad.exe\nSource: BleepingComputer\nWith this junction created, if you attempt to install the April security update, it will not install correctly, giving a\n0x800F081F error code\n. This code is related to the error \"CBS_E_SOURCE_MISSING,\" which means a package or file was not found.\nWindows 0x800F081F error after creating junction\nSource: BleepingComputer:\nBeaumont says he reported the bug to Microsoft, who has assigned it a \"Medium\" severity classification and closed his case, stating they will consider fixing it in the future.\n\"After careful investigation, this case is currently rated as a Moderate severity issue,\"\nMicrosoft emailed Beaumont\n.\n\"It does not meet MSRCs current bar for immediate servicing as the update fails to apply only if the 'inetpub' folder is a junction to a file and succeeds upon deleting the inetpub symlink and retrying.\"\nBleepingComputer also contacted Microsoft about this bug on Wednesday but has not received a response yet.\nRelated Articles:\nMicrosoft: Windows 'inetpub' folder created by security fix, don’t delete\nMicrosoft April 2025 Patch Tuesday fixes exploited zero-day, 134 flaws\nMicrosoft adds hotpatching support to Windows 11 Enterprise\nMicrosoft March 2025 Patch Tuesday fixes 7 zero-days, 57 flaws\nMicrosoft says Edge browser is now 9% faster after optimizations"
    },
    {
        "Title": "Baltimore City Public Schools data breach affects over 31,000 people",
        "Link": "https://www.bleepingcomputer.com/news/security/baltimore-city-public-schools-data-breach-affects-over-31-000-people/",
        "Summary": "​Baltimore City Public Schools notified tens of thousands of employees and students of a data breach following an incident in February when unknown attackers hacked into its network. [...]",
        "Date": "2025-04-25",
        "Content": "​Baltimore City Public Schools notified tens of thousands of employees and students of a data breach following an incident in February when unknown attackers hacked into its network.\nEstablished in 1829, the public school district provides primary and secondary education to 76,841 enrolled students through 164 schools and programs.\n\"On February 13, 2025, Baltimore City Public Schools experienced a cybersecurity incident affecting certain IT systems within our network. We promptly notified law enforcement, conducted an initial investigation, and took steps to confirm the security of our systems,\"\nCity Schools said\nin a Tuesday notification.\n\"Following a thorough investigation with the guidance of law enforcement and external cybersecurity experts, we have confirmed that certain documents may have been compromised by criminal actors, which contained information belonging to some current and former employees, volunteers, and contractors, as well as files related to less than 1.5% of our student population.\"\nEven though the exact number of students affected by this breach wasn't shared, based on current student enrollment numbers, the attackers gained access to sensitive data belonging to roughly 1,150 students, according to the school district's estimations. Furthermore, the Maryland Office of the Attorney General\nconfirmed to The Baltimore Sun\nthat the breach impacts over 31,000 individuals.\nDuring the breach, the threat actors may have stolen folders, files, or records containing social security numbers, driver's license numbers, or passport numbers belonging to current and former employees, volunteers, and contractors. Files exposed during the incident may also have contained a combination of student data, call logs, absenteeism records, or the maternity status of currently enrolled students.\nBreach linked to Cloak ransomware\nWhile the school district didn't link the attack to a specific threat group or cybercrime operation, a\nWBALTV report\nlinked it to Cloak ransomware. This ransomware operation\nsurfaced in late 2022\nand has since claimed over 130 victims, most of them small—to medium-sized businesses.\nBaltimore City Public Schools now provides complimentary credit monitoring services to those affected and urges impacted individuals to review personal account statements and monitor credit reports to\nprevent identity theft attempts\n.\nIn November 2020, Baltimore County Public Schools, a Maryland school district that manages all public schools in Baltimore County, Maryland, also\ndisclosed a data breach following a ransomware attack\nthat forced it to shut down its network due to the number of impacted systems.\nOne year earlier, in May 2019, a RobbinHood ransomware attack\nencrypted government servers at Baltimore City Hall\n. Another ransomware incident\nimpacted Baltimore City's emergency call system\nin March 2018, forcing the staff to switch to manual operations to handle all incoming emergency calls.\nRelated Articles:\nPennsylvania education union data breach hit 500,000 people\nFrederick Health data breach impacts nearly 1 million patients\nAhold Delhaize confirms data theft after INC ransomware claims attack\nFood giant WK Kellogg discloses data breach linked to Clop ransomware\nTexas State Bar warns of data breach after INC ransomware claims attack"
    },
    {
        "Title": "Mobile Applications: A Cesspool of Security Issues",
        "Link": "https://www.darkreading.com/remote-workforce/mobile-applications-cesspool-security-issues",
        "Summary": "An analysis of more than a half-million mobile apps find encryption problems, privacy issues, and known vulnerabilities in third-party code. What can users and developers do?",
        "Date": "2025-04-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/mobile-applications-cesspool-security-issues"
    },
    {
        "Title": "How Organizations Can Leverage Cyber Insurance Effectively",
        "Link": "https://www.darkreading.com/cybersecurity-operations/organizations-leverage-cyber-insurance-effectively",
        "Summary": "By focusing on prevention, education, and risk transfer through insurance, organizations — especially SMEs — can protect themselves from the rapidly escalating threats of cyberattacks.",
        "Date": "2025-04-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/organizations-leverage-cyber-insurance-effectively"
    },
    {
        "Title": "Vehicles Face 45% More Attacks, 4 Times More Hackers",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/vehicles-45-more-attacks-4-times-more-hackers",
        "Summary": "Two kinds of attacks are in high gear: ransomware attacks against OEMs and compromised electric vehicle chargers, according to data from Q1 2025.",
        "Date": "2025-04-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/vehicles-45-more-attacks-4-times-more-hackers"
    },
    {
        "Title": "Phishing Kit Darcula Gets Lethal AI Upgrade",
        "Link": "https://www.darkreading.com/remote-workforce/phishing-kit-darcula-gets-major-ai-upgrade",
        "Summary": "Recently added artificial intelligence capabilities on the Chinese-language Darcula phishing-as-a-service platform make phishing attacks easy for even the least technical hackers.",
        "Date": "2025-04-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/phishing-kit-darcula-gets-major-ai-upgrade"
    },
    {
        "Title": "Deepfake 'doctors' take to TikTok to peddle bogus cures",
        "Link": "https://www.welivesecurity.com/en/social-media/deepfake-doctors-tiktok-bogus-cures/",
        "Summary": "Look out for AI-generated 'TikDocs' who exploit the public's trust in the medical profession to drive sales of sketchy supplements",
        "Date": "2025-04-25",
        "Content": "\n      Award-winning news, views, and insight from the ESET security community\n    \n\n        Award-winning news, views, and insight from the ESET security community\n      \nSocial Media\nLook out for AI-generated 'TikDocs' who exploit the public's trust in the medical profession to drive sales of sketchy supplements\nMartina López\nTomáš Foltýn\n\n25 Apr 2025\n • \n, \n3 min. read\n\nOnce confined to research labs, generative AI is now available to anyone – including those with ill intentions, who use AI tools not to spark creativity, but to fuel deception instead. Deepfake technology, which can craft remarkably lifelike videos, images and audio, is increasingly becoming a go-to not just for celebrity impersonation stunts or efforts to sway public opinion, but also for identity theft and all manner of scams.\nOn social media platforms like TikTok and Instagram, the reach of deepfakes, along with their potential for harm, can be especially staggering. ESET researchers in Latin America recently came across a campaign on TikTok and Instagram where AI-generated avatars posed as gynecologists, dietitians and other health professionals to promote supplements and wellness products. These videos, often highly polished and persuasive, disguise sales pitches as medical advice, duping the unwary into making questionable and potentially outright risky purchases.\nEach video follows a similar script: a talking avatar, often tucked into a corner of the screen, delivers health or beauty tips. Dispensed with an air of authority, the advice leans heavily on “natural” remedies, nudging viewers toward specific products for sale. By cloaking their pitches in the guise of expert recommendations, these deepfakes exploit trust in the medical profession to drive sales, a tactic that is as unethical as it is effective.\nIn one case, the “doctor” touts a “natural extract” as a superior alternative to Ozempic, the drug celebrated for aiding weight loss. The video promises dramatic results and directs you to an Amazon page, where the product is described as “relaxation drops” or “anti-swelling aids”, with no connection to the hyped benefits.\nOther videos increase the stakes further, pushing unapproved drugs or fake cures for serious illnesses, sometimes even hijacking the likeness of real, well-known doctors.\nThe videos are created with legitimate AI tools that allow anyone to submit short footage and transform it into a polished avatar. While this is a boon for influencers looking to scale their output, this same technology can be co-opted for misleading claims and deception – in other words, what may work as a marketing gimmick quickly morphs into a mechanism for spreading falsehoods.\nWe spotted more than 20 TikTok and Instagram accounts using deepfake doctors to push their products. One, posing as a gynecologist with 13 years of experience under her belt, was traced directly to the app’s avatar library. While such misuse violates the terms and conditions of common AI tools, it also highlights how easily they can be weaponized.\nUltimately, this may not be “just” about worthless supplements. The consequences can be more dire, as these deepfakes can erode confidence in online health advice, promoting harmful “remedies” and delaying proper treatment.\nAs AI becomes more accessible, spotting these fakes becomes trickier, posing a broader challenge even for tech-savvy people. That said, here are a few signs that can help you spot deepfake videos:\nAs AI tools continue to advance, distinguishing between authentic and fabricated content will become harder rather than easier. This threat underscores the importance of developing both technological safeguards and improving our collective digital literacy that will help protect us from misinformation and scams that could impact our health and financial well-being.\nREAD ALSO: TikShock: Don’t get caught out by these 5 TikTok scams\n\n      Sign up for our newsletters\n    \nScams\nSocial Media\nHijacked: How hacked YouTube channels spread scams and malware\nScams\nSocial Media\nHijacked: How hacked YouTube channels spread scams and malware\n\nSocial Media\n10 things to avoid posting on social media – and why\nSocial Media\n10 things to avoid posting on social media – and why\n\nSocial Media\nIs your LinkedIn profile revealing too much?\nSocial Media\nIs your LinkedIn profile revealing too much?\n\nScams\nHow AI-driven identity fraud is causing havoc\nScams\nBreak the fake: The race is on to stop AI voice cloning scams\n\n            Award-winning news, views, and insight from the ESET security community\n          "
    },
    {
        "Title": "Browser Security Firm SquareX Raises $20 Million",
        "Link": "https://www.securityweek.com/browser-security-firm-squarex-raises-20-million/",
        "Summary": "<p>SquareX offers what it has dubbed a “Browser Detection and Response (BDR)” solution.</p>\n<p>The post <a href=\"https://www.securityweek.com/browser-security-firm-squarex-raises-20-million/\">Browser Security Firm SquareX Raises $20 Million</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/browser-security-firm-squarex-raises-20-million/"
    },
    {
        "Title": "Former Google Cloud CISO Phil Venables Joins Ballistic Ventures",
        "Link": "https://www.securityweek.com/former-google-cloud-ciso-phil-venables-joins-ballistic-ventures/",
        "Summary": "<p>Venables has served as CISO and security executive across several large organizations, including Google Cloud, Goldman Sachs, Deutsche Bank.</p>\n<p>The post <a href=\"https://www.securityweek.com/former-google-cloud-ciso-phil-venables-joins-ballistic-ventures/\">Former Google Cloud CISO Phil Venables Joins Ballistic Ventures</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/former-google-cloud-ciso-phil-venables-joins-ballistic-ventures/"
    },
    {
        "Title": "Lattica Emerges From Stealth With FHE Platform for AI",
        "Link": "https://www.securityweek.com/lattica-emerges-from-stealth-with-fhe-platform-for-ai/",
        "Summary": "<p>Lattica has raised $3.25 million in pre-seed funding for a platform that uses FHE to enable AI models to process encrypted data. </p>\n<p>The post <a href=\"https://www.securityweek.com/lattica-emerges-from-stealth-with-fhe-platform-for-ai/\">Lattica Emerges From Stealth With FHE Platform for AI</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-25",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/lattica-emerges-from-stealth-with-fhe-platform-for-ai/"
    }
]