[
    {
        "Title": "Docker Malware Exploits Teneo Web3 Node to Earn Crypto via Fake Heartbeat Signals",
        "Link": "https://thehackernews.com/2025/04/docker-malware-exploits-teneo-web3-node.html",
        "Summary": "Cybersecurity researchers have detailed a malware campaign that's targeting Docker environments with a previously undocumented technique to mine cryptocurrency.\nThe activity cluster, per Darktrace and Cado Security, represents a shift from other cryptojacking campaigns that directly deploy miners like XMRig to illicitly profit off the compute resources.\nThis involves deploying a malware strain",
        "Date": "2025-04-22",
        "Content": "Cybersecurity researchers have detailed a malware campaign that's targeting Docker environments with a previously undocumented technique to mine cryptocurrency.\nThe activity cluster, per\nDarktrace and Cado Security\n, represents a shift from other cryptojacking campaigns that directly deploy\nminers like XMRig\nto illicitly profit off the compute resources.\nThis involves deploying a malware strain that connects to a nascent Web3 service called Teneo, a decentralized physical infrastructure network (DePIN) that allows users to monetize public social media data by running a\nCommunity Node\nin exchange for rewards called\nTeneo Points\n, which can be converted into $TENEO Tokens.\nThe node essentially functions as a distributed social media scraper to extract posts from Facebook, X, Reddit, and TikTok.\nAn analysis of artifacts gathered from its honeypots has revealed that the attack starts with a request to launch a container image \"\nkazutod/tene:ten\n\" from the Docker Hub registry. The image was uploaded two months ago and has been downloaded 325 times to date.\nThe container image is designed to run an embedded Python script that's heavily obfuscated and requires 63 iterations to unpack the actual code, which sets up a connection to teneo[.]pro.\n\"The malware script simply connects to the WebSocket and sends keep-alive pings in order to gain more points from Teneo and does not do any actual scraping,\" Darktrace said in a report shared with The Hacker News. \"Based on the website, most of the rewards are gated behind the number of heartbeats performed, which is likely why this works.\"\nThe campaign is reminiscent of another\nmalicious threat activity cluster\nthat's known to infect misconfigured Docker instances with the 9Hits Viewer software in order to generate traffic to certain sites in exchange for obtaining credits.\nThe intrusion set is also similar to other bandwidth-sharing schemes like\nproxyjacking\nthat involve downloading a specific software to share unused internet resources for some sort of financial incentive.\n\"Typically, traditional cryptojacking attacks rely on using XMRig to directly mine cryptocurrency, however as XMRig is highly detected, attackers are shifting to alternative methods of generating crypto,\" Darktrace said. \"Whether this is more profitable remains to be seen.\"\nThe disclosure comes as Fortinet FortiGuard Labs revealed a new botnet dubbed RustoBot that's propagating through security flaws in TOTOLINK (CVE-2022-26210 and CVE-2022-26187) and DrayTek (CVE-2024-12987) devices with an aim to conduct DDoS attacks. The exploitation efforts have been found to primarily target the technology sector in Japan, Taiwan, Vietnam, and Mexico.\n\"IoT and network devices are often poorly defended endpoints, making them attractive targets for attackers to exploit and deliver malicious programs,\" security researcher Vincent Li\nsaid\n. \"Strengthening endpoint monitoring and authentication can significantly reduce the risk of exploitation and help mitigate malware campaigns.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "GCP Cloud Composer Bug Let Attackers Elevate Access via Malicious PyPI Packages",
        "Link": "https://thehackernews.com/2025/04/gcp-cloud-composer-bug-let-attackers.html",
        "Summary": "Cybersecurity researchers have detailed a now-patched vulnerability in Google Cloud Platform (GCP) that could have enabled an attacker to elevate their privileges in the Cloud Composer workflow orchestration service that's based on Apache Airflow.\n\"This vulnerability lets attackers with edit permissions in Cloud Composer to escalate their access to the default Cloud Build service account, which",
        "Date": "2025-04-22",
        "Content": "Cybersecurity researchers have detailed a now-patched vulnerability in Google Cloud Platform (GCP) that could have enabled an attacker to elevate their privileges in the\nCloud Composer\nworkflow orchestration service that's based on Apache Airflow.\n\"This vulnerability lets attackers with edit permissions in Cloud Composer to escalate their access to the default Cloud Build service account, which has high-level permissions across GCP services like\nCloud Build\nitself, Cloud Storage, and Artifact Registry,\" Liv Matan, senior security researcher at Tenable,\nsaid\nin a report shared with The Hacker News.\nThe shortcoming has been codenamed ConfusedComposer by the cybersecurity company, describing it as a variant of\nConfusedFunction\n, a privilege escalation vulnerability impacting GCP's Cloud Functions service that an attacker could exploit to access other services and sensitive data in an unauthorized manner.\nThe disclosure comes weeks after Tenable detailed another privilege escalation vulnerability in GCP Cloud Run dubbed\nImageRunner\nthat could have allowed a malicious actor to access container images and even inject malicious code -- creating cascading effects.\nLike ImageRunner, ConfusedComposer is another example of the Jenga concept, which causes security issues to be inherited from one service to the other when cloud service providers build new services atop existing ones.\nThe exploit hinges on the attacker having permission to edit a Cloud Composer environment (i.e., composer.environments.update), which could be exploited to inject a malicious Python Package Index (PyPI) package that's capable of escalating privileges through Cloud Build.\nThe attack is made possible due to the fact that Cloud Composer allows users to install custom PyPI packages in their environments, thereby enabling an adversary to execute arbitrary code within the associated Cloud Build instance by using installation scripts inside their malicious package.\n\"ConfusedComposer is important because it exposes how behind-the-scenes interactions between cloud services can be exploited through privilege escalation,\" Matan explained. \"In this case, an attacker only needs permission to update a Cloud Composer environment to gain access to critical GCP services like Cloud Storage and Artifact Registry.\"\nSuccessful exploitation of the flaw could permit an attacker to siphon sensitive data, disrupt services, and deploy malicious code within CI/CD pipelines. Furthermore, it could pave the way for the deployment of backdoors that can grant persistent access to compromised cloud environments.\nFollowing responsible disclosure by Tenable, Google has addressed the vulnerability as of April 13, 2025, by eliminating the use of the Cloud Build service account to install PyPI packages.\n\"The environment's service account will be used instead,\" Google\nsaid\nin an announcement on January 15, 2025. \"Existing Cloud Composer 2 environments that previously used the default Cloud Build service account will change to using the environment's service account instead.\"\n\"Cloud Composer 2 environments created in versions 2.10.2 and later already have this change. Cloud Composer 3 environments already use the environment's service account, and are not impacted by this change.\"\nThe disclosure comes as Varonis Threat Labs uncovered a vulnerability in Microsoft Azure that could have allowed a threat actor with privileged access to an Azure SQL Server to alter configurations in a manner that causes data loss upon admin action. Microsoft has fully remediated the issue as of April 9, 2025, after it was made aware of it on August 5, 2024.\nThe Destructive Stored URL Parameter Injection vulnerability, the company said, stems from a lack of character limitation for server firewall rules created using Transact-SQL (\nT-SQL\n).\n\"By manipulating the name of server-level firewall rules through T-SQL, a threat actor with privileged access to an Azure SQL Server can inject an implant that, based on specific user actions, deletes arbitrary Azure resources that the user has permissions for,\" security researcher Coby Abrams\nsaid\n.\n\"The impact of a threat actor exploiting this vulnerability could be large-scale data loss in the affected Azure account.\"\nIt also comes as Datadog Security Labs shed light on a bug in Microsoft Entra ID restricted administrative units that could enable an attacker to prevent selected users from being modified, deleted, or disabled, even by a Global Administrator.\n\"A privileged attacker could have used this bug to protect an account under their control, preventing containment by any Entra ID administrator,\" security researcher Katie Knowles\nsaid\n. This included various tasks such as resetting passwords, revoking user sessions, deleting users, and clearing user multi-factor authentication (MFA) methods.\nThe issue has since been fixed by the Windows maker as of February 22, 2025, following responsible disclosure on August 19, 2024.\nIn recent weeks, threat actors have been found training their sights on websites hosted on Amazon Web Services (AWS) Elastic Compute Cloud (EC2) instances by exploiting Server-Side Request Forgery (SSRF) vulnerabilities to extract metadata information.\n\"EC2 Instance Metadata is a feature provided by AWS that allows an EC2 instance to access information needed at runtime without needing to authenticate or make external API calls,\" F5 Labs researcher Merlyn Albery-Speyer\nsaid\n. \"It can expose information such as the public or private IP address, instance ID, and IAM role credentials. Much of this is sensitive data of interest to attackers.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "5 Major Concerns With Employees Using The Browser",
        "Link": "https://thehackernews.com/2025/04/5-major-concerns-with-employees-using.html",
        "Summary": "As SaaS and cloud-native work reshape the enterprise, the web browser has emerged as the new endpoint. However, unlike endpoints, browsers remain mostly unmonitored, despite being responsible for more than 70% of modern malware attacks.\nKeep Aware’s recent State of Browser Security report highlights major concerns security leaders face with employees using the web browser for most of their work.",
        "Date": "2025-04-22",
        "Content": "As SaaS and cloud-native work reshape the enterprise, the web browser has emerged as the new endpoint. However, unlike endpoints, browsers remain mostly unmonitored, despite being responsible for more than\n70% of modern malware attacks\n.\nKeep Aware's recent\nState of Browser Security report\nhighlights major concerns security leaders face with employees using the web browser for most of their work. The reality is that\ntraditional security tools are blind to what happens within the browser\n, and attackers know it.\nKey Findings:\n70% of phishing campaigns\nimpersonate Microsoft, OneDrive, or Office 365 to exploit user trust.\n150+ trusted platforms\nlike Google Docs and Dropbox are being abused to host phishing and exfiltrate data.\n10% of AI prompts\ninvolve sensitive business content, posing risks across thousands of browser-based AI tools.\n34% of file uploads\non company devices go to personal accounts, often undetected.\nNew Attack Patterns Bypass Traditional Defenses\nFrom phishing kits that morph in real-time to JavaScript-based credential theft, attackers are bypassing firewalls, SWGs, and even EDRs. Here's how:\nMalware Reassembly in the Browser\nThreats are delivered as fragments that only activate when assembled inside the browser—making them invisible to network or endpoint tools.\nMulti-Step Phishing\nPhishing pages dynamically serve different content depending on who's viewing—users see scams, and scanners see nothing. Microsoft remains the most impersonated target.\nLiving Off Trusted Platforms\nAttackers hide behind URLs from reputable SaaS platforms. Security tools allow this by default—giving adversaries a clear path in.\nThe security stack must evolve to detect, analyze, and respond to threats where they actually occur: inside the browser. Relying solely on perimeter-based defenses like SWGs and network security tools is no longer enough.\nAI: The Next Great (Unmonitored) Security Risk\nWith\n75% of employees using generative AI\n, most enterprises are unaware of what data is being pasted into models like ChatGPT—or what third-party browser extensions are doing in the background. Unlike traditional apps, AI tools don't have a defined security boundary.\nIT and security teams are often left reactively responding to AI adoption, rather than proactively managing it. Traditional policy-based approaches struggle with AI adoption because:\nAI applications are rapidly being created, making static allow/deny lists ineffective.\nEmployees often switch between personal and corporate AI use, further blurring enforcement.\nMany AI models are embedded inside other platforms, making detection and control even harder.\nThis results in inconsistent governance, where security teams are faced with the challenge of defining and enforcing policies in an environment that doesn't have clear usage boundaries.\nAs AI regulations tighten, visibility and control over AI adoption will be mandatory and no longer optional. Organizations must track usage, detect risks, and flag sensitive data exposure before compliance pressures mount. Proactive monitoring today lays the foundation for AI governance tomorrow.\nDLP Can't Keep Up With the Browser\nLegacy Data Loss Prevention systems were designed for email and endpoints—not for today's browser-heavy workflows. The browser has become the primary channel for data movement, yet traditional DLP solutions can only see where network traffic is sent, not the actual destination application handling the data.\nModern data exfiltration risks include:\nPasting API keys into browser-based tools\nUploading documents to personal Google Drive\nCopy-pasting customer data into AI assistants\nEven well-meaning employees can unintentionally leak IP when switching between work and personal accounts—something legacy tools can't detect.\nWith more data moving through the browser than ever before, DLP must evolve to recognize application context, user actions, and business intent. A unified browser-based DLP model would give security teams the ability to apply consistent data protection policies across all destinations while enforcing controls on high-risk actions.\nThe Extension Problem No One's Watching\nDespite minimal technical evolution over the years, browser extensions now have unprecedented access to sensitive organizational data and user identities. While security teams rigorously manage software updates, patches, and endpoint security policies, extensions remain an attack surface often overlooked in traditional security frameworks. During their user data research, the Keep Aware team found:\n46%\nof extensions serve productivity use cases.\n20%\nfall into lifestyle categories—like shopping or social plugins.\n10%\nare classified as high or critical risk due to excessive permissions.\nPermissions that enable full-page access, session tracking, or network interception are still far too common—even in extensions downloaded from trusted marketplaces.\nAs extensions continue to serve as both productivity tools and security liabilities, enterprises must implement stronger review processes, visibility controls, and proactive defenses to secure the browser from the inside out.\nDownload the full report\n.\nShadow IT Lives In The Browser\nShadow IT is no longer just occasional use of unsanctioned applications—it has become a major challenge for enterprise security. Employees regularly adopt SaaS applications, personal file-sharing services, and third-party AI tools without IT oversight, often integrating them into daily work with real business data.\nEmployees across different job functions routinely interact with multiple organizational instances of the same application—often without recognizing the security implications.\nMarketing & Creative Teams: A marketing team member might mistakenly upload assets to a partner's Google Drive instead of the company's official instance, leading to unintended data exposure.\nConsultants & Client-Facing Roles: A consultant working with multiple clients may access client-specific SharePoint sites, unknowingly creating security gaps as sensitive data is shared across different organizations.\nProfessional Services & External Collaboration: Industries like legal and accounting, which rely heavily on external collaboration, frequently have employees working across 15+ different SharePoint instances, introducing significant challenges in monitoring data movement.\nThis explosion of\nShadow IT\ncreates massive security gaps, especially as product-led growth platforms bypass procurement processes entirely.\nInstead of classifying applications as corporate or consumer, security teams must assess the intent behind employee interactions, the account context in which tools are used, and real-time risks tied to SaaS activity. This means moving beyond static policies to embrace dynamic risk assessments, context-aware access controls, and continuous monitoring. The browser has become the most critical point of visibility, revealing logins, account switching, MFA status, consent-based access requests, and data movement across organizational boundaries.\nThe Path Forward: Browser-Native Visibility and Control\nKeep Aware's report provides comprehensive insights and data points that prove that security must move inside the browser. As phishing campaigns evolve, malware reassembly becomes more sophisticated, AI usage soars, and browser extensions remain unchecked, organizations that fail to adapt will remain vulnerable.\nSecurity teams must integrate browser security into their enterprise security stack to gain real-time visibility, detect browser-native threats, and protect people where they work.\nRequest a personalized demo\nif you'd like to learn more about protecting your organization from browser-based threats.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Phishers Exploit Google Sites and DKIM Replay to Send Signed Emails, Steal Credentials",
        "Link": "https://thehackernews.com/2025/04/phishers-exploit-google-sites-and-dkim.html",
        "Summary": "In what has been described as an \"extremely sophisticated phishing attack,\" threat actors have leveraged an uncommon approach that allowed bogus emails to be sent via Google's infrastructure and redirect message recipients to fraudulent sites that harvest their credentials.\n\"The first thing to note is that this is a valid, signed email – it really was sent from no-reply@google.com,\" Nick Johnson",
        "Date": "2025-04-22",
        "Content": "In what has been described as an \"extremely sophisticated phishing attack,\" threat actors have leveraged an uncommon approach that allowed bogus emails to be sent via Google's infrastructure and redirect message recipients to fraudulent sites that harvest their credentials.\n\"The first thing to note is that this is a valid, signed email – it really was sent from no-reply@google.com,\" Nick Johnson, the lead developer of the Ethereum Name Service (ENS),\nsaid\nin a series of posts on X.\n\"It passes the DKIM signature check, and Gmail displays it without any warnings – it even puts it in the same conversation as other, legitimate security alerts.\"\nThe email message informs prospective targets of a subpoena from a law enforcement authority asking for unspecified content present in their Google Account and urges them to click on a sites.google[.]com URL in order to \"examine the case materials or take measures to submit a protest.\"\nThe Google Sites URL displays a lookalike page that impersonates the legitimate Google Support page, and includes buttons to \"upload additional documents\" or \"view [the] case.\" Clicking on either of the options takes the victim to a replica Google Account sign-in page, the only difference being that it's hosted on Google Sites.\n\"Sites.google.com is a legacy product from before Google got serious about security; it allows users to host content on a google.com subdomain, and crucially it supports arbitrary scripts and embeds,\" Johnson said.\n\"Obviously this makes building a credential harvesting site trivial; they simply have to be prepared to upload new versions as old ones get taken down by Google's abuse team. It helps the attackers that there's no way to report abuse from the Sites interface, too.\"\nA clever aspect of the attack is the fact that the\nemail message\nhas the \"Signed by\" header set to \"accounts.google[.]com\" despite it having a \"Mailed by\" header with a completely unrelated domain (\"fwd-04-1.fwd.privateemail[.]com\").\nThe malicious activity has been characterized as a\nDKIM replay attack\n, where the attacker first creates a Google Account for a newly created domain (\"me@<domain>\") and then a Google OAuth application with the name that includes the entire content of the phishing message.\n\"Now they grant their OAuth app access to their 'me@...' Google account,\" Johnson said. \"This generates a 'Security Alert' message from Google, sent to their 'me@...' email address. Since Google generated the email, it's signed with a valid DKIM key and passes all the checks.\"\nThe attacker then proceeds to forward the same message from an Outlook account keeping the DKIM signature intact, thus causing the message to bypass email security filters, according to EasyDMARC. The message is subsequently relayed through a custom Simple Mail Transfer Protocol (\nSMTP\n) service called Jellyfish and received by Namecheap's PrivateEmail infrastructure that facilitates mail forwarding to the targeted Gmail account.\n\"At this point, the email reaches the victim's inbox looking like a valid message from Google, and all authentication checks show as passing SPF, DKIM, and DMARC,\" EasyDMARC CEO Gerasim Hovhannisyan\nsaid\n.\n\"Because they named their Google account 'me@', Gmail shows the message was sent to 'me' at the top, which is the shorthand it uses when a message is addressed to your email address - avoiding another indication that might send up red flags,\" Johnson pointed out.\nWhen reached for comment, Google told The Hacker News that it has rolled out fixes to stop the abuse pathway and emphasized that the company neither asks for account credentials, such as passwords or one-time passwords, nor directly calls users.\n\"We're aware of this class of targeted attack from this threat actor, and have rolled out protections to shut down this avenue for abuse,\" a Google spokesperson said. \"In the meantime, we encourage users to adopt two-factor authentication and passkeys, which provide strong protection against these kinds of phishing campaigns.\"\nThe disclosure comes nearly nine months after Guardio Labs\nrevealed\na now-patched misconfiguration in email security vendor Proofpoint's defenses that threat actors exploited to send millions of messages spoofing various popular companies like Best Buy, IBM, Nike, and Walt Disney, and bypass authentication measures.\nIt also coincides with a surge in phishing campaigns that make use of attachments in Scalable Vector Graphics (\nSVG\n) format to trigger the execution of HTML code that, in turn, redirects users to a rogue Microsoft login form or a fake web page masquerading as Google Voice to entice them into entering their credentials.\nRussian cybersecurity company Kaspersky said it has observed over 4,100 phishing emails with SVG attachments since the start of 2025.\n\"Phishers are relentlessly exploring new techniques to circumvent detection,\" Kaspersky\nsaid\n. \"They vary their tactics, sometimes employing user redirection and text obfuscation, and other times, experimenting with different attachment formats. The SVG format provides the capability to embed HTML and JavaScript code within images, which is misused by attackers.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft Secures MSA Signing with Azure Confidential VMs Following Storm-0558 Breach",
        "Link": "https://thehackernews.com/2025/04/microsoft-secures-msa-signing-with.html",
        "Summary": "Microsoft on Monday announced that it has moved the Microsoft Account (MSA) signing service to Azure confidential virtual machines (VMs) and that it's also in the process of migrating the Entra ID signing service as well.\nThe disclosure comes about seven months after the tech giant said it completed updates to Microsoft Entra ID and MS for both public and United States government clouds to",
        "Date": "2025-04-22",
        "Content": "Microsoft on Monday announced that it has moved the Microsoft Account (MSA) signing service to Azure confidential virtual machines (VMs) and that it's also in the process of migrating the Entra ID signing service as well.\nThe disclosure comes about seven months after the tech giant\nsaid\nit completed updates to Microsoft Entra ID and MS for both public and United States government clouds to generate, store, and automatically rotate access token signing keys using the Azure Managed Hardware Security Module (HSM) service.\n\"Each of these improvements helps mitigate the attack vectors that we suspect the actor used in the 2023 Storm-0558 attack on Microsoft,\" Charlie Bell, Executive Vice President for Microsoft Security,\nsaid\nin a post shared with The Hacker News ahead of publication.\nMicrosoft also noted that 90% of identity tokens from Microsoft Entra ID for Microsoft apps are validated by a hardened identity Software Development Kit (SDK) and that 92% of employee productivity accounts are now using phishing-resistant multifactor authentication (MFA) to mitigate risk from advanced cyber attacks.\nBesides isolating production systems and enforcing a two-year retention policy for security logs, the company also said it's protecting 81% of production code branches using MFA through proof-of-presence checks.\n\"To reduce the risk of lateral movement, we are piloting a project to move customer support workflows and scenarios into a dedicated tenant,\" it added. \"Security baselines are enforced across all types of Microsoft tenants, and a new tenant provisioning system automatically registers new tenants in our security emergency response system.\"\nThe changes are part of its Secure Future Initiative (\nSFI\n), which the company characterized as the \"largest cybersecurity engineering project in history and most extensive effort of its kind at Microsoft.\"\nThe SFI gained traction last year in response to a report from the U.S. Cyber Safety Review Board (CSRB), which\ncriticized\nthe tech giant for a series of avoidable errors that led to the breach of nearly two dozen companies across Europe and the U.S. by a China-based nation-state group called Storm-0558 in 2023.\nMicrosoft, in July 2023, revealed that a\nvalidation error\nin its source code allowed for Azure Active Directory (Azure AD) or Entra ID tokens to be forged by Storm-0558 using an MSA consumer signing key to infiltrate several organizations and gain unauthorized email access for subsequent exfiltration of mailbox data.\nLate last year, the company also\nlaunched\na Windows Resiliency Initiative to improve security and reliability and avoid causing system disruptions like what happened during the infamous\nCrowdStrike update incident\nin July 2024.\nThis includes a feature called Quick Machine Recovery, which enables IT administrators to run specific fixes on Windows PCs even in situations when the machines are unable to boot. It's built into the Windows Recovery Environment (WinRE).\n\"Unlike traditional repair options that rely on user intervention, it activates automatically when the system detects failure,\" Patch My PC's Rudy Ooms\nsaid\nlate last month.\n\"The whole cloud remediation process is pretty straightforward: it checks if flags/settings like CloudRemediation, AutoRemediation, and optionally HeadlessMode are set. If the environment meets the conditions (such as an available network and required plugin), Windows silently initiates recovery.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Lotus Panda Hacks SE Asian Governments With Browser Stealers and Sideloaded Malware",
        "Link": "https://thehackernews.com/2025/04/lotus-panda-hacks-se-asian-governments.html",
        "Summary": "The China-linked cyber espionage group tracked as Lotus Panda has been attributed to a campaign that compromised multiple organizations in an unnamed Southeast Asian country between August 2024 and February 2025.\n\"Targets included a government ministry, an air traffic control organization, a telecoms operator, and a construction company,\" the Symantec Threat Hunter Team said in a new report",
        "Date": "2025-04-22",
        "Content": "The China-linked cyber espionage group tracked as Lotus Panda has been attributed to a campaign that compromised multiple organizations in an unnamed Southeast Asian country between August 2024 and February 2025.\n\"Targets included a government ministry, an air traffic control organization, a telecoms operator, and a construction company,\" the Symantec Threat Hunter Team\nsaid\nin a new report shared with The Hacker News. \"The attacks involved the use of multiple new custom tools, including loaders, credential stealers, and a reverse SSH tool.\"\nThe intrusion set is also said to have targeted a news agency located in another country in Southeast Asia and an air freight organization located in another neighboring country.\nThe threat cluster, per Broadcom's cybersecurity division, is assessed to be a continuation of a campaign that was\ndisclosed\nby the company in December 2024 as targeting various high-profile organizations in Southeast Asia since at least October 2023.\nThen last month, Cisco Talos\nconnected\nthe Lotus Panda actor to intrusions aimed at government, manufacturing, telecommunications, and media sectors in the Philippines, Vietnam, Hong Kong, and Taiwan with a backdoor known as Sagerunex.\nLotus Panda (aka Billbug, Bronze Elgin, Lotus Blossom, Spring Dragon, and Thrip) has a history of orchestrating cyber attacks against governments and military organizations in Southeast Asia.\nBelieved to be active since at least 2009, the group came under the spotlight for the first time in June 2015 when Palo Alto Networks\nattributed\nthe threat actor to a persistent spear-phishing campaign that exploited a Microsoft Office flaw (\nCVE-2012-0158\n) to distribute a backdoor dubbed Elise (aka Trensil) that's designed to execute commands and read/write files.\nSubsequent attacks mounted by the group have\nweaponized\na Microsoft Windows OLE flaw (\nCVE-2014-6332\n) via a booby-trapped attachment sent in a\nspear-phishing email\nto an individual then working for the French Ministry of Foreign Affairs in Taiwan to deploy another trojan related to Elise codenamed Emissary.\nIn the latest wave of attacks spotted by Symantec, the attackers have leveraged legitimate executables from Trend Micro (\"tmdbglog.exe\") and Bitdefender (\"bds.exe\") to sideload malicious DLL files, which act as loaders to decrypt and launch a next-stage payload embedded within a locally stored file.\nThe Bitdefender binary has also been used to sideload another DLL, although the exact nature of the file is unclear. Another unknown aspect of the campaign is the initial access vector used to breach the entities in question.\nThe attacks paved the way for an updated version of Sagerunex, a tool exclusively used by Lotus Panda. It comes with capabilities to harvest target host information, encrypt it, and exfiltrate the details to an external server under the attacker's control.\nAlso deployed in the attacks are a reverse SSH tool, and two credential stealers ChromeKatz and CredentialKatz that are equipped to siphon passwords and cookies stored in the Google Chrome web browser.\n\"The attackers deployed the publicly available Zrok peer-to-peer tool, using the sharing function of the tool in order to provide remote access to services that were exposed internally,\" Symantec said. \"Another legitimate tool used was called 'datechanger.exe.' It is capable of changing timestamps for files, presumably to muddy the waters for incident analysts.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Marks & Spencer confirms a cyberattack as customers face delayed orders",
        "Link": "https://www.bleepingcomputer.com/news/security/marks-and-spencer-confirms-a-cyberattack-as-customers-face-delayed-orders/",
        "Summary": "Marks & Spencer (M&amp;S) has disclosed that it is responding to a cyberattack over the past few days that has impacted operations, including its Click and Collect service. [...]",
        "Date": "2025-04-22",
        "Content": "Source: Marks & Spencer\nMarks & Spencer (M&S) has disclosed that it is responding to a cyberattack over the past few days that has impacted operations, including its Click and Collect service.\nThe company is a British multinational retailer known for selling various products, including clothing, food, and home goods. Marks & Spencer operates over 1,400 stores and employs 64,000 employees globally.\nThe company confirmed the cybersecurity incident in a press release on the London Stock Exchange, stating that they are working with cybersecurity experts to manage and resolve the situation.\n\"Marks and Spencer Group plc (the Company, or M&S) has been managing a cyber incident over the past few days,\"\nreads the M&S statement\n.\n\"As soon as we became aware of the incident, it was necessary to make some minor, temporary changes to our store operations to protect customers and the business and we are sorry for any inconvenience experienced. Importantly, our stores remain open and our website and app are operating as normal.\"\n\"The Company has engaged external cyber security experts to assist with investigating and managing the incident. We are taking actions to further protect our network and ensure we can continue to maintain customer service.\"\nM&S did not provide specific details on the nature of the cyber incident but said it notified the data protection supervisory authorities and the National Cyber Security Centre.\nWhile M&S stores, its website, and its app remain operational, the company says that the cyberattack has caused some disruption to its operations.\nThis includes delays in its Click and Collect order system, telling customers to wait for an email stating an order is ready for pick up before coming to the store.\nIn an email sent to affected customers, M&S apologized for the inconvenience and assured customers that efforts were underway to resolve the issues and resume regular service.\nNo ransomware gangs or other threat actors have claimed responsibility for the attack, and likely won't for quite a while, as they pressure the company into paying an extortion demand.\nHowever, if ransomware is behind this attack, data is likely stolen and will be used as further leverage to convince the company to pay.\nBleepingComputer contacted Marks & Spencer with questions about the attack and will update the story if we receive a reply.\nRelated Articles:\nGovtech giant Conduent confirms client data stolen in January cyberattack\nWestern Sydney University discloses security breaches, data leak\nRoyal Mail investigates data leak claims, no impact on operations\nCyberattack takes down Ukrainian state railway’s online services\nThe AI race: Dark AI is in the lead, but good AI is catching up"
    },
    {
        "Title": "Active! Mail RCE flaw exploited in attacks on Japanese orgs",
        "Link": "https://www.bleepingcomputer.com/news/security/active-mail-rce-flaw-exploited-in-attacks-on-japanese-orgs/",
        "Summary": "An Active! Mail zero-day remote code execution vulnerability is actively exploited in attacks on large organizations in Japan. [...]",
        "Date": "2025-04-22",
        "Content": "An Active! Mail zero-day remote code execution vulnerability is actively exploited in attacks on large organizations in Japan.\nActive! mail is a web-based email client developed initially by TransWARE and later acquired by Qualitia, both Japanese companies.\nWhile it's not widely used worldwide like Gmail or Outlook, Active! is often used as a groupware component in Japanese-language environments of large corporations, universities, government agencies, and banks.\nAccording to the vendor, Active! is\nused in over 2,250 organizations\n, boasting over 11,000,000 accounts, making it a significant player in the country's business webmail market.\nLate last week, Qualitia released a security bulletin about a stack-based buffer overflow vulnerability tracked under CVE-2025-42599 (CVSS v3 score: 9.8, \"critical\") impacting all versions of Active! up to and including 'BuildInfo: 6.60.05008561' on all supported OS platforms.\n\"If a maliciously crafted request is sent by a remote third party, there is a possibility of arbitrary code execution or a denial-of-service (DoS) condition being triggered,\"\nreads the bulletin\n.\nPublicly exposed login panel\nSource:\n@nekono_naha\n| X\nAlthough Qualitia mentions investigating whether the flaw has been exploited, Japan's CERT has\nconfirmed its active exploitation status\n, urging all users to update to Active! Mail 6 BuildInfo: 6.60.06008562 as soon as possible.\nJapanese web hosting and IT services (SMB) provider Kagoya Japan reported several external attacks over the weekend, prompting it to temporarily suspend the service.\n\"We suspect that this issue is related to a vulnerability disclosed by QUALITIA (the developer),\"\nreads the bulletin Kagoya published earlier\n.\nA similar service outage following believed exploitation attempts was also reported by web hosting and IT services provider WADAX.\n\"At this stage, we cannot yet guarantee the safe use of the service for our customers,\"\nannounced WADAX\n.\n\"Therefore, with customer safety as our top priority, we have temporarily suspended the Active! mail service as a precaution.\"\nMacnica security researcher\nYutaka Sejiyama\ntold BleepingComputer that at least 227 internet-exposed Active! servers that are potentially exposed to these attacks, with 63 of them used in universities.\nJapan's CERT has\nproposed specific mitigation steps\nfor those unable to apply the security update immediately, including configuring the Web Application Firewall (WAF) to enable HTTP request body inspection and block multipart/form-data headers if their size exceeds a certain threshold.\nRelated Articles:\nCritical RCE flaw in Apache Tomcat actively exploited in attacks\nCritical PHP RCE vulnerability mass exploited in new attacks\nSonicWall SMA VPN devices targeted in attacks since January\nCISA tags SonicWall VPN flaw as actively exploited in attacks\nCentreStack RCE exploited as zero-day to breach file sharing servers"
    },
    {
        "Title": "Hackers abuse Zoom remote control feature for crypto-theft attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/hackers-abuse-zoom-remote-control-feature-for-crypto-theft-attacks/",
        "Summary": "A hacking group dubbed 'Elusive Comet' targets cryptocurrency users in social engineering attacks that exploit Zoom's remote control feature to trick users into granting them access to their machines. [...]",
        "Date": "2025-04-22",
        "Content": "A hacking group dubbed 'Elusive Comet' targets cryptocurrency users in social engineering attacks that exploit Zoom's remote control feature to trick users into granting them access to their machines.\nZoom's remote control feature allows meeting participants to take control of another participant's computer.\nAccording to cybersecurity firm Trail of Bits, which encountered this social engineering campaign, the perpetrators mirror techniques used by the Lazarus hacking group in the\nmassive $1.5 billion Bybit crypto heist\n.\n\"The ELUSIVE COMET methodology mirrors the techniques behind the recent $1.5 billion Bybit hack in February, where attackers manipulated legitimate workflows rather than exploiting code vulnerabilities,\" explains the Trail of Bits report.\nZoom-based interview scheme\nTrail of Bits learned of this new campaign after the threat actors attempted to conduct the social engineering attack on its CEO via X direct messages.\nThe attack starts with an invitation to a \"Bloomberg Crypto\" interview via Zoom, sent to high-value targets via sock-puppet accounts on X, or via email (bloombergconferences[@]gmail.com).\nThe fake accounts impersonate crypto-focused journalists or Bloomberg outlets and reach out to the targets via direct messages on social media platforms.\nFake accounts used in the attacks\nSource: Trail of Bits\nThe invitations are sent through Calendly links to schedule a Zoom meeting. Since both Calendly and Zoom invites/links are authentic, they work as expected and lower the target's suspicions.\nCalendly page used for scheduling the interview\nSource: Trail of Bits\nDuring the Zoom call, the attacker initiates a screen-sharing session and sends a remote control request to the target.\nThe trick employed in this stage is that the attackers rename their Zoom display name to \"Zoom,\" so the prompt the victim sees reads \"Zoom is requesting remote control of your screen,\" making it appear as a legitimate request from the app.\nThe deceptive request on Zoom\nSource: Trail of Bits\nHowever, approving the request gives the attackers full remote input control over the victim's system, allowing them to steal sensitive data, install malware, access files, or initiate crypto transactions.\nThe attacker may act quickly to establish persistent access by implanting a stealthy backdoor for later exploitation and disconnect, leaving victims with little chance to realize the compromise.\n\"What makes this attack particularly dangerous is the permission dialog's similarity to other harmless Zoom notifications,\"\nsays Trail of Bits\n.\n\"Users habituated to clicking \"Approve\" on Zoom prompts may grant complete control of their computer without realizing the implications.\"\nTo defend against this threat, Trail of Bits suggests the implementation of system-wide Privacy Preferences Policy Control (PPPC) profiles that prevent accessibility access, which is possible by using this\ncollection of tools\n.\nThe firm recommends removing Zoom entirely from all systems for security-critical environments and organizations that handle valuable digital assets.\n\"For organizations handling particularly sensitive data or cryptocurrency transactions, the risk reduction from eliminating the Zoom client entirely often outweighs the minor inconvenience of using browser-based alternatives,\" explains Trail of Bits.\nRelated Articles:\nNorth Korean hackers adopt ClickFix attacks to target crypto firms\nOKX suspends DEX aggregator after Lazarus hackers try to launder funds\nNorth Korean Lazarus hackers infect hundreds via npm packages\nFBI confirms Lazarus hackers were behind $1.5B Bybit crypto heist\nLazarus hacked Bybit via breached Safe{Wallet} developer machine"
    },
    {
        "Title": "Windows 10 KB5055612 preview update fixes a GPU bug in WSL2",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb5055612-preview-update-fixes-a-gpu-bug-in-wsl2/",
        "Summary": "Microsoft has released the optional KB5055612 preview cumulative update for Windows 10 22H2 with two changes, including a fix for a GPU paravirtualization bug in Windows Subsystem for Linux 2 (WSL2). [...]",
        "Date": "2025-04-22",
        "Content": "Microsoft has released the optional KB5055612 preview cumulative update for Windows 10 22H2 with two changes, including a fix for a GPU paravirtualization bug in Windows Subsystem for Linux 2 (WSL2).\nThe KB5055612 cumulative update preview is part of Microsoft's \"optional non-security preview updates\" schedule, typically released at the end of every month. This update allows Windows admins to test upcoming fixes and features that will be released in the upcoming May Patch Tuesday.\nUnlike Patch Tuesday cumulative updates, this preview update does not include security updates.\nWindows users can install this update by going into\nSettings\n, clicking on\nWindows Update,\nand manually performing a\n'Check for Updates\n.'\nAs this is an optional update, unless you have the \"Get the latest updates as soon as they're available\" option enabled in Windows Update, you will be asked whether you wish to install it by clicking the 'Download and install' link.\nWindows 10 KB5055612 cumulative update preview\nSource: BleepingComputer\nAfter installing this update, Windows 10 22H2 will be updated to build\n19045.5796\n.\nWindows 10 users can also manually download and install the KB5055612 preview update from the\nMicrosoft Update Catalog\n.\nWhat's new in Windows 10 KB5055612\nMicrosoft has not added new features in this update, and it only includes bug fixes and security improvements.\nThe highlighted changes in the KB5055612 update are:\n[\nInternal Windows OS\n]\nThis update contains miscellaneous security improvements to internal Windows OS functionality.\n[Graphics]\nFix: The check for\nGPU paravirtualization\nwas case-sensitive in the\nWindows Subsystem for Linux 2 (WSL2)\n. This issue might potentially cause GPU paravirtualization support to fail.\n[OS Security]\nUpdates to the Windows Kernel Vulnerable Driver Blocklist (DriverSiPolicy.p7b). Additions have been made to blocklist drivers with security vulnerabilities that have been used in Bring Your Own Vulnerable Driver (BYOVD) attacks.\nMicrosoft says there are two known issues, all of which have been problematic since the January 2025 updates.\nWindows updates may fail if the Citrix Session Recording Agent (SRA) version 2411 is installed on the device.\n\"As a workaround, stop the Session Recording Monitoring service, install the Microsoft security update, and enable the Session Recording Monitoring service,\" explains a\nCitrix support bulletin\n.\nThe second issue is that Windows EventViewer may incorrectly display an Event 7023 error about SgrmBroker.exe, stating, \"The System Guard Runtime Monitor Broker service terminated with the following error: %%3489660935.\"\nMicrosoft says that SgrmBroker.exe currently serves no purpose in the operating system, and the errors can be ignored. The bug will be fixed in future Windows updates.\nA complete list of fixes can be found in the\nKB5055612 support bulletin\n.\nRelated Articles:\nWindows 10 KB5052077 update fixes broken SSH connections\nWindows 10 KB5053606 update fixes broken SSH connections\nWindows 11 KB5052093 update released with 33 changes and fixes\nWindows 10 KB5055518 update fixes random text when printing\nMicrosoft: March Windows updates mistakenly uninstall Copilot"
    },
    {
        "Title": "SK Telecom warns customer USIM data exposed in malware attack",
        "Link": "https://www.bleepingcomputer.com/news/security/sk-telecom-warns-customer-usim-data-exposed-in-malware-attack/",
        "Summary": "South Korea's largest mobile operator, SK Telecom, is warning that a malware infection allowed threat actors to access sensitive USIM-related information for customers. [...]",
        "Date": "2025-04-22",
        "Content": "South Korea's largest mobile operator, SK Telecom, is warning that a malware infection allowed threat actors to access sensitive USIM-related information for customers.\nSK Telecom is the largest mobile network operator in South Korea, holding approximately\n48.4%\nof the mobile phone service market in the country, corresponding to 34 million subscribers.\nThe company says they detected malware on their systems at 11 PM local time on Saturday, April 19, 2025, in a weekend cyberattack when most organizations are understaffed.\n\"Once we became aware of the possible leak, we immediately deleted the malware and isolated the equipment suspected of being hacked,\"\nreads the security notice\n.\n\"As of now, there have been no confirmed cases of the leaked information being misused.\"\nThe breach was reported to the Korea Internet & Security Agency (KISA) the following day, and the country's Personal Information Protection Commission was notified earlier today.\nInvestigations are underway, and the compromise's exact cause, scale, or scope has not yet been determined.\nUSIM data is information stored on a Universal Subscriber Identity Module (USIM), which typically includes International Mobile Subscriber Identity (IMSI), Mobile Station ISDN Number (MSISDN), authentication keys, network usage data, and SMS or contacts if stored on the SIM.\nThis data could be used for targeted surveillance, tracking, and SIM-swap attacks.\nWhile SK Telecom says there is no evidence that the leaked data has been abused, the company has strengthened blocks of USIM swaps and abnormal authentication attempts and will immediately suspend service for accounts linked to suspicious activity.\nSubscribers are recommended to sign up for USIM protection service\nthrough this portal\n, which blocks mobile numbers from being ported to another SIM card when enabled.\nAt the time of writing, no threat actors have taken responsibility for the attack at SK Telecom.\nRelated Articles:\nEntertainment services giant Legends International discloses data breach\nData breach at Japanese telecom giant NTT hits 18,000 companies\nChinese hackers target Russian govt with upgraded RAT malware\nAhold Delhaize confirms data theft after INC ransomware claims attack\nLandmark Admin data breach impact now reaches 1.6 million people"
    },
    {
        "Title": "Ripple's recommended XRP library xrpl.js hacked to steal wallets",
        "Link": "https://www.bleepingcomputer.com/news/security/ripples-recommended-xrp-library-xrpljs-hacked-to-steal-wallets/",
        "Summary": "The recommended Ripple cryptocurrency NPM JavaScript library named \"xrpl.js\" was compromised to steal XRP wallet seeds and private keys and transfer them to an attacker-controlled server, allowing threat actors to steal all the funds stored in the wallets. [...]",
        "Date": "2025-04-22",
        "Content": "The recommended Ripple cryptocurrency NPM JavaScript library named \"xrpl.js\" was compromised to steal XRP wallet seeds and private keys and transfer them to an attacker-controlled server, allowing threat actors to steal all the funds stored in the wallets.\nMalicious code was added to versions 2.14.2, 4.2.1, 4.2.2, 4.2.3, and 4.2.4 of the xrpl NPM package and published to the NPM registry yesterday between 4:46 PM and 5:49 PM ET. These compromised versions have since been removed, and a clean 4.2.5 release is now available that all users should upgrade to immediately.\nThe xrpl.js library is maintained by the XRP Ledger Foundation (XRPLF) and is Ripple's recommended library for interacting with the XRP blockchain via JavaScript. It enables wallet operations, XRP transfers, and other ledger features. Due to it being the recommended library for interacting with the XRP blockchain, it has seen widespread adoption, with over 140,000 downloads over the past week.\nThe NPM library\nwas modified\nwith a suspicious method named\ncheckValidityOfSeed\nappended to the end of the \"\n/src/index.ts\n\" file in the compromised versions.\nThis function accepts a string as an argument, which is then forwarded via HTTP POST requests to\nhttps://0x9c[.]xyz/xcm\n, where the threat actors can collect it. The code attempted to be stealthy by using an \"ad-refferal \" user agent to make it look like an ad request to network traffic monitoring systems.\nMalicious code inserted into xrpl.js NPM library\nSource: BleepingComputer\nAccording to developer security company\nAikido\n, the checkValidityOfSeed() function is called in various functions where it is used to steal XRP wallet's seeds, private keys, and mnemonics.\nStealing data via the checkValidityOfSeed function\nSource: Akido\nThreat actors can use this information to import a stolen XRP wallet on their own devices to drain any funds within it.\nBleepingComputer has determined that the compromised versions were uploaded at different times and have had a total of 452 downloads:\n4.2.1:\nMonday, April 21, 2025 4:46:24.710 PM ET - 57 downloads\n4.2.2:\nMonday, April 21, 2025 4:55:55.822 PM ET- 106 downloads\n4.2.3:\nMonday, April 21, 2025 5:32:24.445 PM ET - 69 downloads\n2.14.2:\nMonday, April 21, 2025 5:37:09.418 PM ET - 41 downloads\n4.2.4:\nMonday, April 21, 2025 5:49:35.179 PM ET - 179 downloads\nWhile the total downloads is not large, this library was likely used to manage and interface with a far larger number of XRP wallets.\nThe malicious code appears to have been\nadded by a developer account\nassociated with the Ripple organization, likely through compromised credentials.\nThe malicious commits do not appear in the public GitHub repository, indicating that the attack may have occurred during the NPM publishing process.\n\"If you are using one of these versions, stop immediately and rotate any private keys or secrets used with affected systems. The XRP Ledger supports key rotation:\nhttps://xrpl.org/docs/tutorials/how-tos/manage-account-settings/assign-a-regular-key-pair\n.\"\n\"If any account's master key is potentially compromised, you should disable it:\nhttps://xrpl.org/docs/tutorials/how-tos/manage-account-settings/disable-master-key-pair\n.\"\nThe developers also posted to X, stating that the XRP Ledger codebase or GitHub repository were not impacted.\n\"To clarify: This vulnerability is in xrpl.js, a JavaScript library for interacting with the XRP Ledger. It does NOT affect the XRP Ledger codebase or Github repository itself. Projects using xrpl.js should upgrade to v4.2.5 immediately,\"\nthe XRP Ledger Foundation posted to X\n.\nThe developers have also confirmed that the Xaman Wallet, XRPScan, First Ledger, and Gen3 Games projects were not affected by the supply chain attack.\nThis supply chain attack is similar to previous compromises of\nEthereum\nand\nSolana\nNPMs used to steal wallet seeds and private keys.\nUpdate 4/22/25: Added statement from the XRP Ledger Foundation posted to X.\nRelated Articles:\nPoisonSeed phishing campaign behind emails with wallet seed phrases\nUS seizes $23 million in crypto linked to LastPass breaches\nNorth Korean Lazarus hackers infect hundreds via npm packages\nHackers abuse Zoom remote control feature for crypto-theft attacks\nFake Microsoft Office add-in tools push malware via SourceForge"
    },
    {
        "Title": "Cookie-Bite attack PoC uses Chrome extension to steal session tokens",
        "Link": "https://www.bleepingcomputer.com/news/security/cookie-bite-attack-poc-uses-chrome-extension-to-steal-session-tokens/",
        "Summary": "A proof-of-concept attack called \"Cookie-Bite\" uses a browser extension to steal browser session cookies from Azure Entra ID to bypass multi-factor authentication (MFA) protections and maintain access to cloud services like Microsoft 365, Outlook, and Teams. [...]",
        "Date": "2025-04-22",
        "Content": "A proof-of-concept attack called \"Cookie-Bite\" uses a browser extension to steal browser session cookies from Azure Entra ID to bypass multi-factor authentication (MFA) protections and maintain access to cloud services like Microsoft 365, Outlook, and Teams.\nThe attack was devised by\nVaronis security researchers\n, who shared a proof-of-concept (PoC) method involving a malicious and a legitimate Chrome extension. However, stealing session cookies is not novel, as infostealers and adversary-in-the-middle phishing attacks commonly target them.\nWhile stealing cookies to breach accounts is not a new concept, the use of a malicious Chrome browser extension in the Cookie-Bite technique is noteworthy for its stealth and persistence.\nCookie extension attack\nThe Cookie-Bite attack consists of a malicious Chrome extension that acts as an infostealer, targeting the 'ESTAUTH' and 'ESTSAUTHPERSISTNT' cookies in Azure Entra ID, Microsoft's cloud-based identity and access management (IAM) service.\nESTAUTH is a transient session token that indicates that the user is authenticated and has completed MFA. It remains valid for the browser session for up to 24 hours and expires when the app is closed.\nESTSAUTHPERSISTENT is the persistent version of the session cookie created when users opt to \"Stay signed in\" or when Azure applies the KMSI policy, keeping it valid for up to 90 days.\nIt should be noted that while this extension was created to target Microsoft session cookies, it can be modified to target other services, including Google, Okta, and AWS cookies.\nVaronis' malicious Chrome extension contains logic to monitor the victim's login events, listening for tab updates that match Microsoft login URLs.\nWhen a login occurs, it reads all cookies scoped to 'login.microsoftonline.com,' applies filtering to extract the two mentioned tokens, and exfiltrates the cookie JSON data to the attacker via a Google Form.\n\"After packing the extension into a CRX file and uploading it to VirusTotal, the result shows that no security vendors currently detect it as malicious,\" warned Varonis.\nChrome extensions stealing Microsoft session cookies\nSource: Varonis\nIf threat actors have access to the device, they can deploy a PowerShell script that runs via the Windows Task Scheduler to automate the re-injection of the unsigned extension at every launch of Chrome using developer mode.\nPowerShell used in the attack example\nSource: Varonis\nOnce a cookie is stolen, the attackers inject it into the browser like any other stolen cookie. This can be done through tools like the legitimate\nCookie-Editor\nChrome extension, which allows the threat actor to import the stolen cookies into their browser under 'login.microsoftonline.com.'\nAfter refreshing the page, Azure treats the attacker's session as fully authenticated, bypassing MFA and giving the attacker the same level of access as the victim.\nInjecting the stolen cookie\nSource: Varonis\nFrom there, the attacker may use Graph Explorer to enumerate users, roles, and devices, send messages or access chats on Microsoft Teams, and read or download emails via Outlook Web.\nFurther exploitation like privilege escalation, lateral movement, and unauthorized app registrations are also possible via tools like TokenSmith, ROADtools, and AADInternals.\nOverview of the Cookie-Bite attack\nSource: Varonis\nMicrosoft flagged the researchers' login attempts in the attack demonstration as \"atRisk\" due to them using a VPN, so monitoring for abnormal sign-ins is key to preventing these attacks.\nAdditionally, it is recommended that conditional access policies (CAP) be enforced to limit logins to specific IP ranges and devices.\nConcerning Chrome extensions, it is recommended that Chrome ADMX policies be enforced to allow only pre-approved extensions to run and block users from the browser's Developer Mode entirely.\nRelated Articles:\nChrome extensions with 6 million installs have hidden tracking code\nMalicious Chrome extensions can spoof password managers in new attack\nASUS warns of critical auth bypass flaw in routers using AiCloud\nEnhance your resume with this Microsoft Azure certification course deal\nChrome 136 fixes 20-year browser history privacy risk"
    },
    {
        "Title": "Microsoft Purges Millions of Cloud Tenants in Wake of Storm-0558",
        "Link": "https://www.darkreading.com/cloud-security/microsoft-millions-cloud-tenants-storm-0558",
        "Summary": "The tech giant is boosting Entra ID and MSA security as part of the wide-ranging Secure Future Initiative (SFI) that the company launched following a Chinese APT's breach of its Exchange Online environment in 2023.",
        "Date": "2025-04-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/microsoft-millions-cloud-tenants-storm-0558"
    },
    {
        "Title": "City of Abilene Goes Offline in Wake of Cyberattack",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/city-abilene-offline-after-cyberattack",
        "Summary": "The Texas municipality is following its incident response playbook as it works with a third-party to investigate the scope and scale of the attack.",
        "Date": "2025-04-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/city-abilene-offline-after-cyberattack"
    },
    {
        "Title": "3 More Healthcare Orgs Hit by Ransomware Attacks",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/healthcare-orgs-hit-ransomeware-attacks",
        "Summary": "Dialysis firm DaVita, Wisconsin-based Bell Ambulance, and Alabama Ophthalmology Associates all suffered apparent or confirmed ransomware attacks this month.",
        "Date": "2025-04-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/healthcare-orgs-hit-ransomeware-attacks"
    },
    {
        "Title": "'Cookie Bite' Entra ID Attack Exposes Microsoft 365",
        "Link": "https://www.darkreading.com/remote-workforce/cookie-bite-entra-id-attack-exposes-microsoft-365",
        "Summary": "A proof-of-concept (PoC) attack vector exploits two Azure authentication tokens from within a browser, giving threat actors persistent access to key cloud services, including Microsoft 365 applications.",
        "Date": "2025-04-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/cookie-bite-entra-id-attack-exposes-microsoft-365"
    },
    {
        "Title": "DeepSeek Breach Opens Floodgates to Dark Web",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/deepseek-breach-opens-floodgates-dark-web",
        "Summary": "The incident should serve as a critical wake-up call. The stakes are simply too high to treat AI security as an afterthought — especially when the Dark Web stands ready to capitalize on every vulnerability.",
        "Date": "2025-04-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/deepseek-breach-opens-floodgates-dark-web"
    },
    {
        "Title": "Whistleblower: DOGE Siphoned NLRB Case Data",
        "Link": "https://krebsonsecurity.com/2025/04/whistleblower-doge-siphoned-nlrb-case-data/",
        "Summary": "A security architect with the National Labor Relations Board (NLRB) alleges that employees from Elon Musk's Department of Government Efficiency (DOGE) transferred gigabytes of sensitive data from agency case files in early March, using short-lived accounts configured to leave few traces of network activity. The NLRB whistleblower said the unusual large data outflows coincided with multiple blocked login attempts from an Internet address in Russia that tried to use valid credentials for a newly-created DOGE user account.",
        "Date": "2025-04-22",
        "Content": "A security architect with the National Labor Relations Board (NLRB) alleges that employees from Elon Musk‘s Department of Government Efficiency (DOGE) transferred gigabytes of sensitive data from agency case files in early March, using short-lived accounts configured to leave few traces of network activity. The NLRB whistleblower said the unusual large data outflows coincided with multiple blocked login attempts from an Internet address in Russia that tried to use valid credentials for a newly-created DOGE user account.\nThe cover letter from Berulis’s whistleblower statement, sent to the leaders of the Senate Select Committee on Intelligence.\nThe allegations came in an April 14 letter to the Senate Select Committee on Intelligence, signed by Daniel J. Berulis, a 38-year-old security architect at the NLRB.\nNPR, which was the first to report on Berulis’s whistleblower complaint, says NLRB is a small, independent federal agency that investigates and adjudicates complaints about unfair labor practices, and stores “reams of potentially sensitive data, from confidential information about employees who want to form unions to proprietary business information.”\nThe complaint documents a one-month period beginning March 3, during which DOGE officials reportedly demanded the creation of all-powerful “tenant admin” accounts in NLRB systems that were to be exempted from network logging activity that would otherwise keep a detailed record of all actions taken by those accounts.\nBerulis said the new DOGE accounts had unrestricted permission to read, copy, and alter information contained in NLRB databases. The new accounts also could restrict log visibility, delay retention, route logs elsewhere, or even remove them entirely — top-tier user privileges that neither Berulis nor his boss possessed.\nBerulis writes that on March 3, a black SUV accompanied by a police escort arrived at his building — the NLRB headquarters in Southeast Washington, D.C. The DOGE staffers did not speak with Berulis or anyone else in NLRB’s IT staff, but instead met with the agency leadership.\n“Our acting chief information officer told us not to adhere to standard operating procedure with the DOGE account creation, and there was to be no logs or records made of the accounts created for DOGE employees, who required the highest level of access,” Berulis wrote of their instructions after that meeting.\n“We have built in roles that auditors can use and have used extensively in the past but would not give the ability to make changes or access subsystems without approval,” he continued. “The suggestion that they use these accounts was not open to discussion.”\nBerulis found that on March 3 one of the DOGE accounts created an opaque, virtual environment known as a “container,” which can be used to build and run programs or scripts without revealing its activities to the rest of the world. Berulis said the container caught his attention because he polled his colleagues and found none of them had ever used containers within the NLRB network.\nBerulis said he also noticed that early the next morning — between approximately 3 a.m. and 4 a.m. EST on Tuesday, March 4  — there was a large increase in outgoing traffic from the agency. He said it took several days of investigating with his colleagues to determine that one of the new accounts had transferred approximately 10 gigabytes worth of data from the NLRB’s NxGen case management system.\nBerulis said neither he nor his co-workers had the necessary network access rights to review which files were touched or transferred — or even where they went. But his complaint notes the NxGen database contains sensitive information on unions, ongoing legal cases, and corporate secrets.\n“I also don’t know if the data was only 10gb in total or whether or not they were consolidated and compressed prior,” Berulis told the senators. “This opens up the possibility that even more data was exfiltrated. Regardless, that kind of spike is extremely unusual because data almost never directly leaves NLRB’s databases.”\nBerulis said he and his colleagues grew even more alarmed when they noticed nearly two dozen login attempts from a Russian Internet address (83.149.30,186) that presented valid login credentials for a DOGE employee account — one that had been created just minutes earlier. Berulis said those attempts were all blocked thanks to rules in place that prohibit logins from non-U.S. locations.\n“Whoever was attempting to log in was using one of the newly created accounts that were used in the other DOGE related activities and it appeared they had the correct username and password due to the authentication flow only stopping them due to our no-out-of-country logins policy activating,” Berulis wrote. “There were more than 20 such attempts, and what is particularly concerning is that many of these login attempts occurred within 15 minutes of the accounts being created by DOGE engineers.”\nAccording to Berulis, the naming structure of one Microsoft user account connected to the suspicious activity suggested it had been created and later deleted for DOGE use in the NLRB’s cloud systems: “DogeSA_2d5c3e0446f9@nlrb.microsoft.com.” He also found other new Microsoft cloud administrator accounts with nonstandard usernames, including “Whitesox, Chicago M.” and “Dancehall, Jamaica R.”\nA screenshot shared by Berulis showing the suspicious user accounts.\nOn March 5, Berulis documented that a large section of logs for recently created network resources were missing, and a network watcher in Microsoft Azure was set to the “off” state, meaning it was no longer collecting and recording data like it should have.\nBerulis said he discovered someone had downloaded three external code libraries from GitHub that neither NLRB nor its contractors ever use. A “readme” file in one of the code bundles explained it was created to rotate connections through a large pool of cloud Internet addresses that serve “as a proxy to generate pseudo-infinite IPs for web scraping and brute forcing.” Brute force attacks involve automated login attempts that try many credential combinations in rapid sequence.\nThe complaint alleges that by March 17 it became clear the NLRB no longer had the resources or network access needed to fully investigate the odd activity from the DOGE accounts, and that on March 24, the agency’s associate chief information officer had agreed the matter should be reported to US-CERT. Operated by the Department of Homeland Security’s Cybersecurity and Infrastructure Security Agency (CISA), US-CERT provides on-site cyber incident response capabilities to federal and state agencies.\nBut Berulis said that between April 3 and 4, he and the associate CIO were informed that “instructions had come down to drop the US-CERT reporting and investigation and we were directed not to move forward or create an official report.” Berulis said it was at this point he decided to go public with his findings.\nAn email from Daniel Berulis to his colleagues dated March 28, referencing the unexplained traffic spike earlier in the month and the unauthorized changing of security controls for user accounts.\nTim Bearese, the NLRB’s acting press secretary, told NPR that DOGE neither requested nor received access to its systems, and that “the agency conducted an investigation after Berulis raised his concerns but ‘determined that no breach of agency systems occurred.'” The NLRB did not respond to questions from KrebsOnSecurity.\nNevertheless, Berulis has shared a number of supporting screenshots showing agency email discussions about the unexplained account activity attributed to the DOGE accounts, as well as NLRB security alerts from Microsoft about network anomalies observed during the timeframes described.\nAs CNN reported last month, the NLRB has been effectively hobbled since President Trump fired three board members, leaving the agency without the quorum it needs to function.\n“Despite its limitations, the agency had become a thorn in the side of some of the richest and most powerful people in the nation — notably Elon Musk, Trump’s key supporter both financially and arguably politically,” CNN wrote.\nBoth Amazon and Musk’s SpaceX have been suing the NLRB over complaints the agency filed in disputes about workers’ rights and union organizing, arguing that the NLRB’s very existence is unconstitutional. On March 5, a U.S. appeals court unanimously rejected Musk’s claim that the NLRB’s structure somehow violates the Constitution.\nBerulis shared screenshots with KrebsOnSecurity showing that on the day the NPR published its story about his claims (April 14), the deputy CIO at NLRB sent an email stating that administrative control had been removed from all employee accounts. Meaning, suddenly none of the IT employees at the agency could do their jobs properly anymore, Berulis said.\nAn email from the NLRB’s associate chief information officer Eric Marks, notifying employees they will lose security administrator privileges.\nBerulis shared a screenshot of an agency-wide email dated April 16 from NLRB director Lasharn Hamilton saying DOGE officials had requested a meeting, and reiterating claims that the agency had no prior “official” contact with any DOGE personnel. The message informed NLRB employees that two DOGE representatives would be detailed to the agency part-time for several months.\nAn email from the NLRB Director Lasharn Hamilton on April 16, stating that the agency previously had no contact with DOGE personnel.\nBerulis told KrebsOnSecurity he was in the process of filing a support ticket with Microsoft to request more information about the DOGE accounts when his network administrator access was restricted. Now, he’s hoping lawmakers will ask Microsoft to provide more information about what really happened with the accounts.\n“That would give us way more insight,” he said. “Microsoft has to be able to see the picture better than we can. That’s my goal, anyway.”\nBerulis’s attorney told lawmakers that on April 7, while his client and legal team were preparing the whistleblower complaint, someone physically taped a threatening note to Mr. Berulis’s home door with photographs — taken via drone — of him walking in his neighborhood.\n“The threatening note made clear reference to this very disclosure he was preparing for you, as the proper oversight authority,” reads a preface by Berulis’s attorney Andrew P. Bakaj. “While we do not know specifically who did this, we can only speculate that it involved someone with the ability to access NLRB systems.”\nBerulis said the response from friends, colleagues and even the public has been largely supportive, and that he doesn’t regret his decision to come forward.\n“I didn’t expect the letter on my door or the pushback from [agency] leaders,” he said. “If I had to do it over, would I do it again? Yes, because it wasn’t really even a choice the first time.”\nFor now, Mr. Berulis is taking some paid family leave from the NLRB. Which is just as well, he said, considering he was stripped of the tools needed to do his job at the agency.\n“They came in and took full administrative control and locked everyone out, and said limited permission will be assigned on a need basis going forward” Berulis said of the DOGE employees. “We can’t really do anything, so we’re literally getting paid to count ceiling tiles.”\nFurther reading: Berulis’s complaint (PDF).\n\r\n         This entry was posted on Monday 21st of April 2025 09:48 PM \r\n         \nRIPPope\nMy initial thought was that DOGE was conducting penetration testing using a VPN or Tor routed through a Russian IP address. However, it turns out this IP is actually associated with a mobile device – likely a cellphone or a modem…\nThe multiple login attempts from a Russian IP sounds too amateurish to believe.  If 1 or 2 login attempts fail, wouldn’t they immediately drop to a US proxy or VPN?    Or just use a US proxy/VPN from the first login?\nOTOH maybe they used a VPN intentionally to blame Russia…\nOr DOGE forgot to turn off their Russian VPN they were using before logging in.\nThe credentials had just been created within 15 minutes or so.  A small group obtains those hot JIT credentials and tries to login a few times each?  Assuming they have centralized operation infrastructure w/ distributed access.  Maybe it gave some obscure error code and they were trying different setups?  I wouldn’t say that’s the least believable part, it’s all pretty unbelievable isn’t it?\nBut absolutely everything DOGE does sounds too amateurish to believe. That’s why I have no doubt it’s them. (Also it was clear years before: this government would sell every single American asset to Russia for an apple.)\nHow do you know they didn’t use a VPN.  The same day this they figured out the report was to be published, 3 top people at NSA were fired. It sounds like they contacted the NSA and they tracked it. That would be classified information and not released publicly. Why was he threatened multiple times not to release the report? Why would they worry if it was not true. He signed a sworn affidavit and it a felony to do what he did and lie. But you think it is made up makes sense. They lied about doge being granted access. They said they were never given access but subsequently the Whitehouse confirmed they were given access to the systems. Someone is lying. Either trumps people at the NLRB or the Whitehouse. Either way they are lying about what happened. But your simplistic explanation is supposed to refute it. It nonsense.\nWell he didn’t say it “didn’t happen” but that it was “unbelievable” which is subtly different.\nThat’s an excellent distinction.\nI’m more likely to believe “unbelievable” than “didn’t happen”.\nEven on my least sensitive systems, I go out of may way to make sure that everything requiring any kind of privileges is logged.\nThank God for whistleblowers and thank journalists for covering it.\nand you’re mentally ill ..\nMusk is far more corrupt that I thought! DODGE is far more suspicious and crooked, especially under Musk. Then there is the Russian connection. What is that all about? I fear what is coming.\nThey want to rewrite millions of lines of code used by the Social Security Administration.  If you wanted to siphon off billions of dollars yearly from Social Security, that would be the way to go.\n wowo you’re some high level moron, seek help\nThis is just evil, and stupid. Forgot firewalls and IPSs, they can just be circumvented by the lackey of a billionaire in a black SUV.  Next time, physical security should just shoot.\nI cannot imagine any legitimate reason to create accounts with logging disabled.  Why would that capability even exist?\nThank you Mr Daniel, you did the right thing at great cost.\nThe Trusted News Initiative is hard at work.\nIt would probably be the top news in a normal administration. With this one, it would barely make the headlines. The problem with the U.S. system is that there’s absolutely nothing that we can do now since the congress is just looking the other way and the executive branch is the Russian asset. \nThis would either be the birth of the United States of Fascist America, or the end of the republican party, that after this election will never be able to elect another candidate. We shall see.\nSo…Russia is involved because they ran…a docker container?\nHow’s that boot taste?\nReading is involved.  If you can’t read, raise your hand and a teacher will come around to help.\nDOGE is saying it never happened.\nhttps://x.com/amuse/status/1913665346281656394\nBTW, quoting NPR doesn’t help the case as they are hardly an unbiased source.\nNPR is far more unbiased than DOGE, themselves.\nAnother spinless lacky. The sad part is, even if we do get past this regime people like you get to carry on like nothing happened.\n“…quoting NPR doesn’t help the case as they are hardly an unbiased source.”  Now, that is an understatement if there ever was one.\nSo find factual fault or don’t.  We’ll wait.\nDOGE is also saying they’re both in control of cuts and not in control of cuts… that Leon is in charge and also not.  \nYou believe what they say without checking into it?  Then you’re exactly the sort of voter they’re looking for.\nThese DOGE invasions are unrecoverable. We are literally watching the end of America as we know it.\nDOGE destroying the government and Tesla getting super-contracts. Just wrap it all up and throw it away at this point.\nI wish to God that Anonymous would get on the job of hacking the Doge idiots and all of Musk’s businesses. They’ve destroyed the US State Dept., the EPA, and will probably destroy the Social Security system using Musk’s half-*ssed AI, Grok. The only thing that will stop the Trumpists is technology, not some sad little demonstrations w/ppl holding signs fgs! If I had the skills I’d do it myself!\nyeth… anonymuth is vewy vewy powerful… we do nawt fowgive… we do not fowget… expect us…\nYOU CAN GET THESE TYPES OF SIGNINS ON ANY FKING ACCOUNT IN O365, these are typical botnet attempts they can show up from any country. AND DO NOTHING IF YOU HAVE MFA. But you really proved that you’re some dumb sH***t mf and you call yourself cyber security expert.. you’re fking propaganda spreading leftist woke mf.\nNurse! He needs another dose of Ivermectin!\nHow does a botnet get the correct password for a brand new account? That’s an incident in its own right.\nThat’s exactly the point.  The credentials were brand new and valid.  That part is EVERYTHING.\nThe credentials were 15 minutes old.  Valid credentials newly created for DOGE, not a brute force.\nI know the dept of Education has been gutted but that doesn’t mean you just give up on having a functional mind.  You need to read, let the words bounce around in your tiny skull, process them, THEN spout irrational knee-jerk nonsense, ok?\nKerbs and the whistleblower are framing this as a sophisticated nation-state attack leveraging DOGE to exploit the NLRB. But that doesn’t add up. Nation-state actors don’t blow their cover because they proxy with clean IPs from within the target country. The IP address in question (83.149.30[.]186) has had a bad reputation in open-source intelligence for over a year, linked to credential stuffing and scanning activity. Using an IP like that in a high-level operation is like flying a spy plane into enemy airspace with inflatable tube men and disco balls strapped to the wings. Attacks of this complexity require significant time and resources—no serious actor would risk burning their investment by using an IP already flagged and based in Russia. What is more likely- the DOGE employee’s creds were leaked, he’s reusing passwords, or using a weak password and they got password sprayed.\nCISA and US-CERT are not a bunch for scrubs. If their official statement is that it’s not a security incident then I trust them.\nI see no official statement from CISA and/or US-CERT that it’s not a security incident. Where are you reading that or did you just make it up?\n“instructions had come down to drop the US-CERT reporting and investigation and we were directed not to move forward or create an official report.” That means it was not incident read between the lines dude. Also google the guy’s name you’ll find articles stating National Labor Relations Board saying it wasn’t an incident.\nAh, so because the higher-ups at NLRB denied everything, it never happened? Newsflash: You can always find “articles” offering almost any kind of take on any big story, but a lot of those publications offer conclusions without supporting them with facts. And if you’re asking AI to tell you the truth, their LLM crawlers are getting fed a ton of real fake news to create a ton of a “stories” that offer unsubstantiated explanations but which are not made for human consumption.\nI will wait for more information.  There are a ton of false naratives being pushed to try and discredit any meaningful and necessary reduction in fraud, waste, and abuse in the government.  As an example of the kind if thing taking place, there was a widespread story being pushed recently that an American citizen was wrongly being held by immigration officials for ten days.  As it turned out, the likes of NPR and other Leftists media didn’t have the real story.  On its face, this seemed like a pretty big flub by federal officials. After all, no one should want a government that can mistakenly arrest you and hold you for ten days without any evidence that you’re an illegal alien. There’s just one problem, though. Hermosillo not only told immigration officials he crossed the border illegally, but he also signed a statement swearing that as well.  So, just take a seat and stop gaslighting us about “the world coming to an end”.\nAre you okay?  There are dozens and dozens of reported incidents of American citizens being arrested and held for days on suspicion of being in the country illegally despite having all their paperwork.  I’m sure these facts must bother you because you’re such a defender of the Constitution and human rights generally, right George?  \nnbcnews.com/news/latino/us-born-citizen-detained-ice-immigration-florida-rcna201800\n“A U.S.-born American citizen was being detained at the request of immigration authorities Thursday despite an advocate showing his U.S. birth certificate in court and a county judge finding no reason for him to be considered an “illegal alien” who illegally entered Florida.”\nThat’s a single example.  I’m sure you can twist in the wind and try to weasel out of reading it, but give it a shot first before you hand-wave and pretend none of this is actually happening, ostrich style.  Be a man.\nTake a seat and read something George.  Chrissake, you’re doing what you accuse Krebs of in reverse.  \nRead it.  Find something to say that’s factual.  Hand-waving and pretending this is made up is pure FUD.\nIf I am reading things right, so far Krebs has only pointed out the facts: what everyone has said.\nI am looking forward to him maybe shedding light on details that support or deny the allegations.\nMust have been a chinese hacker using a russian vpn… many such cases\nnice how you framed a docker container, a ubiquitous tool for this kind of work for at least the  last 10 years, as super super scary.\nKrebs, the tech-bro who cried wolf.\nDid you even read it?  The agency in question didn’t use the containers, that’s why it stood out as odd.  \nMaybe some remedial reading courses are in order.  Krebs didn’t invent that.\nFrom NPR article\n“The whistleblower’s account is corroborated by internal documentation and was reviewed by 11 technical experts across other government agencies and the private sector.”\nHopefully we can get a bit more of these details.\nIt’s an indicator of how much actual, credible information Brian is presenting that it’s drawing this many MAGA/MUSK lackeys to ‘dispute’ it.\nI don’t know how you don’t lose your mind writing these Brian. The moment my eyes hit the comment section I lose all hope in humanity.\nThank you, Steve. Same here. It’s like almost any other forum these days. The first couple of comments are generally sensible and relate to the post, but the further down you go, the more rabid and foam spewing appears. Anonymity does strange things to people.\nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "Cloud Data Security Play Sentra Raises $50 Million Series B",
        "Link": "https://www.securityweek.com/cloud-data-security-play-sentra-raises-50-million-series-b/",
        "Summary": "<p>Sentra has now raised north of $100 million for controls technology to keep sensitive data out of misconfigured AI workflows.</p>\n<p>The post <a href=\"https://www.securityweek.com/cloud-data-security-play-sentra-raises-50-million-series-b/\">Cloud Data Security Play Sentra Raises $50 Million Series B </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cloud-data-security-play-sentra-raises-50-million-series-b/"
    },
    {
        "Title": "DataKrypto Launches Homomorphic Encryption Framework to Secure Enterprise AI Models",
        "Link": "https://www.securityweek.com/datakrypto-launches-homomorphic-encryption-framework-to-secure-enterprise-ai-models/",
        "Summary": "<p>DataKrypto’s FHEnom for AI combines real-time homomorphic encryption with trusted execution environments to protect enterprise data and models from leakage, exposure, and tampering.</p>\n<p>The post <a href=\"https://www.securityweek.com/datakrypto-launches-homomorphic-encryption-framework-to-secure-enterprise-ai-models/\">DataKrypto Launches Homomorphic Encryption Framework to Secure Enterprise AI Models</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/datakrypto-launches-homomorphic-encryption-framework-to-secure-enterprise-ai-models/"
    },
    {
        "Title": "Cyberattack Knocks Texas City’s Systems Offline",
        "Link": "https://www.securityweek.com/cyberattack-knocks-texas-citys-systems-offline/",
        "Summary": "<p>The city of Abilene, Texas, is scrambling to restore systems that have been taken offline in response to a cyberattack.</p>\n<p>The post <a href=\"https://www.securityweek.com/cyberattack-knocks-texas-citys-systems-offline/\">Cyberattack Knocks Texas City’s Systems Offline</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cyberattack-knocks-texas-citys-systems-offline/"
    },
    {
        "Title": "SSL.com Scrambles to Patch Certificate Issuance Vulnerability",
        "Link": "https://www.securityweek.com/ssl-com-scrambles-to-patch-certificate-issuance-vulnerability/",
        "Summary": "<p>A vulnerability in SSL.com has resulted in nearly a dozen certificates for legitimate domains being wrongly issued.</p>\n<p>The post <a href=\"https://www.securityweek.com/ssl-com-scrambles-to-patch-certificate-issuance-vulnerability/\">SSL.com Scrambles to Patch Certificate Issuance Vulnerability </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/ssl-com-scrambles-to-patch-certificate-issuance-vulnerability/"
    },
    {
        "Title": "Open Source Security Firm Hopper Emerges From Stealth With $7.6M in Funding",
        "Link": "https://www.securityweek.com/open-source-security-firm-hopper-emerges-from-stealth-with-7-6m-in-funding/",
        "Summary": "<p>Hopper has emerged from stealth mode with a solution designed to help organizations manage open source software risk.</p>\n<p>The post <a href=\"https://www.securityweek.com/open-source-security-firm-hopper-emerges-from-stealth-with-7-6m-in-funding/\">Open Source Security Firm Hopper Emerges From Stealth With $7.6M in Funding</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/open-source-security-firm-hopper-emerges-from-stealth-with-7-6m-in-funding/"
    },
    {
        "Title": "Many Malware Campaigns Linked to Proton66 Network",
        "Link": "https://www.securityweek.com/many-malware-campaigns-linked-to-proton66-network/",
        "Summary": "<p>Security researchers detail various malware campaigns that use bulletproof services linked to Proton66 ASN.</p>\n<p>The post <a href=\"https://www.securityweek.com/many-malware-campaigns-linked-to-proton66-network/\">Many Malware Campaigns Linked to Proton66 Network</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/many-malware-campaigns-linked-to-proton66-network/"
    },
    {
        "Title": "Legacy Google Service Abused in Phishing Attacks",
        "Link": "https://www.securityweek.com/legacy-google-service-abused-in-phishing-attacks/",
        "Summary": "<p>A sophisticated phishing campaign abuses weakness in Google Sites to spoof Google no-reply addresses and bypass protections.</p>\n<p>The post <a href=\"https://www.securityweek.com/legacy-google-service-abused-in-phishing-attacks/\">Legacy Google Service Abused in Phishing Attacks</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/legacy-google-service-abused-in-phishing-attacks/"
    },
    {
        "Title": "UN Researchers Warn That Asian Scam Operations Are Spreading Across the Rest of the World",
        "Link": "https://www.securityweek.com/un-researchers-warn-that-asian-scam-operations-are-spreading-across-the-rest-of-the-world/",
        "Summary": "<p>Transnational organized crime groups in East and Southeast Asia are spreading their lucrative scam operations across the globe, according to a UN report.</p>\n<p>The post <a href=\"https://www.securityweek.com/un-researchers-warn-that-asian-scam-operations-are-spreading-across-the-rest-of-the-world/\">UN Researchers Warn That Asian Scam Operations Are Spreading Across the Rest of the World</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/un-researchers-warn-that-asian-scam-operations-are-spreading-across-the-rest-of-the-world/"
    },
    {
        "Title": "Two Healthcare Orgs Hit by Ransomware Confirm Data Breaches Impacting Over 100,000",
        "Link": "https://www.securityweek.com/two-healthcare-orgs-hit-by-ransomware-confirm-data-breaches-impacting-over-100000/",
        "Summary": "<p>Bell Ambulance and Alabama Ophthalmology Associates have suffered data breaches affecting over 100,000 people after being targeted in ransomware attacks.</p>\n<p>The post <a href=\"https://www.securityweek.com/two-healthcare-orgs-hit-by-ransomware-confirm-data-breaches-impacting-over-100000/\">Two Healthcare Orgs Hit by Ransomware Confirm Data Breaches Impacting Over 100,000</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/two-healthcare-orgs-hit-by-ransomware-confirm-data-breaches-impacting-over-100000/"
    }
]