[
    {
        "Title": "WhatsApp Launches Private Processing to Enable AI Features While Protecting Message Privacy",
        "Link": "https://thehackernews.com/2025/04/whatsapp-launches-private-processing-to.html",
        "Summary": "Popular messaging app WhatsApp on Tuesday unveiled a new technology called Private Processing to enable artificial intelligence (AI) capabilities in a privacy-preserving manner.\n\"Private Processing will allow users to leverage powerful optional AI features – like summarizing unread messages or editing help – while preserving WhatsApp's core privacy promise,\" the Meta-owned service said in a",
        "Date": "2025-04-29",
        "Content": "Popular messaging app WhatsApp on Tuesday unveiled a new technology called Private Processing to enable artificial intelligence (AI) capabilities in a privacy-preserving manner.\n\"Private Processing will allow users to leverage powerful optional AI features – like summarizing unread messages or editing help – while preserving WhatsApp's core privacy promise,\" the Meta-owned service said in a statement\nshared\nwith The Hacker News.\nWith the introduction of the latest feature, the idea is to facilitate the use of AI features while still keeping users' messages private. It's expected to be made available in the coming weeks.\nThe capability, in a nutshell, allows users to initiate a request to process messages using AI within a secure environment called the confidential virtual machine (CVM) such that no other party, including Meta and WhatsApp, can access them.\nConfidential processing is one of the three tenets that underpin the feature, the others being -\nEnforceable guarantees, which cause the system to fail or become publicly discoverable when attempts to modify confidential processing guarantees are detected\nVerifiable transparency, which allows users and independent researchers to audit the behavior of the system\nNon-targetability, which prevents a particular user from being targeted without breaching the whole security architecture\nStateless processing and forward security, which ensures that messages are not retained once the messages are processed so that an attacker cannot recover historical requests or responses\nThe system is designed as follows: Private Processing obtains anonymous credentials to verify that future requests are coming from a legitimate WhatsApp client and then proceeds to establish an Oblivious HTTP (\nOHTTP\n) connection between the user's device and a Meta gateway via a third-party relay that also hides the source IP address from Meta and WhatsApp.\nA secure application session is subsequently established between the user's device and the Trusted Execution Environment (TEE), following which an encrypted request is made to the Private Processing system using an ephemeral key.\nThis also means that the request cannot be decrypted by anyone other than the TEE or the user's device from which the request (e.g., message summarization) is sent.\nThe data is processed in CVM and the results are sent back to the user's device in an encrypted format using a key that's accessible only on the device and the Private Processing server.\nMeta has also acknowledged the weak links in the system that could expose it to potential attacks via compromised insiders, supply chain risks, and malicious end users, but emphasised it has adopted a defense-in-depth approach to minimize the attack surface.\nFurthermore, the company has pledged to publish a third-party log of CVM binary digests and CVM binary images to help external researchers \"analyze, replicate, and report instances where they believe logs could leak user data.\"\nThe development comes as Meta\nreleased\na dedicated Meta AI app built with Llama 4 that comes with a \"social\" Discover feed to share and explore prompts and even remix them.\nPrivate Processing, in some ways, mirrors Apple's approach to confidential AI processing called Private Cloud Compute (\nPCC\n), which also routes PCC requests through an OHTTP relay and processes them in a sandboxed environment.\nLate last year, the iPhone maker\npublicly made available\nits PCC Virtual Research Environment (VRE) to allow the research community to inspect and verify the privacy and security guarantees of the system.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "New Reports Uncover Jailbreaks, Unsafe Code, and Data Theft Risks in Leading AI Systems",
        "Link": "https://thehackernews.com/2025/04/new-reports-uncover-jailbreaks-unsafe.html",
        "Summary": "Various generative artificial intelligence (GenAI) services have been found vulnerable to two types of jailbreak attacks that make it possible to produce illicit or dangerous content.\nThe first of the two techniques, codenamed Inception, instructs an AI tool to imagine a fictitious scenario, which can then be adapted into a second scenario within the first one where there exists no safety",
        "Date": "2025-04-29",
        "Content": "Various generative artificial intelligence (GenAI) services have been found vulnerable to two types of jailbreak attacks that make it possible to produce illicit or dangerous content.\nThe first of the two techniques, codenamed Inception, instructs an AI tool to imagine a fictitious scenario, which can then be adapted into a second scenario within the first one where there exists no\nsafety guardrails\n.\n\"Continued prompting to the AI within the second scenarios context can result in bypass of safety guardrails and allow the generation of malicious content,\" the CERT Coordination Center (CERT/CC)\nsaid\nin an advisory released last week.\nThe second jailbreak is realized by prompting the AI for information on how not to reply to a specific request.\n\"The AI can then be further prompted with requests to respond as normal, and the attacker can then pivot back and forth between illicit questions that bypass safety guardrails and normal prompts,\" CERT/CC added.\nSuccessful exploitation of either of the techniques could permit a bad actor to sidestep security and safety protections of various AI services like OpenAI ChatGPT, Anthropic Claude, Microsoft Copilot, Google Gemini, XAi Grok, Meta AI, and Mistral AI.\nThis includes illicit and harmful topics such as controlled substances, weapons, phishing emails, and malware code generation.\nIn recent months, leading AI systems have been found susceptible to three other attacks -\nContext Compliance Attack\n(CCA), a jailbreak technique that\ninvolves\nthe adversary injecting a \"simple assistant response into the conversation history\" about a potentially sensitive topic that expresses readiness to provide additional information\nPolicy Puppetry Attack\n, a prompt injection technique that crafts malicious instructions to look like a policy file, such as XML, INI, or JSON, and then passes it as input to the large language model (LLMs) to bypass safety alignments and extract the system prompt\nMemory INJection Attack\n(MINJA), which involves injecting malicious records into a\nmemory\nbank\nby interacting with an LLM agent via queries and output observations and leads the agent to perform an undesirable action\nResearch has also demonstrated that LLMs can be used to produce insecure code by default when providing naive prompts, underscoring the\npitfalls associated with vibe coding\n, which refers to the use of GenAI tools for software development.\n\"Even when prompting for secure code, it really depends on the prompt's level of detail, languages, potential CWE, and specificity of instructions,\" Backslash Security\nsaid\n. \"Ergo – having built-in guardrails in the form of policies and prompt rules is invaluable in achieving consistently secure code.\"\nWhat's more, a safety and security assessment of OpenAI's GPT-4.1 has revealed that the LLM is three times more likely to go off-topic and allow intentional misuse compared to its predecessor GPT-4o without modifying the system prompt.\n\"Upgrading to the latest model is not as simple as changing the model name parameter in your code,\" SplxAI\nsaid\n. \"Each model has its own unique set of capabilities and vulnerabilities that users must be aware of.\"\n\"This is especially critical in cases like this, where the latest model interprets and follows instructions differently from its predecessors – introducing unexpected security concerns that impact both the organizations deploying AI-powered applications and the users interacting with them.\"\nThe concerns about GPT-4.1 come less than a month after OpenAI\nrefreshed\nits Preparedness Framework detailing how it will test and evaluate future models ahead of release, stating it may adjust its requirements if \"another frontier AI developer releases a high-risk system without comparable safeguards.\"\nThis has also prompted worries that the AI company may be rushing new model releases at the expense of lowering safety standards. A report from the Financial Times earlier this month\nnoted\nthat OpenAI gave staff and third-party groups less than a week for safety checks ahead of the release of its new o3 model.\nMETR's red teaming exercise on the model has\nshown\nthat it \"appears to have a higher propensity to cheat or hack tasks in sophisticated ways in order to maximize its score, even when the model clearly understands this behavior is misaligned with the user's and OpenAI's intentions.\"\nStudies have further demonstrated that the Model Context Protocol (\nMCP\n), an open standard devised by Anthropic to connect data sources and\nAI-powered tools\n, could\nopen new attack pathways\nfor indirect prompt injection and unauthorized data access.\n\"A malicious [MCP] server cannot only exfiltrate sensitive data from the user but also hijack the agent's behavior and override instructions provided by other, trusted servers, leading to a complete compromise of the agent's functionality, even with respect to trusted infrastructure,\" Switzerland-based Invariant Labs\nsaid\n.\nThe approach, referred to as a tool poisoning attack, occurs when malicious instructions are embedded within MCP tool descriptions that are invisible to users but readable to AI models, thereby manipulating them into carrying out covert data exfiltration activities.\nIn one practical attack showcased by the company, WhatsApp chat histories can be\nsiphoned\nfrom an agentic system such as Cursor or Claude Desktop that is also connected to a trusted\nWhatsApp MCP server instance\nby altering the tool description after the user has already approved it.\nThe developments follow the discovery of a suspicious Google Chrome extension that's designed to communicate with an MCP server running locally on a machine and grant attackers the ability to take control of the system, effectively breaching the browser's sandbox protections.\n\"The Chrome extension had unrestricted access to the MCP server's tools — no authentication needed — and was interacting with the file system as if it were a core part of the server's exposed capabilities,\" ExtensionTotal\nsaid\nin a report last week.\n\"The potential impact of this is massive, opening the door for malicious exploitation and complete system compromise.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "SentinelOne Uncovers Chinese Espionage Campaign Targeting Its Infrastructure and Clients",
        "Link": "https://thehackernews.com/2025/04/sentinelone-uncovers-chinese-espionage.html",
        "Summary": "Cybersecurity company SentinelOne has revealed that a China-nexus threat cluster dubbed PurpleHaze conducted reconnaissance attempts against its infrastructure and some of its high-value customers.\n\"We first became aware of this threat cluster during a 2024 intrusion conducted against an organization previously providing hardware logistics services for SentinelOne employees,\" security",
        "Date": "2025-04-29",
        "Content": "Cybersecurity company SentinelOne has revealed that a China-nexus threat cluster dubbed\nPurpleHaze\nconducted reconnaissance attempts against its infrastructure and some of its high-value customers.\n\"We first became aware of this threat cluster during a 2024 intrusion conducted against an organization previously providing hardware logistics services for SentinelOne employees,\" security researchers Tom Hegel, Aleksandar Milenkoski, and Jim Walter\nsaid\nin an analysis published Monday.\nPurpleHaze is assessed to be a hacking crew with loose ties to another state-sponsored group known as\nAPT15\n, which is also tracked as Flea, Nylon Typhoon (formerly Nickel), Playful Taurus, Royal APT, and Vixen Panda.\nThe adversarial collective has also been observed targeting an unnamed South Asian government-supporting entity in October 2024, employing an operational relay box (ORB) network and a Windows backdoor dubbed GoReShell.\nThe implant, written in the Go programming language, repurposes an open-source tool called\nreverse_ssh\nto set up reverse SSH connections to endpoints under the attacker's control.\n\"The use of ORB networks is a growing trend among these threat groups, since they can be rapidly expanded to create a dynamic and evolving infrastructure that makes tracking cyberespionage operations and their attribution challenging,\" the researchers pointed out.\nFurther analysis has determined that the same South Asian government entity was also targeted previously in June 2024 with ShadowPad (aka PoisonPlug), a known backdoor widely shared among China-nexus espionage groups. ShadowPad is considered to be a successor to another backdoor referred to as PlugX.\nThat said, with ShadowPad also being used as a conduit to\ndeliver ransomware\nin recent months, the exact motivation behind the attack remains unclear. The ShadowPad artifacts have been found to be obfuscated using a bespoke compiler called\nScatterBrain\n.\nThe exact nature of the overlap between the June 2024 activity and the later PurpleHaze attacks is unknown as yet. However, it's believed that the same threat actor could be behind them.\nThe ScatterBrain-obfuscated ShadowPad is estimated to have been employed in intrusions targeting over 70 organizations spanning manufacturing, government, finance, telecommunications, and research sectors after\nlikely exploiting\nan N-day vulnerability in Check Point gateway devices.\nOne among the victims of these attacks included the organization that was then responsible for managing hardware logistics for SentinelOne employees. However, the cybersecurity firm noted that it found no evidence of a secondary compromise.\nIt's not just China, for SentinelOne said it also observed attempts made by\nNorth Korea-aligned IT workers\nto secure jobs at the company, including its SentinelLabs intelligence engineering team, via approximately 360 fake personas and over 1,000 job applications.\nLast but not least, ransomware operators have targeted SentinelOne and other enterprise-focused security platforms, attempting to gain access to their tools in order to evaluate the ability of their software to evade detection.\nThis is fuelled by an active underground economy that revolves around buying, selling, and renting access to such enterprise security offerings on messaging apps as well as forums like XSS[.]is, Exploit[.]in, and RAMP.\n\"Entire service offerings have emerged around this ecosystem, including 'EDR Testing-as-a-Service,' where actors can discreetly evaluate malware against various endpoint protection platforms,\" the researchers explained.\n\"While these testing services may not grant direct access to full-featured EDR consoles or agents, they do provide attackers with semi-private environments to fine-tune malicious payloads without the threat of exposure – dramatically improving the odds of success in real-world attacks.\"\nOne ransomware group that takes this threat to a whole new level is Nitrogen, which is believed to be run by a Russian national. Unlike typical approaches that involve approaching insiders or using legitimate credentials harvested from infostealer logs, Nitrogen adopts a different strategy by impersonating real companies.\nThis is achieved by setting up lookalike domains, spoofed email addresses, and cloned infrastructure that mimic legitimate companies, allowing the threat actor to purchase official licenses for EDR and other security products.\n\"This kind of social engineering is executed with precision,\" the researchers said. \"Nitrogen typically targets small, lightly vetted resellers – keeping interactions minimal and relying on resellers' inconsistent KYC (Know Your Customer) practices to slip through the cracks.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Product Walkthrough: Securing Microsoft Copilot with Reco",
        "Link": "https://thehackernews.com/2025/04/product-walkthrough-securing-microsoft.html",
        "Summary": "Find out how Reco keeps Microsoft 365 Copilot safe by spotting risky prompts, protecting data, managing user access, and identifying threats - all while keeping productivity high.\n\nMicrosoft 365 Copilot promises to boost productivity by turning natural language prompts into actions. Employees can generate reports, comb through data, or get instant answers just by asking Copilot.&nbsp;\nHowever,",
        "Date": "2025-04-29",
        "Content": "Find out how Reco keeps Microsoft 365 Copilot safe by spotting risky prompts, protecting data, managing user access, and identifying threats - all while keeping productivity high.\nMicrosoft 365 Copilot promises to boost productivity by turning natural language prompts into actions. Employees can generate reports, comb through data, or get instant answers just by asking Copilot.\nHowever, alongside this convenience comes serious security concerns. Copilot operates across a company's SaaS apps (from SharePoint to Teams and beyond), which means a careless prompt or a compromised user account could expose troves of sensitive information.\nSecurity experts warn that organizations\nshouldn't assume default settings\nwill keep them safe. Without proactive controls, every file in your organization could be accessible via Copilot. A malicious actor might use Copilot to discover and exfiltrate confidential data without having to manually search through systems.\nWith the right prompts, an attacker could potentially locate sensitive files or even map out IT infrastructure and vulnerabilities. To safely embrace Copilot's benefits, companies need equally innovative security measures.\nReco's Approach to Microsoft Copilot Security\nReco, a SaaS Security platform, steps in to address these Copilot-induced risks. Unlike traditional security tools that might overlook in-app AI activity, Reco takes a holistic approach to secure Copilot. It treats Copilot as another component of the SaaS ecosystem that needs monitoring and governance - much like an additional user or app that touches your data.\nReco's platform continuously analyzes how Copilot interacts with your organization's SaaS data and users, providing real-time detection and insights that would be impossible to get from Copilot's native settings alone.\nReco's strategy for Copilot security covers six key areas. Here's a breakdown of each of these areas.\nPrompt Analysis\nOne of the most novel parts of Reco's approach is analyzing the prompts (queries) that users input into Copilot. After all, Copilot will do whatever a user asks - so if someone asks it to do something questionable, Reco aims to flag that early.\nReco uses a multi-phased prompt analysis approach that evaluates every Copilot query against several criteria. Some key elements of this analysis include:\n1. User Context\nReco links each Copilot prompt to the specific user's identity and role. The same query that might be normal for an IT administrator could look very suspicious coming from a sales or finance employee. For example, if an HR intern starts querying network configurations via Copilot, that's a red flag, whereas an IT engineer asking the same question might be within their job scope.\n2. Keyword Detection\nReco monitors Copilot prompts for sensitive keywords or phrases that often indicate risky behavior. If a user query includes terms related to confidential data types (like \"SSN\", \"credit card\", or other PII), or hacking/abuse keywords (like \"bypass authentication\" or \"export user list\"), Reco will flag it. This acts as a first line of defense; any attempt to directly request sensitive info via Copilot triggers an alert.\n3. Context Analysis\nMalicious or careless Copilot prompts aren't always obvious (\"export all customer credit card numbers\" is a clear red flag, but an attacker might be more subtle). A clever prompt could coax Copilot into revealing sensitive data without using any blatant keywords.\nThat's why Reco applies natural language processing (NLP) to understand the intent behind the prompt. This catches cleverly worded queries that avoid obvious keywords but have the same dangerous intent. For example, instead of using \"password,\" someone might ask, \"how does the login system work internally?\"\n4. Attack Pattern Matching\nThe platform compares prompts against known attack techniques from frameworks like MITRE ATT&CK. Using vector similarity matching, Reco identifies when a query resembles a known malicious pattern, helping catch advanced attempts where Copilot is used as a reconnaissance tool.\nData Exposure Management\nWhile prompt analysis watches what users ask, Reco also monitors Copilot's responses and actions—particularly those that might expose data improperly.\nReco tracks file-sharing and link-sharing events involving Copilot. If Copilot generates content that gets shared, Reco verifies the sharing permissions align with security policies. For instance, if a Copilot-generated document is made publicly accessible, Reco flags this as a potential risk.\nThe platform also integrates with data classification systems (like Microsoft Purview sensitivity labels) to understand what data Copilot accesses. When Copilot interacts with content categorized as sensitive or confidential, Reco logs these events and generates appropriate alerts.\nIdentity and Access Governance\nSecuring Copilot requires ensuring only appropriate users have access and that they operate under the principle of least privilege. Reco continuously analyzes your SaaS user base to identify identity risks that Copilot could amplify:\nAccounts with excessive permissions that could use Copilot to access massive amounts of data\nUsers lacking multi-factor authentication who present higher compromise risks\nExternal accounts or stale accounts that might inappropriately access Copilot\nSuspicious access patterns that could indicate compromised credentials\nBy identifying these issues, Reco helps organizations maintain proper access controls around Copilot usage, preventing it from becoming a tool for unauthorized data access.\nReco's identity risk dashboard for Microsoft 365\nThreat Detection\nReco treats Copilot interactions as a security telemetry stream that can reveal suspicious behavior, when correlated with other data points about a user. The platform flags indicators of potential attacks:\nUnusual access locations or suspicious IP addresses for Copilot sessions\nAbnormal usage patterns, such as excessive data retrieval or off-hours activity\nPotential insider threats, like an employee using Copilot to download unusual volumes of confidential documents\nSign-in anomalies that could indicate account compromise\nEach alert includes contextual information mapped to frameworks like MITRE ATT&CK, helping security teams quickly understand and respond to potential threats.\nReco generates Copilot-specific alerts\nDirect Visibility\nReco addresses the visibility gap many organizations face with new AI tools like Copilot through its knowledge graph that visualizes usage across your SaaS environment. This graph:\nShows who is using Copilot and what data they're accessing\nIdentifies anomalies in usage patterns\nConnects activities across your SaaS stack for contextual understanding\nTracks trends in Copilot adoption and utilization\nThis bird's-eye view helps security teams identify potential risks and inefficiencies, such as an unusual concentration of Copilot queries targeting confidential information or external accounts invoking Copilot inappropriately.\nReco's knowledge graph\nSaaS-to-SaaS Risk Detection\nAs organizations integrate Copilot with other applications, new risks can emerge. Reco monitors cross-application interactions where Copilot connects with other SaaS tools.\nThe platform detects when new applications appear and interact with your environment through Copilot, flagging shadow AI or unsanctioned integrations. For instance, if a developer adds a plugin that connects to Copilot without security team approval, Reco brings this to light immediately.\nWhat Reco Does Not Do for Copilot Security\nTo set appropriate expectations, it's important to understand Reco's boundaries:\nNot DLP or Content Filtering\n: Reco doesn't block or censor Copilot outputs in real-time—it alerts and logs concerning events rather than preventing them.\nNot Endpoint Security\n: Reco operates at the SaaS layer, not at the device level. It complements but doesn't replace endpoint protection.\nNot Configuration Changes\n: Reco will flag a misconfiguration, but it doesn't modify Copilot settings. While you can raise a ticket to the app owner through Reco and provide remediation instructions, you'll still have to use Microsoft's tools to configure the service.\nConclusion\nAs we've explored, Copilot can potentially touch everything – all your documents, messages, and data – which is both its strength and its biggest risk. Securing Copilot is therefore not just about Copilot itself, but about securing your entire SaaS environment against a new kind of access and automation.\nReco's dynamic approach to Copilot security can help organizations embrace these AI tools safely.\nTo go deeper into this topic and get concrete guidance, we recommend downloading the white paper\nSecure AI Copilots and Agentic AI\n. It offers best practices on governing AI copilots and detailed insights on strengthening your SaaS security posture in the age of AI.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Google Reports 75 Zero-Days Exploited in 2024 — 44% Targeted Enterprise Security Products",
        "Link": "https://thehackernews.com/2025/04/google-reports-75-zero-days-exploited.html",
        "Summary": "Google has revealed that it observed 75 zero-day vulnerabilities exploited in the wild in 2024, down from 98 in 2023.&nbsp;\nOf the 75 zero-days, 44% of them targeted enterprise products. As many as 20 flaws were identified in security software and appliances.\n\"Zero-day exploitation of browsers and mobile devices fell drastically, decreasing by about a third for browsers and by about half for",
        "Date": "2025-04-29",
        "Content": "Google has revealed that it observed 75 zero-day vulnerabilities exploited in the wild in 2024, down from 98 in 2023.\nOf the 75 zero-days, 44% of them targeted enterprise products. As many as 20 flaws were identified in security software and appliances.\n\"Zero-day exploitation of browsers and mobile devices fell drastically, decreasing by about a third for browsers and by about half for mobile devices compared to what we observed last year,\" the Google Threat Intelligence Group (GTIG)\nsaid\nin a report shared with The Hacker news.\n\"Exploit chains made up of multiple zero-day vulnerabilities continue to be almost exclusively (~90%) used to target mobile devices.\"\nWhile Microsoft Windows accounted for 22 of the zero-day flaws exploited in 2024, Apple's Safari had three, iOS had two, Android had seven, Chrome had seven, and Mozilla Firefox had one flaw that were abused during the same period. Three of the seven zero-days exploited in Android were found in third-party components.\nAmong the exploited 33 zero-days in enterprise software and appliances, 20 of them targeted security and network products, such as those from Ivanti, Palo Alto Networks, and Cisco.\n\"Security and network tools and devices are designed to connect widespread systems and devices with high permissions required to manage the products and their services, making them highly valuable targets for threat actors seeking efficient access into enterprise networks,\" GTIG researchers noted.\nIn all, a total of 18 unique enterprise vendors were targeted in 2024, in comparison to 12 in 2021, 17 in 2022, and 22 in 2023. The companies with the most targeted zero-days were Microsoft (26), Google (11), Ivanti (7), and Apple (5).\nWhat's more, the zero-day exploitation of 34 of the 75 flaws have been attributed to six broad threat activity clusters -\nState-sponsored espionage (10), led by China (5), Russia (1), and South Korea (1) (e.g.,\nCVE-2023-46805\n,\nCVE-2024-21887\n)\nCommercial surveillance vendors (8) (e.g.,\nCVE-2024-53104\n,\nCVE-2024-32896\n,\nCVE-2024-29745, CVE-2024-29748\n)\nNon-state financially motivated groups (5) (e.g.,\nCVE-2024-55956\n)\nState-sponsored espionage and financially motivated groups (5), all from North Korea (e.g.,\nCVE-2024-21338\n,\nCVE-2024-38178\n)\nNon-state financially motivated groups also conducting espionage (2), all from Russia (e.g.\nCVE-2024-9680, CVE-2024-49039\n)\nGoogle said it discovered in November 2024 a malicious JavaScript inject on the website of the Diplomatic Academy of Ukraine (online.da.mfa.gov[.]ua), which triggered an exploit for\nCVE-2024-44308\n, resulting in arbitrary code execution.\nThis was then chained with\nCVE-2024-44309\n, a cookie management vulnerability in WebKit, to launch a cross-site scripting (XSS) attack and ultimately collect users' cookies in order to unauthorized access to login.microsoftonline[.]com.\nThe tech giant further noted that it independently discovered an exploit chain for Firefox and Tor browsers that leveraged a combination of CVE-2024-9680 and CVE-2024-49039 to break out of the Firefox sandbox and execute malicious code with elevated privileges, thereby paving the way for the deployment of RomCom RAT.\nThe activity, previously\nflagged\nby ESET, has been attributed to a threat actor called RomCom (aka Storm-0978, Tropical Scorpius, UAC-0180, UNC2596, and Void Rabisu). Google is tracking the dual financial- and espionage-motivated threat group under the name CIGAR.\nBoth the flaws are said to have been abused as a zero-day by another likely financially motivated hacking crew that used a legitimate, compromised cryptocurrency news website as a watering hole to redirect visitors to an attacker-controlled domain hosting the exploit chain.\n\"Zero-day exploitation continues to grow at a slow but steady pace. However, we've also started seeing vendors' work to mitigate zero-day exploitation start to pay off,\" Casey Charrier, Senior Analyst at GTIG, said in a statement shared with The Hacker News.\n\"For instance, we have observed fewer instances of zero-day exploitation targeting products that have been historically popular, likely due to efforts and resources many large vendors have invested in order to prevent exploitation.\"\n\"At the same time, we're seeing zero-day exploitation shift towards the increased targeting of enterprise-focused products, which requires a wider and more diverse set of vendors to increase proactive security measures. The future of zero-day exploitation will ultimately be dictated by vendors' decisions and ability to counter threat actors' objectives and pursuits.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Malware Attack Targets World Uyghur Congress Leaders via Trojanized UyghurEdit++ Tool",
        "Link": "https://thehackernews.com/2025/04/malware-attack-targets-world-uyghur.html",
        "Summary": "In a new campaign detected in March 2025, senior members of the World Uyghur Congress (WUC) living in exile have been targeted by a Windows-based malware that's capable of conducting surveillance.\nThe spear-phishing campaign involved the use of a trojanized version of a legitimate open-source word processing and spell check tool called UyghurEdit++ developed to support the use of the Uyghur",
        "Date": "2025-04-29",
        "Content": "In a new campaign detected in March 2025, senior members of the World Uyghur Congress (WUC) living in exile have been targeted by a Windows-based malware that's capable of conducting surveillance.\nThe spear-phishing campaign involved the use of a trojanized version of a legitimate open-source word processing and spell check tool called\nUyghurEdit++\ndeveloped to support the use of the Uyghur language.\n\"Although the malware itself was not particularly advanced, the delivery of the malware was extremely well customized to reach the target population and technical artifacts show that activity related to this campaign began in at least May of 2024,\" the Citizen Lab\nsaid\nin a Monday report.\nThe investigation, according to the digital rights research laboratory based at the University of Toronto, was prompted after the targets received\nnotifications from Google\nwarning that their accounts had been at the receiving end of government-backed attacks. Some of these alerts were sent on March 5, 2025.\nThe email messages impersonated a trusted contact at a partner organization and contained Google Drive links, which, when clicked, would download a password-protected RAR archive.\nPresent within the archive was a poisoned version of UyghurEdit++ that profiled the compromised Windows system and sent the information to an external server (\"tengri.ooguy[.]com\"). The C++ spyware also comes with capabilities to download additional malicious plugins and run commands against those components after likely verifying the machine belongs to a target of interest.\nThe findings are the\nlatest\nin a\nseries\nof highly-targeted attacks aimed at the Uyghur diaspora with the goal of conducting digital transnational repression.\nIt's not exactly known who was behind the attacks, although the threat actors' techniques, their \"deep understanding of the target community,\" and targeting suggest they align with the Chinese government.\n\"China's\nextensive campaign\nof transnational repression targets Uyghurs both on the basis of their ethnic identity and activities,\" the Citizen Labs said.\n\"The goal of the surveillance of Uyghurs in the diaspora is to control their ties to the homeland and the cross-border flow of information on the human rights situation in the region, as well as any influence on global public opinion about the Chinese state's policies in Xinjiang.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "CISA Adds Actively Exploited Broadcom and Commvault Flaws to KEV Database",
        "Link": "https://thehackernews.com/2025/04/cisa-adds-actively-exploited-broadcom.html",
        "Summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Monday added two high-severity security flaws impacting Broadcom Brocade Fabric OS and Commvault Web Server to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation in the wild.\nThe vulnerabilities in question are listed below -\n\nCVE-2025-1976 (CVSS score: 8.6) - A code injection flaw",
        "Date": "2025-04-29",
        "Content": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Monday\nadded\ntwo high-severity security flaws impacting Broadcom Brocade Fabric OS and Commvault Web Server to its Known Exploited Vulnerabilities (\nKEV\n) catalog, citing evidence of active exploitation in the wild.\nThe vulnerabilities in question are listed below -\nCVE-2025-1976\n(CVSS score: 8.6) - A code injection flaw affecting Broadcom Brocade Fabric OS that allows a local user with administrative privileges to execute arbitrary code with full root privileges\nCVE-2025-3928\n(CVSS score: 8.7) - An unspecified flaw in the Commvault Web Server that allows a remote, authenticated attacker to create and execute web shells\n\"Exploiting this vulnerability requires a bad actor to have authenticated user credentials within the Commvault Software environment,\" Commvault\nsaid\nin an advisory released in February 2025.\n\"Unauthenticated access is not exploitable. For software customers, this means your environment must be: (i) accessible via the internet, (ii) compromised through an unrelated avenue, and (iii) accessed leveraging legitimate user credentials.\"\nThe vulnerability affects the following Windows and Linux versions -\n11.36.0 - 11.36.45 (Fixed in 11.36.46)\n11.32.0 - 11.32.88 (Fixed in 11.32.89)\n11.28.0 - 11.28.140 (Fixed in 11.28.141)\n11.20.0 - 11.20.216 (Fixed in 11.20.217)\nAs for CVE-2025-1976, Broadcom said that due to a flaw in IP Address validation, a local user with the admin privilege can potentially execute arbitrary code with root privileges on Fabric OS versions 9.1.0 through 9.1.1d6. It has been fixed in version 9.1.1d7.\n\"This vulnerability can allow the user to execute any existing Fabric OS command or can also be used to modify the Fabric OS itself, including adding their own subroutines,\" Broadcom\nnoted\nin a bulletin published on April 17, 2025.\n\"Even though achieving this exploit first requires valid access to a role with admin privileges, this vulnerability has been actively exploited in the field.\"\nThere are currently no public details on how either of the vulnerabilities have been exploited in the wild, the scale of the attacks, and who may be behind them.\nFederal Civilian Executive Branch (FCEB) agencies are recommended to apply the necessary patches for the Commvault Web Server by May 17, 2025, and Broadcom Brocade Fabric OS by May 19, respectively.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Grinex exchange suspected rebrand of sanctioned Garantex crypto firm",
        "Link": "https://www.bleepingcomputer.com/news/cryptocurrency/grinex-exchange-suspected-rebrand-of-sanctioned-garantex-crypto-firm/",
        "Summary": "A new cryptocurrency exchange named Grinex is believed to be a rebrand of Garantex, a Russian cryptocurrency exchange whose domains were seized by the U.S. authorities and an admin arrested. [...]",
        "Date": "2025-04-29",
        "Content": "A new cryptocurrency exchange named Grinex is believed to be a rebrand of Garantex, a Russian cryptocurrency exchange whose domains were seized by the U.S. authorities and an admin arrested.\nAccording to a new report by blockchain intelligence firm TRM Labs, Grinex shows strong ties to Garantex's previous operations but has not determined if it's currently being used for illicit transactions.\nGarantex was a Russian cryptocurrency exchange, officially registered in Estonia, that was sanctioned by the U.S. (OFAC) in April 2022, followed by similar actions by the UK and the EU.\nU.S. authorities\nseized Garantex's domains\nin early March 2025 for multiple violations, including the processing of $100 billion worth of illicit transactions and facilitating money laundering for ransomware gangs and darknet markets.\nTRM Labs confirmed transactions with the Conti ransomware group and the dark web markets Hydra, Mega, Kraken, OMG!OMG! And Solaris.\nTwo administrators of Garantex, Aleksej Besciokov and Aleksandr Mira Serda, were subsequently\ncharged\n, with\nBesciokov arrested\na few days later while vacationing in India.\nGrinex's sudden rise\nSoon after the seizure, Grinex was promoted on Telegram channels linked to the Garantex-adjacent Satoshkin group, stating it was a \"a new platform with familiar functionality.\"\nThe user interface similarities between the two platforms were extensive, but more notably, Grinex was in a position to make arrangements to capture Garantex's staff and user base from its very launch.\n\"Grinex announced it had entered into an agreement with Garantex to onboard its clients and was considering hiring former Garantex employees,\"\nexplains TRM Labs\n.\n\"Even more revealing, Grinex began distributing former Garantex user assets through a new token, A7A5.\"\nTwo weeks prior to Garantex's takedown, a new stablecoin called A7A5, pegged 1:1 to the Russian ruble, was announced on the platform, likely as a measure of the anticipated upcoming legal action.\nTRM Labs found two Kyrgyzstan-based firms to be behind large transactions involving the A7A5 token, but the connections are obscure.\nWhat is clear is that after the Garantex takedown, Grinex started distributing former Garantex user assets through the A7A5 token, with Telegram channels previously linked to Garantex promoting Grinex as a way for users to recover their frozen funds.\nA7A5 transactions diagram\nSource: TRM Labs\nUltimately, the rise of Grinex shows that blocking cybercrime and sanctions evasion mechanisms is a complicated process, as illicit networks can quickly adapt by rebranding, creating new stablecoins, and exploiting decentralized platforms to continue their operations unabated.\nTRM Labs mentions two other platforms that emerged as a Garantex replacement, namely ABCEX, which is directly related to Garantex founder Sergey Mendeleev, and Rapira, which has welcomed several former Garantex users already.\nRelated Articles:\nOKX suspends DEX aggregator after Lazarus hackers try to launder funds\nUS charges Garantex admins with money laundering, sanctions violations\nUS seizes domain of Garantex crypto exchange used by ransomware gangs\nU.S. seized $8.2 million in crypto linked to 'Romance Baiting' scams\nGarantex crypto exchange admin arrested while on vacation"
    },
    {
        "Title": "Microsoft: Windows Server hotpatching to require subscription",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-server-hotpatching-to-require-subscription/",
        "Summary": "Microsoft has announced it will require paid subscriptions for Windows Server 2025 hotpatching, a service that enables admins to install security updates without restarting. [...]",
        "Date": "2025-04-29",
        "Content": "Microsoft has announced it will require paid subscriptions for Windows Server 2025 hotpatching, a service that enables admins to install security updates without restarting.\nThe company urged admins to try hotpatching free of charge before it becomes generally available in July, when they'll have to pay for a subscription to test it.\nHowever, Redmond also warned those currently testing Windows Server 2025 hotpatching in preview to disenroll on or before June 30 so that they're not automatically subscribed in July.\n\"Hotpatching for Windows Server 2025, made available in preview in 2024, will become generally available as a subscription service on July 1st, 2025. With hotpatching, we are taking what was previously an Azure-only capability and now making it available to Windows Server machines outside of Azure through Azure Arc,\"\nMicrosoft said\n.\n\"Hotpatching is available at no charge to preview now, but starting in July with the subscription launch, hotpatching for Windows Server 2025 will be offered at a subscription of $1.50 USD per CPU core per month.\"\nTo use hotpatching in multi-cloud environments or on-premises, you will need a Hotpatch service subscription and an Azure Arc-connected server that runs Windows Server 2025 Standard or Datacenter.\nTo enable hotpatching on your server, connect it to Azure Arc using\nthese steps\n, then go to Azure Update Manager in the Azure Portal, select your Azure Arc-enabled server, and check the hotpatching option\nas detailed here\n.\nHotpatching has been available since February 2022 for\nWindows Server 2022 Datacenter: Azure Edition\n, when Microsoft announced its general availability for Windows Server Azure Edition core virtual machines.\nOn devices where hotpatching is toggled on, Windows deploys security updates by patching the in-memory code of running processes without restarting them after each installation and without rebooting the device.\nHowever, servers still require reboots after installing updates delivered through the regular (non-Hotpatch) Windows update channel, which aren't included in the Hotpatch program. Two examples of updates that can't be installed without a restart are non-Windows updates (such as .NET patches) and Windows non-security updates.\nMicrosoft also started testing hotpatching in public preview for Windows Server 2025\nin September 2024\nand on Windows 11 24H2 and Windows 365 two months later,\nin November 2024\n.\nStarting April 2025, hotpatch updates are\ngenerally available for business customers\nusing Windows 11 Enterprise 24H2 on x64 (AMD/Intel) systems.\nRelated Articles:\nMicrosoft: Windows Server 2025 restarts break connectivity on some DCs\nMicrosoft fixes Windows Server 2025 blue screen, install issues\nMicrosoft adds hotpatching support to Windows 11 Enterprise\nMicrosoft fixes Remote Desktop issues caused by Windows updates\nMicrosoft fixes bug causing incorrect Windows Recovery errors"
    },
    {
        "Title": "Hackers ramp up scans for leaked Git tokens and secrets",
        "Link": "https://www.bleepingcomputer.com/news/security/hackers-ramp-up-scans-for-leaked-git-tokens-and-secrets/",
        "Summary": "Threat actors are intensifying internet-wide scanning for Git configuration files that can reveal sensitive secrets and authentication tokens used to compromise cloud services and source code repositories. [...]",
        "Date": "2025-04-29",
        "Content": "Threat actors are intensifying internet-wide scanning for Git configuration files that can reveal sensitive secrets and authentication tokens used to compromise cloud services and source code repositories.\nIn a new report from threat monitoring firm GreyNoise, researchers have recorded a massive spike in searches for exposed Git configs between April 20-21, 2025.\n\"GreyNoise observed nearly 4,800 unique IP addresses daily from April 20-21, marking a substantial increase compared to typical levels,\"\nexplained GreyNoise in the report\n.\n\"Although activity was globally distributed, Singapore ranked as both the top source and destination for sessions during this period, followed by the U.S. and Germany as the next most common destinations.\"\nIPs participating in the mass-scanning activity\nSource: GreyNoise\nGit configuration files are configuration files for Git projects that can include branch information, remote repository URLs, hooks and automation scripts, and most importantly, account credentials and access tokens.\nDevelopers or companies deploy web applications without correctly excluding .git/ directories from public access, inadvertently exposing these files to anyone.\nScanning for those files is a standard reconnaissance activity that provides numerous opportunities for threat actors.\nIn October 2024,\nSysdig reported\nabout a large-scale operation named \"EmeraldWhale\" which scanned for exposed Git config files, snatching 15,000 cloud account credentials from thousands of private repositories.\nStealing credentials, API keys, SSH private keys, or even accessing internal-only URLs allows the threat actors to access confidential data, craft tailored attacks, and hijack privileged accounts.\nThis is the exact method that the threat actors used to\nbreach Internet Archive's\n\"The Wayback Machine\" in October 2024, and then\nmaintain their foothold\ndespite the owner's efforts to thwart the attacks.\nGreyNoise reports that the recent activity is mostly targeted at Singapore, the United States, Spain, Germany, the UK, and India.\nThe malicious activity culminates in waves, with four notable cases since late 2024 being recorded in November, December, March, and April. The most recent one was the highest volume attack wave the researchers logged.\nGit config file scanning waves\nSource: GreyNoise\nTo mitigate the risks that arise from these scans, it is recommended to block access to .git/ directories, configure web servers to prevent access to hidden files, monitor server logs for suspicious .git/config access, and rotate potentially exposed credentials.\nIf web server access logs show unauthorized access to Git configs, any credentials stored within them should be rotated immediately.\nRelated Articles:\nGitHub expands security tools after 39 million secrets leaked in 2024\nNearly 24,000 IPs behind wave of Palo Alto Global Protect scans\nThis iScanner deal will replace your printer, scanner, and filing cabinet"
    },
    {
        "Title": "France ties Russian APT28 hackers to 12 cyberattacks on French orgs",
        "Link": "https://www.bleepingcomputer.com/news/security/france-ties-russian-apt28-hackers-to-12-cyberattacks-on-french-orgs/",
        "Summary": "Today, the French foreign ministry blamed the APT28 hacking group linked to Russia's military intelligence service (GRU) for targeting or breaching a dozen French entities over the last four years. [...]",
        "Date": "2025-04-29",
        "Content": "Today, the French foreign ministry blamed the APT28 hacking group linked to Russia's military intelligence service (GRU) for targeting or breaching a dozen French entities over the last four years.\n\"France condemns in the strongest terms the use by the Russian military intelligence service (GRU) of the APT28 attack procedure, which has led to several cyber attacks against French interests,\" a\nstatement\nreleased on Tuesday says.\n\"These destabilizing activities are unacceptable and unworthy of a permanent member of the UN Security Council. They are also contrary to the United Nations standards on the responsible behaviour of states in cyberspace, to which Russia has subscribed.\"\nIn a\nseparate report\npublished today, the French National Agency for the Security of Information Systems (ANSSI) says the list of French organizations attacked by APT28 military hackers includes ministerial entities, local governments, and administrations, organizations in the French Defence Technological and Industrial Base, aerospace entities, research organizations, think-tanks, and entities in the economic and financial sector.\nANSSI also highlighted several notable APT28 campaigns since 2021, including ones repeatedly targeting Roundcube e-mail servers and several others using free web services for phishing attacks.\nIt also mentioned the attackers' heavy use of \"low-cost and ready-to-use outsourced infrastructure,\" including free hosting services, VPN services, rented servers, and temporary e-mail address creation services for increased flexibility and stealth.\nSince the start of 2024, APT28's attacks have primarily focused on stealing \"strategic intelligence\" from governmental, diplomatic, research organizations, and think tanks from France, Europe, Ukraine, and North America.\nRussian military intelligence attacks against French entities (ANSSI)\nThis isn't the first time ANSSI has linked the APT28 hackers to attacks. In an October 2023 report, the threat group\nwas also accused\nof breaching many critical networks of government entities, universities, research institutes, businesses, and think tanks in France since the second half of 2021.\n​Since it was first spotted more than 20 years ago, the Russian state-backed hacking group (also tracked as Strontium and Fancy Bear) was linked\nto GRU's Military Unit 26165\nand is believed to have coordinated many high-profile cyberattacks.\nAPT28's list of previous victims includes the Democratic Congressional Campaign Committee (DCCC) and the Democratic National Committee (DNC)\nbefore the 2016 U.S. Presidential Election\nand the breach of the\nGerman Federal Parliament (Deutscher Bundestag)\nin 2015.\nIn July 2018, the United States\ncharged\nmultiple APT28 members for their involvement in the DNC and DCCC attacks, while the Council of the European Union also\nsanctioned the threat group in October 2020\nfor the Bundestag hack.\nLast year, Poland said that APT28's military hackers had\ntargeted multiple Polish government institutions\nin a large-scale phishing campaign.\nThe same week, NATO, the European Union, and international partners also\nformally condemned\na long-term APT28 espionage campaign against multiple European countries, including Germany and the Czech Republic. The North Atlantic Council also\nwarned\nat the time about \"recent Russian hybrid activities,\" describing them as a \"threat to Allied security.\"\nAccording to NATO, these recent incidents include \"sabotage, acts of violence, cyber and electronic interference, disinformation campaigns, and other hybrid operations\" that have impacted Czechia, Estonia, Germany, Latvia, Lithuania, Poland, as well as the United Kingdom.\n\"Together with its partners, France is determined to use all the means at its disposal to anticipate, deter and respond to Russia's malicious behaviour in cyberspace where appropriate,\" the French foreign ministry added on Tuesday.\nRelated Articles:\nRussian army targeted by new Android malware hidden in mapping app\nState-sponsored hackers embrace ClickFix social engineering tactic\nChinese hackers target Russian govt with upgraded RAT malware\nHackers abuse OAuth 2.0 workflows to hijack Microsoft 365 accounts\nMidnight Blizzard deploys new GrapeLoader malware in embassy phishing"
    },
    {
        "Title": "Apple 'AirBorne' flaws can lead to zero-click AirPlay RCE attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/apple-airborne-flaws-can-lead-to-zero-click-airplay-rce-attacks/",
        "Summary": "​A set of security vulnerabilities in Apple's AirPlay Protocol and AirPlay Software Development Kit (SDK) exposed unpatched third-party and Apple devices to various attacks, including remote code execution. [...]",
        "Date": "2025-04-29",
        "Content": "​A set of security vulnerabilities in Apple's AirPlay Protocol and AirPlay Software Development Kit (SDK) exposed unpatched third-party and Apple devices to various attacks, including remote code execution.\nAccording to cybersecurity company Oligo Security security researchers who discovered and reported the flaws, they can be exploited in zero-click and one-click RCE attacks, man-in-the-middle (MITM) attacks, and denial of service (DoS) attacks, as well as to bypass access control list (ACL) and user interaction, to gain access to sensitive information, and read arbitrary local files.\nIn all, Oligo disclosed 23 security vulnerabilities to Apple, which released security updates to address these vulnerabilities (collectively known as \"AirBorne\") on March 31 for iPhones and iPads (\niOS 18.4 and iPadOS 18.4\n), Macs (\nmacOS Ventura 13.7.5\n,\nmacOS Sonoma 14.7.5\n, and\nmacOS Sequoia 15.4\n), and Apple Vision Pro (\nvisionOS 2.4\n) devices.\nThe company also patched the\nAirPlay audio SDK\n, the\nAirPlay video SDK\n, and the\nCarPlay Communication Plug-in\n.\nWhile the AirBorne vulnerabilities can only be exploited by attackers on the same network via wireless networks or peer-to-peer connections, they allow taking over vulnerable devices and using the access as a launchpad to compromise other AirPlay-enabled devices on the same network.\nOligo's security researchers said they were able to demonstrate that attackers can use two of the security flaws (CVE-2025-24252 and CVE-2025-24132) to create wormable zero-click RCE exploits.\nAdditionally, the CVE-2025-24206 user interaction bypass flaw enables a threat actor to bypass \"Accept\" click requirements on AirPlay requests and can be chained with other flaws to launch zero-click attacks.\n\"This means that an attacker can take over certain AirPlay-enabled devices and do things like deploy malware that spreads to devices on any local network the infected device connects to. This could lead to the delivery of other sophisticated attacks related to espionage, ransomware, supply-chain attacks, and more,\"\nOligo warned\n.\n\"Because AirPlay is a fundamental piece of software for Apple devices (Mac, iPhone, iPad, AppleTV, etc.) as well as third-party devices that leverage the AirPlay SDK, this class of vulnerabilities could have far-reaching impacts.\"\nThe cybersecurity company advises organizations to immediately update any corporate Apple devices and AirPlay-enabled devices to the latest software release and ask employees to also update all their personal AirPlay devices.\nAdditional measures users can take to reduce the attack surface include updating all their Apple devices to the latest version, disabling the AirPlay receiver if not used, restricting AirPlay access to trusted devices using firewall rules, and reducing the attack surface by only allowing AirPlay for the current user.\nApple says that there are\nover 2.35 billion active Apple devices\naround the world (including iPhones, iPads, Macs, and others), and Oligo estimates that there are also tens of millions of third-party audio devices like speakers and TVs with AirPlay support, not including car infotainment systems with CarPlay support.\nRelated Articles:\nOver 1,200 SAP NetWeaver servers vulnerable to actively exploited flaw\nSAP fixes suspected NetWeaver zero-day exploited in attacks\nApple backports zero-day patches to older iPhones and Macs\nApple fixes WebKit zero-day exploited in ‘extremely sophisticated’ attacks\nActive! Mail RCE flaw exploited in attacks on Japanese orgs"
    },
    {
        "Title": "SK Telecom cyberattack: Free SIM replacements for 25 million customers",
        "Link": "https://www.bleepingcomputer.com/news/security/sk-telecom-cyberattack-free-sim-replacements-for-25-million-customers/",
        "Summary": "South Korean mobile provider SK Telecom has announced free SIM card replacements to its 25 million mobile customers following a recent USIM data breach, but only 6 million cards are available through May. [...]",
        "Date": "2025-04-29",
        "Content": "South Korean mobile provider SK Telecom has announced free SIM card replacements to its 25 million mobile customers following a recent USIM data breach, but only 6 million cards are available through May.\nSK Telecom is the country's largest mobile network operator, serving roughly half of the domestic mobile phone market.\nOn April 19, the company detected a\nmalware running on its network\nthat allowed threat actors to steal customers' Universal Subscriber Identity Module (USIM) data, typically including International Mobile Subscriber Identity (IMSI), Mobile Station ISDN Number (MSISDN), authentication keys, network usage data, and SMS or contacts if stored on the SIM.\nNo customer names, other identification details, or financial information were exposed due to this incident.\nThe main risk from this breach is the potential for threat actors to perform unauthorized number ports to cloned SIM cards, known as \"SIM swapping.\"\nIn an update published earlier today, SK Telecom assured customers that such requests would be automatically detected and blocked by its Fraud Detection System (FDS) and SIM Protection Service, which have been enhanced to handle the elevated risk.\nSK Telecom's SIM Protection service\nSource: SK Telecom\nAs of today, SK Telecom is also offering free-of-charge SIM card replacements to 25 million mobile subscribers, including approximately 2 million using budget carriers, who are worried about the potential for SIM swapping attacks impacting them.\nHowever, the mobile carrier warns that due to a lack of inventory, they can only replace up to 6 million SIM cards through May 2025.\n\"Currently, SK Telecom holds 1 million SIM cards and plans to secure 5 million more by the end of May 2025,\"\nreads the update\n.\n\"Due to potential congestion, customers are encouraged to use the online reservation system (care.tworld.co.kr) to book their SIM replacement in advance.\"\nOnly customers who subscribed as of April 18, 2025, at midnight (Japan time), are eligible for SIM replacement.\nMeanwhile, the firm has\npublished an FAQ\nabout the cybersecurity incident, which states that investigations into the exact causes and scope are still ongoing but have not yet confirmed \"secondary damage or dark web leaks.\"\nThe FAQ also clarifies that roaming services have been disabled for subscribers who have activated SIM Protection, but they plan to upgrade the feature to make it usable while abroad for optimal protection.\nFinally, all impacted customers will be receiving a personalized message with security instructions soon.\nRelated Articles:\nSK Telecom warns customer USIM data exposed in malware attack\nVeriSource now says February data breach impacts 4 million people\nInterlock ransomware claims DaVita attack, leaks stolen data\nLazarus hackers breach six companies in watering hole attacks\nYale New Haven Health data breach affects 5.5 million patients"
    },
    {
        "Title": "Microsoft fixes Outlook paste, blank calendar rendering issues",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-outlook-paste-blank-calendar-rendering-issues/",
        "Summary": "Microsoft has confirmed several issues affecting Microsoft 365 customers using the \"paste special' option and the calendar feature in the classic Outlook email client. [...]",
        "Date": "2025-04-29",
        "Content": "​Microsoft has confirmed several issues affecting Microsoft 365 customers using the \"paste special' option and the calendar feature in the classic Outlook email client.\nAs the company explains, users in the Current Channel trying to use the Ctrl+Alt+V paste special keyboard shortcut will see that it doesn't work after updating to Version 2503 Build 18623.20156 because of changes introduced to this feature by the Word Team in August 2024.\n\"This issue is happening because of recent changes to shortcuts implemented by the Word Team, see blog article\nPaste Text Only shortcut in Word\n. Outlook gets the shortcut shared from Word. The article explains that you can restore the shortcuts and that will work for Word, but it does not work in Outlook,\" the Outlook Team\nsays\n.\nWhile a fix was already developed, it will start rolling out to users in the Beta Channel in early May and to Current Channel Preview in early June, while Current Channel users will only get it around late June after updating to Version 2506 Build 18925.20000.\nMicrosoft also advises using the Alt+HVS shortcut to open the '\nPaste Special\n' dialog or the 'Paste Special ' option on the Ribbon as a temporary workaround.\nHowever, those who need the fix sooner can switch to the Beta Channel by adding a registry key via the following steps:\nOpen a 'Command Prompt' window with 'Run as administrator' for Administrator context.\nPaste the command below and press Enter:\nreg add HKLM\\Software\\Policies\\Microsoft\\office\\16.0\\common\\officeupdate /v updatebranch /t REG_SZ /d BetaChannel\nAfter you add the registry key, select File > Office Account > Update Options, then 'Update Now' to initiate the switch to Beta Channel.\nThis week, the Outlook Team also\nmitigated\na known issue causing Outlook Calendars to render blank sections in Calendar View for users with multiple calendars enabled.\nThe known issue has been fixed by making a service change, and affected users are advised to restart classic Outlook to pick up the change.\nIn January, Microsoft also fixed a classic Outlook issue behind\nemail client freezes\nwhen copying text with the CTRL+C keyboard shortcut.\nMore recently, it announced a fix for an Outlook bug\ntriggering CPU spikes\nwhen typing messages and resolved a known issue\nbreaking drag-and-drop\nafter installing February 2025 Windows updates.\nRelated Articles:\nMicrosoft announces fix for CPU spikes when typing in Outlook\nMicrosoft warns of CPU spikes when typing in classic Outlook\nMicrosoft fixes button that restores classic Outlook client\nMicrosoft says button to restore classic Outlook is broken\nMicrosoft links recent Microsoft 365 outage to buggy update"
    },
    {
        "Title": "CISA tags Broadcom Fabric OS, CommVault flaws as exploited in attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/cisa-tags-broadcom-fabric-os-commvault-flaws-as-exploited-in-attacks/",
        "Summary": "The U.S. Cybersecurity & Infrastructure Security Agency (CISA) is warning of Broadcom Brocade Fabric OS, Commvault web servers, and Qualitia Active! Mail clients vulnerabilities that are actively exploited in attacks. [...]",
        "Date": "2025-04-29",
        "Content": "The U.S. Cybersecurity & Infrastructure Security Agency (CISA) is warning of Broadcom Brocade Fabric OS, Commvault web servers, and Qualitia Active! Mail clients vulnerabilities that are actively exploited in attacks.\nThe flaws were added yesterday to CISA's 'Known Exploited Vulnerabilities'\n(KEV) catalog\n, with the Broadcom Brocade Fabric OS and Commvault flaws not previously tagged as exploited.\nBroadcom Brocade Fabric OS is a specialized operating system that runs on the company's Brocade Fibre Channel switches to manage and optimize storage area networks (SAN).\nEarlier this month, Broadcom disclosed an arbitrary code execution flaw impacting Fabric OS versions 9.1.0 through 9.1.1d6, tracked under CVE-2025-1976.\nWhile the flaw requires admin privileges to exploit, Broadcom says it has been actively exploited in attacks.\n\"This vulnerability can allow the user to execute any existing Fabric OS command or can also be used to modify the Fabric OS itself, including adding their own subroutines,\"\nreads Broadcom's bulletin\n.\n\"Even though achieving this exploit first requires valid access to a role with admin privileges, this vulnerability has been actively exploited in the field.\"\nCVE-2025-1976 was addressed with the release of Brocade Fabric OS 9.1.1d7. The latest branch, 9.2.0, is not impacted by this vulnerability.\nThe Commvault flaw, tracked under\nCVE-2025-3928\n, is an unspecified security problem that authenticated attackers can exploit remotely to plant webshells on target servers.\nCommvault web servers are user-facing and API components of a backup system used by enterprises to protect and restore critical data.\nDespite the requirements for authentication and exposure of the environment to the internet, the flaw is under active exploitation in the wild.\nCVE-2025-3928 was fixed in versions 11.36.46, 11.32.89, 11.28.141, and 11.20.217 for Windows and Linux platforms.\nThe third flaw CISA added to KEV is CVE-2025-42599, a stack-based buffer overflow problem impacting all versions of Active! up to and including 'BuildInfo: 6.60.05008561' on all OS platforms.\nActive! mail is a web-based email client widely used by government, financial, and IT service organizations in Japan.\nThe flaw was\nflagged as actively exploited\nlast week by Japan's CERT, while SMB providers and ISPs in the country also announced service outages caused by related exploitation activity.\nQualitia addressed the problem with the release of Active! Mail 6 BuildInfo: 6.60.06008562.\nCISA has given impacted organizations until May 17, 2025, to apply fixes or available mitigations for CVE-2025-3928 and May 19, 2025, for the other two flaws.\nRelated Articles:\nCISA flags Craft CMS code injection flaw as exploited in attacks\nCentreStack RCE exploited as zero-day to breach file sharing servers\nCISA tags NAKIVO backup flaw as actively exploited in attacks\nSAP fixes suspected NetWeaver zero-day exploited in attacks\nLazarus hackers breach six companies in watering hole attacks"
    },
    {
        "Title": "Google: 97 zero-days exploited in 2024, over 50% in spyware attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/google-97-zero-days-exploited-in-2024-over-50-percent-in-spyware-attacks/",
        "Summary": "Google's Threat Intelligence Group (GTIG) says attackers exploited 75 zero-day vulnerabilities in the wild last year, over 50% of which were linked to spyware attacks. [...]",
        "Date": "2025-04-29",
        "Content": "Google's Threat Intelligence Group (GTIG) says attackers exploited 75 zero-day vulnerabilities in the wild last year, over 50% of which were linked to spyware attacks.\nThese numbers are down from 97 zero-days in 2023 but up from 63 in 2022, which GTIG analysts attributed to year-to-year swings reflecting expected variation within an upward trajectory for attacks exploiting zero-days, which the company defines as vulnerabilities exploited in the wild before vendors release patches.\nThey noted that cyber-espionage threat actors—including government-backed groups and commercial surveillance vendors' customers—were responsible for more than half of attributable zero-day attacks in 2024. Out of these, China-linked groups exploited five zero-days, commercial surveillance customers eight, while North Korean operators were linked to five zero-day exploits for the first time, used in attacks blending espionage and financial motives.\nLast year, Google's Threat Analysis Group (TAG) and Google subsidiary Mandiant\nsaw 97 zero-days exploited in attacks\n, a surge of over 50 percent compared to the previous year's 62 vulnerabilities, many also linked to spyware vendors and their clients.\nWhile annual counts have fluctuated massively over the past four years, the average trend line shows a steady increase in zero-day exploitation. In 2024, end-user platforms and products (e.g., web browsers, mobile devices, and desktop operating systems) bore the brunt of this activity,\nEnd-user platforms and products (e.g., web browsers, mobile devices, and desktop operating systems) made up 56 percent of the tracked zero-days. Exploits against browsers fell by roughly one-third, from 17 in 2023 to 11 in 2024, while mobile device zero-days dropped by nearly half, from 17 to nine.\nGoogle Chrome remained the primary browser target, and desktop operating system exploits rose from 17 to 22, with Windows zero-days climbing to 22 last year, up from 16 in 2023 and 13 in 2022.\n\"As long as Windows remains a popular choice both in homes and professional settings, we expect that it will remain a popular target for both zero-day and n-day (i.e. a vulnerability exploited after its patch has been released) exploitation by threat actors,\"\nGTIG said\n.\nZero-days exploited in-the-wild by year (Google)\nOn the other hand, in 2024, attackers exploited 33 of the 75 zero-day flaws (44%) to target products used primarily in business environments, up from 37% in 2023.\nOut of these, security and networking software and appliances accounted for 20 zero-days exploited in the wild, or more than 60% of enterprise-targeted zero-days. Attackers focus on them because breaching a single security appliance or network device can provide them with broad system access without requiring much more sophisticated multi-stage exploit chains.\nAs GTIG threat analysts found, notable enterprise zero-days exploited in 2024 included ones impacting Ivanti Cloud Services Appliance, Cisco Adaptive Security Appliance, Palo Alto Networks PAN-OS, and Ivanti Connect Secure VPN.\n\"Zero-day exploitation continues to grow at a slow but steady pace. However, we've also started seeing vendors' work to mitigate zero-day exploitation start to pay off,\" said Casey Charrier, Senior Analyst at Google Threat Intelligence Group.\n\"For instance, we have observed fewer instances of zero-day exploitation targeting products that have been historically popular, likely due to efforts and resources many large vendors have invested in order to prevent exploitation,\"\n\"At the same time, we're seeing zero-day exploitation shift towards the increased targeting of enterprise-focused products, which requires a wider and more diverse set of vendors to increase proactive security measures. The future of zero-day exploitation will ultimately be dictated by vendors' decisions and ability to counter threat actors' objectives and pursuits.\"\nRelated Articles:\nSerbian police used Cellebrite zero-day hack to unlock Android phones\nGoogle fixes Android zero-days exploited in attacks, 60 other flaws\nGoogle fixes Chrome zero-day exploited in espionage campaign\nWhatsApp patched zero-click flaw exploited in Paragon spyware attacks\nGoogle fixes Android zero-day exploited by Serbian authorities"
    },
    {
        "Title": "Many Fuel Tank Monitoring Systems Vulnerable to Disruption",
        "Link": "https://www.darkreading.com/ics-ot-security/fuel-tank-monitoring-systems-vulnerable-disruption",
        "Summary": "Thousands of automatic tank gauge (ATG) devices are accessible over the Internet and are just &quot;a packet away&quot; from compromise, security researcher warns at 2025 RSAC Conference.",
        "Date": "2025-04-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/ics-ot-security/fuel-tank-monitoring-systems-vulnerable-disruption"
    },
    {
        "Title": "From Mission-Centric to People-Centric: Competitive Leadership in Cyber",
        "Link": "https://www.darkreading.com/remote-workforce/mission-people-competitive-leadership-cyber",
        "Summary": "Making a case for empathy in cyber-leadership roles as a strategic business advantage.",
        "Date": "2025-04-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/mission-people-competitive-leadership-cyber"
    },
    {
        "Title": "Hacking in Space: Not as Tough as You Might Think",
        "Link": "https://www.darkreading.com/cloud-security/hacking-space-not-tough",
        "Summary": "Barbara Grofe, space asset security architect at Spartan Corp, discussed the realities of hacking in space, and the outlook is not pie-in-the-sky.",
        "Date": "2025-04-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/hacking-space-not-tough"
    },
    {
        "Title": "US Critical Infrastructure Still Struggles With OT Security",
        "Link": "https://www.darkreading.com/remote-workforce/critical-infrastructure-struggles-ot-security",
        "Summary": "How does a company defend itself from cyberattacks by a foreign adversary? A collection of experts gathered at this year's RSAC Conference to explain how the US can help.",
        "Date": "2025-04-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/critical-infrastructure-struggles-ot-security"
    },
    {
        "Title": "Risks of Using AI Models Developed by Competing Nations",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/risks-using-ai-models-developed-competing-nations",
        "Summary": "The current offline/open source model boom is unstoppable. Its impact depends on how well the risks are managed today.",
        "Date": "2025-04-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/risks-using-ai-models-developed-competing-nations"
    },
    {
        "Title": "Windows Backdoor Targets Members of Exiled Uyghur Community",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/windows-backdoor-targets-members-exhiled-uyghur-community",
        "Summary": "A spear-phishing campaign sent Trojanized versions of legitimate word-processing software to members of the World Uyghur Congress as part of China's continued cyber-espionage activity against the ethnic minority.",
        "Date": "2025-04-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/windows-backdoor-targets-members-exhiled-uyghur-community"
    },
    {
        "Title": "Vulnerability Exploitation Is Shifting in 2024-25",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/vulnerability-exploitation-shifting-2024-25",
        "Summary": "The number of vulnerabilities exploited by attacks may not be growing these days, but they are increasingly affecting enterprise technologies.",
        "Date": "2025-04-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/vulnerability-exploitation-shifting-2024-25"
    },
    {
        "Title": "How do You Know if You’re Ready for a Red Team Partnership?",
        "Link": "https://www.securityweek.com/how-do-you-know-if-youre-ready-for-a-red-team-partnership/",
        "Summary": "<p>Before engaging in a full-scope exercise, it’s important to assess whether your program, people and processes are truly ready. </p>\n<p>The post <a href=\"https://www.securityweek.com/how-do-you-know-if-youre-ready-for-a-red-team-partnership/\">How do You Know if You’re Ready for a Red Team Partnership?</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/how-do-you-know-if-youre-ready-for-a-red-team-partnership/"
    },
    {
        "Title": "SentinelOne’s Purple AI Athena Brings Autonomous Decision-Making to the SOC",
        "Link": "https://www.securityweek.com/sentinelones-purple-ai-athena-brings-autonomous-decision-making-to-the-soc/",
        "Summary": "<p>Athena marks a major leap in SOC automation, enabling real-time detection, triage, and remediation with minimal human oversight.</p>\n<p>The post <a href=\"https://www.securityweek.com/sentinelones-purple-ai-athena-brings-autonomous-decision-making-to-the-soc/\">SentinelOne&#8217;s Purple AI Athena Brings Autonomous Decision-Making to the SOC</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/sentinelones-purple-ai-athena-brings-autonomous-decision-making-to-the-soc/"
    },
    {
        "Title": "China’s Secret Weapon? How EV Batteries Could be  Weaponized to Disrupt America",
        "Link": "https://www.securityweek.com/chinas-secret-weapon-how-ev-batteries-could-be-weaponized-to-disrupt-america/",
        "Summary": "<p>As Xi Jinping advances his vision for China’s dominance by 2049, cybersecurity experts warn that connected technologies—like EV batteries—may quietly serve as tools of influence, espionage, and disruption.</p>\n<p>The post <a href=\"https://www.securityweek.com/chinas-secret-weapon-how-ev-batteries-could-be-weaponized-to-disrupt-america/\">China&#8217;s Secret Weapon? How EV Batteries Could be  Weaponized to Disrupt America</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chinas-secret-weapon-how-ev-batteries-could-be-weaponized-to-disrupt-america/"
    },
    {
        "Title": "Pistachio Raises $7 Million for Cybersecurity Training Platform",
        "Link": "https://www.securityweek.com/pistachio-raises-7-million-for-cybersecurity-training-platform/",
        "Summary": "<p>Cybersecurity awareness training platform Pistachio has raised $7 million in a Series A funding round led by Walter Ventures.</p>\n<p>The post <a href=\"https://www.securityweek.com/pistachio-raises-7-million-for-cybersecurity-training-platform/\">Pistachio Raises $7 Million for Cybersecurity Training Platform</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/pistachio-raises-7-million-for-cybersecurity-training-platform/"
    },
    {
        "Title": "LayerX Raises $11 Million for Browser Security Solution",
        "Link": "https://www.securityweek.com/layerx-raises-11-million-for-its-browser-security-solution/",
        "Summary": "<p>Browser security firm LayerX has raised $11 million in a Series A funding round extension led by Jump Capital.</p>\n<p>The post <a href=\"https://www.securityweek.com/layerx-raises-11-million-for-its-browser-security-solution/\">LayerX Raises $11 Million for Browser Security Solution</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/layerx-raises-11-million-for-its-browser-security-solution/"
    },
    {
        "Title": "Cybersecurity Firms Raise Over $1.7 Billion Ahead of RSA Conference 2025",
        "Link": "https://www.securityweek.com/cybersecurity-firms-raise-over-1-7-billion-ahead-of-rsa-conference-2025/",
        "Summary": "<p>More than 30 companies announced a total of $1.7 billion in funding in weeks leading up to the industry’s largest gathering.</p>\n<p>The post <a href=\"https://www.securityweek.com/cybersecurity-firms-raise-over-1-7-billion-ahead-of-rsa-conference-2025/\">Cybersecurity Firms Raise Over $1.7 Billion Ahead of RSA Conference 2025</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cybersecurity-firms-raise-over-1-7-billion-ahead-of-rsa-conference-2025/"
    },
    {
        "Title": "Google Tracked 75 Zero-Days in 2024",
        "Link": "https://www.securityweek.com/google-tracked-75-zero-days-in-2024/",
        "Summary": "<p>The number of exploited zero-days seen by Google in 2024 dropped to 75, from 98 observed in the previous year.</p>\n<p>The post <a href=\"https://www.securityweek.com/google-tracked-75-zero-days-in-2024/\">Google Tracked 75 Zero-Days in 2024</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/google-tracked-75-zero-days-in-2024/"
    },
    {
        "Title": "RSA Conference 2025 Announcements Summary (Day 1)",
        "Link": "https://www.securityweek.com/rsa-conference-2025-announcements-summary-day-1/",
        "Summary": "<p>Hundreds of companies are showcasing their products and services this week at the 2025 edition of the RSA Conference in San Francisco.</p>\n<p>The post <a href=\"https://www.securityweek.com/rsa-conference-2025-announcements-summary-day-1/\">RSA Conference 2025 Announcements Summary (Day 1) </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/rsa-conference-2025-announcements-summary-day-1/"
    },
    {
        "Title": "Exploited Vulnerability Exposes Over 400 SAP NetWeaver Servers to Attacks",
        "Link": "https://www.securityweek.com/exploited-vulnerability-exposes-over-400-sap-netweaver-servers-to-attacks/",
        "Summary": "<p>More than 400 SAP NetWeaver servers are impacted by CVE-2025-31324, an exploited remote code execution vulnerability.</p>\n<p>The post <a href=\"https://www.securityweek.com/exploited-vulnerability-exposes-over-400-sap-netweaver-servers-to-attacks/\">Exploited Vulnerability Exposes Over 400 SAP NetWeaver Servers to Attacks</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/exploited-vulnerability-exposes-over-400-sap-netweaver-servers-to-attacks/"
    },
    {
        "Title": "CISA Warns of Exploited Broadcom, Commvault Vulnerabilities",
        "Link": "https://www.securityweek.com/cisa-warns-of-exploited-broadcom-commvault-vulnerabilities/",
        "Summary": "<p>CISA urges immediate patching for recently disclosed Broadcom, Commvault, and Qualitia vulnerabilities exploited in the wild.</p>\n<p>The post <a href=\"https://www.securityweek.com/cisa-warns-of-exploited-broadcom-commvault-vulnerabilities/\">CISA Warns of Exploited Broadcom, Commvault Vulnerabilities</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cisa-warns-of-exploited-broadcom-commvault-vulnerabilities/"
    }
]