[
    {
        "Title": "Chinese Hackers Target Linux Systems Using SNOWLIGHT Malware and VShell Tool",
        "Link": "https://thehackernews.com/2025/04/chinese-hackers-target-linux-systems.html",
        "Summary": "The China-linked threat actor known as UNC5174 has been attributed to a new campaign that leverages a variant of a known malware dubbed SNOWLIGHT and a new open-source tool called VShell to infect Linux systems.\n\"Threat actors are increasingly using open source tools in their arsenals for cost-effectiveness and obfuscation to save money and, in this case, plausibly blend in with the pool of",
        "Date": "2025-04-15",
        "Content": "The China-linked threat actor known as UNC5174 has been attributed to a new campaign that leverages a variant of a known malware dubbed SNOWLIGHT and a new open-source tool called VShell to infect Linux systems.\n\"Threat actors are increasingly using open source tools in their arsenals for cost-effectiveness and obfuscation to save money and, in this case, plausibly blend in with the pool of non-state-sponsored and often less technical adversaries (e.g., script kiddies), thereby making attribution even more difficult,\" Sysdig researcher Alessandra Rizzo\nsaid\nin a report shared with The Hacker News.\n\"This seems to hold especially true for this particular\nthreat actor\n, who has been under the radar for the last year since being affiliated with the Chinese government.\"\nUNC5174, also referred to as Uteus (or Uetus), was\npreviously documented\nby Google-owned Mandiant as exploiting security flaws in Connectwise ScreenConnect and F5 BIG-IP software to deliver a C-based ELF downloader named SNOWLIGHT, which is designed to fetch a Golang tunneler dubbed GOHEAVY from infrastructure tied to a publicly available command-and-control (C2) framework known as SUPERSHELL.\nAlso deployed in the attacks was GOREVERSE, a publicly available reverse shell backdoor written in Golang that operates over Secure Shell (SSH).\nThe French National Agency for the Security of Information Systems (ANSSI), in its\nCyber Threat Overview report\nfor 2024 published last month, said it observed an attacker employing similar tradecraft as that of UNC5174 to weaponize security flaws in Ivanti Cloud Service Appliance (CSA) such as\nCVE-2024-8963\n,\nCVE-2024-9380\n, and\nCVE-2024-8190\nto gain control and execute arbitrary code.\n\"Moderately sophisticated and discreet, this intrusion set is characterized by the use of intrusion tools largely available as open source and by the – already publicly reported – use of a rootkit code,\" the ANSSI said.\nIt's worth noting that both SNOWLIGHT and VShell are capable of\ntargeting Apple macOS systems\n, with the latter distributed as a fake Cloudflare authenticator application as part of an as-yet-undetermined attack chain, according to an\nanalysis of artifacts\nuploaded to VirusTotal from China in October 2024.\nIn the attack chain observed by Sysdig in late January 2025, the SNOWLIGHT malware acts as a dropper for a fileless, in-memory payload called\nVShell\n, a remote access trojan (RAT) widely used by Chinese-speaking cybercriminals. The initial access vector used for the attack is presently unknown.\nSpecifically, the initial access is used to execute a malicious bash script (\"download_backd.sh\") that deploys two binaries associated with SNOWLIGHT (dnsloger) and\nSliver\n(system_worker), both of which are used to set up persistence and establish communications with a C2 server.\nThe final stage of the attack delivers\nVShell\nvia SNOWLIGHT by means of a specially crafted request to the C2 server, thereby enabling remote control and further post-compromise exploitation.\n\"[VShell] acts as a RAT (Remote Access Trojan), allowing its abusers to execute arbitrary commands and download or upload files,\" Rizzo said. \"SNOWLIGHT and VShell pose a significant risk to organizations due to their stealthy and sophisticated techniques,\" Sysdig said. \"This is evidenced by the employment of WebSockets for command-and-control, as well as the fileless VShell payload.\"\nThe disclosure comes as TeamT5\nrevealed\nthat a China-nexus hacking group likely exploited security flaws in Ivanti appliances (\nCVE-2025-0282\nand\nCVE-2025-22457\n) to gain initial access and deploy the\nSPAWNCHIMERA\nmalware.\nThe attacks, the Taiwanese cybersecurity company said, targeted a multitude of sectors spanning nearly 20 different countries such as Austria, Australia, France, Spain, Japan, South Korea, Netherlands, Singapore, Taiwan, the United Arab Emirates, the United Kingdom, and the United States.\nThe findings also\ndovetail with accusations\nfrom China that the U.S. National Security Agency (NSA)\nlaunched\n\"advanced\" cyber attacks during the Asian Winter Games in February, pointing fingers at three NSA agents for repeated attacks on China's critical information infrastructure as well as against Huawei.\n\"At the ninth Asian Winter Games, the U.S. government conducted cyberattacks on the information systems of the Games and the critical information infrastructure in Heilongjiang,\" Foreign Ministry Spokesperson Lin Jian\nsaid\n. \"This move is egregious for it severely endangers the security of China's critical information infrastructure, national defense, finance, society, and production as well as its citizens' personal information.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Critical Apache Roller Vulnerability (CVSS 10.0) Enables Unauthorized Session Persistence",
        "Link": "https://thehackernews.com/2025/04/critical-apache-roller-vulnerability.html",
        "Summary": "A critical security vulnerability has been disclosed in the Apache Roller open-source, Java-based blogging server software that could allow malicious actors to retain unauthorized access even after a password change.\nThe flaw, assigned the CVE identifier CVE-2025-24859, carries a CVSS score of 10.0, indicating maximum severity. It affects all versions of Roller up to and including 6.1.4.",
        "Date": "2025-04-15",
        "Content": "A critical security vulnerability has been disclosed in the\nApache Roller\nopen-source, Java-based blogging server software that could allow malicious actors to retain unauthorized access even after a password change.\nThe flaw, assigned the CVE identifier\nCVE-2025-24859\n, carries a CVSS score of 10.0, indicating maximum severity. It affects all versions of Roller up to and including 6.1.4.\n\"A session management vulnerability exists in Apache Roller before version 6.1.5 where active user sessions are not properly invalidated after password changes,\" the project maintainers\nsaid\nin an advisory.\n\"When a user's password is changed, either by the user themselves or by an administrator, existing sessions remain active and usable.\"\nSuccessful exploitation of the flaw could enable an attacker to maintain continued access to the application through old sessions even after password changes. It could also enable unfettered access if credentials were compromised.\nThe shortcoming has been addressed in version 6.1.5 by implementing centralized session management such that all active sessions are invalidated when passwords are changed or users are disabled.\nSecurity researcher Haining Meng has been credited with discovering and reporting the vulnerability.\nThe disclosure comes weeks after another critical vulnerability was disclosed in Apache Parquet's Java Library (\nCVE-2025-30065\n, CVSS score: 10.0) that, if successfully exploited, could allow a remote attacker to execute arbitrary code on susceptible instances.\nLast month, a\ncritical\nsecurity flaw\nimpacting Apache Tomcat (\nCVE-2025-24813\n, CVSS score: 9.8) came under active exploitation shortly after details of the bug became public knowledge.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Majority of Browser Extensions Can Access Sensitive Enterprise Data, New Report Finds",
        "Link": "https://thehackernews.com/2025/04/majority-of-browser-extensions-can.html",
        "Summary": "Everybody knows browser extensions are embedded into nearly every user’s daily workflow, from spell checkers to GenAI tools. What most IT and security people don’t know is that browser extensions’ excessive permissions are a growing risk to organizations.\nLayerX today announced the release of the Enterprise Browser Extension Security Report 2025, This report is the first and only report to merge",
        "Date": "2025-04-15",
        "Content": "Everybody knows browser extensions are embedded into nearly every user's daily workflow, from spell checkers to GenAI tools. What most IT and security people don't know is that browser extensions' excessive permissions are a growing risk to organizations.\nLayerX today announced the release of the Enterprise\nBrowser Extension Security Report 2025\n, This report is the first and only report to merge public extension marketplace statistics with real-world enterprise usage telemetry. By doing so, it sheds light on one of the most underestimated threat surfaces in modern cybersecurity: browser extensions.\nThe report reveals several findings that IT and security leaders will find interesting, as they build their plans for H2 2025. This includes information and analysis on how many extensions have risky permissions, which kinds of permissions are given, if extension developers are to be trusted, and more. Below, we bring key statistics from the report.\nHighlights from the Enterprise Browser Extension Security Report 2025\n1. Browser extensions are ubiquitous in enterprise environments.\n99%, nearly all, of employees, have browser extensions installed. 52% have more than 10 extensions installed.\nSecurity analysis: Nearly all employees are exposed to browser extension risk.\n2. Most extensions can access critical data.\n53% of enterprise users' extensions can access sensitive data like cookies, passwords, web page contents, browsing information, and more.\nSecurity analysis: An employee-level compromise could jeopardize the entire organization.\n3. Who publishes these extensions? Who knows?\nMore than half (54%) of extension publishers are unknown and only identified via Gmail. 79% of publishers only published one extension.\nSecurity analysis: Tracking the reputability of extensions is difficult, if possible at all with IT resources.\n4. GenAI extensions are a growing threat\n. Over 20% of users have at least one GenAI extension, and 58% of these have high-risk permission scopes.\nSecurity analysis: Enterprises should define clear policies for GenAI extension use and data sharing.\n5. Unmaintained and unknown browser extensions are a growing concern.\n51% of extensions haven't been updated in over a year, and 26% of enterprise extensions are sideloaded, bypassing even basic store vetting.\nSecurity analysis: Extensions can be vulnerable even if they're not purposefully malicious.\n5 Recommendations for Security and IT\nThe report not only brings data, it also provides actionable guidance for security and IT teams, recommending how to deal with the browser extension threat.\nHere's what LayerX advises organizations:\nAudit all extensions\n- A full picture of extensions is the foundation for understanding the threat surface. Therefore, the first step in securing against malicious browser extensions is to audit all extensions in use by employees.\nCategorize extensions\n- Certain types of extensions that make them appealing to attack. This can be due to their broad user base (such as GenAI extensions) or because of the permissions granted to such extensions. Categorizing extensions can help assess the browser extension security posture.\nEnumerate extension permissions\n- The next step is to list the information extensions can access. This helps further map the attack surface and configure policies later on.\nAssess extension risk\n- Now it's time for risk management. This means assessing the risk for each extension based on their permissions and the information they can access. In addition, a holistic risk assessment includes external parameters such as reputation, popularity, publisher, and installation method. Together, these parameters should be combined into a unified risk score.\nApply adaptive, risk-based enforcement\n- Finally, organizations can use their analysis to apply adaptive, risk-based enforcement policies tailored to their uses, needs, and risk profile.\nAccess the Report\nBrowser extensions are not just a productivity tool, they're an attack vector most organizations do not know exists. LayerX's 2025 report provides comprehensive findings and data-driven analysis to help CISOs and security teams rein in this risk and build defensible browser environments.\nDownload the full report.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Malicious PyPI Package Targets MEXC Trading API to Steal Credentials and Redirect Orders",
        "Link": "https://thehackernews.com/2025/04/malicious-pypi-package-targets-mexc.html",
        "Summary": "Cybersecurity researchers have disclosed a malicious package uploaded to the Python Package Index (PyPI) repository that's designed to reroute trading orders placed on the MEXC cryptocurrency exchange to a malicious server and steal tokens.\nThe package, ccxt-mexc-futures, purports to be an extension built on top of a popular Python library named ccxt (short for CryptoCurrency eXchange Trading),",
        "Date": "2025-04-15",
        "Content": "Cybersecurity researchers have disclosed a malicious package uploaded to the Python Package Index (PyPI) repository that's designed to reroute trading orders placed on the\nMEXC\ncryptocurrency exchange to a malicious server and steal tokens.\nThe package, ccxt-mexc-futures, purports to be an extension built on top of a popular Python library named\nccxt\n(short for CryptoCurrency eXchange Trading), which is used to connect and trade with several cryptocurrency exchanges and facilitate payment processing services.\nThe malicious package is no longer available on PyPI, but statistics on pepy.tech shows that it has been downloaded at least\n1,065 times\n.\n\"The authors of the malicious ccxt-mexc-futures package, claim in its README file that it extends the CCXT package to\nsupport 'futures' trade\non MEXC,\" JFrog researcher Guy Korolevski\nsaid\nin a report shared with The Hacker News.\nHowever, a deeper examination of the library has revealed that it specifically overrides two APIs associated with the MEXC interface -- contract_private_post_order_submit and contract_private_post_order_cancel -- and introduces a new one named spot4_private_post_order_place.\nIn doing so, the idea is to trick developers into calling these API endpoints to create, cancel, or place a trading order on the MEXC exchange and stealthily perform malicious actions in the background.\nThe malicious modifications particularly target three different MEXC-related functions present in the original ccxt library, viz. ֵdescribe, sign, and prepare_request_headers.\nThis makes it possible to execute arbitrary code on the local machine on which the package is installed, effectively retrieving a JSON payload from a bogus domain impersonating MEXC (\"v3.mexc.workers[.]dev\"), which contains a configuration to direct the overridden APIs to a malicious third-party platform (\"greentreeone[.]com\") as opposed to the actual MEXC website.\n\"The package creates entries in the API for MEXC integration, using an API that directs requests to the domain greentreeone[.]com, and not the MEXC site mexc.com,\" Korolevski said.\n\"All requests are redirected to the domain set up by the attackers, allowing them to hijack all of the victim's crypto tokens and sensitive information transferred in the request, including API keys and secrets.\"\nWhat's more, the fraudulent package is engineered to send the MEXC API key and secret key to the attacker-controlled domain whenever a request is sent to create, cancel, or place an order.\nUsers who have installed ccxt-mexc-futures are recommended to revoke any potentially compromised tokens and remove the package with immediate effect.\nThe development comes as Socket\nrevealed\nthat threat actors are making use of counterfeit packages across npm, PyPI, Go, and Maven ecosystems to launch a reverse shell to maintain persistence and exfiltrate data.\n\"Unsuspecting developers or organizations might inadvertently be including vulnerabilities or malicious dependencies in their code base, which could allow for sensitive data or system sabotage if undetected,\" the software supply chain security company said.\nIt also follows new research that delves into how large language models (LLMs) powering generative artificial intelligence (AI) tools could\nendanger\nthe\nsoftware supply chain\nby hallucinating non-existent packages and recommending them to developers.\nThe\nsupply chain threat\ncomes into play when malicious actors register and publish malware-laced packages with the hallucinated names to open-source repositories, infecting developer systems in the process – a technique referred to as\nslopsquatting\n.\nThe academic study\nfound\nthat \"the average percentage of hallucinated packages is at least 5.2% for commercial models and 21.7% for open-source models, including a staggering 205,474 unique examples of hallucinated package names, further underscoring the severity and pervasiveness of this threat.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Crypto Developers Targeted by Python Malware Disguised as Coding Challenges",
        "Link": "https://thehackernews.com/2025/04/crypto-developers-targeted-by-python.html",
        "Summary": "The North Korea-linked threat actor assessed to be behind the massive Bybit hack in February 2025 has been linked to a malicious campaign that targets developers to deliver new stealer malware under the guise of a coding assignment.\nThe activity has been attributed by Palo Alto Networks Unit 42 to a hacking group it tracks as Slow Pisces, which is also known as Jade Sleet, PUKCHONG,",
        "Date": "2025-04-15",
        "Content": "The North Korea-linked threat actor assessed to be behind the\nmassive Bybit hack\nin February 2025 has been linked to a malicious campaign that targets developers to deliver new stealer malware under the guise of a coding assignment.\nThe activity has been attributed by Palo Alto Networks Unit 42 to a hacking group it tracks as\nSlow Pisces\n, which is also known as Jade Sleet, PUKCHONG, TraderTraitor, and UNC4899.\n\"Slow Pisces engaged with cryptocurrency developers on LinkedIn, posing as potential employers and sending malware disguised as coding challenges,\" security researcher Prashil Pattni\nsaid\n. \"These challenges require developers to run a compromised project, infecting their systems using malware we have named RN Loader and RN Stealer.\"\nSlow Pisces has a history of targeting developers, typically in the cryptocurrency sector, by approaching them on LinkedIn as part of a supposed job opportunity and enticing them into opening a PDF document that details the coding assignment hosted on GitHub.\nIn July 2023, GitHub\nrevealed\nthat employees working at blockchain, cryptocurrency, online gambling, and cybersecurity companies were singled out by the threat actor, deceiving them into running malicious npm packages.\nThen last June, Google-owned Mandiant\ndetailed\nthe attackers' modus operandi of first sending to targets on LinkedIn a benign PDF document containing a job description for an alleged job opportunity and following it up with a skills questionnaire should they express interest.\nThe questionnaire included instructions to complete a coding challenge by downloading a trojanized Python project from GitHub that, while ostensibly capable of viewing cryptocurrency prices, was designed to contact a remote server to fetch an unspecified second-stage payload if certain conditions are met.\nThe multi-stage attack chain documented by Unit 42 follows the same approach, with the malicious payload sent only to validated targets, likely based on IP address, geolocation, time, and HTTP request headers.\n\"Focusing on individuals contacted via LinkedIn, as opposed to broad phishing campaigns, allows the group to tightly control the later stages of the campaign and deliver payloads only to expected victims,\" Pattni said. \"To avoid the suspicious eval and exec functions, Slow Pisces uses\nYAML deserialization\nto execute its payload.\"\nThe payload is configured to execute a malware family named RN Loader, which sends basic information about the victim machine and operating system over HTTPS to the same server and receives and executes a next-stage Base64-encoded blob.\nThe newly downloaded malware is RN Stealer, an information stealer capable of harvesting sensitive information from infected Apple macOS systems. This includes system metadata, installed applications, directory listing, and the top-level contents of the victim's home directory, iCloud Keychain, stored SSH keys, and configuration files for AWS, Kubernetes, and Google Cloud.\n\"The infostealer gathers more detailed victim information, which attackers likely used to determine whether they needed continued access,\" Unit 42 said.\nTargeted victims who apply for a JavaScript role, likewise, are urged to download a \"Cryptocurrency Dashboard\" project from GitHub that employs a similar strategy where the command-and-control (C2) server only serves additional payloads when the targets meet certain criteria. However, the exact nature of the payload is unknown.\n\"The repository uses the\nEmbedded JavaScript (EJS) templating tool\n, passing responses from the C2 server to the ejs.render() function,\" Pattni pointed out. \"Like the use of yaml.load(), this is another technique Slow Pisces employs to conceal execution of arbitrary code from its C2 servers, and this method is perhaps only apparent when viewing a valid payload.\"\nJade Sleet is one among the many\nNorth Korean threat activity clusters\nto leverage job opportunity-themed lures as a malware distributor vector, the others being\nOperation Dream Job\n,\nContagious Interview\n, and\nAlluring Pisces\n.\n\"These groups feature no operational overlaps. However, these campaigns making use of similar initial infection vectors is noteworthy,\" Unit 42 concluded. \"Slow Pisces stands out from their peers' campaigns in operational security. Delivery of payloads at each stage is heavily guarded, existing in memory only. And the group's later stage tooling is only deployed when necessary.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Gladinet’s Triofox and CentreStack Under Active Exploitation via Critical RCE Vulnerability",
        "Link": "https://thehackernews.com/2025/04/gladinets-triofox-and-centrestack-under.html",
        "Summary": "A recently disclosed security flaw in Gladinet CentreStack also impacts its Triofox remote access and collaboration solution, according to Huntress, with seven different organizations compromised to date.\nTracked as CVE-2025-30406 (CVSS score: 9.0), the vulnerability refers to the use of a hard-coded cryptographic key that could expose internet-accessible servers to remote code execution attacks",
        "Date": "2025-04-15",
        "Content": "A recently disclosed security flaw in Gladinet CentreStack also impacts its Triofox remote access and collaboration solution, according to Huntress, with seven different organizations compromised to date.\nTracked as\nCVE-2025-30406\n(CVSS score: 9.0), the vulnerability refers to the use of a hard-coded cryptographic key that could expose internet-accessible servers to remote code execution attacks.\nIt has been addressed in CentreStack version 16.4.10315.56368 released on April 3, 2025. The vulnerability is said to have been exploited as a zero-day in March 2025, although the exact nature of the attacks is unknown.\nNow, according to Huntress, the weakness also\naffects Gladinet Triofox\nup to version 16.4.10317.56372.\n\"By default, previous versions of the Triofox software have the same hardcoded cryptographic keys in their configuration file, and can be easily abused for remote code execution,\" John Hammond, principal cybersecurity researcher at Huntress,\nsaid\nin a report.\nTelemetry data gathered from its partner base has revealed that the CentreStack software is installed on about 120 endpoints and that seven unique organizations were affected by the exploitation of the vulnerability.\nThe earliest sign of compromise dates back to April 11, 2025, 16:59:44 UTC. The attackers have been observed leveraging the flaw to download and sideload a DLL using an encoded PowerShell script, an approach seen in\nrecent attacks\nusing the\nCrushFTP flaw\n, followed by conducting lateral movement and installing MeshCentral for remote access.\nHuntress also said the attackers have been identified as running Impacket PowerShell commands to perform various enumeration commands and install MeshAgent. That said, the exact scale and the end goal of the campaigns are currently unknown.\nIn light of active exploitation, it's essential that users of Gladinet CentreStack and Triofox update their instances to the latest version to safeguard against potential risks.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Meta Resumes E.U. AI Training Using Public User Data After Regulator Approval",
        "Link": "https://thehackernews.com/2025/04/meta-resumes-eu-ai-training-using.html",
        "Summary": "Meta has announced that it will begin to train its artificial intelligence (AI) models using public data shared by adults across its platforms in the European Union, nearly a year after it paused its efforts due to data protection concerns from Irish regulators.\n\"This training will better support millions of people and businesses in Europe, by teaching our generative AI models to better",
        "Date": "2025-04-15",
        "Content": "Meta has announced that it will begin to train its artificial intelligence (AI) models using public data shared by adults across its platforms in the European Union, nearly a year after it\npaused its efforts\ndue to data protection concerns from Irish regulators.\n\"This training will better support millions of people and businesses in Europe, by teaching our generative AI models to better understand and reflect their cultures, languages, and history,\" the company\nsaid\n.\nTo that end, users' posts and comments, as well as their interactions with Meta AI, are expected to be used for training and improving the models. It does not cover private messages sent between friends and family and data from accounts below the age of 18.\nUsers in the region will start receiving notifications this week, both in the apps and via email, that detail the kinds of data the company will be using for this purpose and why it matters in the context of improving AI and the overall user experience.\nThe notifications will also include an opt-out link to a form where users can choose to object to their public data being collected for AI training. Meta said it will honor all objection forms it has already received, along with newly submitted ones.\nThe development comes shortly after the European Data Protection Board (EDPB) approved the rollout owing to it meeting legal obligations under the bloc's stringent data protection laws. Last month, the social media giant\nlaunched\nMeta AI in the European Union across its digital real estate: Facebook, Instagram, WhatsApp, and Messenger.\nThe company has also pointed out that it's \"following the example set by others including Google and OpenAI,\" adding both companies used data from European users to train and fine-tune their respective models.\nNews of Meta's AI training plans coincides with a\nreport\nfrom Apple about how it uses techniques like\ndifferential privacy\nand synthetic data generation to improve several features like Genmoji and Image Playground, Image Wand, Memories Creation, and Writing Tools in Apple Intelligence without sacrificing user privacy when they choose to send Device Analytics information to the company.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "ChatGPT 4.1 early benchmarks compared against Google Gemini",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-41-early-benchmarks-compared-against-google-gemini/",
        "Summary": "ChatGPT 4.1 is now rolling out, and it's a significant leap from GPT 4o, but it fails to beat the benchmark set by Google's most powerful model, Gemini. [...]",
        "Date": "2025-04-15",
        "Content": "ChatGPT 4.1 is now rolling out, and it's a significant leap from GPT 4o, but it fails to beat the benchmark set by Google Gemini.\nYesterday, OpenAI\nconfirmed\nthat developers with API access can try as many as three new models: GPT‑4.1, GPT‑4.1 mini, and GPT‑4.1 nano.\nAccording to the benchmarks, these models are far better than the existing GPT‑4o and GPT‑4o mini, particularly in coding.\nFor example, GPT‑4.1 scores 54.6% on SWE-bench Verified, which is better than GPT-4o by 21.4% and 26.6% over GPT‑4.5. We have similar results on other benchmarking tools shared by OpenAI, but how does it compete against Gemini models.\nChatGPT 4.1 early benchmarks\nBenchmarks comparing LLMs\nAccording to benchmarks\nshared\nby Stagehand, which is a production-ready browser automation framework, Gemini 2.0 Flash has the lowest error rate (6.67%) along with the highest exact‑match score (90%), and it’s also cheap and fast.\nOn the other hand, GPT‑4.1 has a higher error rate (16.67%) and costs over 10 times more than Gemini 2.0 Flash.\nOther GPT variants (like “nano” or “mini”) are cheaper or faster but not as accurate as GPT-4.1\nChart compares LLMs by plotting their performance (on the vertical axis) against their price per million tokens (on the horizontal axis)\nIn another data\nshared\nby Pierre Bongrand, who is a scientist working on RNA at Harward, GPT‑4.1 offers poorer cost-effectiveness than competing models.\nThis is an important factor because GPT4.1 is cheaper than ChatGPT 4o.\nModels like Gemini 2.0 Flash, Gemini 2.5 Pro, and even DeepSeek or o3 mini lie closer to or on the frontier, which suggests they deliver higher performance at a lower or comparable cost.\nUltimately, while GPT‑4.1 still works as an option, it's clearly overshadowed by cheaper or more capable alternatives.\nCoding benchmarks show GPT-4.1 lags behind Gemini 2.5\nWe're seeing similar results in coding benchmarks, with\nAider Polyglot\nlisting GPT-4.1 with a 52% score, while Gemini 2.5 is miles ahead at 73%.\nIt is also important to note that GPT-4.1 is a non-reasoning model, and it's still one of the best models for coding.\nGPT-4.1 is available via API, but you can use it for free if you sign up for\nWindsurf AI\n.\nRelated Articles:\nOpenAI's GPT-4.1, 4.1 nano, and 4.1 mini models release imminent\nOpenAI wants ChatGPT to 'know you over your life' with new Memory update\nOpenAI tests watermarking for ChatGPT-4o Image Generation model\nOpenAI's $20 ChatGPT Plus is now free for students until the end of May\nChatGPT is down worldwide with something went wrong error"
    },
    {
        "Title": "Midnight Blizzard deploys new GrapeLoader malware in embassy phishing",
        "Link": "https://www.bleepingcomputer.com/news/security/midnight-blizzard-deploys-new-grapeloader-malware-in-embassy-phishing/",
        "Summary": "Russian state-sponsored espionage group Midnight Blizzard is behind a new spear-phishing campaign targeting diplomatic entities in Europe, including embassies. [...]",
        "Date": "2025-04-15",
        "Content": "Russian state-sponsored espionage group Midnight Blizzard is behind a new spear-phishing campaign targeting diplomatic entities in Europe, including embassies.\nMidnight Blizzard, aka 'Cozy Bear' or 'APT29,' is a state-sponsored cyberespionage group linked to Russia's Foreign Intelligence Service (SVR).\nAccording to Check Point Research, the new campaign introduces a previously unseen malware loader called 'GrapeLoader,' and a new variant of the 'WineLoader' backdoor.\nA pour of malware\nThe phishing campaign started in January 2025 and begins with an email spoofing a Ministry of Foreign Affairs, sent from 'bakenhof[.]com' or 'silry[.]com,' inviting the recipient to a wine-tasting event.\nThe email contains a malicious link that, if the victim targeting conditions are met, triggers the download of a ZIP archive (wine.zip). If not, it redirects victims to the legitimate Ministry website.\nThe archive contains a legitimate PowerPoint executable (wine.exe), a legitimate DLL file required for the program to run, and the malicious GrapeLoader payload (ppcore.dll).\nThe malware loader is executed via DLL sideloading, which collects host info, establishes persistence via Windows Registry modification, and contacts the command-and-control (C2) to receive the shellcode it loads in memory.\nGrapeLoader execution chain\nSource: Check Point\nGrapeLoader likely replaces the previously used first-stage HTA loader 'RootSaw,' being stealthier and more sophisticated.\nCheck Point highlights its use of 'PAGE_NOACCESS' memory protections and 10-second delay before running shellcode via 'ResumeThread' to hide malicious payload execution from antivirus and EDR scanners.\nStealthy in-memory payload execution\nSource: Check Point\nGrapeLoader's main tasks in this campaign are stealthy reconnaissance and delivery of WineLoader, which arrives as a trojanized VMware Tools DLL file.\nA full-bodied backdoor\nWineLoader is a modular backdoor that gathers detailed host information and facilitates espionage operations.\nThe collected data includes: IP addresses, name of the process it runs on, Windows user name, Windows machine name, Process ID, and privilege level.\nStolen host data structure\nSource: Check Point\nThis information can help identify sandbox environments and evaluate the target for dropping follow-up payloads.\nThe new variant spotted in the latest APT29 campaign is heavily obfuscated using RVA duplication, export table mismatches, and junk instructions to make it harder to reverse engineer.\nUnpacking routine comparison\nSource: Check Point\nCheck Point notes that string obfuscation in the new WineLoader variant plays a key anti-analysis role, having significantly evolved compared to older versions.\n\"Previously, automated tools like FLOSS could easily extract and deobfuscate strings from an unpacked WINELOADER sample,\"\nexplain the researchers\n.\n\"The improved implementation in the new variant disrupts this process, making automated string extraction and deobfuscation fail.\"\nDue to the campaign being highly targeted and the malware running entirely in memory, Check Point was unable to retrieve WineLoader's full second-stage payload or additional plugins, so the full spectrum of its capabilities or tailored nature per victim remains blurry.\nCheck Point's findings show that\nAPT29\n's tactics and toolset evolve, getting stealthier and more advanced, requiring multi-layered defenses and heightened vigilance to detect and stop.\nRelated Articles:\nRussian hackers attack Western military mission using malicious drive\nIvanti Connect Secure zero-days exploited to deploy custom malware\nRedCurl cyberspies create ransomware to encrypt Hyper-V servers\nChinese Weaver Ant hackers spied on telco network for 4 years\nUS charges Garantex admins with money laundering, sanctions violations"
    },
    {
        "Title": "Landmark Admin data breach impact now reaches 1.6 million people",
        "Link": "https://www.bleepingcomputer.com/news/security/landmark-admin-data-breach-impact-now-reaches-16-million-people/",
        "Summary": "Landmark Admin has issued an update to its investigation of a cyberattack it suffered in May 2024, increasing the number of impacted individuals to 1.6 million. [...]",
        "Date": "2025-04-15",
        "Content": "Landmark Admin has issued an update to its investigation of a cyberattack it suffered in May 2024, increasing the number of impacted individuals to 1.6 million.\nLandmark is a Texas-based third-party administrator (TPA) handling policy accounting, regulatory reporting, reinsurance support, and IT systems for major insurers nationwide like Liberty Bankers Life and American Benefit Life.\nIn October 2024, the company warned that it detected suspicious activity on its networks on May 13th, 2024.\nThe unauthorized access was believed to have exposed the personal information of\n806,519 people\n, including their:\nFull name\nHome address\nSocial Security number\nTax identification number\nDriver's license number\nState-issued identification card\nPassport number\nFinancial account number\nMedical information\nDate of birth\nHealth insurance policy number\nLife and annuity policy information\nThe exact data types exposed vary per individual, and Landmark promised to notify each with a personalized letter specifying which data was compromised.\nIn an updated filing at the Main Attorney General's office, Landmark says its investigations revealed that the number of affected individuals is actually higher, now\nestimated at 1,613,773 people\n.\nLandmark says the forensic investigation remains ongoing, which means that the final tally might eventually be higher and could be revised several times in the future.\n\"Landmark began reviewing the affected systems to identify the specific individuals and the types of information that may have been compromised,\"\nreads the latest notice\n.\n\"While this process remains ongoing, Landmark will notify affected individuals by mail as the information becomes available.\"\nData breach notification recipients are given 90 days from receiving the notification to address their concerns and questions in a dedicated helpline.\nLandmark has also provided 12 months of identity theft protection and credit monitoring coverage to lessen the risk and impact of sensitive data exposure.\nMonitoring credit reports and considering placing fraud alerts or a security freeze are also listed in the recommendations.\nRelated Articles:\nFood giant WK Kellogg discloses data breach linked to Clop ransomware\nWestern Sydney University discloses security breaches, data leak\nUS lab testing provider exposed health data of 1.6 million people\nEuropcar GitLab breach exposes data of up to 200,000 customers\nTexas State Bar warns of data breach after INC ransomware claims attack"
    },
    {
        "Title": "Infamous message board 4chan taken down following major hack",
        "Link": "https://www.bleepingcomputer.com/news/security/infamous-message-board-4chan-taken-down-following-major-hack/",
        "Summary": "4chan, a notorious online forum, was taken offline earlier today after what appears to be a significant hack and has since been loading intermittently. [...]",
        "Date": "2025-04-15",
        "Content": "4chan, an infamous online forum, was taken offline earlier today after what appears to be a significant hack and has since been loading intermittently.\nMembers of the Soyjak.party imageboard (also known as The Party) have since claimed to be behind the attack. They also leaked screenshots of admin panels and a list of emails allegedly belonging to 4chan admins, moderators, and janitors (less privileged mods who help moderate the forums).\"\n\"Tonight has been a very special night for many of us at the soyjak party. Today, April 14, 2025, a hacker, who has been in 4cuck's system for over a year, executed the true operation soyclipse, reopening /qa/, exposing personal information of various 4cuck staff, and leaking code from the site,\" one of them (using the handle Chud) said in a thread posted after 4chan was taken down.\n\"In an attempt to control the damage, 4cuck admins have taken all servers offline, but there are unconfirmed reports that the servers have already been completely compromised and may not be up for some time.\"\nIn the same thread, Chud shared multiple screenshots to prove that hacker had access to 4chan's staff administration panels and maintenance tools.\nThese tools could provide access to any user's location and IP address, rebuild or restart any 4chan boards, access board logs, view site statistics, and manage databases using 4chan's phpMyAdmin panel.\nWhile those who claimed the attack didn't share how they gained access to 4chan's systems, some said the forum was likely breached because it used a\nseverely outdated PHP version\nfrom 2016,\nunpatched against many security vulnerabilities\nthat could've been exploited in the attack.\n​Later in the day, someone else also leaked 4chan's PHP source code on the anonymous forum Kiwi Farms (previously known as CWCki Forums).\nBefore publishing, 4chan was either loading in text-only mode or showing Cloudflare connection timeout errors, hinting that the forum's staff was still working on bringing it back online.\n4chan has been online for over two decades, since 2003, when it was launched by Christopher Poole, known online as moot.\nOver the years, the forum has been used to leak files allegedly stolen from various high-profile companies, including\nMicrosoft\n,\nIntel\n,\nValve\n,\nTwitch\n, and, most recently,\nDisney\n.\nRelated Articles:\nHackers lurked in Treasury OCC’s systems since June 2023 breach\nOracle privately confirms Cloud breach to customers\nOracle denies breach after hacker claims theft of 6 million data records\nBelgium probes if Chinese hackers breached its intelligence service\nAustralian IVF giant Genea breached by Termite ransomware gang"
    },
    {
        "Title": "Microsoft blocks ActiveX by default in Microsoft 365, Office 2024",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-blocks-activex-by-default-in-microsoft-365-office-2024/",
        "Summary": "Microsoft announced it will begin disabling all ActiveX controls in Windows versions of Microsoft 365 and Office 2024 applications later this month. [...]",
        "Date": "2025-04-15",
        "Content": "Microsoft announced it will begin disabling all ActiveX controls in Windows versions of Microsoft 365 and Office 2024 applications later this month.\nIntroduced almost three decades ago, in 1996, ActiveX is a legacy software framework enabling developers to create interactive objects embedded in Office documents.\nAfter this change rolls out, ActiveX will be blocked entirely and without notification in Word, Excel, PowerPoint, and Visio to reduce the risk of malware or unauthorized code execution.\nWhen opening documents with ActiveX controls, a notification will appear at the top with a \"Learn More\" button saying, \"BLOCKED CONTENT: The ActiveX content in this file is blocked.\"\nMicrosoft also warned Office users in a\nseparate support document\nnot to open unexpected file attachments or change ActiveX settings when prompted by random pop-ups and unknown people.\n\"When ActiveX is disabled, you will no longer be able to create or interact with ActiveX objects in Microsoft 365 files. Some existing ActiveX objects will still be visible as a static image, but it will not be possible to interact with them,\"\nsaid Zaeem Patel\n, a product manager on the Office Security team.\nActiveX warning (Microsoft)\n​Microsoft says that those who want to enable ActiveX controls can do so via the Trust Center by going through the following steps (but it's important to note that this will enable ActiveX across all Office apps, including Word, PowerPoint, Excel, and Visio):\nSelect\nFile\n, then\nOptions\n.\nSelect\nTrust Center\n, then the\nTrust Center Settings\nbutton.\nSelect\nActiveX Settings\n, then ensure \"\nPrompt me before enabling all controls with minimal restrictions\"\nis enabled.\nSelect\nOK\n,\nthen\nOK\nagain to save your settings and return to your document.\n\"For optimal security, Microsoft strongly encourages leaving ActiveX controls disabled unless absolutely necessary,\" Microsoft cautioned.\nThe decision to disable it by default was likely prompted by ActiveX's well-known security issues, including\nzero-day vulnerabilities\nthat were exploited by various state-backed and financially motivated threat groups to deploy malware.\nCybercriminals have also used ActiveX controls embedded in Word documents to\ninstall TrickBot malware\nand\nCobalt Strike beacons\nto breach and maintain access to enterprise networks,\nThis move is also a much broader effort to remove or turn off Windows and Office features that attackers have abused to infect Microsoft customers with malware. It goes back to 2018 when Microsoft\nexpanded support for its Antimalware Scan Interface (AMSI)\nto Office 365 client apps to thwart attacks using Office VBA macros.\nSince then, Redmond has also started\nblocking VBA Office macros\nby default, introduced\nXLM macro protection\n,\ndisabled Excel 4.0 (XLM) macros\n, and began\nblocking untrusted XLL add-ins by default\nacross Microsoft 365 tenants. Microsoft also announced in May 2024 that it would\nkill off VBScript\nby making it an on-demand feature until it is completely removed.\nRelated Articles:\nMicrosoft warns of CPU spikes when typing in classic Outlook\nMicrosoft: New Windows scheduled task will launch Office apps faster\nTycoon2FA phishing kit targets Microsoft 365 with new tricks\nMicrosoft releases emergency update to fix Office 2016 crashes\nMicrosoft: Licensing issue blocks Microsoft 365 Family for some users"
    },
    {
        "Title": "Microsoft: Exchange 2016 and 2019 reach end of support in six months",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-exchange-2016-and-2019-reach-end-of-support-in-six-months/",
        "Summary": "​Microsoft warned that Exchange 2016 and Exchange 2019 will reach the end of support six months from now, on October 14. [...]",
        "Date": "2025-04-15",
        "Content": "​Microsoft warned that Exchange 2016 and Exchange 2019 will reach the end of support six months from now, on October 14.\nThe Exchange Server Engineering Team also shared guidance for admins who need to decommission outdated servers until then, cautioning that Exchange 2016 and Exchange 2019 servers will be exposed to attacks since they'll no longer receive security patches and bug fixes.\n\"Customer installations of Exchange 2016 and Exchange 2019 will of course continue to run after October 14, 2025,\" Microsoft\nsaid\non Monday.\n\"However, continuing to use these offerings after the end-of-support date invites potential security risks, so we strongly recommend taking action now.\"\nThis week's warning comes after Microsoft reminded IT admins\nin January\nthat Exchange Server 2016 and Exchange Server 2019 will no longer receive technical support starting in October.\nIn May 2024, Microsoft also\nsaid\nit would not extend the end-of-life date, offer extended support, or offer Extended Security Updates (ESU) for Exchange 2016 or Exchange 2019.\nExchange 2019 reached\nthe end of mainstream support\non January 9, 2024, while Exchange 2016 reached its\nmainstream support end date\nin October 2020.\nExchange Online or Exchange Server SE migration\nMicrosoft advises Exchange admins to prepare to\nupgrade to Exchange Server Subscription Edition (SE)\nwhen it rolls out later this year or\nmigrate to Exchange Online\n(available as a stand-alone service or as an Office 365 subscription) if they want to retire their own Exchange Server deployment.\nAdmins who want to keep their Exchange servers can\nperform in-place upgrades\nfrom Exchange Server 2019 to Exchange Server SE or a legacy upgrade from Exchange 2016.\n\"If you are running Exchange 2016, we recommend that you perform a legacy (a.k.a. side-by-side) upgrade to Exchange 2019 now and then perform an in-place upgrade to Exchange Server SE once it's released. You do have the option of a legacy upgrade from Exchange 2016 to Exchange Server SE RTM, skipping Exchange 2019 completely,\" Microsoft added this week.\n\"But since there are only a few months between the release of Exchange Server SE and the end of support for Exchange 2016, that might not be enough time, depending on the size of your deployment and other factors (in-place upgrade from Exchange 2016 to Exchange SE will not be available).\"\nMicrosoft provides detailed guidance for global admins on\nMicrosoft 365 migration\nand the\nExchange Online migration path\n.\nRelated Articles:\nMicrosoft: Outdated Exchange servers fail to auto-mitigate security bugs\nMicrosoft: Windows 'inetpub' folder created by security fix, don’t delete\nFortinet: Hackers retain access to patched FortiGate VPNs using symlinks\nIvanti: VPN appliances vulnerable if pushing configs after mitigation\nCritical auth bypass bug in CrushFTP now exploited in attacks"
    },
    {
        "Title": "Google adds Android auto-reboot to block forensic data extractions",
        "Link": "https://www.bleepingcomputer.com/news/security/google-adds-android-auto-reboot-to-block-forensic-data-extractions/",
        "Summary": "Google is rolling out a new security mechanism on Android devices that will automatically reboot locked, unused devices after three consecutive days of inactivity, restoring memory to an encrypted state. [...]",
        "Date": "2025-04-15",
        "Content": "Google is rolling out a new security mechanism on Android devices that will automatically reboot locked, unused devices after three consecutive days of inactivity, restoring memory to an encrypted state.\nAlthough the tech giant has not commented on the exact motives behind the addition of this feature, it is expected to make data extraction by advanced forensic tools harder by bringing devices into a non-exploitable state more often.\nAuto-reboots after 3 days\nThe new auto-reboot feature was listed in the latest Google Play services update (v25.14), under 'Security & Privacy.'\n\"With this feature, your device automatically restarts if locked for 3 consecutive days,\"\nread the release notes\n.\nIn January 2024, the developers behind the privacy-centric GrapheneOS\nwarned\nof firmware flaws in Android that digital forensic companies are leveraging to extract data without the user's authorization.\nWhen an Android phone is first started, it enters a Before First Unlock (BFU) state, where most user data remains encrypted and inaccessible until the device is unlocked for the first time. Once the user unlocks it with their PIN or biometrics, the device enters the After First Unlock (AFU) state, which decrypts the user's data, making it accessible for data extraction or surveillance.\nDevices seized or stolen are typically already in the AFU state, so even if the screen is locked, forensic tools can extract at least some user data from them.\nTo solve this, GrapheneOS for Android devices introduced an auto-reboot mechanism that restarted the system after 18 hours of inactivity, bringing the device back into the \"Before First Unlock\" (BFU) state. This made the data fully encrypted again and unable to be accessed by forensics companies.\nGoogle has now introduced this same feature into Android, though the reboot isn't set to an aggressive 18-hour interval as Graphene. Instead, the device is rebooted after 72 hours of inactivity, with no options to reduce the time.\nHowever, this timeframe should still be good enough to block many attacks involving long-term physical access associated with forensic investigations.\nTo further strengthen physical security, it is recommended to turn off USB data transfer when the device is locked.\nAmnesty International\nuncovered\nearlier this year that Cellebrite tools leveraged USB kernel driver flaws in Android to unlock locked devices that had been confiscated.\nYou can install the latest Google Play services update (v25.14) via the\nGoogle Play store\n. However, the update is rolling out gradually, so it may not be immediately available for everyone.\nImportant security updates for Android devices are also made available through Settings > Security & privacy > System & updates > Google Play system update.\nRelated Articles:\nGoogle fixes Android zero-days exploited in attacks, 60 other flaws\nGoogle fixes Android zero-day exploited by Serbian authorities\nBadBox malware disrupted on 500K infected Android devices\nGoogle expands Android AI scam detection to more Pixel devices\nGoogle fixes two Android zero-days used in targeted attacks"
    },
    {
        "Title": "Microsoft warns of CPU spikes when typing in classic Outlook",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-warns-of-cpu-spikes-when-typing-in-classic-outlook/",
        "Summary": "Microsoft warned Windows users of increased CPU usage when typing while using recent versions of the classic Outlook email client. [...]",
        "Date": "2025-04-15",
        "Content": "Microsoft warned Windows users of increased CPU usage when typing while using recent versions of the classic Outlook email client.\nThe company acknowledged this issue following a wave of user reports on social media and various online platforms since early November, including\nMicrosoft's community website\n. Those affected reported that disabling all spell-check options and add-ins did not resolve the CPU usage issues.\nIn a new support document published this week, Microsoft now revealed that this known issue can impact those in the Current Channel, Monthly Enterprise Channel, or Insider channels updated to Outlook Version 2406 Build 17726.20126 and later.\n\"When you write an email in classic Outlook for Windows, you may notice the CPU spikes up to 30 to 50% at some times and increases the power consumption. You can observe this if Task Manager is open while you type,\"\nthe company said\n.\nWhile Redmond's engineers investigate, the company advises affected Outlook users to switch to the Semi-Annual Channel, unaffected by these CPU spikes, until a solution is available.\nTo do that, one of the options is to add a specific key to the Windows Registry by going through the following steps:\nOpen a Command prompt window (ensure 'Run as administrator\n'\nwas selected).\nPaste the command below and press Enter:\nreg add HKLM\\Software\\Policies\\Microsoft\\office\\16.0\\common\\officeupdate /v updatebranch /t REG_SZ /d SemiAnnual\nAfter you add the registry key, select File > Office Account > Update Options > Update Now to initiate the switch to the Semi-Annual Channel.\nIT admins can also switch channels for devices in their organizations using\nGroup Policies\n, the\nOffice Deployment Tool\n,\nMicrosoft Configuration Manager\n,\nIntune\n, the\nMicrosoft 365 Apps admin center\n, or the\nMicrosoft 365 admin center\n.\nSwitching to the Semi-Annual Channel (\nGabriel Bratton\n)\nLast week, Microsoft also\nreleased emergency Office 2016 updates\nto fix crashes in Word, Excel, and Outlook after installing the April 2025 security updates.\nIn recent months, the company also addressed a slew of other Microsoft 365 and Office issues, including a widespread licensing issue\nblocking access to Microsoft 365 services\nfor some customers with Family subscriptions and a\nbug triggering Outlook crashes\nwhen clicking a button that should've helped users switch back to classic Outlook.\nPreviously, it fixed a known issue that\nbroke Outlook email drag-and-drop\nafter installing recent updates on Windows 24H2 systems and another\nbug that caused Outlook to crash\nwhen writing, replying to, or forwarding emails.\nRelated Articles:\nMicrosoft says button to restore classic Outlook is broken\nMicrosoft fixes Outlook drag-and-drop broken by Windows updates\nMicrosoft fixes button that restores classic Outlook client\nMicrosoft: New Windows scheduled task will launch Office apps faster\nMicrosoft blocks ActiveX by default in Microsoft 365, Office 2024"
    },
    {
        "Title": "Max Severity Bug in Apache Roller Enabled Persistent Access",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/max-severity-bug-apache-roller-persistent-access",
        "Summary": "The remediated flaw gave adversaries a way to maintain access to the app through password resets.",
        "Date": "2025-04-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/max-severity-bug-apache-roller-persistent-access"
    },
    {
        "Title": "With AI's Help, Bad Bots Are Taking Over the Web",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/ai-bad-bots-are-taking-over-web",
        "Summary": "Bad bots are becoming increasingly difficult to detect as they more easily mimic human behaviors and utilize evasion techniques, researchers say.",
        "Date": "2025-04-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/ai-bad-bots-are-taking-over-web"
    },
    {
        "Title": "AI-Powered Presentation Tool Leveraged in Phishing Attacks",
        "Link": "https://www.darkreading.com/threat-intelligence/ai-powered-presentation-tool-leveraged-phishing-attacks",
        "Summary": "Researchers at Abnormal Security said threat actors are using a legitimate presentation and graphic design tool named &quot;Gamma&quot; in phishing attacks.",
        "Date": "2025-04-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/ai-powered-presentation-tool-leveraged-phishing-attacks"
    },
    {
        "Title": "Hertz Falls Victim to Cleo Zero-Day Attacks",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/hertz-falls-victim-cleo-zero-day-attacks",
        "Summary": "Customer data such as birth dates, credit card numbers and driver's license information were stolen when threat actors exploited zero-day vulnerabilities in Cleo-managed file transfer products.",
        "Date": "2025-04-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/hertz-falls-victim-cleo-zero-day-attacks"
    },
    {
        "Title": "Wave of Wine-Inspired Phishing Attacks Targets EU Diplomats",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/wine-inspired-phishing-eu-diplomats",
        "Summary": "Russia-backed APT29's latest campaign once again uses malicious invites to wine-tasting events as its lure, but this time targets a different set of vintages — errr, victims — and delivers a novel backdoor, GrapeLoader.",
        "Date": "2025-04-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/wine-inspired-phishing-eu-diplomats"
    },
    {
        "Title": "China-Backed Threat Actor 'UNC5174' Using Open Source Tools in Stealthy Attacks",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/china-threat-actor-unc5174-open-source-stealthy-attacks",
        "Summary": "Sysdig researchers detailed an ongoing campaign from China-backed threat actor UNC5174, which is using open source hacking tools to stay under the radar.",
        "Date": "2025-04-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/china-threat-actor-unc5174-open-source-stealthy-attacks"
    },
    {
        "Title": "Are We Prioritizing the Wrong Security Metrics?",
        "Link": "https://www.darkreading.com/cyber-risk/are-we-prioritizing-wrong-security-metrics",
        "Summary": "True security isn't about meeting deadlines — it's about mitigating risk in a way that aligns with business objectives while protecting against real-world threats.",
        "Date": "2025-04-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/are-we-prioritizing-wrong-security-metrics"
    },
    {
        "Title": "Trump Revenge Tour Targets Cyber Leaders, Elections",
        "Link": "https://krebsonsecurity.com/2025/04/trump-revenge-tour-targets-cyber-leaders-elections/",
        "Summary": "President Trump last week revoked security clearances for Chris Krebs, the former director of the Cybersecurity and Infrastructure Security Agency (CISA) who was fired by Trump after declaring the 2020 election the most secure in U.S. history. The White House memo, which also suspended clearances for other security professionals at Krebs's employer SentinelOne, comes as CISA is facing huge funding and staffing cuts.",
        "Date": "2025-04-15",
        "Content": "President Trump last week revoked security clearances for Chris Krebs, the former director of the Cybersecurity and Infrastructure Security Agency (CISA) who was fired by Trump after declaring the 2020 election the most secure in U.S. history. The White House memo, which also suspended clearances for other security professionals at Krebs’s employer SentinelOne, comes as CISA is facing huge funding and staffing cuts.\nChris Krebs. Image: Getty Images.\nThe extraordinary April 9 memo directs the attorney general to investigate Chris Krebs (no relation), calling him “a significant bad-faith actor who weaponized and abused his government authority.”\nThe memo said the inquiry will include “a comprehensive evaluation of all of CISA’s activities over the last 6 years and will identify any instances where Krebs’ or CISA’s conduct appears to be contrary to the administration’s commitment to free speech and ending federal censorship, including whether Krebs’ conduct was contrary to suitability standards for federal employees or involved the unauthorized dissemination of classified information.”\nCISA was created in 2018 during Trump’s first term, with Krebs installed as its first director. In 2020, CISA launched Rumor Control, a website that sought to rebut disinformation swirling around the 2020 election.\nThat effort ran directly counter to Trump’s claims that he lost the election because it was somehow hacked and stolen. The Trump campaign and its supporters filed at least 62 lawsuits contesting the election, vote counting, and vote certification in nine states, and nearly all of those cases were dismissed or dropped for lack of evidence or standing.\nWhen the Justice Department began prosecuting people who violently attacked the U.S. Capitol on January 6, 2021, President Trump and Republican leaders shifted the narrative, claiming that Trump lost the election because the previous administration had censored conservative voices on social media.\nIncredibly, the president’s memo seeking to ostracize Krebs stands reality on its head, accusing Krebs of promoting the censorship of election information, “including known risks associated with certain voting practices.” Trump also alleged that Krebs “falsely and baselessly denied that the 2020 election was rigged and stolen, including by inappropriately and categorically dismissing widespread election malfeasance and serious vulnerabilities with voting machines” [emphasis added].\nKrebs did not respond to a request for comment. SentinelOne issued a statement saying it would cooperate in any review of security clearances held by its personnel, which is currently fewer than 10 employees.\nKrebs’s former agency is now facing steep budget and staff reductions. The Record reports that CISA is looking to remove some 1,300 people by cutting about half its full-time staff and another 40% of its contractors.\n“The agency’s National Risk Management Center, which serves as a hub analyzing risks to cyber and critical infrastructure, is expected to see significant cuts, said two sources familiar with the plans,” The Record’s Suzanne Smalley wrote. “Some of the office’s systematic risk responsibilities will potentially be moved to the agency’s Cybersecurity Division, according to one of the sources.”\nCNN reports the Trump administration is also advancing plans to strip civil service protections from 80% of the remaining CISA employees, potentially allowing them to be fired for political reasons.\nThe Electronic Frontier Foundation (EFF) urged professionals in the cybersecurity community to defend Krebs and SentinelOne, noting that other security companies and professionals could be the next victims of Trump’s efforts to politicize cybersecurity.\n“The White House must not be given free reign to turn cybersecurity professionals into political scapegoats,” the EFF wrote. “It is critical that the cybersecurity community now join together to denounce this chilling attack on free speech and rally behind Krebs and SentinelOne rather than cowering because they fear they will be next.”\nHowever, Reuters said it found little sign of industry support for Krebs or SentinelOne, and that many security professionals are concerned about potentially being targeted if they speak out.\n“Reuters contacted 33 of the largest U.S. cybersecurity companies, including tech companies and professional services firms with large cybersecurity practices, and three industry groups, for comment on Trump’s action against SentinelOne,” wrote Raphael Satter and A.J. Vicens. “Only one offered comment on Trump’s action. The rest declined, did not respond or did not answer questions.”\nOn April 3, President Trump fired Gen. Timothy Haugh, the head of the National Security Agency (NSA) and the U.S. Cyber Command, as well as Haugh’s deputy, Wendy Noble. The president did so immediately after meeting in the Oval Office with far-right conspiracy theorist Laura Loomer, who reportedly urged their dismissal. Speaking to reporters on Air Force One after news of the firings broke, Trump questioned Haugh’s loyalty.\nGen. Timothy Haugh. Image: C-SPAN.\nVirginia Senator Mark Warner, the top Democrat on the Senate Intelligence Committee, called it inexplicable that the administration would remove the senior leaders of NSA-CYBERCOM without cause or warning, and risk disrupting critical ongoing intelligence operations.\n“It is astonishing, too, that President Trump would fire the nonpartisan, experienced leader of the National Security Agency while still failing to hold any member of his team accountable for leaking classified information on a commercial messaging app – even as he apparently takes staffing direction on national security from a discredited conspiracy theorist in the Oval Office,” Warner said in a statement.\nOn Feb. 28, The Record’s Martin Matishak cited three sources saying Defense Secretary Pete Hegseth ordered U.S. Cyber Command to stand down from all planning against Russia, including offensive digital actions. The following day, The Guardian reported that analysts at CISA were verbally informed that they were not to follow or report on Russian threats, even though this had previously been a main focus for the agency.\nA follow-up story from The Washington Post cited officials saying Cyber Command had received an order to halt active operations against Russia, but that the pause was intended to last only as long as negotiations with Russia continue.\nThe Department of Defense responded on Twitter/X that Hegseth had “neither canceled nor delayed any cyber operations directed against malicious Russian targets and there has been no stand-down order whatsoever from that priority.”\nBut on March 19, Reuters reported several U.S. national security agencies have halted work on a coordinated effort to counter Russian sabotage, disinformation and cyberattacks.\n“Regular meetings between the National Security Council and European national security officials have gone unscheduled, and the NSC has also stopped formally coordinating efforts across U.S. agencies, including with the FBI, the Department of Homeland Security and the State Department,” Reuters reported, citing current and former officials.\nPresident’s Trump’s institution of 125% tariffs on goods from China has seen Beijing strike back with 84 percent tariffs on U.S. imports. Now, some security experts are warning that the trade war could spill over into a cyber conflict, given China’s successful efforts to burrow into America’s critical infrastructure networks.\nOver the past year, a number of Chinese government-backed digital intrusions have come into focus, including a sprawling espionage campaign involving the compromise of at least nine U.S. telecommunications providers. Dubbed “Salt Typhoon” by Microsoft, these telecom intrusions were pervasive enough that CISA and the FBI in December 2024 warned Americans against communicating sensitive information over phone networks, urging people instead to use encrypted messaging apps (like Signal).\nThe other broad ranging China-backed campaign is known as “Volt Typhoon,” which CISA described as “state-sponsored cyber actors seeking to pre-position themselves on IT networks for disruptive or destructive cyberattacks against U.S. critical infrastructure in the event of a major crisis or conflict with the United States.”\nResponsibility for determining the root causes of the Salt Typhoon security debacle fell to the Cyber Safety Review Board (CSRB), a nonpartisan government entity established in February 2022 with a mandate to investigate the security failures behind major cybersecurity events. But on his first full day back in the White House, President Trump dismissed all 15 CSRB advisory committee members — likely because those advisers included Chris Krebs.\nLast week, Sen. Ron Wyden (D-Ore.) placed a hold on Trump’s nominee to lead CISA, saying the hold would continue unless the agency published a report on the telecom industry hacks, as promised.\n“CISA’s multi-year cover up of the phone companies’ negligent cybersecurity has real consequences,” Wyden said in a statement. “Congress and the American people have a right to read this report.”\nThe Wall Street Journal reported last week Chinese officials acknowledged in a secret December meeting that Beijing was behind the widespread telecom industry compromises.\n“The Chinese official’s remarks at the December meeting were indirect and somewhat ambiguous, but most of the American delegation in the room interpreted it as a tacit admission and a warning to the U.S. about Taiwan,” The Journal’s Dustin Volz wrote, citing a former U.S. official familiar with the meeting.\nMeanwhile, China continues to take advantage of the mass firings of federal workers. On April 9, the National Counterintelligence and Security Center warned (PDF) that Chinese intelligence entities are pursuing an online effort to recruit recently laid-off U.S. employees.\n“Foreign intelligence entities, particularly those in China, are targeting current and former U.S. government (USG) employees for recruitment by posing as consulting firms, corporate headhunters, think tanks, and other entities on social and professional networking sites,” the alert warns. “Their deceptive online job offers, and other virtual approaches, have become more sophisticated in targeting unwitting individuals with USG backgrounds seeking new employment.”\nImage: Dni.gov\nAs Reuters notes, the FBI last month ended an effort to counter interference in U.S. elections by foreign adversaries including Russia, and put on leave staff working on the issue at the Department of Homeland Security.\nMeanwhile, the U.S. Senate is now considering a House-passed bill dubbed the “Safeguard American Voter Eligibility (SAVE) Act,” which would order states to obtain proof of citizenship, such as a passport or a birth certificate, in person from those seeking to register to vote.\nCritics say the SAVE Act could disenfranchise millions of voters and discourage eligible voters from registering to vote. What’s more, documented cases of voter fraud are few and far between, as is voting by non-citizens. Even the conservative Heritage Foundation acknowledges as much: An interactive “election fraud map” published by Heritage lists just 1,576 convictions or findings of voter fraud between 1982 and the present day.\nNevertheless, the GOP-led House passed the SAVE Act with the help of four Democrats. Its passage in the Senate will require support from at least seven Democrats, Newsweek writes.\nIn February, CISA cut roughly 130 employees, including its election security advisors. The agency also was forced to freeze all election security activities pending an internal review. The review was reportedly completed in March, but the Trump administration has said the findings would not be made public, and there is no indication of whether any cybersecurity support has been restored.\nMany state leaders have voiced anxiety over the administration’s cuts to CISA programs that provide assistance and threat intelligence to election security efforts. Iowa Secretary of State Paul Pate last week told the PBS show Iowa Press he would not want to see those programs dissolve.\n“If those (systems) were to go away, it would be pretty serious,” Pate said. “We do count on a lot those cyber protections.”\nPennsylvania’s Secretary of the Commonwealth Al Schmidt recently warned the CISA election security cuts would make elections less secure, and said no state on its own can replace federal election cybersecurity resources.\nThe Pennsylvania Capital-Star reports that several local election offices received bomb threats around the time polls closed on Nov. 5, and that in the week before the election a fake video showing mail-in ballots cast for Trump and Sen. Dave McCormick (R-Pa.) being destroyed and thrown away was linked to a Russian disinformation campaign.\n“CISA was able to quickly identify not only that it was fraudulent, but also the source of it, so that we could share with our counties and we could share with the public so confidence in the election wasn’t undermined,” Schmidt said.\nAccording to CNN, the administration’s actions have deeply alarmed state officials, who warn the next round of national elections will be seriously imperiled by the cuts. A bipartisan association representing 46 secretaries of state, and several individual top state election officials, have pressed the White House about how critical functions of protecting election security will perform going forward. However, CNN reports they have yet to receive clear answers.\nNevada and 18 other states are suing Trump over an executive order he issued on March 25 that asserts the executive branch has broad authority over state election procedures.\n“None of the president’s powers allow him to change the rules of elections,” Nevada Secretary of State Cisco Aguilar wrote in an April 11 op-ed. “That is an intentional feature of our Constitution, which the Framers built in to ensure election integrity. Despite that, Trump is seeking to upend the voter registration process; impose arbitrary deadlines on vote counting; allow an unelected and unaccountable billionaire to invade state voter rolls; and withhold congressionally approved funding for election security.”\nThe order instructs the U.S. Election Assistance Commission to abruptly amend the voluntary federal guidelines for voting machines without going through the processes mandated by federal law. And it calls for allowing the administrator of the so-called Department of Government Efficiency (DOGE), along with DHS, to review state voter registration lists and other records to identify non-citizens.\nThe Atlantic’s Paul Rosenzweig notes that the chief executive of the country — whose unilateral authority the Founding Fathers most feared — has literally no role in the federal election system.\n“Trump’s executive order on elections ignores that design entirely,” Rosenzweig wrote. “He is asserting an executive-branch role in governing the mechanics of a federal election that has never before been claimed by a president. The legal theory undergirding this assertion — that the president’s authority to enforce federal law enables him to control state election activity — is as capacious as it is frightening.”\n\r\n         This entry was posted on Monday 14th of April 2025 11:27 PM \r\n         \nChilling. This is frightening news.\nThanks for gathering and sharing this information, Brian.\nAnd people say Trump is joking about wanting a third term, just like he was “joking” about shipping “home grown” people to El Salvadorian prisons earlier today…\nThis is getting more serious by the day, and we’re less than three months in.\nHuge CISA fan. Not a huge fan of the politicization of the department. It is true that good work was done by CISA while Chris Krebs was at the helm. It is also true that he was playing politics when he stated “2020 election was most secure in US history”. \nIf my boss wanted a security audit and I snapped back “This is the most secure system in the history of this organization.” It would be a very unprofessional response and illogical because it doesn’t account for the constant state of change in systems and security. The professional conversation would be around what systems, structures and components are in place to ensure the prescribed levels of security. This is the first thing Chris Krebs did wrong, he was playing defense for political purposes not being a critical professional.\nYep, I totally agree with you, quite disappointing…\nYou both surely analyzed all previous elections to discount the expert’s factually undisputed claim, then.  Good for you.\n“It is also true that he was playing politics when he stated “2020 election was most secure in US history”\nIf, you mean, stating facts that are equivocally true can sometimes be construed as “political” when a political figure has lied without evidence in stating the opposite hundreds if not thousands of times…  then sure, but then it’s also “political” to say that the US Presidency is limited to 2 terms by the 12th Amendment to the Constitution, ratified in 1804.  Three coequal branches of government – political, can’t say it.  \nI read you loud and clear, comrade.  We must not say what we all know is true.  It is verboten.\nNo one asked for a security audit: the election was “stolen” and corrupt in 2020 because he lost. Notice he didn’t say the same thing about this past year, or 2016, although he certainly prepped for it just the same. He even referred to the same thing as far back as 2012 with Romney on his social media accounts. The only one who made it political was Trump, he determined that there’s no way he could lose because he’s infallible, and any dissent is unacceptable.\nIt would be more like if a CISO pre-determined a security incident was caused by a rogue insider threat taking over the domain controller, with no evidence or mechanisms to support it, and when asked had no functional mechanisms to explain why he thought that way (see all the cases brought before judges in 2020). Imagine asking for evidence, checking the logs, and coming back and saying it’s as secure as it’s ever been and suffering personal consequences with your former boss going after your job and filing false police reports for disagreeing with the chain of command.\nThat’s what’s going on, don’t try to spin it as anything else.\nCan’t disagree with that. At least he’s got one thing – the investigation of his doings that may exonerate him from the accusations, even if his response to them could have been better.\n‘capricious’, not ‘capacious’. bloody spellcheck…\nI left the U.S. two years ago but I can’t stop being amazed at how much damage is being done to the system. Sure, it may take years to remove all those loyalists that Trump inserted into various government positions and to amend the constitution to prevent free rein by any future populist supported by idiot voters. \nBut the most damage in my view was done to the reputation of the U.S. government. A few years back I was seriously considering getting a job of the security researcher with the U.S. government. It didn’t work out back then but now I’m so thankful that it didn’t. I honestly dodged the bullet of being fired by an unelected druggie, foreign billionaire that bought his way into the White House and was then gutting the government that was impeding his business practices. Or even worse, being afraid for my job every 4 years when imbeciles in the US elect another Russian asset. I don’t think this damage can ever be undone. Ever.\nQuestioning Dear Leader will lead to consequences from Him or his cult-like followers.\nExcellent. We need investigations into every aspect of the so-called “deep state”; fed employees (at least within the Executive Branch disobeying direct orders from the Chief Executive and going rogue. In some cases, management specifically ordering the rank and file to ignore those orders.\nAs a retired Fed with 40 years in service, this was shocking to me to hear. I’m retired now but these are all changed within the past 10 years. Previously, if you thought an order was “illegal” or against regs, you mentioned it to the boss and went to legal if that didn’t make a difference (on sufficiently concerning issues). You didn’t disregard things out-of-hand.\nDon’t know about you, friend, but this Fed with 40 years service swore an oath to support and defend the Constitution, not the fever dreams of some tin horn, wanna-be dictator.\nThe only Deep State that’s ever existed in governments, republics, and empires throughout the course of human history is the loyalists to an emperor, king, or dictator. Crushing dissent on an increasing basis and unquestionable loyalty to a dictator are fundamental tenets of Stalinism and Nazism, among hundreds of other states formed throughout our wonderful human history that have killed billions. If you think that way, just own up to it instead of creating a boogeyman trying to justify your hateful intentions.\nHard to read adjectives like ‘surprising’, ‘shocking’, and ‘astonishing’ in the industry responses without wondering how any of this can be a surprise to anyone who has been paying attention to Trump’s statements both during and after the 2024 campaign.. That’s the astonishing part\nThanks for the very enlightening article.  Very scary.  Everyone should read this.\nWe are going down a slippery slope that Americans are not ready for. Fromm Covfefe-in-chief deporting people lawfully in America with no intent to get them back, and the threat of even deporting American citizens to El Salvador. Now the punishment and retaliation for just doing their job is what the Cheeto-in-charge wants to happen and things are going to get a whole lot worse before they get better.\nPlease keep these articles going.  Truth must speak to power.  Donald hates the truth because it destroys his narrative.\nChris Krebs should be honored by the cybersecurity community because he spoke the truth in the face of a lot of pressure to do otherwise.  History has proven Chris correct.  Donald and his minions lost over 60 election lawsuits in 2020 and he is still trying to lie his way to a different story. His approach now is to attack those who spoke the truth.\n.  Brian, I have read your articles for quite a while.\nThis one is unexpectedly political.  Please stop. You have a lot more different and unique content to offer.\nIf I wanted to steep myself in the political discord du jour, I could dip my toes in Twitter.\nThis is what you get when you have a president that makes everything a loyalty test and everything political. Cybersecurity has for a long time been one of the most bipartisan issues in Congress. Or, at least it was until Trump lost in 2020. Then in his mind security became synonymous with accountability. which ofc he hates.\nThanks for reading. I hope you actually read it before dismissing it as political. Anyway, now is not the time to tune out.\nCyberSecurity is not political, the is no TCP flag for party affiliation, the injection of politics into CS is done by PEOPLE (from both sides of the aisle tbh). Just cut the crap already, everyone, on this front, please, for the love of all that is good in this world (what’s left of it anyway).\nEat a bag of dicks. Republicans are politicizing all institutions of the federal government. Don’t cry about journalists writing about the hostile takeover by screaming “politics, waaaahhhh” when you choose to put your head in the sand.\nI have criticized Brian a couple of times for some overtly political takes that really didn’t add anything to the facts but this article has none of that sort of content whatsoever. This is a statement of facts and facts that we should be made aware of because of how dangerous some (all?) of this activity is. There is no political slant to this article unless you think that anything that dares speak negatively of the president’s actions is “political”. That’s not how it works if what the article states is true. This one rings true. At this point, you should probably ask yourself why Trump being Trump is a good enough reason for you to accept everything he does regardless of the potential (and realized) negative impact it may have. That’s not a good place for your brain to be.\nThis was the obvious conclusion to expect when you vote for a textbook fascist as your representative. Meanwhile, all of my coworkers in infosec that voted for this are as ignorant as ever without the slightest clue about the ramifications of their vote for authoritarianism. \nAmerica is getting exactly what it collectively voted for. Buckle up, MAGAts. YOU voted for this.\nI think we have crossed a line here where articles like these are clearly not political opinions. Facts are facts, even when denied by someone who is accused of serious abuse of power. Its hard to read multiple stories about the illegal activities this president has supported and not be convinced that we have a massive problem here and our elected officials and/or any cabinet members with a minimum sense of responsibility need to take action. Back when Bell Labs created a telecommunications system that was hardened against outside threats, it was unheard of that a foreign agency could compromise virtually every company now in business. This defense of our adversaries is treason; period.\nThank you again Mr Krebs for getting this information out.\nYou are a hack Krebs … a tired hack!\nThank you Brian for illustrating why you remain one of the most valued and trusted cybersecurity reporters for IT professionals.   I appreciate your judgment in topics and focus here.  It’s refreshing to see good technology journalism that courageously tells some of the bigger story than just the bits and bytes.\nDear Brian Krebs, thank you for your worthwhile work. \n It amuses me greatly that the comments here\nare turning more vicious, in direct proportion to the accuracy of the articles.  I am a generalist and not\nan IT guy, but as the belligerent, bellicose insults and veiled insinuations continue, it may be useful to\nadd a rating system where we can upvote or downvote a comment. (not that it will discourage them)\nAnd it is not a time to stay silent.  There are plenty of good Americans now speaking out, all over the country.\n     I have to believe the idiots are outnumbered by the good voices. \nBut I also think part of the strategy of the sock-puppets is the same agenda of any soul-less bully;\ndistract, disrupt, flood the zone, deflect, and fake outrage, the whole panoply of evil techniques.\nIf one ever had a course in classical logic, logical fallacies, and rhetoric, it is pretty transparent.\nFortunately , your regular and loyal readers are also pretty savvy.\nI often wonder how despicable people live with themselves, but then I remember: they are soul-less\nhollow people.  Some of them may even be on a payroll.  To quote T. Jefferson, “Eternal vigilance is\nthe price of liberty.”  Keep up the good work, Brian, and everyone else, talk to your friends, stay engaged.\nGuv’ment workers you cannot say that 2+2=4 when Trump says it’s 5, that’s contrary to suitability standards.\n4chan hacked today but Krebs is soyjaking over Trump. How the mighty have fallen.\nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "MITRE Warns CVE Program Faces Disruption Amid US Funding Uncertainty",
        "Link": "https://www.securityweek.com/mitre-signals-potential-cve-program-deterioration-as-us-gov-funding-expires/",
        "Summary": "<p>MITRE warns of a deterioration of national vulnerability databases and advisories, slowed vendor reaction and limited response operations.</p>\n<p>The post <a href=\"https://www.securityweek.com/mitre-signals-potential-cve-program-deterioration-as-us-gov-funding-expires/\">MITRE Warns CVE Program Faces Disruption Amid US Funding Uncertainty</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/mitre-signals-potential-cve-program-deterioration-as-us-gov-funding-expires/"
    },
    {
        "Title": "Virtue AI Attracts $30M Investment to Address Critical AI Deployment Risks",
        "Link": "https://www.securityweek.com/virtue-ai-attracts-30m-investment-to-address-critical-ai-deployment-risks/",
        "Summary": "<p>San Francisco startup banks $30 million in Seed and Series A funding led by Lightspeed Venture Partners and Walden Catalyst Ventures.</p>\n<p>The post <a href=\"https://www.securityweek.com/virtue-ai-attracts-30m-investment-to-address-critical-ai-deployment-risks/\">Virtue AI Attracts $30M Investment to Address Critical AI Deployment Risks</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/virtue-ai-attracts-30m-investment-to-address-critical-ai-deployment-risks/"
    },
    {
        "Title": "Insurance Firm Lemonade Says API Glitch Exposed Some Driver’s License Numbers",
        "Link": "https://www.securityweek.com/insurance-firm-lemonade-says-api-glitch-exposed-some-drivers-license-numbers/",
        "Summary": "<p>Lemonade says the incident is not material and that its operations were not compromised, nor was its customer data targeted.</p>\n<p>The post <a href=\"https://www.securityweek.com/insurance-firm-lemonade-says-api-glitch-exposed-some-drivers-license-numbers/\">Insurance Firm Lemonade Says API Glitch Exposed Some Driver’s License Numbers</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/insurance-firm-lemonade-says-api-glitch-exposed-some-drivers-license-numbers/"
    },
    {
        "Title": "Kidney Dialysis Services Provider DaVita Hit by Ransomware",
        "Link": "https://www.securityweek.com/kidney-dialysis-services-provider-davita-hit-by-ransomware/",
        "Summary": "<p>DaVita has not named the ransomware group behind the incident or share details on the attacker’s ransom demands.</p>\n<p>The post <a href=\"https://www.securityweek.com/kidney-dialysis-services-provider-davita-hit-by-ransomware/\">Kidney Dialysis Services Provider DaVita Hit by Ransomware</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/kidney-dialysis-services-provider-davita-hit-by-ransomware/"
    },
    {
        "Title": "Conduent Says Names, Social Security Numbers Stolen in Cyberattack",
        "Link": "https://www.securityweek.com/conduent-says-names-social-security-numbers-stolen-in-cyberattack/",
        "Summary": "<p>The business services provider confirms personal information such as names and Social Security numbers was stolen in a January cyberattack.</p>\n<p>The post <a href=\"https://www.securityweek.com/conduent-says-names-social-security-numbers-stolen-in-cyberattack/\">Conduent Says Names, Social Security Numbers Stolen in Cyberattack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/conduent-says-names-social-security-numbers-stolen-in-cyberattack/"
    },
    {
        "Title": "2.6 Million Impacted by Landmark Admin, Young Consulting Data Breaches",
        "Link": "https://www.securityweek.com/2-6-million-impacted-by-landmark-admin-young-consulting-data-breaches/",
        "Summary": "<p>In fresh filings, Landmark Admin and Young Consulting say data breaches back in 2024 impacted more people than initially estimated.</p>\n<p>The post <a href=\"https://www.securityweek.com/2-6-million-impacted-by-landmark-admin-young-consulting-data-breaches/\">2.6 Million Impacted by Landmark Admin, Young Consulting Data Breaches</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/2-6-million-impacted-by-landmark-admin-young-consulting-data-breaches/"
    },
    {
        "Title": "China Pursuing 3 Alleged US Operatives Over Cyberattacks During Asian Games",
        "Link": "https://www.securityweek.com/china-pursuing-3-alleged-us-operatives-over-cyberattacks-during-asian-games/",
        "Summary": "<p>China accuses three alleged U.S. NSA operatives of cyberattacks targeting critical infrastructure and the Asian Games in Harbin. </p>\n<p>The post <a href=\"https://www.securityweek.com/china-pursuing-3-alleged-us-operatives-over-cyberattacks-during-asian-games/\">China Pursuing 3 Alleged US Operatives Over Cyberattacks During Asian Games</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/china-pursuing-3-alleged-us-operatives-over-cyberattacks-during-asian-games/"
    },
    {
        "Title": "Blockchain, Quantum, and IoT Firms Unite to Secure Satellite Communications Against Quantum Threats",
        "Link": "https://www.securityweek.com/blockchain-quantum-and-iot-firms-unite-to-secure-satellite-communications-against-quantum-threats/",
        "Summary": "<p>Partisia, Squareroot8, and NuSpace join forces in a global partnership to advance quantum-safe communications. </p>\n<p>The post <a href=\"https://www.securityweek.com/blockchain-quantum-and-iot-firms-unite-to-secure-satellite-communications-against-quantum-threats/\">Blockchain, Quantum, and IoT Firms Unite to Secure Satellite Communications Against Quantum Threats</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/blockchain-quantum-and-iot-firms-unite-to-secure-satellite-communications-against-quantum-threats/"
    },
    {
        "Title": "NetRise Raises $10 Million to Grow Software Supply Chain Security Platform",
        "Link": "https://www.securityweek.com/netrise-raises-10-million-to-grow-software-supply-chain-security-platform/",
        "Summary": "<p>The funding round brings the total amount raised by the NetRise to roughly $25 million.</p>\n<p>The post <a href=\"https://www.securityweek.com/netrise-raises-10-million-to-grow-software-supply-chain-security-platform/\">NetRise Raises $10 Million to Grow Software Supply Chain Security Platform</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/netrise-raises-10-million-to-grow-software-supply-chain-security-platform/"
    },
    {
        "Title": "Hertz Discloses Data Breach Linked to Cleo Hack",
        "Link": "https://www.securityweek.com/hertz-discloses-data-breach-linked-to-cleo-hack/",
        "Summary": "<p>Customers of the Hertz, Thrifty, and Dollar brands had their personal information stolen as a result of the Cleo hack last year.</p>\n<p>The post <a href=\"https://www.securityweek.com/hertz-discloses-data-breach-linked-to-cleo-hack/\">Hertz Discloses Data Breach Linked to Cleo Hack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/hertz-discloses-data-breach-linked-to-cleo-hack/"
    }
]