[
    {
        "Title": "Experts Uncover Four New Privilege Escalation Flaws in Windows Task Scheduler",
        "Link": "https://thehackernews.com/2025/04/experts-uncover-four-new-privilege.html",
        "Summary": "Cybersecurity researchers have detailed four different vulnerabilities in a core component of the Windows task scheduling service that could be exploited by local attackers to achieve privilege escalation and erase logs to cover up evidence of malicious activities.\nThe issues have been uncovered in a binary named \"schtasks.exe,\" which enables an administrator to create, delete, query, change,",
        "Date": "2025-04-16",
        "Content": "Cybersecurity researchers have detailed four different vulnerabilities in a core component of the Windows\ntask scheduling service\nthat could be exploited by local attackers to achieve privilege escalation and erase logs to cover up evidence of malicious activities.\nThe issues have been uncovered in a binary named \"\nschtasks.exe\n,\" which enables an administrator to create, delete, query, change, run, and end scheduled tasks on a local or remote computer.\n\"A [User Account Control] bypass vulnerability has been found in Microsoft Windows, enabling attackers to bypass the User Account Control prompt, allowing them to execute high-privilege (SYSTEM) commands without user approval,\" Cymulate security researcher Ruben Enkaoua\nsaid\nin a report shared with The Hacker News.\n\"By exploiting this weakness, attackers can elevate their privileges and run malicious payloads with Administrators' rights, leading to unauthorized access, data theft, or further system compromise.\"\nThe problem, the cybersecurity company said, occurs when an attacker creates a scheduled task\nusing Batch Logon\n(i.e., a password) as opposed to an Interactive Token, causing the task scheduler service to grant the running process the maximum allowed rights.\nHowever, for this attack to work, it hinges on the threat actor acquiring the password through some other means, such as cracking an NTLMv2 hash after authenticating against an SMB server or exploiting flaws such as\nCVE-2023-21726\n.\nA net result of this issue is that a low-privileged user can leverage the schtasks.exe binary and impersonate a member of groups such as Administrators, Backup Operators, and Performance Log Users with a known password to obtain the maximum allowed privileges.\nThe registration of a scheduled task using a Batch Logon authentication method with an XML file can also pave the way for two defense evasion techniques that make it possible to overwrite\nTask Event Log\n, effectively erasing audit trails of prior activity, as well as overflow Security Logs.\nSpecifically, this involves registering a task with an\nauthor\nwith the name, say, where the letter A is repeated 3,500 times, in the XML file, causing the entire XML task log description to be overwritten. This behavior could then be extended further to overwrite the whole \"C:\\Windows\\System32\\winevt\\logs\\\nSecurity.evtx\n\" database.\n\"The Task Scheduler is a very interesting component. Accessible by anyone willing to create a task, initiated by a SYSTEM running service, juggling between the privileges, the process integrities and user impersonations,\" Enkaoua said.\n\"The first reported vulnerability is not only a UAC Bypass. It is far more than that: it is essentially a way to impersonate any user with its password from CLI and to obtain the maximum granted privileges on the task execution session, with the /ru and /rp flags.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Google Blocked 5.1B Harmful Ads and Suspended 39.2M Advertiser Accounts in 2024",
        "Link": "https://thehackernews.com/2025/04/google-blocked-51b-harmful-ads-and.html",
        "Summary": "Google on Wednesday revealed that it suspended over 39.2 million advertiser accounts in 2024, with a majority of them identified and blocked by its systems before it could serve harmful ads to users.\nIn all, the tech giant said it stopped 5.1 billion bad ads, restricted 9.1 billion ads, and blocked or restricted ads on 1.3 billion pages last year. It also suspended over 5 million accounts for",
        "Date": "2025-04-16",
        "Content": "Google on Wednesday\nrevealed\nthat it suspended over 39.2 million advertiser accounts in 2024, with a majority of them identified and blocked by its systems before it could serve harmful ads to users.\nIn all, the tech giant said it stopped 5.1 billion bad ads, restricted 9.1 billion ads, and blocked or restricted ads on 1.3 billion pages last year. It also suspended over 5 million accounts for scam-related violations.\nThe top six ad policy violations included ad network abuse (793.1 million), trademark misuse (503.1 million), personalized ads (491.3 million), legal requirements (280.3 million), financial services (193.7 million), and misrepresentation (146.9 million), among others.\nMost of the pages on which its ads were blocked or restricted include sexual content, dangerous or derogatory content, malware, shocking content, weapons promotion and sales, online gambling, tobacco, alcohol sale or misuse, intellectual property abuse, and sexually explicit content.\nGoogle said it has been using artificial intelligence (AI) powered tools to quickly flag emerging threats and abuse patterns, using signals like business impersonation and illegitimate payment details as early indicators to tackle ad fraud.\n\"For instance, we tackled AI-generated deepfakes used in public figure impersonation scams, suspending over 700,000 accounts for this specific violation as part of our broader effort that blocked/removed 415 million ads and suspended over 5 million accounts for scam-related violations,\" the company said in a statement shared with The Hacker News.\nGoogle also said it expanded\nAdvertiser identity verification\nto more than 200 countries and territories to increase transparency and enforce requirements for AI-generated content in election ads. As a result, more than 8,900 new election advertisers were verified and over 10.7 million election ads from unverified accounts were removed in 2024.\nGoogle's ongoing efforts towards ads safety come as\nmalvertising\ncontinues to be an\nimportant\ninitial access vector for\nmalware\n, with threat actors abusing fraudulent ads on Google Search (and other search engines) to drive users to phony sites.\n\"The ad safety landscape is constantly changing, reshaped by technological breakthroughs like advancements in AI, emerging abuse tactics, and global events, demanding continuous agility from our industry,\" it said.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Gamma AI Platform Abused in Phishing Chain to Spoof Microsoft SharePoint Logins",
        "Link": "https://thehackernews.com/2025/04/ai-powered-gamma-used-to-host-microsoft.html",
        "Summary": "Threat actors are leveraging an artificial intelligence (AI) powered presentation platform named Gamma in phishing attacks to direct unsuspecting users to spoofed Microsoft login pages.\n\"Attackers weaponize Gamma, a relatively new AI-based presentation tool, to deliver a link to a fraudulent Microsoft SharePoint login portal,\" Abnormal Security researchers Callie Hinman Baron and Piotr Wojtyla",
        "Date": "2025-04-16",
        "Content": "Threat actors are leveraging an artificial intelligence (AI) powered presentation platform named\nGamma\nin phishing attacks to direct unsuspecting users to spoofed Microsoft login pages.\n\"Attackers weaponize Gamma, a relatively new AI-based presentation tool, to deliver a link to a fraudulent Microsoft SharePoint login portal,\" Abnormal Security researchers Callie Hinman Baron and Piotr Wojtyla\nsaid\nin a Tuesday analysis.\nThe attack chain commences with a phishing email, in some cases sent from legitimate, compromised email accounts, to entice message recipients into opening an embedded PDF document.\nIn reality, the PDF attachment is nothing but a hyperlink that, when clicked, redirects the victim to a presentation hosted on Gamma that prompts them to click on a button to \"Review Secure Documents.\"\nDoing so takes the user to an intermediate page that impersonates Microsoft and instructs them to complete a Cloudflare Turnstile verification step before accessing the supposed document. This CAPTCHA barrier serves to increase the legitimacy of the attack, as well as prevent automated URL analysis by security tools.\nTargets are then taken to a phishing page that masquerades as a Microsoft SharePoint sign-in portal and aims to collect their credentials.\n\"If mismatched credentials are provided, it triggers an 'Incorrect password' error, which indicates the perpetrators are using some sort of\nadversary-in-the-middle\n(\nAiTM\n) for validating credentials in real time,\" the researchers noted.\nThe findings are part of an ongoing trend of phishing attacks that exploit legitimate services to stage malicious content and bypass email authentication checks like SPF, DKIM, and DMARC, a technique called living-off-trusted-sites (\nLOTS\n).\n\"This clever, multi-stage attack shows how today's threat actors are taking advantage of the blind spots created by lesser-known tools to sidestep detection, deceive unsuspecting recipients, and compromise accounts,\" the researchers said.\n\"Rather than linking directly to a credential-harvesting page, the attackers route the user through several intermediary steps: first to the Gamma-hosted presentation, then to a splash page protected by a Cloudflare Turnstile, and finally to a spoofed Microsoft login page. This multi-stage redirection hides the true destination and makes it difficult for static link analysis tools to trace the attack path.\"\nThe disclosure comes as Microsoft, in its\nlatest Cyber Signals report\n, warned of an increase in AI-driven fraud attacks to generate believable content for attacks at scale using deepfakes, voice cloning, phishing emails, authentic-looking fake websites, and bogus job listings.\n\"AI tools can scan and scrape the web for company information, helping attackers build detailed profiles of employees or other targets to create highly convincing social engineering lures,\" the company said.\n\"In some cases, bad actors are luring victims into increasingly complex fraud schemes using fake AI-enhanced product reviews and AI-generated storefronts, where scammers create entire websites and e-commerce brands, complete with fake business histories and customer testimonials.\"\nMicrosoft also said it has taken action against attacks orchestrated by\nStorm-1811\n(aka STAC5777), which has abused Microsoft Quick Assist software by posing as IT support through voice phishing schemes conducted via Teams and convincing victims to grant them remote device access for subsequent ransomware deployment.\nThat said, there is evidence to suggest that the cybercrime group behind the Teams vishing campaign may be shifting tactics. According to a new report from ReliaQuest, the attackers have been observed employing a previously unreported persistence method using\nTypeLib COM hijacking\nand a new PowerShell backdoor to evade detection and maintain access to compromised systems.\nThe threat actor is said to have been developing versions of the PowerShell malware since January 2025, deploying early iterations via malicious Bing advertisements. The activity, detected two months later, targeted customers in the finance and professional, scientific, and technical services sectors, specifically focusing on executive-level employees with female-sounding names.\nThe changes in the later stages of the attack cycle have raised the possibility that Storm-1811 is either evolving with new methods or it's the work of a splinter group, or that an entirely different threat actor has adopted the same initial access techniques that were exclusive to it.\n\"The phishing chats were carefully timed, landing between 2:00 p.m. and 3:00 p.m., perfectly synced to the recipient organizations' local time and coinciding with an afternoon slump in which employees may be less alert in spotting malicious activity,\" ReliaQuest\nsaid\n.\n\"Whether or not this Microsoft Teams phishing campaign was run by Black Basta, it's clear that phishing through Microsoft Teams isn't going anywhere. Attackers keep finding clever ways to bypass defenses and stay inside organizations.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "From Third-Party Vendors to U.S. Tariffs: The New Cyber Risks Facing Supply Chains",
        "Link": "https://thehackernews.com/2025/04/from-third-party-vendors-to-us-tariffs.html",
        "Summary": "Introduction\nCyber threats targeting supply chains have become a growing concern for businesses across industries. As companies continue to expand their reliance on third-party vendors, cloud-based services, and global logistics networks, cybercriminals are exploiting vulnerabilities within these interconnected systems to launch attacks. By first infiltrating a third-party vendor with undetected",
        "Date": "2025-04-16",
        "Content": "Introduction\nCyber threats targeting supply chains have become a growing concern for businesses across industries. As companies continue to expand their reliance on third-party vendors, cloud-based services, and global logistics networks, cybercriminals are exploiting vulnerabilities within these interconnected systems to launch attacks. By first infiltrating a third-party vendor with undetected security gaps, attackers can establish a foothold, leveraging these weaknesses to penetrate the primary business partners' network. From there, they move laterally through critical systems, ultimately gaining access to sensitive data, financial assets, intellectual property, or even operational controls.\nRecent high-profile breaches like the 2024 ransomware attack that hit Change Healthcare, one of the world's largest health payment processing companies, demonstrate how attackers disrupted supply chain operations stealing up to 6TB of millions of patients' protected health information (PHI). This incident was one of the most disruptive cyberattacks on U.S. critical infrastructure to date and could have been prevented with simple multifactor authentication (MFA) on the targeted remote server.\n1\nUnlike traditional cyber threats that target a single organization, supply chain attacks exploit the weakest links within a business ecosystem. As businesses work to mitigate risks, it is important to understand the emerging threat landscape, the industries most at risk, and the security strategies necessary to secure supply chains. Additionally, as the U.S. implements new tariffs on foreign goods, businesses must assess whether these trade policies will introduce new cybersecurity challenges or alleviate some existing risks.\nEmerging Threats Affecting Supply Chains\nRansomware Attacks:\nRansomware has evolved into one of the most damaging cyber threats to supply chains. Attackers increasingly target logistics providers, manufacturers, and critical suppliers, encrypting their systems and demanding hefty ransoms to restore operations. In 2024 CDK Global, a software provider for nearly 15,000 North American car dealerships, was hit by a ransomware attack. The malware targeted personally identifiable information (PII) such as Social Security numbers, bank account details, and credit card data. Dealerships were forced to revert to manual operations for days if not weeks thereafter, including using pen and paper and physically transporting auto records to Department of Motor Vehicles (DMV) offices in the U.S. The attack resulted in significant operational disruptions and financial losses estimated at over $1 billion.1\nSoftware Supply Chain Attacks:\nCybercriminals have shifted their focus to compromising software vendors, and injecting malicious code into trusted applications and updates. In April 2024, hackers uploaded malicious Visual Studio projects to GitHub, manipulating search algorithms to increase visibility. These projects contained malware resembling Keyzetsu Clipper, designed to intercept and alter cryptocurrency wallet addresses copied to the clipboard, redirecting funds to attackers.2\nThird-Party Credential Theft:\nAttackers often gain access to corporate networks by exploiting weak authentication measures used by third-party vendors. Phishing attacks, credential stuffing, and password leaks provide hackers with a pathway to infiltrate multiple organizations through a single compromised vendor. Weak vendor security practices can allow unauthorized access to critical systems, leading to data theft and operational disruptions.\nAI-Powered Cyber Attacks:\nArtificial Intelligence has become a double-edged sword in cybersecurity. While businesses use AI for threat detection and defense, cybercriminals leverage AI to automate phishing campaigns, bypass security controls, and identify vulnerabilities within supply chain networks. AI-driven attacks make it easier for hackers to evade detection, increasing the frequency and sophistication of supply chain cyber threats.\nIoT and OT Exploits:\nSupply chain operations heavily rely on Internet of Things (IoT) and Operational Technology (OT) devices, such as smart sensors, automated manufacturing equipment, medical devices, and connected logistics systems. However, many IoT and OT devices lack robust security measures, making them attractive targets for hackers. Cybercriminals exploit vulnerabilities in these devices to launch distributed denial-of-service (DDoS) attacks, manipulate production processes, or gain access to enterprise networks.\nIndustries Most Impacted and Why\nManufacturing & Industrial\nManufacturers depend on global supply chains for raw materials, hardware components, and logistics. Cyberattacks targeting industrial control systems (ICS) and enterprise resources planning (ERP) software can halt production, delay shipments, and lead to financial losses. Additionally, intellectual property theft poses a significant risk in this sector, as hackers target sensitive trade secrets.\nHealthcare & Pharmaceuticals\nThe healthcare industry relies heavily on third-party suppliers, wholesale distribution centers, R&D, lab equipment and chemical suppliers, hospitals and clinics, government buyers, and more. Healthcare, and specifically pharmaceutical companies, must manage one of the largest industry supply chains filled with 10s if not 100s of vendors. A breach within the healthcare supply chain can be devastating and compromise patient data, disrupt hospital operations, and even impact the development and/or distribution of critical medicines. This was no more evident than the 2020 attack on the COVID-19 vaccine supply chain that highlighted the vulnerabilities in this sector.\nRetail & E-Commerce\nRetailers and e-commerce businesses depend on logistics providers, payment processors, and digital marketing platforms, all of which introduce third-party cyber risks. Cybercriminals frequently target online checkout systems, warehouse automation tools, and supplier databases to steal payment information and personal customer data.\nEnergy & Critical Infrastructure\nPower grids, fuel pipelines, transportation, and water treatment facilities depend on complex supply chains involving multiple vendors and contractors. A cyberattack on a single supplier can disrupt entire sectors, as seen in the March 2025 cyberattack targeting Ukraine's state-owned railway company, Ukrzaliznytsia, disrupting both passenger and freight transport services.\n3\nBanking & Financial Services\nSince Open Banking first exploded, banks and financial institutions work with numerous third-party service providers to access consumer banking data through APIs. It was introduced to foster competition and innovation and enhance customer control over financial data. Open Banking started in response to regulatory initiatives like the PSD2 (Revised Payment Services Directive) in the EU and CMA's Open Banking regulations in the UK, aiming to break the monopoly of traditional banks, encourage fintech growth, and improve financial transparency and services. A supply chain breach in this sector can expose sensitive financial data, disrupt banking operations, and lead to large-scale fraud.\nProactive Security Strategies for Supply Chain Protection\nAs global networks expand, businesses must go beyond securing their own environments to account for the risks posed by third-party vendors. The shift has forced organizations to move from reactive incident response toward proactive security strategies that anticipate, detect, and neutralize threats before they can cause disruption. As a result, cybersecurity is no longer just about responding to attacks – it's about predicting and preventing them to strengthen supply chain resilience and ensure business continuity. Here are a few security strategies that are proving effective.\nContinuous Threat Exposure Management (CTEM)\nOrganizations should proactively identify, validate, prioritize, and mitigate security gaps in their supply chains using\nCTEM\nframeworks. These approaches continuously analyze attack vectors, ensuring rapid response to emerging threats.\nContinuous Penetration Testing & External Attack Surface Management (EASM)\nAutomated pentesting can provide continuous testing of vendor systems to help uncover vulnerabilities before cybercriminals do. Attack Surface Management (ASM) tools enable businesses to map and monitor all external-facing assets, reducing the risk of unknown exposures.\nRegulatory Compliance & Standards\nCompanies should align their security strategies with industry regulations such as NIST's Cybersecurity Framework, the Cybersecurity and Infrastructure Security Agency (CISA) guidelines, and ISO 27001 standards. Compliance with these frameworks ensures a baseline of security practices within supply chains.\nAI-Driven Threat Detection\nLeveraging artificial intelligence for real-time threat detection and anomaly analysis can help businesses identify vulnerabilities within the supply chain that normally would not be discovered. AI-powered security tools analyze large volumes of supply chain data to detect suspicious activities and predict potential attacks.\nImpact of U.S. Tariffs on Cybersecurity in Supply Chains\nU.S. tariffs on imported technology, hardware, raw materials, and software, for example, have implications well beyond economics – they also affect the security and resilience of critical infrastructure. As costs rise, businesses may seek alternative suppliers, potentially exposing themselves to greater security risks. These shifts in sourcing can introduce new vendors with varying security standards, increasing the likelihood of supply chain attacks.\nIncrease Costs & Vendor Shifts:\nNew tariffs on foreign goods may force businesses to change suppliers. Vendors from different regions may have weak security protocols, requiring additional vetting and security assessments.\nReshoring & Nearshoring Trends:\nTo reduce reliance on foreign suppliers, many U.S. companies are reshoring (bringing production back to the U.S.) or nearshoring (moving operations closer to the U.S.). While this shift may reduce risks associated with foreign supply chain attacks, it may also introduce new cyber threats related to domestic infrastructure security.\nRegulatory & Compliance Burdens:\nNew trade policies could require companies to comply with additional cybersecurity regulations when sourcing from certain regions. This may lead to increased costs for security compliance and risk assessments.\nPotential Risk in Cyber Espionage:\nGeopolitical tensions arising from tariff policies could drive more state-sponsored cyberattacks on U.S. companies. Businesses must remain vigilant against espionage attempts targeting trade secrets and supply chain data.\nConclusion\nA secure\nsupply chain\nis not just about protecting assets – it's about maintaining trust, resilience, and operational stability. As cyber threats grow in sophistication and supply chain dependencies increase, organizations that take a proactive security stance will be better positioned to mitigate risk and sustain long-term growth. Now, more than ever, is the time to evaluate vendor relationships, strengthen defenses, and embed security into every state of the supply chain lifecycle. The future belongs to those who anticipate threats, not just react to them.\nReferences:\nProWriters. (2024).\nWhat 2024 supply chain attacks can you show your clients.\nProWriters Cyber Insurance Blog. Retrieved from\nhttps://prowritersins.com/cyber-insurance-blog/supply-chain-cyber-attacks-in-review/?utm_source=chatgpt.com\nKaspersky. (2024).\nThe biggest supply chain attacks in 2024: Malicious Visual Studio projects spread malware on GitHub.\nKaspersky Official Blog. Retrieved from\nhttps://me-en.kaspersky.com/blog/malicious-code-in-github/23858/\nReuters. (2025, March 27).\nUkraine railways says online services partially restored after cyber attack.\nReuters. Retrieved from:\nhttps://www.reuters.com/technology/cybersecurity/ukraine-state-railway-says-online-services-partially-restored-after-cyber-attack-2025-03-27/\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "New BPFDoor Controller Enables Stealthy Lateral Movement in Linux Server Attacks",
        "Link": "https://thehackernews.com/2025/04/new-bpfdoor-controller-enables-stealthy.html",
        "Summary": "Cybersecurity researchers have unearthed a new controller component associated with a known backdoor called BPFDoor as part of cyber attacks targeting telecommunications, finance, and retail sectors in South Korea, Hong Kong, Myanmar, Malaysia, and Egypt in 2024.\n\"The controller could open a reverse shell,\" Trend Micro researcher Fernando Mercês said in a technical report published earlier in",
        "Date": "2025-04-16",
        "Content": "Cybersecurity researchers have unearthed a new controller component associated with a known backdoor called\nBPFDoor\nas part of cyber attacks targeting telecommunications, finance, and retail sectors in South Korea, Hong Kong, Myanmar, Malaysia, and Egypt in 2024.\n\"The controller could open a reverse shell,\" Trend Micro researcher Fernando Mercês\nsaid\nin a technical report published earlier in the week. \"This could allow lateral movement, enabling attackers to enter deeper into compromised networks, allowing them to control more systems or gain access to sensitive data.\nThe campaign has been attributed with medium confidence to a threat group it tracks as Earth Bluecrow, which is also known as DecisiveArchitect, Red Dev 18, and Red Menshen. The lower confidence level boils down to the fact that the BPFDoor malware source code was\nleaked in 2022\n, meaning it could also have bee adopted by other hacking groups.\nBPFDoor is a Linux backdoor that\nfirst came to light\nin 2022, with the malware positioned as a long-term espionage tool for use in attacks targeting entities in Asia and the Middle East at least a year prior to public disclosure.\nThe most distinctive aspect of the malware is that it creates a persistent-yet-covert channel for threat actors to control compromised workstations and access sensitive data over extended periods of time.\nThe malware gets its name from the use of Berkeley Packet Filter (\nBPF\n), a technology that allows programs to attach network filters to an open socket in order to inspect incoming network packets and monitor for a specific Magic Byte sequence so as to spring into action.\n\"Because of how BPF is implemented in the targeted operating system, the magic packet triggers the backdoor despite being blocked by a firewall,\" Mercês said. \"As the packet reaches the kernel's BPF engine, it activates the resident backdoor. While these features are common in rootkits, they are not typically found in backdoors.\"\nThe latest analysis from Trend Micro has found that the targeted Linux servers have also been infected by a previously undocumented malware controller that's used to access other affected hosts in the same network after lateral movement.\n\"Before sending one of the 'magic packets' checked by the BPF filter inserted by BPFDoor malware, the controller asks its user for a password that will also be checked on the BPFDoor side,\" Mercês explained.\nIn the next step, the controller directs the compromised machine to perform one of the below actions based on the password provided and the command-line options used -\nOpen a reverse shell\nRedirect new connections to a shell on a specific port, or\nConfirm the backdoor is active\nIt's worth pointing out that the password sent by the controller must match one of the hard-coded values in the BPFDoor sample. The controller, besides supporting TCP, UDP, and ICMP protocols to commandeer the infected hosts, can also enable an optional encrypted mode for secure communication.\nFurthermore, the controller supports what's called a direct mode that enables the attackers to directly connect to an infected machine and obtain a shell for remote access – but only when provided the right password.\n\"BPF opens a new window of unexplored possibilities for malware authors to exploit,\" Mercês said. \"As threat researchers, it is a must to be equipped for future developments by analyzing BPF code, which will help protect organizations against BPF-powered threats.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Product Walkthrough: A Look Inside Wing Security's Layered SaaS Identity Defense",
        "Link": "https://thehackernews.com/2025/04/product-walkthrough-look-inside-wing.html",
        "Summary": "Intro: Why hack in when you can log in?\nSaaS applications are the backbone of modern organizations, powering productivity and operational efficiency. But every new app introduces critical security risks through app integrations and multiple users, creating easy access points for threat actors. As a result, SaaS breaches have increased, and according to a May 2024 XM Cyber report, identity and",
        "Date": "2025-04-16",
        "Content": "Intro: Why hack in when you can log in?\nSaaS applications are the backbone of modern organizations, powering productivity and operational efficiency. But every new app introduces critical security risks through app integrations and multiple users, creating easy access points for threat actors. As a result, SaaS breaches have increased, and according to a May 2024 XM Cyber report, identity and credential misconfigurations caused\n80% of security exposures.\nSubtle signs of a compromise get lost in the noise, and then multi-stage attacks unfold undetected due to siloed solutions. Think of an account takeover in Entra ID, then privilege escalation in GitHub, along with data exfiltration from Slack. Each seems unrelated when viewed in isolation, but in a connected timeline of events, it's a dangerous breach.\nWing Security's SaaS platform\nis a multi-layered solution that combines posture management with real-time identity threat detection and response. This allows organizations to get a true identity map of their SaaS ecosystem, detect and respond rapidly to threats, and prevent future attacks.\nGetting started with SaaS visibility and coverage\nYou can't protect what you don't know. The majority of existing solutions (IAM, PAM, IAM, etc.) do not cover SaaS applications or lack the depth needed to detect SaaS threats. This is why the first step is to overcome shadow IT and get complete visibility into the organization's stack, including all apps, accounts, and all the hidden third-party integrations that security teams have no clue about.\nWing's discovery approach is non-intrusive, without agents or proxies. It simply connects through APIs to major IdPs (like Okta, Google Workspace, and Azure AD) and to business-critical SaaS applications (from Microsoft 365 and Salesforce to Slack, GitHub, etc).\nWing discovers:\nHuman (users) and non-human (service accounts, API keys, etc.) identities.\nApp-to-app connectivity and third-party integrations and their permission scopes.\nAI-powered applications and data usage.\nMFA status, admins in the different SaaS applications (including stale admins)\nVisibility alone isn't enough. Understanding identity behavior in SaaS apps is key to detecting and responding to real threats in time. That's where Wing's identity-centric threat detection layer comes in.\nWant to see Wing in action?\nRequest a demo\nwith one of our security experts.\nSaaS Identity Threat Detection\n—\nFrom scattered logs to a clear attack story\nWing maps identity events and IoCs to represent how attackers think. It then correlates them with MITRE ATT&CK techniques to transform long and messy SaaS logs into one clear attack story - simplifying investigations, reducing alert fatigue, and speeding up median time to resolution (MTTR).\nEvery detection is enriched with threat intelligence for context: IP reputation (geolocation and privacy), VPN/Tor usage, and more. So, instead of digging through raw logs for days, analysts can understand the attacker's playbook in a few minutes.\nA real-life example of how hackers try to exploit identities:\nStep 1 - Password spray attempt:\nA password spray attack targeting multiple user accounts within the Entra ID environment. The attacker attempted to log in using credential-based attacks to compromise one or more user accounts without triggering lockout mechanisms.\nStep 2 - Cross-account user agent overlap:\nLogin attempts across multiple accounts from the same user agent (UA) confirmed that the attacker was systematically testing credentials at scale during the reconnaissance phase.\nStep 3 - Successful login post-reconnaissance:\nThe attacker successfully logged in to an account. This login matched the same user agent used during the reconnaissance phase, indicating that credentials were compromised via the earlier password spraying activity.\nStep 4 - Privilege escalation via role assignment:\nThe attacker escalated the compromised account's privileges by assigning it administrative roles in Entrad ID. This granted the attacker broader visibility and control, including access to OAuth-connected third-party services like GitHub.\nStep 5 - Data exfiltration from GitHub:\nWith elevated privileges, the attacker leveraged the Entra ID account's linked GitHub access to infiltrate internal repositories. Activity logs indicate that private repositories were downloaded, including projects that may contain source code, API keys, or internal documentation. The attacker used this foothold to exfiltrate sensitive intellectual property directly from GitHub.\nAttack path timeline\nThe threat timeline (Ref. Image #2) is more useful than logs alone, as it presents all SaaS detections with context. Each detection has a detailed context on the affected identity, the trigger, and where and when it occurred (app, timestamp, geolocation).\nThe attack path timeline helps security operations teams:\nVisualize how the attack unfolded with a chronological view of related detections.\nMap each detection to MITRE ATT&CK techniques, like active scanning, valid accounts, account manipulation, etc.\nEnrich the alert with context and IoCs, IPs, user agents, geolocation, VPN/Tor, and evidence.\nConnect anomalies with routine activity (e.g., permission changes after a successful brute force).\nPrioritize threats\nNot all security threats are created equal. Every threat is assigned a breach confidence score, quantifying the likelihood that a threat will result in a successful breach. This metric is calculated based on factors such as:\nThe type of detections (i.e., password spray, spike in activity, etc.)\nThe number of detections per threat (i.e., one identity has 4 detections)\nThe tactic of the attack based on MITRE ATT&CK (i.e., initial access, exfiltration, etc.)\nSecOps can sort and focus on the most critical threats first. For example, a single failed login from a new IP might be low priority when viewed on its own, but a successful login followed by data exfiltration would get a higher confidence score. In the dashboard, you can see a prioritized threat queue, with high-severity threats at the top that deserve immediate attention and lower-risk ones further down, cutting through alert fatigue and providing real threat detection.\nWant to see Wing in action?\nRequest a demo\nwith one of our security experts.\nTrack threat status & progress\nWing's tracking structure helps SecOps stay organized and avoid threats slipping through the cracks. Teams can update statuses and track every threat from creation to resolution.\nMain functionalities:\nFlag threats for follow-up for efficient prioritization or for monitoring specific cases.\nFlag threats to trigger a webhook event so they'll appear in external systems like SIEM or SOAR and not be overlooked.\nUpdate threat status based on the investigations conducted by the SOC and IR teams.\nResolve fast with concise mitigation guides\nWhen SecOps drill down into a specific threat, they get a customized mitigation playbook with steps tailored to the specific attack type and SaaS application. The mitigation guides include:\nTailored recommendations for each detection type\nRelevant documentation (e.g., how to configure Okta policies)\nBest practices for addressing root cause and preventing recurrence (posture)\nPrevention: Checking for the root cause\nAfter the threat has been stopped, you'll need to ask yourself what facilitated this threat to succeed and how can you make sure it won't happen again.\nSecurity teams should check if these events are related to underlying risk factors in the organization's SaaS configurations, so they aren't just treating the symptoms (the active breach) but are addressing the root cause.\nThis is possible because Wing's platform is layered, combining SaaS security posture management (SSPM) with identity threat detection capabilities. Wing continuously monitors for misconfigurations (based on CISA's SCuBA framework), pinpointing those risky settings – like accounts without MFA or admin tokens that never expire​.\nWrap-up: Closing the security loop\nWing Security brings clarity to SaaS chaos through a multi-layered security platform that combines deep visibility, prioritized risk management, and real-time detection. By combining posture management (SSPM) and identity threat detection and response (ITDR), organizations can reduce risk exposure, respond to threats with context, and stay ahead of SaaS identity-based attacks.\nBook a demo with Wing\nto find blind spots, catch threats early, and fix what puts your business at risk.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Chinese Android Phones Shipped with Fake WhatsApp, Telegram Apps Targeting Crypto Users",
        "Link": "https://thehackernews.com/2025/04/chinese-android-phones-shipped-with.html",
        "Summary": "Cheap Android smartphones manufactured by Chinese companies have been observed pre-installed with trojanized apps masquerading as WhatsApp and Telegram that contain cryptocurrency clipper functionality as part of a campaign since June 2024.\nWhile using malware-laced apps to steal financial information is not a new phenomenon, the new findings from Russian antivirus vendor Doctor Web point to",
        "Date": "2025-04-16",
        "Content": "Cheap Android smartphones manufactured by Chinese companies have been observed pre-installed with trojanized apps masquerading as WhatsApp and Telegram that contain cryptocurrency\nclipper functionality\nas part of a campaign since June 2024.\nWhile using malware-laced apps to steal financial information is not a new phenomenon, the new findings from Russian antivirus vendor Doctor Web point to significant escalation where threat actors directly\ntargeting the supply chain\nof various Chinese manufacturers to preload brand new devices with malicious apps.\n\"Fraudulent applications were detected directly in the software pre-installed on the phone,\" the company\nsaid\n. \"In this case, the malicious code was added to the WhatsApp messenger.\"\nA majority of the compromised devices are said to be low-end phones that mimic well-known premium models from Samsung and Huawei with names like S23 Ultra, S24 Ultra, Note 13 Pro, and P70 Ultra. At least four of the affected models are manufactured under the\nSHOWJI\nbrand.\nThe attackers are said to have used an application to spoof the technical specification displayed on the About Device page, as well as hardware and software information utilities like AIDA64 and CPU-Z, giving users a false impression that the phones are running Android 14 and have improved hardware.\nThe malicious Android apps are created using an open-source project called\nLSPatch\nthat allows the trojan, dubbed Shibai, to be injected into otherwise legitimate software. In total, about 40 different applications, like messengers and QR code scanners, are estimated to have been modified in this manner.\nIn the artifacts analyzed by Doctor Web, the application hijacks the app update process to retrieve an APK file from a server under the attacker's control and searches for strings in chat conversations that match cryptocurrency wallet address patterns associated with Ethereum or Tron. If found, they are replaced with the adversary's addresses to reroute transactions.\n\"In the case of an outgoing message, the compromised device displays the correct address of the victim's own wallet, while the recipient of the message is shown the address of the fraudsters' wallet,\" Doctor Web said.\n\"And when an incoming message is received, the sender sees the address of their own wallet; meanwhile, on the victim's device, the incoming address is replaced with the address of the hackers' wallet.\"\nBesides changing the wallet addresses, the malware is also fitted with capabilities to harvest device information, all WhatsApp messages, and .jpg, .png, and .jpeg images from DCIM, Pictures, Alarms, Downloads, Documents, and Screenshots folders to the attacker's server.\nThe intention behind this step is to scan the stored images for wallet recovery (aka mnemonic) phrases, allowing the threat actors to gain unauthorized access to victims' wallets and drain the assets.\nIt's not clear who is behind the campaign, although the attackers have been found to leverage about 30 domains to distribute the malicious applications and employ more than 60 command-and-control (C2) servers to manage the operation.\nFurther analysis of the nearly two dozen cryptocurrency wallets used by the threat actors has revealed that they have received more than $1.6 million over the last two years, indicating that the supply chain compromise has paid off in a big way.\nThe development comes as Swiss cybersecurity company PRODAFT uncovered a new Android malware family dubbed Gorilla that's designed to collect sensitive information (e.g., device model, phone numbers, Android version, SIM card details, and installed apps), main persistent access to infected devices, and receive commands from a remote server.\n\"Written in Kotlin, it primarily focuses on SMS interception and persistent communication with its command-and-control (C2) server,\" the company\nsaid\nin an analysis. \"Unlike many advanced malware strains, Gorilla does not yet employ obfuscation techniques, indicating that it may still be under active development.\"\nIn recent months, Android apps embedding the\nFakeApp\ntrojan\npropagated via Google Play Store have also been\nfound\nmaking use of a DNS server to retrieve a configuration that contains a URL to be loaded.\nThese apps, since removed from the marketplace, impersonate well-known and popular games and apps and come fitted with the ability to receive external commands that can perform various malicious actions like loading unwanted websites or serving phishing windows.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "U.S. Govt. Funding for MITRE's CVE Ends April 16, Cybersecurity Community on Alert",
        "Link": "https://thehackernews.com/2025/04/us-govt-funding-for-mitres-cve-ends.html",
        "Summary": "The U.S. government funding for non-profit research giant MITRE to operate and maintain its Common Vulnerabilities and Exposures (CVE) program will expire Wednesday, an unprecedented development that could shake up one of the foundational pillars of the global cybersecurity ecosystem.\nThe 25-year-old CVE program is a valuable tool for vulnerability management, offering a de facto standard to",
        "Date": "2025-04-16",
        "Content": "The U.S. government funding for non-profit research giant MITRE to operate and maintain its Common Vulnerabilities and Exposures (\nCVE\n) program will expire Wednesday, an unprecedented development that could shake up one of the foundational pillars of the global cybersecurity ecosystem.\nThe 25-year-old CVE program is a valuable tool for vulnerability management, offering a de facto standard to identify, define, and catalog publicly disclosed security flaws using CVE IDs. The program has listed over 274,000 CVE records to date.\nYosry Barsoum, MITRE's vice president and director of the Center for Securing the Homeland (CSH), said its funding to \"develop, operate, and modernize CVE and related programs, such as the Common Weakness Enumeration (\nCWE\n), will expire.\"\n\"If a break in service were to occur, we anticipate multiple impacts to CVE, including deterioration of national vulnerability databases and advisories, tool vendors, incident response operations, and all manner of critical infrastructure,\" Barsoum\nnoted\nin a letter sent to CVE Board Members.\nHowever, Barsoum pointed out that the government continues to \"make considerable efforts\" to support MITRE's role in the program and that MITRE remains committed to CVE as a global resource.\nThe CVE program was launched in September 1999 and has been run by MITRE with sponsorship from the U.S. Department of Homeland Security (DHS) and the Cybersecurity and Infrastructure Security Agency (CISA).\nIn response to the move, cybersecurity firm VulnCheck, which is a CVE Numbering Authority (CNA), has\nannounced\nthat it is proactively reserving 1,000 CVEs for 2025 to help fill the void.\n\"A service break would likely degrade national vulnerability databases and advisories,\" Jason Soroko, Senior Fellow at Sectigo, said in a statement shared with The Hacker News.\n\"This lapse could negatively affect tool vendors, incident response operations, and critical infrastructure broadly. MITRE emphasizes its continued commitment but warns of these potential impacts if the contracting pathway is not maintained.\"\nTim Peck, Senior Threat Researcher at Securonix, told The Hacker News that a lapse could have massive consequences for the cybersecurity ecosystem where CNAs and defenders may be unable to obtain or publish CVEs, causing delays in vulnerability disclosures.\n\"Additionally, the Common Weakness Enumeration (CWE) project is vital for software weakness classification and prioritization,\" Peck said. \"Its halt would affect secure coding practices and risk assessments. The CVE program is a foundational infrastructure. It's not just a nice to have 'referenceable list,' it's a primary resource for vulnerability coordination, prioritization and response efforts across the private sector, government and open source.\"\nUPDATE — CISA Extends CVE Program Contract Amid Funding Crisis\nCISA has stepped in to extend funding to ensure the continuity of the CVE program, the agency said.\n\"The CVE Program is invaluable to the cyber community and a priority of CISA,\" it said in a statement. \"Last night, CISA executed the option period on the contract to ensure there will be no lapse in critical CVE services. We appreciate our partners' and stakeholders' patience.\"\nThe development comes as a group of CVE Board members announced the launch of the CVE Foundation, a non-profit organization set up to secure the CVE program's independence.\n\"The formation of the CVE Foundation marks a major step toward eliminating a single point of failure in the vulnerability management ecosystem and ensuring the CVE Program remains a globally trusted, community-driven initiative,\" the CVE Foundation\nsaid\n.\n\"For the international cybersecurity community, this move represents an opportunity to establish governance that reflects the global nature of today's threat landscape.\"\nCoinciding with the news of the CVE shutdown, the European Union Agency for Cybersecurity (ENISA) has also launched a European vulnerability database (\nEUVD\n), which \"embraces a multi-stakeholder approach by collecting publicly available vulnerability information from multiple sources.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Over 16,000 Fortinet devices compromised with symlink backdoor",
        "Link": "https://www.bleepingcomputer.com/news/security/over-16-000-fortinet-devices-compromised-with-symlink-backdoor/",
        "Summary": "Over 16,000 internet-exposed Fortinet devices have been detected as compromised with a new symlink backdoor that allows read-only access to sensitive files on previously compromised devices. [...]",
        "Date": "2025-04-16",
        "Content": "Over 16,000 internet-exposed Fortinet devices have been detected as compromised with a new symlink backdoor that allows read-only access to sensitive files on previously compromised devices.\nThis exposure is being reported by threat monitoring platform The Shadowserver Foundation, which initially reported 14,000 devices were exposed.\nToday, Shadowserver's Piotr Kijewski told BleepingComputer that the cybersecurity organization now detects\n16,620 devices\nimpacted by the recently revealed persistence mechanism.\nLast week, Fortinet warned customers that they had\ndiscovered a new persistence mechanism\nused by a threat actor to retain read-only remote access to files in the root filesystem of previously compromised but now patched FortiGate devices.\nFortinet said that this was not through the exploitation of new vulnerabilities but is instead linked to attacks starting in 2023 and continuing into 2024, where a threat actor utilized zero days to compromise FortiOS devices.\nOnce they gained access to the devices, they created symbolic links in the language files folder to the root file system on devices with SSL-VPN enabled. As the language files are publicly accessible on FortiGate devices with SSL-VPN enabled, the threat actor could browse to that folder and gain persistent read access to the root file system, even after the initial vulnerabilities were patched.\n\"A threat actor used a known vulnerability to implement read-only access to vulnerable FortiGate devices. This was achieved via creating a symbolic link connecting the user filesystem and the root filesystem in a folder used to serve language files for the SSL-VPN. This modification took place in the user filesystem and avoided detection,\"\nFortinet said\n.\n\"Therefore, even if the customer device was updated with FortiOS versions that addressed the original vulnerabilities, this symbolic link may have been left behind, allowing the threat actor to maintain read-only access to files on the device's file system, which may include configurations.\"\nThis month, Fortinet began notifying customers privately by email about FortiGate devices detected by FortiGuard as being compromised with this symlink backdoor.\nEmails sent to owners of compromised devices\nSource: BleepingComputer\nFortinet has released an updated AV/IPS signature that will detect and remove this malicious symbolic link from compromised devices. The latest version of the firmware has also been updated to detect and remove the link. The update also prevents unknown files and folders from being served by the built-in webserver.\nFinally, if a device was detected as compromised, it is possible that the threat actors had access to the latest configuration files, including credentials.\nTherefore, all credentials should be reset, and admins should follow the other steps in\nthis guide\n.\nRelated Articles:\nFortinet: Hackers retain access to patched FortiGate VPNs using symlinks\nCritical FortiSwitch flaw lets hackers change admin passwords remotely\nNew SuperBlack ransomware exploits Fortinet auth bypass flaws\nWinRAR flaw bypasses Windows Mark of the Web security alerts\nCisco warns of CSLU backdoor admin account used in attacks"
    },
    {
        "Title": "Google blocked over 5 billion ads in 2024 amid rise in AI-powered scams",
        "Link": "https://www.bleepingcomputer.com/news/google/google-blocked-over-5-billion-ads-in-2024-amid-rise-in-ai-powered-scams/",
        "Summary": "Google blocked 5.1 billion ads and suspended more than 39.2 million advertiser accounts in 2024, according to its 2024 Ads Safety Report released this week. [...]",
        "Date": "2025-04-16",
        "Content": "Google blocked 5.1 billion ads and suspended more than 39.2 million advertiser accounts in 2024, according to its 2024 Ads Safety Report released this week.\nThe company says the increasing enforcement activity is caused by the growing threat of AI-generated content, impersonation scams, and abuse of its ad platform.\nIn particular, Google highlighted the use of generative AI tools to create deepfake video impersonations of celebrities and public figures to promote scams, which in the BleepingComputer experience are commonly investment and cryptocurrency scams.\nAs a result, Google says it permanently suspended over 700,000 advertiser accounts for policy violations related to AI-driven impersonation scams.\n\"To fight back, we quickly assembled a dedicated team of over 100 experts to analyze these scams and develop effective countermeasures, such as updating our Misrepresentation policy to suspend advertisers that promote these scams,\" explains\nGoogle's 2024 Ads Safety Report\n.\n\"As a result, we were able to permanently suspend over 700,000 offending advertiser accounts. This led to a 90% drop in reports of this kind of scam ad last year. While we are encouraged by this progress, we continue to work to prevent these scams.\"\nWhile AI may be driving increased scams and malicious advertisements, Google also credits it for helping identify and enforce its policies on publisher pages.\nIn 2024, the company added over 50 enhancements to its machine-learning models to help detect new threats before users could report them.\nIn addition to advertiser suspensions, Google removed or blocked ads across numerous categories:\n193.7 million for financial services\n146 million for gambling and game-related\n122.5 million for adult content\n104.8 million for healthcare\nThe company also enforced its ad policies against publishers, issuing\npolicy violations\nagainst 1.3 billion web pages and 220,000 publisher sites.\nElection-related advertising also saw an increase in 2024, with the company verifying 8,900 new election advertisers and removing 10.7 million election ads from unverified accounts\nRelated Articles:\nGoogle takes on Cursor with Firebase Studio, its AI builder for vibe coding\nSix arrested for AI-powered investment scams that stole $20 million\nGoogle expands Android AI scam detection to more Pixel devices\nMicrosoft names cybercriminals behind AI deepfake network\nGoogle begins unifying search country domains to Google.com"
    },
    {
        "Title": "Apple fixes two zero-days exploited in targeted iPhone attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/apple-fixes-two-zero-days-exploited-in-targeted-iphone-attacks/",
        "Summary": "Apple released emergency security updates to patch two zero-day vulnerabilities that were used in an \"extremely sophisticated attack\" against specific targets' iPhones. [...]",
        "Date": "2025-04-16",
        "Content": "Apple released emergency security updates to patch two zero-day vulnerabilities that were used in an \"extremely sophisticated attack\" against specific targets' iPhones.\nThe two vulnerabilities are in CoreAudio (CVE-2025-31200) and RPAC (CVE-2025-31201), with both bugs impacting iOS, macOS, tvOS, iPadOS, and visionOS.\n\"Apple is aware of a report that this issue may have been exploited in an extremely sophisticated attack against specific targeted individuals on iOS,\" reads an\nApple security bulletin\nreleased today.\nThe CVE-2025-31200 flaw in CoreAudio was discovered by Apple and the Google Threat Analysis team. It can be exploited by processing an audio stream in a maliciously crafted media file to execute remote code on the device.\nThe company also fixed CVE-2025-31201, which Apple discovered. It is a bug in RPAC that allows attackers with read or write access to bypass Pointer Authentication (PAC), an iOS security feature that helps protect against memory vulnerabilities.\nApple has not shared further details on how the flaws were exploited in attacks. BleepingComputer contacted Apple and Google with questions about flaws but has not received a response.\nBoth vulnerabilities were fixed in\niOS 18.4.1\n,\niPadOS 18.4.1\n,\ntvOS 18.4.1\n,\nmacOS Sequoia 15.4.1\n, and\nvisionOS 2.4.1\n.\nThe list of devices impacted by these zero-days is extensive, impacting older and newer models:\niPhone XS and later\niPad Pro 13-inch, iPad Pro 13.9-inch 3rd generation and later, iPad Pro 11-inch 1st generation and later, iPad Air 3rd generation and later, iPad 7th generation and later, and iPad mini 5th generation and later\nmacOS Sequoia\nApple TV HD and Apple TV 4K (all models)\nApple Vision Pro\nEven though these zero-day flaws were exploited in highly targeted attacks, users are still strongly advised to install them as soon as possible.\nWith these vulnerabilities, Apple has fixed five zero-days since the start of the year, the\nfirst in January\n(CVE-2025-24085),\nthe second in February\n(CVE-2025-24200), and\nthe third in March\n(CVE-2025-24201).\nRelated Articles:\nApple fixes WebKit zero-day exploited in ‘extremely sophisticated’ attacks\nApple backports zero-day patches to older iPhones and Macs\nIvanti Connect Secure zero-days exploited to deploy custom malware\nVerizon Call Filter API flaw exposed customers' incoming call history\nGoogle fixes Chrome zero-day exploited in espionage campaign"
    },
    {
        "Title": "Google begins unifying search country domains to Google.com",
        "Link": "https://www.bleepingcomputer.com/news/google/google-begins-unifying-search-country-domains-to-googlecom/",
        "Summary": "Google has announced that it's retiring separate country code top-level domain names like google.co.uk or google.com.br and redirecting users to Google.com. [...]",
        "Date": "2025-04-16",
        "Content": "Google has\nannounced\nthat it's retiring separate country code top-level domain names for search, like google.co.uk or google.com.br, and unifying them under Google.com.\nPreviously, Google used to have separate country-code domains (like google.ng or google.com.br) so people could get results that were more relevant to their local area.\nOver time, however, Google improved how it figures out where someone is searching from.\nIn 2017,\nGoogle made a change\nto its search engine that allows it to show results specifically optimized for your location.\nFor example, if you are looking for the best PC parts store on Google.com and are based in the United Kingdom, you'll see results for UK-based local businesses only.\n\"Because of this improvement, country-level domains are no longer necessary. So we’ll begin redirecting traffic from these ccTLDs to google.com to streamline people’s experience on Search,\" Google noted in a\nblog post\n.\n\"This change will be rolled out gradually over the coming months, and you may be prompted to re-enter some of your Search preferences in the process.\"\nHowever, the experience may not be ideal all of the time, as you might see irrelevant results from other countries even when you are expecting localized answers.\nAs\nspotted\nby digital marketer Lily Ray, Google's AI Overviews, which summarizes internet content, struggles to show relevant location-based results.\nIn the above example, Google AI Overviews is showing results from the United Kingdom as well when the searcher is from the United States.\nThis doesn't happen when you use the regular Google search, but the AI results will likely get better at understanding localized queries and websites.\nRelated Articles:\nGoogle blocked over 5 billion ads in 2024 amid rise in AI-powered scams\nGoogle adds Android auto-reboot to block forensic data extractions\nGoogle's AI video generator Veo 2 is rolling out on AI Studio\nGoogle takes on Cursor with Firebase Studio, its AI builder for vibe coding\nGoogle fixes Android zero-days exploited in attacks, 60 other flaws"
    },
    {
        "Title": "Jira Down: Atlassian users experiencing degraded performance",
        "Link": "https://www.bleepingcomputer.com/news/security/jira-down-atlassian-users-experiencing-degraded-performance/",
        "Summary": "Atlassian users are experiencing degraded performance amid an 'active incident' affecting multiple Jira products since morning hours today. Jira, Jira Service Management, Jira Work Management and Jira Product Discovery are among the impacted products. [...]",
        "Date": "2025-04-16",
        "Content": "Atlassian users are experiencing degraded performance amid an 'active incident' affecting multiple Jira products since morning hours today.\nJira, Jira Service Management, Jira Work Management and Jira Product Discovery are among the impacted products.\nJira is a popular project management and issue tracking software solution used by workplaces to plan, track and manage workflows, specifically among Agile software development teams.\nHours-long outage, broken widgets and UI\nA prolonged Atlassian outage is impacting users worldwide, with multiple Jira products experiencing degraded performance.\nAccording to Atlassian, the degraded performance issues began today, as early as 06:59 UTC (2:59 a.m Eastern time).\nUsers are seeing error messages and experiencing troubles loading Jira user interface (UI) and dashboards.\nJira seen throwing errors today\n(BleepingComputer)\nWidgets are also timing out or failing to render altogether:\nWidgets failing to load or experiencing timeouts\n(BleepingComputer)\n\"We are aware of users experiencing issues attempting to load Jira Dashboard widgets. Our team is investigating this issue with urgency,\" says an Atlassian\nstatus update\n, pertaining to Dashboard widgets in Jira.\nSimilar status updates have been issued for Atlassian offerings like\nJira Service Management\n,\nJira Work Management\n, and\nJira Product Discovery\n.\nUpdate, 1:19 p.m. ET:\nAtlassian has identified the root cause around 12:48 p.m ET and is working on a resolution:\n\"We continue to work on resolving the issue with loading certain Jira Dashboard widgets for Jira Work Management, Jira Service Management, and Jira Product Discovery. We have identified the root cause and expect recovery shortly. We will provide another update at 19:00 UTC.\"\nThis is a developing story...\nRelated Articles:\nMicrosoft: Licensing issue blocks Microsoft 365 Family for some users\nMicrosoft investigates global Exchange Admin Center outage\nChatGPT is down worldwide with something went wrong error\nUK fines software provider £3.07 million for 2022 ransomware breach\nCloudflare R2 service outage caused by password rotation error"
    },
    {
        "Title": "41% of Attacks Bypass Defenses: Adversarial Exposure Validation Fixes That",
        "Link": "https://www.bleepingcomputer.com/news/security/41-percent-of-attacks-bypass-defenses-adversarial-exposure-validation-fixes-that/",
        "Summary": "Your dashboards say you're secure—but 41% of threats still get through. Picus Security's Adversarial Exposure Validation uncovers what your stack is missing with continuous attack simulations and automated pentesting. [...]",
        "Date": "2025-04-16",
        "Content": "Your security tools say everything’s fine, but attackers still get through.\nDespite years of investment in firewalls, endpoint protection, SIEMs, and other layered defenses, most organizations still face a disturbing truth: according to\nrecent research\nby Picus Security, only\n59% of threats are stopped by their security controls\n.\nThat means\n41% of attacks successfully bypass defenses\n. And the real damage often starts where visibility ends.\n40% of enterprise environments have attack paths that lead to domain administrator compromise\n, hidden routes that attackers could exploit right now.\nEven worse, these blind spots often go unnoticed until it's too late. Traditional indicators like zero incidents or clean scan results can create a false sense of security. But attackers don’t care what your dashboards say. They care about what they can exploit.\nSo the question is no longer “Do I have security tools in place?” It's: “\nHow do I know they’re working, right now?\n”\nWhat’s Missing from Current Offensive Security Testing\nSecurity teams often rely on a mix of once-a-year penetration tests and periodic vulnerability scans. While useful and still required, these approaches have major limitations in today’s fast-evolving threat landscape and IT environment:\nThey’re not continuous.\nPoint-in-time tests don’t account for configuration drift, new vulnerabilities, or the daily shifts in attacker behavior.\nThey lack real-world context.\nScans flag thousands of CVEs without showing what attackers could actually exploit and without prioritizing the ones that matter most to your environment.\nThey don’t validate controls.\nJust because a vulnerability exists doesn’t mean your EDR or SIEM would miss it, but you’ll never know without testing.\nThey lack verification of remediation.\nYou may fix a vulnerability, but do your detection systems recognize similar exploits? Do alerts trigger when they should?\nThis creates a dangerous gap between perceived security and actual resilience. This reactive approach leaves teams flying blind. You might fix what’s easy to patch but miss what’s most exploitable. You might assume your detection rules work, until they don’t.\nTo stay ahead of adversaries, organizations need a smarter, more continuous way to validate their defenses; one that reflects the way attackers think, operate, and evolve.\nDouble your Threat Blocking in 90 Days\nBreach and Attack Simulation (BAS) lets you safely simulate real-world attacks in your production environment without risk or downtime.\nDiscover how the Picus platform enhances prevention and detection, helping you block 2X more threats in just 90 days.\nDownload the e-book\nBreach and Attack Simulation (BAS): Continuously Testing Your Defenses\nBreach and Attack Simulation (BAS)\ncloses a significant gap in traditional validation. It allows you to\nsimulate actual cyberattacks in your production environment\nrisk-free and without downtime.\nHere's how it works:\nBAS platforms launch safe simulations of\nmalware, ransomware, phishing attacks, and more\n, then monitor which are blocked, detected, or missed entirely.\nThese simulations test your\nfirewalls, IPSs, email gateways, EDR, SIEMs, and more\n, so you can see where controls fail or fail to trigger.\nThreat libraries are continuously updated with the\nnewest attacker TTPs\nso that your defenses are measured against the threats of today.\nConsider BAS like a round-the-clock fire drill for your security equipment. When an exploit goes around your IPS or your SIEM doesn't catch a recognized beacon, you'll know it in hours, not months.\nStudies have revealed that Teams that consistently use BAS have been demonstrated to\ndouble their threat blocking in 90 days\n.\nAutomated Penetration Testing: Exploiting Vulnerabilities, Exposing Attack Paths\nWhile BAS focuses on verifying control effectiveness,\nAutomated Penetration Testing\nidentifies the path an actual attacker would\nmove through your environment\n.\nHere is what it brings to your arsenal:\nIt simulates attacker activity: vulnerability exploitation, credential harvesting, lateral movement across systems, and privilege escalation.\nIt corroborates real attack steps: illustrating not only what's vulnerable, but also how an attacker would link steps to access key assets.\nIt can work continually: keeping up with the evolution of your IT infrastructure, whether new deployments or patch delays.\nFor instance, an automated pentest could take advantage of an unpatched server, steal credentials, and lateral move until it gets to the domain admin. These aren't theoretical attacks, they're actual, reproducible drills that reveal the\nexact paths attackers would take\n.\nIndeed, research from Picus Security discovered that\n40% of the environments they tested had exploitable paths to domain admin rights\n, a frightening confirmation that small holes can result in enormous compromise.\nLeast prevented ransomware groups\nAdversarial Exposure Validation: Uniting BAS and Automated Pentesting for Stronger Security\nCombined, BAS and automated pentesting give you a 360-degree perspective on your security stance. This combined practice is what Gartner calls\nAdversarial Exposure Validation (AEV)\n, a continuous, real-world methodology for cyber risk management.\nUsing AEV, you can answer the two most important questions in security:\nAre my security controls working effectively?\n(the BAS perspective), and\nWhat can an attacker accomplish in my environment?\n(the pentest perspective).\nThese subjects inform one another:\nIf BAS shows your SIEM missed a simulation, fix the rules, then run a pentest to see if that blind spot leads to additional access.\nIf an automated pentest identifies a privilege escalation vector, recreate that TTP with BAS to ensure detection in the future.\nThis closed-loop system equates to\nquicker remediation, improved detection, and less speculation\n.\n5 Key Benefits of Adversarial Exposure Validation for Modern Security TeamS\nAdversarial Exposure Validation delivers more than visibility, it drives measurable improvement:\nConfidence Against Real Attacks:\nAEV battle-tests your defenses against today’s threats—not last year’s. When the real thing hits, your team will have seen it before.\nContinuous Validation of Security Controls:\nTest your EDRs, firewalls, and SIEMs every day, not once a year. Catch detection failures and misconfigurations early.\nProactive Exposure Management:\nDon’t just scan vulnerabilities. Simulate attacks. AEV helps prioritize risks based on actual exploitability and potential business impact.\nImproved SOC Readiness:\nEach simulation is a training opportunity. Your analysts refine their skills and validate incident response playbooks in real time.\nMeasurable Security Progress:\nTrack detection and prevention rates, response times, and closed attack paths to show real security ROI, internally and to auditors.\nAn Integrated Approach to Security Validation\nSuccessful Adversarial Exposure Validation (AEV) takes more than point tools, it takes an end-to-end, threat-driven approach. The\nPicus Security Validation Platform\nprovides exactly that, unifying\nBreach and Attack Simulation (BAS)\nand\nAutomated Penetration Testing (APT)\nunder one platform to break tool silos and consolidate security testing.\nReal-World Threat Coverage:\nPicus has a\nthreat library\nof 30,000+ TTPs, ranging from ransomware to cloud misconfigurations, for current, relevant testing.\nActionable Mitigations, Built In:\nWhen a test finds a gap, such as a missed exploitation attempt, Picus doesn't merely report. The platform recommends and automates remediations via its\nMitigation Library,\naccelerating risk reduction.\nUnified, Correlated Validation:\nBy combining Security Control Validation (SCV) with Attack Path Validation (APV), Picus closes detection gaps to possible attacker progression, prioritizing what is most important.\nWith Picus, validation is an ongoing process of test, fix, and enhance, not an annual checkbox.\nReady to See What Your Security Stack Is Missing?\nDon’t wait for the next breach to expose your blind spots.\nAdversarial Exposure Validation helps you identify and fix the 41% of threats your tools may be missing—before attackers exploit them.\nDiscover your real security posture.\nRequest a demo\n.\nSponsored and written by\nPicus Security\n."
    },
    {
        "Title": "CISA extends funding to ensure 'no lapse in critical CVE services'",
        "Link": "https://www.bleepingcomputer.com/news/security/cisa-extends-funding-to-ensure-no-lapse-in-critical-cve-services/",
        "Summary": "CISA says the U.S. government has extended MITRE's funding to ensure no continuity issues with the critical Common Vulnerabilities and Exposures (CVE) program. [...]",
        "Date": "2025-04-16",
        "Content": "CISA says the U.S. government has extended MITRE's funding to ensure no continuity issues with the critical Common Vulnerabilities and Exposures (CVE) program.\n\"The CVE Program is invaluable to cyber community and a priority of CISA,\" the U.S. cybersecurity agency told BleepingComputer. \"Last night, CISA executed the option period on the contract to ensure there will be no lapse in critical CVE services. We appreciate our partners' and stakeholders' patience.\"\nBleepingComputer has learned that the extension of the contract is for 11 months.\nThe announcement follows a warning from MITRE Vice President Yosry Barsoum that government funding for the CVE and CWE programs\nwas set to expire today\n, April 16, potentially leading to widespread disruption across the cybersecurity industry.\n\"If a break in service were to occur, we anticipate multiple impacts to CVE, including deterioration of national vulnerability databases and advisories, tool vendors, incident response operations, and all manner of critical infrastructure,\" Barsoum said.\nMITRE maintains\nCVE\n, a widely adopted program that provides accuracy, clarity, and shared standards when discussing security vulnerabilities, with funding from the U.S. National Cyber Security Division of the U.S. Department of Homeland Security (DHS).\nAfter the publishing of our story, MITRE shared the following statement with BleepingComputer.\n\"Thanks to actions taken by the government, a break in service for the Common Vulnerabilities and Exposures (CVE®) Program and the Common Weakness Enumeration (CWE™) Program has been avoided. As of Wednesday morning, April 16, 2025, CISA identified incremental funding to keep the Programs operational. We appreciate the overwhelming support for these programs that have been expressed by the global cyber community, industry, and government over the last 24 hours. The government continues to make considerable efforts to support MITRE’s role in the program and MITRE remains committed to CVE and CWE as global resources.\"\n❖ Yosry Barsoum, Vice President, Director, Center for Securing the Homeland, MITRE\nNewly launched CVE Foundation\nBefore CISA's announcement, a group of CVE Board members announced the launch of the CVE Foundation, a non-profit organization established to secure the CVE program's independence in light of MITRE's warning that the U.S. government might not renew its contract for managing the program.\n\"Since its inception, the CVE Program has operated as a U.S. government-funded initiative, with oversight and management provided under contract,\"\nthey said in a Wednesday press release\n. \"While this structure has supported the program's growth, it has also raised longstanding concerns among members of the CVE Board about the sustainability and neutrality of a globally relied-upon resource being tied to a single government sponsor.\"\nOver the last year, the individuals involved in the launch have been developing a strategy to transition the program to this dedicated foundation, eliminating \"a single point of failure in the vulnerability management ecosystem\" and ensuring \"the CVE Program remains a globally trusted, community-driven initiative.\"\nWhile the CVE Foundation plans to release further information about its transition planning in the coming days, the next steps remain unclear, especially considering CISA has confirmed that funding for MITRE's contract has been extended.\nThe European Union Agency for Cybersecurity (ENISA) has also launched a European vulnerability database (\nEUVD\n), which \"embraces a multi-stakeholder approach by collecting publicly available vulnerability information from multiple sources.\"\nUpdate 4/16/25 11:07 AM ET: Added information about how long the contract is extended.\nRelated Articles:\nMITRE warns that funding for critical CVE program expires today\nCentreStack RCE exploited as zero-day to breach file sharing servers\nCISA warns of Fast Flux DNS evasion used by cybercrime gangs\nCISA emergency directive: Mitigate Ivanti zero-days immediately\nMITRE says state hackers breached its network via Ivanti zero-days"
    },
    {
        "Title": "Microsoft warns of blue screen crashes caused by April updates",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-warns-of-blue-screen-crashes-caused-by-april-updates/",
        "Summary": "Microsoft warned customers this week that their systems might crash with a blue screen error caused by a secure kernel fatal error after installing Windows updates released since March. [...]",
        "Date": "2025-04-16",
        "Content": "Microsoft warned customers this week that their systems might crash with a blue screen error caused by a secure kernel fatal error after installing Windows updates released since March.\nAccording to advisory updates for the\nKB5055523 April cumulative update\nand the\nKB5053656 March preview update\n, this known issue affects devices running Windows 11, version 24H2. Those affected will see their PCs crash after installing these updates and restarting their devices.\n\"After installing this update and restarting your device, you might encounter a blue screen exception with error code 0x18B indicating a SECURE_KERNEL_ERROR,\" Microsoft said.\nUntil a fix is rolled out through Windows Update, Microsoft resolved this issue via Known Issue Rollback (KIR), a feature that reverses buggy non-security updates delivered via Windows Update.\nThis fix will propagate automatically to all home, non-managed enterprise devices, and business devices not managed by IT departments over the next 24 hours. To expedite the rollout, Microsoft advises affected users to restart their devices, which ensures the fix is applied faster.\nSECURE_KERNEL_ERROR blue screen (BleepingComputer)\nTo address the known issue on Windows enterprise-managed devices, admins must install the\nWindows 11 24H2 and Windows Server 2025 KB5053656 250412_03103 Known Issue Rollback\nGroup Policy.\nAfter installation, you can find the Group Policy under Computer Configuration > Administrative Templates. To deploy it on affected endpoints, you must go to the Local Computer Policy or the Domain policy on the domain controller using the Group Policy Editor to choose the Windows version you want to target.\n\"You will need to install and configure the Group Policy for your version of Windows to resolve this issue. You will also need to restart your device(s) to apply the group policy setting,\"\nMicrosoft added\n.\nWindows admins can find additional guidance on deploying KIR Group Policies on the\nMicrosoft support website\n.\nEarlier this week, Microsoft\nreleased emergency Windows updates\nto address an issue affecting local audit logon policies in Active Directory Group Policy and warned admins that\nWindows Server 2025 domain controllers might become inaccessible\nafter restarts, causing services and apps to fail.\nToday, Redmond also started deploying a fix for an issue causing some Windows devices\nto be offered Windows 11 upgrades\ndespite Intune policies blocking them.\nRelated Articles:\nMicrosoft rolls out BIOS update that fixes ASUS blue screen issues\nWindows 11 24H2 blocked on PCs with code-obfuscation driver BSODs\nMicrosoft lifts Windows 11 upgrade block after Asphalt 8 crash fix\nMicrosoft adds hotpatching support to Windows 11 Enterprise\nMicrosoft tests new Windows 11 tool to remotely fix boot crashes"
    },
    {
        "Title": "Microsoft: Some devices offered Windows 11 upgrades despite Intune blocks",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-some-devices-offered-windows-11-upgrades-despite-intune-blocks/",
        "Summary": "Microsoft is working to fix an ongoing issue causing some users' Windows devices to be offered Windows 11 upgrades despite Intune policies preventing them. [...]",
        "Date": "2025-04-16",
        "Content": "Microsoft is working to fix an ongoing issue causing some users' Windows devices to be offered Windows 11 upgrades despite Intune policies preventing them.\nThis known issue has impacted Windows desktop devices since Saturday, April 12, and is caused by what the company describes as a \"latent code issue.\"\nRedmond added earlier today in an update to the Microsoft 365 admin center (\nIT10561350\n) that a targeted code fix is now being deployed to prevent additional impact on other systems.\nMicrosoft recommends\npausing Windows feature updates\nusing Intune Windows Update client policies until the fix rolls out to all desktop devices affected by this issue.\nThe company also warned that users must manually revert systems that were mistakenly upgraded to Windows 11 because of this ongoing issue.\n\"While we work to address the issue, admins in impacted organizations may be able to circumvent impact by pausing Windows Feature Updates until the code fix has been developed, tested, and deployed,\" Microsoft said.\n\"Note that devices which have already erroneously received the Windows 11 upgrade will need to be manually rolled back to the correct Windows version.\"\nAlthough Microsoft has yet to share more information on how widespread this issue is, the incident has been tagged as an advisory, which implies a service issue that is limited in scope or impact.\nUnexpected Windows Server 2025 upgrades\nThis isn't the first time Windows systems have been unexpectedly upgraded without the users' express consent. In November 2024, Microsoft confirmed that some Windows Server 2019 and Windows Server 2022 devices\nwere upgraded to Windows Server 2025\nwithout warning.\nRedmond acknowledged the issue after days of\nwidespread\nreports\nfrom\nWindows admins that servers in their organizations' environments were being automatically upgraded overnight to a Windows Server version for which they didn't even have a license.\nWhile the issue has since been mitigated, Microsoft has yet to share how Windows admins can roll back the automatic upgrades besides restoring systems from backups. When BleepingComputer reached out at the time, the company didn't reply to a request for comment.\nMicrosoft also resolved an issue where admins\nsaw a prompt to upgrade to Windows Server 2025\non the Windows Update page. Redmond said this message was meant for those looking to perform an in-place upgrade.\nRelated Articles:\nMicrosoft: New Windows updates fix Active Directory policy issues\nWindows 11 update breaks Veeam recovery, causes connection errors\nMicrosoft: Windows Server 2025 restarts break connectivity on some DCs\nWindows 11 KB5055523 & KB5055528  cumulative updates released\nMicrosoft starts testing Windows 11 taskbar icon scaling"
    },
    {
        "Title": "MITRE warns that funding for critical CVE program expires today",
        "Link": "https://www.bleepingcomputer.com/news/security/mitre-warns-that-funding-for-critical-cve-program-expires-today/",
        "Summary": "MITRE Vice President Yosry Barsoum has warned that U.S. government funding for the Common Vulnerabilities and Exposures (CVE) and Common Weakness Enumeration (CWE) programs expires today, which could lead to widespread disruption across the global cybersecurity industry. [...]",
        "Date": "2025-04-16",
        "Content": "MITRE Vice President Yosry Barsoum has warned that U.S. government funding for the Common Vulnerabilities and Exposures (CVE) and Common Weakness Enumeration (CWE) programs expires today, which could lead to widespread disruption across the global cybersecurity industry.\nCVE\n, the most critical of the two, is maintained by MITRE with funding from the U.S. National Cyber Security Division of the U.S. Department of Homeland Security (DHS). CVE is crucial for providing accuracy, clarity, and shared standards when discussing security vulnerabilities.\nThe program is widely adopted across various cybersecurity tools, including vulnerability management systems, and it allows tracking all newly discovered vulnerabilities using CVE Identifiers (CVE IDs) assigned by CVE Numbering Authorities (CNAs) worldwide, with MITRE as the CVE Editor and Primary CNA.\nCVE also helps avoid confusion caused by using multiple names for a single security flaw, enables coordinated cataloging of new vulnerabilities, and enables security teams to share information more easily through advisories, vulnerability databases, and other resources using a standard reference system.\n\"On Wednesday, April 16, 2025, the current contracting pathway for MITRE to develop, operate, and modernize CVE and several other related programs, such as CWE, will expire. The government continues to make considerable efforts to continue MITRE's role in support of the program,\" Barsoum warned in a letter sent to CVE Board members.\n\"If a break in service were to occur, we anticipate multiple impacts to CVE, including deterioration of national vulnerability databases and advisories, tool vendors, incident response operations, and all manner of critical infrastructure.\"\nLetter to CVE Board (\nTib3rius\n)\n​Since the letter was published online, many security experts and leaders in the cybersecurity community have expressed their angst. They fear the program will abruptly end, and everyone in the field will have no standardized method to track new security issues if servers are shut down and CVE Numbering Authorities' CVE API access is cut off.\nAccording to former CISA head Jean Easterly, the immediate result would likely be the breakdown of most trusted security tools and processes and the collapse of all global coordination efforts.\n\"The CVE system may not make headlines, but it is one of the most important pillars of modern cybersecurity. Losing it would be like tearing out the card catalog from every library at once—leaving defenders to sort through chaos while attackers take full advantage,\" Easterly\nwarned on LinkedIn\n.\n\"Cyber threats don't stop at borders—and neither does defense. CVEs are the common language used worldwide to share intelligence and coordinate action. Lose that, and everyone's flying blind.\"\nCasey Ellis, founder of crowdsourced security company Bugcrowd, added, \"CVE underpins a huge chunk of vulnerability management, incident response, and critical infrastructure protection efforts. A sudden interruption in services has the very real potential to bubble up into a national security problem in short order.\nWhen contacted by BleepingComputer, spokespersons at DHS, the National Institute of Standards and Technology (NIST), and the Department of Defense were not immediately available for comment.\nHowever, a CISA spokesperson told BleepingComputer, \"Although CISA's contract with the MITRE Corporation will lapse after April 16th, we are urgently working to mitigate impact and to maintain CVE services on which global stakeholders rely.\"\nMITRE's troubles in keeping the CVE program funded come as NIST is also\nscrambling to clear a large backlog of CVEs\nthat need enrichment for its National Vulnerability Database (NVD).\nRelated Articles:\nCISA extends funding to ensure 'no lapse in critical CVE services'\nUS govt says Americans lost record $12.5 billion to fraud in 2024\nAmericans lost record $10 billion to fraud in 2023, FTC warns\nMicrosoft: Exchange 2016 and 2019 reach end of support in six months\nMicrosoft: Windows 'inetpub' folder created by security fix, don’t delete"
    },
    {
        "Title": "Multiple Groups Exploit NTLM Flaw in Microsoft Windows",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/multiple-group-exploiting-ntlm-flaw",
        "Summary": "The attacks have been going on since shortly after Microsoft patched the vulnerability in March.",
        "Date": "2025-04-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/multiple-group-exploiting-ntlm-flaw"
    },
    {
        "Title": "China-Linked Hackers Lay Brickstorm Backdoors on Euro Networks",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/china-linked-hackers-brickstorm-backdoors-european-networks",
        "Summary": "Researchers discovered new variants of the malware, which is tied to a China-nexus threat group, targeting Windows environments of critical infrastructure networks in Europe.",
        "Date": "2025-04-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/china-linked-hackers-brickstorm-backdoors-european-networks"
    },
    {
        "Title": "Ransomware gang 'CrazyHunter' Targets Critical Taiwanese Orgs",
        "Link": "https://www.darkreading.com/threat-intelligence/ransomware-gang-crazyhunter-critical-taiwanese-orgs",
        "Summary": "Trend Micro researchers detailed an emerging ransomware campaign by a new group known as &quot;CrazyHunter&quot; that is targeting critical sectors in Taiwan.",
        "Date": "2025-04-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/ransomware-gang-crazyhunter-critical-taiwanese-orgs"
    },
    {
        "Title": "Patch Now: NVDIA Flaws Expose AI Models, Critical Infrastructure",
        "Link": "https://www.darkreading.com/cloud-security/buggy-nvdia-patch-exposes-ai-models-critical-infrastructure",
        "Summary": "A fix for a critical flaw in a tool allowing organizations to run GPU-accelerated containers released last year did not fully mitigate the issue, spurring the need to patch a secondary flaw to protect organizations that rely on NVIDIA processors for AI workloads.",
        "Date": "2025-04-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/buggy-nvdia-patch-exposes-ai-models-critical-infrastructure"
    },
    {
        "Title": "Cloud, Cryptography Flaws in Mobile Apps Leak Enterprise Data",
        "Link": "https://www.darkreading.com/endpoint-security/cloud-cryptography-flaws-mobile-apps-expose-enterprise-data",
        "Summary": "Cloud misconfigurations and cryptography flaws plague some of the top apps used in work environments, exposing organizations to risk and intrusion.",
        "Date": "2025-04-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/cloud-cryptography-flaws-mobile-apps-expose-enterprise-data"
    },
    {
        "Title": "Active Directory Recovery Can't Be an Afterthought",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/active-directory-recovery-afterthought",
        "Summary": "Active Directory is one of the most vulnerable access points in an organization's IT environment. Companies cannot wait for a real attack to pressure-test their AD recovery strategy.",
        "Date": "2025-04-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/active-directory-recovery-afterthought"
    },
    {
        "Title": "Funding Expires for Key Cyber Vulnerability Database",
        "Link": "https://krebsonsecurity.com/2025/04/funding-expires-for-key-cyber-vulnerability-database/",
        "Summary": "A critical resource that cybersecurity professionals worldwide rely on to identify, mitigate and fix security vulnerabilities in software and hardware is in danger of breaking down. The federally funded, non-profit research and development organization MITRE warned today that its contract to maintain the Common Vulnerabilities and Exposures (CVE) program -- which is traditionally funded each year by the Department of Homeland Security -- expires on April 16.",
        "Date": "2025-04-16",
        "Content": "A critical resource that cybersecurity professionals worldwide rely on to identify, mitigate and fix security vulnerabilities in software and hardware is in danger of breaking down. The federally funded, non-profit research and development organization MITRE warned today that its contract to maintain the Common Vulnerabilities and Exposures (CVE) program — which is traditionally funded each year by the Department of Homeland Security — expires on April 16.\nA letter from MITRE vice president Yosry Barsoum, warning that the funding for the CVE program will expire on April 16, 2025.\nTens of thousands of security flaws in software are found and reported every year, and these vulnerabilities are eventually assigned their own unique CVE tracking number (e.g. CVE-2024-43573, which is a Microsoft Windows bug that Redmond patched last year).\nThere are hundreds of organizations — known as CVE Numbering Authorities (CNAs) — that are authorized by MITRE to bestow these CVE numbers on newly reported flaws. Many of these CNAs are country and government-specific, or tied to individual software vendors or vulnerability disclosure platforms (a.k.a. bug bounty programs).\nPut simply, MITRE is a critical, widely-used resource for centralizing and standardizing information on software vulnerabilities. That means the pipeline of information it supplies is plugged into an array of cybersecurity tools and services that help organizations identify and patch security holes — ideally before malware or malcontents can wriggle through them.\n“What the CVE lists really provide is a standardized way to describe the severity of that defect, and a centralized repository listing which versions of which products are defective and need to be updated,” said Matt Tait, chief operating officer of Corellium, a cybersecurity firm that sells phone-virtualization software for finding security flaws.\nIn a letter sent today to the CVE board, MITRE Vice President Yosry Barsoum warned that on April 16, 2025, “the current contracting pathway for MITRE to develop, operate and modernize CVE and several other related programs will expire.”\n“If a break in service were to occur, we anticipate multiple impacts to CVE, including deterioration of national vulnerability databases and advisories, tool vendors, incident response operations, and all manner of critical infrastructure,” Barsoum wrote.\nMITRE told KrebsOnSecurity the CVE website listing vulnerabilities will remain up after the funding expires, but that new CVEs won’t be added after April 16.\nA representation of how a vulnerability becomes a CVE, and how that information is consumed. Image: James Berthoty, Latio Tech, via LinkedIn.\nDHS officials did not immediately respond to a request for comment. The program is funded through DHS’s Cybersecurity & Infrastructure Security Agency (CISA), which is currently facing deep budget and staffing cuts by the Trump administration. The CVE contract available at USAspending.gov says the project was awarded approximately $40 million last year.\n\nFormer CISA Director Jen Easterly said the CVE program is a bit like the Dewey Decimal System, but for cybersecurity.\n“It’s the global catalog that helps everyone—security teams, software vendors, researchers, governments—organize and talk about vulnerabilities using the same reference system,” Easterly said in a post on LinkedIn. “Without it, everyone is using a different catalog or no catalog at all, no one knows if they’re talking about the same problem, defenders waste precious time figuring out what’s wrong, and worst of all, threat actors take advantage of the confusion.”\nJohn Hammond, principal security researcher at the managed security firm Huntress, told Reuters he swore out loud when he heard the news that CVE’s funding was in jeopardy, and that losing the CVE program would be like losing “the language and lingo we used to address problems in cybersecurity.”\n“I really can’t help but think this is just going to hurt,” said Hammond, who posted a Youtube video to vent about the situation and alert others.\nSeveral people close to the matter told KrebsOnSecurity this is not the first time the CVE program’s budget has been left in funding limbo until the last minute. Barsoum’s letter, which was apparently leaked, sounded a hopeful note, saying the government is making “considerable efforts to continue MITRE’s role in support of the program.”\nTait said that without the CVE program, risk managers inside companies would need to continuously monitor many other places for information about new vulnerabilities that may jeopardize the security of their IT networks. Meaning, it may become more common that software updates get mis-prioritized, with companies having hackable software deployed for longer than they otherwise would, he said.\n“Hopefully they will resolve this, but otherwise the list will rapidly fall out of date and stop being useful,” he said.\nUpdate, April 16, 11:00 a.m. ET: The CVE board today announced the creation of non-profit entity called The CVE Foundation that will continue the program’s work under a new, unspecified funding mechanism and organizational structure.\n“Since its inception, the CVE Program has operated as a U.S. government-funded initiative, with oversight and management provided under contract,” the press release reads. “While this structure has supported the program’s growth, it has also raised longstanding concerns among members of the CVE Board about the sustainability and neutrality of a globally relied-upon resource being tied to a single government sponsor.”\nThe organization’s website, thecvefoundation.org, is less than a day old and currently hosts no content other than the press release heralding its creation. The announcement said the foundation would release more information about its structure and transition planning in the coming days.\nUpdate, April 16, 4:26 p.m. ET: MITRE issued a statement today saying it “identified incremental funding to keep the programs operational. We appreciate the overwhelming support for these programs that have been expressed by the global cyber community, industry and government over the last 24 hours. The government continues to make considerable efforts to support MITRE’s role in the program and MITRE remains committed to CVE and CWE as global resources.”\n\r\n         This entry was posted on Tuesday 15th of April 2025 11:59 PM \r\n         \nthis step good for internate or social media  user,s\nDoes Big Balls know this? Hopefully it wasn’t his idea.\nnextgov.com/cybersecurity/2025/04/user-russian-ip-address-tried-log-nlrb-systems-following-doge-access-whistleblower-says/404574/\nEither one of them is rooted or they’re giving it away intentionally.  I’d say both are equally likely.\nSweet baby Jesus. 80+ years of US soft power going down the drain in mere months.\nHas anyone reached out to European institutions to fund and host this?\nNot that I disagree, and this is a very rational question in a sea of panic (thank you!), but IMO it should be the corporations primarily responsible for funding this through and independent self-regulating body.  Kind of like how FINRA oversees brokers/dealers, levies fines for non-compliance with rules, and recommends criminal investigation to the SEC when appropriate.  Just replace FINRA with an organization like CIS (no exactly CIS, but like CIS) and the SEC with CISA\\DHS\\NIST.\n MEGA\nI’ve kind of lost it. This is so absurd I’m laughing. Ah yes! No more cybersecurity for anybody! HAHAHAHA\nIt may be an idea to not use a single point of failure authority, but expend this to 3 authorities based in 3 different geolocation..\nHey, we need that money to fund weekend golf trips to Florida every weekend.  That ain’t cheap.\nIn addition to https://vulnerability.circl.lu, we launched today https://gcve.eu which is a decentralized approach to vulnerability identification and numbering, designed to improve flexibility, scalability, and autonomy for participating entities. GCVE is compatible with the traditional CVE system, but adds increased flexibility, scalability, and autonomy for organizations involved in vulnerability management.\nVulnerability-Lookup (https://vulnerability.circl.lu) facilitates quick correlation of vulnerabilities from various sources, independent of vulnerability IDs, and streamlines the management of Coordinated Vulnerability Disclosure (CVD), and is the first software to fully support GCVE.\nwell in addition EU also just lunched: https://euvd.enisa.europa.eu/ – rest will be interesting to see how this moves forward… but for now; some helpful settings\nTo complete the circle: EUVD is querying vulnerability-lookup 😉\n(https://euvd.enisa.europa.eu/faq)\nBravo! Chuffed to see the Europeans have come to the dance party.\nThe grandpa does know what MITRE is. “It’s all computer!”\nOh yes, “do not bring politics to security blog” group is silent here. \nGlad to see EU picking up the slack there with https://gcve.eu\nAs a long time subscriber and reader, thank you for keeping the community well informed. This is insanity!!!\nWhitehouse news release on May 16; “Under Trump’s leadership, the number of CVE’s has been reduced in the last month.  The United States is now more secure than ever”.\n /s\nHow much funding do they get? I can’t find a number anywhere just “the CVE program is minor and “won’t break the bank”.\nAnyone have any idea how much it takes to run?\nCSO Online is reporting that over $28 million in contracts with MITRE have been cancelled, which included funding for the CVE program. For the most accurate and up-to-date information regarding the CVE program’s funding, you’d have to consider submitting a FOIA request to DHS or consulting official government budget documents. But considering Leon’s ‘USG Gutting Program’ I don’t think you’ll have much luck there.\nWhat happens when rank amateurs are put in charge.\nSo the US taxpayer is funding a program that every one benefits from, but aren’t contributing to? Here’s a crazy idea. How about getting “big tech” to part with some of their billions to help fund this?\nLike that’s gonna happen. It’s Big Tech’s sugar daddy the Pestilent Orange Pox that is responsible for this clusterf*ck.\nThe US taxpayer is funding a program that helps the US taxpayer.  All of this stuff benefits us.\nIt also benefits others, but so what?\nYes, this is what taxes are for.\nBingo.\nOK let me get this straight… \nSo Big Tech that literally makes BILLIONS annually (and pays minimal in any tax to boot) is actually the source of all the vulnerabilities & bugs being found at my taxpaying expense…(that’s some great QC by the way) and for just what reason aren’t they paying for this critical work?!?!?\nSheesh, the money found in their employee lounges couches would cover the cost…\nI wonder just how many of said vulnerabilities & bugs are specifically from Microsoft?\nSeeings how they are so many that there is a Microsoft Patch Tuesday that’s been going on for years now…typically featuring 50-150 patches each…https://krebsonsecurity.com/?s=Microsoft+Patch+Tuesday\nMITRE should launch a campaign at GoFundMe lest a lots of security companies or programs suffer. Hope God forgive this.\nUpdate Apr. 16 at 08:20 EST: In an eleventh hour turnaround, the U.S. Cybersecurity and Infrastructure Security Agency said it had extended the contract with MITRE.\nhttps://www.forbes.com/sites/kateoflahertyuk/2025/04/16/cve-program-funding-cut-what-it-means-and-what-to-do-next/\nSweet $DEITY people.  Stop defaulting to everything being a US .gov problem.\nThis is exactly the kind of thing that should NOT be a US federally funded program.  There’s a long, working, history of critical computer services in the private sector.  Kicking this out into the decentralized world for its users to support and update will ultimately benefit everyone.\nRespectfully disagree. The US government has funded this for 25  years. You can’t just quit funding suddenly and not expect fallout.\nThis is the problem with this administration is that they just randomly cut funding effective immediately. At least schedule some time so everyone can prepare.\n“This is exactly the kind of thing that should NOT be a US federally funded program”\nOkay, I assume you mean because you think the US government might hold back on CVE classifications for vulns they are actively using or hoping to use themselves for offensive attacks?  That’s not entirely unreasonable to think about, but otherwise you’re saying a national vuln database/catalogue effort is not in the larger national interest entirely?  That’s literally ‘the’ role of a Federal government  – to provide security for the larger endeavor, including the private sector.  Yes there is partnering with vendors and contracting and whatnot, but expecting each private sector market to look after and mind all of this individually in this evolving attack environment is like expecting elephants to herd themselves to safety over the Alps.  ‘Someone’ needs to fund and maintain it for the general security welfare, not limit and sell access to it for private profit as the private sector _already does_ in every direction.   Security is layers.  Responsibility is concentric.\nI don’t have an opinion on incentives behind the data itself.  I’m only pointing out that humanity can, and should, do important things without government entanglements.  Rockets are better without NASA.  This system will be better with less US bureaucracy as well.\nBased on the article updates, others have come to the same conclusion.\n“humanity can, and should, do important things without government entanglements.”  \nOkay so feel free to have a comprehensive CVE database that you can demonstrate is as good as the one “the eebil gubmint” puts out, make it available to everyone for free (beer style) and maintain it indefinitely for the good of mankind.  Solved.\nUntil you do that, however, people living under the eebil gubmints do benefit from having it even though it costs taxpayer money to do so – this is our system; taxation, representation, hopefully some useful action.  Up until very recently this was seen by most as a good investment, albeit a small one.  \nRelying on the goodwill of mankind to keep our *.* secure sounds great though, so just wake me when you’ve gone and done that.  We can take the $40 million and just blow it all on shoes.  \n“This system will be better with less US bureaucracy as well.”  – How so?  Be specific.  How well do you know this system, and how exactly is UN bureaucracy impacting it in your estimation?  If you’ve got things to point out, well, point them out rather than just implying all things government-touching are useless.  *(It’s called Libertarianism and it’s often confused as a form of governance, where it’s actually an ideological opposite of that idea.)\n^*US bureaucracy, not UN… (~all human systems have bureaucracy…)\n“Rockets are better without NASA.”  \nIf you like explosions, surely.  Rocket companies wouldn’t exist in current form without NASA though.\nYou didn’t build that.\nWorld War III is virtually underway imho. Our information security, privacy and ultimately our freedom and wealth are being taken away through vitual warfare and social engineering.  Our legal system is like bringing a knife to a gun fight and we need to rise up with a new warplan. (on Signal lol)\nWould love to know how much the Maintaining this actually costs.  Right now I have seen $2million,  $28million and $40million here and in different places.  How much and what exactly does it cover.  When was the last time it was competitively bid out?\nIt is a valuable resource but I am wondering if other things ae in the contract as well.\nThere is a link to the most recent contract from DHS/CISA. It shows the allocated amount as ~$40M.\nhttps://www.usaspending.gov/award/CONT_AWD_70RCSJ24FR0000019_7001_70RSAT20D00000001_7001\nMy city gov spent more than that on traffic lights for 2 intersections.  Not even complicated ones.\nThe “thecvefoundation.org” domain was created 2025-04-15 23:41:47 UTC. For some reason, I can’t shake the burning feeling in my gut …\nThe domain “thecvefoundation.org” was created 2025-04-15 23:41:47 UTC. For some reason, I have a very sour feeling in my gut …\nhttps://www.meritalk.com/articles/cisa-extends-cve-program-contract-at-11th-hour-averting-disruption/\nThe contract has been extended\nhttps://www.meritalk.com/articles/cisa-extends-cve-program-contract-at-11th-hour-averting-disruption/\nHere is another one for temporary email address – https://tempmails.in\nhttps://www.reuters.com/world/us/us-agency-extends-support-last-minute-cyber-vulnerability-database-2025-04-16/\nTo the C-Suite Executives & Cybersecurity Professionals,\nSince the Morris Worm incident in 1988, the responsibility for vulnerability enumeration has evolved from Carnegie Mellon University to MITRE, with the Common Vulnerabilities and Exposures (CVE) system becoming the global standard. However, persistent underfunding and shifting priorities have caused significant delays and backlogs in vulnerability processing. It may be time to consider transitioning the management of the CVE program to a dedicated non-profit organization focused on operational continuity and transparency—while allowing Federally Funded Research and Development Centers (FFRDCs) to focus on innovation and strategic research.\nThis feels like the foundation of my patching program is about to go away. Help me understand how critical this is to tools like Tenable NESSUS and Microsoft Update and Defender ATP..\nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "Krebs Exits SentinelOne After Security Clearance Pulled",
        "Link": "https://www.securityweek.com/krebs-exits-sentinelone-after-security-clearance-pulled/",
        "Summary": "<p>Chris Krebs has resigned from SentinelOne after security clearance withdrawn and an order to review CISA’s conduct under his leadership.</p>\n<p>The post <a href=\"https://www.securityweek.com/krebs-exits-sentinelone-after-security-clearance-pulled/\">Krebs Exits SentinelOne After Security Clearance Pulled</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/krebs-exits-sentinelone-after-security-clearance-pulled/"
    },
    {
        "Title": "Apple Quashes Two Zero-Days With iOS, MacOS Patches",
        "Link": "https://www.securityweek.com/apple-pushes-ios-macos-patches-to-quash-two-zero-days/",
        "Summary": "<p>The vulnerabilities are described as code execution and mitigation bypass issues that affect Apple’s iOS, iPadOS and macOS platforms.</p>\n<p>The post <a href=\"https://www.securityweek.com/apple-pushes-ios-macos-patches-to-quash-two-zero-days/\">Apple Quashes Two Zero-Days With iOS, MacOS Patches</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/apple-pushes-ios-macos-patches-to-quash-two-zero-days/"
    },
    {
        "Title": "MITRE CVE Program Gets Last-Hour Funding Reprieve",
        "Link": "https://www.securityweek.com/mitre-cve-program-gets-last-hour-funding-reprieve/",
        "Summary": "<p>The US government's cybersecurity agency CISA has “executed the option period on the contract” to keep the vulnerability catalog operational.</p>\n<p>The post <a href=\"https://www.securityweek.com/mitre-cve-program-gets-last-hour-funding-reprieve/\">MITRE CVE Program Gets Last-Hour Funding Reprieve</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/mitre-cve-program-gets-last-hour-funding-reprieve/"
    },
    {
        "Title": "Many Mobile Apps Fail Basic Security—Posing Serious Risks to Enterprises",
        "Link": "https://www.securityweek.com/many-mobile-apps-fail-basic-security-posing-serious-risks-to-enterprises/",
        "Summary": "<p>Top-ranked mobile apps found using hardcoded keys and exposed cloud buckets.</p>\n<p>The post <a href=\"https://www.securityweek.com/many-mobile-apps-fail-basic-security-posing-serious-risks-to-enterprises/\">Many Mobile Apps Fail Basic Security—Posing Serious Risks to Enterprises</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/many-mobile-apps-fail-basic-security-posing-serious-risks-to-enterprises/"
    },
    {
        "Title": "Pillar Security Banks $9M for AI Security Guardrails",
        "Link": "https://www.securityweek.com/pillar-security-banks-9m-for-ai-security-guardrails/",
        "Summary": "<p>Shield Capital leads a $9 million seed-stage funding round for Israeli startup building technologies for AI security and privacy guardrails.</p>\n<p>The post <a href=\"https://www.securityweek.com/pillar-security-banks-9m-for-ai-security-guardrails/\">Pillar Security Banks $9M for AI Security Guardrails</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/pillar-security-banks-9m-for-ai-security-guardrails/"
    },
    {
        "Title": "Ransomware Group Claims Hacking of Oregon Regulator After Data Breach Denial",
        "Link": "https://www.securityweek.com/ransomware-group-claims-hacking-of-oregon-regulator-after-data-breach-denial/",
        "Summary": "<p>The Rhysida ransomware gang claims to have stolen 2.5 Tb of files from the Oregon Department of Environmental Quality.</p>\n<p>The post <a href=\"https://www.securityweek.com/ransomware-group-claims-hacking-of-oregon-regulator-after-data-breach-denial/\">Ransomware Group Claims Hacking of Oregon Regulator After Data Breach Denial</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/ransomware-group-claims-hacking-of-oregon-regulator-after-data-breach-denial/"
    },
    {
        "Title": "Enhanced Version of ‘BPFDoor’ Linux Backdoor Seen in the Wild",
        "Link": "https://www.securityweek.com/enhanced-version-of-bpfdoor-linux-backdoor-seen-in-the-wild/",
        "Summary": "<p>In recent attacks, the state-sponsored backdoor BPFDoor is using a controller to open a reverse shell and move laterally.</p>\n<p>The post <a href=\"https://www.securityweek.com/enhanced-version-of-bpfdoor-linux-backdoor-seen-in-the-wild/\">Enhanced Version of &#8216;BPFDoor&#8217; Linux Backdoor Seen in the Wild</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/enhanced-version-of-bpfdoor-linux-backdoor-seen-in-the-wild/"
    },
    {
        "Title": "Critical Vulnerability Found in Apache Roller Blog Server",
        "Link": "https://www.securityweek.com/critical-vulnerability-found-in-apache-roller-blog-server/",
        "Summary": "<p>A critical vulnerability in Apache Roller could be used to maintain persistent access by reusing older sessions even after password changes.</p>\n<p>The post <a href=\"https://www.securityweek.com/critical-vulnerability-found-in-apache-roller-blog-server/\">Critical Vulnerability Found in Apache Roller Blog Server</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/critical-vulnerability-found-in-apache-roller-blog-server/"
    },
    {
        "Title": "Microsoft Warns of Node.js Abuse for Malware Delivery",
        "Link": "https://www.securityweek.com/microsoft-warns-of-node-js-abuse-for-malware-delivery/",
        "Summary": "<p>In the past months Microsoft has seen multiple campaigns involving Node.js to deliver malware and other malicious payloads.</p>\n<p>The post <a href=\"https://www.securityweek.com/microsoft-warns-of-node-js-abuse-for-malware-delivery/\">Microsoft Warns of Node.js Abuse for Malware Delivery</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/microsoft-warns-of-node-js-abuse-for-malware-delivery/"
    },
    {
        "Title": "Chrome 135, Firefox 137 Updates Patch Severe Vulnerabilities",
        "Link": "https://www.securityweek.com/chrome-135-firefox-137-updates-patch-severe-vulnerabilities/",
        "Summary": "<p>Chrome 135 and Firefox 137 updates have been rolled out with patches for critical- and high-severity vulnerabilities.</p>\n<p>The post <a href=\"https://www.securityweek.com/chrome-135-firefox-137-updates-patch-severe-vulnerabilities/\">Chrome 135, Firefox 137 Updates Patch Severe Vulnerabilities</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chrome-135-firefox-137-updates-patch-severe-vulnerabilities/"
    }
]