[
    {
        "Title": "Kimsuky Exploits BlueKeep RDP Vulnerability to Breach Systems in South Korea and Japan",
        "Link": "https://thehackernews.com/2025/04/kimsuky-exploits-bluekeep-rdp.html",
        "Summary": "Cybersecurity researchers have flagged a new malicious campaign related to the North Korean state-sponsored threat actor known as Kimsuky that exploits a now-patched vulnerability impacting Microsoft Remote Desktop Services to gain initial access.\nThe activity has been named Larva-24005 by the AhnLab Security Intelligence Center (ASEC).\n\"In some systems, initial access was gained through",
        "Date": "2025-04-21",
        "Content": "Cybersecurity researchers have flagged a new malicious campaign related to the North Korean state-sponsored threat actor known as\nKimsuky\nthat exploits a now-patched vulnerability impacting Microsoft Remote Desktop Services to gain initial access.\nThe activity has been named\nLarva-24005\nby the AhnLab Security Intelligence Center (ASEC).\n\"In some systems, initial access was gained through exploiting the RDP vulnerability (BlueKeep, CVE-2019-0708),\" the South Korean cybersecurity company\nsaid\n. \"While an RDP vulnerability scanner was found in the compromised system, there is no evidence of its actual use.\"\nCVE-2019-0708\n(CVSS score: 9.8) is a\ncritical wormable bug\nin Remote Desktop Services that could enable remote code execution, allowing unauthenticated attackers to install arbitrary programs, access data, and even create new accounts with full user rights.\nHowever, in order for an adversary to exploit the flaw, they would need to send a specially crafted request to the target system Remote Desktop Service via RDP. It was patched by Microsoft in May 2019.\nAnother initial access vector adopted by the threat actor is the use of\nphishing mails\nembedding files that trigger another known Equation Editor vulnerability (\nCVE-2017-11882\n, CVSS score: 7.8).\nOnce access is gained, the attackers proceed to leverage a dropper to install a malware strain dubbed MySpy and a RDPWrap tool referred to as RDPWrap, in addition to changing system settings to allow RDP access. MySpy is designed to collect system information.\nThe attack culminates in the deployment of keyloggers like KimaLogger and\nRandomQuery\nto capture keystrokes.\nThe campaign is assessed to have been sent to victims in South Korea and Japan, mainly software, energy, and financial sectors in the former since October 2023. Some of the other countries targeted by the group include the United States, China, Germany, Singapore, South Africa, the Netherlands, Mexico, Vietnam, Belgium, the United Kingdom, Canada, Thailand, and Poland.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "SuperCard X Android Malware Enables Contactless ATM and PoS Fraud via NFC Relay Attacks",
        "Link": "https://thehackernews.com/2025/04/supercard-x-android-malware-enables.html",
        "Summary": "A new Android malware-as-a-service (MaaS) platform named SuperCard X can facilitate near-field communication (NFC) relay attacks, enabling cybercriminals to conduct fraudulent cashouts.\nThe active campaign is targeting customers of banking institutions and card issuers in Italy with an aim to compromise payment card data, fraud prevention firm Cleafy said in an analysis. There is evidence to",
        "Date": "2025-04-21",
        "Content": "A new Android malware-as-a-service (MaaS) platform named\nSuperCard X\ncan facilitate near-field communication (\nNFC\n) relay attacks, enabling cybercriminals to conduct fraudulent cashouts.\nThe active campaign is targeting customers of banking institutions and card issuers in Italy with an aim to compromise payment card data, fraud prevention firm Cleafy said in an analysis. There is evidence to suggest that the service is promoted on Telegram channels.\nSuperCard X \"employs a multi-stage approach combining social engineering (via smishing and phone calls), malicious application installation, and NFC data interception for highly effective fraud,\" security researchers Federico Valentini‍, Alessandro Strino, and Michele Roviello\nsaid\n.\nThe new Android malware, the work of a Chinese-speaking threat actor, has been observed being propagated via three different bogus apps, duping victims into installing them via social engineering techniques like deceptive SMS or WhatsApp messages -\nVerifica Carta (io.dxpay.remotenfc.supercard11)\nSuperCard X (io.dxpay.remotenfc.supercard)\nKingCard NFC (io.dxpay.remotenfc.supercard)\nThe messages impersonate bank security alerts to induce a false sense of urgency by urging recipients to call a specific number to dispute the transaction.\nThe infection chain then moves to what's called a Telephone-Oriented Attack Delivery (TOAD), where the threat actors manipulate victims to install the app under the guise of security software through direct phone conversations. The threat actors have also been found to employ persuasive tactics to glean victims' PINs and instruct them to remove any existing card limits, thereby allowing them to drain the funds easily.\nAt the core of the operation is a previously undocumented NFC relay technique that enables threat actors to fraudulently authorize point-of-sale (PoS) payments and Automated Teller Machine (ATM) withdrawals by intercepting and relaying NFC communications from infected devices.\nTo do this, the attackers urge the victims to bring their debit or credit card in close physical proximity to their mobile device, which then allows the SuperCard X malware to stealthily capture the transmitted card details and relay them to an external server. The harvested card information is then utilized on a threat actor-controlled device to conduct unauthorized transactions.\nThe application that's distributed to victims for capturing NFC card data is called a Reader. A similar app known as Tapper is installed on the threat actor's device to receive the card information. Communication between the Reader and Tapper is carried out using HTTP for command-and-control (C2) and requires cybercriminals to be logged in.\nAs a result, threat actors are expected to create an account within the SuperCard X platform before distributing the malicious apps, after which the victims are instructed to enter the login credentials provided to them during the phone call.\nThis step serves as a key cog in the overall attack as it establishes the link between the victim's infected device and the threat actor's Tapper instance, which then enables the card data to be relayed for subsequent cash outs. The Tapper app is also designed to emulate the victim's card using the stolen data, thus fooling PoS terminals and ATMs into recognizing it as a legitimate card.\nThe \"Reader\" malware artifacts identified by Cleafy carry subtle differences in the login screen, indicating that they are custom builds generated by affiliate actors to tailor the campaigns according to their needs. In addition, SuperCard X makes use of mutual TLS (\nmTLS\n) to secure communication with its C2 infrastructure.\nThat threat actors could deceive unsuspecting users into altering critical settings over phone calls hasn't gone unnoticed by Google, which is\nsaid to be working\non a new Android feature that effectively blocks users from installing apps from unknown sources and granting permissions to accessibility services.\nWhile there is currently no evidence that SuperCard X is distributed via the Google Play Store, users are advised to scrutinize app descriptions, permissions, and reviews before downloading them. It's also recommended to keep Google Play Protect enabled to safeguard devices against emerging threats.\n\"This novel campaign introduces a significant financial risk that extends beyond the conventional targets of banking institutions to affect payment providers and credit card issuers directly,\" the researchers said.\n\"The innovative combination of malware and NFC relay empowers attackers to perform fraudulent cash-outs with debit and credit cards. This method demonstrates high efficacy, especially when targeting contactless ATM withdrawals.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "5 Reasons Device Management Isn't Device Trust​",
        "Link": "https://thehackernews.com/2025/04/5-reasons-device-management-isnt-device.html",
        "Summary": "The problem is simple: all breaches start with initial access, and initial access comes down to two primary attack vectors – credentials and devices. This is not news; every report you can find on the threat landscape depicts the same picture.&nbsp;\n\nThe solution is more complex. For this article, we’ll focus on the device threat vector. The risk they pose is significant, which is why device",
        "Date": "2025-04-21",
        "Content": "The problem is simple: all breaches start with initial access, and initial access comes down to two primary attack vectors – credentials and devices. This is not news; every report you can find on the threat landscape depicts the same picture.\nThe solution is more complex. For this article, we'll focus on the device threat vector. The risk they pose is significant, which is why device management tools like Mobile Device Management (MDM) and Endpoint Detection and Response (EDR) are essential components of an organization's security infrastructure.\nHowever, relying solely on these tools to manage device risk actually creates a false sense of security. Instead of the blunt tools of device management, organizations are looking for solutions that deliver\ndevice trust\n. Device trust provides a comprehensive, risk-based approach to device security enforcement, closing the large gaps left behind by traditional device management solutions. Here are 5 of those limitations and how to overcome them with device trust.\n1. Zero visibility into unmanaged devices\nMDM and EDR solutions are effective for managing and securing devices that are enrolled and within the organization's control. However, they cannot provide visibility and control over unmanaged devices, such as personal laptops or phones, contractor devices, and devices used by business partners.\nUnfortunately, these devices are still accessing your corporate resources, and they are a major threat precisely because they are not company-managed. They may not adhere to the organization's security policies (no disk encryption, no local biometric, hasn't been updated in three years, etc), and you are none the wiser because you have no security footprint there, making them perfect entry points for attackers.\nHow device trust solves this problem:\nDevice trust provides coverage over all devices that are authenticating, including unmanaged, BYOD, and personal devices. The ideal way to achieve this is via a privacy-preserving, lightweight authenticator that has no remote wipe capabilities nor administrative privileges over the device. However, it should be able to capture device risk telemetry and support rapid remediation to provide risk visibility and security compliance enforcement for all devices in your fleet.\n2. Incomplete coverage across operating systems\nWhile many MDM and EDR tools offer support for popular operating systems like Windows and macOS, their coverage for Linux and ChromeOS devices is often limited in their capabilities or completely non-existent. This gap leaves organizations vulnerable, especially those that rely on diverse operating systems for their operations, such as software engineers and system administrators.\nHow device trust solves this problem:\nDevice trust delivers broad-based coverage across all commonly used operating systems, including Linux and ChromeOS. This provides administrators the ability to evaluate device risk in real-time on any device, regardless of operating system, and block access from devices that fail to meet the security threshold.\n3. Lack of integration with access policy\nMDM and EDR tools typically operate independently of access management systems, leading to a disconnect between device security posture and access controls. That is, even if your MDM or EDR flags a suspicious activity, event, or behavior from an endpoint, the signal is not available to your access management solution to make real-time decisions about the user's access to resources.\nWithout a tightly coupled integration, organizations have no ability to enforce access policies based on real-time device risk assessments collected from device management tools.\nHow device trust solves this problem:\nDevice trust puts adaptive risk policy into practice by incorporating as many signals as available as part of access decisions. If a device is non-compliant, it can be prevented from accessing company data in the first place. And if a device falls out of compliance, its access should be able to be revoked instantly.\nAs a bonus, device trust enforced via access policy does not disrupt end-user productivity by forcing automatic updates. Instead, the device risk is contained because it cannot gain access while the user or their admin takes the steps needed for remediation.\n4. Risk of device management tool misconfigurations\nConfiguration drifts happen. But misconfigurations in MDM and EDR solutions can create security blind spots, allowing threats to go undetected. These misconfigurations may result from human error, lack of expertise, or complex system requirements, and they often remain unnoticed until a security incident occurs.\nFor instance, CrowdStrike requires full disk access to be able to properly execute its detection and response functionality. Being able to evaluate not just the presence of the tool but its correct configuration is crucial to enforcing defense in depth.\nHow device trust solves this problem:\nWith a tightly coupled integration with device management solutions, device trust can ensure that not only is the tool present on the device, but all configurations are in place as intended. This provides an additional layer of security to defend against configuration drifts of security tooling.\n5. Limited ability to detect advanced threats\nMDM and EDR tools are designed to detect known threats. MDMs, in particular, offer coarse risk telemetry, with some variation across vendors. However, they give organizations no ability to identify or do anything about security risks such as:\nIdentifying specific processes or sensitive files on a device\nExistence of unencrypted SSH keys\nThird-party MacOS extensions\nEvaluate the existence of applications with known CVEs\nHow device trust solves this problem:\nDevice trust delivers fine-grained device posture evaluation. In combination with a tightly coupled integration with access management, it allows organizations to enforce device security compliance beyond the scope of what device management tools allow.\nConclusion\nIn conclusion, while device management tools are important, they are not sufficient for ensuring device security. Organizations must adopt a device trust approach that provides comprehensive visibility, cross-platform support, integration with access management, vigilant configuration management, and advanced threat detection capabilities.​\nBeyond Identity is an access management platform that delivers robust device trust capabilities. To see the platform in action,\ncontact us today for a demo\n.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "⚡ THN Weekly Recap: iOS Zero-Days, 4Chan Breach, NTLM Exploits, WhatsApp Spyware & More",
        "Link": "https://thehackernews.com/2025/04/thn-weekly-recap-ios-zero-days-4chan.html",
        "Summary": "Can a harmless click really lead to a full-blown cyberattack?\nSurprisingly, yes — and that’s exactly what we saw in last week’s activity. Hackers are getting better at hiding inside everyday actions: opening a file, running a project, or logging in like normal. No loud alerts. No obvious red flags. Just quiet entry through small gaps — like a misconfigured pipeline, a trusted browser feature,",
        "Date": "2025-04-21",
        "Content": "Can a harmless click really lead to a full-blown cyberattack?\nSurprisingly, yes — and that's exactly what we saw in last week's activity. Hackers are getting better at hiding inside everyday actions: opening a file, running a project, or logging in like normal. No loud alerts. No obvious red flags. Just quiet entry through small gaps — like a misconfigured pipeline, a trusted browser feature, or reused login tokens. These aren't just tech issues — they're habits being exploited.\nLet's walk through the biggest updates from the week and what they mean for your security.\n⚡ Threat of the Week\nRecently Patched Windows Flaw Comes Under Active Exploitation\n— A recently patched security flaw affecting\nWindows NTLM has been exploited\nby malicious actors to leak NTLM hashes or user passwords and infiltrate systems since March 19, 2025. The flaw, CVE-2025-24054 (CVSS score: 6.5), is a hash disclosure spoofing bug that was fixed by Microsoft last month as part of its Patch Tuesday updates. The security flaw is assessed to be a variant of CVE-2024-43451 (CVSS score: 6.5), which was patched by Microsoft in November 2024 and has also been weaponized in the wild in attacks targeting Ukraine and Colombia by threat actors like UAC-0194 and Blind Eagle.\nStop AI-Powered Threats and Protect Sensitive Data with Zscaler Zero Trust + AI\nCompanies need to rethink how they protect their private and public use of AI and how they defend against AI-powered attacks. Traditional firewalls, VPNs, and public-facing IPs expose your attack surface and are no match in the AI era. It's time for a modern approach with Zscaler Zero Trust + AI.\nSee Zero Trust + AI in Action ➝\n🔔 Top News\nNorth Korea Targets Crypto Developers with Fake Python Coding Challenges\n— The North Korea-linked threat actor known as Slow Pisces (aka Jade Sleet, PUKCHONG, TraderTraitor, and UNC4899) is\ntargeting\ndevelopers, particularly in the cryptocurrency sector, to deliver new stealer malware under the guise of a coding assignment. These challenges require developers to run a compromised project, infecting their systems using malware named RN Loader and RN Stealer. Jade Sleet is one of the several North Korean threat activity clusters to leverage job opportunity-themed lures as a malware distributor vector, the others being Operation Dream Job, Contagious Interview, Alluring Pisces, and Moonstone Sleet.\nMustang Panda Targets Myanmar with New Tooling\n— The China-linked threat actor known as Mustang Panda\ntargeted\nan unspecified organization in Myanmar with an updated version of its signature backdoor, TONESHELL, in addition to debuting four new attack tools: two keyloggers (PAKLOG and CorKLOG), a utility for facilitating lateral movement (StarProxy), and a driver to evade endpoint detection and response (EDR) software (SplatCloak). The findings demonstrate the continued evolution of the threat actor's tradecraft to sidestep detection.\nEuropean Diplomats Targeted in GRAPELOADER Attacks\n— The Russian state-sponsored threat actor known as APT29 has been\nattributed\nto an advanced phishing campaign that's targeting diplomatic entities across Europe with a new variant of WINELOADER and a previously unreported malware loader codenamed GRAPELOADER. The attacks involve the use of phishing emails that employ wine-tasting lures to entice message recipients into opening booby-trapped ZIP archives that lead to GRAPELOADER, a malware loader that's capable of downloading and retrieving the next stage payload.\nApple Fixes Two Actively Exploited iOS Flaws Used in Sophisticated Targeted Attacks\n— Apple has\nreleased fixes\nto address two security flaws that it said have come under active exploitation in the wild. The flaws, a memory corruption vulnerability in the Core Audio framework (CVE-2025-31200) and an unspecified vulnerability in RPAC (CVE-2025-31201), are said to have been weaponized in an \"extremely sophisticated attack against specific targeted individuals on iOS.\" However, the exact details surrounding the nature of the exploitation and who may have been targeted are not known. The issues have been addressed in iOS 18.4.1, iPadOS 18.4.1, macOS Sequoia 15.4.1, tvOS 18.4.1, and visionOS 2.4.1.\nUNC5174 Targets Linux Systems with SNOWLIGHT and VShell\n— A cyberspy crew with ties to China's Ministry of State Security has\ninfected\nglobal organizations with a stealthy remote access trojan (RAT) called VShell to enable its espionage and access resale campaigns. The attacks, attributed to UNC5174, use a mix of custom and open-source malware, including a dropper named SNOWLIGHT that paves the way for the in-memory malware VShell. Besides using VShell, UNC5174 has also used a new command-and-control infrastructure since January 2025. Primary targets of the campaign consist of U.S.-based organizations, although Hong Kong, Taiwan, Japan, Germany, and France are some of the other countries where SNOWLIGHT has been spotted. The campaign is believed to have been ongoing as far back as November 2024.\n‎️‍🔥 Trending CVEs\nAttackers love software vulnerabilities—they're easy doors into your systems. Every week brings fresh flaws, and waiting too long to patch can turn a minor oversight into a major breach. Below are this week's critical vulnerabilities you need to know about. Take a look, update your software promptly, and keep attackers locked out.\nThis week's list includes —\nCVE-2025-2492\n(ASUS),\nCVE-2025-24054\n(Microsoft Windows),\nCVE-2025-32433\n(Erlang/OTP),\nCVE-2021-20035\n(SonicWall Secure Mobile Access 100 Series),\nCVE-2025-31200, CVE-2025-31201\n(Apple iOS, iPadOS, macOS Sequoia, tvOS, and visionOS),\nCVE-2025-24859\n(Apache Roller),\nCVE-2025-1093\n(AIHub theme), and\nCVE-2025-3278\n(UrbanGo Membership plugin)\n📰 Around the Cyber World\nGoogle Makes :visited More Private\n— ​Google is finally taking steps to plug a\nlong-standing\nprivacy issue\nthat, for over 20 years,\nenabled websites\nto determine users' browsing history through the previously visited links. The side-channel attack stemmed from allowing sites to style links as \":visited,\" meaning displaying them in the color purple if a user had previously clicked on them. This caused a privacy issue in that it could be abused to leak a user's browser history, and worse, track them. However, with the release of Chrome 136 on April 23, 2025, Google is adopting what's called triple-key partitioning that uses a combination of the link URL, top-level site, and frame origin. \"With partitioning enabled, your :visited history is no longer a global list that any site can query,\" the company\nsaid\n.\nPegasus Targeted 456 Mexicans via WhatsApp 0-Day in 2019\n— NSO Group's notorious spyware Pegasus was\nused to target 1,223 WhatsApp users\nin 51 different countries during a 2019 hacking campaign, a new court document filed as part of a\nlawsuit\nfiled by WhatsApp against NSO Group. The countries with the most victims of this campaign are Mexico (456), India (100), Bahrain (82), Morocco (69), Pakistan (58), Indonesia (54), Israel (51), Uzbekistan (43), Algeria (38), and Cyprus (31). Also targeted were victims in Spain (12), the Netherlands (11), Syria (11), Hungary (8), France (7), United Kingdom (2), and the United States (1). The court document with the list of victims by country was first reported by Israeli news site CTech. What's more, a copy of a court hearing transcript obtained by TechCrunch\nfound\nthat the governments of Mexico, Saudi Arabia, and Uzbekistan were among the countries accused of being behind the 2019 hacking campaign, according to a lawyer working for the Israeli spyware maker. The development marks the first time NSO Group has publicly\nacknowledged\nits customers.\nLaw Enforcement Action Dismantles Drug Trafficking Networks\n— Authorities have\ndismantled\nfour major criminal networks responsible for fueling the flow of drugs into the European Union and Türkiye. A coordinated operation conducted by Belgium, France, Germany, the Netherlands, Spain, and Türkiye has resulted in the arrests of 232 suspects and seizures of EUR300 million worth of assets, including 681 properties and 127 vehicles. The law enforcement exercise has been codenamed Operation BULUT. \"Using both traditional smuggling routes and sophisticated logistics, the groups were linked to the seizure of at least 21 tonnes of drugs in Europe and Türkiye, including 3.3 million MDMA tablets,\" Europol said, adding the investigation was facilitated by intelligence extracted from encrypted communication platforms like\nSky ECC\nand\nANoM\n.\nMicrosoft Plans to Disable ActiveX\n— Microsoft has\nannounced\nit will begin disabling all ActiveX controls in Windows versions of Microsoft 365 and Office 2024 applications later this month to\nmitigate\nsecurity risks\nassociated with the legacy framework. \"When ActiveX controls are disabled, you will not be able to create new ActiveX objects or interact with existing ones,\" the company\nsaid\nin a support document. \"This change applies to Word, Excel, PowerPoint, and Visio.\" The tech giant also noted that attackers could use deceptive tactics to trick recipients into changing their ActiveX settings, either via phishing emails or when downloading files from the internet.\nThailand Pro-Democracy Movement Targeted by JUICYJAM\n— The pro-democracy movement in Thailand has been targeted by a \"sustained, coordinated social media harassment and doxxing campaign\" codenamed JUICYJAM since at least August 2020, the Citizen Lab has revealed. \"The operation utilized an inauthentic persona over multiple social media platforms (primarily X and Facebook) to target pro-democracy protesters by doxxing individuals, continuously harassing them, and instructing followers to report them to the police,\" the inter-disciplinary research organization\nsaid\n. \"Through our analysis of public social media posts we determined that the campaign was not only inauthentic, but the information revealed could not have been reasonably sourced from a private individual.\" The\ncampaign\nhas been attributed to the Royal Thai Armed Forces and/or the Royal Thai Police. \"JUICYJAM's tactics support a larger network of judicial harassment and democratic suppression that is infrequently enforced by social media platforms, but poses a significant threat to civil society,\" it added.\nAttackers Increasingly Shift to NTLM Relay Attacks\n— Microsoft has warned that threat actors are \"consistently\" exploiting critical vulnerabilities in Exchange Server and SharePoint Server to gain a persistent foothold inside the target, and ultimately lead to remote code execution, lateral movement, and exfiltration of sensitive data. \"More recently, attackers have shifted to NTLM relay and credential leakage techniques on Exchange,\" the company\nsaid\n. \"Attackers exploit NTLM authentication by relaying credentials to a vulnerable server, potentially resulting in target account compromise. Meanwhile, in recent attacks on SharePoint, we observed increasingly stealthy persistence tactics, such as replacing or appending web shell code into existing files and installing remote monitoring and management (RMM) tools for broader access.\"\nOpenID Connect Misconfigurations Within CI/CD Environments\n— Researchers have identified \"problematic patterns and implementations\" when it comes to the use of OpenID Connect (OIDC) within continuous integration and continuous deployment (CI/CD) environments that could be exploited by threat actors to gain access to restricted resources. These threat vectors include loosely configured policies used by identity federations, reliance on user-controllable claim values, vendor-side credential handling, and the ability to leverage poisoned pipeline execution (PPE) in combination with permissive identity federation. \"OIDC extends the OAuth protocol by adding a new token to the protocol, enabling applications to verify user identities and authorize access to resources using that token,\" Palo Alto Networks Unit 42\nsaid\n. \"It plays a crucial role in ensuring secure and seamless authentication and authorization during CI/CD processes. Securing these implementations is critical, as OIDC is rapidly being adopted as the primary foundation for modern cloud authentication workflows.\"\nScammers Pose as FBI IC3 Employees to 'Help' Recover Stolen Funds\n— The U.S. Federal Bureau of Investigation (FBI) is warning that fraudsters are impersonating FBI Internet Crime Complaint Center (IC3) employees with offers to \"help\" fraud victims recover money lost to other scammers. \"Complainants report initial contact from the scammers can vary. Some individuals received an email or a phone call, while others were approached via social media or forums,\" the agency\nsaid\n. \"Almost all complainants indicated the scammers claimed to have recovered the victim's lost funds or offered to assist in recovering funds. However, the claim is a ruse to revictimize those who have already lost money to scams.\"\n4Chan Taken Offline After Hack\n— Controversial internet forum 4chan was breached and its internal data leaked after hackers\ngained\nshell access to its hosting server, likely doxxing the entire moderation team along with many of the site's registered users. A 4chan splinter site called soyjack party, aka sharty, has\nclaimed\nresponsibility for the security breach and posted what they alleged was internal data on their rival website, including source code and information on moderators and janitors. A hacktivist group called the\nDark Storm Team\nalso\nclaimed\nto have taken down the site on its Telegram channel, alongside BreachForums (\"breachforums[.]st\"). One 4chan janitor told TechCrunch that they are \"confident\" the leaked data and screenshots are real. In a screenshot shared by Hackmanac on X, the threat actors behind the breach revealed how they managed to gain access to the site's internal systems: \"4chan allows uploading PDF to certain boards (/gd/, /po/, /qst/, /sci/, /tg/) They neglected to verify that the uploaded file is actually a PDF file. As such, PostScript files, containing PostScript drawing commands, can be uploaded. Said PostScript file will be passed into Ghostscript to generate a thumbnail image. The version of Ghostscript that 4chan uses is from 2012, so it is trivial to exploit. From there, we exploit a mistaken\nSUID\nbinary to elevate to the global user.\" The development comes as cybercrime forum Cracked.io has resumed operations under the new cracked[.]sh domain over two months after its earlier version hosted on \"cracked[.]io\" was\nseized\nin a joint law enforcement operation.\nAndroid Gets Inactivity Reboot Feature\n— Google has launched an\noptional security feature\nin Android that will automatically restart devices after three days of inactivity. After a restart, the phone (or any device that runs the operating system) enters a heightened security state called the Before First Unlock (BFU) where data is encrypted and inaccessible unless users enter the unlock pattern or PIN. The update is rolling out to users as part of an update to Google Play Services version 25.14. It's worth noting that Apple\nintroduced\na similar iPhone Inactivity Reboot feature in iOS 18.1 that triggers a device restart after three days of being locked. The changes are seen as an attempt to make it more challenging to extract data from a phone, particularly by law enforcement using forensic tools made by Cellebrite or Magnet Forensics.\nEdge Network Devices Become Magnets for Initial Access\n— Compromised network edge devices, such as firewalls, virtual private network appliances, and other access devices, account for a quarter of the initial compromises of businesses in 2024,\naccording\nto the\nSophos Annual Threat Report\n. Additionally, VPN devices were targeted for initial access in 25% of ransomware and data exfiltration events last year. Some of the top observed malware families included web shells, Cobalt Strike, Akira, Lumma Stealer, LockBit, Fog, ChromeLoader, GootLoader, RansomHub, and Black Basta. \"One trend that continues from previous years is the extensive use of generally available commercial, freeware, and open-source software by cybercriminals to conduct ransomware attacks and other malicious activity,\" Sophos said. \"Dual-use tools are different from living-off-the-land binaries (LOLBins) in that they are full applications deployed and used as intended by malicious actors, rather than operating system-supplied components and scripting engines.\" Some of the top dual-use tools comprised SoftPerfect Network Scanner, PsExec, AnyDesk, Impacket, RDPclip, and Mimikatz.\nPRODAFT Plans to Buy Hacker Forum Accounts to Spy on Cyber Criminals\n— Cyber threat intelligence firm PRODAFT is encouraging users to cybercrime-focused dark web forums like XSS, Exploit.in, RAMP4U, Verified, and BreachForums to turn over a new leaf and sell their accounts in exchange for a cryptocurrency payment as part of an initiative called\nSell your Source\n. The move goes beyond buying forum accounts to stealthily see what's happening in the\ncriminal underground\n. Users of these forums can also anonymously report a cybercrime if it's something that's unethical or against their values. \"In a world of deception, we make 'trust' the ultimate weapon by turning hackers into whistleblowers,\" said Can Yildizli, CEO of PRODAFT, in a statement shared with The Hacker News. However, it bears noting that only accounts created before December 2022 that aren't on the FBI's Most Wanted list will be considered. While the account transfer process is anonymous, PRODAFT will report account purchases to law enforcement authorities. The move is also meant to introduce a layer of psychological warfare, adding some level of uncertainty and paranoia when cybercriminals work with their counterparts, who may or may not be working with PRODAFT. \"It could change the way that cybercriminals operate on the dark web and help to erode the loyalty between them,\" the company added. \"It remains to be seen whether dark web forums will introduce stricter vetting processes, new detection tools, or sweeping rules to ban old accounts in response.\"\nIranian National Charged in Connection With Nemesis Dark Web Marketplace\n— The U.S. Department of Justice announced that Iranian national Behrouz Parsarad, 36, has been charged for his alleged role as the founder and operator of the Nemesis dark web marketplace. The website facilitated the sale of drugs and cybercrime services between 2021 and 2024, when it was disrupted by law enforcement. \"At its peak, Nemesis Market had over 150,000 users and more than 1,100 vendor accounts registered worldwide,\" the DoJ\nsaid\n. \"Between 2021 and 2024, Nemesis Market processed more than 400,000 orders.\" Parsarad was\nsanctioned\nby the U.S. Treasury Department last month for running Nemesis. If convicted, Parsarad faces a mandatory minimum penalty of 10 years in federal prison and a maximum penalty of life.\n83 Flaws Discovered in Vason Print\n— As many as 83 vulnerabilities have been\ndisclosed\nin the Vason Print (formerly PrinterLogic) enterprise printer management solution that could allow an attacker to compromise instances, bypass authentication, facilitate lateral movement to clients, and achieve remote code execution. These vulnerabilities, which affect Windows, Linux/macOS, VA, and SaaS client versions, were reported between 2021 and 2024 by security researcher Pierre Barre.\n35 Countries Use Chinese Networks for Routing Mobile User Traffic\n— U.S. allies like Japan, South Korea, and New Zealand are among the 35 countries where mobile providers employ China-based networks, including China Mobile International, China Telecom Global, China Unicom Global, CITIC Telecom International, and PCCW Global Hong Kong, for routing sensitive mobile traffic, opening travelers and residents in those nations to potential surveillance. \"Although these providers play an important role in the global mobile ecosystem, they also introduce significant risks due to their transport of unencrypted signaling protocols like SS7 and Diameter, coupled with concerns stemming from state ownership and control,\" iVerify\nsaid\n. \"A major issue lies in the fact that these providers operate under the direction of the Chinese government, raising the risk of global surveillance, data interception, and exploitation for state-sponsored cyber espionage.\"\nSheByte Phishing-as-a-Service (PhaaS) Exposed\n— Last year, LabHost\nsuffered\na major blow when its infrastructure was disrupted and 37 individuals were arrested as part of a law enforcement operation. But the void left by the PhaaS has been filled by yet another service dubbed SheByte since mid-June 2024. \"SheByte initially offered many of the same features LabHost did, establishing themselves as the logical next platform for customers needing to find a new service,\" Fortra\nsaid\n. \"SheByte has proudly claimed that the operation is run by a single developer. Additionally, SheByte claims to keep no logs and use complete end-to-end encryption of stolen information.\" The service is offered for $199 a month, with customizable phishing pages available for 17 Canadian banks, 4 U.S.-based banks, email providers, telecom companies, toll road collections, and crypto services. The premium membership also grants customers access to the platform's LiveRAT admin dashboard which functions similarly to LabRAT, allowing them to monitor site visits in real-time. The development comes as a 24-year-old Huddersfield man, Zak Coyne, was\nsentenced\nin the U.K. to eight-and-a-half years in prison for his role in creating, operating, and administering the\nLabHost service\n, which was used by more than 2,000 criminals to defraud victims all over the world.\nSSL/TLS Certificate Lifespans to Fall to 47 Days by 2029\n— The Certification Authority Browser Forum (CA/Browser Forum), a consortium of certification authorities, web browser vendors, and others, has unanimously\nvoted\nto reduce the lifespan of new SSL/TLS certificates to 47 days over the next four years, down from the current time period of 398 days. From March 15, 2026, the lifespan of certificates and their Domain Control Validation (DCV) will be cut down to 200 days. On March 15, 2027, it will shrink to 100 days. By March 15, 2029, new SSL/TLS certificates will last only 47 days. The shorter certificate renewal is seen as an effort to \"protect private keys from being compromised by limiting the time they are exposed to potential threats, ultimately reducing the risk of man-in-the-middle attacks and data breaches,\" Sectigo\nsaid\n.\nMobile Apps Fail Basic Security Measures\n— An analysis of 54,648 work apps (9,078 for Android and 45,570 for iOS) from official app stores has uncovered several security risks, with 103 Android apps using unprotected or misconfigured cloud storage. Ten other Android apps have been found containing exposed credentials to AWS cloud services. \"88% of all apps and 43% of the top 100 use one or more cryptographic methods that don't follow best practices,\" Zimperium\nsaid\n. This included hard-coded cryptographic keys, the use of outdated algorithms like MD2, insecure random number generators, and the reuse of cryptographic keys. These security failures could allow attackers to intercept, decrypt, and gain unauthorized access to sensitive enterprise data.\nMicrosoft Uses AI to Find flaws in GRUB2, U-Boot, Barebox Bootloaders\n— Microsoft said it leveraged Microsoft Security Copilot to uncover several vulnerabilities in multiple open-source bootloaders like GRUB2, U-boot, and Barebox that could allow threat actors to gain and execute arbitrary code. \"While threat actors would likely require physical device access to exploit the U-boot or Barebox vulnerabilities, in the case of GRUB2, the vulnerabilities could further be exploited to bypass Secure Boot and install stealthy bootkits or potentially bypass other security mechanisms, such as BitLocker,\" Microsoft researcher Jonathan Bar Or\nsaid\n. Bootkits can have serious security implications as they can grant threat actors complete control over the device and result in persistent malware that remains intact even after an operating system reinstallation or a hard drive replacement. Following responsible disclosure, the issues have been addressed as of February 2025.\n🎥 Cybersecurity Webinars\nAI-Powered Impersonation Is Beating MFA—Here's How to Shut the Door on Identity-Based Attacks\n— AI-driven impersonation is making traditional MFA useless—and attackers are getting in without ever stealing a password. In this session, you'll learn how to stop identity-based attacks before they start, using real-time verification, access checks, and advanced deepfake detection. From account takeover prevention to AI-powered identity proofing, see how modern defenses can shut the door on imposters. Join the webinar to see it in action.\nSmart AI Agents Need Smarter Security—Here's How to Start\n— AI agents are helping teams move faster—but without the right security, they can expose sensitive data or be manipulated by attackers. This session walks you through how to build AI agents securely, with practical steps, key controls, and overlooked risks you need to know. Learn how to reduce exposure without losing productivity, and keep your AI tools safe, reliable, and under control. Register now to start securing your AI the right way.\n🔧 Cybersecurity Tools\ndAWShund\n— AWS has powerful tools for managing cloud security — but those same tools can be misused if not closely monitored. dAWShund is a Python framework that helps security teams find, check, and map AWS permissions across accounts and regions. It's made up of three tools: one to list resources and policies, one to test what actions are allowed, and one to visualize it all using graphs. Whether you're on defense or offense, dAWShund helps you spot risky access before attackers do.\nTirreno\n— It is an open-source fraud prevention tool you can host yourself. Built with PHP and PostgreSQL, it helps you monitor user activity and spot suspicious behavior across websites, apps, SaaS platforms, and online communities. From stopping fake signups and bot traffic to flagging high-risk merchants, Tirreno gives you real-time analytics and smart risk signals — all with a quick 5-minute setup on your own server.\n🔒 Tip of the Week\nStop Spam Before It Starts: Use Burner Emails the Smart Way\n— Most people use the same email everywhere — but when one company leaks or sells your address, your inbox starts filling with spam or phishing emails. A smarter way is to use a burner email system, where you give each company a unique email like netflix@yourdomain.com. To do this, buy a cheap domain (like myaliashub.com) and set up free forwarding with services like ImprovMX or SimpleLogin. Every email sent to any name on that domain will land in your main inbox. If one starts getting spam, just delete or block it — problem solved, no need to change your real email.\nIf you use Gmail, you can add +something after your name, like alex+uber@gmail.com, and Gmail will still deliver it. This helps you track who shared your email and set filters, but it's not very private since your real email is still visible. Some websites also block + emails. A better long-term option is to connect a custom domain to Gmail through Google Workspace, which gives you real aliases like shop@yourdomain.com with full control and spam filtering.\nApple users can use Hide My Email (built into iOS and macOS). It creates a random email like x2k4@privaterelay.appleid.com for each website, and forwards messages to your iCloud inbox. You can disable or delete these anytime. It's great for signups, subscriptions, or trials where you don't want to share your real email. For even more control, Apple lets you use custom domains too. These tools help you stay organized, stop spam early, and quickly trace any leaks — all without needing to change your main email ever again.\nConclusion\nThis week made it clear: attackers aren't just hunting for big holes — they're slipping through tiny cracks we barely notice. An outdated security setting. A forgotten endpoint. A tool used slightly out of spec. And just like that, they're in. We're seeing more cases where the compromise isn't about breaking in — it's about being invited in by accident. As systems grow more connected and automated, even the smallest misstep can open a big door.\nStay sharp, stay curious — and double-check the things you think are \"too minor to matter.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Hackers Abuse Russian Bulletproof Host Proton66 for Global Attacks and Malware Delivery",
        "Link": "https://thehackernews.com/2025/04/hackers-abuse-russian-bulletproof-host.html",
        "Summary": "Cybersecurity researchers have disclosed a surge in \"mass scanning, credential brute-forcing, and exploitation attempts\" originating from IP addresses associated with a Russian bulletproof hosting service provider named Proton66.\nThe activity, detected since January 8, 2025, targeted organizations worldwide, according to a two-part analysis published by Trustwave SpiderLabs last week.&nbsp;\n\"Net",
        "Date": "2025-04-21",
        "Content": "Cybersecurity researchers have disclosed a surge in \"mass scanning, credential brute-forcing, and exploitation attempts\" originating from IP addresses associated with a Russian bulletproof hosting service provider named\nProton66\n.\nThe activity, detected since January 8, 2025, targeted organizations worldwide, according to a two-part analysis published by Trustwave SpiderLabs last week.\n\"Net blocks 45.135.232.0/24 and 45.140.17.0/24 were particularly active in terms of mass scanning and brute-force attempts,\" security researchers Pawel Knapczyk and Dawid Nesterowicz\nsaid\n. \"Several of the offending IP addresses were not previously seen to be involved in malicious activity or were inactive for over two years.\"\nThe Russian autonomous system Proton66 is\nassessed\nto be linked to another autonomous system named PROSPERO. Last year, French security firm Intrinsec detailed their connections to bulletproof services marketed on Russian cybercrime forums under the names Securehost and BEARHOST.\nSeveral malware families, including GootLoader and SpyNote, have hosted their command-and-control (C2) servers and phishing pages on Proton66. Earlier this February, security journalist Brian Krebs\nrevealed\nthat Prospero has begun routing its operations through networks run by Russian antivirus vendor Kaspersky Lab in Moscow.\nHowever, Kaspersky denied it has worked with Prospero and that the \"routing through networks operated by Kaspersky doesn't by default mean provision of the company's services, as Kaspersky's automatic system (AS) path might appear as a technical prefix in the network of telecom providers the company works with and provides its DDoS services.\"\nTrustwave's latest analysis has revealed that the malicious requests originating from one of Proton66 net blocks (193.143.1[.]65) in February 2025 attempted to exploit some of the most recent critical vulnerabilities -\nCVE-2025-0108\n- An authentication bypass vulnerability in the Palo Alto Networks PAN-OS software\nCVE-2024-41713\n- An insufficient input validation vulnerability in the NuPoint Unified Messaging (NPM) component of Mitel MiCollab\nCVE-2024-10914\n- A command injection vulnerability D-Link NAS\nCVE-2024-55591 & CVE-2025-24472\n- Authentication bypass vulnerabilities in Fortinet FortiOS\nIt's worth noting that the exploitation of the two Fortinet FortiOS flaws has been attributed to an initial access broker dubbed Mora_001, which has been observed delivering a new ransomware strain called SuperBlack.\nThe cybersecurity firm said it also observed several malware campaigns linked to Proton66 that are designed to distribute malware families like\nXWorm\n,\nStrelaStealer\n, and a ransomware named WeaXor.\nAnother notable activity concerns the use of compromised WordPress websites related to the Proton66-linked IP address \"91.212.166[.]21\" to redirect Android device users to phishing pages that mimic Google Play app listings and trick users into downloading malicious APK files.\nThe redirections are facilitated by means of malicious JavaScript hosted on the Proton66 IP address. Analysis of the fake Play Store domain names indicate that the campaign is designed to target French, Spanish, and Greek speaking users.\n\"The redirector scripts are obfuscated and perform several checks against the victim, such as excluding crawlers and VPN or proxy users,\" the researchers\nexplained\n. \"User IP is obtained through a query to ipify.org, then the presence of a VPN on the proxy is verified through a subsequent query to ipinfo.io. Ultimately, the redirection occurs only if an Android browser is found.\"\nAlso hosted in one of the Proton66 IP addresses is a ZIP archive that leads to the deployment of the XWorm malware, specifically singling out Korean-speaking chat room users using social engineering schemes.\nThe first stage of the attack is a Windows Shortcut (LNK) that executes a PowerShell command, which then runs a Visual Basic Script that, in turn, downloads a Base64-encoded .NET DLL from the same IP address. The DLL proceeds to download and load the XWorm binary.\nProton66-linked infrastructure has also been used to\nfacilitate\na phishing email campaign targeting German speaking users with StrelaStealer, an information stealer that communicates with an IP address (193.143.1[.]205) for C2.\nLast but not least, WeaXor ransomware artifacts – a revised version of\nMallox\n– have been found contacting a C2 server in the Proton66 network (\"193.143.1[.]139\").\nOrganizations are advised to block all the Classless Inter-Domain Routing (CIDR) ranges associated with Proton66 and Chang Way Technologies, a likely related Hong Kong-based provider, to neutralize potential threats.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft Entra account lockouts caused by user token logging mishap",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-entra-account-lockouts-caused-by-user-token-logging-mishap/",
        "Summary": "Microsoft confirms that the weekend Entra account lockouts were caused by the invalidation of short-lived user refresh tokens that were mistakenly logged into internal systems. [...]",
        "Date": "2025-04-21",
        "Content": "Microsoft confirms that the weekend Entra account lockouts were caused by the invalidation of short-lived user refresh tokens that were mistakenly logged into internal systems.\nOn Saturday morning, numerous organizations reported that they began receiving\nMicrosoft Entra alerts that accounts had leaked credentials\n, causing the accounts to be locked out automatically.\nImpacted customers initially thought the account lockouts were tied to the rollout of a new enterprise application called \"MACE Credential Revocation,\" installed minutes before the alerts were issued.\nHowever, an admin for one of the impacted organizations shared an advisory sent by Microsoft stating that the issue was caused by the company mistakenly logging the impacted account's user refresh tokens rather than just their metadata.\nAfter realizing they logged actual account tokens, they began invalidating them, which accidentally generated the alerts and lockouts.\n\"On Friday 4/18/25, Microsoft identified that it was internally logging a subset of short-lived user refresh tokens for a small percentage of users, whereas our standard logging process is to only log metadata about such tokens,\" reads an advisory from Microsoft\nposted on Reddit\n.\n\"The internal logging issue was immediately corrected, and the team performed a procedure to invalidate these tokens to protect customers.  As part of the invalidation process, we inadvertently generated alerts in Entra ID Protection indicating the user's credentials may have been compromised.\"\n\"These alerts were sent between 4/20/25 4AM UTC and 4/20/25 9AM UTC. We have no indication of unauthorized access to these tokens – and if we determine there were any unauthorized access, we will invoke our standard security incident response and communication processes.\"\nMicrosoft says impacted customers can give the \"\nConfirm User Safe\n\" feedback in Microsoft Entra for the flagged user to restore access to their accounts.\nThe company says they will publish a Post Incident Review (PIR) after the investigation is finished, which will be shared with all impacted customers.\nBleepingComputer also contacted Microsoft on Saturday but has not yet received a reply to our questions about the incident.\nRelated Articles:\nWidespread Microsoft Entra lockouts tied to new security feature rollout\nMicrosoft Office 2019 Will Work on Windows 10 Exclusively\nMicrosoft: Some devices offered Windows 11 upgrades despite Intune blocks\nGet this open-box Microsoft Surface SE laptop for just $189.99 in this deal\nMicrosoft: Outdated Exchange servers fail to auto-mitigate security bugs"
    },
    {
        "Title": "WordPress ad-fraud plugins generated 1.4 billion ad requests per day",
        "Link": "https://www.bleepingcomputer.com/news/security/scallywag-ad-fraud-operation-generated-14-billion-ad-requests-per-day/",
        "Summary": "A large-scale ad fraud operation called 'Scallywag' is monetizing pirating and URL shortening sites through specially crafted WordPress plugins that generate billions of daily fraudulent requests. [...]",
        "Date": "2025-04-21",
        "Content": "A large-scale ad fraud operation called 'Scallywag' is monetizing pirating and URL shortening sites through specially crafted WordPress plugins that generate billions of daily fraudulent requests.\nScallywag was uncovered by bot and fraud detection firm HUMAN, which mapped a network of 407 domains supporting the operation that peaked at 1.4 billion fraudulent ad requests per day.\nHUMAN's efforts to block and report Scallywag traffic have resulted in its\nshrinking by 95%\n, although the threat actors have shown resilience by rotating domains and moving to other monetization models.\nBuilt around WordPress ad fraud plugins\nLegitimate ad providers avoid pirating and URL shortening sites due to legal risks, brand safety concerns, ad fraud, and lack of quality content.\nScallywag is a fraud-as-a-service operation built around four WordPress plugins that help cybercriminals generate money from risky and low-quality sites.\nThe WordPress plugins created by the operation are Soralink (released in 2016), Yu Idea (2017), WPSafeLink (2020), and Droplink (2022).\nHuman says multiple independent threat actors buy and use these WordPress plugins to set up their own ad fraud schemes, with some even posting tutorials on YouTube on how exactly to do it.\n\"These extensions lower the barrier to entry for a would-be threat actor who wants to monetize content that wouldn't generally be monetizable with advertising; indeed, several threat actors have published videos to coach others on setting up their own schemes,\" explains HUMAN.\nDroplink is the only exception to the sales model, as it's available for free by performing various money-making steps for the sellers.\nUsers visiting piracy catalog sites to find movies or premium software click on embedded URL-shortened links and are redirected through the operation's cashout infrastructure.\nPiracy catalog sites that can't directly host ads aren't necessarily run by Scallywag actors. Instead, their operators form a 'gray partnership' with ad fraudsters to outsource monetization.\nPiracy site (left) linking to Scallywag site (right)\nSource: HUMAN\nThe redirection process takes the visitor through intermediary, ad-heavy pages that generate fraudulent impressions for the Scallywag operators, and end up on a page hosting the promised content (software or movie).\nThe intermediary sites are WordPress sites running the Scallywag add-ons. Those handle the redirect logic, loading of ads, CAPTCHA, timer, and the cloaking mechanism, which shows a clean blog on ad platform checks.​\nScallywag's operational overview\nSource: HUMAN\nDisrupting Scallywag\nHUMAN detected Scallywag activity by analyzing traffic patterns across their partner network, such as high ad impression volume from seemingly benign WordPress blogs, cloaking behavior, and forced wait times or CAPTCHA interaction before redirection.\nSame site visited directly (left) and visited through URL-shortener (right)\nSource: HUMAN\nSubsequently, it classified the network as fraudulent, working with ad providers to stop the bidding on ad requests and cutting Scallywag's revenue stream.\nIn rsponse, the Scallywag actors tried to evade detection using new cashout domains and open redirect chains to hide the real referrer, but HUMAN says they detected and blocked those, too.\nScallywag ad requests over time\nSource: HUMAN\nAs a result, Scallywag's daily ad fraud traffic dropped sharply from 1.4 billion to nearly zero, with many affiliates abandoning the method and moving on to other scams.\nAlthough the Scallywag ecosystem has economically collapsed, its operators will likely continue trying to evade the mitigations and return to profits.\nRelated Articles:\nMalware campaign 'DollyWay' breached 20,000 WordPress sites\nFBI: Scammers pose as FBI IC3 employees to 'help' recover lost funds\nHackers exploit WordPress plugin auth bypass hours after disclosure\nHackers abuse WordPress MU-Plugins to hide malicious code\nThe 4 WordPress flaws hackers targeted the most in Q1 2025"
    },
    {
        "Title": "'Fog' Hackers Troll Victims With DOGE Ransom Notes",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/fog-hackers-doge-ransom-notes",
        "Summary": "Since January, threat actors distributing the malware have notched up more than 100 victims.",
        "Date": "2025-04-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/fog-hackers-doge-ransom-notes"
    },
    {
        "Title": "'Elusive Comet' Attackers Use Zoom to Swindle Victims",
        "Link": "https://www.darkreading.com/remote-workforce/elusive-comet-zoom-victims",
        "Summary": "The threat actor uses sophisticated social engineering techniques to infect a victim's device, either with an infostealer or remote access Trojan (RAT).",
        "Date": "2025-04-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/elusive-comet-zoom-victims"
    },
    {
        "Title": "Nation-State Threats Put SMBs in Their Sights",
        "Link": "https://www.darkreading.com/threat-intelligence/nation-state-threats-smb",
        "Summary": "Cyberthreat groups increasingly see small and medium-sized businesses, especially those with links to larger businesses, as the weak link in the supply chain for software and IT services.",
        "Date": "2025-04-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/nation-state-threats-smb"
    },
    {
        "Title": "Can Cybersecurity Weather the Current Economic Chaos?",
        "Link": "https://www.darkreading.com/cloud-security/cybersecurity-weather-current-economic-chaos",
        "Summary": "Cybersecurity firms tend to be more software- and service-oriented than their peers, and threats tend to increase during a downturn, leaving analysts hopeful that the industry will buck a recession.",
        "Date": "2025-04-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/cybersecurity-weather-current-economic-chaos"
    },
    {
        "Title": "ASUS Urges Users to Patch AiCloud Router Vuln Immediately",
        "Link": "https://www.darkreading.com/cloud-security/asus-patch-aicloud-router-vuln",
        "Summary": "The vulnerability is only found in the vendor's router series and can be triggered by an attacker using a crafted request — all of which helps make it a highly critical vulnerability with a 9.2 CVSS score.",
        "Date": "2025-04-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/asus-patch-aicloud-router-vuln"
    },
    {
        "Title": "The Global AI Race: Balancing Innovation and Security",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/global-ai-race-balancing-innovation-security",
        "Summary": "The AI security race is on — and it will be won where defenders come together with developers and researchers to do things right.",
        "Date": "2025-04-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/global-ai-race-balancing-innovation-security"
    },
    {
        "Title": "Microsoft Purges Dormant Azure Tenants, Rotates Keys to Prevent Repeat Nation-State Hack",
        "Link": "https://www.securityweek.com/microsoft-purges-dormant-azure-tenants-rotates-keys-to-prevent-repeat-nation-state-hack/",
        "Summary": "<p>Microsoft security chief Charlie Bell says the SFI's 28 objectives are “near completion” and that 11 others have made “significant progress.”</p>\n<p>The post <a href=\"https://www.securityweek.com/microsoft-purges-dormant-azure-tenants-rotates-keys-to-prevent-repeat-nation-state-hack/\">Microsoft Purges Dormant Azure Tenants, Rotates Keys to Prevent Repeat Nation-State Hack </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/microsoft-purges-dormant-azure-tenants-rotates-keys-to-prevent-repeat-nation-state-hack/"
    },
    {
        "Title": "Industry Moves for the week of April 21, 2025 - SecurityWeek",
        "Link": "https://www.securityweek.com/industry-moves/apr-21-2025/",
        "Summary": "Explore industry moves and significant changes in the industry for the week of April 21, 2025. Stay updated with the latest industry trends and shifts.",
        "Date": "2025-04-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/industry-moves/apr-21-2025/"
    },
    {
        "Title": "North Korean Cryptocurrency Thieves Caught Hijacking Zoom ‘Remote Control’ Feature",
        "Link": "https://www.securityweek.com/north-korean-cryptocurrency-thieves-caught-hijacking-zoom-remote-control-feature/",
        "Summary": "<p>North Korean cryptocurrency thieves abusing Zoom Remote collaboration feature to target cryptocurrency traders with malware.</p>\n<p>The post <a href=\"https://www.securityweek.com/north-korean-cryptocurrency-thieves-caught-hijacking-zoom-remote-control-feature/\">North Korean Cryptocurrency Thieves Caught Hijacking Zoom ‘Remote Control’ Feature</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/north-korean-cryptocurrency-thieves-caught-hijacking-zoom-remote-control-feature/"
    },
    {
        "Title": "Exaforce Banks Hefty $75 Million for AI-Powered SOC Remake",
        "Link": "https://www.securityweek.com/exaforce-banks-hefty-75-million-for-ai-powered-soc-remake/",
        "Summary": "<p>San Francisco startup closes a hefty $75 million Series A funding round led by Khosla Ventures and Mayfield.</p>\n<p>The post <a href=\"https://www.securityweek.com/exaforce-banks-hefty-75-million-for-ai-powered-soc-remake/\">Exaforce Banks Hefty $75 Million for AI-Powered SOC Remake</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/exaforce-banks-hefty-75-million-for-ai-powered-soc-remake/"
    },
    {
        "Title": "Kenzo Security Raises $4.5 Million for Agentic AI Security Operations Platform",
        "Link": "https://www.securityweek.com/kenzo-security-raises-4-5-million-for-agentic-ai-security-operations-platform/",
        "Summary": "<p>Kenzo Security has emerged from stealth mode after 18 months of developing its agentic AI security platform.</p>\n<p>The post <a href=\"https://www.securityweek.com/kenzo-security-raises-4-5-million-for-agentic-ai-security-operations-platform/\">Kenzo Security Raises $4.5 Million for Agentic AI Security Operations Platform</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/kenzo-security-raises-4-5-million-for-agentic-ai-security-operations-platform/"
    },
    {
        "Title": "Bot Traffic Surpasses Humans Online—Driven by AI and Criminal Innovation",
        "Link": "https://www.securityweek.com/bot-traffic-surpasses-humans-online-driven-by-ai-and-criminal-innovation/",
        "Summary": "<p>With 51% of internet traffic now bot-driven and a growing share of it malicious, organizations must prepare for an era of more evasive, AI-assisted automation.</p>\n<p>The post <a href=\"https://www.securityweek.com/bot-traffic-surpasses-humans-online-driven-by-ai-and-criminal-innovation/\">Bot Traffic Surpasses Humans Online—Driven by AI and Criminal Innovation</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/bot-traffic-surpasses-humans-online-driven-by-ai-and-criminal-innovation/"
    },
    {
        "Title": "Countries Shore Up Their Digital Defenses as Global Tensions Raise the Threat of Cyberwarfare",
        "Link": "https://www.securityweek.com/countries-shore-up-their-digital-defenses-as-global-tensions-raise-the-threat-of-cyberwarfare/",
        "Summary": "<p>Countries around the world are preparing for greater digital conflict as increasing global tensions and a looming trade war have raised the stakes.</p>\n<p>The post <a href=\"https://www.securityweek.com/countries-shore-up-their-digital-defenses-as-global-tensions-raise-the-threat-of-cyberwarfare/\">Countries Shore Up Their Digital Defenses as Global Tensions Raise the Threat of Cyberwarfare</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/countries-shore-up-their-digital-defenses-as-global-tensions-raise-the-threat-of-cyberwarfare/"
    },
    {
        "Title": "Lantronix Device Used in Critical Infrastructure Exposes Systems to Remote Hacking",
        "Link": "https://www.securityweek.com/lantronix-device-used-in-critical-infrastructure-exposes-systems-to-remote-hacking/",
        "Summary": "<p>Lantronix’s XPort device is affected by a critical vulnerability that can be used for takeover and disruption, including in the energy sector.</p>\n<p>The post <a href=\"https://www.securityweek.com/lantronix-device-used-in-critical-infrastructure-exposes-systems-to-remote-hacking/\">Lantronix Device Used in Critical Infrastructure Exposes Systems to Remote Hacking</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/lantronix-device-used-in-critical-infrastructure-exposes-systems-to-remote-hacking/"
    }
]