[
    {
        "Title": "E-ZPass toll payment texts return in massive phishing wave",
        "Link": "https://www.bleepingcomputer.com/news/security/toll-payment-text-scam-returns-in-massive-phishing-wave/",
        "Summary": "An ongoing phishing campaign impersonating E-ZPass and other toll agencies has surged recently, with recipients receiving multiple iMessage and SMS texts to steal personal and credit card information. [...]",
        "Date": "2025-04-06",
        "Content": "An ongoing phishing campaign impersonating E-ZPass and other toll agencies has surged recently, with recipients receiving multiple iMessage and SMS texts to steal personal and credit card information.\nThe messages embed links that, if clicked, take the victim to a phishing site impersonating E-ZPass, The Toll Roads, FasTrak, Florida Turnpike, or another toll authority that attempts to steal their personal information including names, email addresses, physical addresses, and credit card information.\nThis scam is not new, with the\nFBI warning about it in April 2024\n, but BleepingComputer has seen and received multiple reports of a surge in this mobile phishing campaign.\nThe text messages bypass anti-spam measures and come from seemingly random email addresses, which, combined with the scale of the attack, indicate an automated attack.\nScam texts seen by BleepingComputer pretend to be directly from E-ZPass or the Department of Motor Vehicles. The texts use language that contains a sense of urgency, like the toll needs to be paid in a day or two, or there will be an additional fee, or licenses will be suspended.\n\"Your toll payment for E-ZPass Lane must be settled by April 4, 2025. To avoid fines and the suspension of your driving privileges, kindly pay by the due date,\" reads an example scam text seen by BleepingComputer.\nPhishing text message samples from the campaign\nSource: BleepingComputer\nApple iMessage\nautomatically turns off links\nin messages from unknown senders to protect users from SMS phishing scams. To bypass this, the scammers tell users to reply to the text, which will make the links clickable.\nTapping on the provided link takes the victim to an E-ZPass phishing site, which, other than the URL, looks like a legitimate site. BleepingComputer tests determined that the phishing website only loads on the mobile, so desktop users will not see it.\nThe phishing page victims land on\nSource: BleepingComputer\nThe volume of texts being sent in this scam is so large that users have been\nexpressing\ntheir frustration over\nthe frequency\nand persistence of the particular scam attempts, sometimes reaching up to 7 messages in a day.\nAlthough the origin of the messages hasn't been determined yet, we recently reported on an emerging phishing-as-a-service platform named\nLucid\n, which has been linked to these types of scams.\nPlatforms like Lucid and\nDarcula\nuse encrypted iMessage and RCS messages to bypass traditional anti-spam filters and send large volumes of text without incurring the costs associated with standard SMS delivery.\nIf you receive one of these messages, you should block and report the number so that the email address or phone number is reported to Apple. However, as a general rule, you should avoid responding to these scams as they put you on the radar of the scammers for future attempts.\nFor those concerned that they have legitimate outstanding payments, you should instead log in to your toll authority's site directly to check for any balances.\nThe FBI has previously advised recipients to file a complaint at the\nIC3 portal\n.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nPolice arrests 300 suspects linked to African cybercrime rings\nGoogle expands Android AI scam detection to more Pixel devices\nPoisonSeed phishing campaign behind emails with wallet seed phrases\nVerizon Call Filter API flaw exposed customers' incoming call history\nApple backports zero-day patches to older iPhones and Macs"
    },
    {
        "Title": "OpenAI tests watermarking for ChatGPT-4o Image Generation model",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-tests-watermarking-for-chatgpt-4o-image-generation-model/",
        "Summary": "OpenAI is reportedly testing a new \"watermark\" for the Image Generation model, which is a part of the ChatGPT 4o model. [...]",
        "Date": "2025-04-06",
        "Content": "OpenAI is reportedly testing a new \"watermark\" for the Image Generation model, which is a part of the ChatGPT 4o model.\nThis is an interesting move, and it's likely because more and more users are generating Studio Ghibli artwork using the ImageGen model.\nIn fact, ChatGPT is in the news largely due to the Image Generation model, which is the most advanced multi-model shipped to date.\nStudio Ghibli artwork generated using ChatGPT\nSource: BleepingComputer\nNot only can it accurately generate images with texts, but it also allows you to create realistic visuals, such as art produced by Studio Ghibli, a famous and big name in the Japanese studio world.\nChatGPT's ImageGen model was previously limited to paid users (\nChatGPT Plus\ncustomers), but it has now rolled out to everyone, including those with a free subscription.\nAs\nspotted\nby AI researcher Tibor Blaho, it looks like OpenAI is working on a new \"ImageGen\" watermark for free users.\nMy sources also told me that OpenAI recently started testing watermarks for images generated using ChatGPT's free account.\nIf you subscribe to ChatGPT Plus, you'll be able to save images without the watermark.\nHowever, it's unclear if OpenAI will move ahead with its plans to watermark images. Plans at OpenAI are always subject to change.\nImageGen is a powerful model, API coming soon\nIn a\nblog post\n, OpenAI previously noted that it trained the model on a large set of images and texts, which is why the image generation is not only beautiful but useful.\n\"We trained our models on the joint distribution of online images and text, learning not just how images relate to language, but how they relate to each other,\" OpenAI noted.\n\"Combined with aggressive post-training, the resulting model has surprising visual fluency, capable of generating images that are useful, consistent, and context-aware.\"\nOpenAI has also\nconfirmed\nthat it's working on an ImageGen API, so developers can build their own products.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nOpenAI's $20 ChatGPT Plus is now free for students until the end of May\nChatGPT is down worldwide with something went wrong error\nOpenAI says Deep Research is coming to ChatGPT free \"very soon\"\nOpenAI's GPT 4.5 spotted in Android beta, launch imminent\nOpenAI bans ChatGPT accounts used by North Korean hackers"
    },
    {
        "Title": "Carding tool abusing WooCommerce API downloaded 34K times on PyPI",
        "Link": "https://www.bleepingcomputer.com/news/security/carding-tool-abusing-woocommerce-api-downloaded-34k-times-on-pypi/",
        "Summary": "A newly discovered malicious PyPi package named 'disgrasya' that abuses legitimate WooCommerce stores for validating stolen credit cards has been downloaded over 34,000 times from the open-source package platform. [...]",
        "Date": "2025-04-06",
        "Content": "A newly discovered malicious PyPi package named 'disgrasya' that abuses legitimate WooCommerce stores for validating stolen credit cards has been downloaded over 34,000 times from the open-source package platform.\nThe script specifically targeted WooCommerce stores using the CyberSource payment gateway to validate cards, which is a key step for carding actors who need to evaluate thousands of stolen cards from dark web dumps and leaked databases to determine their value and potential exploitation.\nAlthough the package has been removed from PyPI, its high download counts show the sheer volume of abuse for these types of malicious operations.\n\"Unlike typical supply chain attacks that rely on deception or typosquatting, disgrasya made no attempt to appear legitimate,\"\nexplains a report by Socket researchers\n.\n\"It was openly malicious, abusing PyPI as a distribution channel to reach a wider audience of fraudsters.\"\nOf particular interest is the brazen abuse of PyPi to host a package that the creators clearly stated in the description was used for malicious activity.\n\"A utility for checking credit cards through multiple gateways using multi-threading and proxies,\" read the disgrasya package description.\nSocket notes that the malicious functionality on the package was introduced in version 7.36.9, likely an attempt to evade detection by security checks that might be stricter for initial submissions compared to subsequent updates.\nEmulating shoppers to validate cards\nThe malicious package contains a Python script that visits legitimate WooCommerce sites, collects product IDs, and then adds items to the cart by invoking the store's backend.\nNext, it navigates to the site's checkout page from where it steals the CSRF token and a capture context, which is a code snippet CyberSource users to process card data securely.\nSocket says these two are normally hidden on the page and expire quickly, but the script grabs them instantly while populating the checkout form with made-up customer info.\nIn the next step, instead of sending the stolen card directly to the payment gateway, it sends it to a server controlled by the attacker (railgunmisaka.com), which pretends to be CyberSource and gives back a fake token for the card.\nPOST request sending the card data outside\nSource: Socket\nFinally, the order with the tokenized card is submitted on the webshop, and if it goes through, it verifies that the card is valid. If it fails, it logs the error and tries the next card.\nPrinted transaction results\nSource: Socket\nUsing a tool like this, the threat actors are able to perform the validation of a large volume of stolen credit cards in an automated manner.\nThese verified cards can then be abused to conduct financial fraud or sold on cybercrime marketplaces.\nHow to block the carding attacks\nSocket comments that this end-to-end checkout emulation process is particularly hard for fraud detection systems to detect on the targeted websites.\n\"This entire workflow—from harvesting product IDs and checkout tokens, to sending stolen card data to a malicious third party, and simulating a full checkout flow—is highly targeted and methodical,\" says Socket.\n\"It is designed to blend into normal traffic patterns, making detection incredibly difficult for traditional fraud detection systems.\"\nStill, Socket says there are methods to mitigate the problem, like blocking very low-value orders under $5, which are typically used in carding attacks, monitoring for multiple small orders that have unusually high failure rates, or high checkout volumes linked to a single IP address or region.\nSocket also suggests adding CAPTCHA steps on the checkout flow that may interrupt the operation of carding scripts, as well as applying rate limiting on checkout and payment endpoints.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nEthereum private key stealer on PyPI downloaded over 1,000 times\nPyPi package with 100K installs pirated music from Deezer for years\nPhishing platform 'Lucid' behind wave of iOS, Android SMS attacks\nInfostealer campaign compromises 10 npm packages, targets devs\nNew npm attack poisons local packages with backdoors"
    }
]