[
    {
        "Title": "Rogue npm Packages Mimic Telegram Bot API to Plant SSH Backdoors on Linux Systems",
        "Link": "https://thehackernews.com/2025/04/rogue-npm-packages-mimic-telegram-bot.html",
        "Summary": "Cybersecurity researchers have uncovered three malicious packages in the npm registry that masquerade as a popular Telegram bot library but harbor SSH backdoors and data exfiltration capabilities.\nThe packages in question are listed below -\n\nnode-telegram-utils (132 downloads)\nnode-telegram-bots-api (82 downloads)\nnode-telegram-util (73 downloads)\n\n\nAccording to supply chain",
        "Date": "2025-04-19",
        "Content": "Cybersecurity researchers have uncovered three malicious packages in the npm registry that masquerade as a popular Telegram bot library but harbor SSH backdoors and data exfiltration capabilities.\nThe packages in question are listed below -\nnode-telegram-utils\n(132 downloads)\nnode-telegram-bots-api\n(82 downloads)\nnode-telegram-util\n(73 downloads)\nAccording to supply chain security firm Socket, the packages are designed to mimic\nnode-telegram-bot-api\n, a popular Node.js Telegram Bot API with over 100,000 weekly downloads. The three libraries are still available for download.\n\"While that number may sound modest, it only takes a single compromised environment to pave the way for wide-scale infiltration or unauthorized data access,\" security researcher Kush Pandya\nsaid\n.\n\"Supply chain security incidents repeatedly show that even a handful of installs can have catastrophic repercussions, especially when attackers gain direct access to developer systems or production servers.\"\nThe rogue packages not only replicate the description of the legitimate library, but also leverage a technique called\nstarjacking\nin a bid to elevate the authenticity and trick unsuspecting developers into downloading them.\nStarjacking refers to an approach where an open-source package is made to be more popular than it is by linking the GitHub repository associated with the legitimate library. This typically takes advantage of the non-existing validation of the relation between the package and the GitHub repository.\nSocket's analysis found that the packages are designed to explicitly work on Linux systems, adding two SSH keys to the \"~/.ssh/authorized_keys\" file, thus granting the attackers persistent remote access to the host.\nThe script is designed to collect the system username and the external IP address by contacting \"ipinfo[.]io/ip.\" It also beacons out to an external server (\"solana.validator[.]blog\") to confirm the infection.\nWhat makes the packages sneaky is that removing them does not completely eliminate the threat, as the inserted SSH keys grant unfettered remote access to the threat actors for subsequent code execution and data exfiltration.\nThe disclosure comes as Socket detailed another malicious package named\n@naderabdi/merchant-advcash\nthat's engineered to launch a reverse shell to a remote server while disguising as a Volet (formerly Advcash) integration.\n\"The package @naderabdi/merchant-advcash contains hardcoded logic that opens a reverse shell to a remote server upon invocation of a payment success handler,\" the company\nsaid\n. \"It is disguised as a utility for merchants to receive, validate, and manage cryptocurrency or fiat payments.\"\n\"Unlike many malicious packages that execute code during installation or import, this payload is delayed until runtime, specifically, after a successful transaction. This approach may help evade detection, as the malicious code only runs under specific runtime conditions.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "ASUS Confirms Critical Flaw in AiCloud Routers; Users Urged to Update Firmware",
        "Link": "https://thehackernews.com/2025/04/asus-confirms-critical-flaw-in-aicloud.html",
        "Summary": "ASUS has disclosed a critical security flaw impacting routers with AiCloud enabled that could permit remote attackers to perform unauthorized execution of functions on susceptible devices.\nThe vulnerability, tracked as CVE-2025-2492, has a CVSS score of 9.2 out of a maximum of 10.0.\n\n\"An improper authentication control vulnerability exists in certain ASUS router firmware series,\"",
        "Date": "2025-04-19",
        "Content": "ASUS has disclosed a critical security flaw impacting routers with\nAiCloud\nenabled that could permit remote attackers to perform unauthorized execution of functions on susceptible devices.\nThe vulnerability, tracked as\nCVE-2025-2492\n, has a CVSS score of 9.2 out of a maximum of 10.0.\n\"An improper authentication control vulnerability exists in certain ASUS router firmware series,\" ASUS\nsaid\nin an advisory. \"This vulnerability can be triggered by a crafted request, potentially leading to unauthorized execution of functions.\"\nThe shortcoming has been addressed with firmware updates for the following branches -\n3.0.0.4_382\n3.0.0.4_386\n3.0.0.4_388, and\n3.0.0.6_102\nFor optimal protection, it's recommended to update their instances to the latest version of the firmware.\n\"Use different passwords for your wireless network and router administration page,\" ASUS said. \"Use passwords that have at least 10 characters, with a mix of capital letters, numbers, and symbols.\"\n\"Do not use the same password for more than one device or service. Do not use passwords with consecutive numbers or letters, such as 1234567890, abcdefghij, or qwertyuiop.\"\nIf immediate patching is not an option or the routers have reached end-of-life (EoL), it's advised to make sure that login and Wi-Fi passwords are strong.\nAnother option is to disable AiCloud and any service that can be accessed from the internet, such as remote access from WAN, port forwarding, DDNS, VPN server, DMZ, port triggering, and FTP.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Widespread Microsoft Entra lockouts tied to new security feature rollout",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/widespread-microsoft-entra-lockouts-tied-to-new-security-feature-rollout/",
        "Summary": "Windows administrators from numerous organizations report widespread account lockouts triggered by false positives in the rollout of a new Microsoft Entra ID's \"leaked credentials\" detection app called MACE. [...]",
        "Date": "2025-04-19",
        "Content": "Windows administrators from numerous organizations report widespread account lockouts triggered by false positives in the rollout of a new Microsoft Entra ID's \"leaked credentials\" detection app called MACE.\nThese alerts and lockouts began last night, with some admins believing they were false positives as the accounts have unique passwords that are not used on any other sites or applications.\nMicrosoft Entra ID, formerly Azure Active Directory, is a cloud-based identity and access management service that helps organizations manage user identities and secure access to resources.\nIn a\nReddit thread\nposted early this morning, Windows admins reported receiving multiple alerts from Entra indicating that some of their user accounts had been found with credentials leaked on the dark web or other locations.\nThese accounts were automatically locked out of the tenant, with numerous users impacted per organization.\n\"Us as well... about 1/3rd of our accounts got locked out about ~1 hour ago. We're a MSP so I'm assuming this is happening to our clients as well,\" posted an admin on\nReddit\n.\nThe locked-out accounts showed no signs of compromise, such as suspicious sign-ins, and were protected with MFA. Furthermore, breach notification services like Have I Been Pwned (HIBP) had no matches for these accounts.​\nAnother report on Reddit further corroborated that this was widespread, with an MDR provider stating they\nreceived over 20,000 notifications\nfrom Microsoft overnight regarding leaked credentials from different customers\nWhile Microsoft has not publicly confirmed the cause of these lockouts, Microsoft told one of the affected organizations it was caused by an issue with the rollout of a new Enterprise application called \"MACE Credential Revocation.\"\n\"Just got off with engineer. It is Tenant Lockout due to this MACE ninja rollout they did. no signs of compromise. He needs an hour to convert the ticket from compromise to lockout but can breathe a sigh of relief. It was Error Code: 53003 for conditional access policy,\" an admin reported on Reddit.\nMultiple people confirmed this application was added to tenants right before they began receiving the alerts.\nMACE Credential Revocation app is a\nMicrosoft Entra feature\nused to detect leaked credentials and lockout potentially compromised accounts.\nWhile all alerts of leaked credentials should be investigated to confirm that an account was not compromised, if you received a flurry of alerts at once this rollout likely caused it.\nBleepingComputer contacted Microsoft with questions about this incident but has not received a response at this time.\nRelated Articles:\nMicrosoft: Some devices offered Windows 11 upgrades despite Intune blocks\nMicrosoft: New Windows updates fix Active Directory policy issues\nMicrosoft: Windows Server 2025 restarts break connectivity on some DCs\nMicrosoft: Windows 'inetpub' folder created by security fix, don’t delete\nMicrosoft Defender will isolate undiscovered endpoints to block attacks"
    },
    {
        "Title": "New Android malware steals your credit cards for NFC relay attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/supercard-x-android-malware-use-stolen-cards-in-nfc-relay-attacks/",
        "Summary": "A new malware-as-a-service (MaaS) platform named 'SuperCard X' has emerged, targeting Android devices via NFC relay attacks that enable point-of-sale and ATM transactions using compromised payment card data. [...]",
        "Date": "2025-04-19",
        "Content": "A new malware-as-a-service (MaaS) platform named 'SuperCard X' has emerged, targeting Android devices via NFC relay attacks that enable point-of-sale and ATM transactions using compromised payment card data.\nSuperCard X is linked to Chinese-speaking threat actors and shows code similarities with the open-source project NFCGate and its malicious spawn,\nNGate\n, which has facilitated attacks in Europe since last year.\nThe malware-as-a-service platform is promoted through Telegram channels that also offer direct support to \"customers.\"\nSuperCard X was discovered by mobile security firm\nCleafy\n, which reports seeing attacks utilizing this Android malware in Italy. These attacks involved multiple samples with subtle differences, indicating that affiliates are offered the option of custom builds tailored to regional or other specific needs.\nHow SuperCard X attacks unfold\nThe attack begins with the victim receiving a fake SMS or WhatsApp message impersonating their bank, claiming they need to call a number to resolve issues caused by a suspicious transaction.\nThe call is answered by a scammer posing as bank support, who uses social engineering to trick the victim into \"confirming\" their card number and PIN. They then attempt to convince the user to remove spending limits via their banking app.\nFinally, the threat actors convince users to install a malicious app (Reader) disguised as a security or verification tool that contains the SuperCard X malware.\nUpon installation, the Reader app requests only minimal permissions, mainly access to the NFC module, which is enough to perform the data theft.\nThe scammer instructs the victim to tap their payment card to their phone to verify their cards, allowing the malware to read the card chip data and send it to the attackers.\nThe attackers receive this data on their Android device, which runs another app called Tapper, which emulates the victim's card using the stolen data.\nThe two apps and two devices involved in the attack\nSource: Cleafy\nThese 'emulated' cards allow attackers to make contactless payments at stores and ATM withdrawals, though amount limits apply. As these small transactions are instant and appear legitimate to the banks, they're harder to flag and reverse.\nOverview of the SuperCard X attacks\nSource: Cleafy\nEvasive malware\nCleafy notes that SuperCard X is currently not flagged by any antivirus engines on VirusTotal and the absence of risky permission requests and aggressive attack features like screen overlaying ensures it stays off the radar of heuristic scans.\nThe emulation of the card is ATR-based (Answer to Reset), which makes the card appear legitimate to payment terminals and shows technical maturity and understanding of smartcard protocols.\nAnother notable technical aspect is the use of mutual TLS (mTLS) for certificate-based client/server authentication, securing C2 communications from interception and analysis by researchers or law enforcement.\nSecure communications system\nSource: Cleafy\nBleepingComputer contacted Google to comment on the SuperCard X activity and a spokesperson sent the below statement.\n“Based on our current detection, no apps containing this malware are found on Google Play. Android users are automatically protected by Google Play Protect, which is on by default on Android devices with Google Play Services. Google Play Protect can warn users or block apps known to exhibit malicious behavior, even when those apps come from sources outside of Play.\" - A Google spokesperson\nRelated Articles:\nVerizon Call Filter API flaw exposed customers' incoming call history\nNew Android malware uses Microsoft’s .NET MAUI to evade detection\nMalicious Android 'Vapor' apps on Google Play installed 60 million times\nNew North Korean Android spyware slips onto Google Play\nGoogle expands Android AI scam detection to more Pixel devices"
    },
    {
        "Title": "Critical Erlang/OTP SSH RCE bug now has public exploits, patch now",
        "Link": "https://www.bleepingcomputer.com/news/security/public-exploits-released-for-critical-erlang-otp-ssh-flaw-patch-now/",
        "Summary": "Public exploits are now available for a critical Erlang/OTP SSH vulnerability tracked as CVE-2025-32433, allowing unauthenticated attackers to remotely execute code on impacted devices. [...]",
        "Date": "2025-04-19",
        "Content": "Public exploits are now available for a critical Erlang/OTP SSH vulnerability tracked as CVE-2025-32433, allowing unauthenticated attackers to remotely execute code on impacted devices.\nResearchers at the Ruhr University Bochum in Germany disclosed the flaw on Wednesday, warning that all devices running the daemon were vulnerable.\n\"The issue is caused by a flaw in the SSH protocol message handling which allows an attacker to send connection protocol messages prior to authentication,\" reads\na disclosure\non the OpenWall vulnerability mailing list.\nThe flaw was fixed in versions 25.3.2.10 and 26.2.4, but as the paltform is commonly used in telecom infrastructure, databases, and high-availability systems, it may not be easy to update devices immediately.\nHowever, the situation has become more urgent, as multiple cybersecurity researchers have privately created exploits that achieve remote code execution on vulnerable devices.\nThis includes\nPeter Girnus\nof the Zero Day Initiative and researchers from Horizon3, who said the flaw was\nsurprisingly easy to exploit\n.\nSoon after, PoC exploits were\npublished on GitHub\nby ProDefense, and another was published anonymously on Pastebin, with both quickly shared on social media.\nGirnus confirmed to BleepingComputer that ProDefense's PoC is valid but was not able to successfully exploit Erlang/OTP SSH using the one posted to Pastebin.\nNow that public exploits are available, threat actors will soon begin scanning for vulnerable systems and exploiting them.\n\"SSH is the most commonly used remote access management protocol so I expect this combination to be widespread in critical infrastructure,\" Girnus told BleepingComputer.\n\"It's a bit concerning especially considering how frequently telcos are targeted by nation state APTs such as Volt and Salt Typhoon for example.\"\nGirnus refers to the Chinese state-sponsored hacking groups responsible for\nhacking edge networking equipment\nand\nbreaching telecommunications providers\nin the US and worldwide.\nWhile it is unclear how many devices are utilizing the Erlang OTP's SSH daemon, over 600,000 IP addresses are running Erlang/OTP according to a\nShodan query\nshared by Girnus.\n\"These are mostly CouchDB instances, CouchDB is implemented in Erlang and runs on the Erlang/OTP platform,\" the researcher explained in a chat about the public exploits.\nNow that public exploits are available, it is strongly advised that all devices running Erlang OTP SSH be upgraded immediately before threat actors compromise them.\nRelated Articles:\nCritical Erlang/OTP SSH pre-auth RCE is 'Surprisingly Easy' to exploit, patch now\nASUS warns of critical auth bypass flaw in routers using AiCloud\nWindows NTLM hash leak flaw exploited in phishing attacks on governments\nApple fixes two zero-days exploited in targeted iPhone attacks\nHackers exploit WordPress plugin auth bypass hours after disclosure"
    },
    {
        "Title": "Google Gemini AI is getting ChatGPT-like Scheduled Actions feature",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/google-gemini-ai-is-getting-chatgpt-like-scheduled-actions-feature/",
        "Summary": "Google Gemini is testing a ChatGPT-like scheduled tasks feature called \"Scheduled Actions,\" which will allow you to create tasks that Gemini will execute later. [...]",
        "Date": "2025-04-19",
        "Content": "Google Gemini is testing a ChatGPT-like scheduled tasks feature called \"Scheduled Actions,\" which will allow you to automate tasks.\nAs\nspotted\nby ʟᴇɢɪᴛ on X, Google is integrating a new feature called \"Scheduled Actions\" into Gemini's web interface.\nWhile it's unclear how the feature will work, BleepingComputer understands that it will be similar to ChatGPT's integration.\nGemini Scheduled Actions on the web\nOnce available, you'll be able to create a task that will be triggered at a specific time, and these tasks will be performed automatically.\nThis means a task will execute even when the user is offline. But what are some possible use cases of Gemini's Scheduled Actions? You can ask Gemini to remind you about your meeting.\nSimilarly, you can also use it to improve your lifestyle, such as using Gemini to remind yourself to take a break every 30 minutes.\nIn many ways, it's similar to an AI-powered to-do list system, but it will eventually get better when Google is able to integrate other services.\nIf you use the feature on the desktop, you'll need to turn on the necessary notification permissions, as the feature is all about executing tasks and reminding you through notifications.\nGoogle plans to launch the Scheduled Tasks feature for everyone in the coming weeks.\nRelated Articles:\nGoogle Gemini's Astra (screen sharing) rolls out on Android for some users\nChatGPT 4.1 early benchmarks compared against Google Gemini\nOpenAI's GPT-4.1, 4.1 nano, and 4.1 mini models release imminent\nOpenAI wants ChatGPT to 'know you over your life' with new Memory update\nGoogle takes on Cursor with Firebase Studio, its AI builder for vibe coding"
    }
]