[
    {
        "Title": "Storm-1977 Hits Education Clouds with AzureChecker, Deploys 200+ Crypto Mining Containers",
        "Link": "https://thehackernews.com/2025/04/storm-1977-hits-education-clouds-with.html",
        "Summary": "Microsoft has revealed that a threat actor it tracks as Storm-1977 has conducted password spraying attacks against cloud tenants in the education sector over the past year.\n\"The attack involves the use of AzureChecker.exe, a Command Line Interface (CLI) tool that is being used by a wide range of threat actors,\" the Microsoft Threat Intelligence team said in an analysis.\nThe tech giant noted that",
        "Date": "2025-04-27",
        "Content": "Microsoft has revealed that a threat actor it tracks as Storm-1977 has conducted\npassword spraying attacks\nagainst cloud tenants in the education sector over the past year.\n\"The attack involves the use of AzureChecker.exe, a Command Line Interface (CLI) tool that is being used by a wide range of threat actors,\" the Microsoft Threat Intelligence team\nsaid\nin an analysis.\nThe tech giant noted that it observed the binary to connect to an external server named \"sac-auth.nodefunction[.]vip\" to retrieve an AES-encrypted data that contains a list of password spray targets.\nThe tool also accepts as input a text file called \"accounts.txt\" that includes the username and password combinations to be used to carry out the password spray attack.\n\"The threat actor then used the information from both files and posted the credentials to the target tenants for validation,\" Microsoft said.\nIn one successful instance of account compromise observed by Redmond, the threat actor is said to have taken advantage of a guest account to create a resource group within the compromised subscription.\nThe attackers then created more than 200 containers within the resource group with the ultimate goal of conducting illicit cryptocurrency mining.\nMicrosoft said containerized assets, such as Kubernetes clusters, container registries, and images, are\nliable\nto\nvarious kinds of attacks\n, including using -\nCompromised cloud credentials to facilitate cluster takeover\nContainer images with vulnerabilities and misconfigurations to carry out malicious actions\nMisconfigured management interfaces to gain access to the Kubernetes API and deploy malicious containers or hijack the entire cluster\nNodes that run on vulnerable code or software\nTo mitigate such malicious activities, organizations are advised to secure container deployment and runtime, monitor unusual Kubernetes API requests, configure policies to prevent containers from being deployed from untrusted registries and ensure that the images being deployed in containers are free from vulnerabilities.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Coinbase fixes 2FA log error making people think they were hacked",
        "Link": "https://www.bleepingcomputer.com/news/security/coinbase-fixes-2fa-log-error-making-people-think-they-were-hacked/",
        "Summary": "Coinbase has fixed a confusing bug in its account activity logs that caused users to think their credentials were compromised. [...]",
        "Date": "2025-04-27",
        "Content": "Coinbase has fixed a confusing bug in its account activity logs that caused users to think their credentials were compromised.\nAs\nBleepingComputer first reported\nearlier this month, Coinbase had mistakenly labeled failed login attempts with incorrect passwords as two-factor authentication failues in the Account Activity logs.\nWhen a threat actor attempted to access someone's account and used the wrong password, error messages stating \"second_factor_failure\" or \"2-step verification failed\" would be shown instead.\nThese entries imply that a valid username and password were entered, but the log in was blocked by 2-factor authentication, such as entering the wrong one-time passcode from an authenticator app.\nNumerous Coinbase users contacted BleepingComputer with concerns that Coinbase had been breached as their passwords were unique to the site, there was no sign of malware, and no other accounts were affected.\nIncorrect 2FA error message in Coinbase Account Activity logs\nHowever, Coinbase confirmed to BleepingComputer that its logging system was incorrectly attributing login attempts with incorrect passwords as \"2FA failures,\" even though the attackers had not successfully reached the 2FA stage.\nCoinbase has now pushed an update to fix this incorrect labeling so that \"Password attempt failed\" logs are shown in Account Activity instead.\nBugs like this are essential to fix as they cause unnecessary panic, with users telling BleepingComputer that they had reset all of their passwords and spent hours trying to determine if their devices were compromsed due to this bug.\nThese mislabeled entries could have also been used in social engineering attacks to convince users their account credentials were compromised, potentially allowing threat actors to gain sensitive information.\nThreat actors commonly\ntarget Coinbase customers in social engineering attacks\nto gain access to their accounts and drain the stored cryptocurrency.\nBleepingComputer was told that threat actors used these mislabeled error messages as part of such attacks but could not independently verify if that was true.\nHowever, ongoing campaigns use automated SMS phishing (smishing) attacks and voice calls to impersonate Coinbase and attempt to steal 2FA tokens or credentials, so all users should be wary.\nCoinbase has\nsaid in the past\nthat they will never call customers or send text messages requesting they change passwords or reset two-factor authentication and that customers should treat all such messages as scams.\nRelated Articles:\nCoinbase to fix 2FA account activity entry freaking out users\n7 Steps to Take After a Credential-Based cyberattack\nQuantum leap: Passwords in the new era of computing security\nFive best practices for securing Active Directory service accounts\nHackers abuse OAuth 2.0 workflows to hijack Microsoft 365 accounts"
    },
    {
        "Title": "Brave's Cookiecrumbler tool taps community to help block cookie notices",
        "Link": "https://www.bleepingcomputer.com/news/security/braves-cookiecrumbler-tool-taps-community-to-help-block-cookie-notices/",
        "Summary": "Brave has open-sourceed a new tool called \"Cookiecrumbler,\" which uses large language models (LLMs) to detect cookie consent notices and then community-driven reviews to block those that won't break site functionality. [...]",
        "Date": "2025-04-27",
        "Content": "Brave has open-sourceed a new tool called \"Cookiecrumbler,\" which uses large language models (LLMs) to detect cookie consent notices and then community-driven reviews to block those that won't break site functionality.\nThe Brave browser has been blocking cookie consent banners by default on all websites\nsince 2022\nbut found that blocking consent banners may cause website problems that severely disrupt and degrade the site's usability.\n\"Overly broad or incorrect blocking can break essential website functionality, from checkout flows to layout problems,\"\nexplains Brave\n.\n\"We've encountered many issues (broken scrolling, blank pages) when a cookie consent notice block is applied indiscriminately.\"\nCookiecrumbler uses AI to find websites utilizing consent management platforms (CMPs) and report them as issues in its GitHub Project. Cookiecrumbler's suggestions are then reviewed manually before applying to avoid breaking essential site functionality.\nThe way the tool works is summarized as follows:\nCrawls top websites using regional proxies.\nLoads pages with Puppeteer to find potential cookie notices.\nPasses these to the LLM for classification and suggestions for fixing.\nPublishes detection results as\nGitHub issues\nfor community triage and improvement.\nEssentially, Cookiecrumbler enables large-scale, regionally aware cookie banner detection and blocking while reducing false positives and site problems.\nBeing a privacy-focused software, Brave's announcement makes several points about how Cookiecrumbler's operation does not expose sensitive details.\nFirst, it is clarified that Cookiecrumber runs entirely on Brave's backend, and not on the user's browser, which means no user data is involved in its detection and analysis process.\nSecondly, the tool does not interact with the actual user sessions; instead, it uses proxies and automated crawlers to simulate browsing from different regions using public site lists like Tranco.\nUltimately, privacy preservation is the main reason why Cookiecrumbler is currently not baked into the Brave browser but instead is used internally as a backend tool for analysis.\nBrave Software says Cookiecrumbler will be integrated into Brave only after it has gone through a full privacy review that ensures its operation adheres to the software's strict stance on user privacy.\nWith Cookiecrumbler being open-source and free\nvia GitHub\n, it can be used directly by other privacy tool developers, website auditors, adblock list maintainers, or even tech-savvy users who want to generate or improve their own filter rules.\nRelated Articles:\nNew Chirp tool uses audio tones to transfer data between devices\nOpen-source tool 'Rayhunter' helps users detect Stingray attacks\nMalicious PyPI packages with over 10,000 downloads taken down\nPyPI packages caught stealing credit card numbers, Discord tokens\nVivaldi integrates Proton VPN into the browser to fight web tracking"
    }
]