[
    {
        "Title": "⚡ Weekly Recap: Critical SAP Exploit, AI-Powered Phishing, Major Breaches, New CVEs & More",
        "Link": "https://thehackernews.com/2025/04/weekly-recap-critical-sap-exploit-ai.html",
        "Summary": "What happens when cybercriminals no longer need deep skills to breach your defenses? Today’s attackers are armed with powerful tools that do the heavy lifting — from AI-powered phishing kits to large botnets ready to strike. And they’re not just after big corporations. Anyone can be a target when fake identities, hijacked infrastructure, and insider tricks are used to slip past security",
        "Date": "2025-04-28",
        "Content": "What happens when cybercriminals no longer need deep skills to breach your defenses? Today's attackers are armed with powerful tools that do the heavy lifting — from AI-powered phishing kits to large botnets ready to strike. And they're not just after big corporations. Anyone can be a target when fake identities, hijacked infrastructure, and insider tricks are used to slip past security unnoticed.\nThis week's threats are a reminder: waiting to react is no longer an option. Every delay gives attackers more ground.\n⚡ Threat of the Week\nCritical SAP NetWeaver Flaw Exploited as 0-Day\n— A critical security flaw in SAP NetWeaver (CVE-2025-31324, CVSS score: 10.0) has been\nexploited\nby unknown threat actors to upload JSP web shells with the goal of facilitating unauthorized file uploads and code execution. The attacks have also been observed using the Brute Ratel C4 post-exploitation framework, as well as a well-known technique called Heaven's Gate to bypass endpoint protections.\nFirewalls are Obsolete in the AI Era. It's Time for a Modern Security Approach\nCompanies need to rethink how they protect their private and public use of AI and how they defend against AI-powered attacks. Traditional firewalls, VPNs, and public-facing IPs expose your attack surface and are no match in the AI era. It's time for a modern approach with Zscaler Zero Trust + AI.\nSee \"Zero Trust + AI\" in Action ➝\n🔔 Top News\nDarcula Phishing Kit Gets GenAI Upgrade\n— The threat actors behind the Darcula phishing-as-a-service (PhaaS) platform have released new updates to their cybercrime suite with generative artificial intelligence (GenAI) capabilities to facilitate phishing form generation in various languages, form field customization, and translation of phishing forms into local languages. The updates further lower the technical barrier for creating phishing pages, making it quick and easy for even a novice criminal to set up complex smishing scams. The Darcula PhaaS suite is user-friendly. All that an aspiring scammer needs to do is sign up for the Darcula service, enter a legitimate brand site, and the platform will generate a bespoke, spoofed phishing version. \"Darcula is not just a phishing platform; it's a service model designed for scale,\" Netcraft\nsaid\n. \"Users pay for access to a suite of tools that enable impersonation of organizations in nearly every country. Built using modern technologies like JavaScript frameworks, Docker, and Harbor, the infrastructure mirrors that of legitimate SaaS companies.\"\nContagious Interview Sets Up Fake Firms\n— North Korea-linked threat actors behind the Contagious Interview have\nset up front companies\nnamed BlockNovas LLC, Angeloper Agency, and SoftGlide LLC as a way to distribute malware during the fake hiring process. The activity exemplifies the sophisticated social engineering tactics employed by North Korean threat actors to lure developers. The disclosure comes as Pyongyang hackers are increasingly leveraging artificial intelligence as part of the fraudulent IT worker scheme. At the heart of these operations lies a comprehensive suite of AI-enhanced tools that work in concert and are used to create synthetic personas in order to sustain the deception. The facilitators utilize unified messaging services that provide a way to manage multiple personas across various communication channels simultaneously. These services also incorporate AI-powered translation, transcription, and summarization capabilities to help the IT workers communicate with their prospective employers.\nSuspected Russian Hackers Use New Tactic to Access Microsoft 365 Accounts\n— Multiple suspected Russia-linked threat actors like UTA0352 and UTA0355 are \"aggressively\" targeting individuals and organizations with ties to Ukraine and human rights with an aim to gain unauthorized access to Microsoft 365 accounts since early March 2025. \"These recently observed attacks rely heavily on one-on-one interaction with a target, as the threat actor must both convince them to click a link and send back a Microsoft-generated code,\" Volexity\nsaid\n. \"These recent campaigns benefit from all user interactions taking place on Microsoft's official infrastructure; there is no attacker-hosted infrastructure used in these attacks.\"\nThreat Actors Exploit Google Infrastructure for Phishing Attack\n— Unknown threat actors have\nleveraged\na novel approach that allowed bogus emails to be sent via Google's infrastructure and redirect message recipients to fraudulent sites that harvest their credentials. The sophisticated phishing attack bypassed email authentication checks, and sought to trick email recipients into clicking on bogus links that are designed to harvest their Google Account credentials. Google has since plugged the attack pathway.\nLotus Panda Targets Southeast Asia With Sagerunex\n— The China-linked cyber espionage group tracked as\nLotus Panda\nhas been attributed to a campaign that compromised multiple organizations in an unnamed Southeast Asian country between August 2024 and February 2025. The activity has been found to employ DLL side-loading techniques to drop a backdoor named Sagerunex, as well as two credential stealers ChromeKatz and CredentialKatz that are equipped to siphon passwords and cookies stored in the Google Chrome web browser. In recent months, a cyber espionage campaign known as\nOperation Cobalt Whisper\nhas targeted multiple industries in Hong Kong and Pakistan, including defense, education, environmental engineering, electrotechnical engineering, energy, cybersecurity, aviation and healthcare, with phasing emails that serve as a conduit to deliver Cobalt Strike. The Pakistan Navy has also been\ntargeted\nby a likely nation-state adversary to distribute a stealthy infostealer called\nSync-Scheduler\nto the targeted victims. While the tactics exhibited in the campaign overlap with those of SideWinder and Bitter APT, there is no ample evidence to link it to a specific threat actor. And that's not all. Chinese cybersecurity researchers have been\ntargeted\nby a Vietnamese threat group known as\nAPT32\nbetween mid-September and early October 2024 to deploy Cobalt Strike via trojanized GitHub projects.\n‎️‍🔥 Trending CVEs\nAttackers love software vulnerabilities—they're easy doors into your systems. Every week brings fresh flaws, and waiting too long to patch can turn a minor oversight into a major breach. Below are this week's critical vulnerabilities you need to know about. Take a look, update your software promptly, and keep attackers locked out.\nThis week's list includes —\nCVE-2024-58136, CVE-2025-32432\n(Craft CMS),\nCVE-2025-31324\n(SAP NetWeaver),\nCVE-2025-27610\n(Rack),\nCVE-2025-34028\n(Commvault Command Center),\nCVE-2025-2567\n(Lantronix Xport),\nCVE-2025-33028\n(WinZip),\nCVE-2025-21204\n(Microsoft Windows),\nCVE-2025-1021\n(Synology DiskStation Manager),\nCVE-2025-0618\n(FireEye EDR Agent),\nCVE-2025-1763\n(GitLab),\nCVE-2025-32818\n(SonicWall SonicOS),\nCVE-2025-3248\n(Langflow),\nCVE-2025-21605\n(Redis),\nCVE-2025-23249, CVE-2025-23250, and CVE-2025-23251\n(NVIDIA NeMo Framework),\nCVE-2025-22228\n(Spring Framework, NetApp), and\nCVE-2025-3935\n(ScreenConnect).\n📰 Around the Cyber World\nLumma Stealer Adopts New Tricks to Evade Detection\n— The information stealer known as Lumma, which has been advertised as a Malware-as-a-Service (MaaS) starting at $250 a month, is being distributed extensively using\nvarious methods\nsuch as pirated media, adult content, and cracked software sites, as well as fake Telegram channels for such content to redirect users to fraudulent CAPTCHA verifications that leverage the ClickFix tactic to trick users into downloading and running the malware via PowerShell and MSHTA commands. The stealer, for its part, uses techniques like DLL side-loading and injecting the payload into the overlay section of free software to trigger a complex infection process. \"The overlay section is typically used for legitimate software functionality, such as displaying graphical interfaces or handling certain input events,\" Kaspersky said. \"By modifying this section of the software, the adversary can inject the malicious payload without disrupting the normal operation of the application. This method is particularly insidious because the software continues to appear legitimate while the malicious code silently executes in the background.\" Lumma Stealer has\nremained\nan active threat since its debut in 2022, continually receiving updates to evade detection through\nfeatures\nlike code flow obfuscation, dynamic resolution of API functions during runtime, Heaven's gate, and disabling ETWTi callbacks. It's also designed to detect virtual and sandbox environments. As of August 2023, Lumma Stealer team began\ntesting\nan AI-based feature to determine if an infected user log is a bot or not. The widespread adoption of Lumma Stealer is also evidenced by the use of diverse infection vectors, which have leveraged the stealer to\ndeliver\nadditional payloads like\nAmadey\n. \"The operators of LummaStealer run an internal marketplace on Telegram [...] where thousands of logs are bought and sold daily,\" Cybereason\nsaid\n. \"They also include features like a rating system to encourage quality sellers, advanced search options for both passwords and cookies, and a wide price range. Coupled with 24/7 support, the marketplace aims to provide a seamless experience for anyone trading stolen data, reflecting a trend seen across various Telegram and darknet-based stealer communities.\" According to\ndata\nfrom IBM X-Force, there has been an 84% weekly average increase in infostealers delivered via phishing emails last year, compared to 2023.\nNew SessionShark AiTM Phishing Kit Advertised\n— A new adversary-in-the-middle (AiTM) phishing kit called SessionShark O365 2FA/MFA is being showcased as a way for threat actors to bypass Microsoft 365 multi-factor authentication (MFA) protections. Ostensibly marketed for educational purposes to avoid liability, the service claims to be equipped with a range of anti-detection and stealth capabilities to avoid detection by bots and automated security scanners using CAPTCHA checks, integrate with Cloudflare's services, and access comprehensive logs via a dedicated panel. \"This duplicitous marketing strategy is common in underground forums – it provides a thin veneer of deniability (to avoid forum bans or legal issues) but fools no one about the true purpose,\" SlashNext\nsaid\n. \"Phrases like 'for educational purposes' or 'ethical hacking perspective' in the ad copy are a wink and nod to buyers that this is a hacking tool, not a classroom demo.\"\nElusive Comet Abuses Zoom Remote Control Feature for Crypto Theft\n— Security researchers are calling attention to a campaign called\nElusive Comet\nthat employs sophisticated social engineering tactics with the goal of tricking victims into installing malware and ultimately stealing their cryptocurrency. Ostensibly operating a venture capital firm named Aureon Capital, the threat actor is estimated to be responsible for millions of dollars in stolen funds. \"Elusive Comet maintains a strong online presence with extensive history in order to establish and maintain legitimacy,\" Security Alliance said. \"This is accomplished by setting up polished websites and active social media profiles, as well as creating profiles which impersonate real people with notable credentials.\" Attacks commence with an outreach phase wherein potential victims are approached over Twitter DMs or email, inviting them to be a guest on their podcast or for an interview. The invitations are sent through Calendly links to schedule a Zoom meeting. Once the invite is accepted, victims are urged to join the Zoom call and share their screen to present their work, at which point the threat actors use the videoconferencing software to request control over the potential victim's computer by changing their display name to \"Zoom\" and make it appear as a system notification. Granting remote access allows Elusive Comet to install malware such as GOOPDATE for facilitating cryptocurrency theft, as\nhighlighted\nby Jake Gallen, the chief executive of non-fungible token platform Emblem Vault who had over $100,000 of his personal assets stolen. The attacks have also been observed delivering information stealers and remote access trojans to enable data exfiltration. \"What makes this attack particularly dangerous is the permission dialog's similarity to other harmless Zoom notifications,\" Trail of Bits\nsaid\n. \"The Elusive Comet campaign succeeds through a sophisticated blend of social proof, time pressure, and interface manipulation that exploits normal business workflows.\" It's not clear who is behind the campaign, but evidence points to it being North Korea, which has been observed scheduling fake Zoom calls with targets under the pretext of meeting with venture capitalists or discussing a partnership opportunity, and deceiving them into installing malware to\naddress non-existent audio issues\n.\nPower Parasites Goes After Bangladesh, Nepal, India\n— An active campaign is targeting individuals across Asian countries, including Bangladesh, Nepal, and India, with job and investment scams via combination of deceptive websites masquerading as energy firms and other major firms, social media groups, Youtube videos, and Telegram channels since September 2024. The activity cluster, which is designed to trick victims into parting with their banking details or personal financial information, has been codenamed Power Parasites. \"These campaigns are typically shared with potential victims on social media networks, over email, or via direct messaging channels,\" Silent Push\nsaid\n.\nSeveral Extensions Found with Risky Features\n— Fifty-eight suspicious Google Chrome extensions have been\ndiscovered\ncontaining risky features, such as monitoring browsing behavior, accessing cookies for domains, altering search providers, and potentially executing remote scripts,\naccording\nto Secure Annex researcher John Tuckner. The most interesting aspect of these extensions is that they are hidden, meaning they don't show up on Chrome Web Store searches, but they can be accessed should users have the direct URL. This indicates that threat actors are using unconventional ways to evade detection while aggressively pushing them through ads and malicious sites. The extensions have been cumulatively installed on roughly 5.98 million devices. A Google spokesperson told The Hacker News that \"we're aware of the report and investigating.\"\nMitre releases ATT&CK v17\n— Mitre has\nreleased\na new version of its ATT&CK framework, the compendium of adversary tactics and techniques it puts together to help defenders. The latest version introduces four new techniques targeting the VMware ESXi platform, while adapting 34 existing ones. Two notable changes include the renaming of Network platform to Network Devices to better reflect techniques used to target network devices such as routers, switches, and load balancers, and the merging of two sub-techniques DLL Side-Loading and DLL Search Order Hijacking into one category called \"\nHijack Execution Flow: DLL\n\" by taking into account their overlapping nature. Also added to ATT&CK v17 is a technique named \"Remote Access Tools: Remote Access Hardware\" that highlights Democratic People's Republic of Korea (DPRK)\nremote work schemes\n.\nCISA Discontinues Use of Censys and VirusTotal\n— Hundreds of staff in the Cybersecurity and Infrastructure Security Agency (CISA) have been\nnotified\nthat the agency discontinued the use of Censys late last month and Google-owned VirusTotal on April 20, 2025. \"We understand the importance of these tools in our operations and are actively exploring alternative tools to ensure minimal disruption,\" Nextgov quoted an email sent to CISA staffers. \"We are confident that we will find suitable alternatives soon.\" The development days after the cybersecurity industry was sent into a tailspin after an internal memo from MITRE\nrevealed\nthat the U.S. would no longer support its flagship CVE Program. However, at the eleventh hour, CISA\nreversed course\nand extended the contract by about 11 months. \"To set the record straight, there was no funding issue, but rather a contract administration issue that was resolved prior to a contract lapse,\" Matt Hartman, CISA Acting Executive Assistant Director for Cybersecurity,\nsaid\n. \"There has been no interruption to the CVE program and CISA is fully committed to sustaining and improving this critical cyber infrastructure.\nHow Windows PC Manager Could Be Hijacked\n— Cybersecurity researchers have outlined two scenarios where releases associated with the PC Manager tool, a software designed to help optimize and manage Windows computers, could have been hijacked by attackers via\nWinGet\nrepository (\nZDI-23-1527\n), 'aka.ms' URLs, and the official \"pcmanager.microsoft[.]com\" subdomain of Microsoft (\nZDI-23-1528\n), due to overly permissive Shared Access Signature (\nSAS\n) tokens. Successful exploitation of the vulnerabilities to execute arbitrary code on customers' endpoints without requiring any authentication. \"If an attack had been carried out, cybercriminals could have compromised software supply chains for distribution of malware, allowed them to replace software releases, and alter distributed PC Manager executables,\" Trend Micro\nsaid\n. The issues, both of which carry a CVSS score of 10.0, have since been addressed by Microsoft in October 2023.\nNew Magecart Campaigns Observed in the Wild\n— A new credit card skimming (aka Magecart) campaign has been\nobserved\ninjecting malicious code into compromised e-commerce sites with the goal of intercepting payment data entered by users in checkout forms. The attacks involve gaining access to the sites' backend systems using credentials stolen through an information stealer, leveraging it to upload a malicious PHP page directly to the server. The PHP script acts as a web shell to gain remote control of the site and pollute the database by inserting a malicious JavaScript code. The JavaScript is designed to capture payment information, checking the validity of the numbers entered, and exfiltrate the information via a WebSocket connection and as an image. Credit card data stolen via web skimmers are typically sold on\ncarding forums\nlike Savastan0, where they are purchased by other threat actors to further criminal activity in exchange for a cryptocurrency payment. \"Savastan0's rules establish that a buyer only has 10 minutes to use a checker, otherwise the card cannot be refunded,\" Yarix\nsaid\n. \"Every check costs $0.30. Without making any transaction, card checker services may be used to 'soft check' the authenticity of cards. This lowers the possibility of alerting the legitimate owner to the activity or warning anti-fraud systems. It may also be used to infer expiration dates and CVV codes, among other missing information.\" The disclosure comes as Jscrambler detailed a stealthy web skimming campaign that infiltrated 17 Caritas Spain websites running WooCommerce using a modular kit designed to stay undetected while intercepting sensitive payment data. \"The skimming campaign, like many, was executed in two stages,\" Jscrambler\nsaid\n. \"Stage one served as the loader, laying the groundwork for the attack. Stage two held the skimmer logic itself, injected a fake payment form, and exfiltrated sensitive data.\" The exact initial infection vector remains unknown, although there is evidence pointing to the fact that the threat actors have persistent access to the WooCommerce installation. Jscrambler said the stolen card details are validated within 10 minutes of exfiltration, indicating some level of automation.\n4Chan Makes a Return\n— Infamous imageboard site 4chan has come partly back online after a\nhack\ntook the site down for nearly two weeks. In a post on its blog, it\nsaid\n\"a hacker using a U.K. IP address exploited an out-of-date software package on one of 4chan's servers, via a bogus PDF upload. With this entry point, they were eventually able to gain access to one of 4chan's servers, including database access and access to our own administrative dashboard. The hacker spent several hours exfiltrating database tables and much of 4chan's source code.\" 4chan said the breached server has been replaced and that PDF uploads have been temporarily disabled on boards that supported the feature.\nSK Telecom Discloses Breach\n— SK Telecom, South Korea's largest mobile operator, has\nalerted\ncustomers that a malware infection allowed threat actors to access their sensitive USIM-related information. The company said it became aware of the incident on April 19, 2025, around 11 p.m. local time. SK Telecom, however, emphasized that there is no evidence the information has been misused in any manner. The attack has not been claimed by any known threat actor or group.\nNew Flaws in Kentico Xperience CMS\n— Cybersecurity researchers have detailed a now-patched vulnerability in the Kentico Xperience content management system (CMS) application (\nCVE-2025-2748\n, CVSS score: 6.5) that results in a stored cross-site scripting (XSS) attack by taking advantage of the fact it does not fully validate or filter files uploaded via the multiple-file upload functionality. The bug essentially allows an attacker to distribute a malicious payload as an unauthenticated user when uploading multiple files to the application. This issue affects Kentico Xperience through 13.0.178. Also addressed by Kentico are\nthree other vulnerabilities\n, WT-2025-0006 (authentication bypass), WT-2025-0007 (Post-authentication Remote Code Execution), and WT-2025-0011 (Authentication Bypass), that can achieve Remote Code Execution against fully-patched deployments.\nIndian Banks Ordered to Migrate to \".bank[.]in\" Domains by October 31\n— In Febraury 2025, India's central bank, the Reserve Bank of India (RBI),\nintroduced\nan exclusive \".bank[.]in\" internet domain for banks in the country to combat digital financial fraud. In a new directive\nissued\nlast week, the RBI has urged banks to commence the migration to the new domain and complete the process by October 31, 2025. To that end, banks are required to contact the Institute for Development and Research in Banking Technology (IDRBT) to initiate the registration process.\nNew DDoS Botnet Powered by 1.33 Million Devices\n— The largest ever DDoS botnet consisting of 1.33 million devices has been observed targeting the \"Betting shops\" microsegment and lasted approximately 2.5 hours in late March 2025. Over 50% of the compromised devices are located in Brazil, followed by Argentina, Russia, Iraq, and Mexico, per\nQrator Labs\n. The disclosure coincided with an emerging threat campaign targeting poorly managed MS-SQL servers to deploy Ammyy Admin and PetitPotato malware for remote access and privilege escalation. \"The attackers exploit vulnerable servers, execute commands to gather system information and use WGet to install the malware,\" Broadcom\nsaid\n. \"They also enable RDP services and add new user accounts to maintain persistent access.\"\nScallywag Uses Bogus WordPress Extensions For Ad Fraud\n— A collection of four WordPress plugins – Soralink, Yu Idea, WPSafeLink, and Droplink – collectively dubbed\nScallywag\nis being advertised as a fraud-as-a-service operation to help monetize digital piracy and URL-shortening services. \"These modules redirect users through one or more intermediary pages to request and render ads before delivering the promised content or shortened URL,\" the HUMAN Satori Threat Intelligence and Research Team said. At its peak, Scallywag accounted for 1.4 billion fraudulent bid requests a day across 407 cash out domains. The attack process begins with a user visiting a movie piracy catalog site. Once the content to be viewed is chosen, they are redirect a Scallywag-associated cashout blog loaded with ads before leading to their final destination, where the content is hosted. HUMAN said new cash out sites have emerged amid continued crackdown on the scheme, underscoring what appears to be a game of whack-a-mole with the fraudsters.\nMicrosoft Officially Begins Recall Rollout\n— Microsoft has made available its artificial intelligence (AI) powered\nRecall\nfeature on Copilot+ PC, nearly a year after it was announced to immense privacy and security backlash. The concerns led the company to make it an opt-in feature and rearchitect the system with improved controls to prevent unauthorized access. \"We've implemented extensive security considerations, such as Windows Hello sign-in, data encryption and isolation in Recall to help keep your data safe and secure,\" Microsoft\nsaid\n. \"Recall data is processed locally on your device, meaning it is not sent to the cloud and is not shared with Microsoft and Microsoft will not share your data with third-parties.\" Security researcher Kevin Beaumont\nsaid\nMicrosoft has made \"serious efforts\" to address some of the substantive security complaints, but noted that filtering sensitive data from snapshots can be hit-or-miss.\nCybercrime Costs Victims $16 billion in 2024\n— The U.S. Federal Bureau of Investigation's (FBI) Internet Crime Complaint Center, or IC3, recorded 859,532 complaints in 2024, of which 256,256 complaints led to a staggering loss of $16.6 billion, a 33% increase in losses from 2023. \"Fraud represented the bulk of reported losses in 2024, and ransomware was again the most pervasive threat to critical infrastructure, with complaints rising 9% from 2023,\" IC3\nsaid\n. \"As a group, those over the age of 60 suffered the most losses and submitted the most complaints.\" Investment, business email compromise (BEC), tech support scams took the top three slots for the most loss. Hong Kong, Vietnam, Mexico, the Philippines, India, and China were the main international destinations for fraudulent wire transactions. Ransomware attack reports to the FBI totalled 3,156 in 2024, up from 2,825 in 2023 and 2,385 in 2022. As many as 67 new ransomware variants were recognized in 2024.\nJapan Warns of Unauthorized Stock Trading via Stolen Credentials\n— Japan's Financial Services Agency (FSA) is\nalerting\nusers of unauthorized transactions on internet stock trading services using stolen credentials harvested from phishing websites impersonating their legitimate counterparts. There have been 1,454 fraudulent transactions to date. These\nunauthorized trading transactions\nare worth almost ¥100 billion ($700 million) since February.\nFBI Seeks Info on Salt Typhoon\n— The FBI said it's seeking information about a Chinese hacking group called\nSalt Typhoon\nand its\ncompromise\nof U.S. telecom companies. \"Investigation into these actors and their activity revealed a broad and significant cyber campaign to leverage access into these networks to target victims on a global scale,\" the agency\nsaid\n. \"This activity resulted in the theft of call data logs, a limited number of private communications involving identified victims, and the copying of select information subject to court-ordered US law enforcement requests.\"\nPrivacy Watchdog Files GDPR Complaint Against Ubisoft\n— Austrian privacy non-profit noyb has accused French video game developer and publisher Ubisoft of violating the General Data Protection Regulation (GDPR) laws in the region by forces its customers to connect to the internet every time they launch a single player game even in scenarios where they don't have any online features. \"This allows Ubisoft to collect people's gaming behaviour. Among other things, the company collects data about when you start a game, for how long you play it and when you close it,\" noyb\nsaid\n. \"Even after the complainant explicitly asked why he is forced to be online, Ubisoft failed to disclose why this is going on.\" The complaint comes close on the heels of noyb calling out the complex \"cooperation mechanism\" to handle complaints between the Data Protection Authority (DPA) in the users' Member State and the DPA in the company's Member State. \"This regulation could have been a game changer for exercising people's fundamental rights. Instead, it looks like it will waste thousands of hours in already overworked authorities by prescribing various useless and overly complex procedural steps, which translates to millions in taxpayer money,\" Max Schrems\nsaid\n. \"At the same time, procedures will be slower and also more complex for business and citizens alike. Enforcement of GDPR rights of normal people will be even harder to reach.\"\nFlaw in SSL.com DCV Process\n— A flaw in SSL.com's domain control validation (DCV) process could have\nallowed\nattackers to bypass verification and issue fraudulent SSL certificates for any domain linked to certain email providers such as aliyun[.]com. A total of 11 certificates are said to have been issued in this manner.\nAsian Scam Operations Expand Globally\n— The United Nations Office on Drugs and Crime (UNODC) has revealed that\nscam centers\nrun by East and Southeast Asian organized crime gangs have spread like a \"cancer\" in response to law enforcement efforts, resulting in a global expansion. Nigeria, Zambia, Angola, Brazil, and Peru are some of the new spillover sites where Asian-led groups have migrated to. \"The dispersal of these sophisticated criminal networks within areas of weakest governance has attracted new players, benefited from and fueled corruption, and enabled the illicit industry to continue to scale and consolidate, culminating in hundreds of industrial-scale scam centres generating just under US $40 billion in annual profits,\" the UNODC\nsaid\n.\n🎥 Cybersecurity Webinars\nAI-Powered Impersonation Is Beating MFA—Here's How to Shut the Door on Identity-Based Attacks\n— AI-driven impersonation is making traditional MFA useless—and attackers are getting in without ever stealing a password. In this session, you'll learn how to stop identity-based attacks before they start, using real-time verification, access checks, and advanced deepfake detection. From account takeover prevention to AI-powered identity proofing, see how modern defenses can shut the door on imposters. Join the webinar to see it in action.\nSmart AI Agents Need Smarter Security—Here's How to Start\n— AI agents are helping teams move faster—but without the right security, they can expose sensitive data or be manipulated by attackers. This session walks you through how to build AI agents securely, with practical steps, key controls, and overlooked risks you need to know. Learn how to reduce exposure without losing productivity, and keep your AI tools safe, reliable, and under control. Register now to start securing your AI the right way.\n🔧 Cybersecurity Tools\nVaralyze\n— It is a unified threat intelligence toolkit that connects data from sources like AbuseIPDB, VirusTotal, and URLScan to streamline threat analysis. It automates intel gathering, speeds up triage, and generates clear, actionable reports — all in one simple, Python-powered platform.\nCookiecrumbler\n— Tired of cookie pop-ups interrupting your browsing or breaking site functionality? Cookiecrumbler is a smart tool designed to automatically detect and analyze cookie consent notices on websites. Whether you're debugging web compatibility issues or identifying cookie banners that slip past existing blockers, Cookiecrumbler helps you spot them fast. It works as a web app, can run local crawls, and even integrates with other systems — no deep technical skills needed.\nEyeballer\n— It is a smart tool for penetration testers that analyzes large batches of website screenshots to quickly identify high-value targets like login pages, outdated sites, and active web apps. Instead of wasting time on parked domains or harmless 404s, Eyeballer helps you focus on what's likely vulnerable, speeding up triage in wide-scope network tests. Just feed in your screenshots and let Eyeballer highlight what matters.\n🔒 Tip of the Week\nDon't Let Video Calls Become Backdoors\n— Attackers are now using fake meeting invites to trick people into giving them remote access during video calls. They set up fake interviews or business meetings, then request screen control — sometimes even changing their name to \"Zoom\" to make it look like a system message. If you click \"Allow\" without thinking, they can take over your computer, steal data, or install malware.\nTo stay safe, disable remote control features if you don't need them. On Zoom, turn it off in Settings under \"In Meeting (Basic).\" Always double-check who's asking for access, and never approve control just because it looks official. Use browser-based tools like Google Meet when possible — they're safer because they can't easily take control of your system.\nFor extra protection, Mac users can block Zoom (or any app) from getting special permissions like \"Accessibility,\" which is needed for remote control. IT teams can also set this up across all company devices. And watch out for invites from odd emails or links — real companies won't use personal accounts or fake booking pages. Stay alert, and don't let a simple click turn into a big problem.\nConclusion\nThe most effective defenses often start with asking better questions. Are your systems behaving in ways you truly understand? How might attackers use your trusted tools against you?\nNow is the time to explore security beyond technology — look into how your team handles trust, communication, and unusual behavior. Map out where human judgment meets automation, and where attackers might find blind spots.\nCuriosity isn't just for research — it's a powerful shield when used to challenge assumptions and uncover hidden risks.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "How Breaches Start: Breaking Down 5 Real Vulns",
        "Link": "https://thehackernews.com/2025/04/how-breaches-start-breaking-down-5-real.html",
        "Summary": "Not every security vulnerability is high risk on its own - but in the hands of an advanced attacker, even small weaknesses can escalate into major breaches. These five real vulnerabilities, uncovered by Intruder’s bug-hunting team, reveal how attackers turn overlooked flaws into serious security incidents.\n1. Stealing AWS Credentials with a Redirect\n\nServer-Side Request Forgery (SSRF) is a",
        "Date": "2025-04-28",
        "Content": "Not every security vulnerability is high risk on its own - but in the hands of an advanced attacker, even small weaknesses can escalate into major breaches. These five real vulnerabilities, uncovered by\nIntruder's\nbug-hunting team, reveal how attackers turn overlooked flaws into serious security incidents.\n1. Stealing AWS Credentials with a Redirect\nServer-Side Request Forgery (SSRF) is a common vulnerability that can have a significant impact, especially in cloud-hosted applications. If a web application fetches resources from user-supplied URLs, care should be taken to ensure attackers can't manipulate requests to access unintended resources.\nWhile assessing a home-moving app running in AWS, our team tested common SSRF bypass techniques.\nThe attack chain was as follows: the app sent a webhook request to the attacker's web server, which responded with a 302 redirect to AWS's metadata service. The app followed the redirect and logged the response, which exposed sensitive metadata - including AWS credentials.\nWith these credentials, an attacker could enumerate IAM permissions and attempt to pivot deeper into the cloud environment.\nThis attack would not have been possible if the metadata service was\nenforcing IMDSv2\n- a best practice that a good\ncloud security scanner\nwould have flagged. While automated tools might not have detected the full attack chain, breaking just this part of the chain could have prevented exploitation.\n2. From Exposed .git Repo to Full Database Access\nWhile investigating an unintentionally exposed .git repository flagged by a vulnerability scan, our team discovered it belonged to a publicly accessible web application.\nReviewing the application's source code, we uncovered an authentication bypass - the login page could be accessed by supplying a hidden parameter.\nOur team gained access to a management tool, where further analysis revealed a blind SQL injection vulnerability in an authenticated page.\nExploiting this vulnerability granted access to a university's database, which, if leveraged by an attacker, could have exposed sensitive personal information of students and staff - showing how a small misconfiguration can quickly escalate into a major security risk.\n3. How a Tiny Detail Led to Remote Code Execution\nWhile hunting for bugs in a document signing app, our team noticed that, after signing a PDF, the metadata listed \"ExifTool\" as the document creator. Given ExifTool's history of critical vulnerabilities, we dug deeper.\nAlthough the application didn't disclose the tool's version, testing for recent known vulnerabilities confirmed it was vulnerable to\nCVE-2021-22204\n. By creating and uploading a malicious PDF, our team successfully gained remote command execution as the www-data user.\nThis foothold could have allowed an attacker to leverage additional vulnerabilities on the affected server, enabling them to gain root access and pivot to other machines on the network, causing extensive damage.\n4. From Self-XSS to Site-Wide Account Takeover\nCross-site scripting (XSS) is a powerful attack vector for session hijacking attacks, especially when no user interaction is required. While a 'Self-XSS' vulnerability is typically low risk, it can become dangerous when combined with another vulnerability.\nOur team uncovered this exact scenario while assessing an auction application. A Self-XSS vulnerability was discovered where a user-supplied HTTP request header was reflected in the application's response.\nNormally, this would be harmless since an attacker can't force a victim's browser to send a malicious header - but further testing uncovered a cache-poisoning vulnerability.\nBy chaining these two weaknesses, our team tricked the app into caching and serving the Self-XSS payload to all site visitors, escalating it to a site-wide persistent XSS attack.\nThis would have allowed an attacker to hijack any user account - including admin accounts.\n5. Changing a Number to Expose Sensitive Data\nAPI weaknesses are more common than you'd think. Among them, IDOR vulnerabilities require little effort to exploit beyond modifying an identifier in a request.\nThe real challenge for an attacker isn't execution but discovery - finding a vulnerable endpoint that can be used without proper authentication or authorization, and recognizing that it exposes sensitive data. Once found, exploitation can be as simple as changing the identifier to a resource that the user does not own, or just making a request to an endpoint that should be reserved for administrators.\nOur team frequently identifies IDOR, missing authentication, and broken authorization weaknesses in APIs. Here are some snippets from real HTTP requests and paths we found that exposed highly sensitive data:\nGET /organisations/edit_user?user_id=1001\n: The attacker could modify user profiles and hijack accounts\nGET /prod-applicantresumes/12031.pdf\n: The attacker could access job seekers' CVs.\nPOST /Order/Download, OrderNo=10202\n: The attacker could access customer order information.\nThese examples are about as simple as API weaknesses get, but the consequences are far-reaching. By simply changing one number and enumerating through thousands of values, entire databases of information belonging to other customers can be downloaded.\nStop breaches before they start\nThese real-world examples show how vulnerabilities can escalate into serious breaches when left unchecked. Attackers don't wait - they're always searching for new entry points. The first step to staying ahead? Knowing what attackers can access from the internet - including assets you might not even know exist. Intruder continuously discovers these unknowns, like subdomains, logins, and APIs, and scans them for exposures that other solutions miss.\nIntruder's Discovery tab - for those assets you did (or maybe didn't know) existed\nFrom applications to cloud infrastructure, find and secure it all in one, powerful platform with Intruder.\nLearn more\nor\nstart scanning with a 14 day free trial\n.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Earth Kurma Targets Southeast Asia With Rootkits and Cloud-Based Data Theft Tools",
        "Link": "https://thehackernews.com/2025/04/earth-kurma-targets-southeast-asia-with.html",
        "Summary": "Government and telecommunications sectors in Southeast Asia have become the target of a \"sophisticated\" campaign undertaken by a new advanced persistent threat (APT) group called Earth Kurma since June 2024.\nThe attacks, per Trend Micro, have leveraged custom malware, rootkits, and cloud storage services for data exfiltration. The Philippines, Vietnam, Thailand, and Malaysia are among the",
        "Date": "2025-04-28",
        "Content": "Government and telecommunications sectors in Southeast Asia have become the target of a \"sophisticated\" campaign undertaken by a new advanced persistent threat (APT) group called\nEarth Kurma\nsince June 2024.\nThe attacks, per Trend Micro, have leveraged custom malware, rootkits, and cloud storage services for data exfiltration. The Philippines, Vietnam, Thailand, and Malaysia are among the prominent targets.\n\"This campaign poses a high business risk due to targeted espionage, credential theft, persistent foothold established through kernel-level rootkits, and data exfiltration via trusted cloud platforms,\" security researchers Nick Dai and Sunny Lu\nsaid\nin an analysis published last week.\nThe threat actor's activities date back to November 2020, with the intrusions primarily relying on services like Dropbox and Microsoft OneDrive to siphon sensitive data using tools like TESDAT and SIMPOBOXSPY.\nTwo other noteworthy malware families in its arsenal include rootkits such as KRNRAT and\nMoriya\n, the latter of which has been observed previously in attacks aimed at high-profile organizations in Asia and Africa as part of an espionage campaign dubbed TunnelSnake.\nTrend Micro also said that SIMPOBOXSPY and the exfiltration script used in the attacks share overlaps with another APT group codenamed\nToddyCat\n. However, a definitive attribution remains inconclusive.\nIt's currently not known as to how the threat actors gain initial access to target environments. The initial foothold is then abused to scan and conduct lateral movement using a variety of tools like NBTSCAN, Ladon, FRPC, WMIHACKER, and ICMPinger. Also deployed is a keylogger referred to as KMLOG to harvest credentials.\nIt's worth noting that the use of the open-source\nLadon\nframework has been previously\nattributed\nto a China-linked hacking group called TA428 (aka Vicious Panda).\nPersistence on the hosts is accomplished by three different loader strains referred to as DUNLOADER, TESDAT, and DMLOADER, which are capable of loading next-stage payloads into memory and executing them. These consist of Cobalt Strike Beacons, rootkits like KRNRAT and Moriya, as well as data exfiltration malware.\nWhat distinguishes these attacks is the use of living-off-the-land (LotL) techniques to install the rootkits, where hackers employ legitimate system tools and features, in this case, syssetup.dll, rather than introducing easily detectable malware.\nWhile Moriya is engineered to inspect incoming TCP packets for a malicious payload and inject shellcode into a newly spawned \"svchost.exe\" process, KRNRAT is an amalgamation of five different open-source projects with capabilities such as process manipulation, file hiding, shellcode execution, traffic concealment, and command-and-control (C2) communication.\nKRNRAT, like Moriya, is also designed to load a user-mode agent the rootkit and inject it into \"svchost.exe.\" The user-mode agent serves as a backdoor to retrieve a follow-on payload from the C2 server.\n\"Before exfiltrating the files, several commands executed by the loader TESDAT collected specific document files with the following extensions: .pdf, .doc, .docx, .xls, .xlsx, .ppt, and .pptx,\" the researchers said. \"The documents are first placed into a newly created folder named \"tmp,\" which is then archived using WinRAR with a specific password.\"\nOne of the bespoke tools used for data exfiltration is SIMPOBOXSPY, which can upload the RAR archive to Dropbox with a specific access token. According to a Kasperksy report from October 2023, the\ngeneric DropBox uploader\nis \"probably not exclusively used by ToddyCat.\"\nODRIZ, another program used for the same purpose, uploads the collected information to OneDrive by specifying the OneDrive refresh token as an input parameter.\n\"Earth Kurma remains highly active, continuing to target countries around Southeast Asia,\" Trend Micro said. \"They have the capability to adapt to victim environments and maintain a stealthy presence.\"\n\"They can also reuse the same code base from previously identified campaigns to customize their toolsets, sometimes even utilizing the victim's infrastructure to achieve their goals.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "WooCommerce Users Targeted by Fake Patch Phishing Campaign Deploying Site Backdoors",
        "Link": "https://thehackernews.com/2025/04/woocommerce-users-targeted-by-fake.html",
        "Summary": "Cybersecurity researchers are warning about a large-scale phishing campaign targeting WooCommerce users with a fake security alert urging them to download a \"critical patch\" but deploy a backdoor instead.\nWordPress security company Patchstack described the activity as sophisticated and a variant of another campaign observed in December 2023 that employed a fake CVE ploy to breach sites running",
        "Date": "2025-04-28",
        "Content": "Cybersecurity researchers are warning about a large-scale phishing campaign targeting WooCommerce users with a fake security alert urging them to download a \"critical patch\" but deploy a backdoor instead.\nWordPress security company Patchstack described the activity as sophisticated and a variant of another campaign\nobserved\nin December 2023 that employed a fake CVE ploy to breach sites running the popular content management system (CMS).\nGiven the similarities in the phishing email lures, the bogus web pages, and the identical methods employed to conceal the malware, it's believed the latest attack wave is either the work of the same threat actor or it's a new cluster closely mimicking the earlier one.\n\"They claim the targeted websites are impacted by a (non-existent) 'Unauthenticated Administrative Access' vulnerability, and they urge you to visit their phishing website, which uses an\nIDN homograph attack\nto disguise itself as the official WooCommerce website,\" security researcher Chazz Wolcott\nsaid\n.\nRecipients of the phishing email are urged to click on a \"Download Patch\" link in order to download and install the supposed security fix. However, doing so redirects them to a spoofed WooCommerce Marketplace page hosted on the domain \"woocommėrce[.]com\" (note the use of \"ė\" in place of \"e\") from where a ZIP archive (\"authbypass-update-31297-id.zip\") can be downloaded.\nVictims are then prompted to install the patch as they would install any regular WordPress plugin, effectively unleashing the following series of malicious actions -\nCreate a new administrator-level user with an obfuscated username and a randomized password after setting up a randomly named cron job that runs every minute\nSend an HTTP GET request to an external server (\"woocommerce-services[.]com/wpapi\") with information about the username and password, along with the infected website's URL\nSend an HTTP GET request to download a next-stage obfuscated payload from a second server (\"woocommerce-help[.]com/activate\" or \"woocommerce-api[.]com/activate\")\nDecode the payload to extract multiple web shells like P.A.S.-Fork, p0wny, and WSO\nHide the malicious plugin from the list of plugin and conceal the created administrator account\nA net result of the campaign is that it allows the attackers remote control over the websites, allowing them to inject spam or sketchy ads, redirect site visitors to fraudulent sites, enlist the breached server into a botnet for carrying out DDoS attacks, and even encrypt the server resources as part of an extortion scheme.\nUsers are advised to scan their instances for suspicious plugins or administrator accounts, and ensure that the software is up-to-date.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Hackers Exploit Critical Craft CMS Flaws; Hundreds of Servers Likely Compromised",
        "Link": "https://thehackernews.com/2025/04/hackers-exploit-critical-craft-cms.html",
        "Summary": "Threat actors have been observed exploiting two newly disclosed critical security flaws in Craft CMS in zero-day attacks to breach servers and gain unauthorized access.\nThe attacks, first observed by Orange Cyberdefense SensePost on February 14, 2025, involve chaining the below vulnerabilities -\n\nCVE-2024-58136 (CVSS score: 9.0) - An improper protection of alternate path flaw in the Yii PHP",
        "Date": "2025-04-28",
        "Content": "Threat actors have been observed exploiting two newly disclosed critical security flaws in Craft CMS in zero-day attacks to breach servers and gain unauthorized access.\nThe attacks, first\nobserved\nby Orange Cyberdefense SensePost on February 14, 2025, involve chaining the below vulnerabilities -\nCVE-2024-58136\n(CVSS score: 9.0) - An improper protection of alternate path flaw in the\nYii PHP framework\nused by Craft CMS that could be exploited to access restricted functionality or resources (A regression of\nCVE-2024-4990\n)\nCVE-2025-32432\n(CVSS score: 10.0) - A remote code execution (RCE) vulnerability in Craft CMS (Patched in versions 3.9.15, 4.14.15, and 5.6.17)\nAccording to the cybersecurity company, CVE-2025-32432 resides in a built-in image transformation feature that allows site administrators to keep images to a certain format.\n\"CVE-2025-32432 relies on the fact that an unauthenticated user could send a POST request to the endpoint responsible for the image transformation and the data within the POST would be interpreted by the server,\" security researcher Nicolas Bourras said.\n\"In versions 3.x of Craft CMS, the asset ID is checked before the creation of the transformation object whereas in versions 4.x and 5.x, the asset ID is checked after. Thus, for the exploit to function with every version of Craft CMS, the threat actor needs to find a valid asset ID.\"\nThe asset ID, in the context of Craft CMS, refers to the way document files and media are managed, with each asset given a unique ID.\nThe threat actors behind the campaign have been found to run multiple POST requests until a valid asset ID is discovered, after which a Python script is executed to determine if the server is vulnerable, and if so, download a PHP file on the server from a GitHub repository.\n\"Between the 10th and the 11th of February, the threat actor improved their scripts by testing the download of filemanager.php to the web server multiple times with a Python script,\" the researcher said. \"The file filemanager.php was renamed to autoload_classmap.php on the 12th of February and was first used on the 14th of February.\"\nVulnerable Craft CMS Instances by Country\nAs of April 18, 2025, an estimated 13,000 vulnerable Craft CMS instances have been identified, out of which nearly 300 have been allegedly compromised.\n\"If you check your firewall logs or web server logs and find suspicious POST requests to the actions/assets/generate-transform Craft controller endpoint, specifically with the string __class in the body, then your site has at least been scanned for this vulnerability,\" Craft CMS\nsaid\nin an advisory. \"This is not a confirmation that your site has been compromised; it has only been probed.\"\nIf there is evidence of compromise, users are advised to refresh security keys, rotate database credentials, reset user passwords out of an abundance of caution, and block malicious requests at the firewall level.\nThe disclosure comes as an Active! Mail zero-day stack-based buffer overflow vulnerability (\nCVE-2025-42599\n, CVSS score: 9.8) has come under active exploitation in cyber attacks targeting organizations in Japan to achieve remote code execution. It has been fixed in version 6.60.06008562.\n\"If a remote third-party sends a crafted request, it may be possible to execute arbitrary code or cause a denial-of-service (DoS),\" Qualitia\nsaid\nin a bulletin.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Marks & Spencer breach linked to Scattered Spider ransomware attack",
        "Link": "https://www.bleepingcomputer.com/news/security/marks-and-spencer-breach-linked-to-scattered-spider-ransomware-attack/",
        "Summary": "Ongoing outages at British retail giant Marks & Spencer are caused by a ransomware attack believed to be conducted by a hacking collective known as \"Scattered Spider\" BleepingComputer has learned from multiple sources. [...]",
        "Date": "2025-04-28",
        "Content": "Ongoing outages at British retail giant Marks & Spencer are caused by a ransomware attack believed to be conducted by a hacking collective known as \"Scattered Spider\" BleepingComputer has learned from multiple sources.\nMarks & Spencer (M&S) is a British multinational retailer that employs 64,000 employees and sells various products, including clothing, food, and home goods in over 1,400 stores worldwide.\nLast Tuesday, M&S\nconfirmed it suffered a cyberattack\nthat caused widespread disruption, including to its\ncontactless payment system and online ordering\n. Today,\nSky News reported\nthat the disruption continues, with around 200 warehouse workers told to stay home as the company responds to the attack.\nBleepingComputer has now learned that the ongoing outages are caused by a ransomware attack that encrypted the company's servers.\nThe threat actors are believed to have first breached M&S as early as February, when they reportedly stole the Windows domain's NTDS.dit file.\nAn NTDS.dit file is the main database for Active Directory Services running on a Windows domain controller. This file contains the password hashes for Windows accounts, which can be extracted by threat actors and cracked offline to gain access to associated plain-text passwords.\nUsing these credentials, a threat actor can then laterally spread throughout the Windows domain, while stealing data from network devices and servers.\nSources told BleepingComputer that the threat actors ultimately deployed the DragonForce decryptor to VMware ESXi hosts on April 24th to encrypt virtual machines.\nBleepingComputer has learned that Marks and Spencer asked for help from CrowdStrike, Microsoft, and Fenix24 to investigate and respond to the attack.\nThe investigation so far indicates that the hacking collective known as\nScattered Spider\n, or as Microsoft calls them,\nOcto Tempest\n, is behind the attack.\nWhen contacted with this information, M&S said that they could not go into details about the cyber incident.\nDo you have information about this or another cyberattack? If you want to share the information, you can contact us securely and confidentially on Signal at LawrenceA.11, via email at lawrence.abrams@bleepingcomputer.com, or by using our\ntips form\n.\nWho is Scattered Spider?\nScattered Spider, also known as\n0ktapus\n, Starfraud,\nUNC3944\n,\nScatter Swine\n,\nOcto Tempest\n, and\nMuddled Libra\n, is a group of threat actors that are adept at using social engineering attacks, phishing, multi-factor authentication (MFA) bombing (targeted MFA fatigue), and SIM swapping to gain initial network access on large organizations.\nThe group includes young English-speaking members (as young as 16) with diverse skill sets who frequent the same hacker forums, Telegram channels, and Discord servers. These mediums are then used to plan and conduct attacks in real time.\nSome members are believed to be part of the \"Comm\" - a loose-knit community involved in violent acts and cyber incidents that have gained\nwide media attention\n.\nWhile the media and researchers commonly refer to Scattered Spider as a cohesive gang, they are actually a network of individuals, with different threat actors participating in each attack. This fluid structure is what makes it difficult to track them.\nThe group initially started in financial fraud and social media hacks but later advanced to extremely sophisticated social engineering attacks to steal cryptocurrency from individuals or breach corporations in extortion attacks.\nThe group escalated its attacks in September 2023 when they\nbreached MGM Resorts\nutilizing a social engineering attack impersonating an employee when calling the company's IT help desk. In this attack, the threat actors deployed the BlackCat ransomware to\nencrypt more than 100 VMware ESXi hypervisors\n.\nThis was a pivotal moment in the ransomware landscape as it was the first known indication that English-speaking threat actors were working with Russian-speaking ransomware gangs.\nSince then, Scattered Spider has been known to act as affiliates for\nRansomHub\n,\nQilin\n, and now DragonForce.\nDragonForce is a ransomware operation that launched in December 2023, and has\nrecently begun promoting a new service\nwhere they allow cybercrime teams to white-label their services.\nResearchers commonly associate attacks with the Scattered Spider group based on\nspecific indicators of compromise\n, including credential-stealing phishing attacks targeting SSO platforms, social engineering attacks impersonating IT help desktop, and other tactics.\nCybersecurity firm Silent Push\nreleased a report\nearlier this month outlining Scattered Spider's most recent phishing attacks.\nOver the past two years, law enforcement has been increasingly targeting the group, arresting multiple alleged members in\nthe US\n, the\nUnited Kingdom\n, and\nSpain\n.\nRelated Articles:\nMarks & Spencer pauses online orders after cyberattack\nMarks & Spencer confirms a cyberattack as customers face delayed orders\nDragonForce expands ransomware model with white-label branding scheme"
    },
    {
        "Title": "Hitachi Vantara takes servers offline after Akira ransomware attack",
        "Link": "https://www.bleepingcomputer.com/news/security/hitachi-vantara-takes-servers-offline-after-akira-ransomware-attack/",
        "Summary": "Hitachi Vantara, a subsidiary of Japanese multinational conglomerate Hitachi, was forced to take servers offline over the weekend to contain an Akira ransomware attack. [...]",
        "Date": "2025-04-28",
        "Content": "Hitachi Vantara, a subsidiary of Japanese multinational conglomerate Hitachi, was forced to take servers offline over the weekend to contain an Akira ransomware attack.\nThe company provides data storage, infrastructure systems, cloud management, and ransomware recovery services to government entities and some of the world's biggest brands, including BMW, Telefónica, T-Mobile, and China Telecom.\nIn a statement shared with BleepingComputer, Hitachi Vantara confirmed the ransomware attack, saying it hired external cybersecurity experts to investigate the incident's impact and is now working on getting all affected systems online.\n\"On April 26, 2025, Hitachi Vantara experienced a ransomware incident that has resulted in a disruption to some of our systems,\" Hitachi Vantara told BleepingComputer.\n\"Upon detecting suspicious activity, we immediately launched our incident response protocols and engaged third-party subject matter experts to support our investigation and remediation process. Additionally, we proactively took our servers offline in order to contain the incident.\n\"We are working as quickly as possible with our third-party subject matter experts to remediate this incident, continue to support our customers, and bring our systems back online in a secure manner. We thank our customers and partners for their patience and flexibility during this time.\"\nHitachi Vantara's website under maintenance (BleepingComputer)\nWhile the company didn't link the attack to a specific threat group, BleepingComputer has learned that the Akira ransomware operation is behind the breach. A source familiar with the matter also said the ransomware gang stole files from Hitachi Vantara's network and dropped ransom notes on compromised systems.\nBleepingComputer was also told that while the company's cloud services are not impacted, Hitachi Vantara systems and Hitachi Vantara Manufacturing were disrupted as part of the containment effort. Additionally, while Hitachi Vantara's remote and support operations are down, customers with self-hosted environments can still access their data as usual.\nA second source told BleepingComputer that the attack has also affected multiple projects owned by government entities.\nAkira\nsurfaced in March 2023\nand quickly gained notoriety after claiming many victims worldwide across various industries. Since then, Akira has added over 300 organizations to its dark web leak site and claimed multiple high-profile victims, including\nStanford University\nand Nissan (\nOceania\nand\nAustralia\n).\nAccording to the FBI, Akira ransomware collected roughly $42 million in ransom payments until April 2024 after\nbreaching over 250 organizations\n.\nBased on negotiation chats seen by BleepingComputer, the gang's ransom demands range from $200,000 to millions of dollars, depending on the compromised organization's size.\nRelated Articles:\nNew Akira ransomware decryptor cracks encryptions keys using GPUs\nRansomware gang encrypted network from a webcam to bypass EDR\nToronto Zoo shares update on last year's ransomware attack\nDragonForce expands ransomware model with white-label branding scheme\nMarks & Spencer pauses online orders after cyberattack"
    },
    {
        "Title": "VeriSource now says February data breach impacts 4 million people",
        "Link": "https://www.bleepingcomputer.com/news/security/verisource-now-says-february-data-breach-impacts-4-million-people/",
        "Summary": "Employee benefits administration firm VeriSource Services is warning that a data breach exposed the personal information of four million people.  [...]",
        "Date": "2025-04-28",
        "Content": "Employee benefits administration firm VeriSource Services is warning that a data breach exposed the personal information of four million people.\nVeriSource is a Texas-based employee benefits administration and HR outsourcing solutions provider with diverse clients across the U.S.\nThe firm has begun data breach notifications to impacted individuals about a cybersecurity incident that occurred in February 2024, but the impact of which it took them until April 2025 to evaluate.\nAccording to VeriSource's investigation, the incident exposed sensitive information to external threat actors.\n\"On February 28, 2024, VSI became aware of unusual activity that disrupted access to certain systems,\" reads the firm's notice shared with the authorities.\n\"Upon discovery, VSI immediately took steps to secure its network and engaged a leading, independent digital forensics and incident response firm to investigate what happened and whether any sensitive data may have been impacted.\"\n\"The investigation subsequently revealed certain personal information may have been acquired without authorization by an unknown actor on or about February 27, 2024.\"\nThe process of determining who had their information exposed as a result of this breach was only concluded on April 17, 2025, and notices of a data breach were circulated on April 23.\nIn the sample VeriSource shared with\nMaine's Attorney General's office\n, the potentially impacted data types include an employee's full name, address, date of birth, gender, and Social Security number (SSN).\nVeriSource now offers twelve months of credit monitoring, identity protection, and identity restoration services to those impacted.\nIt should be clarified that VeriSource made attempts previously to inform impacted individuals, sending letters to 55,000 people in May 2024 and another 112,000 in September 2024. However, these figures are far from the total of 4,000,000 now disclosed.\nIf you have received a notification from VeriSource, even if admittedly late, it's crucial to take advantage of the offered credit and identity protection service as soon as possible and remain vigilant for phishing attacks.\nBleepingComputer has found no VeriSource entries on ransomware extortion portals, so the exact nature of the cybersecurity incident is unclear.\nRelated Articles:\nInterlock ransomware claims DaVita attack, leaks stolen data\nYale New Haven Health data breach affects 5.5 million patients\nSK Telecom warns customer USIM data exposed in malware attack\nEntertainment services giant Legends International discloses data breach\nLandmark Admin data breach impact now reaches 1.6 million people"
    },
    {
        "Title": "Over 1,200 SAP NetWeaver servers vulnerable to actively exploited flaw",
        "Link": "https://www.bleepingcomputer.com/news/security/over-1-200-sap-netweaver-servers-vulnerable-to-actively-exploited-flaw/",
        "Summary": "Over 1,200 internet-exposed SAP NetWeaver instances are vulnerable to an actively exploited maximum severity unauthenticated file upload vulnerability that allows attackers to hijack servers. [...]",
        "Date": "2025-04-28",
        "Content": "Over 1,200 internet-exposed SAP NetWeaver instances are vulnerable to an actively exploited maximum severity unauthenticated file upload vulnerability that allows attackers to hijack servers.\nSAP NetWeaver is an application server and development platform that runs and connects SAP and non-SAP applications across different technologies.\nLast week, SAP disclosed an unauthenticated file upload vulnerability, tracked as CVE-2025-31324, in SAP NetWeaver Visual Composer, specifically the Metadata Uploader component.\nThe flaw allows remote attackers to upload arbitrary executable files on exposed instances without authenticating, achieving code execution and full system compromise.\nMultiple cybersecurity firms, including ReliaQuest, watchTowr, and Onapsis, confirmed the flaw is\nactively exploited in attacks\n, with threat actors utilizing it to drop web shells on vulnerable servers.\nA SAP spokesperson told BleepingComputer that they were aware of these attempts and released a workaround on April 8, 2024, followed by a security update that addressed CVE-2025-31324 on April 25.\nSAP told BleepingComputer that they are not aware of any cases where these attacks impacted customer data or systems.\nWidely exploited in attacks\nResearchers have now confirmed that many vulnerable SAP Netweaver servers are exposed on the internet, making them prime targets for attacks.\nThe\nShadowserver Foundation\nfound the\n427 exposed servers\n, warning of the massive exposed attack surface and the potentially severe repercussions of exploitation.\nMost of the vulnerable systems (149) are in the United States, followed by India (50), Australia (37), China (31), Germany (30), the Netherlands (13), Brazil (10), and France (10).\nLocation of vulnerable SAP NetWeaver instances\nSource: The Shadowserver Foundation\nHowever, cyber defense search engine\nOnyphe\npaints a more dire picture, telling BleepingComputer that there are 1,284 vulnerable servers exposed online, with 474 already having been compromised with webshells.\n\"Something like 20 Fortune 500/Global 500 companies are vulnerable, and many of them are compromised,\" Onyphe CTO Patrice Auffret told BleepingComputer.\nResearchers reported that the threat actors are utilizing webshells with names like, \"cache.jsp\" and \"helper.jsp.\" Howver,\nNextron Research says\nthey are also using random names, making it more difficult to find vulnerable Netweaver instances.\nWhile the number of servers is not massive, the risk is still significant, given that large enterprises and multinational corporations commonly use SAP NetWeaver.\nTo address the risk, it is recommended that the latest security update be applied by following the vendor's instructions in\nthis bulletin\n.\nIf unable to apply the update, the below mitigations are recommended:\nRestrict access to the /developmentserver/metadatauploader endpoint.\nIf Visual Composer is not in use, consider turning it off entirely.\nForward logs to SIEM and scan for unauthorized files in the servlet path.\nRedRays has also released a\nscanner tool for CVE-2025-31324\nthat can help pinpoint risks in large environments.\nBleepingComputer contacted SAP with further questions about the active exploitation and will update the story with any response.\nRelated Articles:\nSAP fixes suspected NetWeaver zero-day exploited in attacks\nActive! Mail RCE flaw exploited in attacks on Japanese orgs\nSonicWall SMA VPN devices targeted in attacks since January\nCISA tags SonicWall VPN flaw as actively exploited in attacks\nIvanti patches Connect Secure zero-day exploited since mid-March"
    },
    {
        "Title": "Kali Linux warns of update failures after losing repo signing key",
        "Link": "https://www.bleepingcomputer.com/news/linux/kali-linux-warns-of-update-failures-after-losing-repo-signing-key/",
        "Summary": "​Offensive Security warned Kali Linux users to manually install a new Kali repository signing key to avoid experiencing update failures. [...]",
        "Date": "2025-04-28",
        "Content": "​Offensive Security warned Kali Linux users to manually install a new Kali repository signing key to avoid experiencing update failures.\nThe announcement comes after OffSec lost the old repo signing key (ED444FF07D8D0BF6) and was forced to create a new one (ED65462EC8D5E4C5) signed by Kali Linux developers using signatures available on the\nUbuntu OpenPGP key server\n. However, since the key was not compromised, the old one was not removed from the keyring.\nWhen trying to get the list of latest software packages on systems still using the old key, users will see \"Missing key 827C8569F2518CC677FECA1AED65462EC8D5E4C5, which is needed to verify signature\" errors.\nWhile OffSec didn't share the date when it realized the key was lost, the company added that the Kali Linux repo was frozen on February 18th.\n\"In the coming day(s), pretty much every Kali system out there will fail to update. [..] This is not only you, this is for everyone, and this is entirely our fault. We lost access to the signing key of the repository, so we had to create a new one,\" the company\nsaid\n.\n\"At the same time, we froze the repository (you might have noticed that there was no update since Friday 18th), so nobody was impacted yet. But we're going to unfreeze the repository this week, and it's now signed with the new key.\"\nTo avoid experiencing these update issues, OffSec advises users to manually download and install the new repository signing key using the following command:\nsudo wget https://archive.kali.org/archive-keyring.gpg -O /usr/share/keyrings/kali-archive-keyring.gpg\nOffSec also provides details on how to check that the checksum of the file matches and view the contents of the updated keyring. Those who don't trust manually updating the keyring can also reinstall Kali on their systems using images updated with the new keyring.\nThis isn't the first time Kali Linux users have had to manually update their keyring to avoid having update issues. In February 2018, Kali devs also\nlet the GPG key expire\nand asked users to update the new key manually.\n\"If you don't update Kali regularly (*cough*), then your archive-keyring package is outdated, and you'll get key mismatches when working with our repositories. Sucks for you, but at least you can manually update,\" the Kali team said at the time.\nRelated Articles:\nKali Linux 2025.1a released with 1 new tool, annual theme refresh\nMicrosoft: Windows 'inetpub' folder created by security fix, don’t delete\nLinux 'io_uring' security blindspot allows stealthy rootkit attacks\nSonicWall SMA VPN devices targeted in attacks since January\nCISA warns of increased breach risks following Oracle Cloud leak"
    },
    {
        "Title": "Microsoft fixes Outlook on the web search issues, failures",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-outlook-on-the-web-search-issues-failures/",
        "Summary": "Microsoft is working on fully mitigating issues causing Outlook on the web and SharePoint Online users to experience delays or failures when searching. [...]",
        "Date": "2025-04-28",
        "Content": "Microsoft is working on fully mitigating issues causing Outlook on the web and SharePoint Online users to experience delays or failures when searching.\nTracked under\nEX1063763\nin the Microsoft 365 Admin Center, the issues are caused by infrastructure components responsible for processing users' search requests that perform below acceptable performance thresholds.\nThe company first acknowledged this Exchange Online incident at 05:21 UTC, with the latest update published at 08:22 saying that a recently deployed fix should provide relief while Redmond's engineers check if further optimizations are required to fully mitigate the search issues.\n\"Our review of telemetry indicates that the service has returned to normal performance thresholds and users may be noticing relief. However, we're validating and deploying a fix to improve performance parameters in the short term while conducting a period of monitoring,\" Microsoft said.\n\"In parallel, we're continuing to review telemetry data to determine whether additional optimization actions may be required to fully remediate impact.\"\nMicrosoft has yet to share which regions were impacted by these issues, but has tagged it as an incident, usually describing a critical service issue involving noticeable user impact.\nLast month, it resolved another incident (\nEX1035922\n) caused by a code error that blocked some Exchange Online users from searching using Outlook on the web or the new Outlook client, with affected customers seeing 'We didn't find anything, try a different keyword' errors.\nRedmond also\nmitigated an Outlook on the web outage\nimpacting users worldwide, preventing Outlook on the web users from accessing their Exchange Online mailboxes, causing problems logging into their accounts and accessing the website, and triggering server connection issues.\nIn July 2023, Microsoft fixed another issue preventing Outlook.com users from searching and triggering 401 exception errors, while one year earlier, it\nconfirmed a bug breaking Outlook search\nin desktop apps running on Windows 11 systems.\nThis is a developing story...\nRelated Articles:\nMicrosoft Exchange Online outage affects Outlook web users\nMicrosoft links recent Microsoft 365 outage to buggy update\nMicrosoft investigates global Exchange Admin Center outage\nWeek-long Exchange Online outage causes email failures, delays\nMicrosoft fixes machine learning bug flagging Adobe emails as spam"
    },
    {
        "Title": "Cloudflare mitigates record number of DDoS attacks in 2025",
        "Link": "https://www.bleepingcomputer.com/news/security/cloudflare-mitigates-record-number-of-ddos-attacks-in-2025/",
        "Summary": "Internet services giant Cloudflare says it mitigated a record number of DDoS attacks in 2024, recording a massive 358% year-over-year jump and a 198% quarter-over-quarter increase. [...]",
        "Date": "2025-04-28",
        "Content": "Internet services giant Cloudflare says it mitigated a record number of DDoS attacks in 2024, recording a massive 358% year-over-year jump and a 198% quarter-over-quarter increase.\nThese figures come from Cloudflare's 2025 Q1 DDoS Report, where the company says it mitigated a total of 21.3 million DDoS attacks in 2024.\nHowever, 2025 is looking to be an even bigger problem for online entities and companies, with Cloudflare already responding to 20.5 million DDoS attacks in just the first quarter of 2025.\nThese attacks include Cloudflare itself, whose infrastructure was targeted directly in 6.6 million attacks over an 18-day multi-vector campaign.\nAttacks directed at Cloudflare's network\nSource: Cloudflare\n\"Of the 20.5 million DDoS attacks, 16.8M were network-layer DDoS attacks, and of those 6.6M targeted Cloudflare's network infrastructure directly,\" explains Cloudflare.\n\"These attacks were part of an 18 day multi-vector DDoS campaign comprising SYN flood attacks, Mirai-generated DDoS attacks, SSDP amplification attacks to name a few.\"\nThe largest driver of this increase was network-layer attacks, which saw the sharpest growth in recent months, gaining 509% YoY.\nTotal number of DDoS attacks\nSource: Cloudflare\nMeanwhile, the trend of\nhyper-volumetric attacks\ncontinued unabated, with Cloudflare recording over 700 attacks that surpassed bandwidths of 1 Tbps (terabit per second) or packet rates of 1 billion packets per second.\nThe hyper-volumetric attacks that fall into these categories averaged eight daily during the year's first quarter, and the total count doubled compared to the previous quarter.\nCloudflare says it identified two emerging threats in 2025 Q1, namely Connectionless Lightweight Directory Access Protocol (CLDAP) and Encapsulating Security Payload (ESP) reflection/amplification attacks.\nCLDAP attacks rose by 3,488% quarter-over-quarter, manifesting as variants of LDAP that use UDP instead of TCP, which is faster but less reliable.\nCloudflare explains that UDP in CLDAP requires no handshake, allowing IP spoofing, which the attackers exploit by forging the source IP address to reflect massive amounts of traffic to their target.\nESP attacks, which have grown 2,301% quarter-over-quarter, are possible thanks to misconfigurations or vulnerabilities in exposed systems.\nObserved attack trends for 2025 Q1\nSource: Cloudflare\nGaming servers under fire\nOne attack highlighted in Cloudflare's report, which occurred during 2025 Q1, concerns a US-based hosting provider that offers services to multiplayer gaming servers for Counter-Strike GO, Team Fortress 2, and Half-Life 2: Deathmatch.\nThe attack, which came in multiple waves, targeted port 27015, which is well-known for its use in games and dictates that it be left open for both UDP and TCP, so the goal was clearly to disrupt gaming services.\nThe attack was 'hyper volumetric,' reaching 1.5 billion packets per second, though Cloudflare says it was still mitigated.\nGaming servers are\npopular targets\nfor DDoS attacks, as the disruption can be highly damaging and impactful for publishers and\nentire player communities\n.\nUpcoming record-breaking DDoS disclosure\nThe company's CEO, Matthew Prince,\nannounced on X\nlate last week that they have mitigated a record-breaking distributed denial of service (DDoS) attack peaking at 5.8 Tbps, which lasted for approximately 45 seconds.\nThe previous record, also reported by Cloudflare, was\na 5.6 Tbps DDoS attack\nattributed to a Mirai-based botnet comprising 13,000 devices.\nThe latest attack was a test run targeting the actor's infrastructure to evaluate the power of their DDoS cannon.\nPrince hinted that there was an even larger DDoS attack on the same day and promised to share more details soon.\nRelated Articles:\nX hit by 'massive cyberattack' amid Dark Storm's DDoS claims\nNew Eleven11bot botnet infects 86,000 devices for DDoS attacks\nCloudflare R2 service outage caused by password rotation error\nBrowser-in-the-Browser attacks target CS2 players' Steam accounts\nCloudflare now blocks all unencrypted traffic to its API endpoints"
    },
    {
        "Title": "SAP NetWeaver Visual Composer Flaw Under Active Exploitation",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/sap-netweaver-visual-composer-flaw-active-exploitation",
        "Summary": "CVE-2025-31324 is a maximum severity bug that attackers exploited weeks before SAP released a patch for it.",
        "Date": "2025-04-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/sap-netweaver-visual-composer-flaw-active-exploitation"
    },
    {
        "Title": "AI, Automation, and Dark Web Fuel Evolving Threat Landscape",
        "Link": "https://www.darkreading.com/remote-workforce/ai-automation-dark-web-fuel-evolving-threat-landscape",
        "Summary": "Attackers are leveraging the benefits of new technology and the availability of commodity tools, credentials, and other resources to develop sophisticated attacks more quickly than ever, putting defenders on their heels.",
        "Date": "2025-04-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/ai-automation-dark-web-fuel-evolving-threat-landscape"
    },
    {
        "Title": "Forget the Stack; Focus on Control",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/forget-stack-focus-control",
        "Summary": "Security teams are under more pressure than ever — and cybersecurity debt is adding fuel to the fire. While it can't be eliminated overnight, it can be managed.",
        "Date": "2025-04-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/forget-stack-focus-control"
    },
    {
        "Title": "DoJ Data Security Program Highlights Data Sharing Challenges",
        "Link": "https://www.darkreading.com/cyber-risk/doj-data-security-program-data-sharing-challenge",
        "Summary": "The Department of Justice announced compliance rules for the Data Security Program that will require organizations to reexamine how they do business and with whom.",
        "Date": "2025-04-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/doj-data-security-program-data-sharing-challenge"
    },
    {
        "Title": "Palo Alto Networks to Acquire AI Security Firm Protect AI",
        "Link": "https://www.securityweek.com/palo-alto-networks-to-acquire-ai-security-firm-protect-ai/",
        "Summary": "<p>Palo Alto Networks is acquiring AI security company Protect AI in a deal previously estimated at $650-700 million.</p>\n<p>The post <a href=\"https://www.securityweek.com/palo-alto-networks-to-acquire-ai-security-firm-protect-ai/\">Palo Alto Networks to Acquire AI Security Firm Protect AI</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/palo-alto-networks-to-acquire-ai-security-firm-protect-ai/"
    },
    {
        "Title": "Industry Moves for the week of April 28, 2025 - SecurityWeek",
        "Link": "https://www.securityweek.com/industry-moves/apr-28-2025/",
        "Summary": "Explore industry moves and significant changes in the industry for the week of April 28, 2025. Stay updated with the latest industry trends and shifts.",
        "Date": "2025-04-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/industry-moves/apr-28-2025/"
    },
    {
        "Title": "NetFoundry Raises $12 Million for Network Security Solutions",
        "Link": "https://www.securityweek.com/netfoundry-raises-12-million-for-network-security-solutions/",
        "Summary": "<p>Zero-trust network security solutions provider NetFoundry has raised $12 million in funding from SYN Ventures.</p>\n<p>The post <a href=\"https://www.securityweek.com/netfoundry-raises-12-million-for-network-security-solutions/\">NetFoundry Raises $12 Million for Network Security Solutions</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/netfoundry-raises-12-million-for-network-security-solutions/"
    },
    {
        "Title": "JPMorgan Chase CISO Fires Warning Shot Ahead of RSA Conference",
        "Link": "https://www.securityweek.com/jpmorgan-chase-ciso-fires-warning-shot-ahead-of-rsa-conference/",
        "Summary": "<p>This tension between hard-edged risk realism and breathless AI evangelism sets an unmistakable tone for a bellwether conference where 40,000-plus gather to do business. </p>\n<p>The post <a href=\"https://www.securityweek.com/jpmorgan-chase-ciso-fires-warning-shot-ahead-of-rsa-conference/\">JPMorgan Chase CISO Fires Warning Shot Ahead of RSA Conference</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/jpmorgan-chase-ciso-fires-warning-shot-ahead-of-rsa-conference/"
    },
    {
        "Title": "Veza Banks $108 Million Series D at $808 Million Valuation",
        "Link": "https://www.securityweek.com/veza-banks-108-million-series-d-at-808-million-valuation/",
        "Summary": "<p>San Francisco identity security play Veza closes a Series D fund round led by New Enterprise Associates (NEA).</p>\n<p>The post <a href=\"https://www.securityweek.com/veza-banks-108-million-series-d-at-808-million-valuation/\">Veza Banks $108 Million Series D at $808 Million Valuation</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/veza-banks-108-million-series-d-at-808-million-valuation/"
    },
    {
        "Title": "Craft CMS Zero-Day Exploited to Compromise Hundreds of Websites",
        "Link": "https://www.securityweek.com/craft-cms-zero-day-exploited-to-compromise-hundreds-of-websites/",
        "Summary": "<p>Threat actors have exploited a zero-day vulnerability in Craft CMS to execute PHP code on hundreds of websites.</p>\n<p>The post <a href=\"https://www.securityweek.com/craft-cms-zero-day-exploited-to-compromise-hundreds-of-websites/\">Craft CMS Zero-Day Exploited to Compromise Hundreds of Websites</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/craft-cms-zero-day-exploited-to-compromise-hundreds-of-websites/"
    },
    {
        "Title": "4 Million Affected by VeriSource Data Breach",
        "Link": "https://www.securityweek.com/4-million-affected-by-data-breach-at-verisource-services/",
        "Summary": "<p>VeriSource Services says the personal information of 4 million people was compromised in a February 2024 cyberattack.</p>\n<p>The post <a href=\"https://www.securityweek.com/4-million-affected-by-data-breach-at-verisource-services/\">4 Million Affected by VeriSource Data Breach</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/4-million-affected-by-data-breach-at-verisource-services/"
    },
    {
        "Title": "Critical Vulnerabilities Found in Planet Technology Industrial Networking Products",
        "Link": "https://www.securityweek.com/critical-vulnerabilities-found-in-planet-technology-industrial-networking-products/",
        "Summary": "<p>Planet Technology industrial switches and network management products are affected by several critical vulnerabilities. </p>\n<p>The post <a href=\"https://www.securityweek.com/critical-vulnerabilities-found-in-planet-technology-industrial-networking-products/\">Critical Vulnerabilities Found in Planet Technology Industrial Networking Products</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/critical-vulnerabilities-found-in-planet-technology-industrial-networking-products/"
    },
    {
        "Title": "RSA Conference 2025 – Pre-Event Announcements Summary (Part 3)",
        "Link": "https://www.securityweek.com/rsa-conference-2025-pre-event-announcements-summary-part-3/",
        "Summary": "<p>Hundreds of companies are showcasing their products and services this week at the 2025 edition of the RSA Conference in San Francisco.</p>\n<p>The post <a href=\"https://www.securityweek.com/rsa-conference-2025-pre-event-announcements-summary-part-3/\">RSA Conference 2025 – Pre-Event Announcements Summary (Part 3) </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/rsa-conference-2025-pre-event-announcements-summary-part-3/"
    },
    {
        "Title": "African Telecom Giant MTN Group Discloses Data Breach",
        "Link": "https://www.securityweek.com/african-telecom-giant-mtn-group-discloses-data-breach/",
        "Summary": "<p>MTN Group says the personal information of certain customers was compromised in a cybersecurity incident.</p>\n<p>The post <a href=\"https://www.securityweek.com/african-telecom-giant-mtn-group-discloses-data-breach/\">African Telecom Giant MTN Group Discloses Data Breach</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/african-telecom-giant-mtn-group-discloses-data-breach/"
    },
    {
        "Title": "Oregon Agency Won’t Say If Hackers Stole Data in Cyberattack",
        "Link": "https://www.securityweek.com/oregon-agency-wont-say-if-hackers-stole-data-in-cyberattack/",
        "Summary": "<p>Oregon’s environmental agency won’t say if a group of hackers stole data in a cyberattack that was first announced earlier this month.</p>\n<p>The post <a href=\"https://www.securityweek.com/oregon-agency-wont-say-if-hackers-stole-data-in-cyberattack/\">Oregon Agency Won&#8217;t Say If Hackers Stole Data in Cyberattack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/oregon-agency-wont-say-if-hackers-stole-data-in-cyberattack/"
    }
]