[
    {
        "Title": "DPRK Hackers Steal $137M from TRON Users in Single-Day Phishing Attack",
        "Link": "https://thehackernews.com/2025/04/dprk-hackers-steal-137m-from-tron-users.html",
        "Summary": "Multiple threat activity clusters with ties to North Korea (aka Democratic People's Republic of Korea or DPRK) have been linked to attacks targeting organizations and individuals in the Web3 and cryptocurrency space.\n\"The focus on Web3 and cryptocurrency appears to be primarily financially motivated due to the heavy sanctions that have been placed on North Korea,\" Google-owned Mandiant said in",
        "Date": "2025-04-23",
        "Content": "Multiple threat activity clusters with ties to North Korea (aka Democratic People's Republic of Korea or DPRK) have been linked to attacks targeting organizations and individuals in the Web3 and cryptocurrency space.\n\"The focus on Web3 and cryptocurrency appears to be primarily financially motivated due to the heavy sanctions that have been placed on North Korea,\" Google-owned Mandiant\nsaid\nin its M-Trends report for 2025 shared with The Hacker News.\n\"These activities aim to generate financial gains, reportedly funding North Korea's weapons of mass destruction (WMD) program and other strategic assets.\"\nThe cybersecurity firm said DPRK-nexus threat actors have developed custom tools written in a variety of languages such as Golang, C++, and Rust, and are capable of infecting Windows, Linux, and macOS operating systems.\nAt least three threat activity clusters it tracks as UNC1069, UNC4899, and UNC5342 have been found to target members of the cryptocurrency and blockchain-development community, particularly focusing on developers working on Web3-adjacent projects to obtain illicit access to cryptocurrency wallets and to the organizations that employ them.\nA brief description of each of the threat actors is below -\nUNC1069\n(Active since at least April 2018), which targets diverse industries for financial gain using social engineering ploys by sending fake meeting invites and posing as investors from reputable companies on Telegram to gain access to victims' digital assets and cryptocurrency\nUNC4899\n(Active since 2022), which is known for orchestrating job-themed campaigns that deliver malware as part of a supposed coding assignment and has previously staged supply chain compromises for financial gain (Overlaps with Jade Sleet, PUKCHONG, Slow Pisces, TraderTraitor, and UNC4899)\nUNC5342\n(Active since January 2024), which is also known for employing job-related lures to trick developers into running malware-laced projects (Overlaps with Contagious Interview, DeceptiveDevelopment, DEV#POPPER, and Famous Chollima)\nAnother North Korean threat actor of note is\nUNC4736\n, which has singled out the blockchain industry by trojanizing trading software applications and has been attributed to a cascading supply chain attack on 3CX in early 2023.\nMandiant said it also identified a separate cluster of North Korean activity tracked as UNC3782 that conducts large-scale phishing campaigns targeting the cryptocurrency sector.\n\"In 2023, UNC3782 conducted phishing operations against TRON users and transferred more than $137 million USD worth of assets in a single day,\" the company noted. \"UNC3782 launched a campaign in 2024 to target Solana users and direct them to pages that contained cryptocurrency drainers.\"\nCryptocurrency theft is one of the several means the DPRK has pursued to sidestep international sanctions. At least since 2022, an active threat cluster dubbed\nUNC5267\nhas dispatched thousands of its citizens to secure remote employment jobs at companies in the U.S., Europe, and Asia while primarily residing in China and Russia.\nA major chunk of the IT workers are said to be affiliated with the 313 General Bureau of the Munitions Industry Department, which is responsible for the nuclear program in North Korea.\nThe North Korean IT workers, in addition to making use of\nstolen identities\n, have utilized completely fabricated personas to support their activities. This is also complemented by the use of real-time deepfake technology to create convincing synthetic identities during job interviews.\n\"This offers two key operational advantages. First, it allows a single operator to interview for the same position multiple times using different synthetic personas,\" Palo Alto Networks Unit 42 researcher Evan Gordenker\nsaid\n.\n\"Second, it helps operatives avoid being identified and added to security bulletins and\nwanted notices\n. Combined, it helps DPRK IT workers enjoy enhanced operational security and decreased detectability.\"\nThe\nDPRK IT worker scheme\n, which takes insider threats to a whole new level, is engineered to funnel back their salaries to Pyongyang to advance its strategic goals, maintain long-term access to victim networks, and even extort their employers.\n\"They have also intensified extortion campaigns against employers, and they've moved to conduct operations in corporate virtual desktops, networks, and servers,\" Google Threat Intelligence Group (GTIG)'s Jamie Collier and Michael Barnhart\nsaid\nin a report last month.\n\"They now use their privileged access to steal data and enable cyberattacks, in addition to generating revenue for North Korea.\"\nIn 2024, Mandiant said it identified a suspected DPRK IT worker using at least 12 personas while seeking employment in the U.S. and Europe, highlighting the effectiveness of turning to such unconventional methods to infiltrate organizations under false pretenses.\n\"In at least one instance, two false identities were considered for a job in a U.S. company, with one DPRK IT worker winning out over the other,\" the threat intelligence firm pointed out. In another instance, \"four suspected DPRK IT workers had been employed within a 12-month period at a single organization.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Iran-Linked Hackers Target Israel with MURKYTOUR Malware via Fake Job Campaign",
        "Link": "https://thehackernews.com/2025/04/iran-linked-hackers-target-israel-with.html",
        "Summary": "The Iran-nexus threat actor known as UNC2428 has been observed delivering a backdoor known as MURKYTOUR as part of a job-themed social engineering campaign aimed at Israel in October 2024.\nGoogle-owned Mandiant described UNC2428 as a threat actor aligned with Iran that engages in cyber espionage-related operations. The intrusion set is said to have distributed the malware through a \"complex",
        "Date": "2025-04-23",
        "Content": "The Iran-nexus threat actor known as UNC2428 has been observed delivering a backdoor known as\nMURKYTOUR\nas part of a job-themed social engineering campaign aimed at Israel in October 2024.\nGoogle-owned Mandiant described UNC2428 as a threat actor aligned with Iran that engages in cyber espionage-related operations. The intrusion set is said to have distributed the malware through a \"complex chain of deception techniques.\"\n\"UNC2428's social engineering campaign targeted individuals while posing as a recruitment opportunity from Israeli defense contractor, Rafael,\" the company\nsaid\nin its annual M-Trends report for 2025.\nIndividuals who expressed interest were redirected to a site that impersonated Rafael, from where they were asked to download a tool to assist with applying for the job.\nThe tool (\"RafaelConnect.exe\") was an installer dubbed LONEFLEET that, once launched, presented a graphical user interface (GUI) to the victim in order to enter their personal information and submit their resume.\nOnce submitted, the MURKYTOUR backdoor launched as a background process by means of a launcher referred to as LEAFPILE, granting the attackers persistent access to the compromised machine.\n\"Iran-nexus threat actors incorporated graphical user interfaces (GUIs) to disguise malware execution and installation as legitimate applications or software,\" Mandiant said. \"The addition of a GUI that presents the user with a typical installer and is configured to mimic the form and function of the lure used can reduce suspicions from targeted individuals.\"\nIt's worth mentioning that the campaign\noverlaps\nwith activity that the Israel National Cyber Directorate attributed to an Iranian threat actor named Black Shadow.\nAssessed to be operating on behalf of the Iranian Ministry of Intelligence and Security (MOIS), the hacking group is known for targeting a wide range of industry verticals in Israel, including academia, tourism, communications, finance, transportation, healthcare, government, and technology.\nPer Mandiant, UNC2428 is one of the many Iranian threat activity clusters that have trained their sights on Israel in 2024. One prominent group is\nCyber Toufan\n, which targeted Israel-based users with the proprietary POKYBLIGHT wiper.\nUNC3313 is another Iran-nexus threat group that has conducted surveillance and strategic information-gathering operations via spear-phishing campaigns.\nUNC3313\n, first documented by the company in February 2022, is believed to be affiliated with\nMuddyWater\n.\n\"The threat actor hosted malware on popular file-sharing services and embedded links within training- and webinar-themed phishing lures,\" Mandiant said. \"In one such campaign, UNC3313 distributed the JELLYBEAN dropper and CANDYBOX backdoor to organizations and individuals targeted by their phishing operations.\"\nAttacks mounted by UNC3313 have leaned heavily on as many as nine different legitimate remote monitoring and management (RMM) tools, a\nsignature tactic\nof the MuddyWater group, in an attempt to ward off detection efforts and provide persistent remote access.\nThe threat intelligence firm also said it observed in July 2024 a suspected Iran-linked adversary distributing a backdoor codenamed CACTUSPAL by passing it off as an installer for the Palo Alto Networks GlobalProtect remote access software.\nThe installation wizard, upon launch, stealthily deploys the .NET backdoor that, in turn, verifies only one instance of the process is running before it communicates with an external command-and-control (C2) server.\nThe use of RMM tools notwithstanding, Iranian threat actors like\nUNC1549\nhave also been observed taking steps to incorporate cloud infrastructure into their tradecraft so as to ensure that their actions blend in with services prevalent in enterprise environments.\n\"In addition to techniques such as typosquatting and domain reuse, threat actors have found that hosting C2 nodes or payloads on cloud infrastructure and using cloud-native domains reduces the scrutiny that may be applied to their operations,\" Mandiant said.\nAny insight into the Iranian threat landscape is incomplete without\nAPT42\n(aka Charming Kitten), which is\nknown\nfor its elaborate social engineering and rapport-building efforts to harvest credentials and deliver bespoke malware for data exfiltration.\nThe threat actor, per Mandiant, deployed fake login pages masquerading as Google, Microsoft, and Yahoo! as part of their credential harvesting campaigns, using Google Sites and Dropbox to direct targets to fake Google Meet landing pages or login pages.\nIn all, the cybersecurity company said it identified more than 20 proprietary malware families – including droppers, downloaders, and backdoors – used by Iranian actors in campaigns in the Middle East in 2024. Two of the identified backdoors, DODGYLAFFA and SPAREPRIZE, have been employed by\nAPT34\n(aka OilRig) in attacks targeting Iraqi government entities.\n\"As Iran-nexus threat actors continue to pursue cyber operations that align with the interests of the Iranian regime, they will alter their methodologies to adapt to the current security landscape,\" Mandiant said.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Android Spyware Disguised as Alpine Quest App Targets Russian Military Devices",
        "Link": "https://thehackernews.com/2025/04/android-spyware-disguised-as-alpine.html",
        "Summary": "Cybersecurity researchers have revealed that Russian military personnel are the target of a new malicious campaign that distributes Android spyware under the guise of the Alpine Quest mapping software.\n\"The attackers hide this trojan inside modified Alpine Quest mapping software and distribute it in various ways, including through one of the Russian Android app catalogs,\" Doctor Web said in an",
        "Date": "2025-04-23",
        "Content": "Cybersecurity researchers have revealed that Russian military personnel are the target of a new malicious campaign that distributes Android spyware under the guise of the Alpine Quest mapping software.\n\"The attackers hide this trojan inside modified Alpine Quest mapping software and distribute it in various ways, including through one of the Russian Android app catalogs,\" Doctor Web\nsaid\nin an analysis.\nThe trojan has been found embedded in older versions of the software and propagated as a freely available variant of Alpine Quest Pro, a program with advanced functionality.\nThe Russian cybersecurity vendor said it also observed the malware, dubbed Android.Spy.1292.origin, being distributed in the form of an APK file via a fake Telegram channel.\nWhile the threat actors initially provided a link for downloading the app in one of the Russian app catalogs through the Telegram channel, the trojanized version was later distributed directly as an APK as an app update.\nWhat makes the attack campaign noteworthy is that it takes advantage of the fact that Alpine Quest is used by Russian military personnel in the Special Military Operation zone.\nOnce installed on an Android device, the malware-laced app looks and functions just like the original, allowing it to stay undetected for extended periods of time, while collecting sensitive data -\nMobile phone number and their accounts\nContact lists\nCurrent date and geolocation\nInformation about stored files, and\nApp version\nBesides sending the victim's location every time it changes to a Telegram bot, the spyware supports the ability to download and run additional modules that allow it to exfiltrate files of interest, particularly those sent via Telegram and WhatsApp.\n\"Android.Spy.1292.origin not only allows user locations to be monitored but also confidential files to be hijacked,\" Doctor Web said. \"In addition, its functionality can be expanded via the download of new modules, which allows it to then execute a wider spectrum of malicious tasks.\"\nTo mitigate the risk posed by such threats, it's advised to download Android apps only from trusted app marketplaces and avoid downloading \"free\" paid versions of software from dubious sources.\nRussian Organizations Targeted by New Windows Backdoor\nThe disclosure comes as Kaspersky revealed that various large organizations in Russia, spanning the government, finance, and industrial sectors, have been targeted by a sophisticated backdoor by masquerading it as an update for a secure networking software called ViPNet.\n\"The backdoor targets computers connected to ViPNet networks,\" the company\nsaid\nin a preliminary report. \"The backdoor was distributed inside LZH archives with a structure typical of updates for the software product in question.\"\nPresent within the archive is a malicious executable (\"msinfo32.exe\") that acts as a loader for an encrypted payload also included in the file.\n\"The loader processes the contents of the file to load the backdoor into memory,\" Kaspersky said. This backdoor is versatile: it can connect to a C2 server via TCP, allowing the attacker to steal files from infected computers and launch additional malicious components, among other things.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Three Reasons Why the Browser is Best for Stopping Phishing Attacks",
        "Link": "https://thehackernews.com/2025/04/three-reasons-why-browser-is-best-for.html",
        "Summary": "Phishing attacks remain a huge challenge for organizations in 2025. In fact, with attackers increasingly leveraging identity-based techniques over software exploits, phishing arguably poses a bigger threat than ever before.&nbsp;\nAttackers are increasingly leveraging identity-based techniques over software exploits, with phishing and stolen credentials (a byproduct of phishing) now the primary",
        "Date": "2025-04-23",
        "Content": "Phishing attacks remain a huge challenge for organizations in 2025. In fact, with attackers increasingly leveraging identity-based techniques over software exploits, phishing arguably poses a bigger threat than ever before.\nAttackers are increasingly leveraging identity-based techniques over software exploits, with phishing and stolen credentials (a byproduct of phishing) now the primary cause of breaches. Source: Verizon DBIR\nAttackers are increasingly leveraging identity-based techniques over software exploits, with phishing and stolen credentials (a byproduct of phishing) now the primary cause of breaches. Source: Verizon DBIR\nAttackers are turning to identity attacks like phishing because they can achieve all of the same objectives as they would in a traditional endpoint or network attack, simply by logging into a victim's account. And with organizations now using hundreds of internet apps across their workforce, the scope of accounts that can be phished or targeted with stolen credentials has grown exponentially.\nWith MFA-bypassing phishing kits the new normal, capable of phishing accounts protected by SMS, OTP, and push-based methods, detection controls are being put under constant pressure as prevention controls fall short.\nAttackers are bypassing detection controls\nThe majority of phishing detection and control enforcement is focused on the email and network layer — typically at the Secure Email Gateway (SEG), Secure Web Gateway (SWG)/proxy, or both.\nBut attackers know this,\nand are taking steps to avoid these controls\n, by:\nRoutinely evading IoC driven blocklists by dynamically rotating and updating commonly signatured elements like IPs, domains, and URLs.\nPreventing analysis of their phishing pages by implementing bot protection like CAPTCHA or Cloudflare Turnstile alongside other detection evasion methods.\nChanging visual and DOM elements on the page so that even when the page is loaded, detection signatures may fail to trigger.\nImplementing bot checks like Clouflare Turnstile is an effective way to bypass sandbox analysis tools\nAnd in fact, by launching multi- and cross-channel attacks, attackers are evading email-based controls entirely. Just see\nthis recent example\n, where attackers impersonating Onfido delivered their phishing attack via malicious Google ads (aka malvertising) — bypassing email altogether.\nAttackers are bypassing email by targeting their victims across IM, social media, using malicious ads, and by sending messages using trusted apps\nIt's worth pointing out the limitations of email-based solutions here too. Email has some additional checks around the sender's reputation and things like DMARC/DKIM, but these don't actually identify malicious\npages\n. Similarly, some modern email solutions are doing much deeper analysis of the\ncontent\nof an email. But… that doesn't really help with identifying the phishing sites themselves (just indicates that one might be linked in the email). This is much more appropriate for BEC-style attacks where the goal is to social engineer the victim, as opposed to linking them to a malicious page. And this still doesn't help with attacks launched over different mediums as we've highlighted above.\nHow browser-based detection and response can level the playing field\nMost phishing attacks involve the delivery of a malicious link to a user. The user clicks the link and loads a malicious page. In the vast majority of cases, the malicious page is a login portal for a specific website, where the goal for the attacker is to steal the victim's account.\nThese attacks are happening pretty much exclusively in the victim's browser. So rather than building more email or network-based controls looking from the outside-in at phishing pages accessed in the browser, there's a huge opportunity presented by building phishing detection and response capabilities\ninside\nthe browser.\nWhen we look at the history of detection and response, this makes a lot of sense. When endpoint attacks skyrocketed in the late 2000s / early 2010s, they took advantage of the fact that defenders were trying to detect malware with primarily network-based detections, signature-based analysis of files, and running files in sandboxes (which was reliably defeated with sandbox-aware malware and using things as simple as putting an execution delay in the code). But this gave way to EDR, which presented a better way of observing and intercepting malicious software in\nreal-time\n.\nEDR enabled real-time detection and response at the OS level rather than relying on traffic to and from the endpoint.\nThe key here was getting inside the data stream to be able to observe activity in real-time on the endpoint.\nWe're in a similar position today. Modern phishing attacks are happening on web pages accessed via the browser, and the tools we're relying on — email, network, even endpoint — don't have the required visibility. They're looking from the outside-in.\nCurrent phishing detection isn't in the right place to observe and stop malicious activity in real time.\nBut what if we could do detection and response from\ninside the browser?\nHere are three reasons why the browser is best for stopping phishing attacks:\n#1: Analyze pages, not links\nCommon phishing detections rely on the analysis of links or static HTML as opposed to malicious pages. Modern phishing pages are no longer static HTML — like most other modern web pages, these are dynamic web apps rendered in the browser, with JavaScript dynamically rewriting the page and launching the malicious content. This means that most basic, static checks fail to identify the malicious content running on the page.\nWithout deeper analysis, you're reliant on analyzing things like domains, URLs, and IP addresses against known-bad blocklists. But these are all highly disposable. Attackers are buying them in bulk, constantly taking over legitimate domains, and generally planning for the fact that they'll get through a lot of them. Modern phishing architecture is also able to dynamically rotate and update the links served to visitors from a continually refreshed pool (so every person that clicks the link gets served a different URL) and even going as far as using things like one-time magic links (which also means that any security team members trying to investigate the page later won't be able to do so).\nUltimately, this means that blocklists just aren't that effective — because it's trivial for attackers to change the indicators being used to create detections. If you think about the Pyramid of Pain, these indicators sit right at the bottom — the kind of thing we've been moving away from for years in the endpoint security world.\nBut in the browser, you can observe the rendered web page in all its glory. With much deeper visibility of the page (and its malicious elements) you can…\n#2: Detect TTPs, not IoCs\nEven where TTP-based detections are in play, they're typically reliant on either piecing together network requests, or loading the page in a sandbox.\nHowever, attackers are getting pretty good at evading sandbox analysis — simply by implementing bot protection by requiring user interaction with a CAPTCHA or Cloudflare Turnstile.\nImplementing bot checks like Clouflare Turnstile is an effective way to bypass sandbox analysis tools\nEven if you can get past Turnstile, then you'll need to supply the correct URL parameters and headers, and execute JavaScript, to be served the malicious page. This means that a defender who knows the domain name can't discover the malicious behavior just by making a simple HTTP(S) request to the domain.\nAnd if all this wasn't enough,\nthey're also obfuscating both visual and DOM elements to prevent signature-based detections from picking them up\n— so even if you can land on the page, there's a high chance that your detections won't trigger.\nWhen using a proxy, you'll have some visibility of the network traffic generated by a user accessing and interacting with a page. However, you'll struggle to correlate key actions like whether the user entered their password with the specific tab when dealing with the sheer volume of disorganized network traffic data.\nBut you get much better visibility of all this in the browser, with access to:\nFull decrypted HTTP traffic — not just DNS and TCP/IP metadata\nFull user interaction tracing — every click, keystroke, or DOM change can be traced\nFull inspection at every layer of execution, not just initial HTML served\nFull access to browser APIs, to correlate with browser history, local storage, attached cookies, etc.\nThis gives you everything you need to build high-fidelity detections focused on page behavior and user interaction – that is much harder for attackers to get around when compared to IoC-based detections.\nBeing in the browser enables you to build much more effective controls based on TTPs\nAnd with this new visibility, because you're in the browser and seeing the page at the same time as the user is interacting with it, you can…\n#3: Intercept in real time, not post mortem\nFor non-browser solutions,\nreal-time phishing detection is basically nonexistent\n.\nAt best, your proxy-based solution might be able to detect malicious behavior via the network traffic generated by your user interacting with the page. But because of the complexity of reconstructing network requests post-TLS-encryption, this typically happens on a time delay and is not entirely reliable.\nIf a page is flagged, it usually requires further investigation by a security team to rule out any false positives and kick off an investigation. This can take\nhours\nat best, probably\ndays\n. Then, once a page is identified as malicious and IoCs are created, it can take\ndays\nor even\nweeks\nbefore the information is distributed, TI feeds are updated, and ingested into blocklists.\nBut in the browser, you're observing the page in real-time, as the user sees it, from inside the browser. This is a game changer when it comes to not just detecting, but intercepting and shutting down attacks before a user is phished and the damage is done.\nThis changes the focus from post-mortem containment and cleanup, to pre-compromise interception in real-time.\nThe future of phishing detection and response is browser-based\nPush Security\nprovides a browser-based identity security solution that intercepts phishing attacks as they happen — in employee browsers. Being in the browser delivers a lot of advantages when it comes to detecting and intercepting phishing attacks. You see the live webpage that the user sees, as they see it, meaning you have much better visibility of malicious elements running on the page. It also means that you can implement real-time controls that kick in when a malicious element is detected.\nWhen a phishing attack hits a user with Push, regardless of the delivery channel, our browser extension inspects the webpage running in the user's browser. Push observes that the webpage is a login page and the user is entering their password into the page, detecting that:\nThe password the user is entering into the phishing site has been used to log into another site previously. This means that the password is being reused (bad) or the user is being phished (even worse).\nThe web page is cloned from a legitimate login page that has been fingerprinted by Push.\nA phishing toolkit is running on the web page.\nAs a result, the user is blocked from interacting with the phishing site and prevented from continuing.\nThese are good examples of detections that are difficult (or impossible) for an attacker to evade — you can't phish a victim if they can't enter their credentials into your phishing site!\nFind out more about how Push detects and blocks phishing attacks here.\nPush prevents users from accessing phishing pages when detected in the browser.\nLearn more\nIt doesn't stop there — Push provides comprehensive identity attack detection and response capabilities against techniques like credential stuffing, password spraying and session hijacking using stolen session tokens. You can also use Push to find and fix identity vulnerabilities across every app that your employees use like: ghost logins; SSO coverage gaps; MFA gaps; weak, breached and reused passwords; risky OAuth integrations; and more.\nIf you want to learn more about how Push helps you to detect and defeat common identity attack techniques,\nbook some time with one of our team for a live demo\n— or register an account to try it for free.\nCheck out our quick-start guide here\n.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Russian Hackers Exploit Microsoft OAuth to Target Ukraine Allies via Signal and WhatsApp",
        "Link": "https://thehackernews.com/2025/04/russian-hackers-exploit-microsoft-oauth.html",
        "Summary": "Multiple suspected Russia-linked threat actors are \"aggressively\" targeting individuals and organizations with ties to Ukraine and human rights with an aim to gain unauthorized access to Microsoft 365 accounts since early March 2025.\nThe highly targeted social engineering operations, per Volexity, are a shift from previously documented attacks that leveraged a technique known as device code",
        "Date": "2025-04-23",
        "Content": "Multiple suspected Russia-linked threat actors are \"aggressively\" targeting individuals and organizations with ties to Ukraine and human rights with an aim to gain unauthorized access to Microsoft 365 accounts since early March 2025.\nThe highly targeted social engineering operations, per Volexity, are a shift from previously documented attacks that leveraged a technique known as\ndevice code phishing\nto achieve the same goals, indicating that Russian adversaries are actively refining their tradecraft.\n\"These recently observed attacks rely heavily on one-on-one interaction with a target, as the threat actor must both convince them to click a link and send back a Microsoft-generated code,\" security researchers Charlie Gardner, Josh Duke, Matthew Meltzer, Sean Koessel, Steven Adair, and Tom Lancaster\nsaid\nin an exhaustive analysis.\nAt least two different threat clusters tracked as\nUTA0352\nand\nUTA0355\nare assessed to be behind the attacks, although the possibility that they could also be related to APT29, UTA0304, and UTA0307 hasn't been ruled out.\nThe latest set of attacks is characterized by the use of a new technique that's aimed at abusing legitimate Microsoft OAuth 2.0 Authentication workflows. The threat actors impersonate officials from various European nations and have been found to take advantage of a compromised Ukrainian Government account at least in one case to trick victims into providing a Microsoft-generated OAuth code to take control of their accounts.\nMessaging apps such as Signal and WhatsApp are used to contact targets, inviting them to join a video call or register for private meetings with various national European political officials or for upcoming events centered around Ukraine. These efforts seek to dupe victims into clicking links hosted on Microsoft 365 infrastructure.\n\"If the target responded to messages, the conversation would quickly progress towards actually scheduling an agreed-upon time for the meeting,\" Volexity said. \"As the agreed meeting time approached, the purported European political official would make contact again and share instructions on how to join the meeting.\"\nThe instructions take the form of a document, after which the supposed official sends a link to the target to join the meeting. These URLs all redirect to the official login portal for Microsoft 365.\nSpecifically, the supplied links are designed to redirect to official Microsoft URLs and generate a Microsoft Authorization Token in the process, which would then appear as part of the URI or within the body of the redirect page. The attack subsequently seeks to trick the victim into sharing the code with the threat actors.\nThis is achieved by redirecting the authenticated user to an in-browser version of Visual Studio Code at insiders.vscode[.]dev where the token is displayed to the user. Should the victim share the OAuth code, UTA0352 proceeds to generate an access token that ultimately allows access to the victim's M365 account.\nVolexity said it also observed an earlier iteration of the campaign that redirects users to the website \"vscode-redirect.azurewebsites[.]net,\" which, in turn, redirects to the\nlocalhost\nIP address (127.0.0.1).\n\"When this happens, instead of yielding a user interface with the Authorization Code, the code is only available in the URL,\" the researchers explained. \"This yields a blank page when rendered in the user's browser. The attacker must request that the user share the URL from their browser in order for the attacker to obtain the code.\"\nAnother social engineering attack identified in early April 2025 is said to have involved UTA0355 using an already compromised Ukrainian Government email account to send spear-phishing emails to targets, followed by sending messages on Signal and WhatsApp.\nThese messages invited targets to join a video conference related to Ukraine's efforts regarding investing and prosecuting \"atrocity crimes\" and the country's collaboration with international partners. While the ultimate intention of the activity is the same as UTA0352, there is a crucial difference.\nThe threat actors, like in the other instance, abuse the legitimate Microsoft 365 authentication API to gain access to the victim's email data. But the stolen OAuth authorization code is used to register a new device to the victim's Microsoft Entra ID (formerly Azure Active Directory) permanently.\nIn the next phase, the attacker orchestrates a second round of social engineering in order to convince the targets to approve a two-factor authentication request and hijack the account.\n\"In this interaction, UTA0355 requested that the victim approve a two-factor authentication (2FA) request to 'gain access to a SharePoint instance associated with the conference,'\" Volexity said. \"This was required to bypass additional security requirements, which were put in place by the victim's organization, in order to gain access to their email.\"\nWhat also makes the attack particularly effective is that the login activity, email access, and device registration are routed through proxy networks geolocated to match the victim's location, further complicating detection efforts.\nTo detect and mitigate these attacks, organizations are advised to audit newly registered devices, educate users about the risks associated with unsolicited contacts on messaging platforms, and implement conditional access policies that restrict access to organizational resources to only approved or managed devices.\n\"These recent campaigns benefit from all user interactions taking place on Microsoft's official infrastructure; there is no attacker-hosted infrastructure used in these attacks,\" the company added.\n\"Similarly, these attacks do not involve malicious or attacker-controlled OAuth applications for which the user must explicitly grant access (and thus could easily be blocked by organizations). The use of Microsoft first-party applications that already have consent granted has proven to make prevention and detection of this technique rather difficult.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Ripple's xrpl.js npm Package Backdoored to Steal Private Keys in Major Supply Chain Attack",
        "Link": "https://thehackernews.com/2025/04/ripples-xrpljs-npm-package-backdoored.html",
        "Summary": "The Ripple cryptocurrency npm JavaScript library named xrpl.js has been compromised by unknown threat actors as part of a software supply chain attack designed to harvest and exfiltrate users' private keys.\nThe malicious activity has been found to affect five different versions of the package: 4.2.1, 4.2.2, 4.2.3, 4.2.4, and 2.14.2. The issue has been addressed in versions 4.2.5 and 2.14.3.",
        "Date": "2025-04-23",
        "Content": "The Ripple cryptocurrency npm JavaScript library named\nxrpl.js\nhas been compromised by unknown threat actors as part of a software supply chain attack designed to harvest and exfiltrate users' private keys.\nThe malicious activity has been found to affect five different versions of the package: 4.2.1, 4.2.2, 4.2.3, 4.2.4, and 2.14.2. The issue has been\naddressed\nin versions 4.2.5 and 2.14.3.\nxrpl.js is a popular JavaScript API for interacting with the\nXRP Ledger\nblockchain, also called the Ripple Protocol, a cryptocurrency platform launched by Ripple Labs in 2012. The package has been\ndownloaded\nover 2.9 million times to date, attracting more than 135,000 weekly downloads.\n\"The official XPRL (Ripple) NPM package was compromised by sophisticated attackers who put in a backdoor to steal cryptocurrency private keys and gain access to cryptocurrency wallets,\" Aikido Security's Charlie Eriksen\nsaid\n.\nThe malicious code changes have been found to be introduced by a user named \"\nmukulljangid\n\" starting April 21, 2025, with the threat actors introducing a new function named checkValidityOfSeed that's engineered to transmit the stolen information to an external domain (\"0x9c[.]xyz\").\nIt's worth noting that \"mukulljangid\" likely\nbelongs to a Ripple employee\n, indicating that their npm account was hacked to pull off the supply chain attack.\nThe attacker is said to have tried different ways to sneak in the backdoor while trying to evade detection, as evidenced by the different versions released in a short span of time. There is no evidence that the associated GitHub repository has been backdoored.\nIt's not clear who is behind the attack, but it's believed that the threat actors managed to steal the developer's npm access token to tamper with the library, per Aikido.\nIn light of the incident, users relying on the xrpl.js library are advised to update their instances to the latest version (4.2.5 and 2.14.3) to mitigate potential threats.\n\"This vulnerability is in xrpl.js, a JavaScript library for interacting with the XRP Ledger,\" the XRP Ledger Foundation\nsaid\nin a post on X. \"It does not affect the XRP Ledger codebase or GitHub repository itself. Projects using xrpl.js should upgrade to v4.2.5 immediately.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Google Drops Cookie Prompt in Chrome, Adds IP Protection to Incognito",
        "Link": "https://thehackernews.com/2025/04/google-drops-cookie-prompt-in-chrome.html",
        "Summary": "Google on Tuesday revealed that it will no longer offer a standalone prompt for third-party cookies in its Chrome browser as part of its Privacy Sandbox initiative.\n\"We've made the decision to maintain our current approach to offering users third-party cookie choice in Chrome, and will not be rolling out a new standalone prompt for third-party cookies,\" Anthony Chavez, vice president of Privacy",
        "Date": "2025-04-23",
        "Content": "Google on Tuesday revealed that it will no longer offer a standalone prompt for third-party cookies in its Chrome browser as part of its Privacy Sandbox initiative.\n\"We've made the decision to maintain our current approach to offering users third-party cookie choice in Chrome, and will not be rolling out a new standalone prompt for third-party cookies,\" Anthony Chavez, vice president of Privacy Sandbox at Google,\nsaid\n.\n\"Users can continue to choose the best option for themselves in Chrome's Privacy and Security Settings.\"\nBack in July 2024, the tech giant\nsaid\nit had abandoned its plans to deprecate third-party tracking cookies and that it intends to roll out a new experience instead that lets users make an informed choice.\nGoogle said feedback from publishers, developers, regulators, and the ads industry has made it clear there are \"divergent perspectives\" on making changes that could affect the availability of third-party cookies.\nIn its place, the tech behemoth said it will continue to invest in enhancing tracking protections in Chrome's Incognito mode, which blocks third-party cookies by default. It also intends to introduce a new IP Protection feature in the third quarter of 2025.\nAlready available as an\nopen-source project\n, the feature aims to limit the availability of a user's original IP address in third-party contexts in Incognito mode to prevent cross-site tracking.\n\"In light of this update, we understand that the Privacy Sandbox APIs may have a different role to play in supporting the ecosystem,\" Chavez said. \"We'll engage with the industry to gather feedback and share an updated roadmap for these technologies, including our future areas of investment, in the coming months.\"\nIt's worth noting that while Apple Safari and Mozilla Firefox have blocked third-party cookies by default since 2020, Google has had a harder time rolling out similar protections owing to its competing interests as a browser vendor, an advertising platform, and a search engine.\nThe development also comes at a time when Google is facing\nintense\nregulatory scrutiny\nin the U.S. in recent months, with two different rulings accusing the company of maintaining a monopoly in the search and advertising markets.\nThe U.S. Department of Justice, as recently as last month, has proposed breaking up Google by divesting the Chrome web browser and forcing it to syndicate its search results as a way to restore competition to the online search market.\nAI company OpenAI said it would be interested in buying the browser if Google is forced to sell it off and \"introduce users into what an AI-first [browser] looks like,\" per\nBloomberg\nand\nReuters\n.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Russian army targeted by new Android malware hidden in mapping app",
        "Link": "https://www.bleepingcomputer.com/news/security/russian-army-targeted-by-new-android-malware-hidden-in-mapping-app/",
        "Summary": "A new Android malware has been discovered hidden inside trojanized versions of the Alpine Quest mapping app, which is reportedly used by Russian soldiers as part of war zone operational planning. [...]",
        "Date": "2025-04-23",
        "Content": "A new Android malware has been discovered hidden inside trojanized versions of the Alpine Quest mapping app, which is reportedly used by Russian soldiers as part of war zone operational planning.\nAttackers promote the trojanized app as a free, cracked version of the premium Alpine Quest Pro, using Telegram channels and Russian app catalogs for distribution.\nAlpineQuest is a legitimate GPS and topographic mapping app for Android used by adventurers, athletes, search-and-rescue teams, and military personnel, valued for its offline capabilities and precision.\nThe app has two versions: a free\nLite version\nwith limited features and a paid\nPro version\nthat is free of tracking libraries, analytics, and advertisements.\nThe spyware, which was discovered by researchers at Russian mobile antivirus company\nDoctor Web\n, hides inside a fully working Alpine Quest app, reducing suspicion and creating valuable data theft opportunities.\nOnce launched, it attempts to steal communication data and sensitive documents from the device, potentially revealing details about army operations. Specifically, the spyware performs the following actions:\nSends the user's phone number, contacts, geolocation, file info, and app version to attackers.\nMonitors location changes in real-time and sends updates to a Telegram bot.\nDownloads additional modules to steal confidential files, especially those sent via Telegram and WhatsApp.\nSeeks the 'locLog' file from Alpine Quest, which contains location history logs.\nDoctor Web tracks the previously undocumented spyware as 'Android.Spy. 1292.origin' but did not make any attributions about its origin in its report. Indicators of compromise are\navailable here\n.\nTelegram channel distributing the trojanized AlpineQuest app\nSource: Doctor Web\nTurning the tables\nThe tactic of targeting soldiers was previously associated with Russian hacking operations, often linked to state-sponsored threat groups collecting intelligence for the Russian army.\nIn December 2022, hackers using a compromised Ukrainian Ministry of Defense email account attempted subsequent infections by\nusing DELTA\n, a Ukrainian intelligence collection and management system as bait.\nIn October 2024, the Russian threat group 'UNC5812' targeted Ukrainian conscripts with Windows and Android malware via a fake agency named '\nCivil Defense\n.'\nMore recently, in February 2025, Google researchers revealed that Russian threat actors of the APT44 group used malicious QR codes to trick targets into\nsyncing their Signal accounts\nwith unauthorized devices.\nThe discovery of the trojanized AlpineQuest app shows that these sneaky attacks are orchestrated from both ends of the conflict, as intelligence collection remains crucial in gaining battlefield advantage.\nRelated Articles:\nNew North Korean Android spyware slips onto Google Play\nSerbian police used Cellebrite zero-day hack to unlock Android phones\nSpyLend Android malware downloaded 100,000 times from Google Play\nNew Android malware steals your credit cards for NFC relay attacks\nRussian hackers attack Western military mission using malicious drive"
    },
    {
        "Title": "WhatsApp's new Advanced Chat Privacy protects sensitive messages",
        "Link": "https://www.bleepingcomputer.com/news/security/whatsapps-new-advanced-chat-privacy-protects-sensitive-messages/",
        "Summary": "WhatsApp has introduced a new Advanced Chat Privacy feature to protect sensitive information exchanged in private chats and group conversations. [...]",
        "Date": "2025-04-23",
        "Content": "WhatsApp has introduced a new Advanced Chat Privacy feature to protect sensitive information exchanged in private chats and group conversations.\nThe new privacy option can be enabled after tapping the chat name and is designed to prevent attempts to save media and export chat content.\n\"Today we're introducing our latest layer for privacy called 'Advanced Chat Privacy.' This new setting available in both chats and groups helps prevent others from taking content outside of WhatsApp for when you may want extra privacy,\"\nWhatsApp said\n.\n\"When the setting is on, you can block others from exporting chats, auto-downloading media to their phone, and using messages for AI features. That way everyone in the chat has greater confidence that no one can take what is being said outside the chat.\"\nThe company added that this is the first version of this feature, and it's rolling out to all users who have updated WhatsApp to the latest version. WhatsApp is also working on adding more protections to Advanced Chat Privacy to make it even more effective.\nHowever, it's important to note that, even after enabling Advanced Chat Privacy, there are still ways to extract sensitive media and information, such as taking a picture of the WhatsApp conversation if screenshots are blocked.\nWhatsApp Advanced Chat Privacy (WhatsApp)\n​The new Advanced Chat Privacy feature is part of a broader effort to make communicating using WhatsApp more secure, which started almost seven years ago when the company\nintroduced end-to-end encryption\n.\nFive years later, in October 2021, it began rolling out\nend-to-end encrypted chat backups\nto iOS and Android devices. In December of the same year, WhatsApp expanded privacy controls by\nadding support for default disappearing messages\nto all new chats.\nMore recently, WhatsApp added support for\nlocking chats\nusing a password or fingerprint, introduced a Secret Code feature to hide the locked chats, and started allowing Android and iOS users to\nhide their location\nduring calls by proxying the connection through WhatsApp's servers.\nSince October 2024, WhatsApp has also\nbegun encrypting contact databases\nfor privacy-preserving synchronization, ensuring that contact lists bind to accounts rather than devices, allowing easy management between device changes or replacements.\nMeta announced\nin early 2020\nthat more than two billion people from over 180 countries were using the WhatsApp video calling and instant messaging platform.\nRelated Articles:\nMeta to resume AI training on content shared by Europeans\nWhatsApp flaw can let attackers run malicious code on Windows PCs\nWhatsApp's Meta AI is now rolling out in Europe, and it can't be turned off\nWhatsApp patched zero-click flaw exploited in Paragon spyware attacks\nChrome 136 fixes 20-year browser history privacy risk"
    },
    {
        "Title": "Blue Shield of California leaked health data of 4.7 million members to Google",
        "Link": "https://www.bleepingcomputer.com/news/security/blue-shield-of-california-leaked-health-data-of-47-million-members-to-google/",
        "Summary": "Blue Shield of California disclosed it suffered a data breach after exposing protected health information of 4.7 million members to Google's analytics and advertisement platforms. [...]",
        "Date": "2025-04-23",
        "Content": "Blue Shield of California disclosed it suffered a data breach after exposing protected health information of 4.7 million members to Google's analytics and advertisement platforms.\nThe nonprofit health plan, which serves nearly 6 million members across California, published a data breach notification on its website stating that member data was exposed between April 2021 and January 2024.\nToday, the United States Department of Health and Human Services\nbreach portal\nwas updated to state that the leak exposed 4.7 million members' protected health data.\nSource: ocrportal.hhs.gov\nAccording to the notice, the exposure was caused by a misconfiguration of Google Analytics on certain Blue Shield sites. This resulted in the sensitive data potentially being shared with Google advertising platforms and advertisers.\n\"On February 11, 2025, Blue Shield discovered that, between April 2021 and January 2024, Google Analytics was configured in a way that allowed certain member data to be shared with Google's advertising product, Google Ads, that likely included protected health information,\"\nreads the notice\n.\n\"Google may have used this data to conduct focused ad campaigns back to those individual members.\"\nThe data types exposed as a result of the misconfiguration include:\nInsurance plan name\nType and group number\nCity and zip code\nGender\nFamily size\nBlue Shield assigned identifiers for members' online accounts\nmedical claim service date and service provider, patient name, and patient financial responsibility\n\"Find a Doctor\" search criteria and results (location, plan name and type, provider name and type)\nBlue Shield noted that other personal information, such as Social Security numbers, driver's license numbers, banking, and credit card information, were not exposed as a result of this incident.\nStill, it is recommended that members stay vigilant and closely monitor their account statements and credit reports to identify unauthorized/suspicious activity.\nThe organization has not offered identity theft protection services, and it's unclear whether individual notices will be sent to impacted members in the future.\nThis is the second large-scale IT incident disclosed by Blue Shield of California in under a year.\nLast year, nearly one million health plan members had their data\nstolen by BlackSuit ransomware\nactors who breached the organization's software solutions provider, Connexure (formerly Young Consulting).\nRelated Articles:\nUS lab testing provider exposed health data of 1.6 million people\nSK Telecom warns customer USIM data exposed in malware attack\nEntertainment services giant Legends International discloses data breach\nAhold Delhaize confirms data theft after INC ransomware claims attack\nLandmark Admin data breach impact now reaches 1.6 million people"
    },
    {
        "Title": "FBI: US lost record $16.6 billion to cybercrime in 2024",
        "Link": "https://www.bleepingcomputer.com/news/security/fbi-us-lost-record-166-billion-to-cybercrime-in-2024/",
        "Summary": "The FBI says cybercriminals have stolen a record $16,6 billion in 2024, marking an increase in losses of over 33% compared to the previous year. [...]",
        "Date": "2025-04-23",
        "Content": "The FBI says cybercriminals have stolen a record $16,6 billion in 2024, marking an increase in losses of over 33% compared to\nthe previous year\n.\nAccording to the bureau's annual Internet Crime Complaint Center (IC3) report, IC3 recorded 859,532 complaints last year (256,256 with actual loss), amounting to an average loss of $19,372.\nThe most impacted group is older Americans, especially people over 60, who filed 147,127 complaints linked to approximately $4.8 billion in losses.\n\"Last year saw a new record for losses reported to IC3, totaling a staggering $16.6 billion. Fraud represented the bulk of reported losses in 2024, and ransomware was again the most pervasive threat to critical infrastructure, with complaints rising 9% from 2023,\"\nsaid B. Chad Yarbrough\n, the FBI's Operations Director for Criminal and Cyber.\n\"Since its founding, IC3 has received over 9 million complaints of malicious activity. During its infancy, IC3 received roughly 2,000 complaints every month. For the past five years, IC3 has averaged more than 2,000 complaints every day.\"\nOver the past five years, IC3 received 4.2 million complaints linked to $50.5 billion in losses, with an average of 836,000 complaints recorded yearly.\nTrends since 2020 (FBI IC3)\nHowever, it's important to note that all figures mentioned in IC3's report are based on known online crime cases discovered by law enforcement or reported by victims directly.\nAs such, they represent only a fraction of the actual losses caused by cybercrime each year in the United States and worldwide, as many incidents will go undetected or are never reported to the authorities.\nFor instance, when estimating the impact of ransomware attacks, the estimated losses only include reported ransom payments (a small part of what companies pay yearly to recover their data and restore systems after such incidents).\n\"Regarding ransomware adjusted losses, this number does not include estimates of lost business, time, wages, files, or equipment, or any third-party remediation services acquired by an entity,\" the IC3 report warns.\n\"In some cases, entities do not report any loss amount to FBI, thereby creating an artificially low overall ransomware loss rate. Lastly, the number only represents what entities report to FBI via IC3 and does not account for the entity directly reporting to FBI field offices/agents.\"\nIC3's 2023 Internet Crime Report follows a Friday public service announcement warning that some scammers are\nalso impersonating IC3 employees\nand offering to \"help\" fraud victims recover money lost to other scammers.\nRelated Articles:\nFBI: Scammers pose as FBI IC3 employees to 'help' recover lost funds\nMITRE warns that funding for critical CVE program expires today\nCybersecurity firm buying hacker forum accounts to spy on cybercriminals\nEncryptHub's dual life: Cybercriminal vs Windows bug-bounty researcher\nCISA warns of Fast Flux DNS evasion used by cybercrime gangs"
    },
    {
        "Title": "ASUS releases fix for AMI bug that lets hackers brick servers",
        "Link": "https://www.bleepingcomputer.com/news/security/asus-releases-fix-for-ami-bug-that-lets-hackers-brick-servers/",
        "Summary": "ASUS has released security updates to address CVE-2024-54085, a maximum severity flaw that could allow attackers to hijack and potentially brick servers. [...]",
        "Date": "2025-04-23",
        "Content": "ASUS has released security updates to address CVE-2024-54085, a maximum severity flaw that could allow attackers to hijack and potentially brick servers.\nThe flaw impacts American Megatrends International's MegaRAC Baseboard Management Controller (BMC) software, used by over a dozen server hardware vendors, including HPE, ASUS, and ASRock.\nThe\nCVE-2024-54085\nflaw is remotely exploitable, potentially leading to malware infections, firmware modifications, and irreversible physical damage through over-volting.\n\"A local or remote attacker can exploit the vulnerability by accessing the remote management interfaces (Redfish) or the internal host to the BMC interface (Redfish),\"\nexplained Eclypsium in a related report\n.\n\"Exploitation of this vulnerability allows an attacker to remotely control the compromised server, remotely deploy malware, ransomware, firmware tampering, bricking motherboard components (BMC or potentially BIOS/UEFI), potential server physical damage (over-voltage / bricking), and indefinite reboot loops that a victim cannot stop.\"\nThough AMI\nreleased a bulletin\nalong with patches on March 11, 2025, time was needed for impacted OEMs to implement the fixes on their products.\nToday, ASUS announced they have released fixes for CVE-2024-54085 for four motherboard models impacted by the bug.\nThe updates and recommended BMC firmware version users should upgrade to are:\nPRO WS W790E-SAGE SE\n– version 1.1.57 (\ndownload from here\n)\nPRO WS W680M-ACE SE\n– version 1.1.21(\ndownload from here\n)\nPRO WS WRX90E-SAGE SE\n– version 2.1.28 (\ndownload from here\n)\nPro WS WRX80E-SAGE SE WIFI\n– version 1.34.0 (\ndownload from here\n)\nGiven the severity of the vulnerability and the ability to perform remote exploitation, it is crucial to perform the firmware update as soon as possible.\nAfter downloading the latest BMC firmware update (.ima file), you can apply it through the web interface > Maintenance > Firmware Update, select the file, and click 'Start Firmware Update.' It is also recommended that you check the 'Full Flash' option.\nFor detailed instructions on how to perform MBC firmware updates safely and troubleshooting,\ncheck ASUS FAQ here\n.\nRelated Articles:\nASUS warns of critical auth bypass flaw in routers using AiCloud\nActive! Mail RCE flaw exploited in attacks on Japanese orgs\nCritical Erlang/OTP SSH RCE bug now has public exploits, patch now\nCritical Erlang/OTP SSH pre-auth RCE is 'Surprisingly Easy' to exploit, patch now\nWindows NTLM hash leak flaw exploited in phishing attacks on governments"
    },
    {
        "Title": "Phishing detection is broken: Why most attacks feel like a zero day",
        "Link": "https://www.bleepingcomputer.com/news/security/phishing-detection-is-broken-why-most-attacks-feel-like-a-zero-day/",
        "Summary": "Phishing attacks now evade email filters, proxies, and MFA — making every attack feel like a zero-day. This article from Push Security breaks down why detection is failing and how real-time, in-browser analysis can help turn the tide. [...]",
        "Date": "2025-04-23",
        "Content": "Phishing attacks remain a huge challenge for organizations in 2025. In fact, with attackers increasingly leveraging identity-based techniques over software exploits, phishing arguably poses a bigger threat than ever before.\nWith MFA-bypassing phishing kits the new normal, capable of phishing accounts protected by SMS, OTP, and push-based methods, detection controls are being put under constant pressure as prevention controls fall short.\nA key challenge with phishing detection is that based on the indicators that we as an industry use to commonly detect phishing pages, pretty much every phishing attack looks different and uses a unique combination of domain, URL, IPs, page composition, target app, etc. Effectively, every phishing attack is completely novel. You might even describe them as “zero-days” (cue the collective sharp intake of breath)...\nThe goal here isn’t to sensationalize phishing attacks — quite the opposite. Rather, this shines a light on the state of phishing detection controls. Frankly, if every phishing attack is a zero-day, something has gone very wrong with how we detect these attacks…\nPhishing detection 101\nMost phishing attacks involve the delivery of a malicious link to a user. The user clicks the link and loads a malicious page. In the vast majority of cases, the malicious page is a login portal for a specific website, where the goal for the attacker is to steal the victim’s account.\nPhishing detection, at its core, relies on blocklists made up of indicators of compromise (IoCs) relating to phishing pages that have been successfully identified as malicious. These IoCs consist of malicious domains, URLs, and IPs that have appeared in an attack.\nIoCs are collected by security vendors and service providers across a range of sources. Mostly though, the malicious page needs to be used in a phishing campaign before it has a chance of being detected. This means that a would-be victim needs to interact with it in some way — either by falling for a phishing attack, or reporting it as suspicious.\nOnce a page is flagged, it can be investigated — either manually (by a security person) or automatically (by a product/tool). If the page can be accessed and analyzed, and malicious content is found (more on this later) then the page’s IoCs can be collected and added to a blocklist.\nThis information will then begin to circulate across the various threat intelligence feeds and security products leveraging this information. The majority of phishing detection and control enforcement is focused at the email and network layer — typically at the Secure Email Gateway (SEG), Secure Web Gateway (SWG)/proxy, or both.\nIoC-based blocklists underpin phishing detection and blocking\nIf you’re following the thought pattern here, you can probably already see the root of the problem. To detect and block a phishing page, it needs to be used in an attack first…\nProtect and defend your identity attack surface with Push Security\nBook a demo to see how Push's browser-based identity security platform prevents account takeover attacks like MFA-bypass phishing, credential stuffing, password spraying, and session hijacking.\nFind, fix, and defend workforce identities where they're created and used — in employee browsers.\nBook a demo or try it for free\nWhy most phishing attacks are completely novel\nAttackers know that phishing detection and blocking:\nRelies on blocklisting IoCs like domains, URLs and IPs\nIs situated at the email and network layer\nRequires that a page is accessed and analyzed before it can be blocked\nThese methods have remained practically unchanged for more than a decade. So it stands to reason that attackers are getting pretty good at avoiding them.\nIt’s easy for attackers to evade IoC-based detections\nPhishing domains are highly disposable by nature. Attackers are buying them in bulk, constantly taking over legitimate domains, and generally planning for the fact that they’ll get through a lot of them.\nModern phishing architecture is also able to dynamically rotate and update commonly signatured elements — for example, by dynamically rotating the links served to visitors from a continually refreshed pool (so every person that clicks the link gets served a different URL) and even going as far as using things like one-time magic links (which also means that any security team members trying to investigate the page later won’t be able to do so).\nYou could look at which IP address the user connects to, but these days it’s very simple for attackers to add a new IP to their cloud-hosted server. If a domain is flagged as known-bad, the attacker only has to register a new domain, or compromise a WordPress server on an already trusted domain. Both of these things are happening on a massive scale as attackers pre-plan for the fact that their domains will be burned at some point.\nUltimately, this means that blocklists just aren’t that effective — because it’s trivial for attackers to change the indicators being used to create detections. If you think about the Pyramid of Pain, these indicators sit right at the bottom — the kind of thing we’ve been moving away from for years in the endpoint security world.\nPhishing doesn’t just happen over email\nTo evade email-based detections, attackers are going multi- and cross-channel with their attacks.\nAttackers are bypassing email by targeting their victims across IM, social media, using malicious ads, and by sending messages using trusted apps\nNot only are attackers using different phishing vectors, they’re chaining them together to prevent security tools from intercepting the link. So for example, a social media message that sends you a non-malicious PDF with a link embedded in it, that finally directs you to a malicious webpage.\nIt’s worth also pointing out the limitations of email-based solutions here too. Email has some additional checks around the sender’s reputation and things like DMARC/DKIM, but these don’t actually identify malicious pages. Similarly, some modern email solutions are doing much deeper analysis of the content of an email. But… that doesn’t really help with identifying the phishing sites themselves (just indicates that one might be linked in the email). This is much more appropriate for BEC-style attacks where the goal is to social engineer the victim, as opposed to linking them to a malicious page. And this still doesn’t help with attacks launched over different mediums as we’ve highlighted above.\nIn any case, while modern email solutions can bring a lot more to the table, neither email or network (proxy) based tools can’t definitively know that a page is malicious unless they can access the page and analyze it…\nAttackers are preventing their pages from being analyzed\nBoth email and network (proxy) based solutions rely on being able to inspect and analyze a page to identify whether it is malicious or not, after which IoCs are generated that can be enforced when a link is clicked (or received in your email inbox).\nModern phishing pages aren’t static HTML — like most other modern web pages, these are dynamic web apps rendered in the browser, with JavaScript dynamically rewriting the page and launching the malicious content. This means that most basic, static checks fail to identify the malicious content running on the page.\nTo address this, both email and network security tools will try to explode links in a sandbox to observe the page’s behavior. But attackers are getting around this simply by implementing bot protection by requiring user interaction with a CAPTCHA or Cloudflare Turnstile.\nImplementing bot checks like Clouflare Turnstile is an effective way to bypass sandbox analysis tools\nEven if you can get past Turnstile, then you’ll need to supply the correct URL parameters and headers, and execute JavaScript, to be served the malicious page. This means that a defender who knows the domain name can’t discover the malicious behavior just by making a simple HTTP(S) request to the domain.\nAnd if all this wasn’t enough,\nthey’re also obfuscating both visual and DOM elements to prevent signature-based detections from picking them up\n— so even if you can land on the page, there’s a high chance that your detections won’t trigger.\nPhishing attacks are novel because phishing detection is post mortem\nThe result of these detection evasion and obfuscation techniques is that real-time phishing detection is basically nonexistent.\nAt best, your proxy-based solution might be able to detect malicious behavior via the network traffic generated by your user interacting with the page. But because of the complexity of reconstructing network requests post-TLS-encryption, this typically happens on a time delay and is not entirely reliable.\nIf a page is flagged, it usually requires further investigation by a security team to rule out any false positives and kick off an investigation. This can take hours at best, probably days. Then, once a page is identified as malicious and IoCs are created, it can take days or even weeks before the information is distributed, TI feeds are updated, and ingested into blocklists.\nThe result? Most phishing attacks are entirely novel because phishing detection is inherently post mortem — it relies on known-bads. How does something become known-bad? When a user is phished…\nTo fix phishing detection, we need real-time analysis\nIt’s clear that how we detect and block phishing attacks is fundamentally flawed. The good news is, we’ve been here before.\nWhen endpoint attacks skyrocketed in the late 2000s / early 2010s, they took advantage of the fact that defenders were trying to detect malware with primarily network-based detections, signature-based analysis of files, and running files in sandboxes (which was reliably defeated with sandbox-aware malware and using things as simple as putting an execution delay in the code). But this gave way to EDR, which presented a better way of observing and intercepting malicious software in real-time.\nEDR enabled real-time detection and response at the OS level rather than relying on traffic to and from the endpoint.\nThe key here was getting inside the data stream to be able to observe activity in real-time on the endpoint.\nWe’re in a similar position today. Modern phishing attacks are happening on web pages accessed via the browser, and the tools we’re relying on — email, network, even endpoint — don’t have the required visibility. They’re looking from the outside-in.\nIn many ways, the browser is the new Operating System. It’s where modern work predominantly takes place — and where attacks are happening too.\nCurrent phishing detection isn’t in the right place to observe and stop malicious activity in real time.\nTo stop phishing attacks as they happen, we need to be able to observe the page in real-time, as the user sees it from inside the browser. Not in a sandbox — seeing the real page, at the same time as the user. Only then can we build the detection and containment controls required to move phishing beyond the current cat-and-mouse game, where attackers are always two steps ahead.\nGetting real-time visibility of page/user behavior and malicious toolkits running on the page is key to moving to TTP-based detections, rather than chasing quickly-changing IoCs\nThe future of phishing detection and response is browser based\nPush Security\nprovides a browser-based identity security solution that intercepts phishing attacks as they happen — in employee browsers. Being in the browser delivers a lot of advantages when it comes to detecting and intercepting phishing attacks. You see the live webpage that the user sees, as they see it, meaning you have much better visibility of malicious elements running on the page. It also means that you can implement real-time controls that kick in when a malicious element is detected.\nThere’s a clear difference when you compare a phishing attack with and without Push.\nHere, an attacker hacks a WordPress blog to get a reputable domain and then runs a phishing toolkit on the webpage. They email one of your employees a link to it. Your SWG or email scanning solution inspects it in a sandbox but the phish kit detects this and redirects to a benign site so that it passes the inspection.\nYour user gets the email with the link and is now free to interact with the phishing page. They enter their credentials plus MFA code into the page and voila! The attacker steals the authenticated session and takes over the user’s account.\nBut with Push, our browser extension inspects the webpage running in the user's browser. Push observes that the webpage is a login page and the user is entering their password into the page, detecting that:\nThe password the user is entering into the phishing site has been used to log into another site previously. This means that the password is being reused (bad) or the user is being phished (even worse).\nThe web page is cloned from a legitimate login page that has been fingerprinted by Push.\nA phishing toolkit is running on the web page.\nAs a result, the user is blocked from interacting with the phishing site and prevented from continuing.\nThese are good examples of detections that are difficult (or impossible) for an attacker to evade — you can’t phish a victim if they can’t enter their credentials into your phishing site!\nFind out more about how Push detects and blocks phishing attacks here.\nLearn more\nIt doesn’t stop there — Push provides comprehensive identity attack detection and response capabilities against techniques like credential stuffing, password spraying and session hijacking using stolen session tokens. You can also use Push to find and fix identity vulnerabilities across every app that your employees use like: ghost logins; SSO coverage gaps; MFA gaps; weak, breached and reused passwords; risky OAuth integrations; and more.\nIf you want to learn more about how Push helps you to detect and defeat common identity attack techniques,\nbook some time with one of our team for a live demo\n— or register an account to try it for free.\nCheck out our quick-start guide here\n.\nSponsored and written by\nPush Security\n."
    },
    {
        "Title": "Microsoft fixes Remote Desktop freezes caused by Windows updates",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-remote-desktop-freezes-caused-by-windows-updates/",
        "Summary": "​Microsoft has resolved a known issue causing Remote Desktop sessions to freeze on Windows Server 2025 and Windows 11 24H2 devices. [...]",
        "Date": "2025-04-23",
        "Content": "​Microsoft has resolved a known issue causing Remote Desktop sessions to freeze on Windows Server 2025 and Windows 11 24H2 devices.\nWhile the issue affecting Windows 11 systems was addressed on February 25 with the\nKB5052093\noptional update, Microsoft says it has also fixed it on impacted Windows Server devices with the\nKB5055523\nPatch Tuesday cumulative update on April 8.\n\"After installing the February 2025 Security update (KB5051987), released February 11, 2025, and later updates, on Windows Server 2025 devices, you might experience Remote Desktop sessions freezing shortly after connection,\" the company\nsaid\n.\n\"When this issue occurs, mouse and keyboard input become unresponsive within the session, requiring users to disconnect and reconnect. We recommend you install the latest update for your device as it contains important improvements and issue resolutions, including this one.\"\nLast month, Microsoft also used a Windows feature known as Known Issue Rollback (KIR), which reverses buggy non-security updates, to resolve\nsimilar Remote Desktop and RDS connection issues\ncaused by Windows 11 24H2 updates released since January 2025.\nAs Redmond explained, when establishing UDP connections from Windows 11 24H2 PCs to RDS hosts on Windows Server 2016 systems, users faced RDP disconnections lasting up to 65 seconds on impacted PCs.\nWith this month's cumulative updates, a permanent fix addressing the RDP disconnection problems for home users was also made generally available.\nToday, Microsoft announced that a long-standing bug\ncausing blue screen errors and installation issues\non Windows Server 2025 systems with over 256 logical processors was resolved in updates released since the\nKB5046617\ncumulative update issued as part of the November Patch Tuesday.\nEarlier this month, it said that some Windows users\nmight experience issues logging into their accounts\nusing Windows Hello after installing the April 2025 security updates on server and client devices.\nThe company also warned that some Windows Server 2025 domain controllers (DCs)\nmight become unreachable\nafter being restarted, causing services and apps to fail.\nRelated Articles:\nMicrosoft fixes Remote Desktop issues caused by Windows updates\nRecent Windows Server 2025 updates cause Remote Desktop freezes\nMicrosoft: Recent Windows updates cause Remote Desktop issues\nMicrosoft fixes Windows Server 2025 blue screen, install issues\nMicrosoft: Windows Server 2025 restarts break connectivity on some DCs"
    },
    {
        "Title": "Microsoft fixes Windows Server 2025 blue screen, install issues",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-windows-server-2025-blue-screen-and-install-issues/",
        "Summary": "Microsoft has fixed several known issues that caused Blue Screen of Death (BSOD) and installation issues on Windows Server 2025 systems with a high core count. [...]",
        "Date": "2025-04-23",
        "Content": "Microsoft has fixed several known issues that caused Blue Screen of Death (BSOD) and installation issues on Windows Server 2025 systems with a high core count.\nAs Redmond said when it\nacknowledged this known issue\nin October, impacted devices may experience a wide range of symptoms, including Windows Server 2025 installation or upgrading processes failing or hanging, and server start-up taking as much as three hours or more in some cases.\nAffected systems might also get blue screen errors when launching, restarting, or attempting to run apps. However, these issues are not consistently triggered on impacted servers.\n\"Servers which have a high number of logical processors might experience issues running Windows Server 2025. This is presently observed on servers which have more than 256 logical processors,\" the company\nsaid\n.\nIT admins who want to find out if these known issues impact their Windows Server 2025 systems are advised to check if they show as having over 256 logical processors on the Performance tab in the Windows Task Manager.\nIn an update to the initial Windows release health entry, Microsoft says these issues have been addressed in updates released since the\nKB5046617\ncumulative update issued as part of the November Patch Tuesday.\n\"We recommend you install the latest security update for your device as it contains important improvements and issue resolutions, including this one,\" Redmond added.\nAdmins who can't immediately install updates released since November can still work around these issues by limiting the number of logical processors on affected devices to 256 or under using these instructions:\nRestart your server and enter the UEFI Setup. Navigate through the firmware menus, which may vary by manufacturer.\nLocate any option that allows you to adjust the number of cores per socket.\nSet the number of cores per socket to a value that ensures the total number of logical processors is 256 or fewer. Important: The total number of logical processors is calculated by first multiplying the number of sockets by the number of cores per socket and then multiplying that result by the number of logical processors per core.\nRestart the server.\nEarlier this month, Microsoft warned that some Windows Server 2025 domain controllers (DCs)\nmight become inaccessible\nafter being restarted, causing services and apps to fail.\nThe company also said that some Windows users might be unable to log into their accounts using Windows Hello after installing the April 2025 security updates on client (\nWindows 11 24H2\n) and server (\nWindows Server 2025\n) systems.\nMicrosoft also fixed a bug that\ncaused authentication issues\nwhen Credential Guard was enabled on systems using the Kerberos PKINIT pre-auth security protocol, and it\nintroduced a new Windows 11 24H2 safeguard hold\nfor systems with SenseShield Technology's sprotect.sys driver (used by security or enterprise software) because of incompatibility issues triggering blue or black screen of death (BSOD) errors.\nRelated Articles:\nMicrosoft: Windows Server 2025 restarts break connectivity on some DCs\nMicrosoft fixes Remote Desktop issues caused by Windows updates\nMicrosoft fixes Remote Desktop freezes caused by Windows updates\nNew Windows Server emergency updates fix container launch issue\nMicrosoft fixes auth issues on Windows Server, Windows 11 24H2"
    },
    {
        "Title": "Microsoft Claims Steady Progress Revamping Security Culture",
        "Link": "https://www.darkreading.com/cybersecurity-operations/microsoft-steady-progress-revamp-security-culture",
        "Summary": "In the latest Secure Future Initiative Progress Report, Microsoft described efforts to rebuild its security culture, including making security a core priority for employees during performance reviews and launching a new &quot;Secure by Design UX Toolkit.&quot;",
        "Date": "2025-04-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/microsoft-steady-progress-revamp-security-culture"
    },
    {
        "Title": "Ransomware Gangs Innovate With New Affiliate Models",
        "Link": "https://www.darkreading.com/data-privacy/ransomware-gangs-innovate-new-affiliate-models",
        "Summary": "Secureworks research shows two ransomware operators offering multiple business models with ransomware-as-a-service, mimicking the structures and processes of legitimate businesses.",
        "Date": "2025-04-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/data-privacy/ransomware-gangs-innovate-new-affiliate-models"
    },
    {
        "Title": "Popular British Retailer Marks &amp; Spencer Addresses 'Cyber Incident'",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/marks-spencer-cyber-incident",
        "Summary": "M&amp;S has launched an investigation and said some customer operations are impacted.",
        "Date": "2025-04-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/marks-spencer-cyber-incident"
    },
    {
        "Title": "North Korean Operatives Use Deepfakes in IT Job Interviews",
        "Link": "https://www.darkreading.com/remote-workforce/north-korean-operatives-deepfakes-it-job-interviews",
        "Summary": "Use of synthetic identities by malicious employment candidates is yet another way state-sponsored actors are trying to game the hiring process and infiltrate Western organizations.",
        "Date": "2025-04-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/north-korean-operatives-deepfakes-it-job-interviews"
    },
    {
        "Title": "Japan Warns on Unauthorized Stock Trading via Stolen Credentials",
        "Link": "https://www.darkreading.com/threat-intelligence/japan-unauthorized-stock-trading-stolen-credentials",
        "Summary": "Attackers are using credentials stolen via phishing websites that purport to be legitimate securities company homepages, duping victims and selling their stocks before they realize they've been hacked.",
        "Date": "2025-04-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/japan-unauthorized-stock-trading-stolen-credentials"
    },
    {
        "Title": "Kubernetes Pods Are Inheriting Too Many Permissions",
        "Link": "https://www.darkreading.com/cloud-security/kubernetes-pods-inheriting-permissions",
        "Summary": "Scalable, effective  — and best of all, free — securing Kubernetes workload identity cuts cyber-risk without adding infrastructure, according to new research from SANS.",
        "Date": "2025-04-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/kubernetes-pods-inheriting-permissions"
    },
    {
        "Title": "The Foundations of a Resilient Cyber Workforce",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/foundations-resilient-cyber-workforce",
        "Summary": "In a world where insider threats, nation-state adversaries, and technological evolution create new challenges, companies must prioritize transparency, ethical leadership, and a culture rooted in trust.",
        "Date": "2025-04-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/foundations-resilient-cyber-workforce"
    },
    {
        "Title": "Zambia's Updated Cyber Laws Prompt Surveillance Warnings",
        "Link": "https://www.darkreading.com/cyber-risk/updated-zambian-cyber-laws-draw-surveillance-warnings",
        "Summary": "Critics — which include the US embassy in Zambia — contend the just-signed Cyber Security Act and the Cyber Crime Act allow suppression of dissent and too much concentration of power.",
        "Date": "2025-04-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/updated-zambian-cyber-laws-draw-surveillance-warnings"
    },
    {
        "Title": "Verizon: Edge Bugs Soar, Ransoms Lag, SMBs Bedeviled",
        "Link": "https://www.darkreading.com/cybersecurity-analytics/verizon-edge-bugs-ransoms-smbs-bedeviled",
        "Summary": "The cybersecurity landscape confounded expectations in 2024, as anticipated threats and risk didn't materialize and less widely touted attack scenarios shot up.",
        "Date": "2025-04-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-analytics/verizon-edge-bugs-ransoms-smbs-bedeviled"
    },
    {
        "Title": "DOGE Worker’s Code Supports NLRB Whistleblower",
        "Link": "https://krebsonsecurity.com/2025/04/doge-workers-code-supports-nlrb-whistleblower/",
        "Summary": "A whistleblower at the National Labor Relations Board (NLRB) alleged last week that denizens of Elon Musk's Department of Government Efficiency (DOGE) siphoned gigabytes of data from the agency's sensitive case files in early March. The whistleblower said accounts created for DOGE at the NLRB downloaded three code repositories from GitHub. Further investigation into one of those code bundles shows it is remarkably similar to a program published in January 2025 by Marko Elez, a 25-year-old DOGE employee who has worked at a number of Musk's companies.",
        "Date": "2025-04-23",
        "Content": "A whistleblower at the National Labor Relations Board (NLRB) alleged last week that denizens of Elon Musk’s Department of Government Efficiency (DOGE) siphoned gigabytes of data from the agency’s sensitive case files in early March. The whistleblower said accounts created for DOGE at the NLRB downloaded three code repositories from GitHub. Further investigation into one of those code bundles shows it is remarkably similar to a program published in January 2025 by Marko Elez, a 25-year-old DOGE employee who has worked at a number of Musk’s companies.\nA screenshot shared by NLRB whistleblower Daniel Berulis shows three downloads from GitHub.\nAccording to a whistleblower complaint filed last week by Daniel J. Berulis, a 38-year-old security architect at the NLRB, officials from DOGE met with NLRB leaders on March 3 and demanded the creation of several all-powerful “tenant admin” accounts that were to be exempted from network logging activity that would otherwise keep a detailed record of all actions taken by those accounts.\nBerulis said the new DOGE accounts had unrestricted permission to read, copy, and alter information contained in NLRB databases. The new accounts also could restrict log visibility, delay retention, route logs elsewhere, or even remove them entirely — top-tier user privileges that neither Berulis nor his boss possessed.\nBerulis said he discovered one of the DOGE accounts had downloaded three external code libraries from GitHub that neither NLRB nor its contractors ever used. A “readme” file in one of the code bundles explained it was created to rotate connections through a large pool of cloud Internet addresses that serve “as a proxy to generate pseudo-infinite IPs for web scraping and brute forcing.” Brute force attacks involve automated login attempts that try many credential combinations in rapid sequence.\nA search on that description in Google brings up a code repository at GitHub for a user with the account name “Ge0rg3” who published a program roughly four years ago called “requests-ip-rotator,” described as a library that will allow the user “to bypass IP-based rate-limits for sites and services.”\nThe README file from the GitHub user Ge0rg3’s page for requests-ip-rotator includes the exact wording of a program the whistleblower said was downloaded by one of the DOGE users. Marko Elez created an offshoot of this program in January 2025.\n“A Python library to utilize AWS API Gateway’s large IP pool as a proxy to generate pseudo-infinite IPs for web scraping and brute forcing,” the description reads.\nGe0rg3’s code is “open source,” in that anyone can copy it and reuse it non-commercially. As it happens, there is a newer version of this project that was derived or “forked” from Ge0rg3’s code — called “async-ip-rotator” — and it was committed to GitHub in January 2025 by DOGE captain Marko Elez.\nThe whistleblower stated that one of the GitHub files downloaded by the DOGE employees who transferred sensitive files from an NLRB case database was an archive whose README file read: “Python library to utilize AWS API Gateway’s large IP pool as a proxy to generate pseudo-infinite IPs for web scraping and brute forcing.” Elez’s code pictured here was forked in January 2025 from a code library that shares the same description.\nA key DOGE staff member who gained access to the Treasury Department’s central payments system, Elez has worked for a number of Musk companies, including X, SpaceX, and xAI. Elez was among the first DOGE employees to face public scrutiny, after The Wall Street Journal linked him to social media posts that advocated racism and eugenics.\nElez resigned after that brief scandal, but was rehired after President Donald Trump and Vice President JD Vance expressed support for him. Politico reports Elez is now a Labor Department aide detailed to multiple agencies, including the Department of Health and Human Services.\n“During Elez’s initial stint at Treasury, he violated the agency’s information security policies by sending a spreadsheet containing names and payments information to officials at the General Services Administration,” Politico wrote, citing court filings.\nKrebsOnSecurity sought comment from both the NLRB and DOGE, and will update this story if either responds.\nThe NLRB has been effectively hobbled since President Trump fired three board members, leaving the agency without the quorum it needs to function. Both Amazon and Musk’s SpaceX have been suing the NLRB over complaints the agency filed in disputes about workers’ rights and union organizing, arguing that the NLRB’s very existence is unconstitutional. On March 5, a U.S. appeals court unanimously rejected Musk’s claim that the NLRB’s structure somehow violates the Constitution.\nBerulis’s complaint alleges the DOGE accounts at NLRB downloaded more than 10 gigabytes of data from the agency’s case files, a database that includes reams of sensitive records including information about employees who want to form unions and proprietary business documents. Berulis said he went public after higher-ups at the agency told him not to report the matter to the US-CERT, as they’d previously agreed.\nBerulis told KrebsOnSecurity he worried the unauthorized data transfer by DOGE could unfairly advantage defendants in a number of ongoing labor disputes before the agency.\n“If any company got the case data that would be an unfair advantage,” Berulis said. “They could identify and fire employees and union organizers without saying why.”\nMarko Elez, in a photo from a social media profile.\nBerulis said the other two GitHub archives that DOGE employees downloaded to NLRB systems included Integuru, a software framework designed to reverse engineer application programming interfaces (APIs) that websites use to fetch data; and a “headless” browser called Browserless, which is made for automating web-based tasks that require a pool of browsers, such as web scraping and automated testing.\nOn February 6, someone posted a lengthy and detailed critique of Elez’s code on the GitHub “issues” page for async-ip-rotator, calling it “insecure, unscalable and a fundamental engineering failure.”\n“If this were a side project, it would just be bad code,” the reviewer wrote. “But if this is representative of how you build production systems, then there are much larger concerns. This implementation is fundamentally broken, and if anything similar to this is deployed in an environment handling sensitive data, it should be audited immediately.”\nFurther reading: Berulis’s complaint (PDF).\nUpdate 7:06 p.m. ET: Elez’s code repo was deleted after this story was published. An archived version of it is here.\n\r\n         This entry was posted on Wednesday 23rd of April 2025 04:45 PM \r\n         \n“insecure, unscalable and a fundamental engineering failure.”  \nQuick, someone cry politics and set yourself on fire.\nWhat a mess. We’ll probably be hearing repeatedly the next few years how the “waste fraud and abuse” purposely and inadvertently excised/corrupted by DOGE from agency repositories turns out to have been the data integrity and security measures that serve and protect the US so long as government employees are there and not instructed from maintaining them.\nLet’s put Musk in Mt Rushmore – with no food clothing or shelter – for a month or so before we deport him packed in the back of a self driving Tesla truck.\nSpring 2025 – the apotheosis of anosognosia.\nObstructed not “instructed.”\n“obstructed” not “instructed”\nThanks Brian\nObstructed not “instructed.”\nI was fortunately able to look at the provided links before they were removed or made private. Incredible times in the industry and I appreciate the reporting Krebs!\nimagine doing something this shady and leaving such an obvious paper trail.  dude truly believes he is above the law, and unfortunately that belief has been reinforced by his higher-ups.\nThanks, Brian\nhttps://web.archive.org/web/20250423135719/https://github.com/markoelez/async-ip-rotator/issues/1\nI found the archive link for the github issue: https://web.archive.org/web/20250423135719/https://github.com/markoelez/async-ip-rotator/issues/1\nit’s a pretty thorough, but sound and level-headed review\nLooks like the “async-ip-rotator” Github page has been deleted now.\nPlease use archive.org links, looks like the GitHub stuff got taken down.,\nSo he downloaded a public open-source project and forked it. What’s the problem?\nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "AuthMind Raises $19.3 Million in Seed Funding",
        "Link": "https://www.securityweek.com/authmind-raises-19-3-million-in-seed-funding/",
        "Summary": "<p>Identity protection startup AuthMind has announced raising $19.3 million in a seed funding round led by Cheyenne Ventures.</p>\n<p>The post <a href=\"https://www.securityweek.com/authmind-raises-19-3-million-in-seed-funding/\">AuthMind Raises $19.3 Million in Seed Funding</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/authmind-raises-19-3-million-in-seed-funding/"
    },
    {
        "Title": "Ethical Zero Day Marketplace Desired Effect Emerges From Stealth",
        "Link": "https://www.securityweek.com/ethical-zero-day-marketplace-desired-effect-emerges-from-stealth/",
        "Summary": "<p>Desired Effect provides an ethical vulnerability exchange marketplace to help defenders get ahead of attackers.</p>\n<p>The post <a href=\"https://www.securityweek.com/ethical-zero-day-marketplace-desired-effect-emerges-from-stealth/\">Ethical Zero Day Marketplace Desired Effect Emerges From Stealth</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/ethical-zero-day-marketplace-desired-effect-emerges-from-stealth/"
    },
    {
        "Title": "Endor Labs Raises $93 Million for AppSec Platform",
        "Link": "https://www.securityweek.com/endor-labs-raises-93-million-for-appsec-platform/",
        "Summary": "<p>Endor Labs has raised $93 million in a Series B funding round and announced a major expansion of its AppSec platform.</p>\n<p>The post <a href=\"https://www.securityweek.com/endor-labs-raises-93-million-for-appsec-platform/\">Endor Labs Raises $93 Million for AppSec Platform</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/endor-labs-raises-93-million-for-appsec-platform/"
    },
    {
        "Title": "Chainguard Raises Hefty $356M Series D at $3.5 Billion Valuation",
        "Link": "https://www.securityweek.com/chainguard-raises-hefty-356m-series-d-at-3-5-billion-valuation/",
        "Summary": "<p>The cash infusion brings Chainguard’s total funding to about $612 million since launching in 2021 and prices the company at $3.5 billion.</p>\n<p>The post <a href=\"https://www.securityweek.com/chainguard-raises-hefty-356m-series-d-at-3-5-billion-valuation/\">Chainguard Raises Hefty $356M Series D at $3.5 Billion Valuation</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chainguard-raises-hefty-356m-series-d-at-3-5-billion-valuation/"
    },
    {
        "Title": "Files Deleted From GitHub Repos Leak Valuable Secrets",
        "Link": "https://www.securityweek.com/files-deleted-from-github-repos-leak-valuable-secrets/",
        "Summary": "<p>A security researcher has discovered hundreds of leaked secrets by restoring files deleted from GitHub repositories.</p>\n<p>The post <a href=\"https://www.securityweek.com/files-deleted-from-github-repos-leak-valuable-secrets/\">Files Deleted From GitHub Repos Leak Valuable Secrets</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/files-deleted-from-github-repos-leak-valuable-secrets/"
    },
    {
        "Title": "Miggo Security Banks $17M Series A for ADR Technology",
        "Link": "https://www.securityweek.com/miggo-security-banks-17m-series-a-for-adr-technology/",
        "Summary": "<p>Israeli runtime application security startups closes a $17 million Series A round led by Florida‑based SYN Ventures and YL Ventures.</p>\n<p>The post <a href=\"https://www.securityweek.com/miggo-security-banks-17m-series-a-for-adr-technology/\">Miggo Security Banks $17M Series A for ADR Technology</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/miggo-security-banks-17m-series-a-for-adr-technology/"
    },
    {
        "Title": "Picnic Corporation Rebrands to VanishID, Raises $10 Million",
        "Link": "https://www.securityweek.com/picnic-corporation-rebrands-to-vanishid-raises-10-million/",
        "Summary": "<p>Picnic Corporation has rebranded to VanishID and announced the launch of a CEO privacy and security offering. </p>\n<p>The post <a href=\"https://www.securityweek.com/picnic-corporation-rebrands-to-vanishid-raises-10-million/\">Picnic Corporation Rebrands to VanishID, Raises $10 Million</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/picnic-corporation-rebrands-to-vanishid-raises-10-million/"
    },
    {
        "Title": "Kelly Benefits Data Breach Impacts 260,000 People",
        "Link": "https://www.securityweek.com/kelly-benefits-data-breach-impacts-260000-people/",
        "Summary": "<p>Benefits and payroll solutions provider Kelly Benefits has disclosed a data breach impacting more than 260,000 individuals.</p>\n<p>The post <a href=\"https://www.securityweek.com/kelly-benefits-data-breach-impacts-260000-people/\">Kelly Benefits Data Breach Impacts 260,000 People</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/kelly-benefits-data-breach-impacts-260000-people/"
    },
    {
        "Title": "Cyberattack Hits British Retailer Marks & Spencer",
        "Link": "https://www.securityweek.com/cyberattack-hits-british-retailer-marks-spencer/",
        "Summary": "<p>British retailer Marks &#038; Spencer has been experiencing certain service disruptions after falling victim to a cyberattack.</p>\n<p>The post <a href=\"https://www.securityweek.com/cyberattack-hits-british-retailer-marks-spencer/\">Cyberattack Hits British Retailer Marks &#038; Spencer</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cyberattack-hits-british-retailer-marks-spencer/"
    },
    {
        "Title": "Data Breach at Onsite Mammography Impacts 350,000",
        "Link": "https://www.securityweek.com/data-breach-at-onsite-mammography-impacts-350000/",
        "Summary": "<p>Massachusetts medical firm Onsite Mammography discloses data breach impacting the personal information of 350,000 patients.</p>\n<p>The post <a href=\"https://www.securityweek.com/data-breach-at-onsite-mammography-impacts-350000/\">Data Breach at Onsite Mammography Impacts 350,000</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/data-breach-at-onsite-mammography-impacts-350000/"
    }
]