[
    {
        "Title": "Researchers Demonstrate How MCP Prompt Injection Can Be Used for Both Attack and Defense",
        "Link": "https://thehackernews.com/2025/04/experts-uncover-critical-mcp-and-a2a.html",
        "Summary": "As the field of artificial intelligence (AI) continues to evolve at a rapid pace, new research has found how techniques that render the Model Context Protocol (MCP) susceptible to prompt injection attacks could be used to develop security tooling or identify malicious tools, according to a new report from Tenable.\nMCP, launched by Anthropic in November 2024, is a framework designed to connect",
        "Date": "2025-04-30",
        "Content": "As the field of artificial intelligence (AI) continues to evolve at a rapid pace, new research has found how techniques that render the Model Context Protocol (\nMCP\n) susceptible to\nprompt injection attacks\ncould be used to develop security tooling or identify malicious tools, according to a\nnew report\nfrom Tenable.\nMCP, launched by Anthropic in November 2024, is a framework designed to connect Large Language Models (LLMs) with external data sources and services, and make use of model-controlled tools to interact with those systems to enhance the accuracy, relevance, and utility of AI applications.\nIt follows a client-server architecture, allowing\nhosts with MCP clients\nsuch as Claude Desktop or Cursor to communicate with different MCP servers, each of which exposes specific tools and capabilities.\nWhile the open standard offers a\nunified interface\nto access various data sources and even switch between LLM providers, they also come with a new set of risks, ranging from excessive permission scope to indirect prompt injection attacks.\nFor example, given an MCP for Gmail to interact with Google's email service, an attacker could\nsend malicious messages\ncontaining hidden instructions that, when parsed by the LLM, could trigger undesirable actions, such as forwarding sensitive emails to an email address under their control.\nMCP has also been\nfound\nto be vulnerable to what is called tool poisoning, wherein malicious instructions are embedded within tool descriptions that are visible to LLMs, and rug pull attacks, which occur when an MCP tool functions in a benign manner initially, but mutates its behavior later on via a time-delayed malicious update.\n\"It should be noted that while users are able to approve tool use and access, the permissions given to a tool can be reused without re-prompting the user,\" SentinelOne\nsaid\nin a recent analysis.\nFinally, there also exists the risk of cross-tool contamination or cross-server tool shadowing that causes one MCP server to override or interfere with another, stealthily influencing how other tools should be used, thereby leading to new ways of data exfiltration.\nThe latest findings from Tenable show that the MCP framework could be used to create a tool that logs all MCP tool function calls by including a specially crafted description that instructs the LLM to insert this tool before any other tools are invoked.\nIn other words, the\nprompt injection\nis manipulated for a good purpose, which is to log information about \"the tool it was asked to run, including the MCP server name, MCP tool name and description, and the user prompt that caused the LLM to try to run that tool.\"\nAnother use case involves embedding a description in a tool to turn it into a firewall of sorts that blocks unauthorized tools from being run.\n\"Tools should require explicit approval before running in most MCP host applications,\" security researcher Ben Smith said.\n\"Still, there are many ways in which tools can be used to do things that may not be strictly understood by the specification. These methods rely on LLM prompting via the description and return values of the MCP tools themselves. Since LLMs are non-deterministic, so, too, are the results.\"\nIt's Not Just MCP\nThe disclosure comes as Trustwave SpiderLabs revealed that the newly introduced Agent2Agent (\nA2A\n) Protocol – which enables communication and interoperability between agentic applications – could be exposed to novel form attacks where the system can be gamed to route all requests to a rogue AI agent by lying about its capabilities.\nA2A was\nannounced\nby Google earlier this month as a way for AI agents to work across siloed data systems and applications, regardless of the vendor or framework used. It's important to note here that while MCP connects LLMs with data, A2A connects one AI agent to another. In other words, they are both\ncomplementary protocols\n.\n\"Say we compromised the agent through another vulnerability (perhaps via the operating system), if we now utilize our compromised node (the agent) and craft an\nAgent Card\nand really exaggerate our capabilities, then the host agent should pick us every time for every task, and send us all the user's sensitive data which we are to parse,\" security researcher Tom Neaves\nsaid\n.\n\"The attack doesn't just stop at capturing the data, it can be active and even return false results — which will then be acted upon downstream by the LLM or user.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "[Free Webinar] Guide to Securing Your Entire Identity Lifecycle Against AI-Powered Threats",
        "Link": "https://thehackernews.com/2025/04/free-webinar-guide-to-securing-your.html",
        "Summary": "How Many Gaps Are Hiding in Your Identity System? It’s not just about logins anymore.\nToday’s attackers don’t need to “hack” in—they can trick their way in. Deepfakes, impersonation scams, and AI-powered social engineering are helping them bypass traditional defenses and slip through unnoticed. Once inside, they can take over accounts, move laterally, and cause long-term damage—all without",
        "Date": "2025-04-30",
        "Content": "How Many Gaps Are Hiding in Your Identity System? It's not just about logins anymore.\nToday's attackers don't need to \"hack\" in—they can trick their way in. Deepfakes, impersonation scams, and AI-powered social engineering are helping them bypass traditional defenses and slip through unnoticed. Once inside, they can take over accounts, move laterally, and cause long-term damage—all without triggering alarms.\nBut here's the catch: most organizations only focus on\nparts\nof the identity lifecycle—usually authentication. That leaves critical gaps wide open during enrollment, recovery, and even routine access.\nThis upcoming webinar from\nBeyond Identity and Nametag\nbreaks down what it really takes to\nprotect your\nentire identity lifecycle\n—from the first time a user joins, to every login, to the moment they forget their credentials.\n🔐 What's Covered:\nAI Threats Are Already Here\n– Learn how attackers are using deepfakes to impersonate real users\nPhishing-Resistant MFA\n– Go beyond SMS and OTPs with stronger, hardware-bound identity methods\nTrusted Devices Only\n– Ensure access is granted only from secure, compliant endpoints\nSeamless Recovery\n– Cut helpdesk load and keep attackers out during account resets\nReal-World Use Cases\n– See how modern organizations are stopping fraud\nbefore\nit starts\nMost identity breaches don't start with a brute-force attack—they start with a fake user who looks real.\nIf you manage identity systems, run security operations, or design access controls, this session will give you\nclear, actionable steps\nto close the hidden gaps most teams overlook.\nWatch this Webinar\nThis isn't just another webinar. It's a\nlive walkthrough of how to protect your people, your data, and your business\n—at every step of the identity lifecycle.\nJoin us\nand get ahead of what attackers already know. Your identity system might be more exposed than you think. Learn how to fix it—before someone else finds the weak link.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Chinese Hackers Abuse IPv6 SLAAC for AitM Attacks via Spellbinder Lateral Movement Tool",
        "Link": "https://thehackernews.com/2025/04/chinese-hackers-abuse-ipv6-slaac-for.html",
        "Summary": "A China-aligned advanced persistent threat (APT) group called TheWizards has been linked to a lateral movement tool called Spellbinder that can facilitate adversary-in-the-middle (AitM) attacks.\n\"Spellbinder enables adversary-in-the-middle (AitM) attacks, through IPv6 stateless address autoconfiguration (SLAAC) spoofing, to move laterally in the compromised network, intercepting packets and",
        "Date": "2025-04-30",
        "Content": "A China-aligned advanced persistent threat (APT) group called\nTheWizards\nhas been linked to a lateral movement tool called Spellbinder that can facilitate adversary-in-the-middle (AitM) attacks.\n\"Spellbinder enables adversary-in-the-middle (AitM) attacks, through IPv6 stateless address autoconfiguration (\nSLAAC\n)\nspoofing\n, to move laterally in the compromised network, intercepting packets and redirecting the traffic of legitimate Chinese software so that it downloads malicious updates from a server controlled by the attackers,\" ESET researcher Facundo Muñoz\nsaid\nin a report shared with The Hacker News.\nThe attack paves the way for a malicious downloader that's delivered by hijacking the software update mechanism associated with Sogou Pinyin. The downloader then acts as a conduit to drop a modular backdoor codenamed WizardNet.\nThis is not the first time Chinese threat actors have abused Sogou Pinyin's software update process to deliver their own malware. In January 2024, ESET detailed a hacking group referred to as\nBlackwood\nthat has deployed an implant named NSPX30 by taking advantage of the update mechanism of the Chinese input method software application.\nThen earlier this year, the Slovak cybersecurity company revealed another threat cluster known as\nPlushDaemon\nthat leveraged the same technique to distribute a custom downloader called LittleDaemon.\nTheWizards APT is known to target both individuals and the gambling sectors in Cambodia, Hong Kong, Mainland China, the Philippines, and the United Arab Emirates.\nEvidence suggests that the Spellbinder IPv6 AitM tool has been put to use by the threat actor since at least 2022. While the exact initial access vector used in the attacks is unknown at this stage, successful access is followed by the delivery of a ZIP archive that contains four different files: AVGApplicationFrameHost.exe, wsc.dll, log.dat, and winpcap.exe.\nThe threat actors then proceed to install \"winpcap.exe\" and run \"AVGApplicationFrameHost.exe,\" the latter of which is abused to sideload the DLL. The DLL file subsequently reads shellcode from \"log.dat\" and executes it in memory, causing Spellbinder to be launched in the process.\n\"Spellbinder uses the\nWinPcap library\nto capture packets and to reply to packets when needed,\" Muñoz explained. \"It takes advantage of IPv6's Network Discovery Protocol in which ICMPv6 Router Advertisement (RA) messages advertise that an IPv6-capable router is present in the network so that hosts that support IPv6, or are soliciting an IPv6-capable router, can adopt the advertising device as their default gateway.\"\nIn one attack case observed in 2024, the threat actors are said to have utilized this method to hijack the software update process for Tencent QQ at the DNS level to serve a trojanized version that then deploys WizardNet, a modular backdoor that's equipped to receive and run .NET payloads on the infected host.\nSpellbinder pulls this off by intercepting the DNS query for the software update domain (\"update.browser.qq[.]com\") and issuing a DNS response with the IP address of an attacker-controlled server (\"43.155.62[.]54\") hosting the malicious update.\nAnother noteworthy tool in TheWizards' arsenal is DarkNights, which is also called DarkNimbus by Trend Micro and has been attributed to another\nChinese hacking group\ntracked as\nEarth Minotaur\n. That said, both clusters are being treated as independent operators, citing differences in tooling, infrastructure, and targeting footprints.\nIt has since\nemerged\nthat a Chinese public security ministry contractor named Sichuan Dianke Network Security Technology Co., Ltd. (aka UPSEC) is the supplier of the DarkNimbus malware.\n\"While TheWizards uses a different backdoor for Windows (WizardNet), the hijacking server is configured to serve DarkNights to updating applications running on Android devices,\" Muñoz said. \"This indicates that Dianke Network Security is a digital quartermaster to TheWizards APT group.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Customer Account Takeovers: The Multi-Billion Dollar Problem You Don’t Know About",
        "Link": "https://thehackernews.com/2025/04/customer-account-takeovers-multi.html",
        "Summary": "Everyone has cybersecurity stories involving family members. Here’s a relatively common one. The conversation usually goes something like this:&nbsp;\n“The strangest thing happened to my streaming account. I got locked out of my account, so I had to change my password. When I logged back in, all my shows were gone. Everything was in Spanish and there were all these Spanish shows I’ve never seen",
        "Date": "2025-04-30",
        "Content": "Everyone has cybersecurity stories involving family members. Here's a relatively common one. The conversation usually goes something like this:\n\"The strangest thing happened to my streaming account. I got locked out of my account, so I had to change my password. When I logged back in, all my shows were gone. Everything was in Spanish and there were all these Spanish shows I've never seen before. Isn't that weird?\"\nThis is an example of an account takeover attack on a customer account. Typically what happens is that a streaming account is compromised, probably due to a weak and reused password, and access is resold as part of a common digital black market product, often advertised as something like \"LIFETIME STREAMING SERVICE ACCOUNT - $4 USD.\"\nIn the grand scheme of things, this is a relatively mild inconvenience for most customers. You can reset your credentials with a much stronger password, call your bank to issue a new credit card and be back to binge-watching\nThe Crown\nin short order.\nBut what happens when similar incidents occur thousands of times daily across the world's most popular web applications?\nThe Hidden Scale of Account Takeovers (ATO)\nFlare's recent report,\nThe Account and Session Takeover Economy\n, reveals just how widespread and costly this issue has become. Industries like e-commerce, gaming, productivity SaaS, and streaming are particularly hard-hit, each seeing over 100,000 newly exposed accounts per month.\nThe report found a median account takeover exposure rate of 1.4% among platforms ranging from 5 million to 300 million users. Of particular concern is the rise in session hijacking—a technique that allows attackers to bypass multi-factor authentication (MFA) by stealing session cookies, often via infostealer malware.\nReturning to the streaming example, it's likely that the attacker didn't even need to log in with a password. With an active session token in hand, they simply injected it into a browser using an anti-detect tool and gained full access—without triggering alerts or MFA challenges.\nA major entertainment or e-commerce platform with millions of users—Netflix, Epic Games, or Wayfair—can conservatively expect thousands of customer accounts to be vulnerable to takeover at any given time.\nAverage New Exposed Accounts (Monthly) – Scaled View from Flare's The Account and Session Takeover Economy Report\nWhat's the Real Cost of an ATO\nThe economic toll of ATOs is difficult to fully quantify, but Flare's report breaks it down into three major categories: labor, fraud, and customer churn.\nLet's revisit the streaming example from earlier. Some users may chalk the issue up to bad luck and stick around for the next season of\nStranger Things\n. Others, however, may cancel out of frustration—especially when they've already had to reset passwords, deal with credit card issues, or simply feel their trust has been violated. A\n2023 report\nfrom fraud prevention company Sift found that 73% of users believe the brand—not the user—is responsible for preventing ATOs.\nWe've used streaming as an example in this article because of their cultural significance in global entertainment, but we don't make any assumptions about their security posture, breach history, or business practices.\nTo understand the potential business impact, consider a\nfictional\nentertainment streaming service. If there are 100 million paying customers at $120 per year…\nIf 0.5% of accounts are taken over—about one-third of the median exposure rate—that's 500,000 affected users.\nIf even 20% of those users churn, the company stands to lose $12 million in annual revenue.\nIn a worst-case scenario where 73% walk away, the loss grows to $44 million.\nThis is all very rough \"back of napkin\" math but it provides a starting point for quantifying the financial risks associated with ATOs.\nRemember, this is just a churn risk. Fraud-related losses are a separate discussion entirely! Now extrapolate this challenge across the hundreds of web applications that service millions of daily users.\nCost of ATOs & Fraud Mechanism Per Industry\nRecommendations for ATO Prevention\n1. Monitor the Infostealer Ecosystem\nWhile ransomware grabs headlines, infostealer malware is fueling the majority of credential-based attacks. Flare's data shows a 26% year-over-year increase in exposures involving stolen credentials and session cookies.\nAccording to\nVerizon's 2025 Data Breach Investigations Report (DBIR\n), 88% of basic web app attacks involve stolen credentials, demonstrating how central infostealers are to modern account takeover operations.\n2. Detect and Remediate Exposed Accounts\nOrganizations can dramatically reduce ATO risk by combining real-time infostealer intelligence with their identity and access management systems. This enables the detection and remediation of accounts that have been compromised—especially those with valid session cookies, which allow attackers to bypass authentication entirely.\nProactive monitoring and auto-remediation can prevent account abuse before it impacts customer experience or\nbottom-line metrics\n.\n3. Communicate a Security-First Approach\nIntroducing friction—like forced password resets—can feel risky for customer experience. But most users expect companies to not only protect their data but also communicate any issues.\nAlso from Sift's report- only 43% of ATO victims were notified by their company that their account had been compromised. Customers who experience this fraud but aren't notified may feel like the company is not aware of account takeovers or have steps to help them out.\nBy clearly communicating the purpose behind these measures, organizations can reframe proactive security as a value-added feature. Transparency around ATO risks helps customers feel safer—and more loyal—over time.\nAbout the Author\n:\nNick Ascoli\nis the Director of Product Strategy at\nFlare\nand an experienced threat researcher who is recognized for his expertise in data leaks, reconnaissance, and detection engineering. Nick is an active member of the cybersecurity community contributing to open-source projects, regularly appearing on podcasts (Cyberwire, Simply Cyber, etc.) and speaking at conferences (GrrCON, B-Sides, DEFCON Villages, SANS, etc.)\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Nebulous Mantis Targets NATO-Linked Entities with Multi-Stage Malware Attacks",
        "Link": "https://thehackernews.com/2025/04/nebulous-mantis-targets-nato-linked.html",
        "Summary": "Cybersecurity researchers have shed light on a Russian-speaking cyber espionage group called Nebulous Mantis that has deployed a remote access trojan called RomCom RAT since mid-2022.\nRomCom \"employs advanced evasion techniques, including living-off-the-land (LOTL) tactics and encrypted command and control (C2) communications, while continuously evolving its infrastructure – leveraging",
        "Date": "2025-04-30",
        "Content": "Cybersecurity researchers have shed light on a Russian-speaking cyber espionage group called Nebulous Mantis that has deployed a remote access trojan called RomCom RAT since mid-2022.\nRomCom \"employs advanced evasion techniques, including living-off-the-land (LOTL) tactics and encrypted command and control (C2) communications, while continuously evolving its infrastructure – leveraging bulletproof hosting to maintain persistence and evade detection,\" Swiss cybersecurity company PRODAFT\nsaid\nin a report shared with The Hacker News.\nNebulous Mantis, also tracked by the cybersecurity community under the names\nCIGAR\n,\nCuba\n,\nStorm-0978, Tropical Scorpius, UNC2596\n, and\nVoid Rabisu\n, is known to target critical infrastructure, government agencies, political leaders, and NATO-related defense organizations.\nAttack chains mounted by the group typically involve the use of spear-phishing emails with weaponized document links to distribute RomCom RAT. The domains and command-and-control (C2) servers used in these campaigns have been hosted on bulletproof hosting (BPH) services like LuxHost and\nAeza\n. The infrastructure is managed and procured by a threat actor named LARVA-290.\nThe threat actor is assessed to be active since at least mid-2019, with earlier iterations of the campaign delivering a malware loader codenamed Hancitor.\nThe first-stage RomCom DLL is designed to connect to a C2 server and download additional payloads using the InterPlanetary File System (\nIPFS\n) hosted on attacker-controlled domains, execute commands on the infected host, and execute the final-stage C++ malware.\nThe final variant also establishes communications with the C2 server to run commands, as well as download and execute more modules that can steal web browser data.\n\"The threat actor executes tzutil command to identify the system's configured time zone,\" PRODAFT said. \"This system information discovery reveals geographic and operational context that can be used to align attack activities with victim working hours or to evade certain time-based security controls.\"\nRomCom, besides manipulating Windows Registry to set up persistence using COM hijacking, is equipped to harvest credentials, perform system reconnaissance, enumerate Active Directory, conduct lateral movement, and collect data of interest, including files, credentials, configuration details, and Microsoft Outlook backups.\nRomCom variants and victims are managed by means of a dedicated C2 panel, allowing the operators to view device details and issue over 40 commands remotely to carry out a variety of data-gathering tasks.\n\"Nebulous Mantis operates as a sophisticated threat group employing a multi-phase intrusion methodology to gain initial access, execution, persistence, and data exfiltration,\" the company said.\n\"Throughout the attack lifecycle, Nebulous Mantis exhibits operational discipline in minimizing their footprint, carefully balancing aggressive intelligence collection with stealth requirements, suggesting either state-sponsored backing or professional cybercriminal organization with significant resources.\"\nThe disclosure comes weeks after PRODAFT exposed a ransomware group named Ruthless Mantis (aka PTI-288) that specializes in double extortion by collaborating with affiliate programs, such as Ragnar Locker, INC Ransom, and others.\nLed by a threat actor dubbed LARVA-127, the financially motivated threat actor utilizes an array of legitimate and custom tools to facilitate each and every phase of the attack cycle: discovery, persistence, privilege escalation, defense evasion, credential harvesting, lateral movement, and C2 frameworks like Brute Ratel c4 and\nRagnar Loader\n.\n\"Although Ruthless Mantis is composed of highly experienced core members, they also actively integrate newcomers to continually enhance the effectiveness and speed of their operations,\" it\nsaid\n.\n\"Ruthless Mantis has significantly expanded its arsenal of tools and methods, providing them with state-of-the-art resources to streamline processes and boost operational efficiency.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "RansomHub Went Dark April 1; Affiliates Fled to Qilin, DragonForce Claimed Control",
        "Link": "https://thehackernews.com/2025/04/ransomhub-went-dark-april-1-affiliates.html",
        "Summary": "Cybersecurity researchers have revealed that RansomHub's online infrastructure has \"inexplicably\" gone offline as of April 1, 2025, prompting concerns among affiliates of the ransomware-as-a-service (RaaS) operation.\nSingaporean cybersecurity company Group-IB said that this may have caused affiliates to migrate to Qilin, given that \"disclosures on its DLS [data leak site] have doubled since",
        "Date": "2025-04-30",
        "Content": "Cybersecurity researchers have revealed that\nRansomHub\n's online infrastructure has \"inexplicably\" gone offline as of April 1, 2025, prompting concerns among affiliates of the ransomware-as-a-service (RaaS) operation.\nSingaporean cybersecurity company Group-IB\nsaid\nthat this may have caused affiliates to migrate to Qilin, given that \"disclosures on its DLS [data leak site] have doubled since February.\"\nRansomHub, which first emerged in February 2024, is estimated to have stolen data from over 200 victims. It replaced two high-profile RaaS groups, LockBit and BlackCat, to become a frontrunner, courting their affiliates, including\nScattered Spider\nand\nEvil Corp\n, with lucrative payment splits.\n\"Following a possible acquisition of the web application and ransomware source code of Knight (formerly Cyclops), RansomHub quickly rose in the ransomware scene, thanks to the dynamic features of its multi-platform encryptor and an aggressive, affiliate-friendly model offering substantial financial incentives,\" Group-IB said in a report.\nRansomHub's ransomware is designed to work on Windows, Linux, FreeBSD, and ESXi as well as on x86, x64, and ARM architectures, while avoiding attacking companies located in the Commonwealth of Independent States (CIS), Cuba, North Korea, and China. It can also encrypt local and remote file systems via SMB and SFTP.\nThe affiliate panel, which is used to configure the ransomware via a web interface, features a dedicated \"Members\" section where members of the affiliate group are given the option to create their own accounts on the device.\nAffiliates have also been provided with a \"Killer\" module as of at least June 2024 to terminate and bypass security software using known vulnerable drivers (\nBYOVD\n). However, the tool has since been discontinued owing to high detection rates.\nPer\neSentire\nand\nTrend Micro\n, cyber-attacks have also been observed leveraging a JavaScript malware known as SocGholish (aka FakeUpdates) via compromised WordPress sites to deploy a Python-based backdoor connected to RansomHub affiliates.\n\"On November 25, the group's operators released a new note on their affiliate panel announcing that any attack against any government institution is strictly forbidden,\" the company said. \"All affiliates were therefore invited to refrain from such acts because of the high risk and unprofitable 'return of investment.'\"\nThe chain of events in the aftermath of the downtime of RansomHub infrastructure, per GuidePoint Security, has led to an \"affiliate unrest,\" with rival RaaS group DragonForce claiming on the RAMP forum that RansomHub \"decided to move to our infrastructure\" under a new \"DragonForce Ransomware Cartel.\"\nIt's worth noting that another RaaS actor called BlackLock is also\nassessed\nto have started collaborating with DragonForce after the latter defaced its data leak site in late March 2025.\n\"These discussions on the RAMP forums highlight the uncertain environment that RansomHub affiliates appear to be in at the moment, seemingly unaware of the group's status and their own status amidst a potential 'Takeover,'\" GuidePoint Security\nsaid\n.\n\"It remains to be seen whether this instability will spell the beginning of the end for RansomHub, though we cannot help but note that the group that rose to prominence by promising stability and security for affiliates may now have failed or betrayed affiliates on both counts.\"\nSecureworks Counter Threat Unit (CTU), which has also tracked DragonForce's rebrand as a \"cartel,\" said the effort is part of a new business model designed to attract affiliates and increase profits by allowing affiliates to create their own \"brands.\"\nThis is different from a traditional RaaS scheme where the core developers set up the dark web infrastructure and recruit affiliates from the cybercrime underground, who then conduct the attacks after procuring access to target networks from an initial access broker (IAB) in exchange for 70% of the ransom payment.\n\"In this model, DragonForce provides its infrastructure and tools but doesn't require affiliates to deploy its ransomware,\" the Sophos-owned company\nsaid\n. \"Advertised features include administration and client panels, encryption and ransom negotiation tools, a file storage system, a TOR-based leak site and .onion domain, and support services.\"\nAnother ransomware group to embrace novel tactics is Anubis, which sprang forth in February 2025 and uses a \"data ransom\" extortion-only option to exert pressure on victims by threatening to publish an \"investigative article\" containing an analysis of the stolen data and inform regulatory or compliance authorities of the incident.\n\"As the ransomware ecosystem continues to flex and adapt we are seeing wider experimentation with different operating models,\" Rafe Pilling, Director of Threat Intelligence at Secureworks CTU said. \"LockBit had mastered the affiliate scheme but in the wake of the enforcement action against them it's not surprising to see new schemes and methods being tried and tested.\"\nThe development coincides with the emergence of a new ransomware family called ELENOR-corp, a variant of the\nMimic\nransomware, that's actively targeting healthcare organizations after harvesting credentials using a Python executable capable of stealing clipboard content.\n\"The ELENOR-corp variant of Mimic ransomware exhibits enhancements compared to earlier versions, employing sophisticated anti-forensic measures, process tampering, and encryption strategies,\" Morphisec researcher Michael Gorelik\nsaid\n.\n\"This analysis highlights the evolving sophistication of ransomware attacks, emphasizing the need for proactive defenses, swift incident response, and robust recovery strategies in high-risk industries like healthcare.\"\nAnubis and ELENOR-corp are among a fresh crop of ransomware actors that have energized the landscape, even as the persistent threat is showing signs of splintering into smaller groups and frequently rebranding themselves to evade scrutiny and maintain operational continuity,\nreflecting\na \"broader shift toward stealth and flexibility\" -\nCrazyHunter\n, which has targeted Taiwanese healthcare, education, and industrial sectors and uses BYOVD techniques to circumvent security measures via an open-source tool named\nZammoCide\nElysium\n, a new variant of the\nGhost\n(aka\nCring\n) ransomware family that terminates a hard-coded list of services, disables system backups, deletes shadow copies, and modifies the boot status policy to make system recovery harder\nFOG\n, which has abused the name of the U.S. Department of Government Efficiency (DOGE), and individuals connected to the government initiative in email and phishing attacks to distribute malware-laced ZIP files that deliver the ransomware\nHellcat\n, which\nhas\nexploited zero-day vulnerabilities, such as those in Atlassian Jira, to obtain initial access\nHunters International\n, which has rebranded and launched an extortion-only operation known as World Leaks by making use of a bespoke data exfiltration program\nInterlock\n, which has leveraged the infamous\nClickFix\nstrategy to initiate a multi-stage attack chain that deploys the ransomware payload, alongside a backdoor called Interlock RAT and stealers such as Lumma and BerserkStealer\nQilin\n, which has employed a phishing email masquerading as ScreenConnect authentication alerts to breach a Managed Service Provider (MSP) using an\nAitM phishing kit\nand launch ransomware attacks on its customers (attributed to an affiliate named STAC4365)\nThese campaigns serve to highlight the\never-evolving nature of ransomware\nand demonstrate the threat actors' ability to innovate in the face of law enforcement disruptions and leaks.\nIndeed, a new analysis of the\n200,000 internal Black Basta chat messages\nby the Forum of Incident Response and Security Teams (FIRST) has revealed how the ransomware group conducts its operations, focusing on advanced social engineering techniques and exploiting VPN vulnerabilities.\n\"A member known as 'Nur' is tasked with identifying key targets within organizations they aim to attack,\" FIRST\nsaid\n. \"Once they locate a person of influence (such as a manager or HR personnel), they initiate contact via phone call.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Meta Launches LlamaFirewall Framework to Stop AI Jailbreaks, Injections, and Insecure Code",
        "Link": "https://thehackernews.com/2025/04/meta-launches-llamafirewall-framework.html",
        "Summary": "Meta on Tuesday announced LlamaFirewall, an open-source framework designed to secure artificial intelligence (AI) systems against emerging cyber risks such as prompt injection, jailbreaks, and insecure code, among others.\nThe framework, the company said, incorporates three guardrails, including PromptGuard 2, Agent Alignment Checks, and CodeShield.\nPromptGuard 2 is designed to detect direct",
        "Date": "2025-04-30",
        "Content": "Meta on Tuesday\nannounced\nLlamaFirewall\n, an open-source framework designed to secure artificial intelligence (AI) systems against\nemerging cyber risks\nsuch as prompt injection, jailbreaks, and insecure code, among others.\nThe\nframework\n, the company said, incorporates three guardrails, including PromptGuard 2, Agent Alignment Checks, and CodeShield.\nPromptGuard 2\nis designed to detect direct jailbreak and prompt injection attempts in real-time, while Agent Alignment Checks is capable of inspecting agent reasoning for possible goal hijacking and indirect prompt injection scenarios.\nCodeShield refers to an online static analysis engine that seeks to prevent the generation of insecure or dangerous code by AI agents.\n\"LlamaFirewall is built to serve as a flexible, real-time guardrail framework for securing LLM-powered applications,\" the company\nsaid\nin a GitHub description of the project.\n\"Its architecture is modular, enabling security teams and developers to compose layered defenses that span from raw input ingestion to final output actions – across simple chat models and complex autonomous agents.\"\nAlongside LlamaFirewall, Meta has made available updated versions of\nLlamaGuard\nand\nCyberSecEval\nto better detect various common types of violating content and measure the defensive cybersecurity capabilities of AI systems, respectively.\nCyberSecEval 4 also includes a new benchmark called AutoPatchBench, which is engineered to evaluate the ability of a large language model (LLM) agent to automatically repair a wide range of C/C++ vulnerabilities identified through fuzzing, an approach known as\nAI-powered patching\n.\n\"AutoPatchBench provides a standardized evaluation framework for assessing the effectiveness of AI-assisted vulnerability repair tools,\" the company\nsaid\n. \"This benchmark aims to facilitate a comprehensive understanding of the capabilities and limitations of various AI-driven approaches to repairing fuzzing-found bugs.\"\nLastly, Meta has launched a new program dubbed\nLlama for Defenders\nto help partner organizations and AI developers access open, early-access, and closed AI solutions to address specific security challenges, such as detecting AI-generated content used in scams, fraud, and phishing attacks.\nThe announcements come as WhatsApp\npreviewed\na new technology called Private Processing to allow users to harness AI features without compromising their privacy by offloading the requests to a secure, confidential environment.\n\"We're working with the security community to audit and improve our architecture and will continue to build and strengthen Private Processing in the open, in collaboration with researchers, before we launch it in product,\" Meta said.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Indian Court Orders Action to Block Proton Mail Over AI Deepfake Abuse Allegations",
        "Link": "https://thehackernews.com/2025/04/indian-court-orders-action-to-block.html",
        "Summary": "A high court in the Indian state of Karnataka has ordered the blocking of end-to-end encrypted email provider Proton Mail across the country.\nThe High Court of Karnataka, on April 29, said the ruling was in response to a legal complaint filed by M Moser Design Associated India Pvt Ltd in January 2025.\n\nThe complaint alleged its staff had received e-mails containing obscene, abusive",
        "Date": "2025-04-30",
        "Content": "A high court in the Indian state of Karnataka has ordered the blocking of end-to-end encrypted email provider Proton Mail across the country.\nThe High Court of Karnataka, on April 29, said the ruling was in response to a\nlegal complaint\nfiled by M Moser Design Associated India Pvt Ltd in January 2025.\nThe complaint alleged its staff had received e-mails containing obscene, abusive, and vulgar language, artificial intelligence (AI) generated deepfake imagery, and other sexually explicit content, according to\nLiveLaw\n.\nIn a\nhearing\n, Justice M Nagaprasanna ordered the Indian government to \"initiate proceedings in terms of section 69A of the Information Technology (IT) Act 2008 read with\nRule 10\nof the Information Technology (Procedure and Safeguards of blocking of Access of Information by Public) Rules, 2009 to block Proton Mail.\"\n\"Till such proceedings are taken up and concluded by the government of India, the offending uniform resource locators (URLs) [...] shall be blocked forthwith.\"\nAs of writing, Proton Mail remains accessible in India. The Hacker News has reached out to the Swiss company for comment, and we will update the story if we hear back.\nThis is the second time the service has been threatened with a ban in the country. Early last year, after reports emerged that hoax bomb threats were sent through Proton Mail, the company\nsaid\nit's \"resolutely against the use of Proton services for purposes that are contrary to Swiss law.\"\nWhile Proton is not allowed to transmit any data to foreign authorities under Swiss law, it's obligated to respond to orders from Swiss authorities, who may work with outside agencies to tackle illegal activity.\n\"While end-to-end encryption means users' emails, files, calendar entries, and passwords have strong privacy protections, it is not permissible to use Proton Mail for purposes that are contrary to Swiss law,\" it added.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "WordPress plugin disguised as a security tool injects backdoor",
        "Link": "https://www.bleepingcomputer.com/news/security/wordpress-plugin-disguised-as-a-security-tool-injects-backdoor/",
        "Summary": "A new malware campaign targeting WordPress sites employs a malicious plugin disguised as a security tool to trick users into installing and trusting it. [...]",
        "Date": "2025-04-30",
        "Content": "A new malware campaign targeting WordPress sites employs a malicious plugin disguised as a security tool to trick users into installing and trusting it.\nAccording to Wordfence researchers, the malware provides attackers with persistent access, remote code execution, and JavaScript injection. At the same time, it remains hidden from the plugin dashboard to evade detection.\nWordfence first discovered the malware during a site cleanup in late January 2025, where it found a modified 'wp-cron.php' file, which creates and programmatically activates a malicious plugin named 'WP-antymalwary-bot.php.'\nOther plugin names used in the campaign include:\naddons.php\nwpconsole.php\nwp-performance-booster.php\nscr.php\nIf the plugin is deleted, wp-cron.php re-creates and reactivates it automatically on the next site visit.\nLacking server logs to help identify the exact infection chain, Wordfence hypothesizes the infection occurs via a compromised hosting account or FTP credentials.\nNot much is known about the perpetrators, though the researchers noted that the command and control (C2) server is located in Cyprus, and there are traits similar to a\nJune 2024 supply chain attack\n.\nOnce active on the server, the plugin performs a self-status check and then gives the attacker administrator access.\n\"The plugin provides immediate administrator access to threat actors via the emergency_login_all_admins function,\"\nexplains Wordfence in its writeup\n.\n\"This function utilizes the emergency_login GET parameter in order to allow attackers to obtain administrator access to the dashboard.\"\n\"If the correct cleartext password is provided, the function fetches all administrator user records from the database, picks the first one, and logs the attacker in as that user.\"\nNext, the plugin registers an unauthenticated custom REST API route that allows the insertion of arbitrary PHP code into all active theme header.php files, clearing of plugin caches, and other commands processed via a POST parameter.\nAn updated version of the malware can also inject base64-decoded JavaScript into the site's <head> section, likely for serving visitors ads, spam, or redirecting them to unsafe sites.\nApart from file-based indicators like the listed plugins, website owners should scrutinize their 'wp-cron.php' and 'header.php' files for unexpected additions or modifications.\nAccess logs containing 'emergency_login,' 'check_plugin,' 'urlchange,' and 'key' should also serve as red flags, warranting further investigation.\nRelated Articles:\nWooCommerce admins targeted by fake security patches that hijack sites\nHackers abuse WordPress MU-Plugins to hide malicious code\nRansomHub ransomware uses new Betruger ‘multi-function’ backdoor\nWordPress security plugin WP Ghost vulnerable to remote code execution bug\nMalware campaign 'DollyWay' breached 20,000 WordPress sites"
    },
    {
        "Title": "WhatsApp unveils 'Private Processing' for cloud-based AI features",
        "Link": "https://www.bleepingcomputer.com/news/security/whatsapp-unveils-private-processing-for-cloud-based-ai-features/",
        "Summary": "WhatsApp has announced the introduction of 'Private Processing,' a new technology that enables users to utilize advanced AI features by offloading tasks to privacy-preserving cloud servers. [...]",
        "Date": "2025-04-30",
        "Content": "WhatsApp has announced the introduction of 'Private Processing,' a new technology that enables users to utilize advanced AI features by offloading tasks to privacy-preserving cloud servers.\nThis is required to utilize AI functionalities such as message summarization and writing suggestions on WhatsApp, which are too demanding for on-device hardware.\nThe new feature will be entirely opt-in and not enabled by default, giving users complete control over how and when they choose to utilize it.\nPrivate Processing is not immediately available to WhatsApp users but will gradually be rolled out in the upcoming weeks.\nHow Private Processing works\nFor those who opt to use Private Processing, the system performs an anonymous authentication via the user's WhatsApp client to ensure the user's validity.\nNext, the app fetches public HPKE encryption keys from a third-party CDN so that Meta cannot trace requests back to specific users, maintaining full anonymity.\nThe user's device initiates a connection to a Meta gateway through a third-party relay, hiding their real IP address. It establishes a remote attestation (RA) + TLS session between the user's device and Meta's Trusted Execution Environment (TEE).\nNext, the user's device sends an end-to-end encrypted request for AI data processing using an ephemeral encryption key, which is processed inside a Confidential Virtual Machine (CVM) isolated from Meta.\nMeta claims the processing environment is stateless, and all messages are deleted after they're processed, leaving only \"non-sensitive\" logs behind.\nFinally, the AI-generated response is encrypted with a unique key only known to the device and processing CVM and is sent back over the secure session for decryption on the user's device.\nWhatsApp has\npromised\nto share the CVM binary and some source code to allow external validation, while a detailed white paper on the secure design of Private Processing will also be published soon.\nPrivacy concerns\nDespite the data security and privacy safeguarding assurances offered by Meta, there are always concerns when sensitive data leaves devices for processing on the cloud.\nUltimately, offloading AI tasks to cloud servers always comes with an inherent risk, even if implementing robust end-to-end encryption is utilized.\nUsers who are uncomfortable with how Private Processing works should leave it disabled.\nFor those who find advanced AI features useful but still need to stay in control over when data is allowed to leave their device, WhatsApp's recently launched\n'Advanced Chat Privacy' feature\nwould be the ideal solution.\nRelated Articles:\nMeta to resume AI training on content shared by Europeans\nWhatsApp's new Advanced Chat Privacy protects sensitive messages\nWhatsApp's Meta AI is now rolling out in Europe, and it can't be turned off\nGoogle takes on Cursor with Firebase Studio, its AI builder for vibe coding\nAI-hallucinated code dependencies become new supply chain risk"
    },
    {
        "Title": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/sonicwall-sma100-vpn-vulnerabilities-now-exploited-in-attacks/",
        "Summary": "Cybersecurity company SonicWall has warned customers that several vulnerabilities impacting its Secure Mobile Access (SMA) appliances are now being actively exploited in attacks. [...]",
        "Date": "2025-04-30",
        "Content": "​Cybersecurity company SonicWall has warned customers that several vulnerabilities impacting its Secure Mobile Access (SMA) appliances are now being actively exploited in attacks.\nOn Tuesday, SonicWall updated security advisories for the\nCVE-2023-44221\nand\nCVE-2024-38475\nsecurity flaws to tag the two vulnerabilities as \"potentially being exploited in the wild.\"\nCVE-2023-44221 is described as a high-severity command injection vulnerability caused by improper neutralization of special elements in the SMA100 SSL-VPN management interface that enables attackers with admin privileges to inject arbitrary commands as a 'nobody' user.\nThe second security bug, CVE-2024-38475, is rated as a critical severity flaw caused by improper escaping of output in mod_rewrite in Apache HTTP Server 2.4.59 and earlier. Successful exploitation can allow unauthenticated, remote attackers to gain code execution by mapping URLs to file system locations permitted to be served by the server.\nThe two vulnerabilities impact SMA 200, SMA 210, SMA 400, SMA 410, and SMA 500v devices and are patched in firmware version 10.2.1.14-75sv and later.\n\"During further analysis, SonicWall and trusted security partners identified an additional exploitation technique using CVE-2024-38475, through which unauthorized access to certain files could enable session hijacking,\"\nSonicWall warned\nin an updated advisory.\n\"During further analysis, SonicWall and trusted security partners identified that 'CVE-2023-44221 - Post Authentication OS Command Injection' vulnerability is potentially being exploited in the wild,\"\nit added\n. \"SonicWall PSIRT recommends that customers review their SMA devices to ensure no unauthorized logins.\"\nEarlier this month, the company\nflagged another high-severity flaw\npatched almost four years ago and tracked as\nCVE-2021-20035\nas actively exploited in remote code execution attacks targeting SMA100 VPN appliances. One day later, cybersecurity company Arctic Wolf said CVE-2021-20035 had been under active exploitation\nsince at least January 2025\n.\nCISA also\nadded the security bug\nto its\nKnown Exploited Vulnerabilities catalog\n, ordering U.S. federal agencies to secure their networks against ongoing attacks.\nIn January, SonicWall urged admins to patch a\ncritical flaw in SMA1000 secure access gateways\nthat was being exploited in zero-day attacks, and one month later warned of an\nactively exploited authentication bypass flaw\nin Gen 6 and Gen 7 firewalls that lets hackers\nhijack VPN sessions\n.\nRelated Articles:\nSonicWall SMA VPN devices targeted in attacks since January\nCISA tags SonicWall VPN flaw as actively exploited in attacks\nProtect your devices and data with this $40 five-year AdGuard VPN plan\nCISA tags Broadcom Fabric OS, CommVault flaws as exploited in attacks\nOver 1,200 SAP NetWeaver servers vulnerable to actively exploited flaw"
    },
    {
        "Title": "Commvault says recent breach didn't impact customer backup data",
        "Link": "https://www.bleepingcomputer.com/news/security/commvault-says-recent-breach-didnt-impact-customer-backup-data/",
        "Summary": "Commvault, a leading provider of data protection solutions, says a nation-state threat actor who breached its Azure environment didn't gain access to customer backup data. [...]",
        "Date": "2025-04-30",
        "Content": "Commvault, a leading provider of data protection solutions, says a nation-state threat actor who breached its Azure environment didn't gain access to customer backup data.\nListed on NASDAQ since March 2006, Commvault is included in the S&P MidCap 400 Index and provides cyber resilience services to over 100,000 organizations.\nAs the company\nfirst revealed on March 7\n, 2025, Commvault discovered the incident after being notified by Microsoft on February 20 of suspicious activity within its Azure environment. A follow-up investigation into the breach found that the incident only affected a small number of Commvault customers and had not impacted the company's operations.\n\"Importantly, there has been no unauthorized access to customer backup data that Commvault stores and protects, and no material impact on our business operations or our ability to deliver products and services,\" Danielle Sheer, the company's Chief Trust Officer,\nsaid in a Wednesday update\n.\n\"We are working closely with two leading cybersecurity firms and are coordinating with the appropriate authorities, including the FBI, Cybersecurity and Infrastructure Security Agency (CISA), and others.\"\nIn a\nsupport document\ncontaining indicators of compromise, Commvault advises customers to apply a Conditional Access policy to all Microsoft 365, Dynamics 365, and Azure AD single-tenant App registrations to protect their data against similar attack attempts.\nIt also recommended to regularly monitor sign-in activity to detect access attempts originating from IP addresses outside of allowed ranges and to rotate and sync client secrets between Commvault and the Azure portal every 90 days.\n\"This can help quickly identify potential security breaches or account compromises. If any unauthorized access is detected, immediately report the incident to Commvault Support for further investigation and remediation,\" the company says.\nThe company also noted in the original disclosure that the threat actors exploited a now-patched zero-day vulnerability (\nCVE-2025-3928\n) in its Commvault Web Server software that remote authenticated attackers with low privileges can exploit remotely to plant webshells on target servers.\nCISA has also\nadded the CVE-2025-3928 vulnerability\nto its Known Exploited Vulnerabilities Catalog on Monday, requiring federal agencies to secure their Commvault software by May 19, 2025, as mandated by the Binding Operational Directive (BOD) 22-01 issued in November 2021.\n\"These types of vulnerabilities are frequent attack vectors for malicious cyber actors and pose significant risks to the federal enterprise,\"\nCISA warned\n.\nRelated Articles:\nEnhance your resume with this Microsoft Azure certification course deal\nEncryptHub's dual life: Cybercriminal vs Windows bug-bounty researcher\nMITRE says state hackers breached its network via Ivanti zero-days\nNew Windows zero-day exploited by 11 state hacking groups since 2017\nMicrosoft March 2025 Patch Tuesday fixes 7 zero-days, 57 flaws"
    },
    {
        "Title": "FBI shares massive list of 42,000 LabHost phishing domains",
        "Link": "https://www.bleepingcomputer.com/news/security/fbi-shares-massive-list-of-42-000-labhost-phishing-domains/",
        "Summary": "The FBI has shared 42,000 phishing domains tied to the LabHost cybercrime platform, one of the largest global phishing-as-a-service (PhaaS) platforms that was dismantled in April 2024. [...]",
        "Date": "2025-04-30",
        "Content": "The FBI has shared 42,000 phishing domains tied to the LabHost cybercrime platform, one of the largest global phishing-as-a-service (PhaaS) platforms that was dismantled in April 2024.\nThe published domains were registered between November 2021 and April 2024, the time of its seizure, and are being shared to increase awareness and provide indicators of compromise.\nLabHost operations and takedown\nLabHost was a major PhaaS platform that sold access to an extensive set of phishing kits targeting U.S. and Canadian banks for between $179 and $300 per month.\nIt featured extensive customization options, advanced 2FA-bypassing mechanisms, automatic SMS-based interactions with victims, and a real-time campaign management panel.\nThough it launched in 2021, it was in late 2023/early 2024 when LabHost turned into\none of the major players\nin the PhaaS market, having surpassed established entities in popularity and attack volume.\nIt is estimated that LabHost has stolen over 1,000,000 user credentials and nearly 500,000 credit card records.\nIn April 2024, a global law enforcement operation backed by investigations in 19 countries led to the\ndismantling of the platform\n, which at the time had 10,000 customers worldwide.\nLabHost website seizure banner\nSource: BleepingComputer\nDuring the simultaneous searches at 70 addresses, 37 individuals suspected to have links to LabHost were arrested.\nAlthough the LabHost operation is no longer active and the shared 42,000 domains are not likely currently used in malicious operations, there's still significant value for cybersecurity firms and defenders.\nFirst,\nthe domain list\ncan be used to create a blocklist to mitigate the risk of threat actors recycling or re-registering any of them in future attacks.\nThe list can also be used by security teams to retrospectively scan logs from November 2021 to April 2024 to detect past connections to these domains and identify previously undetected breaches.\nUltimately, the list can help cybersecurity professionals analyze domain patterns in PhaaS platforms, aid attribution and intelligence correlation, and provide realistic data for phishing detection model training.\nThe list is shared with a note of caution that it hasn't been validated, so errors may exist.\n\"FBI has not validated every domain name, and the list may contain typographical or similar errors from LabHost user input,\"\nexplains the FBI\n.\n\"The information is historical in nature, and the domains may not currently be malicious.\"\nThe FBI also noted that analysis of this list may reveal additional domains linked to the same infrastructure, so the list may not be exhaustive.\nRelated Articles:\nPhishing platform 'Lucid' behind wave of iOS, Android SMS attacks\nNew Darcula phishing service targets iPhone users via iMessage\nTycoon2FA phishing kit targets Microsoft 365 with new tricks\nPhishing-as-a-service operation uses DNS-over-HTTPS for evasion\nWooCommerce admins targeted by fake security patches that hijack sites"
    },
    {
        "Title": "UK retailer Co-op shuts down some IT systems after hack attempt",
        "Link": "https://www.bleepingcomputer.com/news/security/uk-retailer-co-op-shuts-down-some-it-systems-after-hack-attempt/",
        "Summary": "British supermarket chain Co-op Food has confirmed to BleepingComputer via a statement that it has suffered limited operational disruption as it responds to a cyberattack. [...]",
        "Date": "2025-04-30",
        "Content": "British supermarket chain Co-op shut down parts of its IT systems after detecting an attempted intrusion into its network, disrupting back office and call center services.\nWhile A Co-op spokesperson confirmed the hacking attempts to BleepingComputer, they have not shared whether these attempts were successful.\n\"We have recently experienced attempts to gain unauthorized access to some of our systems,\" stated a Co-op spokesperson.\n\"As a result, we have taken proactive steps to keep our systems safe, which has resulted in a small impact on some of our back office and call center services.\"\nCo-op is a UK supermarket chain operating over 3700 branches across the country, having a reported annual revenue of nearly $10 billion. The entity is a consumer-owned co-operative with over 6,200,000 members as of last year.\nIn addition to its own stores, Co-op supplies products to over 5,100 other outlets, including those run by independent co-operative societies, through its wholesale business.\nCo-says that attempted hacks caused some disruption to their services, but the stores, its quick commerce operations, and funeral homes are operating as normal.\nAt this time, no details about the nature of the attack are known, and there are no announcements from threat actors claiming the attack.\nUK retail under attack\nThe cyberattack at Co-op comes shortly after Marks & Spencer (M&S), another well-known British multinational retailer operating 1,400 stores worldwide, announced they\nsuffered a cyberattack\n.\nIn response to the attack, M&S was forced to\nsuspend all online orders\n, which is expected to impact the company's financial performance.\nThe attack at M&S was eventually attributed to the threat actors classified as \"\nScattered Spider\n,\" who\ndeployed the DragonForce ransomware\non the company's networks.\nRelated Articles:\nCyberattack takes down Ukrainian state railway’s online services\nHitachi Vantara takes servers offline after Akira ransomware attack\nMarks & Spencer pauses online orders after cyberattack\nPhishing detection is broken: Why most attacks feel like a zero day\nMarks & Spencer confirms a cyberattack as customers face delayed orders"
    },
    {
        "Title": "Ascension discloses new data breach after third-party hacking incident",
        "Link": "https://www.bleepingcomputer.com/news/security/ascension-discloses-new-data-breach-after-third-party-hacking-incident/",
        "Summary": "​Ascension, one of the largest private healthcare systems in the United States, is notifying patients that their personal and health information was stolen in a December 2024 data theft attack, which affected a former business partner. [...]",
        "Date": "2025-04-30",
        "Content": "​Ascension, one of the largest private healthcare systems in the United States, is notifying patients that their personal and health information was stolen in a December 2024 data theft attack, which affected a former business partner.\nThe health network operates 142 hospitals nationwide, has over 142,000 employees, and has reported a total revenue of $28.3 billion in 2023.\n\"On December 5, 2024, we learned that Ascension patient information may have been involved in a potential security incident. We immediately initiated an investigation to determine whether and how a security incident occurred,\" Ascension says in\ndata breach notifications\nsent to affected individuals.\n\"Our investigation determined on January 21, 2025, that Ascension inadvertently disclosed information to a former business partner, and some of this information was likely stolen from them due to a vulnerability in third-party software used by the former business partner.\"\nDepending on the impacted patient, the attackers gained access to a combination of personal information, including name, address, phone number(s), email address, date of birth, race, gender, and Social Security numbers (SSNs).\nThey could also access personal health information related to inpatient visits, including the physician's name, admission and discharge dates, diagnosis and billing codes, medical record number, and insurance company name.\nEven though the breach notifications didn't include any information regarding the total number of patients who had their data exposed in this breach, the healthcare system said in an April 28 filing with Massachusetts' Office of the Attorney General that 96 MA residents were affected and had their medical records and SSNs exposed in the incident.\nAscension now offers two years of free identity monitoring services, including credit monitoring, fraud consultation, and identity theft restoration to those affected by this data breach.\nWhile the company didn't share any additional details regarding the breach impacting its former business partner, the timeline of the breach implies the attack was part of a\nseries of Clop ransomware data theft attacks\nthat exploited a zero-day flaw in Cleo secure file transfer software.\nAn Ascension spokesperson was not immediately available for comment when contacted by BleepingComputer earlier today.\nLast year, Ascension\nnotified nearly 5.6 million patients and employees\nthat their personal and health data had been stolen in a May 2024 Black Basta ransomware attack. After the incident, Ascension revealed that the ransomware breach resulted from an\nemployee who downloaded a malicious file\nonto a company device.\nRelated Articles:\nFrederick Health data breach impacts nearly 1 million patients\nYale New Haven Health data breach affects 5.5 million patients\nBlue Shield of California leaked health data of 4.7 million members to Google\nUS lab testing provider exposed health data of 1.6 million people\nVeriSource now says February data breach impacts 4 million people"
    },
    {
        "Title": "Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-11-24h2-updates-fail-with-0x80240069-errors/",
        "Summary": "Microsoft has confirmed that Windows 11 24H2 feature updates via Windows Server Update Services (WSUS) are being blocked after installing the April 2025 security updates. [...]",
        "Date": "2025-04-30",
        "Content": "Microsoft has confirmed that Windows 11 24H2 feature updates via Windows Server Update Services (WSUS) are being blocked after installing the April 2025 security updates.\nIntroduced as Software Update Services (SUS) almost two decades ago, WSUS helps IT admins manage (i.e., defer, approve, and schedule) updates for Microsoft products across large enterprise networks from a single server instead of relying on endpoints to update from Microsoft's servers.\nAffected enterprise users\nsee Windows Update Service (wuauserv\n)\nerrors with 0x80240069 codes when updating\nsystems running Windows 11 23H2 or Windows 11 22H2.\nThe company confirmed this newly acknowledged issue following widespread user reports of Windows 11 24H2 upgrade issues across online platforms,\nincluding\nReddit\nand its\nown\ncommunity\nwebsite\n.\n\"Devices which have installed the April Windows monthly security update, released April 8, 2025, or later (starting with KB5055528) might be unable to update to Windows 11 24H2 via Windows Server Update Services (WSUS),\"\nMicrosoft says\nin a Windows release health update.\n\"As part of this issue, the download of Windows 11 24H2 does not initiate or complete. Windows updates log can show error code 0x80240069, and further logs might include text similar to 'Service wuauserv has unexpectedly stopped'.\"\nRedmond added that home users are unlikely to experience these ongoing update problems since WSUS is typically used only in business and enterprise environments.\nIn September 2024, the company revealed that\nWSUS had been deprecated\n, while noting that it still planned to maintain all existing capabilities and keep publishing updates through the channel. The announcement came after WSUS was listed\nin August 2024\nas one of the \"features removed or no longer developed starting with Windows Server 2025.\"\nEarlier this month, the company informed users that it would\nindefinitely delay removing WSUS driver\nsynchronization\nbased on customer feedback after\nthree\nseparate\nwarnings\nover the last year that the feature would be removed on April 18, 2025\nMicrosoft is also working on fixing what the company describes as a \"latent code issue\"\ncausing some devices to be upgraded to Windows 11\ndespite Intune policies that should block Windows 11 upgrades.\nThis is not the first instance of Windows systems being upgraded without user consent in recent months, with Microsoft confirming in November 2024 that some devices running Windows Server 2019 and Windows Server 2022\nwere upgraded to Windows Server 2025\nwithout prior notice.\nRelated Articles:\nMicrosoft fixes auth issues on Windows Server, Windows 11 24H2\nMicrosoft: Some devices offered Windows 11 upgrades despite Intune blocks\nWindows 11 24H2 blocked on PCs with code-obfuscation driver BSODs\nMicrosoft adds hotpatching support to Windows 11 Enterprise\nMicrosoft fixes Remote Desktop issues caused by Windows updates"
    },
    {
        "Title": "Prolific RansomHub Operation Goes Dark",
        "Link": "https://www.darkreading.com/cyber-risk/prolific-ransomhub-operation-goes-dark",
        "Summary": "The chat infrastructure and data-leak site of the notorious ransomware-as-a-service group has been inactive since March 31, according to security vendors.",
        "Date": "2025-04-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/prolific-ransomhub-operation-goes-dark"
    },
    {
        "Title": "Former CISA Head Slams Trump Admin Over 'Loyalty Mandate'",
        "Link": "https://www.darkreading.com/cybersecurity-operations/former-cisa-head-slams-trump-admin-loyalty-mandate",
        "Summary": "Jen Easterly, former director of CISA, discussed the first 100 days of the second Trump administration and criticized the president's &quot;mandate for loyalty&quot; during a panel at RSAC 2025.",
        "Date": "2025-04-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/former-cisa-head-slams-trump-admin-loyalty-mandate"
    },
    {
        "Title": "Adversaries Are Toying With US Networks &amp; DC Is Short on Answers",
        "Link": "https://www.darkreading.com/cybersecurity-operations/adversaries-toying-with-us-networks",
        "Summary": "While nation-state actors are demonstrating how easily they can infiltrate US networks, government officials don't seem to have a clear vision for what comes next.",
        "Date": "2025-04-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/adversaries-toying-with-us-networks"
    },
    {
        "Title": "TheWizards APT Casts a Spell on Asian Gamblers With Novel Attack",
        "Link": "https://www.darkreading.com/cloud-security/thewizards-apt-asian-gamblers-attack",
        "Summary": "A SLAAC-spoofing, adversary-in-the-middle campaign is hiding the WizardNet backdoor malware inside updates for legitimate software and popular applications.",
        "Date": "2025-04-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/thewizards-apt-asian-gamblers-attack"
    },
    {
        "Title": "Phishers Take Advantage of Iberian Blackout Before It's Even Over",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/phishers-take-advantage-iberian-blackout",
        "Summary": "Opportunistic threat actors targeted Portuguese and Spanish speakers by spoofing Portugal's national airline in a campaign offering compensation for delayed or disrupted flights.",
        "Date": "2025-04-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/phishers-take-advantage-iberian-blackout"
    },
    {
        "Title": "DHS Boss Noem Vows to Get CISA Back 'On Mission'",
        "Link": "https://www.darkreading.com/cybersecurity-operations/dhs-secretary-noem-cisa-back-on-mission",
        "Summary": "Secretary Noem asks the cybersecurity community to get in touch with CISA to help reshape the agency to focus on finding efficiencies.",
        "Date": "2025-04-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/dhs-secretary-noem-cisa-back-on-mission"
    },
    {
        "Title": "DARPA Highlights Critical Infrastructure Security Challenges",
        "Link": "https://www.darkreading.com/cyber-risk/darpa-highlights-critical-infrastructure-security-challenges",
        "Summary": "Leaders at federal research organizations DARPA, ARPA-I, and ARPA-H discussed the myriad obstacles in addressing critical infrastructure security at RSAC Conference 2025.",
        "Date": "2025-04-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/darpa-highlights-critical-infrastructure-security-challenges"
    },
    {
        "Title": "Alleged ‘Scattered Spider’ Member Extradited to U.S.",
        "Link": "https://krebsonsecurity.com/2025/04/alleged-scattered-spider-member-extradited-to-u-s/",
        "Summary": "A 23-year-old Scottish man thought to be a member of the prolific Scattered Spider cybercrime group was extradited last week from Spain to the United States, where he is facing charges of wire fraud, conspiracy and identity theft. U.S. prosecutors allege Tyler Robert Buchanan and co-conspirators hacked into dozens of companies in the United States and abroad, and that he personally controlled more than $26 million stolen from victims.",
        "Date": "2025-04-30",
        "Content": "A 23-year-old Scottish man thought to be a member of the prolific Scattered Spider cybercrime group was extradited last week from Spain to the United States, where he is facing charges of wire fraud, conspiracy and identity theft. U.S. prosecutors allege Tyler Robert Buchanan and co-conspirators hacked into dozens of companies in the United States and abroad, and that he personally controlled more than $26 million stolen from victims.\nScattered Spider is a loosely affiliated criminal hacking group whose members have broken into and stolen data from some of the world’s largest technology companies. Buchanan was arrested in Spain last year on a warrant from the FBI, which wanted him in connection with a series of SMS-based phishing attacks in the summer of 2022 that led to intrusions at Twilio, LastPass, DoorDash, Mailchimp, and many other tech firms.\nTyler Buchanan, being escorted by Spanish police at the airport in Palma de Mallorca in June 2024.\nAs first reported by KrebsOnSecurity, Buchanan (a.k.a. “tylerb”) fled the United Kingdom in February 2023, after a rival cybercrime gang hired thugs to invade his home, assault his mother, and threaten to burn him with a blowtorch unless he gave up the keys to his cryptocurrency wallet. Buchanan was arrested in June 2024 at the airport in Palma de Mallorca while trying to board a flight to Italy. His extradition to the United States was first reported last week by Bloomberg.\nMembers of Scattered Spider have been tied to the 2023 ransomware attacks against MGM and Caesars casinos in Las Vegas, but it remains unclear whether Buchanan was implicated in that incident. The Justice Department’s complaint against Buchanan makes no mention of the 2023 ransomware attack.\nRather, the investigation into Buchanan appears to center on the SMS phishing campaigns from 2022, and on SIM-swapping attacks that siphoned funds from individual cryptocurrency investors. In a SIM-swapping attack, crooks transfer the target’s phone number to a device they control and intercept any text messages or phone calls to the victim’s device — including one-time passcodes for authentication and password reset links sent via SMS.\nIn August 2022, KrebsOnSecurity reviewed data harvested in a months-long cybercrime campaign by Scattered Spider involving countless SMS-based phishing attacks against employees at major corporations. The security firm Group-IB called them by a different name — 0ktapus, because the group typically spoofed the identity provider Okta in their phishing messages to employees at targeted firms.\nA Scattered Spider/0Ktapus SMS phishing lure sent to Twilio employees in 2022.\nThe complaint against Buchanan (PDF) says the FBI tied him to the 2022 SMS phishing attacks after discovering the same username and email address was used to register numerous Okta-themed phishing domains seen in the campaign. The domain registrar NameCheap found that less than a month before the phishing spree, the account that registered those domains logged in from an Internet address in the U.K. FBI investigators said the Scottish police told them the address was leased to Buchanan from January 26, 2022 to November 7, 2022.\nAuthorities seized at least 20 digital devices when they raided Buchanan’s residence, and on one of those devices they found usernames and passwords for employees of three different companies targeted in the phishing campaign.\n“The FBI’s investigation to date has gathered evidence showing that Buchanan and his co-conspirators targeted at least 45 companies in the United States and abroad, including Canada, India, and the United Kingdom,” the FBI complaint reads. “One of Buchanan’s devices contained a screenshot of Telegram messages between an account known to be used by Buchanan and other unidentified co-conspirators discussing dividing up the proceeds of SIM swapping.”\nU.S. prosecutors allege that records obtained from Discord showed the same U.K. Internet address was used to operate a Discord account that specified a cryptocurrency wallet when asking another user to send funds. The complaint says the publicly available transaction history for that payment address shows approximately 391 bitcoin was transferred in and out of this address between October 2022 and\nFebruary 2023; 391 bitcoin is presently worth more than $26 million.\nIn November 2024, federal prosecutors in Los Angeles unsealed criminal charges against Buchanan and four other alleged Scattered Spider members, including Ahmed Elbadawy, 23, of College Station, Texas; Joel Evans, 25, of Jacksonville, North Carolina; Evans Osiebo, 20, of Dallas; and Noah Urban, 20, of Palm Coast, Florida. KrebsOnSecurity reported last year that another suspected Scattered Spider member — a 17-year-old from the United Kingdom — was arrested as part of a joint investigation with the FBI into the MGM hack.\nMr. Buchanan’s court-appointed attorney did not respond to a request for comment. The accused faces charges of wire fraud conspiracy, conspiracy to obtain information by computer for private financial gain, and aggravated identity theft. Convictions on the latter charge carry a minimum sentence of two years in prison.\nDocuments from the U.S. District Court for the Central District of California indicate Buchanan is being held without bail pending trial. A preliminary hearing in the case is slated for May 6.\n\r\n         This entry was posted on Wednesday 30th of April 2025 05:54 PM \r\n         \nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "Tech Giants Propose Standard For End-of-Life Security Disclosures",
        "Link": "https://www.securityweek.com/tech-giants-propose-standard-for-end-of-life-security-disclosures/",
        "Summary": "<p>The OpenEoX model proposes a shared data format that can be integrated into SBOMs, security advisories, and other ecosystem tools. </p>\n<p>The post <a href=\"https://www.securityweek.com/tech-giants-propose-standard-for-end-of-life-security-disclosures/\">Tech Giants Propose Standard For End-of-Life Security Disclosures</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/tech-giants-propose-standard-for-end-of-life-security-disclosures/"
    },
    {
        "Title": "RSA Conference 2025 Announcement Summary (Day 2)",
        "Link": "https://www.securityweek.com/rsa-conference-2025-announcements-summary-day-2/",
        "Summary": "<p>Hundreds of companies are showcasing their products and services this week at the 2025 edition of the RSA Conference in San Francisco.</p>\n<p>The post <a href=\"https://www.securityweek.com/rsa-conference-2025-announcements-summary-day-2/\">RSA Conference 2025 Announcement Summary (Day 2) </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/rsa-conference-2025-announcements-summary-day-2/"
    },
    {
        "Title": "Meta Releases Llama AI Open Source Protection Tools",
        "Link": "https://www.securityweek.com/meta-releases-llama-ai-open-source-protection-tools/",
        "Summary": "<p>Meta has released new Llama protection tools to help the open source AI community build more secure applications.</p>\n<p>The post <a href=\"https://www.securityweek.com/meta-releases-llama-ai-open-source-protection-tools/\">Meta Releases Llama AI Open Source Protection Tools</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/meta-releases-llama-ai-open-source-protection-tools/"
    },
    {
        "Title": "France Blames Russia for Cyberattacks on Dozen Entities",
        "Link": "https://www.securityweek.com/france-blames-russia-for-cyberattacks-on-dozen-entities/",
        "Summary": "<p>France says the Russian state-sponsored group APT28 is responsible for targeting or compromising a dozen French entities.</p>\n<p>The post <a href=\"https://www.securityweek.com/france-blames-russia-for-cyberattacks-on-dozen-entities/\">France Blames Russia for Cyberattacks on Dozen Entities</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/france-blames-russia-for-cyberattacks-on-dozen-entities/"
    },
    {
        "Title": "AirPlay Vulnerabilities Expose Apple Devices to Zero-Click Takeover",
        "Link": "https://www.securityweek.com/airplay-vulnerabilities-expose-apple-devices-to-zero-click-takeover/",
        "Summary": "<p>Vulnerabilities in Apple’s AirPlay protocol could have allowed attackers to execute code remotely without user interaction.</p>\n<p>The post <a href=\"https://www.securityweek.com/airplay-vulnerabilities-expose-apple-devices-to-zero-click-takeover/\">AirPlay Vulnerabilities Expose Apple Devices to Zero-Click Takeover</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/airplay-vulnerabilities-expose-apple-devices-to-zero-click-takeover/"
    },
    {
        "Title": "Chrome 136, Firefox 138 Patch High-Severity Vulnerabilities",
        "Link": "https://www.securityweek.com/chrome-136-firefox-138-patch-high-severity-vulnerabilities/",
        "Summary": "<p>Chrome 136 and Firefox 138 were released in the stable channel with patches for multiple high-severity vulnerabilities.</p>\n<p>The post <a href=\"https://www.securityweek.com/chrome-136-firefox-138-patch-high-severity-vulnerabilities/\">Chrome 136, Firefox 138 Patch High-Severity Vulnerabilities</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-30",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chrome-136-firefox-138-patch-high-severity-vulnerabilities/"
    }
]