[
    {
        "Title": "Mustang Panda Targets Myanmar With StarProxy, EDR Bypass, and TONESHELL Updates",
        "Link": "https://thehackernews.com/2025/04/mustang-panda-targets-myanmar-with.html",
        "Summary": "The China-linked threat actor known as Mustang Panda has been attributed to a cyber attack targeting an unspecified organization in Myanmar with previously unreported tooling, highlighting continued effort by the threat actors to increase the sophistication and effectiveness of their malware.\nThis includes updated versions of a known backdoor called TONESHELL, as well as a new lateral movement",
        "Date": "2025-04-17",
        "Content": "The China-linked threat actor known as\nMustang Panda\nhas been attributed to a cyber attack targeting an unspecified organization in Myanmar with previously unreported tooling, highlighting continued effort by the threat actors to increase the sophistication and effectiveness of their malware.\nThis includes updated versions of a known backdoor called\nTONESHELL\n, as well as a new lateral movement tool dubbed StarProxy, two keyloggers codenamed PAKLOG, CorKLOG, and an Endpoint Detection and Response (EDR) evasion driver referred to as\nSplatCloak\n.\n\"TONESHELL, a backdoor used by Mustang Panda, has been updated with changes to its FakeTLS command-and-control (C2) communication protocol as well as to the methods for creating and storing client identifiers,\" Zscaler ThreatLabz researcher Sudeep Singh said in a\ntwo-part\nanalysis\n.\nMustang Panda, also known as BASIN, Bronze President, Camaro Dragon, Earth Preta, HoneyMyte, and RedDelta, is a China-aligned state-sponsored threat actor active since at least 2012.\nKnown for its attacks on governments, military entities, minority groups, and non-governmental organizations (NGOs) primarily in countries located in East Asia, and to a lesser extent in Europe, the group has a history of\nleveraging DLL side-loading\ntechniques to deliver the PlugX malware.\nHowever, since late 2022, campaigns orchestrated by Mustang Panda have begun to frequently deliver a bespoke malware family called\nTONESHELL\n, which is designed to download next-stage payloads.\nZscaler said it discovered three new variants of the malware that come with varying levels of sophistication -\nVariant 1\n, which acts as a simple reverse shell\nVariant 2\n, which includes functionality to download DLLs from the C2 and execute them by injecting the DLL into legitimate processes (e.g., svchost.exe)\nVariant 3\n, which includes functionality to download files and create a sub-process to execute commands received from a remote server via a custom TCP-based protocol\nA new piece of software associated with Mustang Panda is StarProxy, which is launched via DLL side-loading and is designed to take advantage of FakeTLS protocol to proxy traffic and facilitate attacker communications.\n\"Once active, StarProxy allows attackers to proxy traffic between infected devices and their C2 servers. StarProxy achieves this by utilizing TCP sockets to communicate with the C2 server via the FakeTLS protocol, encrypting all exchanged data with a custom XOR-based encryption algorithm,\" Singh said.\n\"Additionally, the tool uses command-line arguments to specify the IP address and port for communication, enabling attackers to relay data through compromised machines.\"\nStarProxy activity\nIt's believed that StarProxy is deployed as a post-compromise tool to access internal workstations within a network that are not directly exposed to the internet.\nAlso identified are two new keyloggers, PAKLOG and CorKLOG, that are used to monitor keystrokes and clipboard data. The primary difference between the two is that the latter stores the captured data in an encrypted file using a 48-character RC4 key and implements persistence mechanisms by creating services or scheduled tasks.\nBoth the keyloggers lack data exfiltration capabilities of their own, meaning they solely exist to collect the keystroke data and write them to a specific location and that the threat actor uses other methods to transmit them to their infrastructure.\nCapping off the new additions to the Mustang Panda's malware arsenal is SplatCloak, a Windows kernel driver deployed by SplatDropper that's equipped to disable EDR-related routines implemented by Windows Defender and Kaspersky, thereby allowing it to fly under the radar.\n\"Mustang Panda demonstrates a calculated approach to achieving their objectives,\" Singh said. \"Continuous updates, new tooling, and layered obfuscation prolongs the group's operational security and improves the efficacy of attacks.\"\nUNC5221 Drops New Versions of BRICKSTORM Targeting Windows\nThe disclosure comes as the China-nexus cyber espionage cluster named UNC5221 has been\nconnected\nto use of a new version of the BRICKSTORM malware in attacks aimed at Windows environments in Europe since at least 2022, according to Belgian cybersecurity firm NVISO.\nBRICKSTORM,\nfirst documented\nlast year\nin connection with the zero-day exploitation of Ivanti Connect Secure zero-day vulnerabilities (CVE-2023-46805 and CVE-2024-21887) against the MITRE Corporation, is a Golang backdoor deployed on Linux servers running VMware vCenter.\n\"It supports the ability to set itself up as a web server, perform file system and directory manipulation, perform file operations such as upload/download, run shell commands, and perform SOCKS relaying,\" Google Mandiant\nsaid\nin April 2024. \"BRICKSTORM communicates over WebSockets to a hard-coded C2.\"\nThe newly identified Windows artifacts, also written in Go, provide attackers with file manager and network tunneling capabilities through a panel, enabling them to browse the file system, create or delete files, and tunnel network connections for lateral movement.\nThey also resolve C2 servers through DNS-over-HTTPS (\nDoH\n), and are engineered to evade network-level defenses like DNS monitoring, TLS inspection, and geo-blocking.\n\"The Windows samples [..] are not equipped with command execution capabilities,\" NVISO said. \"Instead, adversaries have been observed using network tunneling capabilities in combination with valid credentials to abuse well-known protocols such as RDP or SMB, thus achieving similar command execution.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "State-Sponsored Hackers Weaponize ClickFix Tactic in Targeted Malware Campaigns",
        "Link": "https://thehackernews.com/2025/04/state-sponsored-hackers-weaponize.html",
        "Summary": "Multiple state-sponsored hacking groups from Iran, North Korea, and Russia have been found leveraging the increasingly popular ClickFix social engineering tactic to deploy malware over a three-month period from late 2024 through the beginning of 2025.\nThe phishing campaigns adopting the strategy have been attributed to clusters tracked as TA427 (aka Kimsuky), TA450 (aka MuddyWater),",
        "Date": "2025-04-17",
        "Content": "Multiple state-sponsored hacking groups from Iran, North Korea, and Russia have been found leveraging the increasingly popular ClickFix social engineering tactic to deploy malware over a three-month period from late 2024 through the beginning of 2025.\nThe phishing campaigns adopting the strategy have been attributed to clusters tracked as\nTA427\n(aka Kimsuky),\nTA450\n(aka MuddyWater), UNK_RemoteRogue, and\nTA422\n(aka APT28).\nClickFix has been an initial access technique primarily affiliated with cybercrime groups, although the effectiveness of the approach has led to it also being adopted by nation-state groups.\n\"The incorporation of ClickFix is not revolutionizing the campaigns carried out by TA427, TA450, UNK_RemoteRogue, and TA422 but instead is replacing the installation and execution stages in existing infection chains,\" enterprise security firm Proofpoint\nsaid\nin a report published today.\nClickFix\n, in a nutshell, refers to a sneaky technique that urges users to infect their own machine by following a series of instructions to copy, paste, and run malicious commands under the pretext of fixing an issue, completing a CAPTCHA verification, or registering their device.\nProofpoint said it first detected Kimsuky using ClickFix in January and February 2025 as part of a phishing campaign that targeted individuals in less than five organizations in the think tank sector.\n\"TA427 made initial contact with the target through a meeting request from a\nspoofed sender\ndelivered to traditional TA427 targets working on North Korean affairs,\" the Proofpoint research team said.\nTA427 ClickFix infection chain\n\"After a brief conversation to engage the target and build trust, as is often seen in TA427 activity, the attackers directed the target to an attacker-controlled site where they convinced the target to run a PowerShell command.\"\nThe attack chain, the company explained, initiated a multi-stage sequence that culminated in the deployment of an open-source remote access trojan named Quasar RAT.\nThe email message purported to originate from a Japanese diplomat and asked the recipient to arrange a meeting with the Japanese ambassador to the United States. Over the course of the conversation, the threat actors sent a malicious PDF that contained a link to another document with a list of questions to be discussed during the meeting.\nTA450 ClickFix infection chain\nClicking on the link directed the victim to a fake landing page mimicking the Japanese Embassy website, which then prompted them to register their device by copying and pasting a command into the Windows Run dialog in order to download the questionnaire.\n\"The ClickFix PowerShell command fetches and executes a second remotely hosted PowerShell command, which displayed the decoy PDF referenced earlier in the chain (Questionnaire.pdf) to the user,\" Proofpoint said. \"The document claimed to be from the Ministry of Foreign Affairs in Japan and contained questions regarding nuclear proliferation and policy in Northeast Asia.\"\nThe second PowerShell script is configured to create a Visual Basic Script that runs every 19 minutes by means of a scheduled task, which, in turn, downloads two batch scripts that create, decode, and execute the Quasar RAT payload. It's worth pointing out that a variation of this attack chain was\npreviously documented\nby Microsoft in February 2025.\nUNK_RemoteRogue ClickFix infection chain\nThe second nation-state group to latch on to ClickFix is the Iran-linked MuddyWater group that has taken advantage of the technique to legitimate remote monitoring and management (RMM) software like\nLevel\nfor maintaining persistent access.\nThe phishing emails, sent on November 13 and 14, 2024, coinciding with\nMicrosoft's Patch Tuesday\nupdates, masqueraded as a security update from the tech giant, asking message recipients to follow ClickFix-style instructions to address a supposed vulnerability.\n\"The attackers deployed the ClickFix technique by persuading the target to first run PowerShell with administrator privileges, then copy and run a command contained in the email body,\" Proofpoint said.\n\"The command was responsible for installing remote management and monitoring (RMM) software – in this case, Level – after which TA450 operators will abuse the RMM tool to conduct espionage and exfiltrate data from the target's machine.\"\nThe TA450 ClickFix campaign is said to target finance, government, health, education, and transportation sectors across the Middle East, with an emphasis on the United Arab Emirates (U.A.E.) and Saudi Arabia, as well as those located in Canada, Germany, Switzerland, and the United States.\nAlso observed boarding the ClickFix bandwagon is a suspected Russian group tracked as UNK_RemoteRogue towards the end of last year using lure emails sent from likely compromised Zimbra servers that included a link to a Microsoft Office document.\nTimeline of standard campaigns and ClickFix sightings (Jul 2024 - Mar 2025)\nVisiting the link displayed a page containing instructions to copy code from the browser into their terminal, along with a YouTube video tutorial on how to run PowerShell. The PowerShell command was equipped with capabilities to run JavaScript that executed PowerShell code linked to the Empire command-and-control (C2) framework.\nProofpoint said the campaign sent 10 messages to individuals in two organizations associated with a major arms manufacturer in the defense industry. UNK_RemoteRogue has also been found to share infrastructure overlaps with\nanother phishing campaign\nthat targeted defense and aerospace entities with links to the ongoing conflict in Ukraine to harvest webmail credentials via fake login pages.\n\"Multiple examples of state-sponsored actors using ClickFix have shown not only the technique's popularity among state actors, but also its use by various countries within weeks of one another,\" the company said. \"Although not a persistently used technique, it is likely that more threat actors from North Korea, Iran, and Russia have also tried and tested ClickFix or may in the near future.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Artificial Intelligence – What's all the fuss?",
        "Link": "https://thehackernews.com/2025/04/artificial-intelligence-whats-all-fuss.html",
        "Summary": "Talking about AI: Definitions\nArtificial Intelligence (AI) — AI refers to the simulation of human intelligence in machines, enabling them to perform tasks that typically require human intelligence, such as decision-making and problem-solving. AI is the broadest concept in this field, encompassing various technologies and methodologies, including Machine Learning (ML) and Deep Learning.\nMachine",
        "Date": "2025-04-17",
        "Content": "Talking about AI: Definitions\nArtificial Intelligence (AI) —\nAI refers to the simulation of human intelligence in machines, enabling them to perform tasks that typically require human intelligence, such as decision-making and problem-solving. AI is the broadest concept in this field, encompassing various technologies and methodologies, including Machine Learning (ML) and Deep Learning.\nMachine Learning (ML) —\nML is a subset of AI that focuses on developing algorithms and statistical models that allow machines to learn from and make predictions or decisions based on data. ML is a specific approach within AI, emphasizing data-driven learning and improvement over time.\nDeep Learning (DL) —\nDeep Learning is a specialized subset of ML that uses neural networks with multiple layers to analyze and interpret complex data patterns. This advanced form of ML is particularly effective for tasks such as image and speech recognition, making it a crucial component of many AI applications.\nLarge Language Models (LLM) —\nLLMs are a type of AI model designed to understand and generate human-like text by being trained on extensive text datasets. These models are a specific application of Deep Learning, focusing on natural language processing tasks, and are integral to many modern AI-driven language applications.\nGenerative AI (GenAI) —\nGenAI refers to AI systems capable of creating new content, such as text, images, or music, based on the data they have been trained on. This technology often leverages LLMs and other Deep Learning techniques to produce original and creative outputs, showcasing the advanced capabilities of AI in content generation.\nOverview: AI for Good and Bad\nAlmost daily now we watch the hallowed milestone of the \"Turing Test\" slip farther and farther into an almost naïve irrelevance, as computer interfaces have evolved from being comparable to human language, to similar, to indistinguishable, to arguably superior\n[1]\n.\nThe development of large language models (LLMs) began with natural language processing (NLP) advancements in the early 2000s, but the major breakthrough came with Ashish Vaswani's 2017 paper, \"Attention is All You Need.\" This allowed for training larger models on vast datasets, greatly improving language understanding and generation.\nLike any technology, LLMs are neutral and can be used by both attackers and defenders. The key question is, which side will benefit more, or more quickly?\nLet's dive into that question in a bit more detail. This is but an excerpt of our coverage in the\nSecurity Navigator 2025\n, but it covers some of the main points that should be relevant to everyone who works in a security- or technology context. If you want to read more on 'Prompt Injection' techniques or how AI is productively used in security technology I invite you to get the full report!\nAI in defense operations\nMay improve general office productivity and communication\nMay improve search, research and Open-Source Intelligence\nMay enable efficient international and cross-cultural communications\nMay assist with collation and summarization of diverse, unstructured text datasets\nMay assist with documentation of security intelligence and event information\nMay assist with analyzing potentially malicious emails and files\nMay assist with identification of fraudulent, fake or deceptive text, image or video content.\nMay assist with security testing functions like reconnaissance and vulnerability discovery.\nAI in one form or another has long been used in a variety of security technologies.\nBy way of example:\nIntrusion Detection Systems (IDS) and Threat Detection.\nSecurity vendor Darktrace, employs ML to autonomously detect and respond to threats in real-time by leveraging behavioral analysis and ML algorithms trained on historical data to flag suspicious deviations from normal activity.\nPhishing Detection and Prevention.\nML models are used in products like Proofpoint and Microsoft Defender that identify and block phishing attacks utilizing ML algorithms to analyze email content, metadata, and user behavior to identify phishing attempts.\nEndpoint Detection and Response (EDR).\nEDR offerings like CrowdStrike Falcon leverage ML to identify unusual behavior and detect and mitigate cyber threats on endpoints.\nMicrosoft Copilot for Security.\nMicrosoft's AI-powered solution is designed to assist security professionals by streamlining threat detection, incident response, and risk management by leveraging generative AI, including OpenAI's GPT models.\nAI in offensive operations\nMay improve general office productivity and communication for bad actors as well\nMay improve search, research and Open-Source Intelligence\nMay enable efficient international and cross-cultural communications\nMay assist with collation and summarization of diverse, unstructured text datasets (like social media profiles for phishing/spear-phishing attacks)\nMay assist with attack processes like reconnaissance and vulnerability discovery.\nMay assist with the creation of believable text for cyber-attack methods like phishing, waterholing and malvertising.\nCan assist with the creation of fraudulent, fake or deceptive text, image or\nvideo content.\nMay facilitate accidental data leakage or unauthorized data access\nMay present a new, vulnerable and attractive attack surface.\nReal-world examples of AI in offensive operations have been relatively rare. Notable instances include MIT's Automated Exploit Generation (AEG)\n[2]\nand IBM's DeepLocker\n[3]\n, which demonstrated AI-powered malware. These remain proof-of-concepts for now. In 2019, our research team presented two AI-based attacks using Topic Modelling\n[4],\nshowing AI's offensive potential for network mapping and email classification. While we haven't seen widespread use of such capabilities, in October 2024, our CERT reported\n[5]\nthat the Rhadamanthys Malware-as-a-Service (MaaS) incorporated AI to perform Optical Character Recognition (OCR) on images containing sensitive information, like passwords, marking the closest real-world instance of AI-driven offensive capabilities.\nSecurity Navigator 2025 is Here - Download Now\nThe newly released\nSecurity Navigator 2025\noffers critical insights into current digital threats, documenting 135,225 incidents and 20,706 confirmed breaches. More than just a report, it serves as a guide to navigating a safer digital landscape.\nWhat's Inside?\n#\n📈 In-Depth Analysis: Statistics from CyberSOC, Vulnerabilitiy scanning, Pentesting, CERT, Cy-X and Ransomware observations from Dark Net surveillance.\n🔮 Future-Ready: Equip yourself with security predictions and stories from the field.\n👁️ Security deep-dives: Get briefed on emerging trends related to hacktivist activities and LLMs/Generative AI.\nStay one step ahead in cybersecurity. Your essential guide awaits!\n🔗 Get Your Copy Now\nLLMs are increasingly being used offensively, especially in scams. A prominent example is the UK engineering group Arup\n[6]\n, which reportedly lost $25 million to fraudsters who used a digitally cloned voice of a senior manager to order financial transfers during a video conference.\nDoes AI drive threats?\nFor systematically considering the potential risk from LLM technologies, we examine four perspectives: the risk of not adopting LLMs, existing AI threats, new threats specific to LLMs, and broader risks as LLMs are integrated into business and society. These aspects are visualized in the graphic below:\nBranch 1: The Risk of Non-adoption\nMany clients we talk to feel pressure to adopt LLMs, with CISOs particularly concerned about the \"risk of non-adoption,\" driven by three main factors:\nEfficiency loss: Leaders believe LLMs like Copilot or ChatGPT will boost worker efficiency and fear falling behind competitors who adopt them.\nOpportunity loss: LLMs are seen as uncovering new business opportunities, products, or market channels, and failing to leverage them risks losing a competitive edge.\nMarketability loss: With AI dominating discussions, businesses worry that not showcasing AI in their offerings will leave them irrelevant in the market.\nThese concerns are valid, but the assumptions are often untested. For example, a July 2024 survey by the Upwork Research Agency\n[7]\nrevealed that \"96% of C-suite leaders expect AI tools to boost productivity.\" However, the report points out, \"Nearly half (47%) of employees using AI say they have no idea how to achieve the productivity gains their employers expect, and 77% say these tools have actually decreased their productivity and added to their workload.\nThe marketing value of being \"powered by AI\" is also still debated. A recent FTC report notes that consumers have voiced concerns about AI's entire lifecycle, particularly regarding limited appeal pathways for AI-based product decisions.\nBusinesses must consider the true costs of adopting LLMs, including direct expenses like licensing, implementation, testing, and training. There's also an opportunity cost, as resources allocated to LLM adoption could have been invested elsewhere.\nSecurity and privacy risks need to be considered too, alongside broader economic externalities—such as the massive resource consumption of LLM training, which requires significant power and water usage. According to one article\n[8]\n, Microsoft's AI data centers may consume more power than all of India within the next six years. Apparently \"They will be cooled by millions upon millions of gallons of water\".\nBeyond resource strain, there are ethical concerns as creative works are often used to train models without creators' consent, affecting artists, writers, and academics. Additionally, AI concentration among a few owners could impact business, society, and geopolitics, as these systems amass wealth, data, and control. While LLMs promise increased productivity, businesses risk sacrificing direction, vision, and autonomy for convenience. In weighing the risk of non-adoption, the potential benefits must be carefully balanced against the direct, indirect, and external costs, including security. Without a clear understanding of the value LLMs may bring, businesses might find the risks and costs outweigh the rewards.\nBranch 2: Existing Threats From AI\nIn mid October 2024, our \"World Watch\" security intelligence capability published an advisory that summarized the use of AI by offensive actors as follows: \"The adoption of AI by APTs remains likely in early stages but it is only a matter of time before it becomes more widespread.\" One of the most common ways state-aligned and state-sponsored threat groups have been adopting AI in their kill chains is by using Generative AI chatbots such as ChatGPT for malicious purposes. We assess that these usages differ depending on each group's own capabilities and interests.\nNorth Korean threat actors have been allegedly leveraging LLMs to better understand publicly reported vulnerabilities\n[9]\n, for basic scripting tasks and for target reconnaissance (including dedicated content creation used in social engineering).\nIranian groups were seen generating phishing emails and used LLMs for web scraping\n[10]\n.\nChinese groups such as Charcoal Typhoon abused LLMs for advanced commands representative of post-compromise behavior\n[10].\nIn October 9, OpenAI disclosed\n[11]\nthat since the beginning of the year it had disrupted over 20 ChatGPT abuses aimed at debugging and developing malware, spreading misinformation, evading detection, and launching spear-phishing attacks. These malicious usages were attributed to Chinese (SweetSpecter) and Iranian threat actors (CyberAv3ngers and Storm-0817). The Chinese cluster SweetSpecter (tracked as TGR-STA-0043 by Palo Alto Networks) even targeted OpenAI employees with spear-phishing attacks.\nRecently, state-sponsored threat groups have also been observed carrying out disinformation and influence campaigns targeting the US presidential election for instance. Several campaigns attributed to Iranian, Russian and Chinese threat actors leveraged AI tools to erode public trust in the US democratic system or discredit a candidate. In its Digital Defense Report 2024, Microsoft confirmed this trend, adding that these threat actors were leveraging AI to create fake text, images and videos.\nCybercrime\nIn addition to leveraging legitimate chatbots, cybercriminals have also created \"dark LLMs\" (models trained specifically for fraudulent purposes) such as FraudGPT, WormGPT and DarkGemini. These tools are used to automate and enhance phishing campaigns, help low-skilled developers create malware, and generate scam-related content. They are typically advertised on the DarkWeb and Telegram, with an emphasis on the model's criminal function.\nSome financially-motivated threat groups are also adding AI to their malware strains. A recent World Watch advisory on the new version of the Rhadamanthys infostealer describes new features relying on AI to analyze images that may contain important information, such as passwords or recovery phrases.\nIn our continuous monitoring of cybercriminal forums and marketplaces we observed a clear increase in malicious services supporting social-engineering activities, including:\nDeepfakes\n, notably for sextortion and romance schemes. This technology is becoming more convincing and less expensive over time.\nAI-powered phishing and BEC tools\ndesigned to facilitate the creation of phishing pages, social media contents and email copies.\nAI-powered voice phishing.\nIn a report published on July 23, Google revealed\n[12]\nhow AI-powered vishing (or voice-spoofing), facilitated by commodified voice synthesizers, was an emerging threat.\nVulnerability exploitation\nAI still faces limits when used to write exploit code based on a CVE description. If the technology improves and becomes more readily available, it will likely be of interest to both cybercriminals and state-backed actors. An LLM capable of autonomously finding a critical vulnerability, writing and testing exploit code and then using it against targets, could deeply impact the threat landscape. Exploit development skills could thus become accessible to anyone with access to an advanced AI model. The source code of most products is fortunately not readily available for training such models, but open source software may present a useful testcase.\nBranch 3: New Threats from LLMs\nThe new threats emerging from widespread LLM adoption will depend on how and where the technology is used. In this report, we focus strictly on LLMs and must consider whether they are in the hands of attackers, businesses, or society at large. For businesses, are they consumers of LLM services or providers? If a provider, are they building their own models, sourcing models, or procuring full capabilities from others?\nEach scenario introduces different threats, requiring tailored controls to mitigate the risks specific to that use case.\nThreats to Consumers\nA Consumer uses GenAI products and services from external providers, while a Provider creates or enhances consumer-facing services that leverage LLMs, whether by developing in-house models or using third-party solutions. Many businesses will likely adopt both roles over time.\nIt's important to recognize that employees are almost certainly already using public or local GenAI for work and personal purposes, posing additional challenges for enterprises. For those consuming external LLM services, whether businesses or individual employees, the primary risks revolve around data security, with additional compliance and legal concerns to consider. The main data-related risks include:\nData leaks:\nWorkers may unintentionally disclose confidential data to LLM systems like ChatGPT, either directly or through the nature of their queries.\nHallucination:\nGenAI can produce inaccurate, misleading, or inappropriate content that employees might incorporate into their work, potentially creating legal liability. When generating code, there's a risk it could be buggy or insecure\n[13]\n.\nIntellectual Property Rights:\nAs businesses use data to train LLMs and incorporate outputs into their intellectual property, unresolved questions about ownership could expose them to liability for rights violations.\nThe outputs of GenAI only enhance productivity if they are accurate, appropriate, and lawful. Unregulated AI-generated outputs could introduce misinformation, liability, or legal risks to the business.\nThreats to providers\nAn entirely different set of threats emerge when businesses choose to integrate LLM into their own systems or processes. These can be broadly categorized as follows:\nModel Related Threats\nA trained or tuned LLM has immense value to its developer and is thus subject to threats to its Confidentiality, Integrity and Availability.\nIn the latter case, the threats to proprietary models include:\nTheft of the model.\nAdversarial \"poisoning\" to negatively impact the accuracy of the model.\nDestruction or disruption of the model.\nLegal liability that may emerge from the model producing incorrect, misrepresentative, misleading, inappropriate or unlawful content.\nWe assess, however, that the most meaningful new threats will emerge from the increased attack surface when organizations implement GenAI within their technical environments.\nGenAI as Attack Surface\nGenAI are complex new technologies consisting of millions of lines of code that expand the attack surface and introduce new vulnerabilities.\nAs general GenAI tools like ChatGPT and Microsoft Copilot become widely available, they will no longer offer a significant competitive advantage by themselves. The true power of LLM technology lies in integrating it with a business's proprietary data or systems to improve customer services and internal processes. One key method is through interactive chat interfaces powered by GenAI, where users interact with a chatbot that generates coherent, context-aware responses.\nTo enhance this, the chat interface must leverage capabilities like Retrieval-Augmented Generation (RAG) and APIs. GenAI processes user queries, RAG retrieves relevant information from proprietary knowledge bases, and APIs connect the GenAI to backend systems. This combination allows the chatbot to provide contextually accurate outputs while interacting with complex backend systems.\nHowever, exposing GenAI as the security boundary between users and a corporation's backend systems, often directly to the Internet, introduces a significant new attack surface. Like the graphical Web Application interfaces that emerged in the 2000's to offer easy, intuitive access to business clients, such Chat Interfaces are likely to transform digital channels. Unlike graphical web interfaces, GenAI's non-deterministic nature means that even its developers may not fully understand its internal logic, creating enormous opportunity for vulnerabilities and exploitation. Attackers are already developing tools to exploit this opacity, leading to potential security challenges similar to those seen with early web applications, that are still plaguing security defenders today.\nTricking LLMs out of their 'guardrails'\nThe Open Web Application Security Project (OWASP) has identified \"Prompt Injection\" as the most critical vulnerability in GenAI applications. This attack manipulates language models by embedding specific instructions within user inputs to trigger unintended or harmful responses, potentially revealing confidential information or bypassing safeguards. Attackers craft inputs that override the model's standard behavior.\nTools and resources for discovering and exploiting prompt injection are quickly emerging, similar to the early days of web application hacking. We expect that Chat Interface hacking will remain a significant cybersecurity issue for years, given the complexity of LLMs and the digital infrastructure needed to connect chat interfaces with proprietary systems.\nAs these architectures grow, traditional security practices—such as secure development, architecture, data security, and Identity & Access Management—will become even more crucial to ensure proper authorization, access control, and privilege management in this evolving landscape.\nWhen the \"NSFW\" AI chatbot site Muah.ai was breached in October 2024, the hacker described the platform as \"a handful of open-source projects duct-taped together.\" Apparently, according to reports, \"it was no trouble at all to find a vulnerability that provided access to the platform's database\". We predict that such reports will become commonplace in the next few years.\nConclusion: more of the same is not a new dimension\nLike any powerful technology, we naturally fear the impact LLMs could have in the hands of our adversaries. Much attention is paid to the question of how AI might \"accelerate the threat. The uncertainty and anxiety that emerges from this apparent change in the threat landscape is of course exploited to argue for greater investment in security, sometimes honestly, but sometimes also duplicitously.\nHowever, while some things are certainly changing, many of the threats being highlighted by alarmists today pre-exist LLM technology and require nothing more of us than to keep consistently doing what we already know to do. For example, all the following threat actions, whilst perhaps enhanced by LLMs, have already been performed with the support of ML and other forms of AI\n[14]\n(or indeed, without AI at all):\nOnline Impersonation\nCheap, believable phishing mails and sites\nVoice fakes\nTranslation\nPredictive password cracking\nVulnerability discovery\nTechnical hacking\nThe notion that adversaries may execute such activities more often or more easily is a cause for concern, but it does not necessarily require a fundamental shift in our security practices and technologies.\nLLMs as an attack surface on the other hand are vastly underestimated. It is crucial that we learn the lessons of previous technology revolutions (like web applications and APIs) so as not to repeat them by recklessly adopting an untested and somewhat untestable technology at the boundary between open cyberspace and our critical internal assets. Enterprises are well advised to be extremely cautious and diligent in weighing up the potential benefits of deploying a GenAI as an interface, with the potential risks that such a complex, untested technology will surely introduce. Essentially we face at least the same access- and data safety issues we already know from the dawn of the cloud age and subsequent erosion of the classic company perimeter.\nDespite the ground-breaking innovations we're observing, security \"Risk\" is still comprised fundamentally from the product of Threat, Vulnerability and Impact, and an LLM cannot magically create these if they aren't already there. If those elements are already there, the risk a business has to deal with is largely independent of the existence of AI.\nThis is just an excerpt of the research we did on AI and LLMs. To read the full story and more detailed advisory, as well as expert stories about how prompt injections work to manipulate LLMs and work outside their safety guardrails, or how defenders use AI to detect subtle signals of compromise in vast networks: it's all in the Security Navigator 2025. Head over to the\ndownload page\nand get your copy!\n[1]\nhttps://www.zdnet.com/article/the-turing-test-has-a-problem-and-openais-gpt-4-5-just-exposed-it/\n[2]\nhttps://dspace.mit.edu/bitstream/handle/1721.1/147544/Mihretie-yosefmih-meng-eecs-2022-thesis.pdf?sequence=1\n[3]\nhttps://securityintelligence.com/deeplocker-how-ai-can-power-a-stealthy-new-breed-of-malware/\n[4]\nhttps://www.rsaconference.com/Library/presentation/USA/2019/the-rise-of-the-machines-ai-and-mlbased-attacks-demonstrated\n[5]\nhttps://securityaffairs.com/169253/malware/rhadamanthys-information-stealer-uses-ai.html\n[6]\nhttps://www.ft.com/content/b977e8d4-664c-4ae4-8a8e-eb93bdf785ea\n[7]\nhttps://www.upwork.com/research/ai-enhanced-work-models\n[8]\nhttps://www.theatlantic.com/technology/archive/2024/09/microsoft-ai-oil-contracts/679804/\n[9]\nhttps://www.microsoft.com/en-us/security/blog/2024/02/14/staying-ahead-of-threat-actors-in-the-age-of-ai\n[10]\nhttps://openai.com/index/disrupting-malicious-uses-of-ai-by-state-affiliated-threat-actors/\n[11]\nhttps://openai.com/global-affairs/an-update-on-disrupting-deceptive-uses-of-ai/\n[12]\nhttps://cloud.google.com/blog/topics/threat-intelligence/ai-powered-voice-spoofing-vishing-attacks/\n[13]\nhttps://arstechnica.com/science/2024/10/the-more-sophisticated-ai-models-get-the-more-likely-they-are-to-lie/\n[14]\nhttps://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/exploiting-ai-how-cybercriminals-misuse-abuse-ai-and-ml\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Critical Erlang/OTP SSH Vulnerability (CVSS 10.0) Allows Unauthenticated Code Execution",
        "Link": "https://thehackernews.com/2025/04/critical-erlangotp-ssh-vulnerability.html",
        "Summary": "A critical security vulnerability has been disclosed in the Erlang/Open Telecom Platform (OTP) SSH implementation that could permit an attacker to execute arbitrary code sans any authentication under certain conditions.\nThe vulnerability, tracked as CVE-2025-32433, has been given the maximum CVSS score of 10.0.\n\n\"The vulnerability allows an attacker with network access to an Erlang/OTP SSH",
        "Date": "2025-04-17",
        "Content": "A critical security vulnerability has been disclosed in the\nErlang/Open Telecom Platform (OTP)\nSSH implementation that could permit an attacker to execute arbitrary code sans any authentication under certain conditions.\nThe vulnerability, tracked as\nCVE-2025-32433\n, has been given the maximum CVSS score of 10.0.\n\"The vulnerability allows an attacker with network access to an Erlang/OTP SSH server to execute arbitrary code without prior authentication,\" Ruhr University Bochum researchers Fabian Bäumer, Marcus Brinkmann, Marcel Maehren, and Jörg Schwenk\nsaid\n.\nThe issue stems from improper handling of SSH protocol messages that essentially permit an attacker to send connection protocol messages prior to authentication. Successful exploitation of the shortcomings could result in arbitrary code execution in the context of the\nSSH daemon\n.\nFurther exacerbating the risk, if the daemon process is running as root, it enables the attacker to have full control of the device, in turn, paving the way for unauthorized access to and manipulation of sensitive data or denial-of-service (DoS).\nAll users running an SSH server based on the Erlang/OTP SSH library are likely affected by CVE-2025-32433. It's recommended to\nupdate\nto versions OTP-27.3.3, OTP-26.2.5.11, and OTP-25.3.2.20. As temporary workarounds, access to vulnerable SSH servers can be prevented using appropriate firewall rules.\nIn a statement shared with The Hacker News, Mayuresh Dani, manager of security research at Qualys, described the vulnerability as extremely critical and that it can allow a threat actor to perform actions such as installing ransomware or siphoning off sensitive data.\n\"Erlang is frequently found installed on high-availability systems due to its robust and concurrent processing support,\" Dani said. \"A majority of Cisco and Ericsson devices run Erlang.\"\n\"Any service using Erlang/OTP's SSH library for remote access such as those used in OT/IoT devices, edge computing devices are susceptible to exploitation. Upgrading to the fixed Erlang/OTP or vendor-supported versions will remediate the vulnerability. Should organizations need more time to install upgrades, they should restrict SSH port access to authorized users alone.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Blockchain Offers Security Benefits – But Don't Neglect Your Passwords",
        "Link": "https://thehackernews.com/2025/04/blockchain-offers-security-benefits-but.html",
        "Summary": "Blockchain is best known for its use in cryptocurrencies like Bitcoin, but it also holds significant applications for online authentication. As businesses in varying sectors increasingly embrace blockchain-based security tools, could the technology one day replace passwords?\nHow blockchain works&nbsp;\nBlockchain is a secure way to maintain, encrypt, and exchange digital records of transactions.",
        "Date": "2025-04-17",
        "Content": "Blockchain is best known for its use in cryptocurrencies like Bitcoin, but it also holds significant applications for online authentication. As businesses in varying sectors increasingly embrace blockchain-based security tools, could the technology one day replace passwords?\nHow blockchain works\nBlockchain is a secure way to maintain, encrypt, and exchange digital records of transactions. Its security benefits stem from its decentralized nature: this\ndistributed ledger can be accessed by participants across various nodes\n, and is unalterable. All users retain control as a group, meaning no single person can change the ledger.\nHow could this provide security benefits? One advantage is the ability\nto create a 'self-sovereign ID'\nthat alters the way that a user identifies themselves online. Essentially,\nit creates a private ID for a user that they control, rather than relying on a centralized institution\n: they can logon to a particular website or service using their identity on the blockchain.\nThese identities utilize cryptographic keys, rather than passwords: your private key would be used to authenticate you\nthrough verification with a corresponding public key\n. It could be further bolstered by two-factor authentication (2FA) or multi-factor authentication (MFA): for example, when logging onto your bank account.\nKey advantages\nIt's easy to see how this could bring significant security advantages. We all know the dangers inherent in passwords, from phishing to simple user error:\nreusing the same, easy-to-guess password\n, for instance. With a blockchain-based authentication system, it should be possible to significantly reduce the risk of data breaches, because the decentralized nature of the technology simply removes the centralized databases that are key targets for such attacks.\nWhat advantages is this providing in the real world? There are numerous examples. For example, R3 Corda is a distributed ledger technology designed for financial services, enabling\nthe secure exchange of data and value between parties\n. Such technology\ncould be used in such areas as Know Your Customer (KYC)\nin finance, enabling banks and other operators to verify someone's identity without putting their privacy at risk.\nIn healthcare, it is being used to prevent unauthorized access to medical records and to enable the secure sharing of patient data.\nInfosys BPM reckons that the blockchain tech market in healthcare could exceed $215 billion by the end of 2036\n.\nChallenges ahead\nLike any rapidly developing technology, blockchain poses challenges in the security space and beyond. Let's look at a few.\nCost\n: Blockchain can be pricey,\nconsuming large amounts of energy and computing power to validate transactions\n. The United Nations University found in 2023 that if Bitcoin was a country,\nit would consume more energy than Pakistan.\nUnfamiliar technology\n: Despite the growing prevalence of Bitcoin and the like, most people – and organizations – still have little idea of how blockchain actually functions. This could slow down the adoption of the technology.\nLegal and regulatory issues:\nDigital identities are a tricky area, with different jurisdictions and countries holding varying standards. That could make it difficult to build global traction.\nStorage requirements and scalability:\nBlockchains require storage, a challenge that could grow as the technology is utilized more widely. It is vital to\nfocus on the scalability of the solution\n, ensuring that it delivers the speed required.\nInteroperability challenges:\nWithout international standards, it's unclear how interoperability would be achieved. It's vital that identities can be verified across different devices, sectors and even international borders.\nThe future of passwords\nThat's not to downplay the potential of blockchain as a security tool. With its decentralized nature and use of cryptography and private and public keys, it provides huge advantages. Even challenges around power consumption, cost and regulations could be addressed as the technology expands in use.\nHowever, while no-one can predict the future, it seems highly unlikely that passwords will vanish anytime soon. Passwords offer key advantages that provide them with an enduring appeal: they're simple and universal; they're flexible as they can easily be reset; and despite the risk of hacks and breaches, they remain effective, simply because they're either right or wrong.\nProtect both the logon and the password\nYes, they can be vulnerable. Ideally, users they will opt for multi-factor authentication, combining passwords with other security measures – this could include blockchain-based methods. Protecting both the logon with\neffective MFA such as Specops Secure Access\nworks best in combination with strong password security.\nAs long as passwords remain in use, organizations need to ensure their active directories are free of weak or compromised passwords.\nSpecops Password Policy\nmakes it easy to enforce a strong password policy, while also scanning your active directory for breached or compromised examples. It currently blocks more than 4 billion compromised passwords –and the list is always growing.\nThe reality is that individuals and organizations continue to rely on passwords for security online. This fact – combined with the challenges around adopting new technologies like blockchain – mean organizations simply cannot afford to neglect password security, at least for the foreseeable future. Interested in better protection around passwords and end user logons?\nGet in touch to learn more\n.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Node.js Malware Campaign Targets Crypto Users with Fake Binance and TradingView Installers",
        "Link": "https://thehackernews.com/2025/04/nodejs-malware-campaign-targets-crypto.html",
        "Summary": "Microsoft is calling attention to an ongoing malvertising campaign that makes use of Node.js to deliver malicious payloads capable of information theft and data exfiltration.\nThe activity, first detected in October 2024, uses lures related to cryptocurrency trading to trick users into installing a rogue installer from fraudulent websites that masquerade as legitimate software like Binance or",
        "Date": "2025-04-17",
        "Content": "Microsoft is calling attention to an ongoing malvertising campaign that makes use of Node.js to deliver malicious payloads capable of information theft and data exfiltration.\nThe activity,\nfirst detected\nin October 2024, uses lures related to cryptocurrency trading to trick users into installing a rogue installer from fraudulent websites that masquerade as legitimate software like Binance or TradingView.\nThe downloaded installer comes embedded with a dynamic-link library (\"CustomActions.dll\") that's responsible for harvesting basic system information using Windows Management Instrumentation (WMI) and setting up persistence on the host via a scheduled task.\nIn an attempt to keep up the ruse, the DLL launches a browser window via \"\nmsedge_proxy.exe\n\" that displays the legitimate cryptocurrency trading website. It's worth noting that \"msedge_proxy.exe\" can be used to display any website as a web application.\nThe scheduled task, in the meanwhile, is configured to run PowerShell commands to download from a remote server additional scripts, which take care of excluding the running PowerShell process as well as the current directory from being scanned by Microsoft Defender for Endpoint as a way to sidestep detection.\nOnce the exclusions are set, an obfuscated PowerShell command is run to fetch and run scripts from remote URLs that are capable of gathering extensive information related to the operation system, BIOS, hardware, and installed applications.\nAll the captured data is converted into JSON format and sent to the command-and-control (C2) server using an HTTPS POST request.\nThe attack chain then proceeds to the next phase where another PowerShell script is launched to download an archive file from the C2 that contains the Node.js runtime binary and a JavaScript compiled (JSC) file. The Node.js executable kick-starts the execution of the JSC file, which goes to establish network connections and likely siphon sensitive browser information.\nIn an alternate infection sequence observed by Microsoft, the\nClickFix\nstrategy has been employed to enable inline JavaScript execution, using a malicious PowerShell command to download the Node.js binary and use it to run JavaScript code directly, instead of from a file.\nThe inline JavaScript carries out network discovery activities to identify high-value assets, disguises the C2 traffic as legitimate Cloudflare activity to fly under the radar, and gains persistence by modifying Windows Registry run keys.\n\"Node.js is an open-source, cross-platform JavaScript runtime environment that allows JavaScript code to run outside of a web browser,\" the tech giant said. \"It's widely used and trusted by developers because it lets them build frontend and backend applications.\"\n\"However, threat actors are also leveraging these Node.js characteristics to try to blend malware with legitimate applications, bypass conventional security controls, and persist in target environments.\"\nThe disclosure comes as CloudSEK revealed that a fake PDF-to-DOCX converter site impersonating PDF Candy (candyxpdf[.]com or candyconverterpdf[.]com) has been found leveraging the ClickFix social engineering trick to coax victims into running encoded PowerShell commands that ultimately deploy SectopRAT (aka ArechClient2) malware.\n\"The threat actors meticulously replicated the user interface of the genuine platform and registered similar-looking domain names to deceive users,\" security researcher Varun Ajmera\nsaid\nin a report published this week.\n\"The attack vector involves tricking victims into executing a PowerShell command that installs Arechclient2 malware, a variant of the dangerous SectopRAT information stealer family known for harvesting sensitive data from compromised systems.\"\nPhishing campaigns have also been\nobserved\nusing a PHP-based kit to target companies' employees with human resources (HR)-themed scams to gain unauthorized access to payroll portals and change victims' bank account information to redirect funds to an account under the threat actor's control.\nSome of these\nactivities\nhave been attributed to a hacking group called\nPayroll Pirates\n, with the attackers utilizing malicious search advertising campaigns with sponsored phishing websites and spoofed HR pages via Google to lure unsuspecting victims into providing their credentials and two-factor authentication (2FA) codes.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "CISA Flags Actively Exploited Vulnerability in SonicWall SMA Devices",
        "Link": "https://thehackernews.com/2025/04/cisa-flags-actively-exploited.html",
        "Summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday added a security flaw impacting SonicWall Secure Mobile Access (SMA) 100 Series gateways to its Known Exploited Vulnerabilities (KEV) catalog, based on evidence of active exploitation.\nThe high-severity vulnerability, tracked as CVE-2021-20035 (CVSS score: 7.2), relates to a case of operating system command injection",
        "Date": "2025-04-17",
        "Content": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday\nadded\na security flaw impacting SonicWall Secure Mobile Access (\nSMA\n) 100 Series gateways to its Known Exploited Vulnerabilities (\nKEV\n) catalog, based on evidence of active exploitation.\nThe high-severity vulnerability, tracked as CVE-2021-20035 (CVSS score: 7.2), relates to a case of operating system command injection that could result in code execution.\n\"Improper neutralization of special elements in the SMA100 management interface allows a remote authenticated attacker to inject arbitrary commands as a 'nobody' user, which could potentially lead to code execution,\" SonicWall\nsaid\nin an advisory released in September 2021.\nThe flaw\nimpacts\nSMA 200, SMA 210, SMA 400, SMA 410, and SMA 500v (ESX, KVM, AWS, Azure) devices running the following versions -\n10.2.1.0-17sv and earlier (Fixed in 10.2.1.1-19sv and higher)\n10.2.0.7-34sv and earlier (Fixed in 10.2.0.8-37sv and higher)\n9.0.0.10-28sv and earlier (Fixed in 9.0.0.11-31sv and higher)\nWhile the exact details surrounding the exploitation of CVE-2021-20035 are presently unknown, SonicWall has since revised the bulletin to acknowledge that \"this vulnerability is potentially being exploited in the wild.\"\nFederal Civilian Executive Branch (FCEB) agencies are required to apply the necessary mitigations by May 7, 2025, to secure their networks against active threats.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Apple Patches Two Actively Exploited iOS Flaws Used in Sophisticated Targeted Attacks",
        "Link": "https://thehackernews.com/2025/04/apple-patches-two-actively-exploited.html",
        "Summary": "Apple on Wednesday released security updates for iOS, iPadOS, macOS Sequoia, tvOS, and visionOS to address two security flaws that it said have come under active exploitation in the wild.\nThe vulnerabilities in question are listed below -\n\nCVE-2025-31200 (CVSS score: 7.5) - A memory corruption vulnerability in the Core Audio framework that could allow code execution when processing an audio",
        "Date": "2025-04-17",
        "Content": "Apple on Wednesday\nreleased\nsecurity updates for iOS, iPadOS, macOS Sequoia, tvOS, and visionOS to address two security flaws that it said have come under active exploitation in the wild.\nThe vulnerabilities in question are listed below -\nCVE-2025-31200\n(CVSS score: 7.5) - A memory corruption vulnerability in the\nCore Audio\nframework that could allow code execution when processing an audio stream in a maliciously crafted media file\nCVE-2025-31201\n(CVSS score: 6.8) - A vulnerability in the RPAC component that could be used by an attacker with arbitrary read and write capability to bypass\nPointer Authentication\nThe iPhone maker said it addressed CVE-2025-31200 with improved bounds checking and CVE-2025-31201 by removing the vulnerable section of code.\nBoth the vulnerabilities have been credited to Apple, along with Google Threat Analysis Group (TAG) for reporting CVE-2025-31200.\nApple, as is typically the case with such advisories, said it's aware that the issues have been \"exploited in an extremely sophisticated attack against specific targeted individuals on iOS.\"\nWith the latest development, Apple has addressed a total of five actively exploited zero-days in its software since the start of the year -\nCVE-2025-24085\n(CVSS score: 7.8) - A use-after-free bug in the Core Media component that could permit a malicious application already installed on a device to elevate privileges\nCVE-2025-24200\n(CVSS score: 4.6) - An authorization issue in the Accessibility component that could enable an attacker to disable USB Restricted Mode on a locked device as part of a cyber-physical attack\nCVE-2025-24201\n(CVSS score: 7.1) - An out-of-bounds write issue in the WebKit component that could be exploited to break out of the Web Content sandbox using maliciously crafted web content\nThe updates are available for the following devices and operating systems -\niOS 18.4.1 and iPadOS 18.4.1\n- iPhone XS and later, iPad Pro 13-inch, iPad Pro 13.9-inch 3rd generation and later, iPad Pro 11-inch 1st generation and later, iPad Air 3rd generation and later, iPad 7th generation and later, and iPad mini 5th generation and later\nmacOS Sequoia 15.4.1\n- Macs running macOS Sequoia\ntvOS 18.4.1\n- Apple TV HD and Apple TV 4K (all models)\nvisionOS 2.4.1\n- Apple Vision Pro\nIn light of active exploitation, users are advised to update their devices to the latest version to safeguard against risks.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Critical Erlang/OTP SSH pre-auth RCE is 'Surprisingly Easy' to exploit, patch now",
        "Link": "https://www.bleepingcomputer.com/news/security/critical-erlang-otp-ssh-pre-auth-rce-is-surprisingly-easy-to-exploit-patch-now/",
        "Summary": "A critical vulnerability in the Erlang/OTP SSH, tracked as CVE-2025-32433, has been disclosed that allows for unauthenticated remote code execution on vulnerable devices. [...]",
        "Date": "2025-04-17",
        "Content": "A critical vulnerability in the Erlang/OTP SSH, tracked as CVE-2025-32433, has been disclosed that allows for unauthenticated remote code execution on vulnerable devices.\nThe flaw was discovered by Fabian Bäumer, Marcus Brinkmann, Marcel Maehren, and Jörg Schwenk of the Ruhr University Bochum in Germany and given a maximum severity score of 10.0.\nAll devices running the Erlang/OTP SSH daemon are impacted by the vulnerability and are advised to upgrade to versions 25.3.2.10 and 26.2.4 to fix the flaw.\nErlang is a programming language known for its fault-tolerance and concurrency, making it commonly used in telecom infrastructure and high -availability systems. Erlang/OTP is a set of libraries, design principles, and tools built on top of Erlang that provides components like the SSH application for remote access.\nThe CVE-2025-32433 vulnerability is caused by the improper handling of certain pre-authentication protocol messages within the SSH daemon provided by Erlang/OTP's SSH application.\n\"The issue is caused by a flaw in the SSH protocol message handling which allows an attacker to send connection protocol messages prior to authentication,\" reads\na disclosure\non the OpenWall vulnerability mailing list.\nAny commands executed through the vulnerability will be run with the same privileges as the SSH daemon. In many cases, the daemon runs as root, which would allow attackers to fully compromise the system.\nHorizon3's Attack Team, known for their exploit research, warned on X that they had reproduced the flaw and found it \"surprisingly easy,\" demonstrating a PoC that writes a file as root on affected systems.\n\"Just finished reproducing CVE-2025-32433 and putting together a quick PoC exploit — surprisingly easy. Wouldn't be shocked if public PoCs start dropping soon. If you're tracking this, now's the time to take action,\"\nHorizon3 posted to X\n.\nOrganizations are strongly advised to upgrade to the fixed versions immediately before a PoC becomes public and the flaw is mass-exploited.\nFor systems, such as industrial or mission-critical devices that can't be easily updated, it is advised that access to SSH be restricted to trusted IPs, or the SSH daemon should be turned off if not needed.\nRelated Articles:\nCentreStack RCE exploited as zero-day to breach file sharing servers\nWhatsApp flaw can let attackers run malicious code on Windows PCs\nMax severity RCE flaw discovered in widely used Apache Parquet\nThe 4 WordPress flaws hackers targeted the most in Q1 2025\nVeeam RCE bug lets domain users hack backup servers, patch now"
    },
    {
        "Title": "Entertainment services giant Legends International discloses data breach",
        "Link": "https://www.bleepingcomputer.com/news/security/entertainment-services-giant-legends-international-discloses-data-breach/",
        "Summary": "Entertainment venue management firm Legends International warns it suffered a data breach in November 2024, which has impacted employees and people who visited venues under its management. [...]",
        "Date": "2025-04-17",
        "Content": "Entertainment venue management firm Legends International warns it suffered a data breach in November 2024, which has impacted employees and people who visited venues under its management.\nIn a notification letter shared with the authorities, the company informs that it detected unauthorized activity in its IT systems on November 9, 2024, prompting an investigation carried out with the help of external cybersecurity experts.\nThe investigation results confirmed that the intruders had exfiltrated personal data files, though the exposed data types aren’t determined in the sample letter.\nLegends International is a global sports and entertainment services company offering venue planning, sales, partnerships, hospitality, merchandise, and technology solutions, with an annual revenue of over $1.1 billion.\nIt manages over 350 venues across five continents, including the SoFi Stadium in Los Angeles, One World Observatory in New York, the AT&T Stadium in Texas, the Santiago Bernabeu and Camp Nou stadiums in Spain, and the Anfield and OVO Arena Wembley in the UK.\nRecently, the company expanded its operations by\nacquiring ASM Global\n, a leading venue management company with a worldwide footprint.\nThe scope of the data breach and the number of exposed individuals remains unknown. However, given the size of the company’s operations and the large amounts of sensitive data it manages, there’s ground for concern.\nBleepingComputer has contacted the company to ask for more details, but a comment wasn’t immediately available.\nIn the\nletter sent to impacted individuals\n, Legends International says security measures were already in place before the incident, and it implemented additional measures when the systems were restored from the cyberattack. However, no specific details about either were given.\nLetter recipients are offered 24-month coverage for identity theft detection services through Experian and are given until July 31, 2025, to enroll.\nLegends International states in the letter that they are not aware of any evidence that personal information has been misused as a result of this incident, but people are advised to remain vigilant.\nAt the time of writing this, no ransomware groups have taken responsibility for the attack at Legends International, so the type of the attack and the perpetrators remain unknown.\nRelated Articles:\nData breach at Japanese telecom giant NTT hits 18,000 companies\nUS drug testing firm DISA says data breach impacts 3.3 million people\nFintech giant Finastra notifies victims of October data breach\nAhold Delhaize confirms data theft after INC ransomware claims attack\nLandmark Admin data breach impact now reaches 1.6 million people"
    },
    {
        "Title": "Windows NTLM hash leak flaw exploited in phishing attacks on governments",
        "Link": "https://www.bleepingcomputer.com/news/security/windows-ntlm-hash-leak-flaw-exploited-in-phishing-attacks-on-governments/",
        "Summary": "A Windows vulnerability that exposes NTLM hashes using .library-ms files is now actively exploited by hackers in phishing campaigns targeting government entities and private companies. [...]",
        "Date": "2025-04-17",
        "Content": "A Windows vulnerability that exposes NTLM hashes using .library-ms files is now actively exploited by hackers in phishing campaigns targeting government entities and private companies.\nThe flaw tracked as\nCVE-2025-24054\nwas fixed in Microsoft's\nMarch 2025 Patch Tuesday\n. Initially, it was not marked as actively exploited and was assessed as 'less likely' to be.\nHowever, Check Point researchers report having observed active exploitation activity for CVE-2025-24054 only a few days after patches became available, culminating between March 20 and 25, 2025.\nAlthough one IP address behind these attacks was previously linked to the Russia state-sponsored threat group APT28 ('Fancy Bear'), it is not enough evidence for confident attribution.\nExposing NTLM hashes\nNTLM (New Technology LAN Manager) is a Microsoft authentication protocol that uses challenge-response negotiation involving hashes instead of transmitting plaintext passwords to authenticate users.\nWhile NTLM avoids transmitting plaintext passwords, it is no longer considered secure due to vulnerabilities like\nreplay attacks\nand\nbrute-force cracking of captured hashes\n.\nDue to this, Microsoft has\nbegun phasing out NTLM authentication\nin favor of Kerberos or Negotiate.\nIn attacks seen by Check Point, phishing emails were sent to entities in Poland and Romania that included a Dropbox link to a ZIP archive, containing a .library-ms file.\nPhishing email attaching the exploit file (unzipped)\nSource: Check Point\nA library-ms file is a legitimate file type that, when opened, shows a\nWindows library\n, or virtual container, that contains files and folders from different configured sources.\nIn this phishing attack, the library-ms file was created to contain a path to a remote SMB server under the attacker's control.\nMalicious .library-ms file\nSource: Check Point\nWhen extracting a ZIP file that contains a .library-ms file, Windows Explorer will interact with it automatically, triggering the CVE-2025-24054 flaw and causing Windows to make an SMB connection to the URL specified in the file.\nWhen Windows connects to the remote SMB server, it will attempt to authenticate via NTLM, allowing the attacker to capture the user's NTLM hashes.\nIn a later campaign, Check Point discovered phishing emails that contained .library-ms attachments, without an archive. Simply downloading the .library-ms file was enough to trigger NTLM authentication to the remote server, demonstrating that archives were not required to exploit the flaw.\n\"On March 25, 2025, Check Point Research discovered a campaign targeting companies around the world, distributing these files without being zipped,\"\nexplains Check Point\n.\n\"According to Microsoft, this exploit is triggered with minimal user interaction with a malicious file, such as selecting (single-clicking), inspecting (right-clicking), or performing any action other than opening or executing the file.\"\nThe malicious archive also contains three more files, namely 'xd.url,' 'xd.website,' and 'xd.link,' which leverage older NTLM hash leak flaws and are most likely included for redundancy in case the 'library-ms' method fails.\nCheck Point says the attacker-controlled SMB servers in this campaign were using the 159.196.128[.]120 and 194.127.179[.]157 IP addresses.\nCapturing NTLM hashes could open the way to authentication bypass and privilege escalation, so even though CVE-2025-24054 is only evaluated as a \"medium\" severity issue, its potential consequences are grave.\nGiven the low interaction required to exploit, organizations should treat this as a high-risk issue. It is advised that all organizations should install the March 2025 updates and turn off NTLM authentication if it is not required.\nRelated Articles:\nNew Mirai botnet behind surge in TVT DVR exploitation\nNew Windows zero-day exploited by 11 state hacking groups since 2017\nCritical PHP RCE vulnerability mass exploited in new attacks\nHackers exploit WordPress plugin auth bypass hours after disclosure\nMicrosoft April 2025 Patch Tuesday fixes exploited zero-day, 134 flaws"
    },
    {
        "Title": "Chrome extensions with 6 million installs have hidden tracking code",
        "Link": "https://www.bleepingcomputer.com/news/security/chrome-extensions-with-6-million-installs-have-hidden-tracking-code/",
        "Summary": "A set of 57 Chrome extensions with 6,000,000 users have been discovered with very risky capabilities, such as monitoring browsing behavior, accessing cookies for domains, and potentially executing remote scripts. [...]",
        "Date": "2025-04-17",
        "Content": "A set of 57 Chrome extensions with 6,000,000 users have been discovered with very risky capabilities, such as monitoring browsing behavior, accessing cookies for domains, and potentially executing remote scripts.\nThese extensions are 'hidden,' meaning they don't show up on Chrome Web Store searches, nor do search engines index them, and can only be installed if the user has the direct URL.\nTypically, such extensions are private software like internal company tools or add-ons still under development. Still, threat actors might be using them to evade detection while aggressively pushing them through ads and malicious sites.\nRisky Chrome extensions\nThe extensions were discovered by Secure Annex researcher John Tuckner, who uncovered the first 35 after examining what he claims is a suspicious extension named 'Fire Shield Extension Protection.'\nThe extension is heavily obfuscated and contains callbacks to an API for sending information collected from the browser.\nTracking function in Fire Shield extension\nSource: Secure Annex\nThrough a domain called \"unknow.com\" contained in the extension, Tuckner found additional extensions containing the same domain that claim to provide ad-blocking or privacy protection services.\nFinding more extensions phoning the same external domain\nSource: Secure Annex\nHowever, all of these include overly broad permissions allowing them to perform the following actions:\nAccess cookies, including sensitive headers (e.g., 'Authorization')\nMonitor user browsing behavior\nModify search providers (and results)\nInject and execute remote scripts on visited pages via iframes\nActivate advanced tracking remotely\nWhile Tuckner didn't catch any extensions stealing user passwords or cookies, the excessively risky capabilities, heavily obfuscated code, and hidden logic were enough for the researcher to label them as risky and, potentially, spyware.\n\"There are additional obfuscated signals in other functions that there is significant command and control potential like the ability to list top sites visited, open/close tabs, get top sites visited, and run many of the capabilities above in an ad hoc manner,\"\nexplains Tuckner\n.\n\"Many of these capabilities have not been validated, but again, the presence of this capability in 35 extensions which claim to do simple things like protect you from malicious extensions is quite concerning.\"\nExcessive permissions secured by the extensions\nSource: Secure Annex\nEarlier today, the researcher\nadded 22 more extensions\nbelieved to belong to the same operation, taking the total to 57 extensions used by 6 million people. Some of the newly added extensions are public, too.\nTuckner says that many of the extensions have been removed from the Chrome Web Store following his report from last week, but others still remain.\nOne of the risky extensions still hosted on the Web Store\nSource: BleepingComputer\nThe complete list is\navailable here\n, with the ones with the highest download counts listed below:\nCuponomia – Coupon and Cashback\n(700,000 users, public)\nFire Shield Extension Protection\n(300,000 users, unlisted)\nTotal Safety for Chrome™\n(300,000 users, unlisted)\nProtecto for Chrome™\n(200,000 users, unlisted)\nBrowser WatchDog for Chrome\n(200,000 users, public)\nSecurify for Chrome™\n(200,000 users, unlisted)\nBrowser Checkup for Chrome by Doctor\n(200,000 users, public)\nChoose Your Chrome Tools\n(200,000 users, unlisted)\nIf you have any of the above installed, it is recommended that you remove them immediately and, out of an abundance of caution, perform password resets on online accounts.\nGoogle told BleepingComputer that they are aware of Tuckner's report and are investigating the extensions.\nBleepingComputer also contacted the developer of these extensions with questions about the obfucated code but has not received a reply at this time.\nRelated Articles:\nChrome 136 fixes 20-year browser history privacy risk\nMalicious Chrome extensions can spoof password managers in new attack\nGoogle fixes Chrome zero-day exploited in espionage campaign\n23andMe files for bankruptcy, customers advised to delete DNA data\nWhatsApp patched zero-click flaw exploited in Paragon spyware attacks"
    },
    {
        "Title": "Ahold Delhaize confirms data theft after INC ransomware claims attack",
        "Link": "https://www.bleepingcomputer.com/news/security/ahold-delhaize-confirms-data-theft-after-inc-ransomware-claims-attack/",
        "Summary": "Food retail giant Ahold Delhaize confirms that data was stolen from its U.S. business systems during a November 2024 cyberattack. [...]",
        "Date": "2025-04-17",
        "Content": "Food retail giant Ahold Delhaize confirms that data was stolen from its U.S. business systems during a November 2024 cyberattack.\n\"Based on our investigation to date, certain files were taken from some of our internal U.S. business systems,\" a spokesperson confirmed to BleepingComputer.\n\"Since the incident was detected, our teams have been working diligently to determine what information may have been affected.\"\nAhold Delhaize is a multinational retail and wholesale company that operates nearly 8,000 stores across Europe and the United States, employing over 410,000 people.\nThe company has reported yearly revenues of approximately $100 billion, and in the American market, it operates under brands such as Food Lion, Stop & Shop, Giant Food, and Hannaford.\nOn November 8, 2024, Ahold Delhaize issued a public statement disclosing a cybersecurity incident that forced it to take IT systems offline for protection.\n\"This issue and subsequent mitigating actions have affected certain Ahold Delhaize USA brands and services including a number of pharmacies and certain e-commerce operations,\"\nstated Ahold Delhaize at the time\n.\nYesterday, the ransomware group INC Ransom added Ahold Delhaize to its data leak extortion site on the dark web, which included samples of documents they allegedly stole from the company.\nINC Ransom extortion portal\nSource: BleepingComputer\nResponding to our request for a comment on this development, a spokesperson for the firm confirmed that there had been a data breach but didn't comment on whether ransomware was involved in the attack.\nAhold Delhaize noted that the investigation into the incident remains ongoing, and if customer data is confirmed to have been impacted, those persons will be notified accordingly.\n\"If we determine that personal data was impacted, we will notify affected individuals as appropriate. In addition, we have notified and updated law enforcement,\" stated Ahold Delhaize.\nMeanwhile, the spokesperson confirmed that all their stores and e-commerce services remain open and operational, so customers shouldn't face problems.\nINC Ransom has focused its attacks on U.S.-based organizations lately, with a member tracked by Microsoft as '\nVanilla Tempest\n' targeting U.S. healthcare providers.\nMost recently, INC Ransom took responsibility for an attack at the\nState Bar of Texas\nthat warned its 100,000 members that hackers had stolen their sensitive data.\nRelated Articles:\nTexas State Bar warns of data breach after INC ransomware claims attack\nFood giant WK Kellogg discloses data breach linked to Clop ransomware\nPort of Seattle says ransomware breach impacts 90,000 people\nHunters International shifts from ransomware to pure data extortion\nRedCurl cyberspies create ransomware to encrypt Hyper-V servers"
    },
    {
        "Title": "CTM360 Tracks Global Surge in SMS-Based Reward and Toll Scams",
        "Link": "https://www.bleepingcomputer.com/news/security/ctm360-tracks-global-surge-in-sms-based-reward-and-toll-scams/",
        "Summary": "Thousands tricked by fake reward & toll scam texts. CTM360 exposes PointyPhish & TollShark—SMS phishing campaigns powered by the Darcula PhaaS platform, with 5K+ domains stealing payment info worldwide. [...]",
        "Date": "2025-04-17",
        "Content": "CTM360\nhas observed a notable surge in two SMS-based phishing campaigns: PointyPhish (reward scams) and TollShark (toll payment scams).\nPointyPhish is linked to over 3,000 domains and phishing sites, preying on urgency by claiming expiring reward points to trick customers into fraudulent sites that steal payment details\nSimilarly, TollShark involves over 2,000 domains and phishing sites, exploiting fears of unpaid tolls to capture sensitive information from unsuspecting individuals.\nCTM360 detected thousands of these phishing sites across multiple countries, indicating that this isn’t just a localized issue — it’s a coordinated, global effort. The widespread nature of these attacks shows a clear intent to target individuals at scale, with the goal of stealing sensitive financial data.\nThe impact is far-reaching, affecting not just one region but thousands of customers of various brands worldwide.\nAt the core of these campaigns is Darcula Suite, a powerful Phishing-as-a-Service (PhaaS) platform. Built on React and Docker, Darcula enables cybercriminals to launch phishing sites in under 10 minutes.\nIt supports multi-channel SMS delivery (including iMessage and RCS), making the websites harder to detect and easier to scale globally.\nTwo Different Campaigns, One Common Tactic\nPointyPhish –\nSends fake SMS alerts about expiring reward points to banking, airline, and retail store customers, leading to phishing pages that steal full credit/debit card details.\nTollShark –\nPoses as road toll authorities, warning of unpaid bills and fines. Victims are directed to fake payment pages that collect personal and financial data.\nBoth attacks are simple in structure: they begin with SMS distribution, create urgency, impersonate a trusted brand, and lead customers into giving up payment details.\nRead our new PlayPraetor report to explore behaviors, detection insights\nCTM360 has now identified a much larger extent of the ongoing PlayPraetor campaign.\nWhat started with 6,000+ URLs linked to a specific banking attack has now grown to 16,000+ impersonation sites across multiple malware variants. This research is ongoing, with further discoveries expected in the coming days.\nRead the Report\nHow It Works – Step by Step\nCTM360’s threat analysts mapped out the entire attack lifecycle using the CTM360 Scam Navigator and analyzed each step in detail.\nSMS distribution:\nMessages create urgency, either a toll is unpaid, or points are about to expire.\nFake landing pages:\nVictims are redirected to phishing sites mimicking real brands.\nEngagement & bait:\nVictims are asked to redeem points or pay tolls to avoid penalties.\nData collection:\nPersonal data is harvested under the guise of verification.\nPayment data theft:\nVictims are tricked into entering card info, which is logged instantly.\nInside Darcula: A Glimpse Into PhaaS\nDarcula isn’t just a phishing kit — it’s a full PhaaS platform for scams. While tracking these campaigns, CTM360 uncovered an exposed admin panel used by attackers managing Darcula Suite.\nThis offers a rare window into how these phishing operations are run:\nCentralized campaign management:\nMultiple attacker accounts running parallel campaigns.\nLive victim logging:\nIP addresses, device info, user agents, and form data are captured in real-time.\nSubscription-based access:\nAttackers operate on a tiered model with account-based controls.\nSMS configuration tools:\nBuilt-in tools to manage target regions and message templates.\nRead the full PointyPhish & TollShark Report\nFor a deeper look into the campaigns. including screenshots, domain samples and insights into how the scams are structured and operate on a global scale, read the full report at\nhttps://www.ctm360.com/reports/pointyphish-tollshark\n.\nSponsored and written by\nCTM360\n."
    },
    {
        "Title": "Microsoft: Office 2016 and Office 2019 reach end of support in October",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-office-2016-and-office-2019-reach-end-of-support-in-october/",
        "Summary": "​​Microsoft has reminded customers that Office 2016 and Office 2019 will reach the end of extended support six months from now, on October 14, 2025. [...]",
        "Date": "2025-04-17",
        "Content": "​​Microsoft has reminded customers that Office 2016 and Office 2019 will reach the end of extended support six months from now, on October 14, 2025.\nOffice 2019 reached the end of mainstream support\nin October 2023\n, while Office 2016 reached its end date three years earlier,\nin October 2020\n.\n\"After that date, no further updates, security fixes, or technical support will be available for these versions of Office,\" the company\nsaid\nin a Microsoft 365 Admin Center update.\n\"While the applications may continue to function, using unsupported software could lead to potential security risks, compliance risks, system incompatibilities, and other issues.\nRedmond also warned that Visio 2016 and 2019, Microsoft Project 2016 and 2019, and several other products will also reach the end of support on October 14, 2025, and advised organizations to upgrade as soon as possible to avoid security, compliance, and performance issues.\nTo mitigate the risks associated with using unsupported desktop Office apps, Redmond recommends upgrading devices to a Microsoft 365 or Office 365 suite, which provides access to Microsoft 365 Apps.\n\"Microsoft 365 Apps provides always-up-to-date versions of familiar apps like Word, Excel, and PowerPoint for desktop, mobile, and web with continuous support under the Modern Lifecycle Policy, and is eligible for use with the Microsoft 365 Copilot add-on,\" Microsoft added.\nRedmond's support website provides\ndetailed upgrade guidance\non migrating from older versions of Office to Microsoft 365 Apps.\nOffice 2024 or Office LTSC 2024 migration\nYou can also switch to Office 2024, a standalone Office version\nreleased in October 2024\nfor small businesses and consumers without a Microsoft 365 subscription. This version\nincludes locked-in-time versions of Word, Excel, PowerPoint, OneNote, and Outlook for Windows and macOS systems.\nMicrosoft also rolled out Office LTSC (Long Term Servicing Channel) 2024\nin September 2024\n, a volume-licensed perpetual Windows and macOS version of Office for commercial and government customers.\nHowever, it's important to note that Office LTSC 2024 is designed for devices without internet connectivity that require long-term support, such as specialty systems like medical equipment.\nMicrosoft will provide four more years of support for\nOffice 2024\nand\nOffice LTSC 2024\n, until October 9, 2029.\nEarlier this week, Redmond also reminded IT admins that Exchange 2016 and Exchange 2019\nwill also reach the end of support\nsix months from now, on October 14, 2025. The company also shared guidance for global admins on the\nExchange Online\nand\nMicrosoft 365\nmigration paths.\nRelated Articles:\nMicrosoft Office 2019 Will Work on Windows 10 Exclusively\nOffice 2019 for Windows and Mac Is Now Available\nMicrosoft releases emergency update to fix Office 2016 crashes\nMicrosoft shares guidance on upcoming Publisher deprecation\nMicrosoft blocks ActiveX by default in Microsoft 365, Office 2024"
    },
    {
        "Title": "CISA warns of increased breach risks following Oracle Cloud leak",
        "Link": "https://www.bleepingcomputer.com/news/security/cisa-warns-of-increased-breach-risks-following-oracle-cloud-leak/",
        "Summary": "On Wednesday, CISA warned of heightened breach risks after the compromise of legacy Oracle Cloud servers earlier this year and highlighted the significant threat to enterprise networks. [...]",
        "Date": "2025-04-17",
        "Content": "On Wednesday, CISA warned of heightened breach risks after the compromise of legacy Oracle Cloud servers earlier this year and highlighted the significant threat to enterprise networks.\nCISA said\n, \"the nature of the reported activity presents potential risk to organizations and individuals, particularly where credential material may be exposed, reused across separate, unaffiliated systems, or embedded (i.e., hardcoded into scripts, applications, infrastructure templates, or automation tools),\" even though \"the scope and impact remains unconfirmed.\"\n\"When credential material is embedded, it is difficult to discover and can enable long-term unauthorized access if exposed. The compromise of credential material, including usernames, emails, passwords, authentication tokens, and encryption keys, can pose significant risk to enterprise environments,\" it added.\nThe U.S. cybersecurity agency also released guidance to mitigate the risks linked to the resulting credential leak, urging network defenders to reset affected users' passwords, replace hardcoded or embedded credentials with secure authentication methods, enforce phishing-resistant multi-factor authentication (MFA) wherever possible, and monitor authentication logs for suspicious activity.\nThis warning comes after Oracle confirmed in email notifications sent to customers that a\nthreat actor leaked credentials\nstolen from what the company described as \"two obsolete servers.\"\nHowever, Oracle added that its Oracle Cloud servers were not compromised, and the incident didn't impact its cloud services or customer data.\nOracle email statement (BleepingComputer)\n​Oracle also\nprivately acknowledged\nin calls with some of its clients that attackers stole old client credentials after breaching a \"legacy environment\" last used in 2017. However, the hacker behind the breach posted newer records from 2025 on BreachForums and shared data with BleepingComputer from the end of 2024.\nBleepingComputer ​​​​​\nhas separately confirmed\nwith multiple Oracle customers that leaked data samples (including associated LDAP display names, email addresses, given names, and other identifying information) received from the threat actor were valid.\nIn late March, cybersecurity firm\nCybelAngel\nalso revealed that Oracle told customers that an attacker deployed a web shell and additional malware on some of its Gen 1 (also known as Oracle Cloud Classic) servers as early as January 2025.\nUntil the breach was detected in late February, the attacker allegedly stole data from the Oracle Identity Manager (IDM) database, which included hashed passwords, usernames, and user emails.\nLast month, BleepingComputer first reported that Oracle also issued private customer notifications regarding\nanother January breach at Oracle Health\n(a SaaS company previously known as Cerner) that impacted patient data at multiple U.S. healthcare organizations and hospitals.\nRelated Articles:\nOracle privately confirms Cloud breach to customers\nCISA tags SonicWall VPN flaw as actively exploited in attacks\nOracle says \"obsolete servers\" hacked, denies cloud breach\nOracle customers confirm data stolen in alleged cloud breach is valid\nOracle denies breach after hacker claims theft of 6 million data records"
    },
    {
        "Title": "New Windows Server emergency updates fix container launch issue",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/new-windows-server-emergency-updates-fix-container-launch-issue/",
        "Summary": "Microsoft has released emergency Windows Server updates to address a known issue preventing Windows containers from launching. [...]",
        "Date": "2025-04-17",
        "Content": "Microsoft has released emergency Windows Server updates to address a known issue preventing Windows containers from launching.\nThe issue affects only containers running under Hyper-V isolation mode, which allows multiple containers to run simultaneously on a single Windows host inside separate virtual machines.\n\"This update fixes an issue caused by 2025.04 B container images released on April 8, 2025 where Windows containers running in Hyper-V isolation mode could fail to start in some cases if their update level didn't match that of the hosting utility virtual machine (UVM),\"\nMicrosoft explained\n.\n\"The mismatch caused compatibility problems between system files, leading to startup failures. With this update, containers now correctly access the necessary system files from the host, improving reliability and compatibility across different Windows versions.\"\nAfter deploying this week's emergency updates, containers will now correctly access the necessary system files from the Windows Server host, improving compatibility and reliability across different Windows versions.\nMicrosoft released the following out-of-band (OOB) updates for Windows Server 2019, Windows Server 2022, and Windows Server 2025 on Wednesday to address this issue:\nWindows Server 2025 (\nKB5059087\n)\nWindows Server 2022 (\nKB5059092\n)\nWindows Server 2022 (\nKB5059091\n)\nThe updates are not delivered through Windows Update and will not install automatically on impacted servers. However, they can be installed manually after downloading the standalone MSU packages from the\nMicrosoft Update Catalog\n.\nMicrosoft\nprovides detailed guidance\non how to use the Deployment Image Servicing and Management (DISM.exe) tool to apply the updates to a running Windows PC or Windows Installation media.\nEarlier this month, the company\nfixed authentication issues\naffecting Windows Server and Windows 11 24H2 systems and warned IT admins that restarts\nmay render some Windows Server 2025 domain controllers inaccessible\n.\nRedmond also confirmed\nin October 2023 that\nWindows Server 2019 and Windows Server 2022 security updates released at the time\nbroke VMs on Hyper-V hosts\n, causing boot issues and displaying \"failed to start\" errors.\nOne year earlier, in January and December 2022, it released emergency Windows Server updates to fix known issues causing\nproblems creating new Hyper-V VMs\nand\npreventing them from starting\n.\nRelated Articles:\nMicrosoft: New Windows updates fix Active Directory policy issues\nMicrosoft: Windows Server 2025 restarts break connectivity on some DCs\nMicrosoft fixes auth issues on Windows Server, Windows 11 24H2\nMicrosoft fixes Remote Desktop issues caused by Windows updates\nRecent Windows Server 2025 updates cause Remote Desktop freezes"
    },
    {
        "Title": "CISA tags SonicWall VPN flaw as actively exploited in attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/cisa-tags-sonicwall-vpn-flaw-as-actively-exploited-in-attacks/",
        "Summary": "On Wednesday, CISA warned federal agencies to secure their SonicWall Secure Mobile Access (SMA) 100 series appliances against attacks exploiting a high-severity remote code execution vulnerability. [...]",
        "Date": "2025-04-17",
        "Content": "On Wednesday, CISA warned federal agencies to secure their SonicWall Secure Mobile Access (SMA) 100 series appliances against attacks exploiting a high-severity remote code execution vulnerability.\nTracked as\nCVE-2021-20035\n, this security flaw impacts SMA 200, SMA 210, SMA 400, SMA 410, and SMA 500v (ESX, KVM, AWS, Azure) devices. Successful exploitation can allow remote threat actors with low privileges to execute arbitrary code in low-complexity attacks.\n\"Improper neutralization of special elements in the SMA100 management interface allows a remote authenticated attacker to inject arbitrary commands as a 'nobody' user, which could potentially lead to code execution,\" SonicWall\nexplains\nin an advisory updated this week.\nSonicWall patched this vulnerability almost four years ago, in September 2021, when the company said it could only be exploited to take down vulnerable appliances in denial-of-service (DoS) attacks.\nHowever, on Monday, it updated the CVE-2021-20035 security advisory to flag it as exploited in attacks, upgrade the CVSS severity score from medium to high, and expand the impact to include code execution.\n\"This vulnerability is believed to be actively exploited in the wild. As a precautionary measure, SonicWall PSIRT has updated the summary and revised the CVSS score to 7.2,\" SonicWall said.\nProduct\nPlatform\nImpacted Version\nFixed version\nSMA 100 Series\n• SMA 200\n• SMA 210\n• SMA 400\n• SMA 410\n• SMA 500v (ESX, KVM, AWS, Azure)\n10.2.1.0-17sv and earlier\n10.2.1.1-19sv and higher\n10.2.0.7-34sv and earlier\n10.2.0.8-37sv and higher\n9.0.0.10-28sv and earlier\n9.0.0.11-31sv and higher\nYesterday, CISA confirmed the\nvulnerability is now being abused in the wild\nby adding it to the\nKnown Exploited Vulnerabilities catalog\n, which lists security flaws flagged by the cybersecurity agency as actively exploited in attacks.\nAs mandated by the Binding Operational Directive (BOD) 22-01 issued in November 2021, Federal Civilian Executive Branch (FCEB) agencies now have three weeks, until May 7th, to secure their networks against ongoing attacks.\nWhile BOD 22-01 only applies to U.S. federal agencies, all network defenders should prioritize patching this security vulnerability as soon as possible to block potential breach attempts.\n\"These types of vulnerabilities are frequent attack vectors for malicious cyber actors and pose significant risks to the federal enterprise,\"\nCISA warned\n.\nIn February, SonicWall also warned of an\nactively exploited authentication bypass flaw\nin Gen 6 and Gen 7 firewalls that could let hackers\nhijack VPN sessions\n.\nOne month earlier, the company urged customers to patch a\ncritical vulnerability affecting SMA1000 secure access gateways\nfollowing reports that it had already been exploited in zero-day attacks.\nRelated Articles:\nCritical Ivanti RCE flaw with public exploit now used in attacks\nCentreStack RCE exploited as zero-day to breach file sharing servers\nIvanti patches Connect Secure zero-day exploited since mid-March\nCISA tags NAKIVO backup flaw as actively exploited in attacks\nCritical RCE flaw in Apache Tomcat actively exploited in attacks"
    },
    {
        "Title": "Android Phones Pre-Downloaded With Malware Target User Crypto Wallets",
        "Link": "https://www.darkreading.com/threat-intelligence/android-pre-downloaded-malware-crypto-wallets",
        "Summary": "The threat actors lace pre-downloaded applications with malware to steal cryptocurrency by covertly swapping users' wallet addresses with their own.",
        "Date": "2025-04-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/android-pre-downloaded-malware-crypto-wallets"
    },
    {
        "Title": "Dogged by Trump, Chris Krebs Resigns From SentinelOne",
        "Link": "https://www.darkreading.com/cybersecurity-operations/trump-chris-krebs-resigns-sentinelone",
        "Summary": "The president revoked the former CISA director's security clearance, half a decade after Krebs challenged right-wing election disinformation, prompting his eventual resignation.",
        "Date": "2025-04-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/trump-chris-krebs-resigns-sentinelone"
    },
    {
        "Title": "CVE Program Cuts Send the Cyber Sector Into Panic Mode",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/cve-program-cuts-cyber-sector",
        "Summary": "After threatening to slash support for the CVE program, CISA threw MITRE a lifeline at the last minute — extending its government contract for another 11 months. After that, it looks like it's up to the private sector to find the cash to keep it going.",
        "Date": "2025-04-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/cve-program-cuts-cyber-sector"
    },
    {
        "Title": "Cybersecurity by Design: When Humans Meet Technology",
        "Link": "https://www.darkreading.com/cyber-risk/cybersecurity-by-design-when-humans-meet-technology",
        "Summary": "If security tools are challenging to use, people will look for workarounds to get around the restrictions.",
        "Date": "2025-04-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/cybersecurity-by-design-when-humans-meet-technology"
    },
    {
        "Title": "Middle East, North Africa Security Spending to Top $3B",
        "Link": "https://www.darkreading.com/cybersecurity-analytics/middle-east-north-africa-security-spending",
        "Summary": "Gartner projects IT security spending in the MENA region will continue to increase in 2025, with security services accounting for the most growth.",
        "Date": "2025-04-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-analytics/middle-east-north-africa-security-spending"
    },
    {
        "Title": "GPS Spoofing Attacks Spike in Middle East, Southeast Asia",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/gps-spoofing-attacks-spike-middle-east-southeast-asia",
        "Summary": "An Indian disaster-relief flight delivering aid is the latest air-traffic incident, as attacks increase in the Middle East and Myanmar and along the India-Pakistan border.",
        "Date": "2025-04-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/gps-spoofing-attacks-spike-middle-east-southeast-asia"
    },
    {
        "Title": "Man Helped Chinese Nationals Get Jobs Involving Sensitive US Government Projects",
        "Link": "https://www.securityweek.com/man-helped-chinese-nationals-get-jobs-involving-sensitive-us-government-projects/",
        "Summary": "<p>Minh Phuong Ngoc Vong pleaded guilty to defrauding US companies of roughly $1 million in a fake IT worker scheme.</p>\n<p>The post <a href=\"https://www.securityweek.com/man-helped-chinese-nationals-get-jobs-involving-sensitive-us-government-projects/\">Man Helped Chinese Nationals Get Jobs Involving Sensitive US Government Projects</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/man-helped-chinese-nationals-get-jobs-involving-sensitive-us-government-projects/"
    },
    {
        "Title": "Demystifying Security Posture Management",
        "Link": "https://www.securityweek.com/demystifying-security-posture-management/",
        "Summary": "<p>While the Security Posture Management buzz is real, its long-term viability depends on whether it can deliver measurable outcomes without adding more complexity.</p>\n<p>The post <a href=\"https://www.securityweek.com/demystifying-security-posture-management/\">Demystifying Security Posture Management</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/demystifying-security-posture-management/"
    },
    {
        "Title": "Vulnerabilities Patched in Atlassian, Cisco Products",
        "Link": "https://www.securityweek.com/vulnerabilities-patched-in-atlassian-cisco-products/",
        "Summary": "<p>Atlassian and Cisco have released patches for multiple high-severity vulnerabilities, including remote code execution bugs.</p>\n<p>The post <a href=\"https://www.securityweek.com/vulnerabilities-patched-in-atlassian-cisco-products/\">Vulnerabilities Patched in Atlassian, Cisco Products</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/vulnerabilities-patched-in-atlassian-cisco-products/"
    },
    {
        "Title": "Critical Erlang/OTP SSH Flaw Exposes Many Devices to Remote Hacking",
        "Link": "https://www.securityweek.com/critical-erlang-otp-ssh-flaw-exposes-many-servers-to-remote-hacking/",
        "Summary": "<p>Servers exposed to complete takeover due to CVE-2025-32433, an unauthenticated remote code execution flaw in Erlang/OTP SSH.</p>\n<p>The post <a href=\"https://www.securityweek.com/critical-erlang-otp-ssh-flaw-exposes-many-servers-to-remote-hacking/\">Critical Erlang/OTP SSH Flaw Exposes Many Devices to Remote Hacking</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/critical-erlang-otp-ssh-flaw-exposes-many-servers-to-remote-hacking/"
    },
    {
        "Title": "Why ‘One Community’ Resonates in Cybersecurity",
        "Link": "https://www.securityweek.com/why-one-community-resonates-in-cybersecurity/",
        "Summary": "<p>Our collective voices and one community will provide the intelligence we need to safeguard our businesses in today’s modern digital environment.</p>\n<p>The post <a href=\"https://www.securityweek.com/why-one-community-resonates-in-cybersecurity/\">Why ‘One Community’ Resonates in Cybersecurity</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/why-one-community-resonates-in-cybersecurity/"
    },
    {
        "Title": "CISA Issues Guidance After Oracle Cloud Hack",
        "Link": "https://www.securityweek.com/cisa-issues-guidance-after-oracle-cloud-hack/",
        "Summary": "<p>CISA is making recommendations for organizations and users in light of the recent Oracle legacy cloud environment hack.</p>\n<p>The post <a href=\"https://www.securityweek.com/cisa-issues-guidance-after-oracle-cloud-hack/\">CISA Issues Guidance After Oracle Cloud Hack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cisa-issues-guidance-after-oracle-cloud-hack/"
    },
    {
        "Title": "Chinese APT Mustang Panda Updates, Expands Arsenal",
        "Link": "https://www.securityweek.com/chinese-apt-mustang-panda-updates-expands-arsenal/",
        "Summary": "<p>The Chinese state-sponsored group Mustang Panda has used new and updated malicious tools in a recent attack.</p>\n<p>The post <a href=\"https://www.securityweek.com/chinese-apt-mustang-panda-updates-expands-arsenal/\">Chinese APT Mustang Panda Updates, Expands Arsenal</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chinese-apt-mustang-panda-updates-expands-arsenal/"
    },
    {
        "Title": "SonicWall Flags Old Vulnerability as Actively Exploited",
        "Link": "https://www.securityweek.com/sonicwall-flags-old-vulnerability-as-actively-exploited/",
        "Summary": "<p>A SonicWall SMA 100 series vulnerability patched in 2021, which went unnoticed at the time of patching, is being exploited in the wild.</p>\n<p>The post <a href=\"https://www.securityweek.com/sonicwall-flags-old-vulnerability-as-actively-exploited/\">SonicWall Flags Old Vulnerability as Actively Exploited</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/sonicwall-flags-old-vulnerability-as-actively-exploited/"
    },
    {
        "Title": "MITRE Hackers’ Backdoor Has Targeted Windows for Years",
        "Link": "https://www.securityweek.com/mitre-hackers-backdoor-has-targeted-windows-for-years/",
        "Summary": "<p>Windows versions of the BrickStorm backdoor that the Chinese APT used in the MITRE hack last year have been active for years.</p>\n<p>The post <a href=\"https://www.securityweek.com/mitre-hackers-backdoor-has-targeted-windows-for-years/\">MITRE Hackers&#8217; Backdoor Has Targeted Windows for Years</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-17",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/mitre-hackers-backdoor-has-targeted-windows-for-years/"
    }
]