[
    {
        "Title": "Microsoft Credits EncryptHub, Hacker Behind 618+ Breaches, for Disclosing Windows Flaws",
        "Link": "https://thehackernews.com/2025/04/microsoft-credits-encrypthub-hacker.html",
        "Summary": "A likely lone wolf actor behind the EncryptHub persona was acknowledged by Microsoft for discovering and reporting two security flaws in Windows last month, painting a picture of a \"conflicted\" individual straddling a legitimate career in cybersecurity and pursuing cybercrime.\nIn a new extensive analysis published by Outpost24 KrakenLabs, the Swedish security company unmasked the up-and-coming",
        "Date": "2025-04-05",
        "Content": "A likely lone wolf actor behind the\nEncryptHub\npersona was acknowledged by Microsoft for discovering and reporting two security flaws in Windows last month, painting a picture of a \"conflicted\" individual straddling a legitimate career in cybersecurity and pursuing cybercrime.\nIn a new\nextensive analysis\npublished by Outpost24 KrakenLabs, the Swedish security company unmasked the up-and-coming cybercriminal, who, about 10 years ago, fled his hometown in Kharkov, Ukraine, to a new place somewhere near the Romanian coast.\nThe vulnerabilities were credited by Microsoft to a party named \"SkorikARI with SkorikARI,\" which has been assessed to be another username used by EncryptHub. The flaws in question, both of which were fixed by Redmond as part of its\nPatch Tuesday update\nlast month, are below -\nCVE-2025-24061\n(CVSS score: 7.8) - Microsoft Windows Mark-of-the-Web (MotW) Security Feature Bypass Vulnerability\nCVE-2025-24071\n(CVSS score: 6.5) - Microsoft Windows File Explorer Spoofing Vulnerability\nEncryptHub, also tracked under the monikers LARVA-208 and Water Gamayun, was\nspotlighted\nin mid-2024 as part of a campaign that leveraged a bogus WinRAR site to distribute various kinds of malware hosted on a GitHub repository named \"encrypthub.\"\nIn recent weeks, the threat actor has been\nattributed\nto the\nzero-day exploitation\nof another security flaw in Microsoft Management Console (CVE-2025-26633, CVSS score: 7.0, aka MSC EvilTwin) to deliver information stealers and previously undocumented backdoors named SilentPrism and DarkWisp.\nAccording to PRODAFT, EncryptHub is estimated to have compromised over 618 high-value targets across multiple industries in the last nine months of its operation.\n\"All data analyzed throughout our investigation points to the actions of a single individual,\" Lidia Lopez, Senior Threat Intelligence Analyst at Outpost24, told The Hacker News.\n\"However, we cannot rule out the possibility of collaboration with other threat actors. In one of the Telegram channels used to monitor infection statistics, there was another Telegram user with administrative privileges, suggesting potential cooperation or assistance from others without a clear group affiliation.\"\nOutpost24 said it was able to piece together EncryptHub's online footprint from the \"actor's self-infections due to poor operational security practices,\" uncovering new aspects of their infrastructure and tooling in the process.\nThe individual is believed to have kept a low profile after moving to an unspecified place near Romania, studying computer science on their own by enrolling for online courses, while seeking computer-related jobs on the side.\nAll of the threat actor's activity, however, abruptly ceased in early 2022 coinciding with the\nonset of the Russo-Ukrainian war\n. That said, Outpost24 said it has found evidence to suggest that he was jailed around the same time.\n\"Once released, he resumed his job search, this time offering freelance web and app development services, which gained some traction,\" the company said in the report. \"But the pay likely wasn't enough, and after briefly trying bug bounty programs with little success, we believe he pivoted to cybercrime in the first half of 2024.\"\nOne of EncryptHub's earliest ventures in the cybercrime landscape is\nFickle Stealer\n, which was first documented by Fortinet FortiGuard Labs in June 2024 as a Rust-based information stealer malware that's distributed via multiple channels.\nIn a\nrecent interview\nwith security researcher g0njxa, the threat actor claimed that Fickle \"delivers results on systems where StealC or Rhadamantys (sic) would never work\" and that it \"passes high-quality corporate antivirus systems.\" They also stated that the stealer is not only being shared privately, it's also \"integral\" to another product of theirs dubbed EncryptRAT.\n\"We were able to associate Fickle Stealer with an alias previously tied to EncryptHub,\" Lopez said. \"Additionally, one of the domains linked to that campaign matches infrastructure connected to his legitimate freelance work. From our analysis, we estimate EncryptHub's cybercriminal activity began around March 2024. Fortinet's reporting in June likely marks the first public documentation of these actions.\"\nEncryptHub is also said to have relied extensively on OpenAI's ChatGPT to assist with malware development, even going to the extent of using it to aid in translating emails and messages and as a confessional tool.\n\"EncryptHub's case highlights how poor operational security remains one of the most critical weaknesses for cybercriminals,\" Lopez pointed out. \"Despite technical sophistication, basic mistakes – like password reuse, exposed infrastructure, and mixing personal with criminal activity – ultimately led to his exposure.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "North Korean Hackers Deploy BeaverTail Malware via 11 Malicious npm Packages",
        "Link": "https://thehackernews.com/2025/04/north-korean-hackers-deploy-beavertail.html",
        "Summary": "The North Korean threat actors behind the ongoing Contagious Interview campaign are spreading their tentacles on the npm ecosystem by publishing more malicious packages that deliver the BeaverTail malware, as well as a new remote access trojan (RAT) loader.\n\"These latest samples employ hexadecimal string encoding to evade automated detection systems and manual code audits, signaling a variation",
        "Date": "2025-04-05",
        "Content": "The North Korean threat actors behind the ongoing\nContagious Interview\ncampaign are spreading their tentacles on the npm ecosystem by publishing more malicious packages that deliver the BeaverTail malware, as well as a new remote access trojan (RAT) loader.\n\"These latest samples employ hexadecimal string encoding to evade automated detection systems and manual code audits, signaling a variation in the threat actors' obfuscation techniques,\" Socket security researcher Kirill Boychenko\nsaid\nin a report.\nThe packages in question, which were collectively downloaded more than 5,600 times prior to their removal, are listed below -\nempty-array-validator\ntwitterapis\ndev-debugger-vite\nsnore-log\ncore-pino\nevents-utils\nicloud-cod\ncln-logger\nnode-clog\nconsolidate-log\nconsolidate-logger\nThe disclosure comes nearly a month after\na set of six npm packages\nwere discovered distributing\nBeaverTail\n, a\nJavaScript stealer\nthat's also capable of delivering a Python-based backdoor dubbed InvisibleFerret.\nThe end goal of the campaign is to infiltrate developer systems under the guise of a job interview process, steal sensitive data, siphon financial assets, and maintain long-term access to compromised systems.\nThe newly identified npm libraries masquerade as utilities and debuggers, with one of them – dev-debugger-vite – using a command-and-control (C2) address previously flagged by SecurityScorecard as used by the Lazarus Group in a campaign codenamed\nPhantom Circuit\nin December 2024.\nWhat makes these packages stand out is some of them, such as events-utils and icloud-cod, are linked to Bitbucket repositories, as opposed to GitHub. Furthermore, the icloud-cod package has been found to be hosted within a directory named \"\neiwork_hire\n,\" reiterating the threat actor's use of interview-related themes to activate the infection.\nAn analysis of the packages, cln-logger, node-clog, consolidate-log, and consolidate-logger, has also uncovered minor code-level variations, indicating that the attackers are publishing multiple malware variants in an attempt to increase the success rate of the campaign.\nRegardless of the changes, the malicious code embedded within the four packages functions as a remote access trojan (RAT) loader that's capable of propagating a next-stage payload from a remote server.\n\"The Contagious Interview threat actors continue to create new npm accounts and deploy malicious code across platforms like the npm registry, GitHub, and Bitbucket, demonstrating their persistence and showing no signs of slowing down,\" Boychenko said.\n\"The advanced persistent threat (APT) group is diversifying its tactics — publishing new malware under fresh aliases, hosting payloads in both GitHub and Bitbucket repositories, and reusing core components like BeaverTail and InvisibleFerret alongside newly observed RAT/loader variant.\"\nBeaverTail Drops Tropidoor\nThe discovery of the new npm packages comes as South Korean cybersecurity company AhnLab detailed a recruitment-themed phishing campaign that delivers BeaverTail, which is then used to deploy a previously undocumented Windows backdoor codenamed Tropidoor. Artifacts analyzed by the firm show that BeaverTail is being used to actively target developers in South Korea.\nThe\nemail message\n, which claimed to be from a company called AutoSquare, contained a link to a project hosted on Bitbucket, urging the recipient to clone the project locally on their machine to review their understanding of the program.\nThe application is nothing but an npm library that contains BeaverTail (\"tailwind.config.js\") and a DLL downloader malware (\"car.dll\"), the latter of which is launched by the JavaScript stealer and loader.\nTropidoor is a backdoor \"operating in memory through the downloader\" that's capable of contacting a C2 server to receive instructions that make it possible to exfiltrate files, gather drive and file information, run and terminate processes, capture screenshots, and delete or wipe files by overwriting them with NULL or junk data.\nAn important aspect of the implant is that it directly implements Windows commands such as schtasks, ping, and reg, a feature previously also observed in another Lazarus Group malware called\nLightlessCan\n, itself a successor of\nBLINDINGCAN\n(aka AIRDRY aka ZetaNile).\n\"Users should be cautious not only with email attachments but also with executable files from unknown sources,\" AhnLab\nsaid\n.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Malicious Python Packages on PyPI Downloaded 39,000+ Times, Steal Sensitive Data",
        "Link": "https://thehackernews.com/2025/04/malicious-python-packages-on-pypi.html",
        "Summary": "Cybersecurity researchers have uncovered malicious libraries in the Python Package Index (PyPI) repository that are designed to steal sensitive information and test stolen credit card data.\nTwo of the packages, bitcoinlibdbfix and bitcoinlib-dev, masquerade as fixes for recent issues detected in a legitimate Python module called bitcoinlib, according to ReversingLabs. A third package discovered",
        "Date": "2025-04-05",
        "Content": "Cybersecurity researchers have uncovered malicious libraries in the Python Package Index (PyPI) repository that are designed to steal sensitive information and test stolen credit card data.\nTwo of the packages, bitcoinlibdbfix and bitcoinlib-dev, masquerade as fixes for\nrecent issues\ndetected in a legitimate Python module called bitcoinlib, according to\nReversingLabs\n. A third package\ndiscovered\nby Socket, disgrasya, contained a fully automated carding script targeting WooCommerce stores.\nThe packages attracted hundreds of downloads before being taken down, according to statistics from pepy.tech -\nbitcoinlibdbfix\n- 1,101 downloads\nbitcoinlib-dev\n- 735 downloads\ndisgrasya\n- 37,217 downloads\n\"The malicious libraries both attempt a similar attack, overwriting the legitimate 'clw cli' command with malicious code that attempts to exfiltrate sensitive database files,\" ReversingLabs said.\nIn an interesting twist, the authors of the counterfeit libraries are said to have joined a GitHub issue discussion and unsuccessfully attempted to trick unsuspecting users into downloading the purported fix and running the library.\nOn the other hand, disgrasya has been found to be openly malicious, making no effort to conceal its carding and credit card information stealing functionality.\n\"The malicious payload was introduced in version 7.36.9, and all subsequent versions carried the same embedded attack logic,\" the Socket Research Team said.\nCarding\n, also called\ncredit card stuffing\n, refers to an automated form of payment fraud in which fraudsters test a bulk list of stolen credit or debit card information against a merchant's payment processing system to verify breached or stolen card details. It falls under a broader attack category referred to as automated transaction abuse.\nA typical source for stolen credit card data is a\ncarding forum\n, where credit card details pilfered from victims using various methods like phishing, skimming, or stealer malware are\nadvertised for sale to other threat actors\nto further criminal activity.\nOnce they are found to be active (i.e. not reported lost, stolen, or deactivated), scammers use them to buy gift cards or prepaid cards, which are then resold for profit. Threat actors are also known to test if the cards are valid by attempting small transactions on e-commerce sites to avoid being flagged for fraud by the card owners.\nThe rogue package identified by Socket is designed to validate stolen credit card information, particularly targeting merchants using WooCommerce with CyberSource as the payment gateway.\nThe script achieves this by emulating the actions of a legitimate shopping activity, programmatically finding a product, adding it to a cart, navigating to the WooCommerce checkout page, and filling the payment form with randomized billing details and the stolen credit card data.\nIn mimicking a real checkout process, the idea is to test the validity of the plundered cards and exfiltrate the relevant details, such as the credit card number, expiration date, and CVV, to an external server under the attacker's control (\"railgunmisaka[.]com\") without attracting the attention of fraud detection systems.\n\"While the name might raise eyebrows to native speakers ('disgrasya' is Filipino slang for 'disaster' or 'accident'), it's an apt characterization of a package that executes a multi-step process emulating a legitimate shopper's journey through an online store in order to test stolen credit cards against real checkout systems without triggering fraud detection,\" Socket said.\n\"By embedding this logic inside a Python package published on PyPI and downloaded over 34,000 times, the attacker created a modular tool that could be easily used in larger automation frameworks, making disgrasya a powerful carding utility disguised as a harmless library.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Coinbase to fix 2FA account activity entry freaking out users",
        "Link": "https://www.bleepingcomputer.com/news/security/coinbase-to-fix-2fa-account-activity-entry-freaking-out-users/",
        "Summary": "Coinbase is fixing an incorrect account activity message that freaks out customers and makes them think their credentials were compromised. [...]",
        "Date": "2025-04-05",
        "Content": "Coinbase is fixing a misleading account activity message that has caused confusion and anxiety, making users think their credentials were compromised.\nOver the past couple of weeks, numerous people have contacted BleepingComputer about concerns that they think Coinbase has a serious security issue.\nAfter receiving Coinbase phishing emails or texts, they logged into their accounts and checked the activity log, finding numerous entries stating \"second_factor_failure\" or \"2-step verification failed\" with login attempts from unusual locations.\nCoinbase account activity showing 2-step verification failed message\n.\nTwo-factor authentication prompts usually occur after a user successfully logs in with their credentials, so they immediately thought that their passwords were compromised and that only 2FA saved them from their account being hacked.\nThis led them to change their passwords, check for malware, and grow anxious over what they believed was a breach.\nMaking matters worse, these users claimed to have a complex, unique password at Coinbase, and there were no signs of malware on their devices, making them believe that Coinbase had been breached.\nHowever, it turns out that the \"second_factor_failure\" or \"2-step verification failed\" account activity messages are shown in two different scenarios—when a user incorrectly enters the wrong 2FA code or when someone tries to log into their account with the wrong password.\nBleepingComputer was able to confirm this by logging into someone's account with the wrong password and the person telling us that their account activity page soon showed the mislabeled 2FA error.\nSimilar concerns were\nexpressed on Reddit\n, where users receiving these alerts also confirmed incorrect passwords caused them.\n\"I think they mean that the error doesnt [sic] give any actual detail of what happened,\" a Coinbase customer posted to Reddit.\n\"To me the error means someone has the pw but not 2fa, but thats not what it means. It should probably should be something like \"invalid password\" if that is what is actually happening.\"\nCoinbase has told BleepingComputer that they are looking into changing the error message when an incorrect password is entered but that there is no time frame as to when this occurs.\nUnfortunately, BleepingComputer was told that threat actors use these erroneous error messages as part of social engineering attacks that attempt to breach Coinbase accounts by making targets think their credentials are compromised.\nBleepingComputer has not been able to independently verify if this \"bug\" is being abused in that way.\nAs a reminder, Coinbase will never text or call you about suspicious activity on your account, so if you receive a phone call or text message, just ignore it and do not engage with the scammers.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nPoisonSeed phishing campaign behind emails with wallet seed phrases\nCoinbase was primary target of recent GitHub Actions breaches\nCoinbase phishing email tricks users with fake wallet migration"
    },
    {
        "Title": "WinRAR flaw bypasses Windows Mark of the Web security alerts",
        "Link": "https://www.bleepingcomputer.com/news/security/winrar-flaw-bypasses-windows-mark-of-the-web-security-alerts/",
        "Summary": "A vulnerability in the WinRAR file archiver solution could be exploited to bypass the Mark of the Web (MotW) security warning and execute arbitrary code on a Windows machine. [...]",
        "Date": "2025-04-05",
        "Content": "A vulnerability in the WinRAR file archiver solution could be exploited to bypass the Mark of the Web (MotW) security warning and execute arbitrary code on a Windows machine.\nThe security issue is tracked as CVE-2025-31334 and affects all WinRAR versions except the most recent release, which is currently 7.11.\nMark of the Web is a security function in Windows in the form of a metadata value (an alternate data stream named ‘zone-identifier’) to tag as potentially unsafe files downloaded from the internet.\nWhen opening an executable with the MotW tag, Windows warns the user that it was downloaded from the internet and could be harmful and offers the option to continue execution or terminate it.\nSymlink to executable\nThe CVE-2025-31334 vulnerability can help a threat actor bypass the MotW security warning when opening a symbolic link (symlink) pointing to an executable file in any WinRAR version before 7.11.\nAn attacker could execute arbitrary code by using a specially crafted symbolic link. It should be noted that a symlink can be created on Windows only with administrator permissions.\nThe security issue received a\nmedium severit\ny score of 6.8 and has been fixed in the latest version of WinRAR, as noted in the applications change log:\n“If symlink pointing at an executable was started from WinRAR shell, the executable Mark of the Web data was ignored” -\nWinRAR\nThe vulnerability was reported by Shimamine Taihei of Mitsui Bussan Secure Directions through the Information Technology Promotion Agency (IPA) in Japan.\nJapan’s Computer Security Incident Response Team\ncoordinated\nthe responsible disclosure with WinRAR’s developer.\nStarting version 7.10, WinRAR provides the possibility to remove from the MotW alternate data stream information (e.g. location, IP address) that could be considered a privacy risk.\nThreat actors, including state-sponsored ones, have exploited MotW bypasses in the past to deliver various malware without triggering the security warning.\nRecently, Russian hackers leveraged such a vulnerability in the 7-Zip archiver, which did not propagate the MotW when\ndouble archiving\n(archiving a file within another one) to run the Smokeloader malware dropper.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft starts testing Windows 11 taskbar icon scaling\nMicrosoft adds hotpatching support to Windows 11 Enterprise\nMicrosoft: New Windows scheduled task will launch Office apps faster\nMicrosoft says button to restore classic Outlook is broken\nMicrosoft replacing Remote Desktop app with Windows App in May"
    }
]