[
    {
        "Title": "Chinese Smishing Kit Powers Widespread Toll Fraud Campaign Targeting U.S. Users in 8 States",
        "Link": "https://thehackernews.com/2025/04/chinese-smishing-kit-behind-widespread.html",
        "Summary": "Cybersecurity researchers are warning of a \"widespread and ongoing\" SMS phishing campaign that's been targeting toll road users in the United States for financial theft since mid-October 2024.\n\"The toll road smishing attacks are being carried out by multiple financially motivated threat actors using the smishing kit developed by 'Wang Duo Yu,'\" Cisco Talos researchers Azim Khodjibaev, Chetan",
        "Date": "2025-04-18",
        "Content": "Cybersecurity researchers are warning of a \"widespread and ongoing\" SMS phishing campaign that's been targeting toll road users in the United States for financial theft since mid-October 2024.\n\"The toll road smishing attacks are being carried out by multiple financially motivated threat actors using the smishing kit developed by 'Wang Duo Yu,'\" Cisco Talos researchers Azim Khodjibaev, Chetan Raghuprasad, and Joey Chen\nassessed\nwith moderate confidence.\nThe\nphishing campaigns\n, per the company, impersonate U.S. electronic toll collection systems like E-ZPass, sending SMS messages and Apple iMessages to individuals across Washington, Florida, Pennsylvania, Virginia, Texas, Ohio, Illinois, and Kansas about an unpaid toll and clicking on a fake link sent in the chat.\nIt's worth noting some aspects of the toll phishing campaign were\npreviously highlighted\nby security journalist Brian Krebs in January 2025, with the activity traced back to a China-based SMS phishing service called Lighthouse that's advertised on Telegram.\nWhile Apple iMessage automatically disables links in messages received from unknown senders, the smishing texts urge recipients to respond with \"Y\" in order to activate the link – a tactic observed in phishing kits like\nDarcula\nand\nXiū gǒu\n.\nShould the victim click on the link and visit the domain, they are prompted to solve a fake image-based CAPTCHA challenge, after which they are redirected to a fake E-ZPass page (e.g., \"ezp-va[.lcom\" or \"e-zpass[.]com-etcjr[.]xin\") where they are asked to enter their name and ZIP code to access the bill.\nTargets are then asked to proceed further to make the payment on another fraudulent page, at which point all the entered personal and financial information is siphoned to the threat actors.\nTalos noted that multiple threat actors are operating the toll road smishing campaigns by likely making use of a phishing kit developed by Wang Duo Yu, and that it has observed similar smishing kits being used by another Chinese organized cybercrime group known as the Smishing Triad.\nInterestingly, Wang Duo Yu is also alleged to be the creator of the phishing kits used by Smishing Triad, per security researcher Grant Smith. \"The creator is a current computer science student in China who is using the skills he's learning to make a pretty penny on the side,\" Smith revealed in an\nextensive\nanalysis\nin August 2024.\nSmishing Triad is\nknown\nfor conducting\nlarge-scale smishing attacks\ntargeting postal services in at least 121 countries, using failed package delivery lures to coax message recipients into clicking on bogus links that request their personal and financial information under the guise of a supposed service fee for redelivery.\nFurthermore, threat actors using these kits have\nattempted\nto enroll victims' card details into a mobile wallet, allowing them to further cash out their funds at scale using a technique known as\nGhost Tap\n.\nThe phishing kits have also been found to be backdoored in that the captured credit/debit card information is also exfiltrated to the creators, a technique known as\ndouble theft\n.\n\"Wang Duo Yu has crafted and designed specific smishing kits and has been selling access to these kits on their Telegram channels,\" Talos said. \"The kits are available with different infrastructure options, priced at US $50 each for a full-feature development, $30 each for proxy development (when the customer has a personal domain and server), $20 each for version updates, and $20 for all other miscellaneous support.\"\nAs of March 2025, the e-crime group is believed to have focused their efforts on a new Lighthouse phishing kit that's geared towards harvesting credentials from banks and financial organizations in Australia and the Asia-Pacific region, according to Silent Push.\nThe threat actors also claim to have \"300+ front desk staff worldwide\" to support various aspects of the fraud and cash-out schemes associated with the phishing kit.\n\"Smishing Triad is also selling its phishing kits to other maliciously aligned threat actors via Telegram and likely other channels,\" the company\nsaid\n. \"These sales make it difficult to attribute the kits to any one subgroup, so the sites are currently all attributed here under the Smishing Triad umbrella.\"\nIn a report published last month, PRODAFT\nrevealed\nthat Lighthouse shares tactical overlaps with phishing kits such as Lucid and Darcula, and that it operates independently of the XinXin group, the cybercrime group behind the Lucid kit. The Swiss cybersecurity company is tracking Wang Duo Yu (aka Lao Wang) as LARVA-241.\n\"An analysis of attacks conducted using the Lucid and Darcula panels revealed that Lighthouse (Lao Wang / Wang Duo Yu) shares significant similarities with the XinXin group in terms of targeting, landing pages, and domain creation patterns,\" PRODAFT noted.\nCybersecurity company Resecurity, which was the first to document\nSmishing Triad\nin 2023 and has also been tracking the scam toll campaigns, said the smishing syndicate has used over 60,000 domain names, making it challenging for Apple and Google to block the fraudulent activity in an effective manner.\n\"Using underground bulk SMS services enables cybercriminals to scale their operations, targeting millions of users simultaneously,\" Resecurity\nsaid\n. \"These services allow attackers to efficiently send thousands or millions of fraudulent IM messages, targeting users individually or groups of users based on specific demographics across various regions.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Multi-Stage Malware Attack Uses .JSE and PowerShell to Deploy Agent Tesla and XLoader",
        "Link": "https://thehackernews.com/2025/04/multi-stage-malware-attack-uses-jse-and.html",
        "Summary": "A new multi-stage attack has been observed delivering malware families like Agent Tesla variants, Remcos RAT, and XLoader.\n\"Attackers increasingly rely on such complex delivery mechanisms to evade detection, bypass traditional sandboxes, and ensure successful payload delivery and execution,\" Palo Alto Networks Unit 42 researcher Saqib Khanzada said in a technical write-up of the campaign.\nThe",
        "Date": "2025-04-18",
        "Content": "A new multi-stage attack has been observed delivering malware families like Agent Tesla variants, Remcos RAT, and XLoader.\n\"Attackers increasingly rely on such complex delivery mechanisms to evade detection, bypass traditional sandboxes, and ensure successful payload delivery and execution,\" Palo Alto Networks Unit 42 researcher Saqib Khanzada\nsaid\nin a technical write-up of the campaign.\nThe starting point of the attack is a deceptive email that poses as an order request to deliver a malicious 7-zip archive attachment, which contains a JavaScript encoded (.JSE) file.\nThe phishing email, observed in December 2024, falsely claimed that a payment had been made and urged the recipient to review an attached order file. Launching the JavaScript payload triggers the infection sequence, with the file acting as a downloader for a PowerShell script from an external server.\nThe script, in turn, houses a Base64-encoded payload that's subsequently deciphered, written to the Windows temporary directory, and executed. Here's where something interesting happens: The attack leads to a next-stage dropper that is either compiled using .NET or AutoIt.\nIn case of a .NET executable, the encrypted embedded payload – an Agent Tesla variant suspected to be\nSnake Keylogger\nor\nXLoader\n– is decoded and injected into a running \"RegAsm.exe\" process, a technique observed in\npast Agent Tesla campaigns\n.\nThe AutoIt compiled executable, on the other hand, introduces an additional layer in an attempt to further complicate analysis efforts. The AutoIt script within the executable incorporates an encrypted payload that's responsible for loading the final shellcode, causing .NET file to be injected into a \"RegSvcs.exe\" process, ultimately leading to Agent Tesla deployment.\n\"This suggests that the attacker employs multiple execution paths to increase resilience and evade detection,\" Khanzada noted. \"The attacker's focus remains on a multi-layered attack chain rather than sophisticated obfuscation.\"\n\"By stacking simple stages instead of focusing on highly sophisticated techniques, attackers can create resilient attack chains that complicate analysis and detection.\"\nIronHusky Delivers New Version of MysterySnail RAT\nThe disclosure comes as Kaspersky\ndetailed\na campaign that targets government organizations located in Mongolia and Russia with a new version of a malware called MysterySnail RAT. The activity has been attributed to a Chinese-speaking threat actor dubbed IronHusky.\nIronHusky, assessed to be active since at least 2017, was\npreviously documented\nby the Russian cybersecurity company in October 2021 in connection with the zero-day exploitation of CVE-2021-40449, a Win32k privilege escalation flaw, to deliver MysterySnail.\nThe infections originate from a malicious Microsoft Management Console (MMC) script that mimics a Word document from the National Land Agency of Mongolia (\"co-financing letter_alamgac\"). The script is designed to retrieve a ZIP archive with a lure document, a legitimate binary (\"CiscoCollabHost.exe\"), and a malicious DLL (\"CiscoSparkLauncher.dll\").\nIt's not exactly known how the MMC script is distributed to targets of interest, although the nature of the lure document suggests that it may have been via a phishing campaign.\nAs\nobserved in many attacks\n, \"CiscoCollabHost.exe\" is used to sideload the DLL, an intermediary backdoor capable of communicating with attacker-controlled infrastructure by taking advantage of the open-source\npiping-server\nproject.\nThe backdoor supports capabilities to run command shells, download/upload files, enumerate directory content, delete files, create new processes, and terminate itself. These commands are then used to sideload MysterySnail RAT.\nThe latest version of the malware is capable of accepting nearly 40 commands, allowing it to perform file management operations, execute commands via cmd.exe, spawn and kill processes, manage services, and connect to network resources via dedicated DLL modules.\nKasperksy said it observed the attackers dropping a \"repurposed and more lightweight version\" of MysterySnail codenamed MysteryMonoSnail after preventive actions were taken by the affected companies to block the intrusions.\n\"This version doesn't have as many capabilities as the version of MysterySnail RAT,\" the company noted. \"It was programmed to have only 13 basic commands, used to list directory contents, write data to files, and launch processes and remote shells.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "[Webinar] AI Is Already Inside Your SaaS Stack — Learn How to Prevent the Next Silent Breach",
        "Link": "https://thehackernews.com/2025/04/webinar-ai-is-already-inside-your-saas.html",
        "Summary": "Your employees didn’t mean to expose sensitive data. They just wanted to move faster. So they used ChatGPT to summarize a deal. Uploaded a spreadsheet to an AI-enhanced tool. Integrated a chatbot into Salesforce. No big deal—until it is.\nIf this sounds familiar, you're not alone. Most security teams are already behind in detecting how AI tools are quietly reshaping their SaaS environments. And",
        "Date": "2025-04-18",
        "Content": "Your employees didn't mean to expose sensitive data. They just wanted to move faster. So they used ChatGPT to summarize a deal. Uploaded a spreadsheet to an AI-enhanced tool. Integrated a chatbot into Salesforce. No big deal—until it is.\nIf this sounds familiar, you're not alone. Most security teams are already behind in detecting how AI tools are quietly reshaping their SaaS environments. And by the time an alert is triggered—if it even exists—damage may already be done.\nThis Isn't a Hypothetical Problem. It's Happening Now.\nAI adoption inside organizations is no longer strategic. It's spontaneous.\nEmployees are experimenting, connecting, automating—and bypassing security while doing it. AI systems are becoming embedded in your SaaS stack without visibility or oversight. And it's creating a new class of shadow integrations—ones that don't show up in traditional threat models.\nIf your current defenses rely on manual tracking, policy enforcement, or user education alone, you're not keeping up.\nLearn How to Adapt—Before Your Next Blind Spot Becomes a Breach\nJoin Dvir Sasson, Director of Security Research at Reco, for \"\nYour AI is Outrunning Your Security. Here's How to Keep Up\n\" — an unfiltered session on what it really takes to maintain AI Security Readiness.\nYou'll walk away with:\nClarity on\nemerging AI-driven threats\ninside SaaS tools you already use\nReal examples of breaches\ncaused by unmonitored AI integrations\nActionable detection and response strategies\nthat forward-thinking companies are using right now\nAI is no longer just a tool—it's a moving part of your operational fabric. The more decentralized and dynamic it becomes, the less your traditional security playbook applies. If you're not accounting for AI's growing presence across your SaaS apps, you're not seeing the full risk surface.\nWatch this Webinar\nAnd when a breach hits your CRM, your boardroom doesn't care how it happened. Just that you didn't see it coming.\nSave Your Seat:\nThis session is for security leaders, IT owners, and SaaS risk managers who want to evolve beyond reactive security—and take proactive control in an AI-powered world.\n👉\nRegister now to reserve your spot\n. Spaces are limited.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Experts Uncover New XorDDoS Controller, Infrastructure as Malware Expands to Docker, Linux, IoT",
        "Link": "https://thehackernews.com/2025/04/experts-uncover-new-xorddos-controller.html",
        "Summary": "Cybersecurity researchers are warning of continued risks posed by a distributed denial-of-service (DDoS) malware known as XorDDoS, with 71.3 percent of the attacks between November 2023 and February 2025 targeting the United States.\n\"From 2020 to 2023, the XorDDoS trojan has increased significantly in prevalence,\" Cisco Talos researcher Joey Chen said in a Thursday analysis.&nbsp;",
        "Date": "2025-04-18",
        "Content": "Cybersecurity researchers are warning of continued risks posed by a distributed denial-of-service (DDoS) malware known as\nXorDDoS\n, with 71.3 percent of the attacks between November 2023 and February 2025 targeting the United States.\n\"From 2020 to 2023, the XorDDoS trojan has increased significantly in prevalence,\" Cisco Talos researcher Joey Chen\nsaid\nin a Thursday analysis.\n\"This trend is not only due to the widespread global distribution of the XorDDoS trojan but also an uptick in malicious DNS requests linked to its command-and-control (C2) infrastructure. In addition to targeting commonly exposed Linux machines, the trojan has expanded its reach to Docker servers, converting infected hosts into bots.\"\nNearly 42 percent of the compromised devices are located in the United States, followed by Japan, Canada, Denmark, Italy, Morocco, and China.\nXorDDoS is a well-known malware that has a track record of striking Linux systems for over a decade. In May 2022, Microsoft\nreported\na significant surge in XorDDoS activity, with the infections paving the way for cryptocurrency mining malware such as Tsunami.\nThe primary initial access pathway entails conducting Secure Shell (SSH) brute-force attacks to obtain valid SSH credentials and then download and install the malware on vulnerable IoT and other internet-connected devices.\nUpon successfully establishing a foothold, the malware sets up persistence using an embedded initialization script and a cron job so that it launches automatically at system startup. It also makes use of the XOR key \"BB2FA36AAA9541F0\" to decrypt a configuration present within itself to extract the IP addresses necessary for C2 communication.\nTalos said it observed in 2024 a new version of the XorDDoS sub-controller, called the\nVIP version\n, and its corresponding central controller, along with a builder, indicating that the product is likely being advertised for sale.\nThe central controller is responsible for managing multiple XorDDoS sub-controllers and sending DDoS commands simultaneously. Each of these sub-controllers, in turn, commandeer a botnet of infected devices.\n\"The language settings of the multi-layer controller, XorDDoS builder, and controller binding tool strongly suggest that the operators are Chinese-speaking individuals,\" Chen said.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "CVE-2025-24054 Under Active Attack—Steals NTLM Credentials on File Download",
        "Link": "https://thehackernews.com/2025/04/cve-2025-24054-under-active.html",
        "Summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Thursday added a medium-severity security flaw impacting Microsoft Windows to its Known Exploited Vulnerabilities (KEV) catalog, following reports of active exploitation in the wild.\nThe vulnerability, assigned the CVE identifier CVE-2025-24054 (CVSS score: 6.5), is a Windows New Technology LAN Manager (NTLM) hash disclosure",
        "Date": "2025-04-18",
        "Content": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Thursday\nadded\na medium-severity security flaw impacting Microsoft Windows to its Known Exploited Vulnerabilities (\nKEV\n) catalog, following reports of active exploitation in the wild.\nThe vulnerability, assigned the CVE identifier\nCVE-2025-24054\n(CVSS score: 6.5), is a Windows New Technology LAN Manager (\nNTLM\n) hash disclosure spoofing bug that was patched by Microsoft last month as part of its Patch Tuesday updates.\nNTLM is a legacy authentication protocol that Microsoft officially deprecated last year in favor of Kerberos. In recent years, threat actors have found various methods to exploit the technology, such as pass-the-hash and relay attacks, to extract NTLM hashes for follow-on attacks.\n\"Microsoft Windows NTLM contains an external control of file name or path vulnerability that allows an unauthorized attacker to perform spoofing over a network,\" CISA said.\nIn a bulletin published in March, Microsoft said the vulnerability could be triggered by minimal interaction with a specially crafted\n.library-ms file\n, such as \"selecting (single-click), inspecting (right-click), or performing an action other than opening or executing the file.\"\nThe tech giant also credited Rintaro Koike with NTT Security Holdings, 0x6rss, and j00sean for discovering and reporting the flaw.\nWhile Microsoft has given CVE-2025-24054 an exploitability assessment of \"Exploitation Less Likely,\" the security flaw has since come under active exploitation since March 19, per Check Point, thereby allowing bad actors to leak NTLM hashes or user passwords and infiltrate systems.\n\"Around March 20–21, 2025, a campaign targeted government and private institutions in Poland and Romania,\" the cybersecurity company\nsaid\n. \"Attackers used malspam to distribute a Dropbox link containing an archive that exploited multiple known vulnerabilities, including CVE-2025-24054, to harvest NTLMv2-SSP hashes.\"\nThe flaw is assessed to be a variant of CVE-2024-43451 (CVSS score: 6.5), which was patched by Microsoft in November 2024 and has also been weaponized in the wild in attacks targeting Ukraine and Colombia by threat actors like\nUAC-0194\nand\nBlind Eagle\n.\nAccording to Check Point, the file is distributed by means of ZIP archives, causing Windows Explorer to initiate an SMB authentication request to a remote server and leak the user's NTLM hash without any user interaction simply upon downloading and extracting the archive's contents.\nThat said, another phishing campaign observed as recently as March 25, 2025, has been found delivering a file named \"Info.doc.library-ms\" without any compression. Since the first wave of attacks, no less than 10 campaigns have been observed with the end goal of retrieving NTLM hashes from the targeted victims.\n\"These attacks leveraged malicious .library-ms files to collect NTLMv2 hashes and escalate the risk of lateral movement and privilege escalation within compromised networks,\" Check Point said.\n\"This rapid exploitation highlights the critical need for organizations to apply patches immediately and ensure that NTLM vulnerabilities are addressed in their environments. The minimal user interaction required for the exploit to trigger and the ease with which attackers can gain access to NTLM hashes make it a significant threat, especially when such hashes can be used in pass-the-hash attacks.\"\nFederal Civilian Executive Branch (FCEB) agencies are required to apply the necessary fixes for the shortcoming by May 8, 2025, to secure their networks in light of active exploitation.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Interlock ransomware gang pushes fake IT tools in ClickFix attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/interlock-ransomware-gang-pushes-fake-it-tools-in-clickfix-attacks/",
        "Summary": "The Interlock ransomware gang now uses ClickFix attacks that impersonate IT tools to breach corporate networks and deploy file-encrypting malware on devices. [...]",
        "Date": "2025-04-18",
        "Content": "The Interlock ransomware gang now uses ClickFix attacks that impersonate IT tools to breach corporate networks and deploy file-encrypting malware on devices.\nClickFix is a social engineering tactic where victims are tricked into executing dangerous PowerShell commands on their systems to supposedly fix an error or verify themselves, resulting in the installation of malware.\nThough this\nisn't the first time\nClickFix has been linked to ransomware infections, confirmation about Interlock shows an increasing trend in these types of threat actors utilizing the tactic.\nInterlock is a ransomware operation launched in late September 2024,\ntargeting FreeBSD servers\nand Windows systems.\nInterlock is not believed to operate as a ransomware-as-a-service model. Still, it maintains a data leak portal on the dark web to increase pressure on victims, demanding payments ranging from hundreds of thousands of dollars to millions.\nFrom ClickFix to ransomware\nIn the past, Interlock utilized fake browser and VPN client updates to install malware and breach networks.\nAccording to\nSekoia researchers\n, the Interlock ransomware gang began utilizing ClickFix attacks in January 2025.\nInterlock used at least four URLs to host fake CAPTCHA prompts that tell visitors to execute a command on their computer to verify themselves and download a promoted tool.\nThe researchers say they detected the malicious captcha on four different sites, mimicking Microsoft or Advanced IP Scanner portals:\nmicrosoft-msteams[.]com/additional-check.html\nmicrostteams[.]com/additional-check.html\necologilives[.]com/additional-check.html\nadvanceipscaner[.]com/additional-check.html\nHowever, only the site impersonating Advanced IP Scanner, a popular IP scanning tool commonly used by IT staff, led to downloading a malicious installer.\nPage hosting Interlock's ClickFix bait\nSource: Sekoia\nClicking the 'Fix it' button copies the malicious PowerShell command to the victim's clipboard. If executed in a command prompt or Windows Run dialog, it will download a 36MB PyInstaller payload.\nAt the same time, the legitimate AdvanceIPScanner website opens in a browser window to reduce suspicion.\nThe malicious payload installs a legitimate copy of the software it pretends to be and simultaneously executes an embedded PowerShell script that runs in a hidden window.\nThis script registers a Run key in Windows Registry for persistence and then collects and exfiltrates system info including OS version, user privilege level, running processes, and available drives.\nSekoia has observed the command and control (C2) responding with various payloads, including LummaStealer, BerserkStealer, keyloggers, and the Interlock RAT.\nThe latter is a simple trojan that can be dynamically configured, supporting file exfiltration, shell command execution, and running malicious DLLs.\nCommands Interlock RAT supports\nSource: Sekoia\nAfter the initial compromise and RAT deployment, Interlock operators used stolen credentials to move laterally via RDP, while Sekoia also saw PuTTY, AnyDesk, and LogMeIn used in some attacks.\nThe last step before the ransomware execution is data exfiltration, with the stolen files uploaded to attacker-controlled Azure Blobs.\nThe Windows variant of Interlock is set (via a scheduled task) to run daily at 08:00 PM, but thanks to file extension-based filtering, this doesn't cause multiple layers of encryption but serves as a redundancy measure.\nSekoia also reports that the ransom note has evolved, too, with the latest versions focusing more on the legal aspect of the data breach and the regulatory consequences if stolen data is made public.\nInterlock's latest ransom note\nSource: BleepingComputer\nClickFix attacks have now been adopted by a wide range of threat actors, including other ransomware gangs and North Korean hackers.\nLast month, Sekoia discovered that the infamous Lazarus North Korean hacking group was using\nClickFix attacks targeting job seekers\nin the cryptocurrency industry.\nRelated Articles:\nNew ClickFix attack deploys Havoc C2 via Microsoft Sharepoint\nVSCode extensions found downloading early-stage ransomware\nHunters International ransomware claims attack on Tata Technologies\nQilin ransomware claims attack at Lee Enterprises, leaks stolen data\nSouthern Water says Black Basta ransomware attack cost £4.5M in expenses"
    },
    {
        "Title": "OpenAI details ChatGPT-o3, o4-mini, o4-mini-high usage limits",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-details-chatgpt-o3-o4-mini-o4-mini-high-usage-limits/",
        "Summary": "OpenAI has launched three new reasoning models - o3, o4-mini, and o4-mini-high for Plus and Pro subscribers, but as it turns out, these models do not offer 'unlimited' usage. [...]",
        "Date": "2025-04-18",
        "Content": "OpenAI has launched three new reasoning models - o3, o4-mini, and o4-mini-high for Plus and Pro subscribers, but as it turns out, these models also have usage limitations.\nIn a\nsupport document\n, OpenAI shed light on how you can use ChatGPT's three new reasoning models.\nIf you subscribe to ChatGPT Plus, you'll get up to 50 messages per week for the o3 model, which is the most powerful reasoning model.\nChatGPT Plus with model selection\nSource: BleepingComputer\nOn the other hand, o4-mini offers 150 messages per day and o4-mini-high (best for coding) offers 50 messages per day.\nThese limitations are only for the most popular ChatGPT $20 Plus plan.\nIf you upgrade to ChatGPT Pro, which costs $200 per month, you'll get \"near unlimited\" access.\nOpenAI\ncalls\nthe Pro plan \"near unlimited\" because you might still hit usage limits in certain cases—such as when your activity appears artificial or violates OpenAI’s terms and conditions, which include:\nAbusive usage, such as automatically or programmatically extracting data.\nSharing your account credentials or making your account available to anyone else.\nReselling access or using ChatGPT to power third-party services.\n\"We have guardrails in place to help prevent misuse and are always working to improve our systems,\" OpenAI noted in the support document.\n\"This may occasionally involve a temporary restriction on your usage.\"\nIf you're on a free plan, you can only try the o4-mini reasoning model by selecting the reason button.\nOther models are not available for free users.\nRelated Articles:\nChatGPT's o4-mini, o4-mini-high and o3 spotted ahead of release\nLeak confirms OpenAI's GPT 4.1 is coming before GPT 5.0\nChatGPT 4.1 early benchmarks compared against Google Gemini\nOpenAI's GPT-4.1, 4.1 nano, and 4.1 mini models release imminent\nOpenAI wants ChatGPT to 'know you over your life' with new Memory update"
    },
    {
        "Title": "FBI: Scammers pose as FBI IC3 employees to 'help' recover lost funds",
        "Link": "https://www.bleepingcomputer.com/news/security/fbi-scammers-pose-as-fbi-ic3-employees-to-help-recover-lost-funds/",
        "Summary": "The FBI warns that scammers posing as FBI IC3 employees are offering to \"help\" fraud victims recover money lost to other scammers. [...]",
        "Date": "2025-04-18",
        "Content": "The FBI warns that scammers impersonating FBI Internet Crime Complaint Center (IC3) employees offer to \"help\" fraud victims recover money lost to other scammers.\nOver the last two years, between December 2023 and February 2025, the FBI said it has received over 100 reports of fraudsters using this tactic.\n\"Complainants report initial contact from the scammers can vary. Some individuals received an email or a phone call, while others were approached via social media or forums,\" the law enforcement agency warned in a\nFriday public service announcement\n.\n\"Almost all complainants indicated the scammers claimed to have recovered the victim's lost funds or offered to assist in recovering funds. However, the claim is a ruse to revictimize those who have already lost money to scams.\"\nIn a recent example of such an impersonation scheme, scammers created female persona profiles on social media networking sites and joined groups for financial fraud victims, pretending to be fellow victims.\nThey then recommended that victims contact \"Jaime Quin,\" who claims to be the Chief Director of IC3, via Telegram. Once contacted, Quin said he had recovered the victims' lost funds, but this was a ploy to gain access to their financial information and revictimize them.\nHow to protect yourself\nTo protect yourself from similar scam attempts, never share sensitive information with individuals you have only met online or over the phone, and don't send them money, gift cards, cryptocurrency, or other financial assets.\nThe FBI added that IC3 employees will never contact victims directly through phone calls, email, social media, mobile apps, or public forums. Additionally, they will never ask for payment to recover stolen funds or refer victims to companies that require payment for fund recovery.\nTwo years ago, the FBI warned of widespread fraud schemes in which\nscammers impersonate government or law enforcement officials\nby spoofing authentic phone numbers and using fake credentials to steal personally identifiable information or extort money from potential victims.\nEarlier this month, the Spanish National Police also arrested half a dozen suspects who contacted the victims of their cryptocurrency investment scam,\nposing as Europol agents or U.K. lawyers\nand claiming they could help them recover the lost funds if they paid what amounted to local tax costs.\nRelated Articles:\nPolice arrests 300 suspects linked to African cybercrime rings\nFBI warnings are true—fake file converters do push malware\nMalware campaign 'DollyWay' breached 20,000 WordPress sites\nUS govt says Americans lost record $12.5 billion to fraud in 2024\nAmericans lost record $10 billion to fraud in 2023, FTC warns"
    },
    {
        "Title": "ASUS warns of critical auth bypass flaw in routers using AiCloud",
        "Link": "https://www.bleepingcomputer.com/news/security/asus-warns-of-critical-auth-bypass-flaw-in-routers-using-aicloud/",
        "Summary": "ASUS is warning about an authentication bypass vulnerability in routers with AiCloud enabled that could allow remote attackers to perform unauthorized execution of functions on the device. [...]",
        "Date": "2025-04-18",
        "Content": "ASUS is warning about an authentication bypass vulnerability in routers with AiCloud enabled that could allow remote attackers to perform unauthorized execution of functions on the device.\nThe vulnerability, tracked under\nCVE-2025-2492\nand rated critical (CVSS v4 score: 9.2), is remotely exploitable via a specially crafted request and requires no authentication, making it particularly dangerous.\n\"An improper authentication control vulnerability exists in certain ASUS router firmware series,\"\nreads the vendor's bulletin\n.\n\"This vulnerability can be triggered by a crafted request, potentially leading to unauthorized execution of functions.\"\nAiCloud is a cloud-based remote access feature built into many ASUS routers, turning them into mini private cloud servers.\nIt allows users to access files stored on USB drives connected to the router from anywhere over the internet, stream media remotely, sync files between home networks and other cloud storage services, and share files with others via links.\nThe vulnerability discovered in AiCloud impacts a broad range of models, with ASUS releasing fixes for multiple firmware branches, including 3.0.0.4_382 series, 3.0.0.4_386 series, 3.0.0.4_388 series, and 3.0.0.6_102 series.\nUsers are recommended to upgrade to the latest firmware version available for their model, which they can find on the vendor's\nsupport portal\nor the\nproduct finder page\n. Detailed instructions on how to apply firmware updates are\navailable here\n.\nASUS also advises users to use distinct passwords to secure their wireless network and router administration page, and make sure they're at least 10 characters long with a mix of letters, numbers, and symbols.\nImpacted users of end-of-life products are advised to disable AiCloud entirely and turn off internet access for WAN, port forwarding, DDNS, VPN server, DMZ, port triggering, and FTP services.\nWhile there are no reports of active exploitation or a public proof-of-concept exploit for CVE-2025-2492, attackers commonly target these flaws to infect devices with malware or recruit them into DDoS swarms.\nTherefore, it is strongly advised that ASUS router users upgrade to the latest firmware as soon as possible.\nRelated Articles:\nHackers exploit WordPress plugin auth bypass hours after disclosure\nNew Mirai botnet behind surge in TVT DVR exploitation\nNewest Ivanti SSRF zero-day now under mass exploitation\nCritical auth bypass bug in CrushFTP now exploited in attacks\nCritical flaw in Next.js lets hackers bypass authorization"
    },
    {
        "Title": "SonicWall SMA VPN devices targeted in attacks since January",
        "Link": "https://www.bleepingcomputer.com/news/security/sonicwall-sma-vpn-devices-targeted-in-attacks-since-january/",
        "Summary": "A remote code execution vulnerability affecting SonicWall Secure Mobile Access (SMA) appliances has been under active exploitation since at least January 2025, according to cybersecurity company Arctic Wolf. [...]",
        "Date": "2025-04-18",
        "Content": "A remote code execution vulnerability affecting SonicWall Secure Mobile Access (SMA) appliances has been under active exploitation since at least January 2025, according to cybersecurity company Arctic Wolf.\nThis security flaw (\nCVE-2021-20035\n) impacts SMA 200, SMA 210, SMA 400, SMA 410, and SMA 500v devices and was patched almost four years ago, in September 2021, when SonicWall said it could only be exploited to take down vulnerable appliances in denial-of-service (DoS) attacks.\nHowever, the company updated the four-year-old security advisory on Monday to\nflag the security bug as exploited in attacks\n, expand the impact to include remote code execution, and upgrade the CVSS severity score from medium to high severity.\n\"This vulnerability is believed to be actively exploited in the wild. As a precautionary measure, SonicWall PSIRT has updated the summary and revised the CVSS score to 7.2,\" SonicWall said.\nSuccessful exploitation can allow remote threat actors with low privileges to exploit an \"improper neutralization of special elements in the SMA100 management interface\" to inject arbitrary commands as a 'nobody' user and execute arbitrary code in low-complexity attacks.\nCISA has also added the vulnerability to its\nKnown Exploited Vulnerabilities catalog\n, confirming\nit's now being abused in the wild\nand ordering Federal Civilian Executive Branch (FCEB) agencies to secure their networks against ongoing attacks until May 7th.\nProduct\nPlatform\nImpacted Version\nFixed version\nSMA 100 Series\n• SMA 200\n• SMA 210\n• SMA 400\n• SMA 410\n• SMA 500v (ESX, KVM, AWS, Azure)\n10.2.1.0-17sv and earlier\n10.2.1.1-19sv and higher\n10.2.0.7-34sv and earlier\n10.2.0.8-37sv and higher\n9.0.0.10-28sv and earlier\n9.0.0.11-31sv and higher\nActively exploited since January\nDays after SonicWall tagged the security bug as exploited in the wild without sharing when the attacks started, cybersecurity company Arctic Wolf reported that threat actors used CVE-2021-20035 exploits in attacks as early as January 2025.\nIn this campaign, the attackers have also used a local super admin account with a \"password\" default password to target SMA 100 appliances with the management interface exposed online.\n\"Arctic Wolf has identified an ongoing VPN credential access campaign targeting SMA 100 series appliances, with a starting timeframe as early as January 2025, extending into April 2025,\"\nthe cybersecurity firm said\n.\n\"One noteworthy aspect of the campaign was the use of a local super admin account (admin@LocalDomain) on these appliances, which has an insecure default password of password.\"\nTo block CVE-2021-20035 attacks targeting their SonicWall appliances, Arctic Wolf advised network defenders to limit VPN access to the minimum necessary accounts, deactivate unneeded accounts, enable multi-factor authentication for all accounts, and reset passwords for all local accounts on SonicWall SMA firewalls.\nIn February, SonicWall also urged customers in January to patch a\ncritical vulnerability affecting SMA1000 secure access gateways\nfollowing reports that it had already been exploited in zero-day attacks and, one month later, warned of an\nactively exploited authentication bypass flaw\nin Gen 6 and Gen 7 firewalls that can let hackers\nhijack VPN sessions\n.\nRelated Articles:\nCISA tags SonicWall VPN flaw as actively exploited in attacks\nIvanti patches Connect Secure zero-day exploited since mid-March\nCritical RCE flaw in Apache Tomcat actively exploited in attacks\nCritical PHP RCE vulnerability mass exploited in new attacks\nCritical Ivanti RCE flaw with public exploit now used in attacks"
    },
    {
        "Title": "Chinese hackers target Russian govt with upgraded RAT malware",
        "Link": "https://www.bleepingcomputer.com/news/security/chinese-hackers-target-russian-govt-with-upgraded-rat-malware/",
        "Summary": "Chinese-speaking IronHusky hackers are targeting Russian and Mongolian government organizations using upgraded MysterySnail remote access trojan (RAT) malware. [...]",
        "Date": "2025-04-18",
        "Content": "Chinese-speaking IronHusky hackers are targeting Russian and Mongolian government organizations using upgraded MysterySnail remote access trojan (RAT) malware.\nSecurity researchers at Kaspersky's Global Research and Analysis Team (GReAT) spotted the updated implant while investigating recent attacks where the attackers deployed the RAT malware using a malicious MMC script camouflaged as a Word document, which downloaded second-stage payloads and gained persistence on compromised systems.\nOne of the malicious payloads is an unknown intermediary backdoor that helps transfer files between the command and control servers and hacked devices, run command shells, create new processes, delete files, and more.\n\"In our telemetry, these files turned out to leave footprints of the MysterySnail RAT malware, an implant we described back in 2021. In observed infection cases, MysterySnail RAT was configured to persist on compromised machines as a service,\"\nKaspersky said\n.\n\"Notably, a short time after we blocked the recent intrusions related to MysterySnail RAT, we observed the attackers to continue conducting their attacks, by deploying a repurposed and more lightweight version of MysterySnail RAT. This version consists of a single component, and that's why we dubbed it MysteryMonoSnail.\"\nAs they found, the upgraded RAT malware supports dozens of commands, allowing attackers to manage services on the compromised device, execute shell commands, spawn and kill processes, and manage files, among other things.\nFirst spotted almost four years ago\nThis latest backdoor version is similar to the original MysterySnail RAT, which Kaspersky\nfirst detected in late August 2021\nin widespread espionage attacks against IT companies, military/defense contractors, and diplomatic entities in Russia and Mongolia.\nAt the time, the IronHusky hacking group was observed deploying the malware on systems compromised using zero-day exploits targeting a Windows Win32k kernel driver vulnerability (\nCVE-2021-40449\n).\nThe Chinese APT was\nfirst spotted by Kaspersky in 2017\nwhile investigating a campaign targeting Russian and Mongolian government entities with the end goal of collecting intelligence on Russian-Mongolian military negotiations.\nOne year later, Kaspersky also\nobserved them\nexploiting a Microsoft Office memory corruption vulnerability (\nCVE-2017-11882\n) to spread RATs typically used by Chinese hacking groups, including PoisonIvy and PlugX.\nThe\nKaspersky report\npublished on Thursday includes indicators of compromise and additional technical details about IronHusky's recent attacks using the MysterySnail RAT.\nRelated Articles:\nNew ResolverRAT malware targets pharma and healthcare orgs worldwide\nMicrosoft: New RAT malware used for crypto theft, reconnaissance\nIvanti zero-day attacks infected devices with custom malware\nWe Smell a (DC)Rat: Revealing a Sophisticated Malware Delivery Chain\nNew Crocodilus malware steals Android users’ crypto wallet keys"
    },
    {
        "Title": "7 Steps to Take After a Credential-Based cyberattack",
        "Link": "https://www.bleepingcomputer.com/news/security/7-steps-to-take-after-a-credential-based-cyberattack/",
        "Summary": "Hackers don't break in—they log in. Credential-based attacks now fuel nearly half of all breaches. Learn how to scan your Active Directory for compromised passwords and stop attackers before they strike. [...]",
        "Date": "2025-04-18",
        "Content": "These days, hackers don't break in — they log in. Using valid credentials, cybercriminals bypass security systems while appearing legitimate to monitoring tools.\nAnd the problem is widespread;\nGoogle Cloud\nreports that weak or nonexistent credential protection facilitates 47% of cloud breaches, while\nIBM X-Force\nattributes nearly one-third of global cyberattacks to account compromises.\nSo what does this mean for your organization’s defenses?\nHere’s what you need to know about how to protect your systems from credential-based attacks, what to do when prevention fails, and why scanning your Active Directory for compromised passwords should be a part of your security strategy.\nWhy credential-based attacks are hackers' preferred method\nCybercriminals favor credential-based attacks for several reasons:\nThey’re easy to execute:\nCredential-based attacks are relatively simple to deploy compared to more complex zero-day exploits.\nThey’re highly successful:\nWith users recycling the same password across multiple accounts, it’s easier for attackers to gain widespread access; one set of keys can unlock many doors.\nThey have a low detection risk:\nBecause they use valid credentials for their exploits, hackers can blend in with normal traffic, allowing them to avoid security alerts.\nThey’re cheap:\nCredential-based attacks require minimal resources but can yield substantial rewards. Hackers can easily (and inexpensively) buy a set of stolen credentials on the dark web, then use free automated tools to test the credentials across multiple systems.\nThey’re versatile:\nCredential-based attacks can be used anywhere credentials are needed, meaning hackers have multiple potential entry points — from web applications to cloud services.\nWhy organizations become targets\nCould your organization be an attractive target for credential-based hackers? If you have any of these security gaps, your systems may be more vulnerable than you think. Here’s what makes organizations prime targets:\nWeak password policies create an open invitation for attackers to easily guess or crack credentials through automated tools and common password lists\nFailure to implement multi-factor authentication leaves even the strongest passwords vulnerable to theft\nInadequate security training makes employees more vulnerable to phishing emails, social engineering tactics, and other attacks\nPoor network segmentation gives hackers open access once they breach a single endpoint\nInsufficient monitoring lets attackers operate undetected for days, weeks, or even months inside your critical systems\nEmployee password reuse amplifies the impact of any breach, as a single stolen credential can unlock multiple systems across personal and corporate environments.\nSecure your Active Directory passwords with Specops Password Policy\nVerizon’s Data Breach Investigation Report found stolen credentials are involved in 44.7% of breaches.\nEffortlessly secure Active Directory with compliant password policies, blocking 4+ billion compromised passwords, boosting security, and slashing support hassles!\nTry it for free\nWhen credentials are compromised: A response scenario\nIf your organization has been the target of a credential-based attack, you know how devastating the aftermath can be. But if you're one of the lucky few that has so far escaped the sights of hackers, here's what it's like:\nIt's 2:37 AM when your phone rings. Your security team has detected unusual login patterns from IP addresses in Eastern Europe — during your company's off-hours. By the time you've logged in remotely, the attacker has accessed multiple sensitive customer files and moved laterally through your network, compromising additional systems.\nThe sinking feeling hits: your organization is experiencing a credential-based attack in real-time. What do you do now?\nImmediate response steps\nWhen credentials fall into the wrong hands and hackers breach your systems, every minute counts — but having a well-rehearsed incident response plan will allow you to minimize damage and recovery time.\nHere are the typical steps organizations follow when responding to an attack:\nInitial detection and alerting.\nThe clock starts ticking as soon as your monitoring tools detect the anomaly and alert your security team — you must move quickly to limit damage.\nAssessment and triage.\nVerify that the alert is legitimate. Then, identify which systems and accounts are impacted, assessing the potential impact on your organization.\nIsolation and containment.\nCut off the hackers’ access points by disconnecting compromised devices from the network. Revoke access to compromised accounts, and segment the network to contain the threat.\nDetailed investigation.\nTrace the attacker’s activities by analyzing logs and forensic data. Identify how hackers compromised credentials, and assess what hackers did while they had access.\nCommunication and notification.\nRemember, transparency breeds trust, while secrecy breeds suspicion. With this in mind, give all relevant stakeholders clear, factual updates, including senior management, legal teams, and affected users.\nEradication and recovery.\nStart rebuilding your security systems, making them stronger.\nReset passwords for all compromised accounts\n, patch exploited vulnerabilities, restore systems from clean backups, and\nimplement multi-factor authentication\n.\nPost-incident review.\nThe best defense against a future attack is learning from a current breach. After a breach, analyze your incident response process, update your response plan, and implement additional security measures based on lessons learned.\nScan your Active Directory to prevent future attacks\nWhile it’s important to quickly respond to credential-based attacks, it’s even more important (and cost-effective) to prevent them altogether. By\nimplementing multi-factor authentication\n, enforcing strong password policies, training your staff regularly,\nauditing you Active Directory frequently\nand properly segmenting your network, you’ll reduce your organization's vulnerability.\nBut these measures aren’t enough if credentials have been compromised in previous breaches. That’s why it’s important to include scanning your Active Directory for compromised passwords in your prevention strategy.\nSpecops Password Policy\ncontinuously scans your Active Directory against a database of over four billion unique compromised passwords. When it identifies employees with breached passwords, the platform immediately prompts them to create new, secure credentials — eliminating a major vulnerability before attackers can exploit it.\nBy combining traditional security measures with active credential monitoring, your organization can shield itself from credential-based attacks. Don't wait until after a breach to secure your systems — identify and remediate password vulnerabilities before attackers exploit them.\nTry Specops Password Policy for free\n.\nSponsored and written by\nSpecops Software\n."
    },
    {
        "Title": "Cisco Webex bug lets hackers gain code execution via meeting links",
        "Link": "https://www.bleepingcomputer.com/news/security/cisco-webex-bug-lets-hackers-gain-code-execution-via-meeting-links/",
        "Summary": "Cisco has released security updates for a high-severity Webex vulnerability that allows unauthenticated attackers to gain client-side remote code execution using malicious meeting invite links. [...]",
        "Date": "2025-04-18",
        "Content": "Cisco has released security updates for a high-severity Webex vulnerability that allows unauthenticated attackers to gain client-side remote code execution using malicious meeting invite links.\nTracked as CVE-2025-20236, this security flaw was found in the Webex custom URL parser and can be exploited by tricking users into downloading arbitrary files, which lets threat actors execute arbitrary commands on systems running unpatched software in low complexity attacks.\n\"This vulnerability is due to insufficient input validation when Cisco Webex App processes a meeting invite link,\" Cisco\nexplained\nin a security advisory released this week.\n\"An attacker could exploit this vulnerability by persuading a user to click a crafted meeting invite link and download arbitrary files. A successful exploit could allow the attacker to execute arbitrary commands with the privileges of the targeted user.\"\nThis security bug impacts Cisco Webex App installations regardless of operating system or system configuration. There are no workarounds, so software updates are required to block potential exploitation attempts.\nCisco Webex App Release\nFirst Fixed Release\n44.5 and earlier\nNot vulnerable.\n44.6\n44.6.2.30589\n44.7\nMigrate to a fixed release.\n44.8 and later\nNot vulnerable.\nThis week, Cisco also released security patches for a privilege escalation flaw (\nCVE-2025-20178\n) in Secure Network Analytics' web-based management interface, which can let attackers with admin credentials run arbitrary commands as root.\nCisco also addressed a Nexus Dashboard vulnerability (\nCVE-2025-20150\n) that allows unauthenticated attackers to enumerate LDAP user accounts remotely and determine which usernames are valid.\nHowever, the company's Product Security Incident Response Team (PSIRT) found no proof-of-concept exploits in the wild and no evidence of malicious activity targeting systems unpatched against security flaws fixed this Wednesday.\nEarlier this month, Cisco also\nwarned admins\nto patch a critical Cisco Smart Licensing Utility (CSLU) static credential vulnerability (CVE-2024-20439) that exposes a built-in backdoor admin account and is\nnow actively exploited in attacks\n.\nIn late March, CISA added the CVE-2024-20439 flaw to its\nKnown Exploited Vulnerabilities Catalog\nand ordered U.S. federal agencies to secure their networks against ongoing attacks within three weeks by April 21.\nRelated Articles:\nSonicWall SMA VPN devices targeted in attacks since January\nCISA tags SonicWall VPN flaw as actively exploited in attacks\nWhatsApp flaw can let attackers run malicious code on Windows PCs\nMax severity RCE flaw discovered in widely used Apache Parquet\nIvanti patches Connect Secure zero-day exploited since mid-March"
    },
    {
        "Title": "Could Ransomware Survive Without Cryptocurrency?",
        "Link": "https://www.darkreading.com/cyber-risk/ransomware-would-adapt-without-cryptocurrency",
        "Summary": "Threat actors would be at least temporarily derailed, experts say. But the real issue ladders back to organizations’ weak cyber hygiene.",
        "Date": "2025-04-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/ransomware-would-adapt-without-cryptocurrency"
    },
    {
        "Title": "AWWA Supports Introduction of Collaborative Cybersecurity Legislation",
        "Link": "https://www.darkreading.com/ics-ot-security/awwa-introduction-cybersecurity-legislation",
        "Summary": "No summary available",
        "Date": "2025-04-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/ics-ot-security/awwa-introduction-cybersecurity-legislation"
    },
    {
        "Title": "Organizations Fix Less Than Half of All Exploitable Vulnerabilities, With Just 21% of GenAI App Flaws Resolved",
        "Link": "https://www.darkreading.com/application-security/organizations-fix-less-than-half-vulnerabilities",
        "Summary": "No summary available",
        "Date": "2025-04-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/organizations-fix-less-than-half-vulnerabilities"
    },
    {
        "Title": "Attackers and Defenders Lean on AI in Identity Fraud Battle",
        "Link": "https://www.darkreading.com/cyber-risk/fraudsters-increasingly-use-ai-companies-look-ai",
        "Summary": "Identity verification, insurance claims, and financial services are all seeing surges in AI-enabled fraud, but organizations are taking advantage of AI systems to fight fire with fire.",
        "Date": "2025-04-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/fraudsters-increasingly-use-ai-companies-look-ai"
    },
    {
        "Title": "Chinese APT Mustang Panda Debuts 4 New Attack Tools",
        "Link": "https://www.darkreading.com/cloud-security/chinese-apt-mustang-panda-4-attack-tools",
        "Summary": "The notorious nation-state-backed threat actor has added two new keyloggers, a lateral movement tool, and an endpoint detection and response (EDR) evasion driver to its arsenal.",
        "Date": "2025-04-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/chinese-apt-mustang-panda-4-attack-tools"
    },
    {
        "Title": "CISA Weighs In on Alleged Oracle Cloud Breach",
        "Link": "https://www.darkreading.com/cloud-security/cisa-alleged-oracle-cloud-breach",
        "Summary": "The agency is recommending that organizations and individuals implement its recommendations to prevent the misuse of stolen data, though Oracle has yet to publicly do the same for its customers.",
        "Date": "2025-04-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/cisa-alleged-oracle-cloud-breach"
    },
    {
        "Title": "If Boards Don't Fix OT Security, Regulators Will",
        "Link": "https://www.darkreading.com/ics-ot-security/boards-fix-ot-security-regulators",
        "Summary": "Around the world, governments are setting higher-bar regulations with clear corporate accountability for breaches on the belief organizations won't drive up security maturity for operational technology unless they're made to.",
        "Date": "2025-04-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/ics-ot-security/boards-fix-ot-security-regulators"
    },
    {
        "Title": "Apple Zero-Days Under 'Sophisticated Attack,' but Details Lacking",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/apple-zero-days-sophisticated-attacks",
        "Summary": "The technology giant said two zero-day vulnerabilities were used in attacks on iOS devices against &quot;specific targeted individuals,&quot; which suggests spyware or nation-state threat activity.",
        "Date": "2025-04-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/apple-zero-days-sophisticated-attacks"
    },
    {
        "Title": "The Shadow AI Surge: Study Finds 50% of Workers Use Unapproved AI Tools",
        "Link": "https://www.securityweek.com/the-shadow-ai-surge-study-finds-50-of-workers-use-unapproved-ai-tools/",
        "Summary": "<p>With unapproved AI tools entrenched in daily workflows, experts say it’s time to shift from monitoring to managing Shadow AI use across the enterprise.</p>\n<p>The post <a href=\"https://www.securityweek.com/the-shadow-ai-surge-study-finds-50-of-workers-use-unapproved-ai-tools/\">The Shadow AI Surge: Study Finds 50% of Workers Use Unapproved AI Tools</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/the-shadow-ai-surge-study-finds-50-of-workers-use-unapproved-ai-tools/"
    },
    {
        "Title": "In Other News: 4chan Hacked, Android Auto-Reboot, Nemesis Admin Charged",
        "Link": "https://www.securityweek.com/in-other-news-4chan-hacked-android-auto-reboot-nemesis-admin-charged/",
        "Summary": "<p>Noteworthy stories that might have slipped under the radar: 4chan hacked, auto-reboot security feature coming to Android, Iranian administrator of Nemesis charged in US.</p>\n<p>The post <a href=\"https://www.securityweek.com/in-other-news-4chan-hacked-android-auto-reboot-nemesis-admin-charged/\">In Other News: 4chan Hacked, Android Auto-Reboot, Nemesis Admin Charged</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/in-other-news-4chan-hacked-android-auto-reboot-nemesis-admin-charged/"
    },
    {
        "Title": "Cy4Data Labs Raises $10 Million to Secure Data in Use",
        "Link": "https://www.securityweek.com/cy4data-labs-raises-10-million-to-secure-data-in-use/",
        "Summary": "<p>Data protection firm Cy4Data Labs has raised $10 million in a Series A funding round led by Pelion Venture Partners.</p>\n<p>The post <a href=\"https://www.securityweek.com/cy4data-labs-raises-10-million-to-secure-data-in-use/\">Cy4Data Labs Raises $10 Million to Secure Data in Use</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cy4data-labs-raises-10-million-to-secure-data-in-use/"
    },
    {
        "Title": "Events Giant Legends International Hacked",
        "Link": "https://www.securityweek.com/live-events-giant-legends-international-hacked/",
        "Summary": "<p>Legends International says the personal information of employees and customers was compromised as a result of a cyberattack.</p>\n<p>The post <a href=\"https://www.securityweek.com/live-events-giant-legends-international-hacked/\">Events Giant Legends International Hacked</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/live-events-giant-legends-international-hacked/"
    },
    {
        "Title": "Ahold Delhaize Confirms Data Stolen in Ransomware Attack",
        "Link": "https://www.securityweek.com/ahold-delhaize-confirms-data-stolen-in-ransomware-attack/",
        "Summary": "<p>Ahold Delhaize has confirmed that data was stolen from its systems in November 2024 after a ransomware group claimed the attack.</p>\n<p>The post <a href=\"https://www.securityweek.com/ahold-delhaize-confirms-data-stolen-in-ransomware-attack/\">Ahold Delhaize Confirms Data Stolen in Ransomware Attack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/ahold-delhaize-confirms-data-stolen-in-ransomware-attack/"
    },
    {
        "Title": "Fresh Windows NTLM Vulnerability Exploited in Attacks",
        "Link": "https://www.securityweek.com/fresh-windows-ntlm-vulnerability-exploited-in-attacks/",
        "Summary": "<p>A Windows NTLM vulnerability patched in March has been exploited in attacks targeting government and private institutions.</p>\n<p>The post <a href=\"https://www.securityweek.com/fresh-windows-ntlm-vulnerability-exploited-in-attacks/\">Fresh Windows NTLM Vulnerability Exploited in Attacks</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-04-18",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/fresh-windows-ntlm-vulnerability-exploited-in-attacks/"
    }
]