[
    {
        "Title": "Pre-Auth Exploit Chains Found in Commvault Could Enable Remote Code Execution Attacks",
        "Link": "https://thehackernews.com/2025/08/pre-auth-exploit-chains-found-in.html",
        "Summary": "Commvault has released updates to address four security gaps that could be exploited to achieve remote code execution on susceptible instances.\nThe list of vulnerabilities, identified in Commvault versions before 11.36.60, is as follows -\n\nCVE-2025-57788 (CVSS score: 6.9) - A vulnerability in a known login mechanism allows unauthenticated attackers to execute API calls without requiring user",
        "Date": "2025-08-21",
        "Content": "Commvault has released updates to address four security gaps that could be exploited to achieve remote code execution on susceptible instances.\nThe list of vulnerabilities, identified in Commvault versions before 11.36.60, is as follows -\nCVE-2025-57788\n(CVSS score: 6.9) - A vulnerability in a known login mechanism allows unauthenticated attackers to execute API calls without requiring user credentials\nCVE-2025-57789\n(CVSS score: 5.3) - A vulnerability during the setup phase between installation and the first administrator login that allows remote attackers to exploit the default credentials to gain admin control\nCVE-2025-57790\n(CVSS score: 8.7) - A path traversal vulnerability that allows remote attackers to perform unauthorized file system access through a path traversal issue, resulting in remote code execution\nCVE-2025-57791\n(CVSS score: 6.9) - A vulnerability that allows remote attackers to inject or manipulate command-line arguments passed to internal components due to insufficient input validation, resulting in a valid user session for a low-privilege role\nwatchTowr Labs researchers Sonny Macdonald and Piotr Bazydlo have been credited with discovering and reporting the four security defects in April 2025. All the flagged vulnerabilities have been resolved in versions 11.32.102 and 11.36.60. Commvault SaaS solution is not affected.\nIn an\nanalysis\npublished Wednesday, the cybersecurity company said threat actors could fashion these vulnerabilities into two pre-authenticated exploit chains to achieve code execution on susceptible instances: One that combines CVE-2025-57791 and CVE-2025-57790, and the other that strings CVE-2025-57788, CVE-2025-57789, and CVE-2025-57790.\nIt's worth noting that the second pre-auth remote code execution chain becomes successful only if the built-in admin password hasn't been changed since installation.\nThe disclosure comes nearly four months after watchTowr Labs reported a critical Commvault Command Center flaw (\nCVE-2025-34028\n, CVSS score: 10.0) that could allow arbitrary code execution on affected installations.\nA month later, the U.S. Cybersecurity and Infrastructure Security Agency (CISA)\nadded\nthe vulnerability to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation in the wild.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Cybercriminals Deploy CORNFLAKE.V3 Backdoor via ClickFix Tactic and Fake CAPTCHA Pages",
        "Link": "https://thehackernews.com/2025/08/cybercriminals-deploy-cornflakev3.html",
        "Summary": "Threat actors have been observed leveraging the deceptive social engineering tactic known as ClickFix to deploy a versatile backdoor codenamed CORNFLAKE.V3.\nGoogle-owned Mandiant described the activity, which it tracks as UNC5518, as part of an access-as-a-service scheme that employs fake CAPTCHA pages as lures to trick users into providing initial access to their systems, which is then",
        "Date": "2025-08-21",
        "Content": "Threat actors have been observed leveraging the deceptive social engineering tactic known as\nClickFix\nto deploy a versatile backdoor codenamed CORNFLAKE.V3.\nGoogle-owned Mandiant\ndescribed\nthe activity, which it tracks as UNC5518, as part of an access-as-a-service scheme that employs fake CAPTCHA pages as lures to trick users into providing initial access to their systems, which is then monetized by other threat groups.\n\"The initial infection vector, dubbed ClickFix, involves luring users on compromised websites to copy a malicious PowerShell script and execute it via the Windows Run dialog box,\" Google\nsaid\nin a report published today.\nThe access provided by UNC5518 is assessed to be leveraged by at least two different hacking groups, UNC5774 and UNC4108, to initiate a multi-stage infection process and drop additional payloads -\nUNC5774, another financially motivated group that delivers CORNFLAKE as a way to deploy various subsequent payloads\nUNC4108, a threat actor with unknown motivation that uses PowerShell to deploy tools like VOLTMARKER and NetSupport RAT\nThe attack chain likely begins with the victim landing a fake CAPTCHA verification page after interacting with search results that employ search engine optimization (SEO) poisoning or malicious ads.\nThe user is then tricked into running a malicious PowerShell command by launching the Windows Run dialog, which then executes the next-stage dropper payload from a remote server. The newly downloaded script checks if it's running within a virtualized environment and ultimately launches CORNFLAKE.V3.\nObserved in both JavaScript and PHP versions, CORNFLAKE.V3 is a backdoor that supports the execution of payloads via HTTP, including executables, dynamic-link libraries (DLLs), JavaScript files, batch scripts, and PowerShell commands. It can also collect basic system information and transmit it to an external server. The traffic is proxied through Cloudflare tunnels in an attempt to avoid detection.\n\"CORNFLAKE.V3 is an updated version of CORNFLAKE.V2, sharing a significant portion of its codebase,\" Mandiant researcher Marco Galli said. \"Unlike V2, which functioned solely as a downloader, V3 features host persistence via a registry Run key, and supports additional payload types.\"\nBoth generations are markedly different from their progenitor, a C-based downloader that uses TCP sockets for command-and-control (C2) communications and only has the ability to run DLL payloads.\nPersistence on the host is achieved by means of Windows Registry changes. At least three different payloads are delivered via CORNFLAKE.V3. This comprises an Active Directory reconnaissance utility, a script to harvest credentials via Kerberoasting, and another backdoor referred to as WINDYTWIST.SEA, a C version of WINDYTWIST that supports relaying TCP traffic, providing a reverse shell, executing commands, and removing itself.\nSelect versions of WINDYTWIST.SEA have also been observed attempting to move laterally in the network of the infected machine.\n\"To mitigate malware execution through ClickFix, organizations should disable the Windows Run dialog box where possible,\" Galli said. \"Regular simulation exercises are crucial to counter this and other social engineering tactics. Furthermore, robust logging and monitoring systems are essential for detecting the execution of subsequent payloads, such as those associated with CORNFLAKE.V3.\"\nUSB Infection Drops XMRig Miner\nThe disclosure comes as the threat intelligence firm detailed an ongoing campaign that employs USB drives to infect other hosts and deploy cryptocurrency miners since September 2024.\n\"This demonstrates the continued effectiveness of initial access via infected USB drives,\" Mandiant\nsaid\n. \"The low cost and ability to bypass network security make this technique a compelling option for attackers.\"\nThe attack chain starts when a victim is tricked into executing a Windows shortcut (LNK) in the compromised USB drive. The LNK file results in the execution of a Visual Basic script also located in the same folder. The script, for its part, launches a batch script to initiate the infection -\nDIRTYBULK\n, a C++ DLL launcher to initiate the execution of other malicious components, such as CUTFAIL\nCUTFAIL\n, a C++ malware dropper responsible for decrypting and installing malware onto a system, such as HIGHREPS and PUMPBENCH, as well as third-libraries like OpenSSL, libcurl, and WinPthreadGC\nHIGHREPS\n, a downloader that retrieves additional files to ensure persistence of PUMPBENCH\nPUMPBENCH\n, a C++ backdoor that facilitates reconnaissance, provides remote access by communicating with a PostgreSQL database server, and download XMRig\nXMRig\n, an an open-source software for mining cryptocurrencies such as Monero, Dero, and Ravencoin\n\"PUMPBENCH spreads by infecting USB drives,\" Mandiant said. \"It scans the system for available drives and then creates a batch file, a VBScript file, a shortcut file, and a DAT file.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Weak Passwords and Compromised Accounts: Key Findings from the Blue Report 2025",
        "Link": "https://thehackernews.com/2025/08/weak-passwords-and-compromised-accounts.html",
        "Summary": "As security professionals, it's easy to get caught up in a race to counter the latest advanced adversary techniques. Yet the most impactful attacks often aren't from cutting-edge exploits, but from cracked credentials and compromised accounts. Despite widespread awareness of this threat vector, Picus Security's Blue Report 2025 shows that organizations continue to struggle with preventing",
        "Date": "2025-08-21",
        "Content": "As security professionals, it's easy to get caught up in a race to counter the latest advanced adversary techniques. Yet the most impactful attacks\noften aren't from cutting-edge exploits, but from cracked credentials and compromised accounts\n. Despite widespread awareness of this threat vector, Picus Security's\nBlue Report 2025\nshows that organizations continue to struggle with\npreventing password cracking attacks\nand\ndetecting the malicious use of compromised accounts\n.\nWith the first half of 2025 behind us,\ncompromised valid accounts remain the most underprevented attack vector\n, highlighting the urgent need for a\nproactive approach focused on the threats that are evading organizations' defenses.\nA Wake-Up Call: The Alarming Rise in Password Cracking Success\nThe\nPicus Blue Report\nis an annual research publication that analyzes how well organizations are preventing and detecting real-world cyber threats. Unlike traditional reports that focus solely on threat trends or survey data, the Blue Report is based on\nempirical findings from over 160 million attack simulations\nconducted within organizations' networks around the world, using the\nPicus Security Validation Platform\n.\nIn the\nBlue Report 2025\n, Picus Labs found that\npassword cracking attempts succeeded in 46% of tested environments\n, nearly doubling the success rate from last year. This sharp increase highlights a fundamental weakness in how organizations are managing – or mismanaging – their password policies.\nWeak passwords\nand\noutdated hashing algorithms\ncontinue to leave critical systems vulnerable to attackers using\nbrute-force\nor\nrainbow table attacks\nto crack passwords and gain unauthorized access.\nGiven that password cracking is one of the\noldest and most reliably effective attack methods\n, this finding points to a serious issue: in their race to combat the latest, most sophisticated new breed of threats,\nmany organizations are failing to enforce strong basic password hygiene policies while failing to adopt and integrate modern authentication practices into their defenses\n.\nWhy Organizations Are Failing to Prevent Password Cracking Attacks\nSo, why are organizations still failing to prevent password cracking attacks? The root cause lies in the\ncontinued use of weak passwords\nand\noutdated credential storage methods\n. Many organizations still rely on easily guessable passwords and weak hashing algorithms, often without using proper salting techniques or multi-factor authentication (MFA).\nIn fact, our survey results showed that\n46% of environments\nhad at least one password hash cracked\nand converted to cleartext, highlighting the inadequacy of many password policies, particularly for\ninternal accounts\n, where controls are often more lax than they are for their external counterparts.\nTo combat this, organizations must\nenforce stronger password policies\n,\nimplement multi-factor authentication (MFA) for all users\n, and\nregularly validate their credential defenses\n. Without these improvements, attackers will continue to compromise valid accounts, obtaining easy access to critical systems.\nCredential-Based Attacks: A Silent but Devastating Threat\nThe threat of\ncredential abuse\nis both pervasive and dangerous, yet as the\nBlue Report 2025\nhighlights, organizations are still\nunderprepared\nfor this form of attack. And once attackers obtain valid credentials, they can\neasily move laterally\n,\nescalate privileges\n, and\ncompromise critical systems\n.\nInfostealers\nand\nransomware groups\nfrequently rely on stolen credentials to\nspread across networks\n, burrowing deeper and deeper, often\nwithout triggering detection\n. This\nstealthy movement\nwithin the network allows attackers to\nmaintain long dwell times\n, undetected, while they\nexfiltrate data at will\n.\nDespite this ongoing and well-known issue, organizations continue to prioritize perimeter defenses, often leaving\nidentity and credential protection\noverlooked and under-funded as a result. This year's Blue Report clearly shows that\nvalid account abuse\nis at the core of modern cyberattacks, reinforcing the urgent need for a stronger focus on\nidentity security\nand\ncredential validation\n.\nValid Accounts (T1078): The Most Exploited Path to Compromise\nOne of the key findings in the\nBlue Report 2025\nis that\nValid Accounts (MITRE ATT&CK T1078)\nremains the\nmost exploited attack technique\n, with a truly concerning\n98% success rate\n. This means that once attackers gain access to valid credentials, whether through\npassword cracking\nor\ninitial access brokers\n, they can swiftly move through an organization's network, often bypassing traditional defenses.\nThe use of\ncompromised credentials\nis particularly effective because it allows attackers to\noperate under the radar\n, making it harder for security teams to detect malicious activity. Once inside, they can\naccess sensitive data\n,\ndeploy malware\n, or\ncreate new attack paths\n, all while seamlessly blending in with legitimate user activity.\nHow to Strengthen Your Defenses Against Credential Abuse and Password Cracking\nTo protect against increasingly effective attacks, organizations should\nimplement stronger password policies\nand enforce\ncomplexity requirements\n, while eliminating outdated hashing algorithms in favor of more secure alternatives. It is also essential to\nadopt multi-factor authentication (MFA)\nfor all sensitive accounts, ensuring that even if credentials do become compromised, attackers can't just use them to access the network without an additional verification step.\nRegularly validating\ncredential defenses\nthrough\nsimulated attacks\nis crucial to identifying vulnerabilities and ensuring that your controls are performing as expected. Organizations also need to\nenhance their behavioral detection capabilities\nto catch\nanomalous activities\ntied to credential abuse and lateral movement.\nAdditionally, monitoring and inspecting\noutbound traffic\nfor signs of\ndata exfiltration\nand ensuring that\ndata loss prevention (DLP) measures\nare both in place and operating effectively are critical to protecting your sensitive information.\nClosing the Gaps in Credential and Password Management\nThe findings in the Blue Report 2025 show that, unfortunately, many organizations are still vulnerable to the silent threat of\npassword cracking\nand\ncompromised accounts\n. And while strengthening perimeter defenses continues to be a priority, it's also clear that\ncore weaknesses lie in credential management and internal controls\n. The report also highlighted the fact that\ninfostealers\nand\nransomware groups\nare leveraging these gaps effectively.\nIf you're ready to take proactive steps to\nharden your security posture\n,\nreduce your exposure\n, and\nprioritize your critical vulnerabilities\n, the\nBlue Report 2025\noffers invaluable insights to show you where to focus. And at\nPicus Security\n, we're always happy to talk about helping your organization meet its specific security needs..\nDon't forget to get your copy of\nThe Blue Report 2025\nand take proactive steps today to improve your security posture.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Hackers Using New QuirkyLoader Malware to Spread Agent Tesla, AsyncRAT and Snake Keylogger",
        "Link": "https://thehackernews.com/2025/08/hackers-using-new-quirkyloader-malware.html",
        "Summary": "Cybersecurity researchers have disclosed details of a new malware loader called QuirkyLoader that's being used to deliver via email spam campaigns an array of next-stage payloads ranging from information stealers to remote access trojans since November 2024.\nSome of the notable malware families distributed using QuirkyLoader include Agent Tesla, AsyncRAT, Formbook, Masslogger, Remcos RAT,",
        "Date": "2025-08-21",
        "Content": "Cybersecurity researchers have disclosed details of a new malware loader called\nQuirkyLoader\nthat's being used to deliver via email spam campaigns an array of next-stage payloads ranging from information stealers to remote access trojans since November 2024.\nSome of the notable malware families distributed using QuirkyLoader include\nAgent Tesla\n,\nAsyncRAT\n,\nFormbook\n,\nMasslogger\n,\nRemcos RAT\n,\nRhadamanthys Stealer\n, and\nSnake Keylogger\n.\nIBM X-Force, which detailed the malware, said the attacks involve sending spam emails from both legitimate email service providers and a self-hosted email server. These emails feature a malicious archive, which contains a DLL, an encrypted payload, and a real executable.\n\"The actor uses DLL side-loading, a technique where launching the legitimate executable also loads the malicious DLL,\" security researcher Raymond Joseph Alfonso\nsaid\n. \"This DLL, in turn, loads, decrypts, and injects the final payload into its target process.\"\nThis is achieved by using process hollowing to inject the malware into one of the three processes: AddInProcess32.exe, InstallUtil.exe, or aspnet_wp.exe.\nThe DLL loader, per IBM, has been used in limited campaigns for the past few months, with two campaigns observed in July 2025 targeting Taiwan and Mexico.\nThe campaign targeting Taiwan is said to have specifically singled out employees of Nusoft Taiwan, a network and internet security research company based in New Taipei City, with the goal of infecting them with Snake Keylogger, which is capable of stealing sensitive information from popular web browsers, keystrokes, and clipboard content.\nThe Mexico-related campaign, on the other hand, is assessed to be random, with the infection chains delivering Remcos RAT and AsyncRAT.\n\"The threat actor consistently writes the DLL loader module in .NET languages and uses ahead-of-time (AOT) compilation,\" Alfonso said. \"This process compiles the code into native machine code before execution, making the resulting binary appear as though it were written in C or C++.\"\nNew Phishing Trends\nThe development comes as threat actors are using new QR code phishing (aka quishing) tactics like splitting malicious QR codes into two parts or embedding them within legitimate ones in email messages propagated via phishing kits like\nGabagool\nand Tycoon, respectively, to evade detection, demonstrating ongoing evolution.\n\"Malicious QR codes are popular with attackers for several reasons,\" Barracuda researcher Rohit Suresh Kanase\nsaid\n. \"They cannot be read by humans so don't raise any red flags, and they can often bypass traditional security measures such as email filters and link scanners.\"\n\"Furthermore, since recipients often have to switch to a mobile device to scan the code, it can take users out of the company security perimeter and away from protection.\"\nThe findings also follow the emergence of a phishing kit used by the\nPoisonSeed\nthreat actor to acquire credentials and two-factor authentication (2FA) codes from individuals and organizations to gain access to victims' accounts and use them to send emails for carrying out cryptocurrency scams.\n\"The domains hosting this phishing kit impersonate login services from prominent CRM and bulk email companies like Google, SendGrid, Mailchimp, and likely others, targeting individuals' credentials,\" NVISO Labs\nsaid\n. \"PoisonSeed employs spear-phishing emails embedding malicious links, which redirect victims to their phishing kit.\"\nA noteworthy aspect of the kit is the use of a technique known as\nprecision-validated phishing\nin which the attacker validates an email address in real-time in the background, while a fake Cloudflare Turnstile challenge is served to the user. Once the checks are passed, a login form impersonating the legitimate online platform appears, allowing the threat actors to capture submitted credentials and then relay them to the service.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Scattered Spider Hacker Gets 10 Years, $13M Restitution for SIM Swapping Crypto Theft",
        "Link": "https://thehackernews.com/2025/08/scattered-spider-hacker-gets-10-years.html",
        "Summary": "A 20-year-old member of the notorious cybercrime gang known as Scattered Spider has been sentenced to ten years in prison in the U.S. in connection with a series of major hacks and cryptocurrency thefts.\nNoah Michael Urban pleaded guilty to charges related to wire fraud and aggravated identity theft back in April 2025. News of Urban's sentencing was reported by Bloomberg and Jacksonville news",
        "Date": "2025-08-21",
        "Content": "A 20-year-old member of the notorious cybercrime gang known as\nScattered Spider\nhas been\nsentenced\nto\nten years\nin prison in the U.S. in connection with a series of major hacks and cryptocurrency thefts.\nNoah Michael Urban\npleaded guilty\nto charges related to wire fraud and aggravated identity theft back in April 2025. News of Urban's sentencing was reported by\nBloomberg\nand Jacksonville news outlet\nNews4JAX\n.\nIn addition, 120 months in federal prison, Urban faces an additional three years of supervised release and has been ordered to pay $13 million in restitution to victims. In a statement\nshared\nwith security journalist Brian Krebs, Urban called the sentence unjust.\nUrban, who also went by the aliases Sosa, Elijah, King Bob, Gustavo Fring, and Anthony Ramirez, was\narrested\nby U.S. authorities in Florida in January 2024 for committing wire fraud and aggravated identity theft between August 2022 and March 2023. These incidents led to the theft of at least $800,000 from at least five different victims, per the U.S. Department of Justice (DoJ).\nProsecutors said Urban and his co-conspirators engaged in SIM swapping attacks to hijack victims' cryptocurrency accounts and plunder the digital assets.\nLater that November, the DoJ\nunsealed\ncriminal charges against Urban and four other members of Scattered Spider for using social engineering techniques to target employees of companies across the U.S. and to break into corporate networks and steal proprietary data and to siphon millions of dollars in cryptocurrency.\nTyler Robert Buchanan, who is among those indicted, was extradited from Spain to the U.S. in April following his\narrest\nin the European nation last June.\nThe development comes as Scattered Spider has\njoined forces\nwith other threat groups ShinyHunters and LAPSUS$ to form a new cybercrime alliance. The group, associated with a broader English-speaking cybercriminal collective called The Com, has a history of conducting social engineering, credential theft, and SIM swapping, initial access, ransomware deployment, data theft, and extortion attacks.\n\"Scattered Spider has historically leaned on tactics that generate urgency, drive media and industry attention, create fear of exposure, and help force victims to payout quicker,\" Adam Darrah, vice president of intelligence at ZeroFox, told The Hacker News in a statement.\n\"Timed leaks, countdown threats, and taunts directed at security firms are all part of their playbook. They have ties to a wider network of like-minded actors, which has given them access to more tools, data, and infrastructure, multiplying their effectiveness. We regularly see groups team up when there is an increase in external pressures, like law enforcement crackdowns. To survive, these groups need to consolidate. And the result is often a more versatile and potentially dangerous combined operation.\"\nCybersecurity firm Flashpoint, which published a profile of Scattered Spider last week, said the financially-motivated hacking group adopts a wave-like approach by choosing a specific sector and attacking as many organizations within that vertical over a short span of time.\n\"The tactics employed by Scattered Spider demonstrate their ability to exploit weaknesses in security programs by targeting people rather than strictly systems or technical vulnerabilities,\" it\nsaid\n. \"Their use of social engineering, via vishing, smishing, and MFA fatigue attacks, proves that even the most advanced technical defenses can be circumvented through human deception.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Apple Patches CVE-2025-43300 Zero-Day in iOS, iPadOS, and macOS Exploited in Targeted Attacks",
        "Link": "https://thehackernews.com/2025/08/apple-patches-cve-2025-43300-zero-day.html",
        "Summary": "Apple has released security updates to address a security flaw impacting iOS, iPadOS, and macOS that it said has come under active exploitation in the wild.\nThe zero-day out-of-bounds write vulnerability, tracked as CVE-2025-43300, resides in the ImageIO framework that could result in memory corruption when processing a malicious image.\n\"Apple is aware of a report that this issue may have been",
        "Date": "2025-08-21",
        "Content": "Apple has released security updates to address a security flaw impacting iOS, iPadOS, and macOS that it said has come under active exploitation in the wild.\nThe zero-day out-of-bounds write vulnerability, tracked as CVE-2025-43300, resides in the\nImageIO framework\nthat could result in memory corruption when processing a malicious image.\n\"Apple is aware of a report that this issue may have been exploited in an extremely sophisticated attack against specific targeted individuals,\" the company said in an advisory.\nThe iPhone maker said the bug was internally discovered and that it was addressed with improved bounds checking. The following versions address the security defect -\niOS 18.6.2 and iPadOS 18.6.2\n- iPhone XS and later, iPad Pro 13-inch, iPad Pro 12.9-inch 3rd generation and later, iPad Pro 11-inch 1st generation and later, iPad Air 3rd generation and later, iPad 7th generation and later, and iPad mini 5th generation and later\niPadOS 17.7.10\n- iPad Pro 12.9-inch 2nd generation, iPad Pro 10.5-inch, and iPad 6th generation\nmacOS Ventura 13.7.8\n- Macs running macOS Ventura\nmacOS Sonoma 14.7.8\n- Macs running macOS Sonoma\nmacOS Sequoia 15.6.1\n- Macs running macOS Sequoia\nIt's currently not known who is behind the attacks and who may have been targeted, but it's likely that the vulnerability has been weaponised as part of highly targeted attacks.\nWith the latest update, Apple has so far fixed a total of seven zero-days that have been abused in real-world attacks since the start of the year:\nCVE-2025-24085\n,\nCVE-2025-24200\n,\nCVE-2025-24201\n,\nCVE-2025-31200, CVE-2025-31201\n, and\nCVE-2025-43200\n.\nLast month, the company also issued patches for a Safari vulnerability residing in an open-source component (\nCVE-2025-6558\n) that Google reported as having been exploited as a zero-day in the Chrome web browser.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Dev gets 4 years for creating kill switch on ex-employer's systems",
        "Link": "https://www.bleepingcomputer.com/news/security/dev-gets-4-years-for-creating-kill-switch-on-ex-employers-systems/",
        "Summary": "A software developer has been sentenced to four years in prison for sabotaging his ex-employer's Windows network with custom malware and a kill switch that locked out employees when his account was disabled. [...]",
        "Date": "2025-08-21",
        "Content": "A software developer has been sentenced to four years in prison for sabotaging his ex-employer's Windows network with custom malware and a kill switch that locked out employees when his account was disabled.\nDavis Lu, 55, a Chinese national living legally in Houston, worked for an Ohio-based company, reportedly Eaton Corporation, from 2007 until his termination in 2019.\nAfter a corporate restructuring and subsequent demotion in 2018, the DOJ says that Lu retaliated by embedding malicious code throughout the company's Windows production environment.\nThe malicious code included an infinite Java thread loop designed to overwhelm servers and crash production systems.\nLu also created a kill switch named \"IsDLEnabledinAD\" (\"Is Davis Lu enabled in Active Directory\") that would automatically lock all users out of their accounts if his account was disabled in Active Directory.\nWhen his employment was terminated on September 9, 2019, and his account disabled, the kill switch activated, causing thousands of users to be locked out of their systems.\n\"The defendant breached his employer’s trust by using his access and technical knowledge to sabotage company networks, wreaking havoc and causing hundreds of thousands of dollars in losses for a U.S. company,\" said Acting Assistant Attorney General Matthew R. Galeotti.\nWhen he was instructed to return his laptop, Lu reportedly deleted encrypted data from his device. Investigators later discovered search queries on the device researching how to elevate privileges, hide processes, and quickly delete files.\nLu was found\nguilty earlier this year\nof intentionally causing damage to protected computers. After his four-year sentence, Lu will also serve three years of supervised release following his prison term.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nUK sentences “serial hacker” of 3,000 sites to 20 months in prison\nMozilla warns of phishing attacks targeting add-on developers\nWoman gets 8 years for aiding North Koreans infiltrate 300 US firms\nNew wave of ‘fake interviews’ use 35 npm packages to spread malware"
    },
    {
        "Title": "Colt confirms customer data stolen as Warlock ransomware auctions files",
        "Link": "https://www.bleepingcomputer.com/news/security/colt-confirms-customer-data-stolen-as-warlock-ransomware-auctions-files/",
        "Summary": "UK-based telecommunications company Colt Technology Services confirms that customer documentation was stolen as Warlock ransomware gang auctions files. [...]",
        "Date": "2025-08-21",
        "Content": "UK-based telecommunications company Colt Technology Services confirms that customer documentation was stolen as Warlock ransomware gang auctions files.\nThe British telecommunications and network services provider previously disclosed it suffered an attack on August 12, but this is the first time they confirmed data had been stolen.\n\"A criminal group has accessed certain files from our systems that may contain information related to our customers and posted the document titles on the dark web,\" reads an updated\nsecurity incident advisory\non Colt's site.\n\"We understand that this is concerning for you.\"\n\"Customers are able to request a list of filenames posted on the dark web from the dedicated call centre.\"\nAs first spotted by cybersecurity expert\nKevin Beaumont\n, Colt added the no-index HTML meta tag to the web page, making it so it won't be indexed by search engines.\nThis statement comes after the Warlock Group began selling on the Ramp cybercrime forum what they claim is 1 million documents stolen from Colt. The documents are being sold for $200,000 and allegedly contain financial information, network architecture data, and customer information.\nThreat actor's post on a Ramp hacker forum\nSource:\nKELA\nBleepingComputer can confirm that the Tox ID listed in the forum post matches an ID used in earlier versions of the ransomware gang's ransom notes.\nThe Warlock Group (aka Storm-2603) is a ransomware gang attributed to Chinese threat actors who utilize the leaked LockBit Windows and Babuk VMware ESXi encryptors in attacks.\nWhen the ransomware gang launched in March 2025, they used LockBit ransomware notes in their attacks, customized to include a Tox ID for ransom negotiations.\nIn June, the ransomware gang branded itself as the \"Warlock Group,\" with customized ransom notes and dark web negotiation and data leak sites.\nLast month, Microsoft reported that the\nthreat actors were exploiting a SharePoint vulnerability\nto breach corporate networks and deploy ransomware.\nIn negotiations seen by BleepingComputer, the ransomware gang demands ransom ranging between $450,000 and millions of dollars.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nColt Telecom attack claimed by WarLock ransomware, data up for sale\nCanada’s House of Commons investigating data breach after cyberattack\nJohnson Controls starts notifying people affected by 2023 breach\nRetail giant Ahold Delhaize says data breach affects 2.2 million people\nChange Healthcare hacked using stolen Citrix account with no MFA"
    },
    {
        "Title": "Europol confirms $50,000 Qilin ransomware reward is fake",
        "Link": "https://www.bleepingcomputer.com/news/security/europol-confirms-that-qilin-ransomware-reward-is-fake/",
        "Summary": "Europol has confirmed that a Telegram channel impersonating the agency and offering a $50,000 reward for information on two Qilin ransomware administrators is fake. The impostor later admitted it was created to troll researchers and journalists. [...]",
        "Date": "2025-08-21",
        "Content": "Europol has confirmed that a Telegram channel impersonating the agency and offering a $50,000 reward for information on two Qilin ransomware administrators is fake. The impostor later admitted it was created to troll researchers and journalists.\n\"We were also surprised to see this story gaining traction,\" Europol told BleepingComputer on Monday. \"The announcement didn't come from us.\"\nThe statement comes after a new Telegram channel called @europolcti was created on August 16th, claiming to offer a $50,000 reward for information on two Qilin ransomware admins known as \"Haise\" and \"XORacle\".\n\"During the course of ongoing international investigations, we have confirmed that the cybercriminal group Qilin has carried out ransomware attacks worldwide, severely disrupting critical infrastructure and causing significant financial losses,\" reads the imposter's Telegram post.\n\"We have identified two primary administrators operating under the aliases Haise and XORacle, who coordinate affiliates and oversee extortion activities.\"\n\"We are actively pursuing all available leads in cooperation with international partners.\"\n\"A reward of up to $50,000 is offered for information that directly leads to the identification or location of these administrators.\"\nFake Europol CTI post offering Qilin ransomware bounty\nSource: BleepingComputer\nHaise is believed to be one of the operators of the Qilian ransomware gang, previously\nrecruiting affiliates\non the RAMP cybercrime forum.\nThe Qilin ransomware operation was initially launched as \"Agenda\" in August 2022. However, by September that year, it had rebranded under the name Qilin, which it continues to use to this day.\nThe ransomware operation is one of the most active, currently targeting companies worldwide.\nHowever, after Europol confirmed it was fake, a new post appeared on the imposter channel claiming it was created to troll researchers and journalists, some of whom wrote articles about the claims.\n\"This was so easy to run and fool so called 'Researchers' and 'Journalists' that just copy stuff.. Thank you all!,\" reads the new post.\nPost claiming fake reward was to troll researchers and journalists\nSource: BleepingComputer\nThe post was signed by Rey, a hacker previously linked to breaches at\nTelefonica\nand\nOrange Group\n.\nThreat actors had begun trolling Qilin in August 15th posts on a Telegram channel set up by threat actors claiming to be from \"Scattered Spider\", \"ShinyHunters\", and \"Lapsus,\" where someone had begun calling out Haise and the ransomware operation.\nThis is not the first time threat actors attempted to mislead the media about cybercrime.\nIn 2021, a RAMP admin known as 'Orange' or 'boriselcin' and who ran the \"Groove\" ransomware site, called on threat actors to attack the USA. This threat actor was later\nsanctioned by the US\nfor his involvement in three ransomware operations that targeted victims across the United States.\nAfter the media covered this post,\nincluding BleepingComputer\n, the threat actor claimed it was fake and was created to troll and manipulate the media and security researchers.\nHowever, security researchers from\nMcAfee and Intel 471 believe\nthat it was likely the threat actor trying to cover up for a failed ransomware-as-a-service.\nIn 2023, BleepingComputer receieved a \"tip\" about an alleged arrest of two Canadian teens over a crypto-theft attack.\nWhile BleepingComputer learned that the news was fake and did not\ncover the story\n, we were told it was done to manipulate the media and \"troll\" the people accused of the theft.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nPharma firm Inotiv says ransomware attack impacted operations\nNew Phobos and 8base ransomware decryptor recover files for free\nColt confirms customer data stolen as Warlock ransomware auctions files\nChange Healthcare hacked using stolen Citrix account with no MFA\nU.S. seizes $2.8 million in crypto from Zeppelin ransomware operator"
    },
    {
        "Title": "Microsoft asks customers for feedback on reported SSD failures",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-asks-customers-for-feedback-on-ssd-failure-issues/",
        "Summary": "​Microsoft is seeking further information from customers who reported failure and data corruption issues affecting their solid-state drives (SSDs) and hard disk drives (HDDs) after installing the August 2025 security update. [...]",
        "Date": "2025-08-21",
        "Content": "​Microsoft is seeking further information from customers who reported failure and data corruption issues affecting their solid-state drives (SSDs) and hard disk drives (HDDs) after installing the August 2025 security update.\nMicrosoft\ntold BleepingComputer\non Wednesday that it is aware of reports that installing the\nKB5063878\nsecurity update is causing SSD and HDD data corruption and failure issues.\nIn a service alert seen by BleepingComputer, the company added that it couldn't reproduce the issue on up-to-date Windows 11 24H2 systems and is now attempting to collect user reports with additional information from those affected.\n\"We are actively working with our storage device partners to try to reproduce the issue. At the time of this publication, neither internal testing nor telemetry have identified an increase in disk failure or file corruption,\" the company said.\n\"In addition, Microsoft customer support teams haven't received reports of customers experiencing this issue. If you are experiencing this issue, please contact Support for Business or use the Feedback Hub to file a report.\nThe company is also investigating if this issue is Microsoft's fault and has promised to provide an update when more details are available.\nReportedly impacts multiple SSD and HDD models\nThis issue was\nfirst reported\nlast week by a Japanese PC builder who saw SSDs disappear from the OS during heavy write operations (like writing large files or many files at once) to drives that were over 60% full on devices with the\nKB5062660\npreview update or this month's Windows 11 24H2 security update installed.\nOther users\nhave encountered the same issue\non systems with Corsair Force MP600, Maxio SSD, SanDisk Extreme Pro, Kioxia Exceria Plus G4, Kioxia M.2, and various other drives with Phison and InnoGrit controllers.\nA spokesperson for NAND controller maker Phison also shared a statement with BleepingComputer on Wednesday, saying that the company is \"working with Microsoft to resolve the issue.\"\n\"Phison has recently been made aware of the industry-wide effects of the 'KB5063878' and 'KB5062660' updates on Windows 11 that potentially impacted several storage devices, including some supported by Phison,\" a Phison spokesperson told BleepingComputer.\n\"We understand the disruption this may have caused and promptly engaged industry stakeholders. [..] At this time, the controllers that may have been affected are under review and we are working with partners.\"\nUntil the issue is addressed, Windows users should avoid writing large files (tens of gigabytes) and extract large compressed files with many items (e.g., 200 files of 200 MB each) in several steps rather than all at once.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nMicrosoft reportedly fixing SSD failures caused by Windows updates\nMicrosoft fixes Windows 11 24H2 updates failing with 0x80240069 error\nWindows 11 24H2 updates failing again with 0x80240069 errors\nMicrosoft asks users to ignore certificate enrollment errors\nMicrosoft fixes known issue that breaks Windows 11 updates"
    },
    {
        "Title": "Why Certified VMware Pros Are Driving the Future of IT",
        "Link": "https://www.bleepingcomputer.com/news/security/why-certified-vmware-pros-are-driving-the-future-of-it/",
        "Summary": "From hybrid cloud to AI, IT complexity and security risks are accelerating. Certified VMware pros bring clarity and resilience that keep teams ahead. See why CIOs are making certification a workforce strategy with VMUG. [...]",
        "Date": "2025-08-21",
        "Content": "By Brenda Emerson, VMUG President\nIT isn't getting any simpler. For many, the cloud’s gone hybrid, AI’s moved in permanently, and security threats seem to evolve faster than the tech built to stop them.\nBut what’s at the forefront of all of this? People.\nThe IT teams configuring, troubleshooting, deploying, and defending. And the IT staff that take the extra step to get certified are becoming some of the most valuable assets in modern enterprise.\nThe Certification Advantage: It's More Than a LinkedIn Update\nThere was a time when a VMware certification looked nice on a resume. Now? It’s a powerful differentiator for both the individual and the organization that backs them.\nVMware certifications aren’t about memorizing trivia—they’re about proving capability, clarity, and consistency. Certified professionals don’t guess their way through a workload migration or a network segmentation plan. They execute with purpose. When I’m leading my team through tough calls, I rely on that expertise to help make smart decisions.\nHackers and security risks aren’t slowing down, but neither is my team. It’s my job to ensure they have the muscle-memory and expertise to use every part of our VMware ecosystem to solve these threats in real-time.\nWhy Smart Teams Are Getting Certified Together\nThis isn’t just about additional skills for a few team members. More and more tech leaders are going big and certifying entire teams.\nWhy? Because when everyone speaks the same technical language, innovation doesn’t get stalled at the handoff.\nIt builds empowered teams which are critical as you’re navigating complex IT and security issues.\nTeam-wide certification\ndoesn’t just make your environment more resilient; it makes your talent more loyal, more tuned-in and better prepared to handle the threats to their ecosystems.\nSecure Your Team. Strengthen Your Strategy.\nWith VMUG Advantage, give your team the tools to get VMware certified and access personal-use licenses to build powerful home labs as they test and expand their expertise in the VMware ecosystem, keeping them engaged and ready for whatever challenges come their way.\nCertify Your Team Today!\nStrategic Certification Is the New Standard\nCIOs and CTOs are increasingly building certification into their workforce strategy as a core component of operational excellence. And that’s where VMUG can come in.\nVMUG is more than a user group, we’re a global community where folks can learn from one another, connect and go deeper to solve more complex tech problems. Whether you’re upskilling one engineer or elevating an entire ops team, we’re here to help you go further, faster.\nAnd the good news? We have a path to getting VMware certified that includes access to home-lab licenses that can be a game-changer for IT professionals and teams.\nWhether you start your VMUG experience by consuming\non-demand security content\nor you want the best we have to offer out of the gate as a\nVMUG Advantage member\n, you’ll find a home with VMUG.\nSponsored and written by\nVMUG\n."
    },
    {
        "Title": "FBI warns of Russian hackers exploiting 7-year-old Cisco flaw",
        "Link": "https://www.bleepingcomputer.com/news/security/fbi-warns-of-russian-hackers-exploiting-cisco-flaw-in-critical-infrastructure-attacks/",
        "Summary": "The Federal Bureau of Investigation (FBI) has warned that hackers linked to Russia's Federal Security Service (FSB) are targeting critical infrastructure organizations in attacks exploiting a 7-year-old vulnerability in Cisco devices. [...]",
        "Date": "2025-08-21",
        "Content": "The Federal Bureau of Investigation (FBI) has warned that hackers linked to Russia's Federal Security Service (FSB) are targeting critical infrastructure organizations in attacks exploiting a 7-year-old vulnerability in Cisco devices.\nThe FBI's public service announcement states that the state-backed hacking group,\nlinked to the FSB's Center 16 unit\nand tracked as Berserk Bear (also known as Blue Kraken, Crouching Yeti, Dragonfly, and Koala Team), has been targeting Cisco networking devices using CVE-2018-0171 exploits to breach organizations worldwide.\nSuccessful exploitation of CVE-2018-0171, a critical vulnerability in the Smart Install feature of Cisco IOS and Cisco IOS XE software, can allow unauthenticated threat actors to remotely trigger a reload of unpatched devices, potentially resulting in a denial-of-service (DoS) condition or enabling the attackers to execute arbitrary code on the targeted device.\n\"In the past year, the FBI detected the actors collecting configuration files for thousands of networking devices associated with US entities across critical infrastructure sectors. On some vulnerable devices, the actors modified configuration files to enable unauthorized access to those devices,\" the\nFBI said\n.\n\"The actors used the unauthorized access to conduct reconnaissance in the victim networks, which revealed their interest in protocols and applications commonly associated with industrial control systems.\"\nThe same hacking group has previously targeted the networks of US state, local, territorial, and tribal (SLTT) government organizations and aviation entities over the last decade.\nAdmins urged to patch as soon as possible\nCisco, which first detected attacks targeting the CVE-2018-0171 flaw in November 2021, updated its advisory on Wednesday,\nurging administrators\nto secure their devices against ongoing attacks as soon as possible.\nCisco Talos, the company's cybersecurity division,\nsaid\nthat the Russian threat group it tracks as Static Tundra has been aggressively exploiting CVE-2018-0171 in this campaign to compromise unpatched devices belonging to telecommunications, higher education, and manufacturing organizations across North America, Asia, Africa, and Europe.\nThe attackers were also observed using custom SNMP tooling that enables them to gain persistence on compromised devices and evade detection for years, as well as the SYNful Knock firmware implant,\nfirst spotted in 2015\nby FireEye.\n\"The threat extends beyond Russia's operations — other state-sponsored actors are likely conducting similar network device compromise campaigns, making comprehensive patching and security hardening critical for all organizations,\" Cisco Talos added.\n\"Threat actors will continue to abuse devices which remain unpatched and have Smart Install enabled.\"\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nCisco warns of max severity flaw in Firewall Management Center\nPro-Russian hackers blamed for water dam sabotage in Norway\nFBI warns of scammers posing as crypto exchange employees\nCurly COMrades cyberspies hit govt orgs with custom malware\nDetails emerge on WinRAR zero-day attacks that infected PCs with malware"
    },
    {
        "Title": "Scattered Spider hacker gets sentenced to 10 years in prison",
        "Link": "https://www.bleepingcomputer.com/news/security/scattered-spider-hacker-gets-sentenced-to-10-years-in-prison/",
        "Summary": "Noah Michael Urban, a key member of the Scattered Spider cybercrime collective, was sentenced to 10 years in prison on Wednesday after pleading guilty to charges of wire fraud and conspiracy in April. [...]",
        "Date": "2025-08-21",
        "Content": "Noah Michael Urban, a key member of the Scattered Spider cybercrime collective, was sentenced to 10 years in prison on Wednesday after pleading guilty to charges of wire fraud and conspiracy\nin April\n.\nHe was arrested\nin January 2024\n, and in November, the U.S. Justice Department\ncharged Urban\n(also known as King Bob, Gustavo Fring, Elijah, and Sosa), along with four other suspects linked to the same financially motivated cybercrime group. The charges included wire fraud, conspiracy to commit wire fraud, and aggravated identity theft.\nAccording to\ncourt documents\n, they were able to steal millions from cryptocurrency wallets between September 2021 and April 2023, using credentials stolen in SMS phishing attacks targeting dozens of individuals and companies.\nThey also used credentials stolen from hacked companies' employees to loot confidential data, including databases, personal identifying information, as well as \"confidential work product, intellectual property\" from their systems.\nAll this stolen information was later used to hijack victims' email accounts in SIM swap attacks, allowing them to gain control of their phone numbers and cryptocurrency wallets to transfer millions to wallets under their control.\nIn a May 2023 interview with investigators, Urban stated that he had made \"several million dollars\" from cryptocurrency theft between January 2021 and March 2023, in addition to being involved in the theft of several million more, adding he still had a few million left after losing most of his earnings on gambling sites.\nNoah Michael Urban (Volusia County Sheriff's Office)\nAs\nNews4Jax first reported\n, Urban received a 120-month prison sentence, despite prosecutors having only requested eight years, and will also be required to pay $13 million in restitution to the victims.\nWhen investigative journalist Brian Krebs\ncontacted Urban on Twitter\nafter the sentencing, Urban responded from a county jail in Florida, stating that he believed the sentence was unjust. He argued that the judge had not considered his age as a mitigating factor because another Scattered Spider member had hacked the judge during the case.\nThe Scattered Spider cybercrime collective\nScattered Spider\n(also tracked as\n0ktapus\n,\nScatter Swine\n,\nUNC3944\n, and\nMuddled Libra\n, among others) is a fluid collective of threat actors known for sophisticated social engineering attacks targeting high-profile organizations worldwide and for using a wide range of tactics, including phishing, SIM swapping, and multi-factor authentication (MFA) bombing.\nTheir attacks escalated in September 2023, when they breached\nMGM Resorts\nand encrypted more than 100 VMware ESXi hypervisors using BlackCat ransomware after gaining access by impersonating an employee.\nIn some cases, Scattered Spider members have also partnered with ransomware operations, such as\nQilin\n,\nRansomHub\n, and\nDragonForce\n.\nHigh-profile organizations targeted by Scattered Spider in recent years include\nTwilio\n,\nCoinbase\n,\nDoorDash\n,\nCaesars\n,\nMailChimp\n,\nRiot Games\n, and\nReddit\n. More recently, the threat actors have shifted their focus from targeting\nretail\nand\ninsurance companies\nto\nthe aviation and transportation industries\n.\nU.K. police\narrested another member of Scattered Spider\nin July 2024, a 17-year-old suspect believed to have been involved in the 2023\nMGM Resorts ransomware attack\n. In December 2024, U.S. authorities\narrested another teenager\n(a\n19-year-old known online as \"remi\" also\nlinked to Scattered Spider),\ncharging him with breaching a U.S. financial institution and two unnamed telecommunications firms.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nAI website builder Lovable increasingly abused for malicious activity\nUK sentences “serial hacker” of 3,000 sites to 20 months in prison\nHackers leak Allianz Life data stolen in Salesforce attacks\nGoogle confirms data breach exposed potential Google Ads customers' info\nScattered Spider is running a VMware ESXi hacking spree"
    },
    {
        "Title": "Orange Belgium discloses data breach impacting 850,000 customers",
        "Link": "https://www.bleepingcomputer.com/news/security/orange-belgium-discloses-data-breach-impacting-850-000-customers/",
        "Summary": "Orange Belgium, a subsidiary of telecommunications giant Orange Group, disclosed on Wednesday that attackers who breached its systems in July have stolen the data of approximately 850,000 customers. [...]",
        "Date": "2025-08-21",
        "Content": "Orange Belgium, a subsidiary of telecommunications giant Orange Group, disclosed on Wednesday that attackers who breached its systems in July have stolen the data of approximately 850,000 customers.\nOrange Belgium provides fixed and mobile connectivity services to over 3 million customers in Belgium and Luxembourg, employs 1,500 staff, and claims to operate the largest 4G/5G network in the country. Last year, the company reported total service revenues of €1.34 billion.\nWhen BleepingComputer reached out on Wednesday for more details regarding last month's breach, an Orange Belgium spokesperson stated that the company couldn't confirm whether any systems were encrypted during the incident, but said that the breach wasn't the result of\nattacks targeting telecom companies worldwide\nthat have been linked to\nChina's Salt Typhoon cyber-espionage group\n.\nThe spokesperson added that Orange Belgium is aware of the threat group behind the breach, but didn't name them due to an ongoing investigation.\n\"At the end of July, Orange Belgium detected a cyberattack on one of its IT systems, resulting in unauthorised access to certain data from 850,000 customer accounts,\" the\ntelecom company revealed\n.\nWhile the threat actors didn't gain access to the passwords, email addresses, or financial information of impacted customers, they were able to compromise systems containing\nsome account information\n.\n\"However, the hacker gained access to one of our IT systems containing the following data: surname, first name, telephone number, SIM card number, PUK code, tariff plan,\" it added.\nOrange Belgium is notifying all customers affected by this incident via email or SMS, advising them to remain vigilant for any suspicious messages or calls because fraudsters could use the stolen information to impersonate Orange or another company and trick them into sharing other sensitive data like passwords and banking information.\"\nBleepingComputer was also told that this breach is a separate incident from the\ncyberattack disclosed by Orange Group\nat the end of July, when its parent company announced that it had detected a breached system on its network on July 25.\nThe Orange Group breach in July led to some operational disruptions, but they primarily affected French customers.\nIn February, Orange's Romanian branch also\nconfirmed the breach of a non-critical application\nafter a threat actor claimed to have stolen thousands of internal documents, containing 380,000 email addresses, as well as employee data, user records, source code, invoices, and contracts.\nFive years ago, in early July 2020, the telecom giant's Orange Business Solutions division\nwas also hit by a Nefilim ransomware attack\n, which exposed the data of twenty of its enterprise customers.\nOrange Group, the parent company of Orange Belgium, has 125,800 employees worldwide and reported revenues of €40.3 billion in 2024. It provides communication and business services to 294 million customers across Europe, Africa, and the Middle East, including 256 million mobile and 22 million fixed broadband customers.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nColumbia University data breach impacts nearly 870,000 individuals\nNY Business Council discloses data breach affecting 47,000 people\nBouygues Telecom confirms data breach impacting 6.4 million customers\nFrench telecom giant Orange discloses cyberattack\nHacker leaks Telefónica data allegedly stolen in a new breach"
    },
    {
        "Title": "System Shocks? EV Smart Charging Tech Poses Cyber-Risks",
        "Link": "https://www.darkreading.com/iot/ev-smart-charging-cyber-risks",
        "Summary": "Trend Micro's Salvatore Gariuolo talks with the Black Hat USA 2025 News Desk about how the new ISO 15118 standard for electric vehicle smart charging and vehicle-to-grid communications can be weaponized by threat actors.",
        "Date": "2025-08-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/iot/ev-smart-charging-cyber-risks"
    },
    {
        "Title": "Scattered Spider Member Sentenced to a Decade in Prison",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/scattered-spider-member-prison",
        "Summary": "Noah Michael Urban, 20, was one of several members of the Scattered Spider collective who were arrested and charged in 2024 in connection with high-profile cyberattacks.",
        "Date": "2025-08-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/scattered-spider-member-prison"
    },
    {
        "Title": "Easy ChatGPT Downgrade Attack Undermines GPT-5 Security",
        "Link": "https://www.darkreading.com/application-security/chatgpt-downgrade-attack-gpt-5-security",
        "Summary": "By using brief, plain clues in their prompts that are likely to influence the app to query older models, a user can downgrade ChatGPT for malicious ends.",
        "Date": "2025-08-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/chatgpt-downgrade-attack-gpt-5-security"
    },
    {
        "Title": "Why Video Game Anti-Cheat Systems Are a Cybersecurity Goldmine",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/video-game-anti-cheat-systems-cybersecurity-goldmine",
        "Summary": "Sam Collins and Marius Muench of the University of Birmingham, UK, join the Black Hat USA 2025 News Desk to explain how anti-cheat systems in video games provide valuable lessons on defending against threat actors' techniques and strategies.",
        "Date": "2025-08-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/video-game-anti-cheat-systems-cybersecurity-goldmine"
    },
    {
        "Title": "How Architectural Controls Help Can Fill the AI Security Gap",
        "Link": "https://www.darkreading.com/cybersecurity-operations/architectural-controls-ai-security-gap",
        "Summary": "NCC Group's David Brauchler III shared how foundational controls and threat modeling strategies can help secure agentic AI tools in ways traditional guardrails can't.",
        "Date": "2025-08-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/architectural-controls-ai-security-gap"
    },
    {
        "Title": "Hackers Abuse VPS Infrastructure for Stealth, Speed",
        "Link": "https://www.darkreading.com/application-security/hackers-abuse-vps-infrastructure-stealth-speed",
        "Summary": "New research highlights how threat actors abuse legitimate virtual private server offerings in order to spin up infrastructure cheaply, quietly, and fast.",
        "Date": "2025-08-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/hackers-abuse-vps-infrastructure-stealth-speed"
    },
    {
        "Title": "K-12 School Incident Response Plans Fall Short",
        "Link": "https://www.darkreading.com/endpoint-security/without-preparedness-k-12-school-incident-plans-fall-short",
        "Summary": "Quick recovery relies on three security measures.",
        "Date": "2025-08-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/without-preparedness-k-12-school-incident-plans-fall-short"
    },
    {
        "Title": "Tree of AST: A Bug-Hunting Framework Powered by LLMs",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/tree-ast-bug-hunting-framework-llms",
        "Summary": "Teenaged security researchers Sasha Zyuzin and Ruikai Peng discuss how their new vulnerability discovery framework leverages LLMs to address limitations of the past.",
        "Date": "2025-08-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/tree-ast-bug-hunting-framework-llms"
    },
    {
        "Title": "Prepping the Front Line for MFA Social Engineering Attacks",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/prepping-front-line-mfa-social-engineering-attacks",
        "Summary": "Attackers will continue to evolve, and the help desk will always be a target. But with the right mix of training, support, and trust, frontline agents can become your biggest security assets.",
        "Date": "2025-08-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/prepping-front-line-mfa-social-engineering-attacks"
    },
    {
        "Title": "Tailing Hackers, Columbia University Uses Logging to Improve Security",
        "Link": "https://www.darkreading.com/threat-intelligence/tailing-hackers-columbia-university-logging-improve-security",
        "Summary": "Logging netflows provided valuable insight about attacker tactics during a breach by state-sponsored hackers targeting Columbia's research labs.",
        "Date": "2025-08-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/tailing-hackers-columbia-university-logging-improve-security"
    },
    {
        "Title": "DARPA: Closing the Open Source Security Gap With AI",
        "Link": "https://www.darkreading.com/cloud-security/darpa-closing-open-source-security-gap-ai",
        "Summary": "DARPA's Kathleen Fisher discusses the AI Cyber Challenge at DEF CON 33, and the results that proved how automation can help patch vulnerabilities at scale.",
        "Date": "2025-08-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/darpa-closing-open-source-security-gap-ai"
    },
    {
        "Title": "Hacktivist Tied to Multiple Cyber Groups Sentenced to Jail",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/hacktivist-sentenced-jail",
        "Summary": "At one point, Al-Tahery Al-Mashriky was hacking thousands of websites within the span of three months while stealing personal data and sensitive information.",
        "Date": "2025-08-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/hacktivist-sentenced-jail"
    },
    {
        "Title": "DPRK, China Suspected in South Korean Embassy Attacks",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/china-dprk-south-korean-embassy-attacks",
        "Summary": "Detailed spear-phishing emails sent to European government entities in Seoul are being tied to North Korea, China, or both.",
        "Date": "2025-08-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/china-dprk-south-korean-embassy-attacks"
    },
    {
        "Title": "SIM-Swapper, Scattered Spider Hacker Gets 10 Years",
        "Link": "https://krebsonsecurity.com/2025/08/sim-swapper-scattered-spider-hacker-gets-10-years/",
        "Summary": "A 21-year-old Florida man at the center of a prolific cybercrime group known as \"Scattered Spider\" was sentenced to 10 years in federal prison today, and ordered to pay roughly $13 million in restitution to victims.\n\nNoah Michael Urban of Palm Coast, Fla. pleaded guilty in April 2025 to charges of wire fraud and conspiracy. Florida prosecutors alleged Urban conspired with others to steal at least $800,000 from five victims via SIM-swapping attacks that diverted their mobile phone calls and text messages to devices controlled by Urban and his co-conspirators.",
        "Date": "2025-08-21",
        "Content": "A 20-year-old Florida man at the center of a prolific cybercrime group known as “Scattered Spider” was sentenced to 10 years in federal prison today, and ordered to pay roughly $13 million in restitution to victims.\nNoah Michael Urban of Palm Coast, Fla. pleaded guilty in April 2025 to charges of wire fraud and conspiracy. Florida prosecutors alleged Urban conspired with others to steal at least $800,000 from five victims via SIM-swapping attacks that diverted their mobile phone calls and text messages to devices controlled by Urban and his co-conspirators.\nA booking photo of Noah Michael Urban released by the Volusia County Sheriff.\nAlthough prosecutors had asked for Urban to serve eight years, Jacksonville news outlet News4Jax.com reports the federal judge in the case today opted to sentence Urban to 120 months in federal prison, ordering him to pay $13 million in restitution and undergo three years of supervised release after his sentence is completed.\nIn November 2024 Urban was charged by federal prosecutors in Los Angeles as one of five members of Scattered Spider (a.k.a. “Oktapus,” “Scatter Swine” and “UNC3944”), which specialized in SMS and voice phishing attacks that tricked employees at victim companies into entering their credentials and one-time passcodes at phishing websites. Urban pleaded guilty to one count of conspiracy to commit wire fraud in the California case, and the $13 million in restitution is intended to cover victims from both cases.\nThe targeted SMS scams spanned several months during the summer of 2022, asking employees to click a link and log in at a website that mimicked their employer’s Okta authentication page. Some SMS phishing messages told employees their VPN credentials were expiring and needed to be changed; other missives advised employees about changes to their upcoming work schedule.\nThat phishing spree netted Urban and others access to more than 130 companies, including Twilio, LastPass, DoorDash, MailChimp, and Plex. The government says the group used that access to steal proprietary company data and customer information, and that members also phished people to steal millions of dollars worth of cryptocurrency.\nFor many years, Urban’s online hacker aliases “King Bob” and “Sosa” were fixtures of the Com, a mostly Telegram and Discord-based community of English-speaking cybercriminals wherein hackers boast loudly about high-profile exploits and hacks that almost invariably begin with social engineering. King Bob constantly bragged on the Com about stealing unreleased rap music recordings from popular artists, presumably through SIM-swapping attacks. Many of those purloined tracks or “grails” he later sold or gave away on forums.\nNoah “King Bob” Urban, posting to Twitter/X around the time of his sentencing today.\nSosa also was active in a particularly destructive group of accomplished criminal SIM-swappers known as “Star Fraud.” Cyberscoop’s AJ Vicens reported in 2023 that individuals within Star Fraud were likely involved in the high-profile Caesars Entertainment and MGM Resorts extortion attacks that same year.\nThe Star Fraud SIM-swapping group gained the ability to temporarily move targeted mobile numbers to devices they controlled by constantly phishing employees of the major mobile providers. In February 2023, KrebsOnSecurity published data taken from the Telegram channels for Star Fraud and two other SIM-swapping groups showing these crooks focused on SIM-swapping T-Mobile customers, and that they collectively claimed internal access to T-Mobile on 100 separate occasions over a 7-month period in 2022.\nReached via one of his King Bob accounts on Twitter/X, Urban called the sentence unjust, and said the judge in his case discounted his age as a factor.\n“The judge purposefully ignored my age as a factor because of the fact another Scattered Spider member hacked him personally during the course of my case,” Urban said in reply to questions, noting that he was sending the messages from a Florida county jail. “He should have been removed as a judge much earlier on. But staying in county jail is torture.”\nA court transcript (PDF) from a status hearing in February 2025 shows Urban was telling the truth about the hacking incident that happened while he was in federal custody. It involved an intrusion into a magistrate judge’s email account, where a copy of Urban’s sealed indictment was stolen. The judge told attorneys for both sides that a co-defendant in the California case was trying to find out about Mr. Urban’s activity in the Florida case.\n“What it ultimately turned into a was a big faux pas,” Judge Harvey E. Schlesinger said. “The Court’s password…business is handled by an outside contractor. And somebody called the outside contractor representing Judge Toomey saying, ‘I need a password change.’ And they gave out the password change. That’s how whoever was making the phone call got into the court.”\n\r\n         This entry was posted on Wednesday 20th of August 2025 09:47 PM \r\n         \nfree sosa\nJohn, what a great idea.  We should free him.  Let’s do that in say…. 2035.\nThrow sosa into solitary.\nToo bad! Do the crime do the time. Your age is irrelevant!\nWhy is it that these guys have no problem with loudly boasting about their exploits which do a lot of damage and hurt many people, but when they get caught and given a long prison sentence, they immediately start whining like babies? Any why should a judge take his age into account and give him a lighter sentence? Sure, he’s still only 20 (and that’s a shame in itself) but he knows exactly what he’s doing.\nPoor thing being tortured in a county jail. He’s lucky he’s not in a state prison instead. If you can’t do the time, dude, don’t do the crime.\nSo the judge, who it seems like legally should’ve recused himself from the case, went far above what the prosecutor recommended and didn’t give a downward variance for this thief who was arrested at 18? That does seem to be a valid point that the hacker made. Why is he being asked to pay restitution to people not involved? 10 years for a white collar crime seems excessive when compared to similar white collar crimes, and even moreso when looking at murderes and rapists getting less time on average. Make that kid use his brain to help the govt, not throw him in prison for a decade to rot to make an example out of him.\nI’m sorry, but the govt has enough criminals as is. They have no need for another one. This group was not exploiting something terribly technical, but instead used good old social engineering. \nI fail to see where this sympathy for the perps comes from. These guys aren’t heroes, nor are they hackers in the traditional sense (e.g. driven by curiosity).\nSo bad.\nSad, and now we are going to spend another million on a victimless crime, which could be used for restitution, because companies can’t be bothered to do basic security.   Quit subsidizing their security programs and you’ll see it get better overnight\n“…victimless crime?” If there are no victims, why would you suggest paying restitution? Come on man, do better than that if you’re trying to elicit sympathy for these junior criminals.\nNo crime is victimless. Just because you’re ignorant of the repercusions of a criminal act does not mean there are none.\nF@#* around\nFind out\nCue the world’s smallest violin playing a sad tune. He bragged about victimizing innocent people. I hope he meets some nice boyfriends in prison.\nSIM swappers, phishers, and crypto thieves are not hackers, they are criminals. I’m glad to finally see a sentence measured in decades, even if it’s only 1. The impact to victims is sometimes immeasurable, and even includes self-deletion in extreme cases.\n“And somebody called the outside contractor representing Judge Toomey saying, ‘I need a password change.’ And they gave out the password change. That’s how whoever was making the phone call got into the court.”\nIf someone calls in for a password change and the person gives them a password, please fire them immediately\nWTF, reset you own password\nI will bet the outside contractor still has a job\nHow did he make all of these tweets and contact Krebs if he is in jail ? I understand it’s possible to have a burner phone in jail, but the Twitter account mentioned here has been tweeting every day/week for the past year!\nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "Telecom Firm Colt Confirms Data Breach as Ransomware Group Auctions Files",
        "Link": "https://www.securityweek.com/telecom-firm-colt-confirms-data-breach-as-ransomware-group-auctions-files/",
        "Summary": "<p>Colt Technology Services is working on restoring systems disrupted by a ransomware attack that involved data theft.</p>\n<p>The post <a href=\"https://www.securityweek.com/telecom-firm-colt-confirms-data-breach-as-ransomware-group-auctions-files/\">Telecom Firm Colt Confirms Data Breach as Ransomware Group Auctions Files</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/telecom-firm-colt-confirms-data-breach-as-ransomware-group-auctions-files/"
    },
    {
        "Title": "Scattered Spider Hacker Sentenced to Prison",
        "Link": "https://www.securityweek.com/scattered-spider-hacker-sentenced-to-prison/",
        "Summary": "<p>Noah Urban was sentenced to 10 years in prison for his role in the notorious cybercriminal operation known as Scattered Spider.</p>\n<p>The post <a href=\"https://www.securityweek.com/scattered-spider-hacker-sentenced-to-prison/\">Scattered Spider Hacker Sentenced to Prison</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/scattered-spider-hacker-sentenced-to-prison/"
    },
    {
        "Title": "Password Managers Vulnerable to Data Theft via Clickjacking",
        "Link": "https://www.securityweek.com/password-managers-vulnerable-to-data-theft-via-clickjacking/",
        "Summary": "<p>A researcher has tested nearly a dozen password managers and found that they were all vulnerable to clickjacking attacks.</p>\n<p>The post <a href=\"https://www.securityweek.com/password-managers-vulnerable-to-data-theft-via-clickjacking/\">Password Managers Vulnerable to Data Theft via Clickjacking</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/password-managers-vulnerable-to-data-theft-via-clickjacking/"
    },
    {
        "Title": "Russian APT Exploiting 7-Year-Old Cisco Vulnerability: FBI",
        "Link": "https://www.securityweek.com/russian-apt-exploiting-7-year-old-cisco-vulnerability-fbi/",
        "Summary": "<p>Russian state-sponsored hackers tracked as Static Tundra continue to target Cisco devices affected by CVE-2018-0171.</p>\n<p>The post <a href=\"https://www.securityweek.com/russian-apt-exploiting-7-year-old-cisco-vulnerability-fbi/\">Russian APT Exploiting 7-Year-Old Cisco Vulnerability: FBI</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/russian-apt-exploiting-7-year-old-cisco-vulnerability-fbi/"
    },
    {
        "Title": "Orange Belgium Data Breach Impacts 850,000 Customers",
        "Link": "https://www.securityweek.com/orange-belgium-data-breach-impacts-850000-customers/",
        "Summary": "<p>Orange Belgium says hackers accessed data pertaining to 850,000 customer accounts during a July cyberattack.</p>\n<p>The post <a href=\"https://www.securityweek.com/orange-belgium-data-breach-impacts-850000-customers/\">Orange Belgium Data Breach Impacts 850,000 Customers</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/orange-belgium-data-breach-impacts-850000-customers/"
    },
    {
        "Title": "Apple Patches Zero-Day Exploited in Targeted Attacks",
        "Link": "https://www.securityweek.com/apple-patches-zero-day-exploited-in-targeted-attacks/",
        "Summary": "<p>Apple has rolled out iOS and macOS updates that resolve a zero-day vulnerability exploited in highly targeted attacks.</p>\n<p>The post <a href=\"https://www.securityweek.com/apple-patches-zero-day-exploited-in-targeted-attacks/\">Apple Patches Zero-Day Exploited in Targeted Attacks</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/apple-patches-zero-day-exploited-in-targeted-attacks/"
    },
    {
        "Title": "Europol Says Qilin Ransomware Reward Fake",
        "Link": "https://www.securityweek.com/europol-says-qilin-ransomware-reward-fake/",
        "Summary": "<p>A $50,000 reward from Europol for two members of the Qilin ransomware group is a ‘scam’, according to the law enforcement agency.</p>\n<p>The post <a href=\"https://www.securityweek.com/europol-says-qilin-ransomware-reward-fake/\">Europol Says Qilin Ransomware Reward Fake</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/europol-says-qilin-ransomware-reward-fake/"
    },
    {
        "Title": "Turkish Medical Association Allegedly Breached – Sensitive Data of Doctors Exposed",
        "Link": "https://dailydarkweb.net/turkish-medical-association-allegedly-breached-sensitive-data-of-doctors-exposed/",
        "Summary": "The Turkish Medical Association (TTB), a pivotal professional organization for physicians in Turkey, has allegedly suffered a significant data breach. The TTB, known formally as Turk Tabipleri Birligi, is the official body that sets professional and ethical standards for all practicing doctors in the country, holding the authority to issue disciplinary actions. All physicians in [&#8230;]",
        "Date": "2025-08-21",
        "Content": "The Turkish Medical Association (TTB), a pivotal professional organization for physicians in Turkey, has allegedly suffered a significant data breach. The TTB, known formally as Turk Tabipleri Birligi, is the official body that sets professional and ethical standards for all practicing doctors in the country, holding the authority to issue disciplinary actions. All physicians in Turkey are required to be members of this Ankara-based association, making it a central institution in the nation’s healthcare system. A threat actor has claimed responsibility for the cyberattack, stating they exploited a vulnerability within the organization’s systems.\nThe breach has allegedly resulted in the exfiltration of a vast amount of sensitive information. The perpetrator claims to have obtained a 3 GB database containing the records of what they suggest is 90% of all doctors in Turkey, in addition to 6 GB of full source code, documents, and SSL certificates. A sample of the database shared online indicates the exposure of highly personal and professional details. A separate file containing member phone numbers was also allegedly leaked.\nThe compromised data allegedly includes a wide range of personally identifiable information (PII). Based on the evidence provided, the following data fields have been exposed:\nTurkish Identification Number\nFull Name\nDate and Place of Birth\nGender\nMarital Status\nBlood Type\nNationality\nFull Address Details\nFather’s and Mother’s Names\nPhone Numbers\nMembership and Registration Details\nTags:\nCyberSecurity\ndata-breach\nDoctors\nHealthcare\nPII Leak\nTTB\nTurkey"
    },
    {
        "Title": "Searchable Online Database of Syrian Citizens Data Goes on Sale",
        "Link": "https://dailydarkweb.net/searchable-online-database-of-syrian-citizens-data-goes-on-sale/",
        "Summary": "An online panel providing searchable access to what it claims is &#8220;the biggest Syrian people database&#8221; has been discovered after being advertised on a hacking forum. The website features a simple interface with search fields for an individual&#8217;s name, email, or phone number. The panel displays results in a grid, showing partial and often blurred [&#8230;]",
        "Date": "2025-08-21",
        "Content": "An online panel providing searchable access to what it claims is “the biggest Syrian people database” has been discovered after being advertised on a hacking forum. The website features a simple interface with search fields for an individual’s name, email, or phone number. The panel displays results in a grid, showing partial and often blurred information to non-paying users, a method designed to expose the personal data of Syrian citizens.\nThe platform operates on a tiered-access model created to monetize the allegedly stolen information. The free search results are intentionally limited to pressure users into paying for complete data records. A prominent “Unlock Premium” function is built into the interface, leading to a section that details the full, uncensored data that is allegedly available for purchase, posing a severe threat to the privacy and security of individuals.\nThis premium access is being sold through a third-party e-commerce site, where a 30-day access key to the panel is offered for $49.00. After payment, a key is provided which can be entered directly into the panel to unlock the complete dataset. This paid access allegedly exposes a trove of highly sensitive personal information.\nThe full dataset allegedly includes:\nFull data length (names, emails, phone numbers)\nPasswords\nPhysical addresses\nUnblurred personal pictures\nTags:\nCyberSecurity\ndark web\ndata-leak\nPII\nPrivacy\nSyria"
    },
    {
        "Title": "Databases of Crypto Platforms Casa, Nunchuk, and Theya Allegedly Breached and Put Up for Sale",
        "Link": "https://dailydarkweb.net/databases-of-crypto-platforms-casa-nunchuk-and-theya-allegedly-breached-and-put-up-for-sale/",
        "Summary": "A threat actor has allegedly posted databases from three US-based cryptocurrency companies for sale on a hacking forum, putting the sensitive information of potentially over one million users at risk. The targeted companies include prominent players in the Bitcoin self-custody and digital asset sectors. The seller claims to be offering exclusive, &#8220;one hand only&#8221; access [&#8230;]",
        "Date": "2025-08-21",
        "Content": "A threat actor has allegedly posted databases from three US-based cryptocurrency companies for sale on a hacking forum, putting the sensitive information of potentially over one million users at risk. The targeted companies include prominent players in the Bitcoin self-custody and digital asset sectors. The seller claims to be offering exclusive, “one hand only” access to the user databases, which, if legitimate, could expose users to significant financial and personal security threats.\nThe companies named in the forum post are all based in the United States and serve distinct roles within the crypto ecosystem. The alleged data leak includes highly sensitive user information that could be leveraged for phishing campaigns, SIM swapping attacks, and other malicious activities. The full details of the data allegedly for sale are listed below:\n🇺🇸\nCasa (casa.io):\nA well-known company that provides secure Bitcoin self-custody solutions through multi-signature wallets. The alleged data breach involves 330,000 user lines.\nUsers, user ID, email, password, wallet, registration date, referral code\n🇺🇸\nTheya (theya.us):\nA platform offering employee benefits paid for with cryptocurrency. The actor is allegedly selling a database of 194,000 users.\nUser, user ID, username, email, phone number, password, wallet, chain ID, registration date, last login date\n🇺🇸\nNunchuk (nunchuk.io):\nA provider of collaborative, multi-signature Bitcoin wallets. The actor claims to possess a database of 491,000 users.\nUsers ID, username, password, email, and phone number\nTags:\nBitcoin\nCasa\ncryptocurrency\ncyberattack\ndata-breach\nhacking\nNunchuk\nTheya"
    },
    {
        "Title": "Russian Retailer Darvin Market Allegedly Breached – Exposing Customer and Staff Data",
        "Link": "https://dailydarkweb.net/russian-retailer-darvin-market-allegedly-breached-exposing-customer-and-staff-data/",
        "Summary": "A threat actor has allegedly leaked a database belonging to Darvin Market, a prominent Russian retailer specializing in household goods, electronics, and tools. The company, operating under the domain Darvin-market.ru, appears to be the latest victim of a significant data breach. The leaked dataset purportedly contains over 67,000 records, compromising the sensitive information of both [&#8230;]",
        "Date": "2025-08-21",
        "Content": "A threat actor has allegedly leaked a database belonging to Darvin Market, a prominent Russian retailer specializing in household goods, electronics, and tools. The company, operating under the domain Darvin-market.ru, appears to be the latest victim of a significant data breach. The leaked dataset purportedly contains over 67,000 records, compromising the sensitive information of both the company’s customers and its employees.\nThe compromised information, claimed to be updated in 2025, allegedly includes a wide range of personally identifiable information (PII). The exposure of such data could potentially lead to various malicious activities, including phishing attacks, identity theft, and other forms of fraud targeting the individuals whose details are included in the leak. The full extent of the allegedly leaked data includes:\nFull names, logins, and email addresses\nPersonal and work phone numbers\nCompany, department, and position details for staff\nUser activity data, such as last login and registration dates\nTags:\nCyberSecurity\nDarvin Market\ndata-breach\ndata-leak\nPII\nRussia"
    },
    {
        "Title": "UK E-Signature Firm SignitOnline[.]co[.]uk Allegedly Breached  – 5,000 Users and Signatures Leaked",
        "Link": "https://dailydarkweb.net/uk-e-signature-firm-signitonline-co-uk-allegedly-breached-5000-users-and-signatures-leaked/",
        "Summary": "A threat actor has allegedly breached the UK-based electronic signature provider, SignitOnline[.]co[.]uk, and is attempting to sell the company&#8217;s data on a dark web forum. SignitOnline[.]co[.]uk offers services that allow users to sign documents digitally, making the nature of the compromised data particularly sensitive. The seller claims the breach, dated July 2025, affects 5,000 users [&#8230;]",
        "Date": "2025-08-21",
        "Content": "A threat actor has allegedly breached the UK-based electronic signature provider, SignitOnline[.]co[.]uk, and is attempting to sell the company’s data on a dark web forum. SignitOnline[.]co[.]uk offers services that allow users to sign documents digitally, making the nature of the compromised data particularly sensitive. The seller claims the breach, dated July 2025, affects 5,000 users and includes a massive 36.5 GB of user signature files.\nThe threat actor is selling the data for $500 USD and has provided samples, including database credentials, to substantiate their claims. The compromised information allegedly includes highly sensitive user details. If the claims are true, this data could be used for identity theft, fraud, and sophisticated phishing campaigns against the company’s users.\nThe allegedly leaked data includes:\nEmail Addresses\nPlaintext Passwords\nAccount Registration Dates\nComplete SQL Dump\n36.5 GB of User Signature Files\nTags:\nCyberSecurity\ndata-breach\ndata-leak\nE-Signature\nSignitOnline\nUK"
    },
    {
        "Title": "Kuwait’s Ministry of Electricity & Water Allegedly Breached – 21K Employee Records for Sale",
        "Link": "https://dailydarkweb.net/kuwaits-ministry-of-electricity-water-allegedly-breached-21k-employee-records-for-sale/",
        "Summary": "A threat actor has allegedly breached the systems of Kuwait&#8217;s Ministry of Electricity &#38; Water (MEW), a critical government body responsible for providing electricity and water services to the nation. The actor announced the sale of a database on a cybercrime forum, claiming it contains sensitive records for over 21,000 ministry employees. The alleged breach [&#8230;]",
        "Date": "2025-08-21",
        "Content": "A threat actor has allegedly breached the systems of Kuwait’s Ministry of Electricity & Water (MEW), a critical government body responsible for providing electricity and water services to the nation. The actor announced the sale of a database on a cybercrime forum, claiming it contains sensitive records for over 21,000 ministry employees. The alleged breach highlights a significant security risk to the personal information of government workers and the operational security of a key national infrastructure entity.\nThe compromised data, which is being sold for $400, allegedly includes a range of personally identifiable information (PII) and technical details. According to the threat actor’s post, the leak contains 21,011 employee records originating from the ministry’s official domain,\nmew.gov.kw\n. The exposed information purportedly includes:\nEmployee names (in Arabic) and phone numbers\nWork locations, such as the Main Ministry Building\nDevice information, including OS versions and models (e.g., iPhone/Samsung)\nRegistration statuses and timestamps\nTags:\ncyber-attack\ndata-breach\ngovernment\nKuwait\nMEW"
    }
]