[
    {
        "Title": "ClickFix Malware Campaign Exploits CAPTCHAs to Spread Cross-Platform Infections",
        "Link": "https://thehackernews.com/2025/08/clickfix-malware-campaign-exploits.html",
        "Summary": "A combination of propagation methods, narrative sophistication, and evasion techniques enabled the social engineering tactic known as ClickFix to take off the way it did over the past year, according to new findings from Guardio Labs.\n\"Like a real-world virus variant, this new 'ClickFix' strain quickly outpaced and ultimately wiped out the infamous fake browser update scam that plagued the web",
        "Date": "2025-08-05",
        "Content": "A combination of propagation methods, narrative sophistication, and evasion techniques enabled the social engineering tactic known as\nClickFix\nto take off the way it did over the past year, according to new findings from Guardio Labs.\n\"Like a real-world virus variant, this new '\nClickFix\n' strain quickly outpaced and ultimately wiped out the infamous fake browser update scam that plagued the web just last year,\" security researcher Shaked Chen\nsaid\nin a report shared with The Hacker News.\n\"It did so by removing the need for file downloads, using smarter social engineering tactics, and spreading through trusted infrastructure. The result - a wave of infections ranging from mass drive-by attacks to hyper-targeted spear-phishing lures.\"\nClickFix\nis the name given to a social engineering tactic where prospective targets are deceived into infecting their own machines under the guise of fixing a non-existent issue or a CAPTCHA verification. It was first detected in the wild in early 2024.\nIn these attacks, infection vectors as diverse as phishing emails, drive-by downloads, malvertising, and search engine optimization (SEO) poisoning are employed to direct users to fake pages that display the error messages.\nThese messages have one goal: Guide victims to follow a series of steps that cause a covertly copied malicious command to their clipboard to be executed when pasted on the Windows Run dialog box or the Terminal app, in the case of\nApple macOS\n.\nThe nefarious command, in turn, triggers the execution of a multi-stage sequence that results in the deployment of various kinds of malware, such as stealers, remote access trojans, and loaders, underscoring the flexibility of the threat.\nThe tactic has\nbecome\nso\neffective\nand potent that it has led to what Guardio calls a CAPTCHAgeddon, with both cybercriminal and nation-state actors wielding it in\ndozens of campaigns\nin a short span of time.\nClickFix is a more stealthy mutation of\nClearFake\n, which involves leveraging compromised WordPress sites to serve fake browser update pop-ups that, in turn, deliver stealer malware. ClearFake subsequently went on to incorporate advanced evasion tactics like\nEtherHiding\nto conceal the next-stage payload using Binance's Smart Chain (BSC) contracts.\nGuardio said the evolution of ClickFix and its success is the result of constant refinement in terms of propagation vectors, the diversification of the lures and messaging, and the different methods used to get ahead of the detection curve, so much so that it ultimately supplanted ClearFake.\n\"Early prompts were generic, but they quickly became more persuasive, adding urgency or suspicion cues,\" Chen said. \"These tweaks increased compliance rates by exploiting basic psychological pressure.\"\nSome of the notable ways the attack approach has adapted include the abuse of Google Scripts to host the fake CAPTCHA flows, thereby leveraging the trust associated with Google's domain, as well as embedding the payload within legitimate-looking file sources like socket.io.min.js.\n\"This chilling list of techniques – obfuscation, dynamic loading, legitimate-looking files, cross-platform handling, third-party payload delivery, and abuse of trusted hosts like Google – demonstrates how threat actors have continuously adapted to avoid detection,\" Chen added.\n\"It is a stark reminder that these attackers are not just refining their phishing lures or social engineering tactics but are investing heavily in technical methods to ensure their attacks remain effective and resilient against security measures.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Google’s August Patch Fixes Two Qualcomm Vulnerabilities Exploited in the Wild",
        "Link": "https://thehackernews.com/2025/08/google-fixes-3-android-vulnerabilities.html",
        "Summary": "Google has released security updates to address multiple security flaws in Android, including fixes for two Qualcomm bugs that were flagged as actively exploited in the wild.\nThe vulnerabilities include CVE-2025-21479 (CVSS score: 8.6) and CVE-2025-27038 (CVSS score: 7.5), both of which were disclosed alongside CVE-2025-21480 (CVSS score: 8.6), by the chipmaker back in June 2025.\nCVE-2025-21479",
        "Date": "2025-08-05",
        "Content": "Google has\nreleased\nsecurity updates to address multiple security flaws in Android, including fixes for two Qualcomm bugs that were flagged as actively exploited in the wild.\nThe vulnerabilities include CVE-2025-21479 (CVSS score: 8.6) and CVE-2025-27038 (CVSS score: 7.5), both of which were\ndisclosed\nalongside CVE-2025-21480 (CVSS score: 8.6), by the chipmaker back in June 2025.\nCVE-2025-21479 relates to an incorrect authorization vulnerability in the Graphics component that could lead to memory corruption due to unauthorized command execution in GPU microcode.\nCVE-2025-27038, on the other hand, use-after-free vulnerability in the Graphics component that could result in memory corruption while rendering graphics using Adreno GPU drivers in Chrome.\nThere are still no details on how these shortcomings have been weaponized in real-world attacks, but Qualcomm noted at the time that \"there are indications from Google Threat Analysis Group that CVE-2025-21479, CVE-2025-21480, CVE-2025-27038 may be under limited, targeted exploitation.\"\nGiven that similar flaws in Qualcomm chipsets have been exploited by commercial spyware vendors like Variston and Cy4Gate in the past, it's suspected that the aforementioned shortcomings may also have been abused in a similar context.\nThe three vulnerabilities have since been\nadded\nto the U.S. Cybersecurity and Infrastructure Security Agency's (CISA) Known Exploited Vulnerabilities (\nKEV\n) catalog, requiring federal agencies to apply the updates by June 24, 2025.\nGoogle's August 2025 patch also resolves two high-severity privilege escalation flaws in Android Framework (CVE-2025-22441 and CVE-2025-48533) and a critical bug in the System component (CVE-2025-48530) that could result in remote code execution when combined with other flaws without requiring any additional privileges or user interaction.\nThe tech giant has made available two patch levels, 2025-08-01 and 2025-08-05, with the latter also incorporating fixes for closed-source and third-party components from Arm and Qualcomm. Android device users are advised to apply the updates as and when they become available to stay protected against potential threats.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Cursor AI Code Editor Vulnerability Enables RCE via Malicious MCP File Swaps Post Approval",
        "Link": "https://thehackernews.com/2025/08/cursor-ai-code-editor-vulnerability.html",
        "Summary": "Cybersecurity researchers have disclosed a high-severity security flaw in the artificial intelligence (AI)-powered code editor Cursor that could result in remote code execution.\nThe vulnerability, tracked as CVE-2025-54136 (CVSS score: 7.2), has been codenamed MCPoison by Check Point Research, owing to the fact that it exploits a quirk in the way the software handles modifications to Model",
        "Date": "2025-08-05",
        "Content": "Cybersecurity researchers have disclosed a high-severity security flaw in the artificial intelligence (AI)-powered code editor Cursor that could result in remote code execution.\nThe vulnerability, tracked as CVE-2025-54136 (CVSS score: 7.2), has been codenamed\nMCPoison\nby Check Point Research, owing to the fact that it exploits a quirk in the way the software handles modifications to Model Context Protocol (MCP) server configurations.\n\"A vulnerability in Cursor AI allows an attacker to achieve remote and persistent code execution by modifying an already trusted MCP configuration file inside a shared GitHub repository or editing the file locally on the target's machine,\" Cursor\nsaid\nin an advisory released last week.\n\"Once a collaborator accepts a harmless MCP, the attacker can silently swap it for a malicious command (e.g., calc.exe) without triggering any warning or re-prompt.\"\nMCP is an open-standard developed by Anthropic that allows large language models (LLMs) to interact with external tools, data, and services in a standardized manner. It was introduced by the AI company in November 2024.\nCVE-2025-54136, per Check Point, has to do with how it's possible for an attacker to alter the behavior of an MCP configuration after a user has approved it within Cursor. Specifically, it unfolds as follows -\nAdd a benign-looking MCP configuration (\".cursor/rules/mcp.json\") to a shared repository\nWait for the victim to pull the code and approve it once in Cursor\nReplace the MCP configuration with a malicious payload, e.g., launch a script or run a backdoor\nAchieve persistent code execution every time the victim opens the Cursor\nThe fundamental problem here is that once a configuration is approved, it's trusted by Cursor indefinitely for future runs, even if it has been changed. Successful exploitation of the vulnerability not only exposes organizations to supply chain risks, but also opens the door to data and intellectual property theft without their knowledge.\nFollowing responsible disclosure on July 16, 2025, the issue has been addressed by Cursor in version 1.3 released late July 2025 by requiring user approval every time an entry in the MCP configuration file is modified.\n\"The flaw exposes a critical weakness in the trust model behind AI-assisted development environments, raising the stakes for teams integrating LLMs and automation into their workflows,\"\nCheck Point\nsaid.\nThe development comes days after Aim Labs, Backslash Security, and HiddenLayer\nexposed\nmultiple weaknesses in the AI tool that could have been abused to obtain remote code execution and bypass its denylist-based protections. They have also been patched in version 1.3.\nThe findings also coincide with the growing adoption of AI in business workflows, including using LLMs for code generation, broadening the attack surface to\nvarious emerging risks\nlike AI supply chain attacks, unsafe code, model poisoning, prompt injection, hallucinations, inappropriate responses, and data leakage -\nA test of over 100 LLMs for their ability to write Java, Python, C#, and JavaScript code has\nfound\nthat 45% of the generated code samples failed security tests and introduced OWASP Top 10 security vulnerabilities. Java led with a 72% security failure rate, followed by C# (45%), JavaScript (43%), and Python (38%).\nAn attack called\nLegalPwn\nhas revealed that it's possible to leverage legal disclaimers, terms of service, or privacy policies as a novel prompt injection vector, highlighting how malicious instructions can be embedded within legitimate, but often overlooked, textual components to trigger unintended behavior in LLMs, such as misclassifying malicious code as safe and offering unsafe code suggestions that can execute a reverse shell on the developer's system.\nAn attack called\nman-in-the-prompt\nthat employs a rogue browser extension with no special permissions to open a new browser tab in the background, launch an AI chatbot, and inject them with malicious prompts to covertly extract data and compromise model integrity. This takes advantage of the fact that any browser add-on with scripting access to the Document Object Model (DOM) can read from, or write to, the AI prompt directly.\nA jailbreak technique called\nFallacy Failure\nthat manipulates an LLM into accepting logically invalid premises and causes it to produce otherwise restricted outputs, thereby deceiving the model into breaking its own rules.\nAn attack called\nMAS hijacking\nthat manipulates the control flow of a multi-agent system (MAS) to execute arbitrary malicious code across domains, mediums, and topologies by weaponizing the agentic nature of AI systems.\nA technique called\nPoisoned GPT-Generated Unified Format (GGUF) Templates\nthat targets the AI model inference pipeline by embedding malicious instructions within the\nchat template files\nthat execute during the inference phase to compromise outputs. By positioning the attack between input validation and model output, the approach is both sneaky and bypasses AI guardrails. With GGUF files distributed via services like Hugging Face, the attack exploits the supply chain trust model to trigger the attack.\nAn attacker can\ntarget\nthe machine learning (ML) training environments like MLFlow, Amazon SageMaker, and Azure ML to compromise the confidentiality, integrity and availability of the models, ultimately leading to lateral movement, privilege escalation, as well as training data and model theft and poisoning.\nA study by Anthropic has uncovered that LLMs can learn hidden characteristics during distillation, a phenomenon called\nsubliminal learning\n, that causes models to transmit behavioral traits through generated data that appears completely unrelated to those traits, potentially leading to misalignment and harmful behavior.\n\"As Large Language Models become deeply embedded in agent workflows, enterprise copilots, and developer tools, the risk posed by these jailbreaks escalates significantly,\" Pillar Security's Dor Sarig said. \"Modern jailbreaks can propagate through contextual chains, infecting one AI component and leading to cascading logic failures across interconnected systems.\"\n\"These attacks highlight that AI security requires a new paradigm, as they bypass traditional safeguards without relying on architectural flaws or CVEs. The vulnerability lies in the very language and reasoning the model is designed to emulate.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Misconfigurations Are Not Vulnerabilities: The Costly Confusion Behind Security Risks",
        "Link": "https://thehackernews.com/2025/08/misconfigurations-are-not.html",
        "Summary": "In SaaS security conversations, “misconfiguration” and “vulnerability” are often used interchangeably. But they’re not the same thing. And misunderstanding that distinction can quietly create real exposure.\nThis confusion isn’t just semantics. It reflects a deeper misunderstanding of the shared responsibility model, particularly in SaaS environments where the line between vendor and customer",
        "Date": "2025-08-05",
        "Content": "In SaaS security conversations, \"misconfiguration\" and \"vulnerability\" are often used interchangeably. But they're not the same thing. And misunderstanding that distinction can quietly create real exposure.\nThis confusion isn't just semantics. It reflects a deeper misunderstanding of the shared responsibility model, particularly in SaaS environments where the line between vendor and customer responsibility is often unclear.\nA Quick Breakdown\nVulnerabilities\nare flaws in the codebase of the SaaS platform itself. These are issues only the vendor can patch. Think zero-days and code-level exploits.\nMisconfigurations\n, on the other hand, are user-controlled. They result from how the platform is set up—who has access, what integrations are connected, and what policies are enforced (or not). A misconfiguration might look like a third-party app with excessive access, or a sensitive internal site that is accidentally public.\nA Shared Model, but Split Responsibilities\nMost SaaS providers operate under a shared responsibility model. They secure the infrastructure, deliver commitments on uptime, and provide platform-level protections. In SaaS, this model means the vendor handles the underlying hosting infrastructure and systems, while customers are responsible for how they configure the application, manage access, and control data sharing. It's up to the customer to configure and use the application securely.\nThis includes identity management, permissions, data sharing policies, and third-party integrations. These are not optional layers of security. They're foundational.\nThat disconnect is reflected in the data: 53% of organizations say their SaaS security confidence is based on trust in the vendor, according to the\nThe State of SaaS Security 2025 Report\n. In reality, assuming vendors are handling everything can create a dangerous blind spot, especially when the customer controls the most breach-prone settings.\nThreat Detection Can't Catch What Was Never Logged\nMost incidents don't involve advanced attacks, or even a threat actor triggering an alert. Instead, they originate from configuration or policy issues that go unnoticed.\nThe State of SaaS Security 2025 Report\nidentifies that 41% of incidents were caused by permission issues and 29% by misconfigurations. These risks don't appear in traditional detection tools (including SaaS threat detection platforms) because they're not triggered by user behavior. Instead, they're baked into how the system is set up. You only see them by analyzing configurations, permissions, and integration settings directly—not through logs or alerts.\nHere's what a typical SaaS attack path looks like—starting with access attempts and ending in data exfiltration. Each step can be blocked by either posture controls (prevent) or detected through anomaly and event-driven alerts (detect).\nBut not every risk shows up in a log file. Some can only be addressed by hardening your environment before the attack even begins.\nLogs capture actions like logins, file access, or administrative changes. But excessive permissions, unsecured third-party connections, or overexposed data aren't actions. They are conditions. If no one interacts with them, they leave no trace in the log files.\nThis gap is not just theoretical.\nResearch into Salesforce's OmniStudio platform\n(designed for low-code customization in regulated industries like healthcare, financial services, and government workflows) revealed critical misconfigurations that traditional monitoring tools failed to detect. These weren't obscure edge cases. They included permission models that exposed sensitive data by default and low-code components that granted broader access than intended. The risks were real, but the signals were silent.\nWhile detection remains critical for responding to active threats, it must be layered on top of a secure posture, not as a substitute for it.\nBuild a Secure-by-Design SaaS Program\nThe bottom line is this: you can't detect your way out of a misconfiguration problem. If the risk lives in how the system is set up, detection won't catch it. Posture management needs to come first.\nInstead of reacting to breaches, organizations should focus on preventing the conditions that cause them. That starts with visibility into configurations, permissions, third-party access, shadow AI, and the risky combinations that attackers exploit.\nThreat detection still matters, not because posture is weak, but because no system is ever bulletproof. AppOmni helps customers combine a strong preventive posture with high-fidelity detection to create a layered defense strategy that stops known risks and catches the unknowns.\nA Smarter Approach to SaaS Security\nTo build a modern SaaS security strategy, start with what's actually in your control. Focus on securing configurations, managing access, and establishing visibility, because the best time to address SaaS risk is before it becomes a problem.\nReady to fix the gaps in your SaaS posture? If you want to see where most teams are falling short—and what leading organizations are doing differently—the\n2025 State of SaaS Security Report\nbreaks it down. From breach drivers to gaps in ownership and confidence, it's a revealing look at how posture continues to shape outcomes.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "How Top CISOs Save Their SOCs from Alert Chaos to Never Miss Real Incidents",
        "Link": "https://thehackernews.com/2025/08/how-top-cisos-save-their-socs-from.html",
        "Summary": "Why do SOC teams still drown in alerts even after spending big on security tools? False positives pile up, stealthy threats slip through, and critical incidents get buried in the noise. Top CISOs have realized the solution isn’t adding more and more tools to SOC workflows but giving analysts the speed and visibility they need to catch real attacks before they cause damage.&nbsp;\nHere’s how",
        "Date": "2025-08-05",
        "Content": "Why do SOC teams still drown in alerts even after spending big on security tools? False positives pile up, stealthy threats slip through, and critical incidents get buried in the noise. Top CISOs have realized the solution isn't adding more and more tools to SOC workflows but giving analysts the speed and visibility they need to catch real attacks before they cause damage.\nHere's how they're breaking the cycle and turning their SOCs into true threat-stopping machines.\nStarting with Live, Interactive Threat Analysis\nThe first step to staying ahead of attackers is seeing threats as they happen. Static scans and delayed reports just can't keep up with modern, evasive malware. Interactive sandboxes like ANY.RUN let analysts detonate suspicious files, URLs, and QR codes in a\nfully isolated, safe environment\nand actually\ninteract with the sample in real time\n.\nWhy CISOs give access to interactive sandboxes:\nAnalysts can click links, open files, and mimic real user actions to trigger hidden payloads that traditional scanners miss.\nThey get full visibility into execution flow, dropped files, network connections, and related TTPs in seconds.\nImmediate IOC extraction means teams can respond faster and block similar threats before they spread.\nCheck this real case of phishing attack analyzed inside ANY.RUN's interactive sandbox.\nView real case of phishing attack\nFull phishing attack chain analyzed inside interactive sandbox in real time\nA phishing attack with a malicious QR code was fully analyzed in under one minute inside ANY.RUN. Analysts were able to watch the entire attack chain unfold, collect IOCs, and map behaviors to MITRE TTPs, all without leaving the sandbox. What once took hours of manual work now takes minutes, saving the team time and helping prevent repeat attacks.\nGive your analysts the speed, automation, and clarity they need with the ANY.RUN sandbox, trusted by CISOs to drive faster, smarter threat response.\nStart your 14-day trial\nAutomating Triage to Speed Up Response and Reduce Workload\nModern SOCs are turning to\nautomation\nfor one simple reason: it removes the slow, repetitive tasks that hold teams back. By automating triage, SOCs gain several key benefits:\nFaster investigations → faster incident response:\nAutomated workflows shorten the time between alert and action.\nReduced human error:\nMachines handle routine steps consistently, so nothing gets overlooked.\nConfidence for junior analysts:\nAutomation handles the tricky parts, so new team members can contribute without constantly relying on seniors.\nFocus for senior specialists:\nFreed from repetitive work, they can spend time on advanced threats, hunting, or improving detection rules.\nHigher SOC efficiency overall:\nLess fatigue, more accurate findings, and faster MTTR (Mean Time to Respond).\nThe QR code phishing attack mentioned earlier is a perfect example of how\nAutomated Interactivity\nin ANY.RUN changes the game. In this real case, the malicious URL was buried behind a QR code and protected by a CAPTCHA.\nPhishing attack with QR code exposed with the help of automation, saving time and resources\nNormally, an analyst would have to manually scan the code, open the link in a safe browser, pass the CAPTCHA, and then try to trigger the hidden payload; a tedious and error‑prone process.\nWith\nautomation enabled\n, the sandbox handled everything on its own: it opened the hidden URL, passed the CAPTCHA, and exposed the malicious process in seconds.\nMalicious URL revealed inside ANY.RUN sandbox\nAnalysts didn't have to wait for the analysis to finish; they could\ninteract with the sample live at any stage\n, clicking through processes, opening files, or triggering additional behaviors in a fully safe environment.\nThis dual approach,\nautomation plus interactivity,\nmeans your SOC saves time on tedious tasks while still giving analysts complete control. Routine steps no longer drain resources, junior staff can contribute confidently, and investigations move faster, leading to quicker containment and a stronger overall security posture.\nBoosting SOC Performance with Collaboration and a Connected Security Stack\nEven the most advanced detection tools won't fix a slow or fragmented SOC on their own.\nTrue performance comes from collaboration;\nwhen analysts can work together seamlessly, share findings in real time, and avoid duplicate effort. That's why top CISOs prioritize tools and platforms that\nmake teamwork part of the investigation process\n.\nFor example, solutions like ANY.RUN include\nbuilt‑in teamwork features\nthat give SOC analysts a shared workspace. Tasks are clearly assigned, progress is visible to managers, and analysts, whether in the same office or spread across time zones, stay fully aligned. This level of collaboration reduces friction, keeps investigations moving, and ensures that insights don't get lost between handoffs.\nTeam management displayed inside ANY.RUN sandbox\nBut collaboration is only half the picture. High‑performing SOCs also need their tools to\nfit naturally into the existing stack\n. The best solutions integrate with SOAR, SIEM, and XDR platforms, allowing analysts to launch sandbox analyses, enrich alerts, and automate response steps without leaving the tools they already know. This not only speeds up onboarding but also\neliminates the learning curve;\nyour team works faster using familiar interfaces, and your SOC levels up without adding complexity.\nWhen collaboration and integration come together, the payoff is clear:\nFaster investigations and decision‑making\nSmoother workflows with fewer handoff delays\nA stronger, more efficient SOC without extra overhead\nProtecting Privacy and Maintaining Compliance\nCISOs know that speed and visibility are only part of the equation; investigations must\nstay secure\n. Handling suspicious files, internal documents, or client data in a shared environment can create risks if not managed carefully.\nModern SOC tools solve this by offering\nprivate, isolated analysis environments\nwith\nrole-based access controls and SSO support\n. This ensures that:\nSensitive artifacts never leave the organization\nOnly authorized team members can access specific investigations\nCompliance requirements are met without slowing down response\nSolutions like ANY.RUN's sandbox make this simple. Analysts can detonate files and URLs in fully private sessions where no data is shared externally, and results are only visible to assigned team members. Even in collaborative investigations, managers can control who sees what, while SSO ensures smooth, secure access aligned with company policies.\nPrivacy management in ANY.RUN's team settings\nWhat CISOs Are Reporting After Putting These Strategies to Work\nAfter implementing the strategies outlined above, real-time threat analysis, automated triage, streamlined collaboration, and privacy-first workflows, SOCs using ANY.RUN's interactive sandbox are reporting measurable improvements across the board.\nUp to 3x improvement in SOC performance\n, driven by faster investigations and fewer manual steps\n90% of organizations report higher detection rates\n, particularly for stealthy and evasive threats\n50% reduction\nin malware investigation time\nImproved team collaboration, with shared reports and interactive analysis reducing handoff delays\nDeeper threat visibility\n, including multi-stage and fileless malware\nThese numbers reflect real operational gains: faster responses, sharper visibility, and stronger defense. For CISOs, it means fewer missed incidents, better use of analyst time, and a SOC that's equipped to handle whatever comes next.\nEquip Your SOC with the Speed It Deserves\nThe best SOCs don't wait. They detect threats early, respond fast, and adapt quickly to whatever attackers throw at them. But none of that happens without the right foundation.\nBy implementing interactive analysis, automating triage, enabling collaboration, and protecting sensitive workflows, top CISOs are building SOCs that lead.\nANY.RUN's sandbox brings all of that in one place. It gives your team the visibility, control, and automation they need to cut through alert chaos, reduce workload, and never miss a real incident.\nTrusted by CISOs to deliver:\nReduced Mean Time to Respond (MTTR)\nLower risk of business disruption and data breaches\nFewer missed incidents and false negatives\nLess analyst burnout and turnover\nBetter ROI from your existing security stack\nReady to see the difference in your own SOC?\nStart your 14-day trial\nand give your team the power to investigate threats in real time, with clarity, speed, and confidence.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "15,000 Fake TikTok Shop Domains Deliver Malware, Steal Crypto via AI-Driven Scam Campaign",
        "Link": "https://thehackernews.com/2025/08/15000-fake-tiktok-shop-domains-deliver.html",
        "Summary": "Cybersecurity researchers have lifted the veil on a widespread malicious campaign that's targeting TikTok Shop users globally with an aim to steal credentials and distribute trojanized apps.\n\"Threat actors are exploiting the official in-app e-commerce platform through a dual attack strategy that combines phishing and malware to target users,\" CTM360 said. \"The core tactic involves a deceptive",
        "Date": "2025-08-05",
        "Content": "Cybersecurity researchers have lifted the veil on a widespread malicious campaign that's targeting TikTok Shop users globally with an aim to steal credentials and distribute trojanized apps.\n\"Threat actors are exploiting the official in-app e-commerce platform through a dual attack strategy that combines phishing and malware to target users,\" CTM360\nsaid\n. \"The core tactic involves a deceptive replica of TikTok Shop that tricks users into thinking theyʼre interacting with a legitimate affiliate or the real platform.\"\nThe scam campaign has been codenamed\nFraudOnTok\nby the Bahrain-based cybersecurity company, calling out the threat actor's multi-pronged distribution strategy that involves Meta ads and artificial intelligence (AI)-generated TikTok videos that mimic influencers or official brand ambassadors.\nCentral to the effort is the use of lookalike domains that resemble legitimate TikTok URLs. Over 15,000 such impersonated websites have been identified to date. The vast majority of these domains are hosted on top-level domains such as .top, .shop, and .icu.\nThese domains are designed to host phishing landing pages that either steal user credentials or distribute bogus apps that deploy a variant of a known cross-platform malware called\nSparkKitty\nthat's capable of\nharvesting data\nfrom both Android and iOS devices.\nWhat's more, a chunk of these phishing pages lure users into depositing cryptocurrency on fraudulent storefronts by advertising fake product listings and heavy discounts. CTM360 said it identified no less than 5,000 URLs that are set up with an intent to download the malware-laced app by advertising it as TikTok Shop.\n\"The scam mimics legitimate TikTok Shop activity through fake ads, profiles, and AI-generated content, tricking users into engaging to distribute malware,\" the company noted. \"Fake ads are widely circulated on Facebook and TikTok, featuring AI-generated videos that mimic real promotions to attract users with heavily discounted offers.\"\nThe fraudulent scheme operates with three motives in mind, although the end goal is financial gain, regardless of the illicit monetization strategy employed:\nDeceiving buyers and affiliate program sellers (creators who promote products in exchange for a commission on sales generated through the affiliate links) with bogus and discounted products and asking them to make payments in cryptocurrency\nConvincing affiliate participants to \"top up\" fake on-site wallets with cryptocurrency, under the promise of future commission payouts or withdrawal bonuses that never materialize\nUsing fake TikTok Shop login pages to steal user credentials or instruct them to download trojanized TikTok apps\nThe malicious app, once installed, prompts the victim to enter their credentials using their email-based account, only for it to repeatedly fail in a deliberate attempt on the part of the threat actors to present them with an alternative login using their Google account.\nThis approach is likely meant to bypass traditional authentication flows and weaponize the session token created using the OAuth-based method for unauthorized access without requiring in-app email validation. Should the logged-in victim attempt to access the TikTok Shop section, they are directed to a fake login page that asks for their credentials.\nAlso embedded within the app is SparkKitty, a malware that's capable of device fingerprinting and using optical character recognition (OCR) techniques to analyze screenshots in a user's photo gallery for cryptocurrency wallet seed phrases, and exfiltrating them to an attacker-controlled server.\nThe disclosure comes as the company also detailed another targeting phishing campaign dubbed CyberHeist Phish that's using Google Ads and thousands of phishing links to dupe victims searching for corporate online banking sites to be redirected to seemingly benign pages that mimic the targeted banking login portal and are crafted to steal their credentials.\n\"This phishing operation is particularly sophisticated due to its evasive, selective nature and the threat actors' real-time interaction with the target to collect two-factor authentication on each stage of login, beneficiary creation and fund transfer,\" CTM360\nsaid\n.\nIn recent months, phishing campaigns have also targeted Meta Business Suite users as part of a campaign called Meta Mirage that uses fake policy violation email alerts, ad account restriction notices, and deceptive verification requests distributed via email and direct messages to lead victims to credential and cookie harvesting pages are hosted on Vercel, GitHub Pages, Netlify, and Firebase.\n\"This campaign focuses on compromising high-value business assets, including ad accounts, verified brand pages, and administrator-level access within the platform,\" the company\nadded\n.\nThese developments coincide with an advisory from the U.S. Department of the Treasury's Financial Crimes Enforcement Network (FinCEN), urging financial institutions to be vigilant in identifying and reporting suspicious activity involving convertible virtual currency (CVC) kiosks in a bid to combat fraud and other illicit activities.\n\"Criminals are relentless in their efforts to steal money from victims, and they've learned to exploit innovative technologies like CVC kiosks,\"\nsaid\nFinCEN Director Andrea Gacki. \"The United States is committed to safeguarding the digital asset ecosystem for legitimate businesses and consumers, and financial institutions are a critical partner in that effort.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "SonicWall Investigating Potential SSL VPN Zero-Day After 20+ Targeted Attacks Reported",
        "Link": "https://thehackernews.com/2025/08/sonicwall-investigating-potential-ssl.html",
        "Summary": "SonicWall said it's actively investigating reports to determine if there is a new zero-day vulnerability following reports of a spike in Akira ransomware actors in late July 2025.\n\"Over the past 72 hours, there has been a notable increase in both internally and externally reported cyber incidents involving Gen 7 SonicWall firewalls where SSLVPN is enabled,\" the network security vendor said in a",
        "Date": "2025-08-05",
        "Content": "SonicWall said it's actively investigating reports to determine if there is a new zero-day vulnerability following reports of a spike in Akira ransomware actors in late July 2025.\n\"Over the past 72 hours, there has been a notable increase in both internally and externally reported cyber incidents involving Gen 7 SonicWall firewalls where SSLVPN is enabled,\" the network security vendor\nsaid\nin a statement.\n\"We are actively investigating these incidents to determine whether they are connected to a previously disclosed vulnerability or if a new vulnerability may be responsible.\"\nWhile SonicWall is digging deeper, organizations using Gen 7 SonicWall firewalls are advised to follow the steps below until further notice -\nDisable SSL VPN services where practical\nLimit SSL VPN connectivity to trusted IP addresses\nActivate services such as Botnet Protection and Geo-IP Filtering\nEnforce multi-factor authentication\nRemove inactive or unused local user accounts on the firewall, particularly those with SSL VPN access\nEncourage regular password updates across all user accounts\nThe development comes shortly after Arctic Wolf\nrevealed\nit had identified a surge in Akira ransomware activity targeting SonicWall SSL VPN devices for initial access since late last month.\nHuntress, in a follow-up analysis published Monday, also said it has observed threat actors pivoting directly to domain controllers merely a few hours after the initial breach.\nAttack chains commence with the breach of the SonicWall appliance, followed by the attackers taking a \"well-worn\" post-exploitation path to conduct enumeration, detection evasion, lateral movement, and credential theft.\nThe incidents also involve the bad actors methodically disabling Microsoft Defender Antivirus and deleting volume shadow copies prior to deploying Akira ransomware.\nHuntress said it detected around 20 different attacks tied to the latest attack wave starting on July 25, 2025, with variations observed in the tradecraft used to pull them off, including in the use of tools for reconnaissance and persistence, such as AnyDesk, ScreenConnect, or SSH.\nThere is evidence to suggest that the activity may be limited to TZ and NSa-series SonicWall firewalls with SSL VPN enabled, and that the suspected flaw exists in firmware versions 7.2.0-7015 and earlier.\n\"The speed and success of these attacks, even against environments with MFA enabled, strongly suggest a zero-day vulnerability is being exploited in the wild,\" the cybersecurity company\nsaid\n. \"This is a critical, ongoing threat.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Pandora confirms data breach amid ongoing Salesforce data theft attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/pandora-confirms-data-breach-amid-ongoing-salesforce-data-theft-attacks/",
        "Summary": "Danish jewelry giant Pandora has disclosed a data breach after its customer information was stolen in the ongoing Salesforce data theft attacks. [...]",
        "Date": "2025-08-05",
        "Content": "Danish jewelry giant Pandora has disclosed a data breach after its customer information was stolen in the ongoing Salesforce data theft attacks.\nPandora is one of the largest jewellery brands in the world, with 2,700 locations and over 37,000 employees.\n\"We are writing to inform you that your contact information was accessed by an unauthorized party through a third-party platform we use,\" reads a Pandora data breach notification sent to customers.\n\"We stopped the access and have further strengthened our security measures.\"\nAs\nfirst reported\nby Forbes, only customers' names, birthdates, and email addresses were stolen in the attack. Passwords, IDs, and financial information were not exposed.\nPandora data breach notification\nSource:\nReddit\nWhile Pandora has not shared the name of the third-party platform, BleepingComputer has learned that the data was stolen from the company's Salesforce database.\nSince at least January 2025, if not earlier, threat actors have been conducting social engineering and phishing campaigns targeting companies' employees and help desks.\nThese attacks are designed to steal Salesforce credentials or trick employees into authorizing a malicious OAuth application to their Salesforce account.\nUsing this access, the threat actors download and steal the company's Salesforce database, which is then used to extort the company into paying a ransom to prevent the data from being leaked.\nShinyHunters confirmed to BleepingComputer that they are privately extorting companies and will perform a mass sale or leak of companies that do not pay a ransom in the future, like they did in the\nSnowflake data-theft attacks\n.\nThe threat actor also confirmed that the\nattacks are ongoing\n, so all companies should review Salesforce's recommendations on hardening their accounts.\n\"Salesforce has not been compromised, and the issues described are not due to any known vulnerability in our platform. While Salesforce builds enterprise-grade security into everything we do, customers also play a critical role in keeping their data safe — especially amid a rise in sophisticated phishing and social engineering attacks,\" Salesforce told BleepingComputer.\n\"We continue to encourage all customers to follow security best practices, including enabling multi-factor authentication (MFA), enforcing the principle of least privilege, and carefully managing connected applications. For more information, please visit:\nhttps://www.salesforce.com/blog/protect-against-social-engineering/\n.\"\nOther companies impacted in these attacks include\nAdidas\n,\nQantas\n,\nAllianz Life\n, and the LVMH subsidiaries\nLouis Vuitton\n,\nDior\n, and\nTiffany & Co.\nHowever, BleepingComputer has been told that there are many more that remain undisclosed.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nCisco discloses data breach impacting Cisco.com user accounts\nFashion giant Chanel hit in wave of Salesforce data theft attacks\nShinyHunters behind Salesforce data theft attacks at Qantas, Allianz Life, and LVMH\nStolen Ticketmaster data from Snowflake attacks briefly for sale again\nHacker leaks 386 million user records from 18 companies for free"
    },
    {
        "Title": "PBS confirms data breach after employee info leaked on Discord servers",
        "Link": "https://www.bleepingcomputer.com/news/security/pbs-confirms-data-breach-after-employee-info-leaked-on-discord-servers/",
        "Summary": "PBS has suffered a data breach exposing the corporate contact information of its employees and those of its affiliates, BleepingComputer has learned. [...]",
        "Date": "2025-08-05",
        "Content": "PBS has suffered a data breach exposing the corporate contact information of its employees and those of its affiliates, BleepingComputer has learned.\nEarlier this month, BleepingComputer was alerted to a file circulated on Discord servers that allegedly contained this information.\nThis data was not distributed on dark web sites, hacking forums, or other mediums frequented by threat actors. Instead, it was being shared on Discord servers for fans of \"PBS Kids,\" where young adults, teenagers, and younger kids can talk about the favorite shows they grew up watching.\n\"The young adults, teenagers, and kids sharing it seem to be doing it more out of a sense of novelty, rebellious curiosity, or simply to gain a bit of notoriety within their peer groups,\" BleepingComputer was told.\n\"It's less about exploiting the data for financial gain and more about the 'cool factor' of possessing it.\"\n\"That being said, the potential for misuse is obviously there.\"\nBleepingComputer obtained the file and can confirm it includes the corporate contact information for 3,997 PBS employees and affiliates.\nEach record in the JSON file contains an employee's name, corporate email, title, timezone, department, location, job functions, hobbies, and their supervisor's name.\nAfter contacting PBS about the breach, the company confirmed that it was stolen from an internal service used for public television employees.\n\"After being notified that a file containing user data from MyPBS.org, an internal service for public television employees was posted online, we launched a thorough investigation of the incident, which is ongoing,\" a PBS spokesperson told BleepingComputer.\n\"We have reached out to the users whose information was identified as involved to inform them of this incident and at this time, there is no evidence that this incident involves any other PBS systems.\"\nBleepingComputer has not learned of any malicious use of the data, but it continues to circulate among Discord communities as recently as this weekend.\nThe source who shared the data with BleepingComputer says they are concerned that the stolen data could draw unwanted attention to these communities that are designed simply for fans to talk about some of their favorite shows.\nWhile the breach appears to have originated more from curiosity than criminal intent, the exposure of employee data, particularly amid ongoing political scrutiny of PBS and NPR, raises concerns about how the information could be misused for harassment or doxxing.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nHacker leaks 386 million user records from 18 companies for free\nCisco discloses data breach impacting Cisco.com user accounts\nFashion giant Chanel hit in wave of Salesforce data theft attacks\nShinyHunters behind Salesforce data theft attacks at Qantas, Allianz Life, and LVMH\nPi-hole discloses data breach triggered by WordPress plugin flaw"
    },
    {
        "Title": "Adobe issues emergency fixes for AEM Forms zero-days after PoCs released",
        "Link": "https://www.bleepingcomputer.com/news/security/adobe-issues-emergency-fixes-for-aem-forms-zero-days-after-pocs-released/",
        "Summary": "Adobe released emergency updates for two zero-day flaws in Adobe Experience Manager (AEM) Forms on JEE after a PoC exploit chain was disclosed that can be used for unauthenticated, remote code execution on vulnerable instances. [...]",
        "Date": "2025-08-05",
        "Content": "Adobe released emergency updates for two zero-day flaws in Adobe Experience Manager (AEM) Forms on JEE after a PoC exploit chain was disclosed that can be used for unauthenticated, remote code execution on vulnerable instances.\nThe flaws are tracked as CVE-2025-54253 and CVE-2025-54254:\nCVE-2025-54253:\nMisconfiguration allowing arbitrary code execution. Rated \"Critical\" with a CVSS score of 8.6.\nCVE-2025-54254:\nImproper Restriction of XML External Entity Reference (XXE) allowing arbitrary file system read. Rated \"Critical\" with a maximum-severity 10.0 CVSS score.\nAdobe has\nfixed the flaws\nin the latest versions as\ndescribed in this advisory\n.\nThe vulnerabilities were discovered by Shubham Shah and Adam Kues of Searchlight Cyber, who disclosed them to Adobe on April 28, 2025, along with a third issue, CVE-2025-49533.\nAdobe initially patched CVE-2025-49533 on August 5, leaving the other two flaws unfixed for over 90 days.\nAfter warning Adobe of their disclosure timeline, the researchers published a\ntechnical write-up\non July 29 detailing how the vulnerabilities work and how they can be exploited.\nAccording to the researchers, CVE-2025-49533 is a Java deserialization flaw in the FormServer module that allows unauthenticated remote code execution (RCE). A servlet processes user-supplied data by decoding and deserializing it without validation, letting attackers send malicious payloads to execute commands on the server.\nThe XXE vulnerability, tracked as CVE-2025-54254, affects a web service that handles SOAP authentication. By submitting a specially crafted XML payload, attackers can trick the service into exposing local files, such as win.ini, without authentication.\nFinally, the CVE-2025-54253 flaw is caused by an authentication bypass in /adminui module in combination with a misconfigured developer setting.\nThe researchers found that Struts2's development mode was left enabled by mistake, allowing attackers to execute OGNL expressions through debug parameters sent in HTTP requests.\nAs the flaws allow remote code execution on vulnerable servers, all admins are advised to install the latest updates and hotfixes as soon as possible.\nIf that is not possible, the researchers strongly recommend restricting access to the platform from the internet.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nExploit available for critical Cisco ISE bug exploited in attacks\nCISA warns of attackers exploiting Linux flaw with PoC exploit\nAndroid gets patches for Qualcomm flaws exploited in attacks\nLovense sex toy app flaw leaks private user email addresses\nUS nuclear weapons agency hacked in Microsoft SharePoint attacks"
    },
    {
        "Title": "The Heat Wasn't Just Outside: Cyber Attacks Spiked in Summer 2025",
        "Link": "https://www.bleepingcomputer.com/news/security/the-heat-wasnt-just-outside-cyber-attacks-spiked-in-summer-2025/",
        "Summary": "Can your defenses withstand the biggest attacks of Summer 2025? From Interlock's FileFix to Qilin, Scattered Spider, and ToolShell exploits—simulate them all against your organization's defenses with Picus Security Validation Platform to find gaps before attackers do. [...]",
        "Date": "2025-08-05",
        "Content": "Summer 2025 wasn't just hot; it was relentless.\nRansomware hammered hospitals, retail giants suffered data breaches, insurance firms were hit by phishing, and nation-state actors launched disruptive campaigns.\nFrom stealthy PowerShell loaders to zero-day SharePoint exploits, attackers kept defenders on their heels.\nThis report breaks down the season's most high-impact incidents and what security teams need to do before the next wave hits.\nSummer Expose Healthcare's Growing Ransomware Risk\nHospitals can't afford downtime, and attackers know it.\nThis summer, ransomware groups targeted healthcare, exploiting both the value of patient data and the urgency of care.\nInterlock rises as a major threat to US healthcare\nA July 22, 2025, joint advisory by CISA, FBI, and HHS highlighted\nInterlock\nas a major threat to the Healthcare and Public Health (HPH) sector. The group is linked to around\n14\nincidents in 2025 alone, with a third affecting only healthcare providers.\nWhat sets Interlock apart is its use of \"\nFileFix\n,\" a PowerShell launcher that hides malicious scripts behind decoy file paths. It tricks users into running payloads through File Explorer, bypassing typical security detections.\nRhysida ransomware targeted another US healthcare center\nOn July 8, 2025, the\nRhysida\nransomware group allegedly leaked sensitive data from Florida Hand Center, including medical images, driver's licenses, and insurance forms.\nThe clinic, which serves patients in Punta Gorda, Port Charlotte, and Fort Myers, was given just\nseven days\nto respond before the release.\nQilin recycles Scattered Spider playbook in wave of healthcare breaches\nIn June 2025,\nQilin\nbecame the most active ransomware group, recording 81 victims,\n52 of them in the healthcare sector\n.\nThe group exploited unpatched Fortinet vulnerabilities (CVE-2024-21762 and CVE-2024-55591) to gain access, deploy ransomware, and exfiltrate sensitive data such as EHRs and insurance records.\nTo maximize pressure, Qilin went beyond encryption, leveraging legal-themed extortion tactics like a \"\nCall Lawyer\n\" feature and automated negotiation tools to drive faster payouts.\nSimulate Summer 2025 Cyber Attacks to Validate Your Defenses\nProactively test and validate your security controls against Summer 2025’s most impactful threats—including Interlock, Qilin, DragonForce, Scattered Spider, and ToolShell—with the Picus Security Validation Platform.\nStart your 14-day free trial now and discover your readiness in minutes.\nTest with a Free Trial\nMajor Brands Breached in Retail Cybercrime Wave\nThe retail sector couldn't escape the wave of cyberattacks sweeping through Summer 2025.\nLouis Vuitton breach marks third in a quarter\nOn July 2, 2025, Louis Vuitton UK suffered a data breach exposing customer contact info and purchase history, its third LVMH brand breach in three months after Dior and LV Korea.\nDays later, on July 10, UK police arrested four suspects tied to high-profile attacks on M&S, Co-op, and Harrods.\nThe group is allegedly linked to\nScattered Spider\n, a domestic threat actor known for social engineering and collaboration with ransomware operators like DragonForce, signaling the growing impact of homegrown cybercriminals on major retailers.\nDragonForce hits US retail chain Belk\nBetween May 7 and 11, 2025, on the other side of the Atlantic, North Carolina, based retailer Belk suffered a data breach.\nDragonForce\nclaimed responsibility, stating it exfiltrated 156 GB of customer and employee data, including names, Social Security numbers, emails, order histories, and HR files, which were later posted on its leak site after ransom negotiations stalled.\nDragonForce, first emerging in late 2023, operates as a ransomware-as-a-service cartel, listing approximately 136 victims by March 2025, many of whom are in US and UK retail organizations.\nScattered Spider's tactics have shifted from retail to insurance\nScattered Spider (UNC3944), a native English-speaking cybercriminal collective, used identity-centric social engineering, voice phishing, MFA fatigue, help-desk impersonation, and typosquatted domains to breach UK retailers (M&S, Co-op, Harrods) in\nApril–May 2025\n.\nIn\nmid-June 2025\n, the researchers flagged that Scattered Spider (UNC3944) had shifted from retail to targeting US insurance firms.\nAflac\ndetected and contained unauthorized access on June 12, 2025; customer and employee personal data (including SSNs, health claims) may have been compromised.\nErie Insurance and Philadelphia Insurance Companies\nalso reported similar cyber disruptions in early to mid-June, resulting in operational downtime.\nThe intrusions matched Scattered Spider's known tactical profile, though no ransomware was deployed, and systems remained operational.\nState-Sponsored and Geopolitical Cyber Activity\nNot all cyber threats this summer were about money.\nNation-state hackers and hacktivists also made their mark, using the turbulent geopolitical climate to launch attacks.\nJune 14–17, 2025:\nPro-Israel hacktivist group Predatory Sparrow hit Iran's Bank Sepah, disrupting banking services, then destroyed ~$90M in crypto by breaching Nobitex and sending tokens to burn wallets.\nJune 30, 2025:\nThe US Department of Homeland Security and CISA issued a joint alert warning of impending\nIranian cyber retaliation\ntargeting critical infrastructure in the US and Europe.\nThese incidents serve as a stark reminder that cyber conflict is now a frontline extension of geopolitical tension, one that can ripple far beyond borders and sectors.\nKey Vulnerabilities Gaining Public Attention\nMultiple Microsoft SharePoint vulnerabilities were exploited this summer in a widespread cyber espionage campaign known as\nToolShell\n.\nCVE-2025-53770\nis a critical remote code execution flaw allowing unauthenticated attackers to run arbitrary code on vulnerable on-prem SharePoint servers. Threat actors used it to deploy web shells, steal credentials, and move laterally through enterprise networks. CISA added the bug to its\nKEV\ncatalog on\nJuly 20, 2025\n.\nCVE-2025-49704\nand\nCVE-2025-49706\nwere also added to the KEV on\nJuly 22\nafter being abused in chained attacks. The pair enables authentication bypass and code injection, allowing attackers to exploit unpatched SharePoint systems even if earlier fixes were applied.\nThe ToolShell campaign targeted organizations across the US, Europe, and the Middle East, including government agencies, energy firms, and telecom providers.\nSecurity researchers say the attackers likely reverse-engineered Microsoft's July Patch Tuesday fixes to develop the bypass used in CVE-2025-53770.\nWhat to Take from the Summer Wildfires in Cybersecurity?\nFrom hospitals to retail giants and insurance providers to nation-states, the season exposed cracks in even the most fortified environments.\nHere's what security teams should do next.\nPatch like your life depends on it, because they do in critical sectors.\nStart with CISA KEV entries and high-severity CVEs, but don't stop there. Ask the harder question:\nare you the kind of target that attackers go after?\nValidate\nwhether each CVE is actually exploitable in your environment.\nFocus on exploit chains, not just the scores. That's what adversaries are doing.\nHarden identity as your new perimeter.\nSocial engineering worked better than malware this summer. Stop MFA fatigue attacks, reinforce help-desk verification, and limit privileged access.\nTrain your humans, because they were the breach point.\nScattered Spider and others didn't exploit a CVE; they exploited a person. Run regular simulations, update phishing scenarios, and prepare high-risk roles for real-world lures.\nWatch for what happens after initial access.\nThreat actors like Interlock and Qilin didn't just drop ransomware; they moved laterally, staged data, and evaded detection. Implement behavioral monitoring for techniques, such as PowerShell abuse, credential theft, and stealthy exfiltration.\nDon't ignore legacy systems and overlooked infrastructure.\nDon't ignore legacy systems and overlooked infrastructure. The ToolShell campaign exploited\nunpatched on-prem SharePoint servers\n, many running unsupported or outdated versions.\nWhether it's aging on-prem SharePoint, appliances, or unmonitored legacy gear, isolate what you can't upgrade, monitor what you can't patch, and replace what you've ignored.\nWe strongly suggest simulating the mentioned attacks to test the effectiveness of your security controls against real-life cyber attacks using the Picus Security Validation Platform.\nYou can also test your defenses against hundreds of other malware and exploitation campaigns, such as Medusa, Rhysida, and Black Basta, within minutes with a\n14-day free trial of the Picus Platform\n.\nSponsored and written by\nPicus Security\n."
    },
    {
        "Title": "Cisco discloses data breach impacting Cisco.com user accounts",
        "Link": "https://www.bleepingcomputer.com/news/security/cisco-discloses-data-breach-impacting-ciscocom-user-accounts/",
        "Summary": "Cisco has disclosed that cybercriminals stole the basic profile information of users registered on Cisco.com following a voice phishing (vishing) attack that targeted a company representative. [...]",
        "Date": "2025-08-05",
        "Content": "Cisco has disclosed that cybercriminals stole the basic profile information of users registered on Cisco.com following a voice phishing (vishing) attack that targeted a company representative.\nAfter becoming aware of the incident on July 24th, the networking equipment giant discovered that the attacker tricked an employee and gained access to a third-party cloud-based Customer Relationship Management (CRM) system used by Cisco.\nThis allowed the threat actor to steal the personal and user information of individuals with Cisco.com user accounts, including names, organization names, addresses, Cisco-assigned user IDs, email addresses, phone numbers, and account metadata such as creation dates.\nHowever, the company said that the attacker didn't obtain \"organizational customers' confidential or proprietary information, or any passwords or other types of sensitive information.\" Cisco added that the incident didn't impact its products or services, and no other Cisco CRM system instances were affected.\n\"Upon learning of the incident, the actor's access to that CRM system instance was immediately terminated and Cisco commenced an investigation. Cisco has engaged with data protection authorities and notified affected users where required by law,\"\nthe company said\n.\n\"We are implementing further security measures to mitigate the risk of similar incidents occurring in the future, including re-educating personnel on how to identify and protect against potential vishing attacks.\"\nCisco has yet to disclose how many individuals had their personal and user account information stolen in the incident, and whether the attackers requested a ransom in exchange for not leaking the stolen data online.\nSalesforce CRM data breaches\nAlthough not yet confirmed by the company, this is\nlikely part of an ongoing wave\nof Salesforce data theft attacks using vishing and social engineering techniques that have been\nlinked to the ShinyHunters extortion group\n.\nOther high-profile companies have been impacted by Salesforce data breaches in recent weeks, including\nAdidas\n,\nQantas\n,\nAllianz Life\n, LVMH brands\nLouis Vuitton\n,\nDior\n, and\nTiffany & Co.\n, as well as fashion giant\nChanel\n.\nA Cisco spokesperson was not immediately available when contacted by BleepingComputer to share more details on the number of affected individuals and to confirm the data was stolen from a compromised Salesforce instance.\nIn October, Cisco also had to\ntake its public DevHub portal offline\nafter a threat actor known as IntelBroker\nleaked \"non-public\" data\non the BreachForums hacking forum.\nOne month later, the company\nconfirmed\nthat the threat actor downloaded the files from a misconfigured public-facing DevHub portal, including some belonging to CX Professional Services customers.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nFashion giant Chanel hit in wave of Salesforce data theft attacks\nShinyHunters behind Salesforce data theft attacks at Qantas, Allianz Life, and LVMH\nAllianz Life confirms data breach impacts majority of 1.4 million customers\nRetail giant Ahold Delhaize says data breach affects 2.2 million people\nOxford City Council suffers breach exposing two decades of data"
    },
    {
        "Title": "SonicWall urges admins to disable SSLVPN amid rising attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/sonicwall-urges-admins-to-disable-sslvpn-amid-rising-attacks/",
        "Summary": "SonicWall has warned customers to disable SSLVPN services due to ransomware gangs potentially exploiting an unknown security vulnerability in SonicWall Gen 7 firewalls to breach networks over the past few weeks. [...]",
        "Date": "2025-08-05",
        "Content": "SonicWall has warned customers to disable SSLVPN services due to ransomware gangs potentially exploiting an unknown security vulnerability in SonicWall Gen 7 firewalls to breach networks over the past few weeks.\nThe warning comes after Arctic Wolf Labs\nreported on Friday\nthat it had observed multiple Akira ransomware attacks, likely using a SonicWall zero-day vulnerability, since July 15th.\n\"The initial access methods have not yet been confirmed in this campaign,\" the Arctic Wolf Labs researchers said. \"While the existence of a zero-day vulnerability is highly plausible, credential access through brute force, dictionary attacks, and credential stuffing have not yet been definitively ruled out in all cases.\"\nArctic Wolf also advised SonicWall administrators on Friday to temporarily disable SonicWall SSL VPN services due to the strong possibility that a SonicWall zero-day vulnerability was being exploited in these attacks.\nCybersecurity company Huntress\nhas also confirmed\nArctic Wolf's findings on Monday and published a report providing indicators of compromise (IOCs) collected while investigating this campaign.\n\"A likely zero-day vulnerability in SonicWall VPNs is being actively exploited to bypass MFA and deploy ransomware,\" Huntress warned. \"Huntress advises disabling the VPN service immediately or severely restricting access via IP allow-listing. We're seeing threat actors pivot directly to domain controllers within hours of the initial breach.\"\nThe same day, SonicWall confirmed it is aware of this campaign and published an advisory urging customers to secure their firewalls against ongoing attacks by:\nDisabling SSL VPN services whenever possible,\nLimiting SSL VPN connectivity to trusted source IP addresses,\nEnabling security services such as Botnet Protection and Geo-IP Filtering to identify and block known threat actors targeting SSL VPN endpoints,\nEnforcing Multi-Factor Authentication (MFA) for all remote access to minimize the risk of credential abuse,\nRemoving unused accounts.\n\"Over the past 72 hours, there has been a notable increase in both internally and externally reported cyber incidents involving Gen 7 SonicWall firewalls where SSLVPN is enabled,\"\nthe company said\n.\n\"We are actively investigating these incidents to determine whether they are connected to a previously disclosed vulnerability or if a new vulnerability may be responsible. Please remain vigilant and apply the above mitigations immediately to reduce exposure while we continue our investigation.\"\nTwo weeks ago,\nSonicWall also warned admins\nto patch their SMA 100 appliances against a critical security vulnerability (CVE-2025-40599) that may be exploited to gain remote code execution on unpatched devices.\nAlthough attackers would require admin privileges to exploit CVE-2025-40599, and there is currently no evidence of active exploitation of this vulnerability, the company still urged customers to secure their SMA 100 appliances, as these devices are already being targeted in\nattacks that use compromised credentials\nto deploy the new OVERSTEP rootkit malware.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nSonicWall firewall devices hit in surge of Akira ransomware attacks\nCISA and FBI warn of escalating Interlock ransomware attacks\nAndroid gets patches for Qualcomm flaws exploited in attacks\nRansomware gangs join attacks targeting Microsoft SharePoint servers\nMozilla warns of phishing attacks targeting add-on developers"
    },
    {
        "Title": "Android gets patches for Qualcomm flaws exploited in attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/android-gets-patches-for-qualcomm-flaws-exploited-in-attacks/",
        "Summary": "Google has released security patches for six vulnerabilities in Android's August 2025 security update, including two Qualcomm flaws exploited in targeted attacks. [...]",
        "Date": "2025-08-05",
        "Content": "Google has released security patches for six vulnerabilities in Android's August 2025 security update, including two Qualcomm flaws exploited in targeted attacks.\nThe two security bugs, tracked as\nCVE-2025-21479\nand\nCVE-2025-27038\n, were reported through the Google Android Security team in late January 2025.\nThe first is a Graphics framework incorrect authorization weakness that can lead to memory corruption due to unauthorized command execution in the GPU micronode while executing a specific sequence of commands. CVE-2025-27038, on the other hand, is a use-after-free vulnerability that causes memory corruption while rendering graphics using Adreno GPU drivers in Chrome.\nGoogle has now integrated the patches\nannounced by Qualcomm in June\n, when the wireless tech giant warned that \"There are indications from Google Threat Analysis Group that CVE-2025-21479, CVE-2025-21480, CVE-2025-27038 may be under limited, targeted exploitation.\"\n\"Patches for the issues affecting the Adreno Graphics Processing Unit (GPU) driver have been made available to OEMs in May together with a strong recommendation to deploy the update on affected devices as soon as possible,\" Qualcomm said.\nCISA\nhas also added\nthe two security bugs to its catalog of actively exploited vulnerabilities on June 3rd, ordering federal agencies to secure their devices against ongoing attacks by June 24.\nWith this month's Android security updates, Google has also fixed a critical security vulnerability in the System component that attackers with no privileges can exploit to gain remote code execution when chained with other flaws in attacks that don't require user interaction.\nGoogle has issued two sets of security patches: the\n2025-08-01\nand\n2025-08-05\nsecurity patch levels. The latter bundles all fixes from the first batch and patches for closed-source third-party and kernel subcomponents, which may not apply to all Android devices.\nWhile Google Pixel devices receive security updates immediately, other vendors will often take longer to test andtweak them for their specific hardware configurations.\nIn March, Google also\npatched two zero-day vulnerabilities\nexploited in targeted attacks by Serbian authorities to unlock confiscated Android devices.\nLast November, the company addressed\na second Android zero-day\n(CVE-2024-43047) used by the\nSerbian government in NoviSpy spyware attacks\n, which was first tagged as exploited\nby Google Project Zero\nin October.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nGoogle fixes actively exploited sandbox escape zero day in Chrome\nGoogle fixes fourth actively exploited Chrome zero-day of 2025\nHackers exploited Windows WebDav zero-day to drop malware\nLovense sex toy app flaw leaks private user email addresses\nSpikes in malicious activity precede new security flaws in 80% of cases"
    },
    {
        "Title": "Microsoft increases Zero Day Quest prize pool to $5 million",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-announces-5-million-prize-pool-for-zero-day-quest-hacking-contest/",
        "Summary": "Microsoft will offer up to $5 million in bounty awards at this year's Zero Day Quest hacking contest, which the company describes as the \"largest hacking event in history.\" [...]",
        "Date": "2025-08-05",
        "Content": "Microsoft will offer up to $5 million in bounty awards at this year's Zero Day Quest hacking contest, which the company describes as the \"largest hacking event in history.\"\nLast year's Zero Day Quest has also generated significant participation from the security community\n, following Microsoft's\noffer of\n$4 million\nin rewards for vulnerabilities in cloud and AI products and platforms. After the November hacking competition concluded, Microsoft announced that it had\npaid $1.6 million\n, having received more than 600 vulnerability submissions.\nFor this year's competition, Redmond has increased the prize pool to $5 million, with a focus on addressing security issues in cloud computing and artificial intelligence.\nBetween August 4 and October 4, 2025, Microsoft will accept submissions as part of a research challenge open to all security researchers, with participants also eligible for multiplied bounty payouts for reporting critical vulnerabilities.\n\"To recognize and reward the most impactful research, we are offering +50% bounty multiplier for Critical severity vulnerabilities and high-impact scenarios discovered during the Research Challenge that align with the new and existing Microsoft Azure, Copilot, Dynamics 365 and Power Platform, Identity, or M365 Bounty Programs,\" Microsoft said. \"If your submission qualifies for both general and high-impact multipliers, the higher value applies.\"\nTop-performing researchers will qualify for a live hacking event at Microsoft's Redmond campus in Spring 2026. The invitation-only competition will bring together leading security researchers to collaborate directly with the Microsoft Security Response Center and Microsoft product teams.\nThe company also plans to support participants through training sessions from its AI Red Team, MSRC, and Dynamics teams covering AI system testing, bug bounty programs, and security research methodologies.\nThe contest is part of Microsoft's Secure Future Initiative (SFI), a cybersecurity engineering effort launched in November 2023, following a report from the Cyber Safety Review Board of the U.S. Department of Homeland Security, which\nstated\nthat the company's security culture was \"inadequate and requires an overhaul.\"\n\"As part of our Secure Future Initiative (SFI), we will transparently share critical vulnerabilities through the CVE program, even if no customer action is required,\"\nMicrosoft said\n. \"Learnings from the Zero Day Quest will be shared across Microsoft to help improve Cloud and AI security in alignment with SFI's core principles: securing by default, by design, and in operations.\"\nOn Friday, Microsoft also revealed that it has\nincreased rewards to $40,000\nfor some .NET and ASP.NET Core vulnerabilities and expanded its .NET bug bounty program.\nEarlier this year, the company also announced\nincreased bounty awards\nof up to $30,000 for Power Platform and Dynamics 365 AI vulnerabilities, as well as\nhigher payouts\nfor moderate-severity Microsoft Copilot (AI) security flaws. Additionally, a 100% award multiplier was introduced for all Copilot bounty awards to incentivize AI research.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft now pays up to $40,000 for some .NET vulnerabilities\nOpenAI prepares new open weight models along with GPT-5\nOpenAI may be testing a cheaper paid plan for ChatGPT\nAI-powered Cursor IDE vulnerable to prompt-injection attacks\nMicrosoft Edge now an 'AI-powered browser' with Copilot Mode"
    },
    {
        "Title": "Pandora Confirms Third-Party Data Breach, Warns of Phishing Attempts",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/pandora-third-party-data-breach",
        "Summary": "The jewelry retailer is warning customers that their data can and might be used maliciously.",
        "Date": "2025-08-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/pandora-third-party-data-breach"
    },
    {
        "Title": "RCE Flaw in AI-Assisted Coding Tool Poses Software Supply Chain Risk",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/rce-flaw-ai-coding-tool-supply-chain-risk",
        "Summary": "A critical vulnerability in the trust model of Cursor, a fast-growing tool for LLM-assisted development, allows for silent and persistent remote code execution.",
        "Date": "2025-08-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/rce-flaw-ai-coding-tool-supply-chain-risk"
    },
    {
        "Title": "Cisco User Data Stolen in Vishing Attack",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/cisco-user-data-stolen-vishing-attack",
        "Summary": "The networking giant said this week that an employee suffered a voice phishing attack that resulted in the compromise of select user data, including email addresses and phone numbers.",
        "Date": "2025-08-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/cisco-user-data-stolen-vishing-attack"
    },
    {
        "Title": "Why the Old Ways Are Still the Best for Most Cybercriminals",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/old-ways-still-best-most-cybercriminals",
        "Summary": "While the cybercrime underground has professionalized and become more organized in recent years, threat actors are, to a great extent, still using the same attack methods today as they were in 2020.",
        "Date": "2025-08-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/old-ways-still-best-most-cybercriminals"
    },
    {
        "Title": "Google Chrome Enterprise: More Than an Access Point to the Web",
        "Link": "https://www.darkreading.com/endpoint-security/google-chrome-enterprise-more-than-an-access-point-web",
        "Summary": "In a conversation with Dark Reading's Terry Sweeney, Lauren Miskelly from Google explains that Chrome Enterprise is the same Chrome browser that consumers use, but with additional enterprise-grade controls, reporting capabilities, and administrative features.",
        "Date": "2025-08-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/google-chrome-enterprise-more-than-an-access-point-web"
    },
    {
        "Title": "Microsoft’s Project Ire Autonomously Reverse Engineers Software to Find Malware",
        "Link": "https://www.securityweek.com/microsofts-project-ire-autonomously-reverse-engineers-software-to-find-malware/",
        "Summary": "<p>Microsoft has unveiled Project Ire, a prototype autonomous AI agent that can analyze any software file to determine if it’s malicious.</p>\n<p>The post <a href=\"https://www.securityweek.com/microsofts-project-ire-autonomously-reverse-engineers-software-to-find-malware/\">Microsoft&#8217;s Project Ire Autonomously Reverse Engineers Software to Find Malware</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/microsofts-project-ire-autonomously-reverse-engineers-software-to-find-malware/"
    },
    {
        "Title": "Cisco Says User Data Stolen in CRM Hack",
        "Link": "https://www.securityweek.com/cisco-says-user-data-stolen-in-crm-hack/",
        "Summary": "<p>Cisco has disclosed a data breach affecting Cisco.com user accounts, including names, email address, and phone numbers.</p>\n<p>The post <a href=\"https://www.securityweek.com/cisco-says-user-data-stolen-in-crm-hack/\">Cisco Says User Data Stolen in CRM Hack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cisco-says-user-data-stolen-in-crm-hack/"
    },
    {
        "Title": "Black Hat USA 2025 – Summary of Vendor Announcements (Part 1)",
        "Link": "https://www.securityweek.com/black-hat-usa-2025-summary-of-vendor-announcements-part-1/",
        "Summary": "<p>Many companies are showcasing their products and services this week at the 2025 edition of the Black Hat conference in Las Vegas.</p>\n<p>The post <a href=\"https://www.securityweek.com/black-hat-usa-2025-summary-of-vendor-announcements-part-1/\">Black Hat USA 2025 – Summary of Vendor Announcements (Part 1)</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/black-hat-usa-2025-summary-of-vendor-announcements-part-1/"
    },
    {
        "Title": "Vibe Coding: When Everyone’s a Developer, Who Secures the Code?",
        "Link": "https://www.securityweek.com/vibe-coding-when-everyones-a-developer-who-secures-the-code/",
        "Summary": "<p>As AI makes software development accessible to all, security teams face a new challenge: protecting applications built by non-developers at unprecedented speed and scale.</p>\n<p>The post <a href=\"https://www.securityweek.com/vibe-coding-when-everyones-a-developer-who-secures-the-code/\">Vibe Coding: When Everyone’s a Developer, Who Secures the Code?</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/vibe-coding-when-everyones-a-developer-who-secures-the-code/"
    },
    {
        "Title": "Approov Raises $6.7 Million for Mobile App Security",
        "Link": "https://www.securityweek.com/approov-raises-6-7-million-for-mobile-app-security/",
        "Summary": "<p>Approov has raised $6.7 million in Series A funding to advance its mobile application and API security solutions.</p>\n<p>The post <a href=\"https://www.securityweek.com/approov-raises-6-7-million-for-mobile-app-security/\">Approov Raises $6.7 Million for Mobile App Security</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/approov-raises-6-7-million-for-mobile-app-security/"
    },
    {
        "Title": "Android’s August 2025 Update Patches Exploited Qualcomm Vulnerability",
        "Link": "https://www.securityweek.com/androids-august-2025-update-patches-exploited-qualcomm-vulnerability/",
        "Summary": "<p>Android’s light August 2025 security update resolves an Adreno GPU vulnerability confirmed as exploited in June.</p>\n<p>The post <a href=\"https://www.securityweek.com/androids-august-2025-update-patches-exploited-qualcomm-vulnerability/\">Android&#8217;s August 2025 Update Patches Exploited Qualcomm Vulnerability</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/androids-august-2025-update-patches-exploited-qualcomm-vulnerability/"
    },
    {
        "Title": "Microsoft Offers $5 Million at Zero Day Quest Hacking Contest",
        "Link": "https://www.securityweek.com/microsoft-offers-5-million-at-zero-day-quest-hacking-contest/",
        "Summary": "<p>Research demonstrating high-impact cloud and AI security flaws will be rewarded at Microsoft’s Zero Day Quest competition in spring 2026.</p>\n<p>The post <a href=\"https://www.securityweek.com/microsoft-offers-5-million-at-zero-day-quest-hacking-contest/\">Microsoft Offers $5 Million at Zero Day Quest Hacking Contest</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/microsoft-offers-5-million-at-zero-day-quest-hacking-contest/"
    },
    {
        "Title": "SonicWall Hunts for Zero-Day Amid Surge in Firewall Exploitation",
        "Link": "https://www.securityweek.com/sonicwall-hunts-for-zero-day-amid-surge-in-firewall-exploitation/",
        "Summary": "<p>Threat actors might be exploiting a zero-day vulnerability in SonicWall firewalls in a fresh wave of ransomware attacks.</p>\n<p>The post <a href=\"https://www.securityweek.com/sonicwall-hunts-for-zero-day-amid-surge-in-firewall-exploitation/\">SonicWall Hunts for Zero-Day Amid Surge in Firewall Exploitation</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-05",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/sonicwall-hunts-for-zero-day-amid-surge-in-firewall-exploitation/"
    },
    {
        "Title": "DEVMAN Ransomware Gang Targets Major Asian Travel Group Diethelm Travel and Brazilian Energy Firm Ruff",
        "Link": "https://dailydarkweb.net/devman-ransomware-gang-targets-major-asian-travel-group-diethelm-travel-and-brazilian-energy-firm-ruff/",
        "Summary": "The DEVMAN 2.0 ransomware group has allegedly targeted two major companies, Diethelm Travel, a leading travel group in Asia, and Ruff, a Brazilian fuel distributor. The attackers are demanding ransoms of 1.8 million USD from Diethelm Travel and 1 million USD from Ruff, claiming to have exfiltrated 175GB and 220GB of data respectively from the [&#8230;]",
        "Date": "2025-08-05",
        "Content": "The DEVMAN 2.0 ransomware group has allegedly targeted two major companies, Diethelm Travel, a leading travel group in Asia, and Ruff, a Brazilian fuel distributor. The attackers are demanding ransoms of 1.8 million USD from Diethelm Travel and 1 million USD from Ruff, claiming to have exfiltrated 175GB and 220GB of data respectively from the companies.\nThe DEVMAN 2.0 gang announced the attacks on its dark web leak site, threatening to release the stolen data if the ransoms are not paid. This incident highlights the continuing trend of ransomware groups targeting critical and economically important sectors across the globe. The choice of victims, a major player in the Asian tourism sector and a significant energy company in Brazil, shows the broad and opportunistic nature of these cybercriminal operations.\nDiethelm Travel:\nNow known as DTH Travel, it is an award-winning travel and destination management company with a history of over 66 years. It operates across 14 countries in Asia and is a significant entity in the continent’s tourism industry.\nRuff (ruff.com.br):\nA Brazilian fuel distributor and energy storage service provider founded in 1995. The company is a key player in the Brazilian energy market, with operations in several states and has been recognized as one of the top companies in the country’s oil and gas sector.\nTags:\nBrazil\nCyberSecurity\ndata-leak\nDEVMAN\nDiethelm Travel\nransomware\nRuff\nThailand"
    },
    {
        "Title": "Scania Hit By Alleged Ransomware Attack",
        "Link": "https://dailydarkweb.net/scania-hit-by-alleged-ransomware-attack/",
        "Summary": "The ransomware group known as TEAM XXX has allegedly targeted Scania, a major Swedish commercial vehicle manufacturer and a key part of the Volkswagen Group. Following the attack, the group began leaking files purportedly stolen from Scania&#8217;s insurance subdomain, claiming the company had denied the breach and refused to engage. Scania, a global leader in [&#8230;]",
        "Date": "2025-08-05",
        "Content": "The ransomware group known as\nTEAM XXX\nhas allegedly targeted\nScania\n, a major Swedish commercial vehicle manufacturer and a key part of the\nVolkswagen Group\n. Following the attack, the group began leaking files purportedly stolen from Scania’s insurance subdomain, claiming the company had denied the breach and refused to engage.\nScania, a global leader in transport solutions including trucks, buses, and industrial engines, is headquartered in Södertalje, Sweden. The incident highlights the growing trend of “double extortion” ransomware attacks, where cybercriminals not only encrypt a victim’s data but also exfiltrate it, threatening to publish the sensitive information online to pressure the company into paying the ransom. The ransomware group claimed on its leak site that it targeted a major vulnerability on the “insurance.scania.com” portal and decided to publish the data after the company “completely denied” that its systems were compromised.\nThe attackers’ post warned that “Important documents containing keys for the switches of those who have Clearance their vehicles were found in the files.” An initial review of the directory of leaked files suggests a wide range of potentially sensitive corporate and client information has been exposed. The titles of the leaked files include:\nDept G Corp Council files (.xls)\nFactura (invoice) documents (.pdf)\nRecovery payment documents (.pdf)\nTransordizia RP files (.pdf)\nEngine Specification documents (.doc)\nCMR documents (.pdf)\nTags:\nAutomotive\nCyberSecurity\ndata-leak\ndouble extortion\nransomware\nScania\nsweden\nTEAM XXX"
    },
    {
        "Title": "Aftership Allegedly Suffers Major Data Breach – Nearly 850,000 Records Leaked",
        "Link": "https://dailydarkweb.net/aftership-allegedly-suffers-major-data-breach-nearly-850000-records-leaked/",
        "Summary": "A significant data breach has allegedly hit Aftership, a major logistics and parcel delivery service provider, with a database containing nearly 850,000 records appearing on a dark web forum. A threat actor posted the data dump on August 5, 2025, claiming it is a private collection of user and company information primarily from China and [&#8230;]",
        "Date": "2025-08-05",
        "Content": "A significant data breach has allegedly hit Aftership, a major logistics and parcel delivery service provider, with a database containing nearly 850,000 records appearing on a dark web forum. A threat actor posted the data dump on August 5, 2025, claiming it is a private collection of user and company information primarily from China and Hong Kong. The actor asserts the data is highly accurate, having been verified as recently as December 2024, posing a substantial threat to the individuals and businesses whose information has been exposed.\nAftership is a critical component in the e-commerce logistics chain, providing shipment tracking solutions for a vast network of businesses, including the prominent Chinese delivery company Yunda Express. The platform is essential for domestic and cross-border e-commerce in the region. The breach allegedly exposes sensitive details belonging to a wide array of individuals, including company staff, clients, and agents. The availability of this data could lead to sophisticated phishing attacks, identity theft, and other malicious activities targeting the platform’s users.\nThe threat actor detailed the contents of the compromised database, which purportedly includes a wide range of personally identifiable and account information. The allegedly leaked data fields include:\nUser IDs, nicknames, and real names\nMobile phone numbers and email addresses\nUsernames and over 18,000 credential hashes\nUser account balance information and payment passwords\nWeixin (WeChat) and OpenID details\nAccount registration time and status\nAgent level and bonus information\nTags:\nAftership\nChina\nCyberSecurity\ndata-breach\nhong kong\nLogistics\nYunda Express"
    },
    {
        "Title": "Qilin Ransomware Allegedly Breaches STS Alpresor and Eastern Adjustment Company",
        "Link": "https://dailydarkweb.net/qilin-ransomware-allegedly-breaches-sts-alpresor-and-eastern-adjustment-company/",
        "Summary": "The Qilin ransomware group has allegedly claimed responsibility for successful cyberattacks against two disparate international companies, leaking a significant amount of data for both. The victims, a major Swedish tour operator and a US-based insurance adjustment firm, appeared on the threat actor&#8217;s dark web leak site on August 4th. The group has published files allegedly [&#8230;]",
        "Date": "2025-08-05",
        "Content": "The Qilin ransomware group has allegedly claimed responsibility for successful cyberattacks against two disparate international companies, leaking a significant amount of data for both. The victims, a major Swedish tour operator and a US-based insurance adjustment firm, appeared on the threat actor’s dark web leak site on August 4th. The group has published files allegedly stolen from both organizations, exposing sensitive customer and corporate information to the public.\nThe targeted organizations are:\nSTS Alpresor:\nDescribed as the largest tour operator in the Nordic region, STS Alpresor has been operating since 1976. The Swedish company serves approximately 50,000 travelers annually, organizing trips to the Alps from Sweden, Norway, and Finland.\nEastern Adjustment Company, Inc.:\nA locally-owned Independent Adjusting firm in the United States. The company specializes in assisting insurers with the adjustment of losses and claims related to fire, marine, casualty, and both personal and commercial property.\nThe data leak from STS Alpresor is allegedly comprehensive, with the attackers claiming to have published the company’s “full archive.” This allegedly includes sensitive customer booking information such as names, phone numbers, and reservation details. The breach also purportedly exposed internal corporate data. For Eastern Adjustment Company, the attackers claim to have leaked 11 GB of data, including what appears to be sensitive client claim forms, licensee personal information, and internal employee lists.\nTags:\ncyberattack\ndata-leak\nEastern Adjustment Company\nInsurance\nQilin\nransomware\nSTS Alpresor\nsweden\nTravel\nUSA"
    },
    {
        "Title": "Major Turkish Travel Agency Biletall Allegedly Breached – 6 Million Customer Records Leaked",
        "Link": "https://dailydarkweb.net/major-turkish-travel-agency-biletall-allegedly-breached-6-million-customer-records-leaked/",
        "Summary": "A significant data breach has allegedly targeted Biletall, a major online travel and ticketing agency based in Turkey. A threat actor has claimed on a dark web forum to have successfully exfiltrated a database containing the sensitive information of 6 million unique customers. The leaked data is purported to be recent, with the actor claiming [&#8230;]",
        "Date": "2025-08-05",
        "Content": "A significant data breach has allegedly targeted Biletall, a major online travel and ticketing agency based in Turkey. A threat actor has claimed on a dark web forum to have successfully exfiltrated a database containing the sensitive information of 6 million unique customers. The leaked data is purported to be recent, with the actor claiming it is “fresh as of Feb 2025.”\nBiletall is a prominent player in Türkiye’s transportation and logistics sector, providing a comprehensive online platform for booking bus, flight, ferry, and train tickets. The company serves millions of travelers and agencies across the country, making it a critical component of the nation’s digital travel infrastructure. The alleged breach could have significant privacy implications for a vast number of individuals who have used its services.\nThe threat actor detailed the contents of the compromised database, which allegedly includes a wide range of personally identifiable information (PII) and travel details. If confirmed, the exposure of such data could put affected customers at risk of phishing, identity theft, and other fraudulent activities. The following data has allegedly been compromised:\nFull Names\nEmail Addresses\nPhone Numbers\nTurkish National ID Numbers (TCKN)\nBooking and Travel Details (including PNR, price, and seat number)\nJourney Metadata (including origin, destination, and departure times)\nDevice Data\nTags:\nBiletall\nCyberSecurity\ndata-breach\ndata-leak\nPII\nTurkey"
    },
    {
        "Title": "La Mundial de Seguros Database Allegedly Leaked",
        "Link": "https://dailydarkweb.net/la-mundial-de-seguros-database-allegedly-leaked/",
        "Summary": "A threat actor has allegedly leaked the database of La Mundial de Seguros, a major insurance provider headquartered in Panama. The data was posted on a popular dark web forum, exposing sensitive information belonging to the company&#8217;s customers and advisers. La Mundial de Seguros is a significant player in the Panamanian insurance market, offering a [&#8230;]",
        "Date": "2025-08-05",
        "Content": "A threat actor has allegedly leaked the database of La Mundial de Seguros, a major insurance provider headquartered in Panama. The data was posted on a popular dark web forum, exposing sensitive information belonging to the company’s customers and advisers. La Mundial de Seguros is a significant player in the Panamanian insurance market, offering a wide range of products including life, health, auto, and commercial insurance. As a custodian of highly sensitive personal and financial information, a breach of this nature could have severe consequences for its clients.\nThe threat actor published samples of the database to prove their claims. The leaked data allegedly originates from several database tables and contains a substantial amount of Personally Identifiable Information (PII) and internal records. The exposure of such data puts affected individuals at a high risk of targeted phishing attacks, identity theft, and other fraudulent activities. The inclusion of adviser credentials, even if hashed, could potentially provide a pathway for further unauthorized access into the company’s systems if the passwords are weak.\nBased on the samples provided by the cybercriminal, the compromised information allegedly includes:\nCustomer/Quoter Information:\nFull names, email addresses, dates of birth, and country of residence.\nPayment Link Data:\nInternal payment tokens and identifiers.\nInsurance Adviser Data:\nFull names, email addresses, and hashed passwords.\nTags:\nCyberSecurity\ndark web\ndata-breach\nInsurance\nLa Mundial de Seguros\nPanama\nPII"
    }
]