[
    {
        "Title": "New TETRA Radio Encryption Flaws Expose Law Enforcement Communications",
        "Link": "https://thehackernews.com/2025/08/new-tetra-radio-encryption-flaws-expose.html",
        "Summary": "Cybersecurity researchers have discovered a fresh set of security issues in the Terrestrial Trunked Radio (TETRA) communications protocol, including in its proprietary end-to-end encryption (E2EE) mechanism that exposes the system to replay and brute-force attacks, and even decrypt encrypted traffic.\nDetails of the vulnerabilities – dubbed 2TETRA:2BURST – were presented at the Black Hat USA",
        "Date": "2025-08-11",
        "Content": "Cybersecurity researchers have discovered a fresh set of security issues in the Terrestrial Trunked Radio (TETRA) communications protocol, including in its proprietary end-to-end encryption (E2EE) mechanism that exposes the system to replay and brute-force attacks, and even decrypt encrypted traffic.\nDetails of the vulnerabilities – dubbed\n2TETRA:2BURST\n– were\npresented\nat the Black Hat USA security conference last week by Midnight Blue researchers Carlo Meijer, Wouter Bokslag, and Jos Wetzels.\nTETRA\nis a European mobile radio standard that's widely used by law enforcement, military, transportation, utilities, and critical infrastructure operators. It was developed by the European Telecommunications Standards Institute (ETSI). It encompasses four encryption algorithms: TEA1, TEA2, TEA3, and TEA4.\nThe disclosure comes a little over two years after the Netherlands-based cybersecurity company\ndiscovered\na set of\nsecurity vulnerabilities\nin TETRA standard called TETRA:BURST, counting what was described as an \"intentional backdoor\" that could be exploited to leak sensitive information.\nThe newly discovered issues relate to a case of packet injection in TETRA, as well as an insufficient fix for CVE-2022-24401, one of the five TETRA:BURST issues, to prevent keystream recovery attacks. The identified issues are listed below -\nCVE-2025-52940\n- TETRA end-to-end encrypted voice streams are vulnerable to replay attack. Furthermore, an attacker with no knowledge of the key may inject arbitrary voice streams, that are played back indistinguishably from authentic traffic by legitimate call recipients.\nCVE-2025-52941\n- TETRA end-to-end encryption algorithm ID 135 refers to an intentionally weakened AES-128 implementation which has its effective traffic key entropy reduced from 128 to 56 bits, rendering it vulnerable to brute-force attacks.\nCVE-2025-52942\n- End-to-end encrypted TETRA SDS messages feature no replay protection, allowing for arbitrary replay of messages towards either humans or machines.\nCVE-2025-52943\n- TETRA networks that support multiple Air Interface Encryption algorithms are vulnerable to key recovery attacks since the SCK/CCK network key is identical for all supported algorithms. When TEA1 is supported, an easily recovered TEA1 key (CVE-2022-24402) can be used to decrypt or inject TEA2 or TEA3 traffic on the network.\nCVE-2025-52944\n- The TETRA protocol lacks message authentication and therefore allows for the injection of arbitrary messages such as voice and data.\nETSI's fix for CVE-2022-24401 is ineffective in the prevention of keystream recovery attacks (No CVE, assigned a placeholder identifier\nMBPH-2025-001\n)\nMidnight Blue said the impact of the 2TETRA:2BURST depend on the use-cases and configuration aspects of each particular TETRA network, and that networks that use TETRA in a data-carrying capacity are particularly susceptible to packet injection attacks, potentially allowing attackers to intercept radio communications and inject malicious data traffic.\n\"Voice replay or injection scenarios (CVE-2025-52940) can cause confusion among legitimate users, which can be used as an amplifying factor in a larger-scale attack,\" the company said. \"TETRA E2EE users (also those not using Sepura Embedded E2EE) should in any case validate whether they may be using the weakened 56-bit variant (CVE-2025-52941).\"\n\"Downlink traffic injection is typically feasible using plaintext traffic, as we found radios will accept and process unencrypted downlink traffic even on encrypted networks. For uplink traffic injection, the keystream needs to be recovered.\"\nThere is no evidence of these vulnerabilities being exploited in the wild. That said, there are no patches that address the shortcomings, with the exception of MBPH-2025-001, for which a fix is expected to be released.\nMitigations for other flaws are listed below -\nCVE-2025-52940, CVE-2025-52942\n- Migrate to scrutinized, secure E2EE solution\nCVE-2025-52941\n- Migrate to non-weakened E2EE variant\nCVE-2025-52943\n- Disable TEA1 support and rotate all AIE keys\nCVE-2025-52944\n- When using TETRA in a data carrying capacity: add TLS/VPN layer on top of TETRA\n\"If you operate or use a TETRA network, you are certainly affected by CVE-2025-52944, in which we demonstrate it's possible to inject malicious traffic into a TETRA network, even with authentication and/or encryption enabled,\" Midnight Blue said.\n\"Also, CVE-2022-24401 likely affects you, as it allows adversaries to collect keystream for either breach of confidentiality or integrity. If you operate a multi-cipher network, CVE-2025-52943 poses a critical security risk.\"\nIn a statement shared with WIRED, ETSI\nsaid\nthe E2EE mechanism used in TETRA-based radios is not part of the ETSI standard, adding it was produced by The Critical Communications Association's (\nTCCA\n) security and fraud prevention group (SFPG). ETSI also noted that purchasers of TETRA-based radios are free to deploy other solutions for E2EE on their radios.\nThe findings also coincide with the discovery of three flaws in the Sepura SC20 series of mobile TETRA radios that allow attackers with physical access to the device to achieve unauthorized code execution -\nCVE-2025-52945\n- Defective file management restrictions\nCVE-2025-8458\n- Insufficient key entropy for SD card encryption\nExfiltration of all TETRA and TETRA E2EE key materials with the exception of the device-specific key K (no CVE, assigned a placeholder identifier\nMBPH-2025-003\n)\nPatches for CVE-2025-52945 and CVE-2025-8458 are expected to be made available in the third quarter of 2025, necessitating that users are advised to implement enhanced TETRA key management policies. MBPH-2025-003, on the other hand, cannot be remediated due to architectural limitations.\n\"The vulnerabilities enable an attacker to gain code execution on a Sepura Gen 3 device,\" the company\nsaid\n. \"Attack scenarios featuring CVE-2025-8458 involve persistent code execution through access to a device's SD card. Abuse of CVE-2025-52945 is even more straightforward as it requires only brief access to the device's PEI connector.\"\n\"From the premise of code execution, multiple attack scenarios are viable, such as exfiltration of TETRA key materials (MBPH-2025-003) or the implantation of a persistent backdoor into the radio firmware. This leads to the loss of confidentiality and integrity of TETRA communications.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Researchers Spot Surge in Erlang/OTP SSH RCE Exploits, 70% Target OT Firewalls",
        "Link": "https://thehackernews.com/2025/08/researchers-spot-surge-in-erlangotp-ssh.html",
        "Summary": "Malicious actors have been observed exploiting a now-patched critical security flaw impacting Erlang/Open Telecom Platform (OTP) SSH as early as beginning of May 2025, with about 70% of detections originating from firewalls protecting operational technology (OT) networks.\nThe vulnerability in question is CVE-2025-32433 (CVSS score: 10.0), a missing authentication issue that could be abused by an",
        "Date": "2025-08-11",
        "Content": "Malicious actors have been observed exploiting a now-patched critical security flaw impacting Erlang/Open Telecom Platform (OTP) SSH as early as beginning of May 2025, with about 70% of detections originating from firewalls protecting operational technology (OT) networks.\nThe vulnerability in question is\nCVE-2025-32433\n(CVSS score: 10.0), a missing authentication issue that could be abused by an attacker with network access to an Erlang/OTP SSH server to execute arbitrary code. It was patched in April 2025 with versions OTP-27.3.3, OTP-26.2.5.11, and OTP-25.3.2.20.\nThen in June 2025, the U.S. Cybersecurity and Infrastructure Security Agency (CISA)\nadded\nthe flaw to its Known Exploited Vulnerabilities (KEV) catalog, based on evidence of active exploitation.\n\"At the heart of Erlang/OTP's secure communication capabilities lies its native SSH implementation — responsible for encrypted connections, file transfers and most importantly, command execution,\" Palo Alto Networks Unit 42 researchers Adam Robbie, Yiheng An, Malav Vyas, Cecilia Hu, Matthew Tennis, and Zhanhao Chen\nsaid\n.\n\"A flaw in this implementation would allow an attacker with network access to execute arbitrary code on vulnerable systems without requiring credentials, presenting a direct and severe risk to exposed assets.\"\nThe cybersecurity company's analysis of telemetry data has revealed that over 85% of exploit attempts have primarily singled out healthcare, agriculture, media and entertainment, and high technology sectors in the U.S., Canada, Brazil, India, and Australia, among others.\nIn the attacks observed, the successful exploitation of CVE-2025-32433 is followed by the threat actors using reverse shells to gain unauthorized remote access to target networks. It's currently not known who is behind the efforts.\n\"This widespread exposure on industrial-specific ports indicates a significant global attack surface across OT networks,\" Unit 42 said. \"Analysis of affected industries demonstrates variance in the attacks.\"\n\"Attackers are attempting to exploit the vulnerability in short, high-intensity bursts. These are disproportionately targeting OT networks and attempting to access exposed services over both IT and industrial ports.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "⚡ Weekly Recap: BadCam Attack, WinRAR 0-Day, EDR Killer, NVIDIA Flaws, Ransomware Attacks & More",
        "Link": "https://thehackernews.com/2025/08/weekly-recap-badcam-attack-winrar-0-day.html",
        "Summary": "This week, cyber attackers are moving quickly, and businesses need to stay alert. They’re finding new weaknesses in popular software and coming up with clever ways to get around security. Even one unpatched flaw could let attackers in, leading to data theft or even taking control of your systems. The clock is ticking—if defenses aren’t updated regularly, it could lead to serious damage. The",
        "Date": "2025-08-11",
        "Content": "This week, cyber attackers are moving quickly, and businesses need to stay alert. They're finding new weaknesses in popular software and coming up with clever ways to get around security. Even one unpatched flaw could let attackers in, leading to data theft or even taking control of your systems. The clock is ticking—if defenses aren't updated regularly, it could lead to serious damage. The message is clear: don't wait for an attack to happen. Take action now to protect your business.\nHere's a look at some of the biggest stories in cybersecurity this week: from new flaws in WinRAR and NVIDIA Triton to advanced attack techniques you should know about. Let's get into the details.\n⚡ Threat of the Week\nTrend Micro Warns of Actively Exploited 0-Day\n— Trend Micro has released temporary mitigations to address critical security flaws in on-premise versions of Apex One Management Console that it said have been exploited in the wild. The vulnerabilities (CVE-2025-54948 and CVE-2025-54987), both rated 9.4 on the CVSS scoring system, have been described as management console command injection and remote code execution flaws. There are currently no details on how the issues are being exploited in real-world attacks. Trend Micro said it \"observed at least one instance of an attempt to actively exploit one of these vulnerabilities in the wild.\"\nEmployees Are Using AI To Improve Their Work But Creating Risk\nVPNs and public-facing IPs are your attack surface. Zero Trust + AI ensures safe public AI productivity.\nLearn More ➝\n🔔 Top News\nWinRAR 0-Day Under Active Exploitation\n— The maintainers of the WinRAR file archiving utility have released an update to address an actively exploited zero-day vulnerability. Tracked as CVE-2025-8088 (CVSS score: 8.8), the issue has been described as a case of path traversal affecting the Windows version of the tool that could be exploited to obtain arbitrary code execution by crafting malicious archive files. Russian cybersecurity vendor BI.ZONE, in a report published last week, said there are indications that the hacking group tracked as Paper Werewolf (aka GOFFEE) may have leveraged CVE-2025-8088 alongside CVE-2025-6218, a directory traversal bug in the Windows version of WinRAR that was patched in June 2025.\nNew Windows EPM Poisoning Exploit Chain Detailed\n— New findings presented at the DEF CON 33 security conference showed that a now-patched security issue in Microsoft's Windows Remote Procedure Call (RPC) communication protocol (CVE-2025-49760, CVSS score: 3.5) could be abused by an attacker to conduct spoofing attacks and impersonate a known server. The vulnerability essentially makes it possible to manipulate a core component of the RPC protocol and stage what's called an EPM poisoning attack that allows unprivileged users to pose as a legitimate, built-in service with the goal of coercing a protected process to authenticate against an arbitrary server of an attacker's choosing.\nBadCam Attack Targets Linux Webcams From Lenovo\n— Linux-based webcams from Lenovo, Lenovo 510 FHD and Lenovo Performance FHD, which are powered by a System on a Chip (SoC) and firmware made by the Chinese company SigmaStar, can be weaponized and turned into BadUSB vectors, allowing attackers to tamper with the firmware of the devices to execute malicious commands when connected to a computer. \"This allows remote attackers to inject keystrokes covertly and launch attacks independent of the host operating system,\" Eclypsium researchers Paul Asadoorian, Mickey Shkatov, and Jesse Michael said.\nThe Far-Reaching Scale of VexTrio Revealed\n— A new analysis of VexTrio has unmasked it as a \"cybercriminal organization with tendrils that are far-reaching,\" operating dozens of businesses and front companies across Europe, while posing as a legitimate ad tech firm to conduct various types of fraud. The cyber fraud network is assessed to be active in its present form since at least 2017. That said, suspected key figures behind the scheme have been linked to scam reports and sketchy domains since 2004. VexTrio's nerve center is Lugano, melding scam operations and traffic distribution schemes to maximize illicit revenue. It's also the result of two businesses, Tekka Group and AdsPro Group, joining forces in 2020. \"The merger created a formidable suite of commercial entities that touch every part of the ad tech industry,\" Infoblox said. VexTrio is known for using traffic distribution systems (TDSes) to filter and redirect web traffic based on specific criteria, as well as relying on sophisticated DNS manipulation techniques like fast-fluxing, DNS tunneling, and domain generation algorithms (DGAs) to rapidly change the IP addresses associated with their domains, establish covert command-and-control (C2) communication, and maintain persistent access with infected systems. Campaigns orchestrated the threat actor to leverage TDSes to hijack web users from compromised websites and redirect them to a variety of malicious destinations, from tech support scams and fake updates to phishing domains and exploit kits. The use of commercial entities to run the traffic distribution schemes offers several advantages to threat actors, both from an operational perspective as well as avoiding scrutiny from the infosec community and law enforcement by maintaining a veneer of legitimacy. The system works like any other ad tech network, only it's malicious in nature. The threat actors pay VexTrio-controlled firms as if they were legitimate customers, receiving a steady supply of hijacked traffic and unsuspecting victims through TDSes for a variety of threats, from cryptocurrency scams and fake captcha schemes. \"VexTrio employs a few hundred people globally. It's unclear how much the average VexTrio employee knows about the true business model,\" Infoblox said. The arrangement has proven to be extremely lucrative for VexTrio operators, who have been found leading a lavish lifestyle, sharing on social media about expensive cars and other luxuries.\nMultiple Flaws Patched in NVIDIA Triton Patched\n— Nvidia has patched a trio of vulnerabilities in its Triton inference server that could give unauthenticated remote attackers a way to take full control of susceptible servers. The new Triton vulnerabilities underscore a broader and rapidly growing category of AI-related threats that organizations must now factor into their security postures. With AI and ML tools becoming deeply embedded in critical business workflows, the attack surface has expanded in ways that traditional security frameworks aren't always equipped to handle. The emergence of new threats like AI supply chain integrity, model poisoning, prompt injection, and data leakage signals the need for securing the underlying infrastructure and practicing defense-in-depth.\n‎️‍🔥 Trending CVEs\nHackers are quick to jump on newly discovered software flaws – sometimes within hours. Whether it's a missed update or a hidden bug, even one unpatched CVE can open the door to serious damage. Below are this week's high-risk vulnerabilities making waves. Review the list, patch fast, and stay a step ahead.\nThis week's list includes —\nCVE-2025-8088\n(WinRAR),\nCVE-2025-55188\n(7-Zip),\nCVE-2025-4371\n(Lenovo 510 FHD and Performance FHD web cameras),\nCVE-2025-25050, CVE-2025-25215, CVE-2025-24922, CVE-2025-24311, CVE-2025-24919\n(Dell ControlVault3),\nCVE-2025-49827, CVE-2025-49831\n(CyberArk Secrets Manager),\nCVE-2025-6000\n(HashiCorp Vault),\nCVE-2025-53786\n(Microsoft Exchange Server),\nCVE-2025-30023\n(Axis Communications),\nCVE-2025-54948, CVE-2025-54987\n(Trend Micro Apex One Management Console),\nCVE-2025-23310, CVE-2025-23311, CVE-2025-23319\n(NVIDIA Triton),\nCVE-2025-54574\n(Squid Web Proxy),\nCVE-2025-7025, CVE-2025-7032, and CVE-2025-7033\n(Rockwell Automation Arena Simulation),\nCVE-2025-54253\n,\nCVE-2025-54254\n(Adobe Experience Manager Forms),\nCVE-2025-24285\n(Ubiquiti UniFi Connect EV Station),\nCVE-2025-38236\n(Linux Kernel),\nCVE-2025-2771\n,\nCVE-2025-2773\n(BEC Technologies routers),\nCVE-2025-25214, CVE-2025-48732\n(WWBN AVideo),\nCVE-2025-26469, and CVE-2025-27724\n(MedDream PACS Premium).\n📰 Around the Cyber World\nNVIDIA Rejects Backdoor Claims\n— GPU maker NVIDIA has rejected accusations that it has built backdoors or kill switches in its chips. \"There are no back doors in NVIDIA chips. No kill switches. No spyware. That's not how trustworthy systems are built—and never will be,\" Nvidia Chief Security Officer David Reber Jr.\nsaid\n. The development came after the Cyberspace Administration of China (CAC) said it held a meeting with NVIDIA over \"serious security issues\" in the company's chips and claimed that U.S. artificial intelligence (AI) experts \"revealed that NVIDIA's computing chips have location tracking and can remotely shut down the technology.\" A kill switch in a chip would be \"a permanent flaw beyond user control, and an open invitation for disaster,\" Reber Jr. added.\nAttackers Compromise Target Within 5 Minutes\n— Threat actors successfully compromised corporate systems within just five minutes using a combination of social engineering tactics and rapid PowerShell execution. The incident demonstrates how cybercriminals are weaponizing trusted business applications to bypass traditional security measures. \"The Threat Actor targeted around twenty users, impersonating IT support personnel, and successfully convinced two users to grant remote access to their system using the Windows native Quick Assist remote support tool,\" NCC Group\nsaid\n. \"In less than five minutes, the Threat Actor executed PowerShell commands that led to the download of offensive tooling, malware execution and the creation of persistence mechanisms.\" The attack was detected and stopped before it could have led to a bigger infection.\nCompanies Drowning in Threat Intel\n— A new study commissioned by Google Cloud found that an \"overwhelming volume of threats and data combined with the shortage of skilled threat analysts\" are making companies more vulnerable to cyber attacks and keeping them stuck in a reactive state. \"Rather than aiding efficiency, myriad [threat intelligence] feeds inundate security teams with data, making it hard to extract useful insights or prioritize and respond to threats. Security teams need visibility into relevant threats, AI-powered correlation at scale, and skilled defenders to use actionable insights, enabling a shift from a reactive to a proactive security posture,\" the study\nfound\n. The survey was conducted with 1,541 senior IT and cybersecurity leaders at enterprise organizations in North America, Europe, and Asia Pacific.\nNew EDR Killer Spotted\n— Malware capable of terminating antivirus software and obfuscated using commercial packers like\nHeartCrypt\nare\nbeing used\nin ransomware attacks involving BlackSuit, RansomHub,\nMedusa\n, Qilin, DragonForce, Crytox, Lynx, and INC. Posing as a legitimate utility, the EDR killer looks for a driver with a five-letter random name that's signed with a compromised certificate to achieve its goals. If found, the malicious driver is loaded into the kernel, as required to perform a bring your own vulnerable driver (\nBYOVD\n) attack and achieve kernel privileges required to turn off security products. The exact list of antivirus software to be terminated varies among samples. It's believed to be an evolution of\nEDRKillShifter\n, developed by RansomHub. \"Multiple new variants of a malicious driver that first surfaced in 2022 are circulating in the wild,\" Symantec\nwarned\nearlier this January. \"The driver is used by attackers to attempt to disable security solutions.\" The fact that multiple ransomware actors are relying on variants of the same EDR killer tool alludes to the possibility of a common seller or some sort of an \"information/tool leakage between them.\"\nRansomware Continues to Evolve\n— Threat intel firm Analyst1 has\npublished\na profile of\nYaroslav Vasinskyi\n, a Ukrainian national and member of the REvil gang that broke into Kaseya in 2021. Meanwhile, the ransomware landscape continues to be volatile as ever, replete with rebrands and abrupt cessation of activities amid continued law enforcement takedowns: BlackNevas (aka Trial Recovery) is\nassessed\nto be a derivative of Trigona, while one affiliate named \"hastalamuerte\" alleged that the Qilin group had conducted an exit scam, defrauding them of $48,000. Another user, operating under the handle \"Nova,\" publicly leaked the Qilin affiliate panel, including login credentials, further exposing the group's operational security weaknesses. RansomHub, Babuk-Bjorka, FunkSec, BianLian, 8Base, CACTUS, Hunters International, and LockBit are among the groups that have\nstopped publishing\nnew victims, indicating an increasingly fragmented ransomware ecosystem. \"The rapid succession of events following the disappearance of RansomHub and the subsequent rise – and apparent turbulence – within Qilin's operations underscore the dynamic volatility of today's ransomware ecosystem,\" Dark Atlas\nsaid\n. \"The internal chaos and alleged exit scam within Qilin [...] reveal deep fissures in trust and operational security among ransomware collectives, further compounded by active interference from law enforcement and rival groups.\"\nTurkish Organizations Targeted by SoupDealer\n— Banks, ISPs, and mid-level organizations in Türkiye are being targeted by phishing campaigns that deliver a new Java-based loader called SoupDealer. \"When this malware is executed, it uses advanced persistence mechanisms – including downloading TOR to establish communication with the C2 panel and scheduling tasks for automatic execution – to ensure the device is located in Türkiye and being used in Turkish,\" Malwation\nsaid\n. \"It then sends various information based on signals from the command-and-control server and gains full control over the device.\"\nSpark RAT Detailed\n— Cybersecurity researchers have detailed the inner workings of an open-source RAT called Spark RAT that's capable of targeting Windows, Linux, and macOS systems. It allows an attacker to remotely commandeer a compromised endpoint by establishing communications with C2 infrastructure and awaiting further instructions from an operator. \"All the desirable RAT features are present, with the perhaps notable absence of Remote Desktop-like functionality,\" F5 Labs\nsaid\n. \"These factors have combined to make SparkRAT an attractive offensive tool choice, as is evidenced by the documented instances of its use in threat campaigns.\"\nThreat Actors' Use of SVG Files Increase\n— Cybercriminals are turning Scalable Vector Graphics (SVG) files into potent weapons by embedding malicious JavaScript payloads that can bypass traditional security measures. Phishing attacks adopting the technique have revolved around convincing targets to open an SVG file, triggering the execution of the JavaScript code in the web browser, which then redirects them to a phishing site designed to steal credentials. \"Instead of storing pixel data, SVGs use XML-based code to define vector paths, shapes, and text,\" Seqrite\nsaid\n. \"This makes them ideal for responsive design, as they scale without losing quality. However, this same structure allows SVGs to contain embedded JavaScript, which can execute when the file is opened in a browser – something that happens by default on many Windows systems.\" SVG image files are also\nbeing used\nas a malware delivery vector in campaigns where adult sites have been found seeding obscured SVG payloads that leverage\nJSFuck\nto covertly endorse Facebook posts promoting the sites, ThreatDown\nfound\n.\nScams Targeting Elderly Led to $700 million Losses in 2024\n— Americans aged 60 and older lost a\nstaggering $700 million\nto online scams in 2024, signaling a steep rise in fraud targeting older adults. \"Most notably, combined losses reported by older adults who lost more than $100,000 increased eight-fold, from $55 million in 2020 to $445 million in 2024,\" the U.S. Federal Trade Commission (FTC)\nsaid\n. \"While younger consumers also have reported these scams, older adults were much more likely to report these extraordinarily high losses.\" The development came as authorities from the Philippines\ndetained\n20 Chinese nationals who were operating a crypto scam center in Pasay City. Thai police have also\napprehended\n18 Chinese nationals who were operating a scam call center in the city of Chiang Mai that targeted other Chinese speakers and operated for three months from a rented house.\nEmbargo Ransomware Made About $34.2 million\n— Embargo ransomware is associated with about $34.2 million in cryptocurrency transactions since popping up around April 2024, with the majority of the victims located in the United States in the healthcare, business services, and manufacturing sectors. Unlike other traditional ransomware-as-a-service (RaaS) groups, Embargo retains control over infrastructure and payment negotiations and tends to avoid tactics like triple extortion and victim harassment that draw attention to itself. The attacks involve using phishing emails and drive-by downloads delivered via malicious websites as initial access vectors to disable security tools, turn off recovery options, and encrypt files. \"Embargo may be a rebranded or successor operation to BlackCat (ALPHV) based on multiple technical and behavioral similarities – including using the Rust programming language, a similarly designed data leak site, and on-chain overlaps via shared wallet infrastructure,\" TRM Labs\nsaid\n. \"Embargo launders ransom proceeds through intermediary wallets, high-risk exchanges, and sanctioned platforms such as Cryptex.net. Approximately $18.8 million remains dormant in unattributed wallets — a pattern that likely reflects deliberate evasion tactics.\" The links to BlackCat stem from on-chain overlaps, with historical BlackCat-linked addresses funneling funds to wallet clusters associated with Embargo victims. Technical similarities include the use of the Rust programming language, similar encryption toolkits, and the design of their data leak sites.\nMicrosoft to Block File Access via FPRPC\n— Microsoft has announced that the Microsoft 365 apps for Windows will start blocking access to files via the insecure FPRPC legacy authentication protocol by default starting late August. \"Microsoft 365 apps will block insecure file open protocols like FPRPC by default starting version 2508, with new Trust Center settings to manage these protocols,\" the company\nsaid\n. \"These changes enhance security by reducing exposure to outdated technologies like FrontPage Remote Procedure Call (FPRPC), FTP, and HTTP.\" Separately, Microsoft has also\nannounced\nthat it intends to retire support for inline SVG images in Outlook for Web and new Outlook for Windows starting September 2025. \"This change enhances security and aligns with current email client behavior, which already restricts inline SVG rendering,\" the company said.\nNearly 30K Exchange Server Instances Vulnerable to CVE-2025-53786\n— A little over 29,000 Microsoft Exchange email servers are missing an April 2025 hotfix for a recently disclosed security vulnerability (\nCVE-2025-53786\n) that allows attackers to escalate access from on-prem servers to online cloud environments. As of August 10, 2025, the countries with the most exposures are the U.S., Germany, Russia, France, the U.K., and Austria, per\nthe Shadowserver Foundation\n.\nScarCruft Linked to Ransomware Attack for the First Time\n— The North Korean threat actor known as\nScarCruft\n(aka\nAPT37\n), which has a history of deploying RokRAT, has been linked to an attack chain that has leveraged a malicious LNK file embedded in a RAR archive to deliver a stealer (LightPeek and FadeStealer), backdoor (NubSpy and CHILLYCHINO), and ransomware (VCD Ransomware). \"It further underscores the group's persistent reliance on real-time messaging infrastructure, exemplified by NubSpy's use of PubNub as its command-and-control (C2) channel,\" S2W\nsaid\n. The attack has been attributed to ChinopuNK, a sub-cluster within ScarCruft known for deploying the\nChinotto\nmalware. The activity is a \"notable deviation\" from the group's historical focus on espionage. \"This suggests a potential shift toward financially motivated operations, or an expansion of operational goals that now include disruptive or extortion-driven tactics,\" the company added.\nEDR-on-EDR Violence to Disable EDR Software\n— Cybersecurity researchers have uncovered a troubling new attack vector where threat actors are weaponizing free trials of endpoint detection and response (EDR) software to disable existing security tools – a phenomenon dubbed EDR-on-EDR violence, or bring your own EDR aka BYOEDR. \"It turns out that one of the ways to disable EDR is with a free trial of EDR,\" researchers Ezra Woods and Mike Manrod\nsaid\n. \"This is accomplished by removing exclusions and then adding the hash of the existing AV/EDR as a blocked application.\" Making matters worse, the research found that it's possible to abuse the RMM-like features of EDR products to facilitate command shell access.\n2 Founder of Samourai Wallet Plead Guilty to Money Laundering\n— Two senior executives and founders of the Samourai Wallet cryptocurrency mixer have pleaded guilty to charges involving washing more than $200 million worth of crypto assets from criminal proceeds and concealing the nature of illicit transactions using services like Whirlpool and Ricochet. Samourai CEO Keonne Rodriguez and CTO William Lonergan Hill were arrested last year after the U.S. Federal Bureau of Investigation (FBI) took down their service. As part of their plea agreements, Rodriguez and Hill have also agreed to forfeit $237,832,360.55. \"The defendants created and operated a cryptocurrency mixing service that they knew enabled criminals to wash millions in dirty money, including proceeds from cryptocurrency thefts, drug trafficking operations, and fraud schemes,\" the U.S. Department of Justice (DoJ)\nsaid\n. \"They did not just facilitate this illicit movement of money, but also encouraged it.\"\nTornado Cash Founder Convicted of Operating a Money Transmitting Business\n— Roman Storm, a co-founder of the cryptocurrency mixing service Tornado Cash, was found guilty of conspiring to operate an unlicensed money-transmitting business. However, the jury failed to reach a ruling on the more significant charges of conspiracy to commit money laundering and to violate sanctions. \"Roman Storm and Tornado Cash provided a service for North Korean hackers and other criminals to move and hide more than $1 billion of dirty money,\" the DoJ\nsaid\n. Storm is set to be sentenced later this year and faces a maximum prison sentence of five years. The development came as the U.S. Treasury Department\ndropped\nits appeal against a court ruling that forced it to lift sanctions against Tornado Cash last month. Tornado Cash was\ndelisted\nfrom the Specially Designated National and Blocked Persons (SDN) list earlier this March. The service was sanctioned in 2022 for its alleged links to cybercriminals and for having \"repeatedly failed to impose effective controls\" to prevent money laundering.\nMicrosoft SharePoint Flaws Exploited to Drop China Chopper and ANTSWORD\n— Microsoft\nrevealed\nthat Chinese state-sponsored hackers had exploited new vulnerabilities in SharePoint to breach the computer systems of hundreds of companies and government agencies, including the National Nuclear Security Administration and the Department of Homeland Security. According to\nProPublica\n, support for SharePoint is handled by a China-based engineering team that has been responsible for maintaining the software for years. Microsoft said the China-based team \"is supervised by a US-based engineer and subject to all security requirements and manager code review. Work is already underway to shift this work to another location.\" It's unclear if Microsoft's China-based staff had any role in the SharePoint hack. Attacks exploiting the SharePoint flaws (\nCVE-2025-49706 and CVE-2025-53770\n) have been observed performing unauthenticated code execution, extracting cryptographic keys, and deploying web shells like China Chopper and ANTSWORD. \"The use of AntSword and China Chopper in the mid-2025 SharePoint exploitation campaigns aligns with tooling observed in prior incidents,\" Trustwave\nsaid\n. \"Notably, in 2022, the same ANTSWORD and China Chopper were also observed to be deployed in an incident related to ProxyNotShell RCE vulnerabilities.\nE.U. Law Protecting Journalists from Spyware Goes into Effect\n— A new law in the European Union, called the European Media Freedom Act (\nEMFA\n), has\ntaken effect\nstarting August 8, 2025, seeking to promote independence, safeguard media against unjustified online content removal by very large online platforms, and protect journalistic sources, including against the use of spyware. However, the European Centre for Press and Media Freedom (ECPMF)\nsaid\nit's \"deeply concerned that many national governments are neither prepared nor politically willing to make the required legislative changes,\" adding \"this lack of commitment poses a serious risk to the EMFA's effectiveness.\"\nIsrael Created Azure-Backed System to Store Palestinian Communications\n— Israel's elite military surveillance agency, Unit 8200, stored vast volumes of intercepted Palestinian phone calls on Microsoft's Azure cloud servers, according to a joint investigation by\nThe Guardian\n,\n+972 Magazine\n, and\nLocal Call\n. The massive phone surveillance operation intercepted and tracked all phone calls and messages sent across Palestine and was hosted in a segregated part of Azure. The cloud-based system is believed to have become operational in 2022. \"Thanks to the control it exerts over Palestinian telecommunications infrastructure, Israel has long intercepted phone calls in the occupied territories,\" The Guardian reported. \"But the indiscriminate new system allows intelligence officers to play back the content of cellular calls made by Palestinians, capturing the conversations of a much larger pool of ordinary civilians.\"\nSouth Korea Targeted by Makop Ransomware\n— Users in South Korea have been targeted by Makop ransomware attacks that leverage remote desktop protocol (RDP) as an entry point, shifting from its previous distribution strategy of relying on fake resumes or emails related to copyrights. \"It is worth noting that the use of RDP in the initial access phase and the installation of various tools from NirSoft and Mimikatz with an installation path of 'mimik' are the same as what the Crysis ransomware threat actor did when installing the Venus ransomware,\" AhnLab\nsaid\n. \"This suggests the possibility that the same threat actor is behind the Crysis, Venus, and recent Makop ransomware attacks.\"\nWhatsApp Rolls Out New Feature to Tackle Scams\n— WhatsApp is introducing a new security feature that will help users spot potential scams when they are being added to a group chat by someone who is not in their contact list by serving additional information and options to exit the group. The messaging platform said it's also exploring ways to caution people when they are individually contacted by people not in their contacts. This includes showing more context about who has messaged, so users can make an informed decision. The Meta-owned company said it also took down over 6.8 million WhatsApp accounts linked to criminal scam centers based in Southeast Asia targeting people across the internet and around the world. \"These scam centers typically run many scam campaigns at once – from cryptocurrency investments to pyramid schemes,\" the company\nsaid\n. \"The scammers used ChatGPT to generate the initial text message containing a link to a WhatsApp chat, and then quickly directed the target to Telegram, where they were assigned a task of liking videos on TikTok. The scammers attempted to build trust in their scheme by sharing how much the target has already 'earned' in theory, before asking them to deposit money into a crypto account as the next task.\"\nPraetorian Releases ChromeAlone\n— Cybersecurity company Praetorian has released a tool called\nChromeAlone\nthat transforms Chromium browsers into a C2 framework and can be implanted and used in place of conventional tools like Cobalt Strike. The program offers the ability to steal browser credentials and session cookies, launch executables on the host from Chrome, phish for WebAuthn requests for physical security tokens like YubiKeys or Titan Security Keys, and offer EDR resistance. Separately, Praetorian also\nfound\nthat it's\npossible\nto abuse Traversal Using Relays around NAT (TURN) servers used by conferencing apps like Zoom and Microsoft Teams as a new C2 evasion method called 'Ghost Calls' to tunnel traffic through trusted infrastructure. This is accomplished by means of a tool called\nTURNt\n. \"This approach allows operators to blend interactive C2 sessions into normal enterprise traffic patterns, appearing as nothing more than a temporarily joined online meeting,\" Praetorian\nnoted\n, stating the approach uses legitimate credentials, WebRTC, and custom tooling to get around existing defenses.\nNew Jailbreak Against AI Chatbots Employs Information Overload\n— AI chatbots like OpenAI ChatGPT and Google Gemini can be derived into generating illicit instructions for making a bomb or hacking an ATM if the prompt is made complicated, full of academic jargon, and cites non-existent sources. That's according to a new paper authored by a team of researchers from Intel, Boise State University, and the University of Illinois at Urbana-Champaign. The\nLLM jailbreaking technique\ncalled InfoFlood \"transforms malicious queries into complex, information-overloaded queries capable of bypassing built-in safety mechanisms,\" the paper\nexplained\n. \"Specifically, InfoFlood: (1) uses linguistic transformations to rephrase malicious queries, (2) identifies the root cause of failure when an attempt is unsuccessful, and (3) refines the prompt's linguistic structure to address the failure while preserving its malicious intent.\"\nIsraeli spyware vendor Candiru is still active\n— Cybersecurity firm Recorded Future has discovered new infrastructure for managing and delivering Candiru's\nDevilsTongue\nspyware. \"Eight distinct clusters were identified, with five being likely still active, including those linked to Hungary and Saudi Arabia,\" it\nsaid\n. \"One cluster tied to Indonesia was active until November 2024, and two associated with Azerbaijan have uncertain status due to a lack of identified victim-facing infrastructure.\"\n🎥 Cybersecurity Webinars\nAI Threats Are Real—Learn How to Secure Every Agent Now\n:\nAI-powered shadow agents are becoming a serious security threat. Deployed without oversight, these invisible entities have access to sensitive data, making them prime targets for attackers. In this session, we'll explore how these agents emerge, why they're risky, and how to take control before they cause harm.\nHow AI-Fueled Attacks are Targeting Identity—Learn to Stop Them\n:\nAI is changing the way cyberattacks happen, making traditional defenses obsolete. In this webinar, Karl Henrik Smith from Okta explains how AI is targeting identity security and how you can protect your organization from these new threats. Learn how to adapt your defenses for the AI-driven future.\nWhat You're Missing in Python Security: 2025's Must-Know Threats\n:\nIn 2025, securing your Python supply chain is more critical than ever. With increasing threats like repojacking, typosquatting, and known vulnerabilities in core Python infrastructure, simply relying on \"pip install and pray\" won't cut it. Join our webinar to learn how to protect your Python projects, tackle current supply chain risks, and explore practical solutions to safeguard your code with industry-leading tools like Sigstore and Chainguard. Take action now to secure your Python environment and stay ahead of emerging threats.\n🔧 Cybersecurity Tools\nDoomArena\nis a modular, plug-in framework for testing AI agents against evolving security threats. It works with platforms like τ-Bench, BrowserGym, and OSWorld, allowing realistic simulations of attacks such as prompt injections or malicious data sources. Its design separates attack logic from environments, making tests reusable across tasks, and supports detailed threat models, multiple attack types, and custom success checks to help identify vulnerabilities and evaluate defenses.\nYamato Security, a volunteer-led group in Japan, has released a suite of open-source tools aimed at strengthening digital forensics and threat hunting. The lineup includes\nHayabusa\nfor Sigma-based Windows log analysis,\nTakajo\nfor parsing Hayabusa results,\nSuzaku\nfor cloud log forensics, and\nWELA\nfor auditing Windows Event Logs, supported by detailed configuration guides. Also in the toolkit is\nSigmaOptimizer-UI\n, a user-friendly interface that streamlines the creation, testing, and refinement of Sigma rules from real-world logs, incorporating automated checks and optional LLM-powered enhancements.\nDisclaimer: These newly released tools are for educational use only and haven't been fully audited. Use at your own risk—review the code, test safely, and apply proper safeguards.\n🔒 Tip of the Week\nBoost Your Threat Detection with Easy, Free Tools —\nCybersecurity isn't just about defending against attacks—it's also about detecting them early. One of the most effective ways to stay ahead of threats is by setting up real-time monitoring. Free tools like UptimeRobot allow you to monitor your website or systems for unexpected downtime, a common sign of an attack. By receiving instant alerts, you can act quickly if something goes wrong.\nAnother simple yet powerful step is running regular vulnerability scans. Qualys Community Edition is a free tool that helps you identify weak spots in your network or website. Regular scans will help you spot problems before attackers can exploit them, keeping your defenses strong.\nEndpoint protection is equally important. While Windows Defender provides solid security, you can take it a step further with OSSEC, an open-source intrusion detection system. OSSEC monitors your devices for unusual behavior, helping catch threats that traditional antivirus software might miss.\nLastly, staying aware of malicious actors is key. Use resources like AlienVault Open Threat Exchange (OTX) to track known harmful IP addresses and domains. These free databases keep you informed about the latest threats targeting your network, allowing you to block risky traffic before it causes harm.\nBy integrating these free tools into your routine, you'll significantly enhance your ability to detect and respond to cyber threats quickly and effectively.\nConclusion\nAs we wrap up this week's cybersecurity update, remember that staying informed is your best defense. The threats are real, and the stakes are high—but with the right steps, your organization can stay ahead of attackers. Regular updates, timely patches, and continuous monitoring are your first line of defense. Keep working to build a culture of security, and always be ready to adapt to the changing landscape.\nWe'll be back next week with more insights, so keep those systems secure and stay vigilant. Until then, stay proactive, stay safe, and don't let your guard down. Cyber threats wait for no one.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "6 Lessons Learned: Focusing Security Where Business Value Lives",
        "Link": "https://thehackernews.com/2025/08/6-lessons-learned-focusing-security.html",
        "Summary": "The Evolution of Exposure Management\nMost security teams have a good sense of what’s critical in their environment. What’s harder to pin down is what’s business-critical. These are the assets that support the processes the business can’t function without. They’re not always the loudest or most exposed. They’re the ones tied to revenue, operations, and delivery. If one goes down, it’s more than a",
        "Date": "2025-08-11",
        "Content": "The Evolution of Exposure Management\nMost security teams have a good sense of what's critical in their environment. What's harder to pin down is what's\nbusiness-critical\n. These are the assets that support the processes the business can't function without. They're not always the loudest or most exposed. They're the ones tied to revenue, operations, and delivery. If one goes down, it's more than a security issue – It's a business problem.\nOver the past year since publishing our 4-step approach to mapping and securing business-critical assets, my team and I have had the opportunity to engage deeply with dozens of customer workshops across multiple industry verticals, including finance, manufacturing, energy, and more. These sessions have revealed valuable insights into how organizations are evolving their security posture.\nThis article takes an updated look at that approach, incorporating what we have learned along the way, helping organizations align\nexposure management\nstrategy with business priorities. What began as a theoretical 4-step approach has matured into a proven methodology with measurable results. Organizations implementing this framework have reported remarkable efficiency gains—some reducing remediation efforts by up to 96% while simultaneously strengthening their security posture where it matters most.\nOur engagement with CISOs, security directors, and increasingly, CFOs and business executives, has revealed consistent patterns across industries. Security teams struggle not with identifying vulnerabilities but with determining which ones pose genuine business risk. Meanwhile, business leaders want assurance that security investments protect what matters most—but often lack a framework to communicate these priorities effectively to technical teams.\nThe methodology we've refined bridges this gap, creating a common language between security practitioners and business stakeholders. The lessons that follow distill what we've learned through implementing this approach across diverse organizational contexts. They represent not just theoretical best practices, but practical insights gained through successful real-world applications.\nLesson 1: Not All Assets Are Created Equal\nWhat We Discovered:\nMost security teams can identify what's technically critical, but struggle to determine what's business-critical. The difference is significant - business-critical assets directly support revenue generation, operations, and service delivery.\nKey Takeaway:\nFocus your security resources on systems that, if compromised, would create actual business disruption rather than just technical issues. Organizations that implemented this targeted approach reduced remediation efforts by up to 96%.\nLesson 2: Business Context Changes Everything\nWhat We Discovered:\nSecurity teams are drowning in signals - vulnerability scans, CVSS scores, and alerts from across the technology stack. Without business context, these signals lack meaning. A \"critical\" vulnerability on an unused system is less important than a \"moderate\" one on a revenue-generating platform.\nKey Takeaway:\nIntegrate business context into your security prioritization. When you know which systems support core business functions, you can make decisions based on actual impact rather than technical severity alone.\nLesson 3: The Four-Step Method Works\nWhat We Discovered:\nOrganizations need a structured approach to connect security efforts with business priorities. Our four-step methodology has proven effective across diverse industries:\nIdentify Critical Business Processes\nTakeaway: Start with how your company makes and spends money. You don't need to map everything - just the processes that would cause significant disruption if interrupted.\nMap Processes to Technology\nTakeaway: Determine which systems, databases, credentials, and infrastructure support those critical processes. Perfect mapping isn't necessary - aim for \"good enough\" to guide decisions.\nPrioritize Based on Business Risk\nTakeaway: Focus on choke points - the systems attackers would likely pass through to reach business-critical assets. These aren't always the most severe vulnerabilities but fixing them delivers the highest return on effort.\nAct Where It Matters\nTakeaway: Remediate exposures that create paths to business-critical systems first. This targeted approach makes security work more efficient and easier to justify to leadership.\nLesson 4: CFOs Are Becoming Security Stakeholders\nWhat We Discovered:\nFinancial leaders are increasingly involved in cybersecurity decisions. As one director of cybersecurity told us, \"Our CFO wants to know how we see cybersecurity risks from a business perspective.\"\nKey Takeaway:\nFrame security in terms of business risk management to gain support from financial leadership. This approach has proven essential for promoting initiatives and securing necessary budgets.\nLesson 5: Clarity Trumps Data Volume\nWhat We Discovered:\nSecurity teams don't need more information - they need better context to make sense of what they already have.\nKey Takeaway:\nWhen you can connect security work to business outcomes, conversations with leadership change fundamentally. It's no longer about technical metrics but about business protection and continuity.\nLesson 6: Effectiveness Comes From Focus\nWhat We Discovered:\nOrganizations implementing our business-aligned approach reported dramatic efficiency improvements, with some reducing remediation efforts by up to 96%.\nKey Takeaway:\nSecurity excellence isn't about doing more - it's about doing what matters. By focusing on assets that drive your business, you can achieve better security outcomes with fewer resources and demonstrate clear value to the organization.\nConclusion\nThe journey to effective security isn't about securing everything, but about protecting what truly drives your business forward. By aligning security efforts with business priorities, organizations can achieve both stronger protection and more efficient operations—transforming security from a technical function into a strategic business enabler. Want to learn more about this methodology? Check out my\nrecent webinar\nhere and learn how to start protecting what matters most.\nBonus checklist:\nGetting Started - How to Secure Your Business Critical Assets\nSTEP 1: IDENTIFY CRITICAL BUSINESS PROCESSES\n□ Schedule focused discussions with business unit leaders to identify core revenue-generating processes\n□ Review how the company makes and spends money to surface high-value operations\n□ Create a short list of business processes that would cause significant disruption if interrupted\n□ Document these processes with clear descriptions of their business importance\nSTEP 2: MAP BUSINESS PROCESSES TO TECHNOLOGY\n□ For each critical process, identify the supporting systems, databases, and infrastructure\n□ Document which admin credentials and access points protect these systems\n□ Consult with system owners about dependencies and recovery requirements\n□ Compile findings from CMDBs, architecture documents, or direct interviews\nSTEP 3: PRIORITIZE BASED ON BUSINESS RISK\n□ Identify the choke points attackers would likely pass through to reach critical assets\n□ Evaluate which exposures create direct paths to business-critical systems\n□ Determine which systems have the tightest SLAs or recovery windows\n□ Create a prioritized list of exposures based on business impact, not just technical severity\nSTEP 4: TURN INSIGHTS INTO ACTION\n□ Focus remediation efforts on exposures that directly impact business-critical systems\n□ Develop clear communication about why these priorities matter in business terms\n□ Track progress based on reduction of risk to core business functions\n□ Present results to leadership in terms of business protection, not just technical metrics\nBridging the gap between technical findings and executive leadership, as highlighted in lessons 4 and 5, is one of the most critical skills for a modern CISO. To help you master this essential dialogue, we are now offering our practical course,\n\"Risk Reporting to the Board,\"\ncompletely free of charge. This program is designed to equip you with the frameworks and language needed to transform your conversations with the board and confidently present security as a strategic business function. Access the free course today and start building a stronger relationship with your leadership team.\nNote:\nThis article was expertly written by Yaron Mazor, Principal Customer Advisor at XM Cyber.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "WinRAR Zero-Day Under Active Exploitation – Update to Latest Version Immediately",
        "Link": "https://thehackernews.com/2025/08/winrar-zero-day-under-active.html",
        "Summary": "The maintainers of the WinRAR file archiving utility have released an update to address an actively exploited zero-day vulnerability.\nTracked as CVE-2025-8088 (CVSS score: 8.8), the issue has been described as a case of path traversal affecting the Windows version of the tool that could be exploited to obtain arbitrary code execution by crafting malicious archive files.\n\"When extracting a file,",
        "Date": "2025-08-11",
        "Content": "The maintainers of the WinRAR file archiving utility have released an update to address an actively exploited zero-day vulnerability.\nTracked as\nCVE-2025-8088\n(CVSS score: 8.8), the issue has been described as a case of path traversal affecting the Windows version of the tool that could be exploited to obtain arbitrary code execution by crafting malicious archive files.\n\"When extracting a file, previous versions of WinRAR, Windows versions of RAR, UnRAR, portable UnRAR source code and UnRAR.dll can be tricked into using a path, defined in a specially crafted archive, instead of a specified path,\" WinRAR\nsaid\nin an advisory.\nAnton Cherepanov, Peter Kosinar, and Peter Strycek from ESET have been credited for discovering and reporting the security defect, which has been addressed in WinRAR version 7.13 released on July 31, 2025.\nIt's currently not known how the vulnerability is being weaponized in real-world attacks, and by whom. In 2023, another vulnerability affecting WinRAR (CVE-2023-38831, CVSS score: 7.8)\ncame under\nheavy\nexploitation\n, including as a zero-day, by multiple threat actors from China and Russia.\nRussian cybersecurity vendor BI.ZONE, in a report published last week, said there are indications that the hacking group tracked as\nPaper Werewolf\n(aka GOFFEE) may have leveraged CVE-2025-8088 alongside CVE-2025-6218, a directory traversal bug in the Windows version of WinRAR that was patched in June 2025.\nIt's important to note that prior to these attacks, a threat actor identified as \"zeroplayer\" was\nspotted\nadvertising on July 7, 2025, an alleged WinRAR zero-day exploit on the Russian-language dark web forum Exploit.in for a price tag of $80,000. It's suspected that the Paper Werewolf actors may have acquired it and used it for their attacks.\n\"In previous versions of WinRAR, as well as RAR, UnRAR, UnRAR.dll, and the portable UnRAR source code for Windows, a specially crafted archive containing arbitrary code could be used to manipulate file paths during extraction,\" WinRAR\nsaid\nin an alert for CVE-2025-6218 at the time.\n\"User interaction is required to exploit this vulnerability, which could cause files to be written outside the intended directory. This flaw could be exploited to place files in sensitive locations – such as the Windows Startup folder – potentially leading to unintended code execution on the next system login.\"\nThe attacks, per BI.ZONE, targeted Russian organizations in July 2025 via phishing emails bearing booby-trapped archives that, when launched, triggered CVE-2025-6218 and likely CVE-2025-8088 to write files outside the target directory and achieve code execution, while a decoy document is presented to the victim as a distraction.\n\"The vulnerability is related to the fact that when creating a RAR archive, you can include a file with alternative data streams, the names of which contain relative paths,\" BI.ZONE\nsaid\n. \"These streams can contain arbitrary payload. When unpacking such an archive or opening an attached file directly from the archive, data from the alternative streams is written to arbitrary directories on the disk, which is a directory traversal attack.\"\n\"The vulnerability affects WinRAR versions up to and including 7.12. Starting with version 7.13, this vulnerability is no longer reproduced.\"\nOne of the malicious payloads in question is a .NET loader that's designed to send system information to an external server and receive additional malware, including an encrypted .NET assembly.\n\"Paper Werewolf uses the C# loader to get the victim's computer name and send it in the generated link to the server to get the payload,\" the company added. \"Paper Werewolf uses sockets in the reverse shell to communicate with the control server.\"\nWinRAR Flaw Also Exploited by RomCom\nSlovakian cybersecurity company ESET said it observed the Russia-aligned group RomCom exploiting CVE-2025-8088 as a zero-day, marking the third time the hacking crew has employed zero-days in its attacks after\nCVE-2023-36884\n(June 2023),\nCVE‑2024‑9680 and CVE‑2024‑49039\n(October 2024).\n\"Successful exploitation attempts delivered various backdoors used by the RomCom group, specifically a SnipBot variant, RustyClaw, and Mythic agent,\" researchers Cherepanov, Strycek, and Damien Schaeffer\nsaid\n. \"This campaign targeted financial, manufacturing, defense, and logistics companies in Europe and Canada.\"\nThe attacks leverage malicious archives that contain one benign but several alternate data streams (\nADSes\n) that are leveraged for path traversal. The messages make use of resume-themed lures to trick recipients into opening the attachments.\nOpening the archive triggers the execution of a malicious DLL, while a Windows shortcut (LNK) file is set up in the Windows startup directory to achieve persistence every time a user logs in to the system. This DLL is responsible for decrypting embedded shellcode, which then paves the way for the Mythic agent, a\nSnipBot\n(aka SingleCamper) variant, and\nRustyClaw\n.\nRustyClaw fetches and executes another payload, another downloader called\nMeltingClaw\n(aka DAMASCENED PEACOCK), which has been used to drop backdoors such as ShadyHammock or DustyHammock in the past.\nThe company said none of the targets were compromised, citing telemetry data, but the development demonstrates the continued maturation of RomCom to a sophisticated threat actor capable of adopting zero-days into its arsenal for targeted attacks.\n\"By exploiting a previously unknown zero-day vulnerability in WinRAR, the RomCom group has shown that it is willing to invest serious effort and resources into its cyber operations,\" ESET said. \"The discovered campaign targeted sectors that align with the typical interests of Russian-aligned APT groups, suggesting a geopolitical motivation behind the operation.\"\n7-Zip Plugs Arbitrary File Write Bug\nThe disclosure comes as 7-Zip shipped patches for a security flaw (CVE-2025-55188, CVSS score: 2.7) that could be abused for arbitrary file write due to the manner the tool handles symbolic links during extraction, which may result in code execution. The issue has been addressed in\nversion 25.01\n.\nIn a possible attack scenario, a threat actor could leverage the flaw to achieve unauthorized access or code execution by tampering with sensitive files, such as by overwriting a user's SSH keys or .bashrc file.\nThe attack mainly targets Unix systems, but can also be adapted for Windows with additional prerequisites. \"On Windows, the 7-Zip extraction process must have the capability to create symbolic links (e.g., extract with Administrator privileges, Windows is in Developer Mode, etc.),\" security researcher \"lunbun\"\nsaid\n.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "North Korean Kimsuky hackers exposed in alleged data breach",
        "Link": "https://www.bleepingcomputer.com/news/security/north-korean-kimsuky-hackers-exposed-in-alleged-data-breach/",
        "Summary": "The North Korean state-sponsored hackers known as Kimsuky has reportedly suffered a data breach after two hackers, who describe themselves as the opposite of Kimsuky's values, stole the group's data and leaked it publicly online. [...]",
        "Date": "2025-08-11",
        "Content": "The North Korean state-sponsored hackers known as Kimsuky has reportedly suffered a data breach after two hackers, who describe themselves as the opposite of Kimsuky's values, stole the group's data and leaked it publicly online.\nThe two hackers, named 'Saber' and 'cyb0rg,' cited ethical reasons for their actions, saying\nKimsuky\nis \"hacking for all the wrong reasons,\" claiming they're driven by political agendas and follow regime orders instead of practicing the art of hacking independently.\n\"Kimsuky, you are not a hacker. You are driven by financial greed, to enrich your leaders, and to fulfill their political agenda,\" reads the hackers' address to Kimsuky\npublished in the latest issue of Phrack\n, which was distributed at the DEF CON 33 conference.\n\"You steal from others and favour your own. You value yourself above the others: You are morally perverted.\"\nThe hackers dumped a portion of Kimsuky's backend, exposing both their tooling and some of their stolen data that could provide insight into unknown campaigns and undocumented compromises.\nThe 8.9GB dump currently hosted on the '\nDistributed Denial of Secrets'\n' website contains, among others:\nPhishing logs with multiple dcc.mil.kr (Defense Counterintelligence Command) email accounts.\nOther targeted domains: spo.go.kr, korea.kr, daum.net, kakao.com, naver.com.\n.7z archive containing the complete source code of South Korea's Ministry of Foreign Affairs email platform (\"Kebi\"), including webmail, admin, and archive modules.\nReferences to South Korean citizen certificates and curated lists of university professors.\nPHP \"Generator\" toolkit for building phishing sites with detection evasion and redirection tricks.\nLive phishing kits.\nUnknown binary archives (voS9AyMZ.tar.gz, Black.x64.tar.gz) and executables (payload.bin, payload_test.bin, s.x64.bin) not flagged in VirusTotal.\nCobalt Strike loaders, reverse shells, and Onnara proxy modules found in VMware drag-and-drop cache.\nChrome history and configs linking to suspicious GitHub accounts (wwh1004.github.io, etc.), VPN purchases (PureVPN, ZoogVPN) via Google Pay, and frequent use of hacking forums (freebuf.com, xaker.ru).\nGoogle Translate use for Chinese error messages and visits to Taiwan government and military sites.\nBash history with SSH connections to internal systems.\nThe hackers note that some of the above are already known or previously documented, at least partially.\nHowever, the dump gives a new dimension to the data and provides interlinking between Kimsuky's tools and activities, exposing and effectively \"burning\" the APT's infrastructure and methods.\nBleepingComputer has contacted various security researchers to confirm the veracity of the leaked documents and its value and will update the story if we receive a response.\nWhile the breach will likely not have long-term impact on Kimsuky's operations, it could lead to operational difficulties for Kimsuky and disruptions to ongoing campaigns.\nThe latest issue of\nPhrack\n(#72) is currently only available in a limited physical copy, but the online version should be ready for people to read for free in the following days\nfrom here\n.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nHacker leaks 386 million user records from 18 companies for free\nMicrosoft: macOS Sploitlight flaw leaks Apple Intelligence data\nTea app leak worsens with second database exposing user chats\nFrance's warship builder Naval Group investigates 1TB data breach\nWoman gets 8 years for aiding North Koreans infiltrate 300 US firms"
    },
    {
        "Title": "Netherlands: Citrix Netscaler flaw CVE-2025-6543 exploited to breach orgs",
        "Link": "https://www.bleepingcomputer.com/news/security/netherlands-citrix-netscaler-flaw-cve-2025-6543-exploited-to-breach-orgs/",
        "Summary": "The Netherlands' National Cyber Security Centre (NCSC) is warning that a critical Citrix NetScaler vulnerability tracked as CVE-2025-6543 was exploited to breach \"critical organizations\" in the country. [...]",
        "Date": "2025-08-11",
        "Content": "The Netherlands' National Cyber Security Centre (NCSC) is warning that a critical Citrix NetScaler vulnerability tracked as CVE-2025-6543 was exploited to breach \"critical organizations\" in the country.\nThe critical flaw is a memory overflow bug that allows unintended control flow or a denial of service state on impacted devices.\n\"Memory overflow vulnerability leading to unintended control flow and Denial of Service in NetScaler ADC and NetScaler Gateway when configured as Gateway (VPN virtual server, ICA Proxy, CVPN, RDP Proxy) OR AAA virtual server,\" explains\nCitrix's advisory\n.\nCitrix issued a bulletin about the flaw on June 25, 2025, warning that the following versions were vulnerable to\nongoing attacks\n:\n14.1 before 14.1-47.46\n13.1 before 13.1-59.19\n13.1-FIPS and 13.1-NDcPP before 13.1-37.236\n12.1 and 13.0 → End-of-Life but still vulnerable (no fixes provided, upgrade to a newer release recommended)\nWhile the flaw was initially thought to be exploited in denial of service (DoS) attacks, the NCSC's warning now indicates that the attackers exploited it to achieve remote code execution.\nThe NCSC's warning about CVE-2025-6543 confirms that hackers have leveraged the flaw to breach multiple entities in the country, and then wiped traces of the attacks to eliminate evidence of the intrusions.\n\"The NCSC has determined that multiple critical organizations in the Netherlands have been successfully attacked via a vulnerability identified as CVE-2025-6543 in Citrix NetScaler,\"\nreads the notice\n.\n\"The NCSC assesses the attacks as the work of one or more actors with an advanced modus operandi. The vulnerability was exploited as a zero-day, and traces were actively removed to conceal compromise at affected organizations.\"\nZero-day exploitation\nAccording to the NCSC, these attacks occurred since at least early May, nearly two months before Citrix published its bulletin and made patches available, so they were exploited as zero days for an extended period.\nAlthough the agency did not name any of the impacted organizations, the Openbaar Ministerie (OM), which is the Public Prosecution Service of the Netherlands,\ndisclosed a compromise\non July 18, noting the discovery came after receiving an NCSC alert.\nThe organization suffered severe\noperational disruption\nas a result,\ngradually returning online\nand firing up its\nemail servers\nonly last week.\nTo address the risk from CVE-2025-6543, organizations are recommended to upgrade to NetScaler ADC and NetScaler Gateway 14.1 version 14.1-47.46 and later, version 13.1-59.19 and later, and ADC 13.1-FIPS and 13.1-NDcPP version 13.1-37.236 and later.\nAfter installing the updates, it is crucial to end all active sessions with:\nkill icaconnection -all\r\nkill pcoipConnection -all\r\nkill aaa session -all\r\nkill rdp connection -all\r\nclear lb persistentSessions\nThis same mitigation advice was given for the actively exploited Citrix Bleed 2 flaw, tracked as CVE-2025-5777. It is unclear whether that flaw was also abused in attacks, or if it's the same update process for both flaws.\nThe NCSC advises system administrators to look for signs of compromise, such as an atypical file creation date, duplicate file names with different extensions, and the absence of PHP files in the folders.\nThe cybersecurity agency has also released a\nscript on GitHub\nthat can scan devices for unusual PHP and XHTML files, as well as other IOCs.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nCitrix Bleed 2 exploited weeks before PoCs as Citrix denied attacks\nCISA tags Citrix Bleed 2 as exploited, gives agencies a day to patch\nCitrix Bleed 2 flaw now believed to be exploited in attacks\nDetails emerge on WinRAR zero-day attacks that infected PCs with malware\nSonicWall SSLVPN access control flaw is now exploited in attacks"
    },
    {
        "Title": "Details emerge on WinRAR zero-day attacks that infected PCs with malware",
        "Link": "https://www.bleepingcomputer.com/news/security/details-emerge-on-winrar-zero-day-attacks-that-infected-pcs-with-malware/",
        "Summary": "Researchers have released a report detailing how a recent WinRAR path traversal vulnerability tracked as CVE-2025-8088 was exploited in zero-day attacks by the Russian 'RomCom' hacking group to drop different malware payloads. [...]",
        "Date": "2025-08-11",
        "Content": "Researchers have released a report detailing how a recent WinRAR path traversal vulnerability tracked as CVE-2025-8088 was exploited in zero-day attacks by the Russian 'RomCom' hacking group to drop different malware payloads.\nRomCom (aka Storm-0978 and Tropical Scorpius) is a Russian cyberespionage threat group with a history in zero-day exploitation, including\nin Firefox\n(CVE-2024-9680, CVE-2024-49039) and\nMicrosoft Office\n(CVE-2023-36884).\nESET discovered that RomCom was exploiting an undocumented path traversal zero-day vulnerability in WinRAR on July 18, 2025, and notified the team behind the popular archiver tool.\n\"Analysis of the exploit led to the discovery of the vulnerability, now assigned CVE-2025-8088: a path traversal vulnerability, made possible with the use of alternate data streams. After immediate notification, WinRAR released a patched version on July 30th, 2025,\" explains a\nnew report\npublished by ESET today.\nWinRAR released a fix for the flaw, which was assigned the identifier CVE-2025-8088, on July 30, 2025, with\nversion 7.13\n. However, there was no mention of active exploitation in the accompanying advisory.\nESET\nconfirmed the malicious activity\nto BleepingComputer late last week, which was believed to be used to extract dangerous executables to autorun paths when a user opens a specially crafted archive.\nThe vulnerability was similar to another path traversal flaw in WinRAR, disclosed a month earlier, tracked as CVE-2025-6218.\nESET's report explains that the malicious RAR archives include numerous hidden ADS (Alternate Data Stream) payloads that are used to hide a malicious DLL and Windows shortcut, which are extracted into attacker-specified folders when the targets open the archive.\nMany of the ADS entries are for invalid paths, which ESET believes were deliberately added to generate harmless-looking WinRAR warnings, while concealing the presence of the malicious DLL, EXE, and LNK file paths deeper in the file list.\nMalicious RAR archive (top) and errors during decompression (bottom)\nSource: ESET\nThe executables are placed into the %TEMP% or %LOCALAPPDATA% directories, while the Windows shortcuts (LNK files) are dropped in the Windows Startup directory so that they are executed upon subsequent login.\nESET documented three distinct attack chains, all delivering known RomCom malware families:\nMythic Agent\n– Updater.lnk adds msedge.dll to a COM hijack registry location, which decrypts AES shellcode and runs only if the system's domain matches a hardcoded value. The shellcode launches the Mythic agent, enabling C2 communication, command execution, and payload delivery.\nSnipBo\nt – Display Settings.lnk runs ApbxHelper.exe, a modified PuTTY CAC with an invalid certificate. It checks for ≥69 recently opened documents before decrypting shellcode that downloads additional payloads from attacker servers.\nMeltingClaw\n– Settings.lnk launches Complaint.exe (RustyClaw), which downloads a MeltingClaw DLL that fetches and executes more malicious modules from the attacker's infrastructure.\nThe Mythic Agent infection chain\nSource: ESET\nRussian cybersecurity firm\nBi.Zone also reports\nobserving a separate activity cluster, which they track as 'Paper Werewolf,' also leveraging CVE-2025-8088, as well as CVE-2025-6218, in attacks.\nESET shared the complete indicators of compromise for the latest RomCom attacks on\nits GitHub repository\n.\nAlthough Microsoft\nadded native RAR support\nto Windows in 2023, the feature is only available to newer releases, and its capabilities are not as extensive as those baked into WinRAR.\nHence, many power users and organizations continue to rely on WinRAR for managing archives, which makes it a prime target for hackers.\nRarLab told BleepingComputer that they are not aware of the details of the exploitation of CVE-2025-8088, did not receive any user reports, and ESET only shared with them the technical information required to develop a patch.\nWinRAR does not contain an auto-update feature, so users need to manually download and install the\nlatest version from here\n.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nWinRAR zero-day exploited to plant malware on archive extraction\nWinRAR patches bug letting malware launch from extracted archives\nSonicWall SSLVPN access control flaw is now exploited in attacks\nAndroid gets patches for Qualcomm flaws exploited in attacks\nSpikes in malicious activity precede new security flaws in 80% of cases"
    },
    {
        "Title": "Microsoft tests cloud-based Windows 365 disaster recovery PCs",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-tests-cloud-based-windows-365-disaster-recovery-pcs/",
        "Summary": "Microsoft has announced the limited public preview of Windows 365 Reserve, a service that provides temporary desktop access to pre-configured cloud PCs for employees whose computers have become unavailable due to cyberattacks, hardware issues, or software problems. [...]",
        "Date": "2025-08-11",
        "Content": "Microsoft has announced the limited public preview of Windows 365 Reserve, a service that provides temporary desktop access to pre-configured cloud PCs for employees whose computers have become unavailable due to cyberattacks, hardware issues, or software problems.\nWindows 365 Reserve provides up to 10 days of access per user annually to these cloud-based Windows 365 disaster recovery PCs, enabling organizations to mitigate productivity issues during outages without requiring physical replacement for defective devices.\nMicrosoft says the current gated public preview requires application approval, with broader availability planned following the testing phase.\n\"Even a single device failure can ripple across an organization—halting productivity, delaying deliverables, and straining IT teams. Multiply that disruption across thousands of employees, and the impact becomes massive. Exacerbated by cyberattacks, the cost of employee and device downtime is no longer theoretical—it's a business-critical concern,\"\nMicrosoft said\non Monday.\n\"That's why we're introducing Windows 365 Reserve: a modern, secure, and scalable solution that helps employees stay productive and connected when the unexpected strikes.\nThis cloud-based service works as a standalone Windows 365 offering that administrators can deploy as pre-configured Cloud PCs through Microsoft Intune, provisioned with corporate applications, security policies, and Microsoft 365 access.\nOnce provisioned, users can access their new temporary desktops from any other device through web browsers or Microsoft's Windows App, all via a secure connection, while the main computers are being repaired or replaced.\nWindows 365 Reserve Cloud PC (Microsoft)\nMicrosoft says that Windows 365 Reserve also applies your organization's security posture by default, follows Zero Trust principles for increased security during outages and downtime, and the 10-day annual allocation can be used consecutively or divided across multiple incidents.\nAdministrators will also receive automatic notifications when user access approaches expiration, allowing them to avoid interruptions or deprovision the Cloud PCs to preserve remaining time for future use if they're no longer needed.\n\"While Windows 365 Reserve delivers enhanced availability, it remains subject to scale limitations such as Azure capacity constraints and requires a network connection to connect to use the Windows 365 Reserve Cloud PC,\" the company added.\nIn June, Microsoft announced\nnew security defaults for Windows 365\n, effective in the second half of 2025, that will disable clipboard, drive, USB, and printer redirection on newly provisioned Cloud PCs to reduce the risk of data theft and malware attacks.\nOne month earlier, the company also enabled virtualization-based security, Credential Guard, and hypervisor-protected code integrity (HVCI) by default on Windows 365 Cloud PCs running Windows 11 gallery images, creating secure memory enclaves and preventing malicious code execution at the kernel level.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nMicrosoft unveils new security defaults for Windows 365 Cloud PCs\nOneNote finally gets \"paste text only\" feature on Windows and Mac\nMicrosoft will stop supporting Windows 11 22H2 in October\nMicrosoft July 2025 Patch Tuesday fixes one zero-day, 137 flaws\nMicrosoft fixes known issue that breaks Windows 11 updates"
    },
    {
        "Title": "OpenAI is testing 3,000-per-week limit for GPT-5 Thinking",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-is-testing-3-000-per-week-limit-for-gpt-5-thinking/",
        "Summary": "OpenAI has responded to criticism that it shipped GPT-5 with token limits to minimize cost and maximize profit not with words, but rather with a new 3,000-per-week limit. [...]",
        "Date": "2025-08-11",
        "Content": "OpenAI has responded to criticism that it shipped GPT-5 with token limits to minimize cost and maximize profit not with words, but rather with a new 3,000-per-week limit.\nIn a series of posts on X, Sam Altman\nconfirmed\nthat OpenAI is working on a 3,000-per-week limit for GPT-5 Thinking messages for Plus users.\nThis will increase the reasoning rate limits available today, but OpenAI does not plan to stop at just this.\nSam Altman claims that OpenAI will soon raise all model-class rate limits \"above pre-GPT-5 levels.\"\nThis move might make GPT-5 one of the most affordable models in the market.\nOpenAI to address other GPT-5 concerns\nUsers have previously complained that it's not clear when GPT-5 automatically switches between Thinking and other smaller models, such as GPT-5-mini.\nThankfully, OpenAI is testing a new UI indicator to show which model is working. This will address most of the concerns we've with GPT-5.\nIn addition, Sam Altman noted that more and more users are using the reasoning models because GPT-5 can automatically route queries to different models.\n\"The percentage of users utilizing reasoning models each day has significantly increased from <1% to 7% for free users, and from 7% to 24% for Plus users, and is expected to keep rising, making higher rate limits important tomorrow or Tuesday,\" Sam Altman\nwrote\nin an X post.\n\"Tomorrow or Tuesday we expect to share our thinking on how we are going to make capacity tradeoffs over the coming months,\" Sam added.\nFor example, we might see comparisons between ChatGPT vs the API, existing users vs new ones, research vs product, etc.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nOpenAI to fix GPT-5 issues, double rate limits for paid users after outrage\nOpenAI prepares new open weight models along with GPT-5\nOpenAI prepares GPT-5 for roll out\nChatGPT's GPT-5-reasoning-alpha model spotted ahead of launch\nOpenAI: GPT-5 is coming, \"we'll see\" if it creates a shockwave"
    },
    {
        "Title": "OneNote finally gets \"paste text only\" feature on Windows and Mac",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/onenote-finally-gets-paste-text-only-feature-on-windows-and-mac/",
        "Summary": "Microsoft confirmed that it's testing the ability to paste text only (plain format) to OneNote for Windows and Mac. [...]",
        "Date": "2025-08-11",
        "Content": "OneNote is a powerful note-taking app, but that doesn't necessarily mean it has all the features you want.\nOne of the missing features is 'Paste as text only,' and it's finally coming to OneNote.\nIn a\nblog post\n, Microsoft confirmed that it's testing the ability to paste text only (plain format). Right now, when you copy content from a web page or another app and paste it into OneNote, it retains the formatting.\nThis means colours, fonts, and text styling are copied and moved to OneNote when you copy and paste content. While it may be an ideal experience for some users, I am personally not a fan of retaining formatting.\nBy following these steps, you can now paste text as plain text in OneNote:\nOpen a new or existing notebook in OneNote\nCopy text from any source,\nPlace your cursor where you want the content to go in OneNote\nRight-click and select Paste Options > Keep Text Only, or select Paste > Paste Options > Keep Text Only in the Home tab.\nYou can also use the keyboard shortcut Ctrl + Shift + V on Windows or Command + Shift + V on Mac.\nMicrosoft says the feature is rolling out with OneNote for Windows version 2508 (Build 19101.10000) or later and Mac Build 16.100 (25080335) or later.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nMicrosoft will stop supporting Windows 11 22H2 in October\nMicrosoft fixes known issue that breaks Windows 11 updates\nMicrosoft confirms Family Safety blocks Google Chrome from launching\nWindows Snipping Tool now lets you create animated GIF recordings\nMicrosoft tests cloud-based Windows 365 disaster recovery PCs"
    },
    {
        "Title": "xAI is testing Grok 4.20 to take on GPT-5, may launch this month",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/xai-is-testing-grok-420-to-take-on-gpt-5-may-launch-this-month/",
        "Summary": "Elon Musk-owned xAI is testing Grok 4.20, a small update to Grok 4, which already competes with GPT-5 in some benchmarks, such as ARC-AGI 2. [...]",
        "Date": "2025-08-11",
        "Content": "Elon Musk-owned xAI is testing Grok 4.20, a new model update to Grok 4, which already competes with GPT-5 in some benchmarks, such as ARC-AGI 2.\nGPT-5 is one of the best models for coding, and it competes with Claude Opus 4.1 head-to-head in some coding challenges.\nOn the other hand, Grok falls a bit short when it comes to building full-fledged apps.\nBut that might change soon as xAI is testing Grok 4.20.\nIn a post on X, Elon Musk\nteased\nGrok 4.20 for a late August launch.\nPreviously, Elon Musk confirmed working on the V7 foundation model, which already finished pre-training last week.\nMusk\nsays\nthe next model would be \"natively multimodal,\" which means it can process a video/audio bitstream directly, understanding it without converting it into anything.\n\"For example, it will finally understand nuances in how you speak that convey mood and emphasis,\" Musk noted.\nxAI has not formally committed to releasing Grok 4.20 this month, but it's very likely we'll see something big from the company soon.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nOpenAI is testing 3,000-per-week limit for GPT-5 Thinking\nHow to restore GPT-4o when you've GPT-5\nOpenAI to fix GPT-5 issues, double rate limits for paid users after outrage\nChatGPT's GPT-5 models released: everything you need to know\nMicrosoft accidentally confirms GPT-5, GPT-5-Mini, GPT-5-Nano ahead of launch"
    },
    {
        "Title": "The Rise of Native Phishing: Microsoft 365 Apps Abused in Attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/the-rise-of-native-phishing-microsoft-365-apps-abused-in-attacks/",
        "Summary": "Native phishing turns trusted tools into attack delivery systems. Varonis shows how attackers weaponize Microsoft 365 apps, like OneNote & OneDrive, to send convincing internal lures and how to spot them before they spread. [...]",
        "Date": "2025-08-11",
        "Content": "Attackers don’t need exploits; they need TRUST.\nChanges in attack methods reflect changes in generations. Gen Z, a generation known for prioritizing ease and efficiency, is now entering the cybersecurity landscape on both sides. Some are protecting data, and others are stealing it.\nWith the rise of AI and no-code platforms in attackers’ phishing toolkits, building trust and deceiving users has never been easier. Threat actors are blending default-trusted tools with free, legitimate services to bypass traditional security defenses and human suspicions.\nAttackers are still sending malicious email attachments. However, they’ve expanded their bag of tricks, sharing malicious files or links across the organization using trusted, built-in collaboration features from a compromised account — a tactic we’re calling “native phishing.”\nNative phishing delivers malicious content in a way that feels completely legit to the victim. In this case, for example, it was sent via M365's file sharing system, the file is not scanned like attachments, feels native, and is a less common way to phish users.\nAll it takes is one compromised internal user, and suddenly, the entire organization is at risk. In this blog, we’ll break down recent real-world incidents showing how an attacker compromised one user and used AI/no-code tools with M365 for native phishing.\nOneNOT: How attackers leverage OneNote\nMicrosoft OneNote, part of the Microsoft 365 suite, is a note-taking application that defenders often overlook.\nUnlike Word or Excel, OneNote doesn’t support VBA\nMacros\n. However, Varonis Threat Labs has observed its growing use in phishing attacks due to several\nkey factors\n:\nIt is not subject to Protected View\nIts flexible formatting allows attackers to craft deceptive layouts\nIt supports embedding malicious files or links\nBecause OneNote is also a default, trusted application in most organizations,\nadversaries are increasingly using it\nas a delivery mechanism, shifting from Macro code to social engineering techniques, so they can bypass\nsecurity barriers\n.\nDownload the Varonis 2025 State of Data Security Report\nOur team analyzed data from 1,000 real-world IT environments and found that no organization was breach-proof.\nIn fact, 99% of organizations have exposed sensitive data that can easily be surfaced by AI.\nRead the report\nOne User, OneNote, OneDrive, and many victims\nIn recent incidents, we’ve seen attackers use a straightforward but highly effective method. After the threat actor gained M365 credentials of one user in an organization through a phishing attack, they created a OneNote file in the compromised user's personal Documents folder on OneDrive, embedding the lure URL for the next phishing stage.\nPhishy file read and file uploaded notifications.\nOneNote file in the compromised user's personal Documents folder on OneDrive\nIn many phishing attempts, attackers use external email addresses to impersonate Microsoft’s “Someone shared a file with you” notifications. These are often easy for trained users to spot, and even well-crafted versions can be flagged by email security systems through header analysis and sender verification.\nIn this case, the threat actor took a simpler and more effective route. Instead of spoofing, they used OneDrive’s built-in file-sharing feature from the compromised user account.\nAs a result, hundreds of users across the organization received a legitimate Microsoft email notification, appearing to come directly from a trusted colleague. The email included a secure link to a file hosted in the organization’s OneDrive environment, making it highly convincing and unlikely to trigger any security alerts. In fact, this was the attacker’s way to spread the phishing laterally.\nA phony “Someone shared a file with you” notification.\nAt\nVaronis\n, we observed a spike in ‘Folder shared link created’ events from a compromised user and compared them to their past 90 days of activity.\nUnusual 'Folder shared link created' events.\nUnlike many phishing campaigns we've seen in the wild, this one had an unusually high success rate. Many users clicked the link and willingly entered their credentials. After clicking, victims were redirected to a fake login page that looked nearly identical to the company’s real authentication portal.\nThe phishing site was built using a platform called\nFlazio\n, and yes, you guessed it right, it’s a free, AI-powered website builder. This made it incredibly easy for the attacker to spin up a convincing replica of the login page in no time.\nBelow, you can see a side-by-side comparison of the legitimate login page and the phishing version. The resemblance is disturbingly close.\nThe real company authentication portal\nThe phishing site mimicking the original portal\nRecently, we’ve seen a growing trend of phishing campaigns where attackers use free trials of no-code platforms to quickly build customized phishing pages. Just like the fake login page created with Flazio, we’ve also observed threat actors leveraging platforms like\nClickFunnels\nand\nJotForm\n.\nIn several cases, they hosted fake, “Click to view the document” Adobe-style pages that redirected users to phishing login screens designed to steal credentials. These platforms offer an easy, fast, and cost-free way for attackers to create and host phishing pages with minimal effort.\nPhishing page created in Jotform\nPhishing page created with ClickFunnels\nFrom our perspective, building websites with no-code AI platforms is vibe-coding. For them, it’s\nvibe-scamming\n.\nWhat can you do today?\nTake these steps to minimize phishing in OneNote:\nEnforce MFA and conditional access\nfor all users to reduce the risk of account takeover if credentials are stolen\nRun regular phishing and vishing simulations\n, including executives, to build awareness and test real-world responses\nMake it easy to report suspicious activity\nby ensuring internal reporting channels are clear and accessible\nReview and tighten\nMicrosoft 365 sharing settings\nto limit unnecessary exposure of internal files\nSet alerts for unusual file sharing behavior\nand monitor traffic to known no-code site builders\nAs phishing tactics evolve, so must our defenses. By understanding how attackers exploit trust and leverage modern tools, organizations can better prepare, detect, and respond. In the end, it’s not just about securing systems, it’s about securing people.\nHow Varonis can help\nVaronis monitors real-time email and browsing activities and user and data activities, providing a comprehensive tool for cyber forensics investigations. This lets you quickly determine the impact and potential risks of a phishing campaign targeting your organization.\nThe\nVaronis MDDR\nteam offers 24/7/365 data security expertise and incident response, ensuring continuous support for virtually any security concern.\nWant to see Varonis in action? Schedule a\ndemo\ntoday\n.\nThis article originally appeared on the\nVaronis blog.\nSponsored and written by\nVaronis\n."
    },
    {
        "Title": "MuddyWater’s DarkBit ransomware cracked for free data recovery",
        "Link": "https://www.bleepingcomputer.com/news/security/muddywaters-darkbit-ransomware-cracked-for-free-data-recovery/",
        "Summary": "Cybersecurity firm Profero cracked the encryption of the DarkBit ransomware gang's encryptors, allowing them to recover a victim's files for free without paying a ransom. [...]",
        "Date": "2025-08-11",
        "Content": "Cybersecurity firm Profero cracked the encryption of the DarkBit ransomware gang's encryptors, allowing them to recover a victim's files for free without paying a ransom.\nThis occurred in 2023 during an incident response handled by Profero experts, who were brought in to investigate a ransomware attack on one of their clients, which had encrypted multiple VMware ESXi servers.\nThe timing of the cyberattack suggests that it was in retaliation for the 2023 drone strikes in Iran that targeted an ammunition factory belonging to the Iranian Defence Ministry.\nIn the ransomware attack, the threat actors claimed to be from DarkBit, who previously posed as pro-Iranian hacktivists, targeting\neducational institutes in Israel\n. The attackers included anti-Israel statements in their ransom notes, demanding ransom payments of 80 Bitcoin.\nIsrael's National Cyber Command\nlinked DarkBit attacks\nto the Iranian state-sponsored APT hacking group known as\nMuddyWater\n, who have a history of conducting cyberespionage attacks.\nIn the case investigated by Profero, the attackers did not engage in ransom payment negotiations, but instead appeared to be more interested in causing operational disruption.\nInstead, the attackers launched an influence campaign to maximize reputational damage to the victim, which is a\ntactic associated\nwith nation-state actors posing as hacktivists.\nDecrypting DarkBit\nAt the time of the attack, no decryptor existed for DarkBit ransomware, so Profero researchers decided to analyze the malware for potential weaknesses.\nDarkBit uses a unique AES-128-CBC key and Initialization Vector (IV) generated at runtime for each file, encrypted with RSA-2048, and appended to the locked file.\nFinal encrypted file structure\nSource: Profero\nProfero found that the key generation method used by DarkBit is low entropy. When combined with the encryption timestamp, which can be inferred from file modification times, the total keyspace is reduced to a few billion possibilities.\nMoreover, they found that Virtual Machine Disk (VMDK) files on ESXi servers have known header bytes, so they only had to brute force the first 16 bytes to see if the header matched, instead of the entire file.\nProfero built a tool to try all possible seeds, generate candidate key/IV pairs, and check against VMDK headers, which they ran in a high-performance computing environment, recovering valid decryption keys.\nIn parallel, the researchers discovered that much of the VMDK file content hadn't been impacted by DarkBit's intermittent encryption, as those files are sparse and many encrypted chunks fall onto empty space.\nThis allowed them to retrieve significant amounts of valuable data without having to decrypt it by brute-forcing keys.\n\"As we began to work on speeding up our brute force, one of our engineers/team members? had an interesting idea,\" explained Profero.\n\"VMDK files are sparse, which means they are mostly empty, and therefore, the chunks encrypted by the ransomware in each file are also mostly empty. Statistically, most files contained within the VMDK filesystems won't be encrypted, and most files inside these file systems were anyways not relevant to us/our task/our investigation.\"\n\"So, we realized we could walk the file system to extract what was left of the internal VMDK filesystems... and it worked! Most of the files we needed could simply be recovered without decryption.\"\nProfero noted that DarkBit's objectives would have been better served with a data wiper rather than ransomware, and that the attackers' refusal to negotiate left them no choice but to dissect the malware's encryption in search of a recovery method.\nWhile Profero is not publicly releasing the DarkBit decryptor, they told BleepingComputer that future victims can contact them for assistance.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nU.S. warns of Iranian cyber threats on critical infrastructure\nPro-Israel hackers hit Iran's Nobitex exchange, burn $90M in crypto\nNew Phobos and 8base ransomware decryptor recover files for free\nPolice disrupt “Diskstation” ransomware gang attacking NAS devices\nRoyal and BlackSuit ransomware gangs hit over 450 US companies"
    },
    {
        "Title": "'Chairmen' of $100 million scam operation extradited to US",
        "Link": "https://www.bleepingcomputer.com/news/security/us-charges-ghanaians-linked-to-theft-of-100-million-in-romance-scams-bec-attacks/",
        "Summary": "The U.S. Department of Justice charged four Ghanaian nationals for their roles in a massive fraud ring linked to the theft of over $100 million in romance scams and business email compromise attacks. [...]",
        "Date": "2025-08-11",
        "Content": "The U.S. Department of Justice charged four Ghanaian nationals for their roles in a massive fraud ring linked to the theft of over $100 million in romance scams and business email compromise attacks.\nThe defendants were allegedly high-ranking members of a major international fraud ring based in Ghana that targeted companies and individuals across the United States between 2016 and May 2023.\nIsaac Oduro Boateng (also known as \"Kofi Boat\"), Inusah Ahmed (\"Pascal\"), Derrick Van Yeboah (\"Van\"), and Patrick Kwame Asare (\"Borgar\") were extradited from Ghana and arrived in the United States on August 7.\n\"The defendants have been brought to the United States to be held accountable for their alleged roles in scamming companies and vulnerable Americans out of over $100 million,\"\nsaid\nFBI Assistant Director in Charge Christopher G. Raia on Friday.\nAccording to\ncourt documents\n, the fraudsters (who called themselves \"sakawa boys\" or \"game boys\") mainly targeted vulnerable older men and women who lived alone, deceiving them into believing they were in romantic relationships over the internet after gaining their trust, and tricking them into depositing money into the accounts of middlemen in the U.S.\nThese middlemen would then launder the money, take their cut of the stolen funds, and send the rest to members of the fraud ring in West Africa who coordinated the crime ring's fraudulent activities, known as \"chairmen.\"\nThe alleged scammers also tricked numerous businesses into wiring funds following business email compromise attacks, using email addresses designed to spoof or impersonate the accounts of customers or other employees.\n\"These fake email accounts were specifically designed to trick other employees of the company with access to the company's finances into thinking the fake email accounts were authentic,\" according to an unsealed indictment.\n\"The fake email accounts were then used to send instructions to wire money to certain bank accounts and also included fake authorization letters for the wire transfers that contained forged signatures of company employees.\"\nBoateng and Ahmed were both chairmen in the operation, while Asare and Van Yeboah were also high-ranking members in the scam ring, with the latter directly involved in romance scams.\nThe Four Ghanaian nationals face charges of conspiracy to commit wire fraud and wire fraud, each carrying a maximum sentence of 20 years. They are also charged with conspiracy to commit money laundering (20 years), conspiracy to receive stolen money (up to 5 years), and receipt of stolen money (up to 10 years).\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nFTC: Older adults lost record $700 million to scammers in 2024\nU.S. Judiciary confirms breach of court electronic records service\nHacker extradited to US for stealing $3.3 million from taxpayers\nWhatsApp adds new security feature to protect against scams\nInstagram ads mimicking BMO, EQ Bank are finance scams"
    },
    {
        "Title": "Over 29,000 Exchange servers unpatched against high-severity flaw",
        "Link": "https://www.bleepingcomputer.com/news/security/over-29-000-exchange-servers-unpatched-against-high-severity-flaw/",
        "Summary": "Over 29,000 Exchange servers exposed online remain unpatched against a high-severity vulnerability that can let attackers move laterally in Microsoft cloud environments, potentially leading to complete domain compromise. [...]",
        "Date": "2025-08-11",
        "Content": "Over 29,000 Exchange servers exposed online remain unpatched against a high-severity vulnerability that can let attackers move laterally in Microsoft cloud environments, potentially leading to complete domain compromise.\nThe security flaw (\ntracked as CVE-2025-53786\n) helps threat actors who gain administrative access to on-premises Exchange servers to escalate privileges within the organization's connected cloud environment by forging or manipulating trusted tokens or API calls, without leaving easily detectable traces and making it hard to detect exploitation.\nCVE-2025-53786 affects Exchange Server 2016, Exchange Server 2019, and Microsoft Exchange Server Subscription Edition, which replaces the perpetual license model with a subscription-based one, in hybrid configurations.\nThe flaw was disclosed after Microsoft\nreleased guidance\nand an\nExchange server hotfix\nin April 2025 as part of its Secure Future Initiative, which supports a new architecture using a dedicated hybrid app that replaces the insecure shared identity previously used by on-premises Exchange Server and Exchange Online.\nWhile Redmond has not yet found evidence of abuse in attacks, the vulnerability was still tagged as \"Exploitation More Likely\" because Redmond considers that exploit code allowing consistent exploitation could be developed, increasing its attractiveness to attackers.\nAccording to\nscans\nfrom the security threat monitoring platform Shadowserver, more than 29,000 Exchange servers are still unpatched against potential CVE-2025-53786 attacks.\nOut of a total of\n29,098 unpatched servers\ndetected on August 10,\nover 7,200 IP addresses\nwere found in the United States, more than 6,700 in Germany, and over 2,500 in Russia.\nUnpatched Exchange servers (Shadowserver)\nFederal agencies ordered to mitigate over the weekend\nOne day after Microsoft disclosed the vulnerability,\nCISA\nissued Emergency Directive 25-02\n, ordering all Federal Civilian Executive Branch (FCEB) agencies, including the Department of Homeland Security, the Department of the Treasury, and the\nDepartment of Energy, to mitigate this high-severity Microsoft Exchange vulnerability by Monday at 9:00 AM ET.\nFederal agencies must mitigate the flaw by first taking an inventory of their Exchange environments using\nMicrosoft's Health Checker script\nand disconnecting public-facing servers that are no longer supported by the April 2025 hotfix from the internet, like end-of-life (EOL) or end-of-service versions of Exchange Server.\nAll remaining servers have to be updated to the latest cumulative updates (CU14 or CU15 for Exchange 2019, and CU23 for Exchange 2016) and patched with Microsoft's April hotfix.\nIn a\nseparate advisory issued on Thursday\n, the U.S. cybersecurity agency warned that failing to mitigate CVE-2025-53786 could lead \"to a hybrid cloud and on-premises total domain compromise.\"\nWhile non-government organizations are not required to take action under Emergency Directive 25-02, CISA urged all organizations to take the same measures to secure their systems against potential attacks.\n\"The risks associated with this Microsoft Exchange vulnerability extend to every organization and sector using this environment,\" said CISA Acting Director Madhu Gottumukkala.\n\"While federal agencies are mandated, we strongly urge all organizations to adopt the actions in this Emergency Directive.\"\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nCISA orders fed agencies to patch new Exchange flaw by Monday\nMicrosoft warns of high-severity flaw in hybrid Exchange deployments\nReVault flaws let hackers bypass Windows login on Dell laptops\nMicrosoft: Exchange Server Subscription Edition now available\nWordPress Motors theme flaw mass-exploited to hijack admin accounts"
    },
    {
        "Title": "Connex Credit Union data breach impacts 172,000 members",
        "Link": "https://www.bleepingcomputer.com/news/security/connex-credit-union-discloses-data-breach-impacting-172-000-people/",
        "Summary": "Connex, one of Connecticut's largest credit unions, warned tens of thousands of members that unknown attackers had stolen their personal and financial information after breaching its systems in early June. [...]",
        "Date": "2025-08-11",
        "Content": "Connex, one of Connecticut's largest credit unions, warned tens of thousands of members that unknown attackers had stolen their personal and financial information after breaching its systems in early June.\nFounded in 1940, this member-owned organization is a non-profit with over $1 billion in assets, providing banking, insurance, and credit card services to more than 70,000 members across eight branches throughout the greater New Haven area, including New Haven, Hartford, Middlesex, and Fairfield counties.\nIn data breach notification letters sent to affected individuals via U.S. Mail and filed with the office of Maine's Attorney General, Connex states that it discovered the incident on June 3, one day after its network was breached.\n\"The investigation revealed that certain files may have been accessed or downloaded without authorization between June 2 and 3, 2025,\"\nit said.\n\"On July 27, 2025, Connex identified certain individuals whose personal information may have been involved in the incident.\"\nThe non-profit has yet to find evidence that the attackers gained access to the affected members' funds or accounts, but has discovered that they stole a combination of personal and financial data, including names, account numbers, debit card information, Social Security numbers, and government IDs.\nWhile the breach notification letters don't mention anything about the stolen data being used in attacks, Connex now\ndisplays a scam alert\non its official websites, cautioning members of scammers impersonating its employees in ongoing phishing attacks.\n\"Please be aware that scammers are calling/texting members impersonating Connex employees. Connex will never call you and ask for PINs, passcodes, or account numbers,\" Connex warns. \"If you receive a suspicious call or text, hang up and call us directly at 1-800-CR-UNION (203-603-5700).\"\nThe disclosure comes on the heels of\na wave\nof data breaches\nlinked to the ShinyHunters extortion group\n, which targets Salesforce instances in vishing and social engineering attacks, impacting many high-profile companies, including\nAllianz Life\n,\nAdidas\n,\nQantas\n,\nLouis Vuitton\n,\nDior\n,\nTiffany & Co.\n,\nChanel\n, and\nGoogle\n.\nThe\ninsurance\nsector has also been targeted by attacks linked to the Scattered Spider hacker collective, which has shifted its focus\nto aviation firms\nand\nretail companies\nin recent months.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nCisco discloses data breach impacting Cisco.com user accounts\nPandora confirms data breach amid ongoing Salesforce data theft attacks\nRetail giant Ahold Delhaize says data breach affects 2.2 million people\nOxford City Council suffers breach exposing two decades of data\nHealthcare SaaS firm says data breach impacts 5.4 million patients"
    },
    {
        "Title": "How to restore GPT-4o when you've GPT-5",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/how-to-restore-gpt-4o-when-youve-gpt-5/",
        "Summary": "Sam Altman overhyped GPT-5 and the results are underwhelming. Some users are upset with GPT-5's new personality, but you can restore GPT-4o if you pay for the Plus plan. [...]",
        "Date": "2025-08-11",
        "Content": "Sam Altman overhyped GPT-5 and the results aren't looking that good. Some users are upset with GPT-5's new personality, but you can restore GPT-4o if you pay for the Plus plan.\nGPT-5 issues aren't particularly limited to its new personality. I personally felt that GPT-5 isn't that great at maths and finance, especially when compared to GPT-4o, which attempted to answer questions pretty well.\nAt times, I'm stuck in a loop of replies where I do not get the actual answer.\nRegardless, if you're not happy with GPT-5, you can follow these steps to restore GPT-4o as an option. As I warned above, these steps work only for Plus and Pro accounts:\nOpen chatgpt.com\nClick on the profile name at the bottom left.\nClick\nSettings\nTurn on the toggle that says Show legacy models.\nClose the pop-up of the settings, and then try to interact with the model selector.\nYou'll now see GPT-4o as an option.\nYou'll not lose access to GPT-5 or GPT-5 Thinking when you use the legacy model option. This does not restore other GPT-4o models, such as mini. It also doesn't bring back o3.\nOpenAI won't tell us if it will add GPT-4o as an option to free accounts, but that seems unlikely, and I wouldn't be surprised if GPT-4o eventually disappears from Plus and Pro accounts as well.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nOpenAI is testing 3,000-per-week limit for GPT-5 Thinking\nOpenAI to fix GPT-5 issues, double rate limits for paid users after outrage\nChatGPT's GPT-5 models released: everything you need to know\nMicrosoft accidentally confirms GPT-5, GPT-5-Mini, GPT-5-Nano ahead of launch\nOpenAI prepares new open weight models along with GPT-5"
    },
    {
        "Title": "BlackSuit Ransomware Takes an Infrastructure Hit From Law Enforcement",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/blacksuit-ransomware-infrastructure-law-enforcement",
        "Summary": "A swarm of US agencies joined with international partners to take down servers and domains and seize more than $1 million associated with BlackSuit (Royal) ransomware operations, a group that has been a chronic, persistent threat against critical infrastructure.",
        "Date": "2025-08-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/blacksuit-ransomware-infrastructure-law-enforcement"
    },
    {
        "Title": "REvil Actor Accuses Russia of Planning 2021 Kaseya Attack",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/revil-actor-russia-planning-2021-kaseya-attack",
        "Summary": "REvil affiliate Yaroslav Vasinskyi, who was convicted last year for his role in the 2021 Kaseya ransomware supply chain attack, said the Russian government was instrumental to the attack's execution.",
        "Date": "2025-08-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/revil-actor-russia-planning-2021-kaseya-attack"
    },
    {
        "Title": "Echo Chamber, Prompts Used to Jailbreak GPT-5 in 24 Hours",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/echo-chamber-prompts-jailbreak-gpt-5-24-hours",
        "Summary": "Researchers paired the jailbreaking technique with storytelling in an attack flow that used no inappropriate language to guide the LLM into producing directions for making a Molotov cocktail.",
        "Date": "2025-08-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/echo-chamber-prompts-jailbreak-gpt-5-24-hours"
    },
    {
        "Title": "Utilities, Factories at Risk From Encryption Holes in Industrial Protocol",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/utilities-factories-encryption-holes-industrial-protocol",
        "Summary": "The OPC UA communication protocol is widely used in industrial settings, but despite its complex cryptography, the open source protocol appears to be vulnerable in a number of different ways.",
        "Date": "2025-08-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/utilities-factories-encryption-holes-industrial-protocol"
    },
    {
        "Title": "Will Secure AI Be the Hottest Career Path in Cybersecurity?",
        "Link": "https://www.darkreading.com/cybersecurity-operations/will-secure-ai-hottest-career-path-cybersecurity",
        "Summary": "Securing AI systems represents cybersecurity's next frontier, creating specialized career paths as organizations grapple with novel vulnerabilities, regulatory requirements, and cross-functional demands.",
        "Date": "2025-08-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/will-secure-ai-hottest-career-path-cybersecurity"
    },
    {
        "Title": "Chrome Sandbox Escape Earns Researcher $250,000",
        "Link": "https://www.securityweek.com/chrome-sandbox-escape-earns-researcher-250000/",
        "Summary": "<p>A researcher has been given the highest reward in Google’s Chrome bug bounty program for a sandbox escape with remote code execution.</p>\n<p>The post <a href=\"https://www.securityweek.com/chrome-sandbox-escape-earns-researcher-250000/\">Chrome Sandbox Escape Earns Researcher $250,000</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chrome-sandbox-escape-earns-researcher-250000/"
    },
    {
        "Title": "Managing the Trust-Risk Equation in AI: Predicting Hallucinations Before They Strike",
        "Link": "https://www.securityweek.com/managing-the-trust-risk-equation-in-ai-predicting-hallucinations-before-they-strike/",
        "Summary": "<p>New physics-based research suggests large language models could predict when their own answers are about to go wrong — a potential game changer for trust, risk, and security in AI-driven systems.</p>\n<p>The post <a href=\"https://www.securityweek.com/managing-the-trust-risk-equation-in-ai-predicting-hallucinations-before-they-strike/\">Managing the Trust-Risk Equation in AI: Predicting Hallucinations Before They Strike</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/managing-the-trust-risk-equation-in-ai-predicting-hallucinations-before-they-strike/"
    },
    {
        "Title": "Connex Credit Union Data Breach Impacts 172,000 People",
        "Link": "https://www.securityweek.com/connex-credit-union-data-breach-impacts-172000-people/",
        "Summary": "<p>Hackers targeted Connex, one of the largest credit unions in Connecticut, and likely stole files containing personal information. </p>\n<p>The post <a href=\"https://www.securityweek.com/connex-credit-union-data-breach-impacts-172000-people/\">Connex Credit Union Data Breach Impacts 172,000 People</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/connex-credit-union-data-breach-impacts-172000-people/"
    },
    {
        "Title": "Flaws in Major Automaker’s Dealership Systems Allowed Car Hacking, Personal Data Theft",
        "Link": "https://www.securityweek.com/flaws-in-major-automakers-dealership-systems-allowed-car-hacking-personal-data-theft/",
        "Summary": "<p>A researcher has demonstrated how a platform used by over 1,000 dealerships in the US could have been used to hack cars.</p>\n<p>The post <a href=\"https://www.securityweek.com/flaws-in-major-automakers-dealership-systems-allowed-car-hacking-personal-data-theft/\">Flaws in Major Automaker&#8217;s Dealership Systems Allowed Car Hacking, Personal Data Theft</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/flaws-in-major-automakers-dealership-systems-allowed-car-hacking-personal-data-theft/"
    },
    {
        "Title": "Russian Hackers Exploited WinRAR Zero-Day in Attacks on Europe, Canada",
        "Link": "https://www.securityweek.com/russian-hackers-exploited-winrar-zero-day-in-attacks-on-europe-canada/",
        "Summary": "<p>WinRAR has patched CVE-2025-8088, a zero-day exploited by Russia’s RomCom in attacks on financial, defense, manufacturing and logistics companies.</p>\n<p>The post <a href=\"https://www.securityweek.com/russian-hackers-exploited-winrar-zero-day-in-attacks-on-europe-canada/\">Russian Hackers Exploited WinRAR Zero-Day in Attacks on Europe, Canada</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/russian-hackers-exploited-winrar-zero-day-in-attacks-on-europe-canada/"
    },
    {
        "Title": "BadCam: New BadUSB Attack Turns Linux Webcams Into Persistent Threats",
        "Link": "https://www.securityweek.com/badcam-new-badusb-attack-turns-linux-webcams-into-persistent-threats/",
        "Summary": "<p>Eclypsium researchers have demonstrated a BadCam attack against Lenovo cameras, but others may be impacted as well.</p>\n<p>The post <a href=\"https://www.securityweek.com/badcam-new-badusb-attack-turns-linux-webcams-into-persistent-threats/\">BadCam: New BadUSB Attack Turns Linux Webcams Into Persistent Threats </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-11",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/badcam-new-badusb-attack-turns-linux-webcams-into-persistent-threats/"
    },
    {
        "Title": "Patient PII and PHI Allegedly Leaked Following Ransomware Attack on California Surgeon Louis Tieu DDS MD",
        "Link": "https://dailydarkweb.net/patient-pii-and-phi-allegedly-leaked-following-ransomware-attack-on-california-surgeon-louis-tieu-dds-md/",
        "Summary": "The INC Ransomware group has allegedly targeted Louis Tieu DDS MD, a prominent oral and maxillofacial surgeon based in California. Dr. Tieu, an alumnus of the UCSF School of Dentistry and UCD School of Medicine, operates a practice with a reported revenue of $5 million. The ransomware group posted the claim on August 11, 2025, [&#8230;]",
        "Date": "2025-08-11",
        "Content": "The INC Ransomware group has allegedly targeted Louis Tieu DDS MD, a prominent oral and maxillofacial surgeon based in California. Dr. Tieu, an alumnus of the UCSF School of Dentistry and UCD School of Medicine, operates a practice with a reported revenue of $5 million. The ransomware group posted the claim on August 11, 2025, asserting that the surgeon is “responsible for the leak of more than 500 pieces of personal data belonging to his clients.” This incident places the highly sensitive personal and medical information of numerous patients at significant risk.\nThe evidence posted by the threat actors includes a variety of sensitive documents, indicating a severe data breach affecting the practice’s patients. The leak of such information, which includes government-issued IDs and health insurance details, could lead to identity theft, financial fraud, and other malicious activities targeting the individuals whose data was compromised. The breach highlights the growing trend of ransomware attacks targeting the healthcare sector, where time-sensitive operations and the critical nature of data make organizations more likely to be targeted.\nThe allegedly exfiltrated data includes, but is not limited to:\nPersonal Identification documents, including Driver Licenses and ID cards\nHealth insurance information\nFinancial data, including Debit Card details\nTags:\ndata-breach\nHealthcare\nINC ransomware\nLouis Tieu DDS MD\nPHI\nPII\nransomware"
    },
    {
        "Title": "Indonesian Logistics Giant JNE Allegedly Breached – 81 Million Records for Sale",
        "Link": "https://dailydarkweb.net/indonesian-logistics-giant-jne-allegedly-breached-81-million-records-for-sale/",
        "Summary": "A massive database allegedly belonging to the Indonesian freight forwarding company, PT. Tiki Jalur Nugraha Ekakurir (JNE), has been put up for sale on a dark web forum. A threat actor claims to have obtained approximately 81.47 million records, totaling 245GB of uncompressed data. The actor stated they had attempted to contact JNE about the [&#8230;]",
        "Date": "2025-08-11",
        "Content": "A massive database allegedly belonging to the Indonesian freight forwarding company, PT. Tiki Jalur Nugraha Ekakurir (JNE), has been put up for sale on a dark web forum. A threat actor claims to have obtained approximately 81.47 million records, totaling 245GB of uncompressed data. The actor stated they had attempted to contact JNE about the vulnerability but received no response, leading them to offer the database for sale. The data was reportedly exfiltrated on August 10, 2025.\nJNE is one of the largest and most critical logistics and courier companies in Indonesia, boasting a network that covers over 83,000 destinations and employs more than 50,000 people. A breach of this magnitude could have severe consequences for millions of customers, exposing sensitive personal and shipping information. The threat actor has put the entire database up for sale for $2,000 and has provided a 100k-record sample to substantiate their claims.\nThe compromised information is said to encompass logistics data from May 2025 to August 8, 2025. The detailed records allegedly contain a wealth of personally identifiable information (PII) and shipping details. The exposed data reportedly includes:\nRecipient’s name\nRecipient’s address\nRecipient’s mobile phone number\nWaybill number\nDescription of goods\nCourier details\nGeolocation data of deliveries\nTags:\nCyberSecurity\ndata-breach\ndata-leak\nIndonesia\nJNE\nLogistics\nPII"
    },
    {
        "Title": "Global Eyewear Giant Marcolin Allegedly Breached",
        "Link": "https://dailydarkweb.net/global-eyewear-giant-marcolin-allegedly-breached/",
        "Summary": "Marcolin, a leading Italian eyewear company founded in 1961, has allegedly fallen victim to a significant data breach. The company, renowned for its combination of traditional craftsmanship and advanced technology in the global eyewear market, is now at the center of a security incident after a threat actor claimed to have exfiltrated and leaked its [&#8230;]",
        "Date": "2025-08-11",
        "Content": "Marcolin, a leading Italian eyewear company founded in 1961, has allegedly fallen victim to a significant data breach. The company, renowned for its combination of traditional craftsmanship and advanced technology in the global eyewear market, is now at the center of a security incident after a threat actor claimed to have exfiltrated and leaked its database on a hacking forum.\nThe actor behind the post alleges that the leaked data contains 346,000 rows of information, distributed across 117 individual CSV files. The sample data provided in the forum post suggests that the compromised information belongs to business partners and clients, primarily opticians and distributors. This raises concerns about the security of Marcolin’s B2B network and the potential for misuse of the exposed corporate information.\nBased on the information shared by the threat actor, the allegedly leaked database includes the following types of data:\nName\nAddress\nCity\nCountry\nRegion\nZipcode\nPhone Number\nTags:\nallegedly\nCyberSecurity\ndata-breach\ndata-leak\neyewear\nItaly\nMarcolin"
    },
    {
        "Title": "WinRAR Zero-Day Vulnerability Allegedly Exploited by Russian Hackers to Target Governments",
        "Link": "https://dailydarkweb.net/winrar-zero-day-vulnerability-allegedly-exploited-by-russian-hackers-to-target-governments/",
        "Summary": "A previously unknown zero-day vulnerability in WinRAR, one of the world&#8217;s most popular file archiving utilities, is allegedly being exploited by Russian state-sponsored hacking groups. The critical flaw, tracked as CVE-2025-8088, has been used in targeted attacks against governmental and other organizations across Europe and Canada. WinRAR is a household name in software, used by [&#8230;]",
        "Date": "2025-08-11",
        "Content": "A previously unknown zero-day vulnerability in WinRAR, one of the world’s most popular file archiving utilities, is allegedly being exploited by Russian state-sponsored hacking groups. The critical flaw, tracked as CVE-2025-8088, has been used in targeted attacks against governmental and other organizations across Europe and Canada. WinRAR is a household name in software, used by millions of people and organizations globally to compress and decompress files, making any vulnerability a significant security concern.\nThe attacks reportedly begin with sophisticated phishing campaigns, where targets receive emails containing a specially crafted malicious archive. When a user attempts to open this file with a vulnerable version of WinRAR, the exploit is triggered, allowing the attackers to execute arbitrary code on the victim’s computer. This provides the threat actors with a foothold in the compromised system, which they have been observed using to deploy malware known as RomCom, a remote access trojan that grants them extensive control over the infected machine.\nThe campaign highlights the continued use of software vulnerabilities by advanced persistent threat (APT) groups for espionage and intelligence gathering. Security researchers have linked the activity to groups associated with Russian foreign intelligence. In response to the discovery, the developers of WinRAR have released a patched version of the software. All users are strongly urged to update to the latest version immediately to protect their systems from this ongoing threat.\nTags:\nCVE-2025-8088\nCyberSecurity\nhacking\nphishing\nRomCom\nRussia\nWinRAR\nZero-Day"
    },
    {
        "Title": "Italian Tech Integrator Alascom Allegedly Hit by Rhysida Ransomware",
        "Link": "https://dailydarkweb.net/italian-tech-integrator-alascom-allegedly-hit-by-rhysida-ransomware/",
        "Summary": "The Rhysida ransomware group has allegedly targeted Alascom, an Italian company specializing in ICT and industrial automation. The company, which has been operating for over two decades, is known for its role as a system integrator and supplier of technical consulting services, with deep expertise in telecommunication networks and IP technologies. The ransomware group has [&#8230;]",
        "Date": "2025-08-11",
        "Content": "The Rhysida ransomware group has allegedly targeted Alascom, an Italian company specializing in ICT and industrial automation. The company, which has been operating for over two decades, is known for its role as a system integrator and supplier of technical consulting services, with deep expertise in telecommunication networks and IP technologies. The ransomware group has added Alascom to its dark web leak site, claiming responsibility for the cyberattack.\nRhysida has initiated an auction for the data allegedly exfiltrated from Alascom’s systems, setting a 7-day deadline for potential buyers. The group is demanding 5 BTC for the data package, stating that it contains “exclusive, unique, and impressive data” which will be sold to a single buyer to ensure exclusivity. This tactic is designed to create urgency and pressure the victim company or interested third parties into paying the ransom.\nAs proof of the breach, the Rhysida group has published a sample of the stolen files. The exposed data allegedly includes a variety of sensitive information, suggesting a deep compromise of the company’s network. The sample files contain:\nFinancial documents, including invoices and VAT summaries.\nScans of employee identification documents and passports.\nCorporate purchase orders, some of which appear to involve major telecommunications partners like Nokia.\nTags:\nAlascom\ndata-breach\nICT\nItaly\nransomware\nRhysida"
    },
    {
        "Title": "Howard Financial & Associates Allegedly Hit by INC Ransomware",
        "Link": "https://dailydarkweb.net/howard-financial-associates-allegedly-hit-by-inc-ransomware/",
        "Summary": "The INC Ransomware group has allegedly targeted Howard Financial &#38; Associates, a financial services firm with a reported revenue of $5 million. The company, which collaborates with major partners such as AIG, Allianz, and Americo, is now listed on the ransomware group&#8217;s data leak site. This incident potentially exposes highly sensitive information belonging to the [&#8230;]",
        "Date": "2025-08-11",
        "Content": "The INC Ransomware group has allegedly targeted Howard Financial & Associates, a financial services firm with a reported revenue of $5 million. The company, which collaborates with major partners such as AIG, Allianz, and Americo, is now listed on the ransomware group’s data leak site. This incident potentially exposes highly sensitive information belonging to the company, its employees, and its customers, placing them at significant risk. The claim was posted by the threat actors on August 10, 2025.\nAccording to the post made by the ransomware group, a substantial amount of confidential data has been exfiltrated from the company’s network. The threat actors claim to have stolen a wide array of documents and databases, suggesting a deep compromise of the firm’s internal systems. If the group’s claims are accurate, the exposure of this information could lead to severe financial and reputational damage for Howard Financial & Associates and its partners.\nThe allegedly stolen data includes:\nAudit and compliance documents (LIP AUDIT 2023–2025)\nCustomer databases, including active/inactive files and customer lists\nInternal procedures and templates\nInformation related to partners (AIG, Allianz, Americo, etc.)\nPersonal work logs and diaries\nCustomer letter archives\nFinancial and product materials\nContracts and legal documentation\nTags:\ndata-breach\nFinancial Services\nHoward Financial & Associates\nINC ransomware"
    },
    {
        "Title": "WEYHRO Ransomware Group Allegedly Breaches Chemtron RiverBend and Community Services of Missouri",
        "Link": "https://dailydarkweb.net/weyhro-ransomware-group-allegedly-breaches-chemtron-riverbend-and-community-services-of-missouri/",
        "Summary": "The WEYHRO ransomware group has allegedly added two US-based organizations, Chemtron RiverBend and Community Services of Missouri, to its list of victims. The group posted claims on its dark web leak site, accompanied by evidence suggesting a significant data breach at both entities. Chemtron RiverBend is a major water-treatment solutions provider operating across the United [&#8230;]",
        "Date": "2025-08-11",
        "Content": "The WEYHRO ransomware group has allegedly added two US-based organizations, Chemtron RiverBend and Community Services of Missouri, to its list of victims. The group posted claims on its dark web leak site, accompanied by evidence suggesting a significant data breach at both entities. Chemtron RiverBend is a major water-treatment solutions provider operating across the United States and Canada, known for its environmentally conscious services. Community Services of Missouri is a leading provider of court-ordered alcohol, drug, and driving-related programs across 16 locations in the state of Missouri, handling sensitive data for individuals involved in the justice system.\nThe threat actor claims to have exfiltrated a vast amount of sensitive data from both organizations, with the alleged proof including data analysis reports detailing the compromised files. The breach appears to be extensive, encompassing recent financial records, operational data, and highly sensitive personal information. The stolen information reportedly spans from historical archives to documents created as recently as July 2025, suggesting a deep and ongoing intrusion into the victims’ networks.\nThe following organizations were listed as victims in the alleged ransomware attack:\nChemtron RiverBend:\nA prominent water-treatment provider for a wide variety of clients in the U.S. and Canada. The allegedly stolen data includes:\nExecutive, ownership, and legal agreements\nBanking, payment operations, and accounts receivable\nTax filings and regulatory compliance documents\nFinancial accounting records and customer billing information\nCustomer, vendor, and pricing data\nOperational datasets, lab reports, and archives\nCommunity Services of Missouri:\nA provider of state-approved programs such as SATOP, Ignition Interlock, and Defensive Driving for court-ordered requirements in Missouri. The allegedly stolen data includes:\nCredentials and access secrets for systems\nHighly sensitive PII/PHI including SSNs, tax returns, IDs, and medical reports\nQuickBooks company files and financial data\nJustice, court, and probation operational data, including case records and program rosters\nEmployment/HR files and legal dispute materials\nHealth and drug/urinalysis testing records\nApplication source code and configuration files\nTags:\nChemtron RiverBend\nCommunity Services of Missouri\nCyberSecurity\ndata-breach\nPHI\nPII\nransomware\nUS\nWEYHRO"
    }
]