[
    {
        "Title": "New HTTP/2 'MadeYouReset' Vulnerability Enables Large-Scale DoS Attacks",
        "Link": "https://thehackernews.com/2025/08/new-http2-madeyoureset-vulnerability.html",
        "Summary": "Multiple HTTP/2 implementations have been found susceptible to a new attack technique called MadeYouReset that could be explored to conduct powerful denial-of-service (DoS) attacks.\n\"MadeYouReset bypasses the typical server-imposed limit of 100 concurrent HTTP/2 requests per TCP connection from a client. This limit is intended to mitigate DoS attacks by restricting the number of simultaneous",
        "Date": "2025-08-14",
        "Content": "Multiple HTTP/2 implementations have been found susceptible to a new attack technique called MadeYouReset that could be explored to conduct powerful denial-of-service (DoS) attacks.\n\"MadeYouReset bypasses the typical server-imposed limit of 100 concurrent HTTP/2 requests per TCP connection from a client. This limit is intended to mitigate DoS attacks by restricting the number of simultaneous requests a client can send,\" researchers Gal Bar Nahum, Anat Bremler-Barr, and Yaniv Harel said.\n\"With MadeYouReset, an attacker can send many thousands of requests, creating a denial-of-service condition for legitimate users and, in some vendor implementations, escalating into out-of-memory crashes.\"\nThe vulnerability has been assigned the generic CVE identifier, CVE-2025-8671, although the issue impacts several products, including Apache Tomcat (CVE-2025-48989), F5 BIG-IP (CVE-2025-54500), and Netty (CVE-2025-55163).\nMadeYouReset is the latest flaw in HTTP/2 after Rapid Reset (CVE-2023-44487) and HTTP/2 CONTINUATION Flood that can be potentially weaponized to stage large-scale DoS attacks.\nJust like how the other two attacks leverage the RST_STREAM frame and CONTINUATION frames, respectively, in the HTTP/2 protocol to pull off the attack, MadeYouReset builds upon Rapid Reset and its mitigation, which limits the number of streams a client can cancel using RST_STREAM.\nSpecifically, it takes advantage of the fact that the RST_STREAM frame is used for both client‑initiated cancellation and to signal stream errors. This is achieved by sending carefully crafted frames that trigger protocol violations in unexpected ways, prompting the server to reset the stream by issuing an RST_STREAM.\n\"For MadeYouReset to work, the stream must begin with a valid request that the server begins working on, then trigger a stream error so the server emits RST_STREAM while the backend continues computing the response,\" Bar Nahum explained.\n\"By crafting certain invalid control frames or violating protocol sequencing at just the right moment, we can make the server send RST_STREAM for a stream that already carried a valid request.\"\nThe six primitives that make the server send RST_STREAM frames include -\nWINDOW_UPDATE frame with an increment of 0\nPRIORITY frame whose length is not 5 (the only valid length for it)\nPRIORITY frame that makes a stream dependent on itself\nWINDOW_UPDATE frame with an increment that makes the window exceed 2^31 − 1 (which is the largest window size allowed)\nHEADERS frame sent after the client has closed the stream (via the END_STREAM flag)\nDATA frame sent after the client has closed the stream (via the END_STREAM flag)\nThis attack is notable not least because it obviates the need for an attacker to send an RST_STREAM frame, thereby completely bypassing Rapid Reset mitigations, and also achieves the same impact as the latter.\nIn an advisory, the CERT Coordination Center (CERT/CC) said MadeYouReset exploits a mismatch caused by stream resets between HTTP/2 specifications and the internal architectures of many real-world web servers, resulting in resource exhaustion -- something an attacker can exploit to induce a DoS attack.\n\"The discovery of server-triggered Rapid Reset vulnerabilities highlights the evolving complexity of modern protocol abuse,\" Imperva said. \"As HTTP/2 remains a foundation of web infrastructure, protecting it against subtle, spec-compliant attacks like MadeYouReset is more critical than ever.\"\nHTTP/1.1 Must Die\nThe disclosure of MadeYouReset comes as application security firm PortSwigger detailed novel HTTP/1.1 desync attacks (aka HTTP request smuggling), including a variant of CL.0 called 0.CL, exposing millions of websites to hostile takeover. Akamai (CVE-2025-32094) and Cloudflare (CVE-2025-4366) have addressed the issues.\nHTTP request smuggling is a security exploit affecting the application layer protocol that abuses the inconsistency in parsing non-RFC-compliant HTTP requests by front-end and back-end servers, permitting an attacker to \"smuggle\" a request and sidestep security measures.\n\"HTTP/1.1 has a fatal flaw: Attackers can create extreme ambiguity about where one request ends, and the next request starts,\" PortSwigger's James Kettle said. \"HTTP/2+ eliminates this ambiguity, making desync attacks virtually impossible. However, simply enabling HTTP/2 on your edge server is insufficient -- it must be used for the upstream connection between your reverse proxy and origin server.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Hackers Found Using CrossC2 to Expand Cobalt Strike Beacon’s Reach to Linux and macOS",
        "Link": "https://thehackernews.com/2025/08/researchers-warn-crossc2-expands-cobalt.html",
        "Summary": "Japan's CERT coordination center (JPCERT/CC) on Thursday revealed it observed incidents that involved the use of a command-and-control (C2) framework called CrossC2, which is designed to extend the functionality of Cobalt Strike to other platforms like Linux and Apple macOS for cross-platform system control.\nThe agency said the activity was detected between September and December 2024, targeting",
        "Date": "2025-08-14",
        "Content": "Japan's CERT coordination center (JPCERT/CC) on Thursday revealed it observed incidents that involved the use of a command-and-control (C2) framework called\nCrossC2\n, which is designed to extend the functionality of Cobalt Strike to other platforms like Linux and Apple macOS for cross-platform system control.\nThe agency said the activity was detected between September and December 2024, targeting multiple countries, including Japan, based on an analysis of VirusTotal artifacts.\n\"The attacker employed CrossC2 as well as other tools such as PsExec, Plink, and Cobalt Strike in attempts to penetrate AD. Further investigation revealed that the attacker used custom malware as a loader for Cobalt Strike,\" JPCERT/CC researcher Yuma Masubuchi\nsaid\nin a report published today.\nThe bespoke Cobalt Strike Beacon loader has been codenamed ReadNimeLoader. CrossC2, an unofficial Beacon and builder, is capable of executing various Cobalt Strike commands after establishing communication with a remote server specified in the configuration.\nIn the attacks documented by JPCERT/CC, a scheduled task set up by the threat actor on the compromised machine is used to launch the legitimate java.exe binary, which is then abused to sideload ReadNimeLoader (\"jli.dll\").\nWritten in the Nim programming language, the loader extracts the content of a text file and executes it directly in memory so as to avoid leaving traces on disk. This loaded content is an open-source shellcode loader dubbed\nOdinLdr\n, which ultimately decodes the embedded Cobalt Strike Beacon and runs it, also in memory.\nReadNimeLoader also incorporates various anti-debugging and anti-analysis techniques that are designed to prevent OdinLdr from being decoded unless the route is clear.\nJPCERT/CC said the attack campaign shares some level of overlap with BlackSuit/Black Basta ransomware activity\nreported\nby Rapid7 back in June 2025, citing overlaps in the command-and-control (C2) domain used and similarly-named files.\nAnother notable aspect is the presence of several\nELF versions\nof\nSystemBC\n, a backdoor that often acts as a precursor to the deployment of Cobalt Strike and ransomware.\n\"While there are numerous incidents involving Cobalt Strike, this article focused on the particular case in which CrossC2, a tool that extends Cobalt Strike Beacon functionality to multiple platforms, was used in attacks, compromising Linux servers within an internal network,\" Masubuchi said.\n\"Many Linux servers do not have EDR or similar systems installed, making them potential entry points for further compromise, and thus, more attention is required.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Have You Turned Off Your Virtual Oven?",
        "Link": "https://thehackernews.com/2025/08/have-you-turned-off-your-virtual-oven.html",
        "Summary": "You check that the windows are shut before leaving home. Return to the kitchen to verify that the oven and stove were definitely turned off. Maybe even circle back again to confirm the front door was properly closed. These automatic safety checks give you peace of mind because you know the unlikely but potentially dangerous consequences of forgetting – a break-in, fire, or worse.\nYour",
        "Date": "2025-08-14",
        "Content": "You check that the windows are shut before leaving home. Return to the kitchen to verify that the oven and stove were definitely turned off. Maybe even circle back again to confirm the front door was properly closed. These automatic safety checks give you peace of mind because you know the unlikely but potentially dangerous consequences of forgetting – a break-in, fire, or worse.\nYour external-facing IT infrastructure deserves the same methodical attention. External Attack Surface Management (EASM) and Digital Risk Protection (DRP) tools provide that same peace of mind for your digital \"home,\" automating the everyday safety checks that prevent costly incidents.\nWhy does the external-facing IT infrastructure need the same care?\nJust as you secure your physical home prior to leaving, your assets that are exposed to the internet require consistent safety protocols. Think about it this way:\nLocking doors = locking down exposed assets, ensuring only authorized access points remain open.\nTurning off the oven = de-provisioning unused assets and orphaned services that continue consuming resources while expanding your attack surface.\nBut there is one major difference: your home has physical limits, but your organization's attack surface can span multiple providers, regions, and development teams, making manual verification nearly impossible. A forgotten cloud instance or misconfigured storage bucket, an abandoned server, or some dev-environment can expose sensitive data for months before discovery.\nThe hidden assets that keep security teams awake at night\nDevelopment teams spin up test servers, DevOps engineers create temporary endpoints, and shadow IT proliferates across departments. Without automated discovery, these assets become invisible\nuntil attackers find them first\n. This makes CMDB-based monitoring of your vulnerabilities and attack surface difficult, as one can never be sure\nthat all exposed assets are accounted for\n. EASM solutions continuously map your internet-facing assets, discovering resources you may have forgotten existed.\nConsider the typical scenario: a developer creates a staging environment for testing new features, complete with a snapshot of production data. They complete the project and move on to other priorities, but the staging server remains online. EASM uses automated reconnaissance to identify this orphaned asset before it becomes a security incident – scanning your entire external footprint to find forgotten development servers, open ports that should have been closed after testing, and subdomains pointing to decommissioned services.\nThe threats lurking beyond your firewall\nWhile EASM focuses on asset discovery, DRP tackles a different but equally important challenge: monitoring external threats that challenge your organization, whether on Facebook or the dark web. Finding all your assets is only half the battle, knowing when criminals are posting leaked credentials for sale, discussing planned attacks against your infrastructure, or impersonating your brand online is the other half.\nDRP platforms continuously scan external channels like social media sites, underground forums, and data leak sites for mentions of your organization, providing immediate alerts when threats are detected.\nFigure 1: Example View of data leakage overview within Outpost24's CompassDRP platform.\nThese external threats develop gradually but can explode quickly. For example, a disgruntled employee may intentionally leak sensitive documents to file-sharing sites, or a hacker may start selling access to your systems on dark web forums. Without ongoing monitoring, threats can continue to grow and gain momentum before you realize they exist.\nEarly detection tools work like a smoke alarm for your organization's reputation and cybersecurity posture. It gives you a heads up that something is wrong – hopefully\nbefore\ndamage can be caused or the threat can no longer be contained. DRP platforms help detect when cybercriminals discuss your company in attack forums or create fake social media profiles using your branding for phishing campaigns. These early warnings let you immediately respond, protecting your customers and mitigating the threat.\nFigure 2: Example details of a ransomware group operating on the dark web with Outpost24's CompassDRP platform.\nBuilding a \"Did I leave anything on?\" security ritual\nJust like you develop a routine for checking your home before leaving, you need to build operational habits around EASM and DRP. Set up daily or weekly scan summaries based on the continuous scans of the tools that answer that nagging question: \"Did I leave anything on?\" Regularly generating these reports ensures you can surface newly discovered assets, configuration changes, and potential risks that need your attention.\nThe beauty lies in making your security systematic rather than reactive. You review high-risk items, quickly approving legitimate resources or shutting down unnecessary ones. Instead of scrambling to find forgotten infrastructure after an incident or patch alert, you prevent the accumulation of risk before it becomes a problem.\nBetter yet, you can integrate these insights both into your existing Cybersecurity tech-stack as well as any change management workflows. When you make infrastructure changes, EASM validates your external footprint while DRP ensures configurations stay within acceptable parameters. And keep in mind that the tool should automatically create audit trails so that you can demonstrate due diligence without extra paperwork.\nKeeping track of changes\nAdditionally, quantify your security improvements to justify continued investment in easy-to-manage dashboards and customized reports. Track metrics like the number of \"virtual ovens\" you've turned off, your time to detect and react to orphaned services, and your time to remediate critical vulnerabilities. These measurements will help you demonstrate program effectiveness while identifying areas for improvement.\nFigure 3: Keep track of your threat and vulnerability landscape within one dashboard.\nYou'll also appreciate how automated alerts and customizable workflows prioritize your attention on the most critical issues. Rather than overwhelming you with every discovered asset, intelligent, AI-powered filtering and summaries highlight genuine risks that require your immediate action. The system learns from your responses, reducing false positives while maintaining sensitivity to legitimate threats.\nAttack Surface Management for peace of mind\nThe comfort of knowing nothing's left unmonitored – whether a physical oven or a misconfigured cloud service – comes from verification, not just hoping for the best. EASM and DRP tools help automate the essential proactive safety monitoring steps that prevent costly security incidents.\nSolutions like\nOutpost24's CompassDRP\ncombine EASM capabilities with comprehensive Digital Risk Protection and Threat Intelligence, giving you continuous visibility across your entire digital footprint and the risks associated with it. You get automated asset discovery and threat intelligence-based risk prioritization in a single platform, letting you focus on addressing business-critical risks.\nStart building a continuous external attack surface and digital risk management today –\nbook your CompassDRP demo\n.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "New Android Malware Wave Hits Banking via NFC Relay Fraud, Call Hijacking, and Root Exploits",
        "Link": "https://thehackernews.com/2025/08/new-android-malware-wave-hits-banking.html",
        "Summary": "Cybersecurity researchers have disclosed a new Android trojan called PhantomCard that abuses near-field communication (NFC) to conduct relay attacks for facilitating fraudulent transactions in attacks targeting banking customers in Brazil.\n\"PhantomCard relays NFC data from a victim's banking card to the fraudster's device,\" ThreatFabric said in a report. \"PhantomCard is based on",
        "Date": "2025-08-14",
        "Content": "Cybersecurity researchers have disclosed a new Android trojan called\nPhantomCard\nthat abuses near-field communication (NFC) to conduct relay attacks for facilitating fraudulent transactions in attacks targeting banking customers in Brazil.\n\"PhantomCard relays NFC data from a victim's banking card to the fraudster's device,\" ThreatFabric\nsaid\nin a report. \"PhantomCard is based on Chinese-originating NFC relay malware-as-a-service.\"\nThe Android malware, distributed via fake Google Play web pages mimicking apps for card protection, goes by the name \"Proteção Cartões\" (package name \"com.nfupay.s145\" or \"com.rc888.baxi.English\").\nThe bogus pages also feature deceptive positive reviews to persuade victims into installing the app. It's currently not known how links to these pages are distributed, but it likely involves smishing or a similar social engineering technique.\nOnce the app is installed and opened, it requests victims to place their credit/debit card on the back of the phone to begin the verification process, at which point the user interface displays the message: \"Card Detected! Keep the card nearby until authentication is complete.\"\nIn reality, the card data is relayed to an attacker-controlled NFC relay server by taking advantage of the built-in NFC reader built into modern devices. The PhantomCard-laced app then requests the victim to enter the PIN code with the goal of transmitting the information to the cybercriminal so as to authenticate the transaction.\n\"As a result, PhantomCard establishes a channel between the victim's physical card and the PoS terminal / ATM that the cybercriminal is next to,\" ThreatFabric explained. \"It allows the cybercriminal to use the victim's card as if it was in their hands.\"\nSimilar to\nSuperCard X\n, there exists an equivalent app on the mule-side that's installed on their device to receive the stolen card information and ensure seamless communications between the PoS terminal and the victim's card.\nThe Dutch security company said the actor behind the malware, Go1ano developer, is a \"serial\" reseller of Android threats in Brazil, and that PhantomCard is actually the handiwork of a Chinese malware-as-a-service offering known as NFU Pay that's advertised on Telegram.\nGo1ano developer, in their own Telegram channel, claims PhantomCard works globally, stating it is 100% undetectable and is compatible with all NFC-enabled point-of-sale (PoS) terminal devices. They also claim to be a \"trusted partner\" for other malware families like BTMOB and GhostSpy in the country.\nIt's worth noting that NFU Pay is one of the many illicit services peddled on the underground that offer similar NFC relay capabilities, such as\nSuperCard X\n,\nKingNFC, and X/Z/TX-NFC\n.\n\"Such threat actors pose additional risks to local financial organizations as they open the doors for a wider variety of threats from all over the world, which could have potentially stayed away from certain regions due to language and cultural barriers, specifics of financial system, lack of cash-out ways,\" ThreatFabric said.\n\"This, consequently, complicates the threat landscape for local financial organizations and calls out for proper monitoring of the global threats and actors behind it targeting the organization.\"\nIn a report published last month warning of a spike in NFC-enabled fraud in the Philippines, Resecurity said Southeast Asia has become a testing ground for NFC fraud, with bad actors targeting regional banks and financial service providers.\n\"With tools such as Z-NFC, X-NFC, SuperCard X, and Track2NFC, attackers can clone stolen card data and perform unauthorized transactions using NFC-enabled devices,\" Resecurity\nsaid\n.\n\"These tools are widely available in underground forums and private messaging groups. The resulting fraud is difficult to detect, as the transactions appear to originate from trusted, authenticated devices. In markets like the Philippines, where contactless payment usage is rising and low-value transactions often bypass PIN verification, such attacks are harder to trace and stop in real time.\"\nThe disclosure comes as K7 Security uncovered an Android malware campaign dubbed SpyBanker aimed at Indian banking users that's likely distributed to users via WhatsApp under the guise of a customer help service app.\n\"Interestingly, this Android SpyBanker malware edits the 'Call Forward Number' to a hard-coded mobile number, controlled by the attacker, by registering a service called 'CallForwardingService' and redirects the user's calls,\" the company\nsaid\n. \"Incoming calls to the victims when left unattended are diverted to the call forwarded number to carry out any desired malicious activity.\"\nFurthermore, the malware comes fitted with capabilities to collect victims' SIM details, sensitive banking information, SMS messages, and notification data.\nIndian banking users have also been targeted by Android malware that's designed to siphon financial information, while simultaneously dropping the XMRig cryptocurrency miner on compromised devices. The malicious credit card apps are distributed via convincing phishing pages that use real assets taken from official banking websites.\nThe list of malicious apps is as follows -\nAxis Bank Credit Card (com.NWilfxj.FxKDr)\nICICI Bank Credit Card (com.NWilfxj.FxKDr)\nIndusInd Credit Card (com.NWilfxj.FxKDr)\nState Bank of India Credit Card (com.NWilfxj.FxKDr)\nThe malware is designed to display a bogus user interface that prompts victims to enter their personal information, including names, card numbers, CVV codes, expiry dates, and mobile numbers. A notable aspect of the app is its ability to listen to specific messages sent via Firebase Cloud Messaging (FCM) to trigger the mining process.\n\"The app delivered through these phishing sites functions as a dropper, meaning it initially appears harmless but later dynamically loads and executes the actual malicious payload,\" McAfee researcher Dexter Shin\nsaid\n. \"This technique helps evade static detection and complicates analysis.\"\n\"These phishing pages load images, JavaScript, and other web resources directly from the official websites to appear legitimate. However, they include additional elements such as 'Get App' or 'Download' buttons, which prompt users to install the malicious APK file.\"\nThe findings also follow a report from Zimperium zLabs detailing how rooting frameworks like\nKernelSU\n,\nAPatch\n, and\nSKRoot\ncan be used to gain root access and escalate privileges, allowing an attacker to gain full control of Android devices.\nThe mobile security company said it discovered in mid-2023 a security flaw in KernelSU (version 0.5.7) that it said could allow attackers to authenticate as the KernelSU manager and completely compromise a rooted Android device via a malicious application already installed on it that also bundles the official\nKernelSU manager APK\n.\nHowever, an important caveat to pull off this attack is that it's only effective if the threat actor application is executed before the legitimate KernelSU manager application.\n\"Because system calls can be triggered by any app on the device, strong authentication and access controls are essential,\" security researcher Marcel Bathke\nsaid\n. \"Unfortunately, this layer is often poorly implemented – or entirely neglected – which opens the door to serious security risks. Improper authentication can allow malicious apps to gain root access and fully compromise the device.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Simple Steps for Attack Surface Reduction",
        "Link": "https://thehackernews.com/2025/08/simple-steps-for-attack-surface.html",
        "Summary": "Story teaser text: Cybersecurity leaders face mounting pressure to stop attacks before they start, and the best defense may come down to the settings you choose on day one. In this piece, Yuriy Tsibere explores how default policies like deny-by-default, MFA enforcement, and application Ringfencing ™ can eliminate entire categories of risk. From disabling Office macros to blocking outbound server",
        "Date": "2025-08-14",
        "Content": "Story teaser text: Cybersecurity leaders face mounting pressure to stop attacks before they start, and the best defense may come down to the settings you choose on day one. In this piece, Yuriy Tsibere explores how default policies like deny-by-default, MFA enforcement, and application Ringfencing ™ can eliminate entire categories of risk. From disabling Office macros to blocking outbound server traffic, these simple but strategic moves create a hardened environment that attackers can't easily penetrate. Whether you're securing endpoints or overseeing policy rollouts, adopting a security-by-default mindset can reduce complexity, shrink your attack surface, and help you stay ahead of evolving threats.\nCybersecurity has changed dramatically since the days of the \"Love Bug\" virus in 2001. What was once an annoyance is now a profit-driven criminal enterprise worth billions. This shift demands proactive defense strategies that don't just respond to threats—they prevent them from ever reaching your network.\nCISOs, IT admins, and MSPs need solutions that block attacks by default\n, not just detect them after the fact. Industry frameworks like NIST, ISO, CIS, and HIPAA provide guidance, but they often lack the clear, actionable steps needed to implement effective security.\nFor anyone starting a new security leadership role, the mission is clear: Stop as many attacks as possible, frustrate threat actors, and do it without alienating the IT team. That's where a security-by-default mindset comes in—configuring systems to block risks out of the gate. As I've often said, the attackers only have to be right once. We have to be right 100% of the time.\nHere's how setting the right defaults can eliminate entire categories of risk.\nRequire multi-factor authentication (MFA) on all remote accounts\nEnabling MFA across all remote services—including SaaS platforms like Office 365 and G Suite, as well as domain registrars and remote access tools—is a foundational security default. Even if a password is compromised, MFA can prevent unauthorized access. Try to avoid using text messages for MFA as it can be intercepted.\nWhile it may introduce some friction, the security benefits far outweigh the risk of data theft or financial loss.\nDeny-by-default\nOne of the most effective security measures nowadays is application whitelisting or allowlisting. This approach blocks everything by default and only allows known, approved software to run.\nThe result: Ransomware and other malicious applications are stopped before they can execute. It also blocks legitimate-but-unauthorized remote tools like AnyDesk or similar, which attackers often try to sneak in through social engineering.\nUsers can still access what they need via a pre-approved store of safe applications, and visibility tools make it easy to track everything that runs—including portable apps.\nQuick wins through secure configuration\nSmall changes to default settings can close major security gaps on Windows and other platforms:\nTurn off Office macros: It takes five minutes and blocks one of the most common attack vectors for ransomware.\nUse password-protected screensavers: Auto-lock your screen after a short break to stop anyone from snooping around.\nDisable SMBv1: This old-school protocol is outdated and has been used in big attacks like WannaCry. Most systems don't need it anymore.\nTurn off the Windows keylogger: It's rarely useful and could be a security risk if left on.\nControl network and application behavior for organizations\nRemove local admin rights: Most malware doesn't need admin access to run, but taking it away stops users from messing with security settings or even installing malicious software.\nBlock unused ports and limit outbound traffic:\nShut down SMB and RDP ports unless absolutely necessary—and only allow trusted sources.\nStop servers from reaching the internet unless they need to. This helps avoid attacks like SolarWinds.\nControl application behaviors: Tools like ThreatLocker Ringfencing ™ can stop apps from doing sketchy things\n—like Word launching PowerShell (yes, that's a real attack method).\nSecure your VPN: If you don't need it, turn it off. If you do, limit access to specific IPs and restrict what users can access.\nStrengthen data and web controls\nBlock USB drives by default: They're a common way for malware to spread. Only allow secure managed, encrypted ones if needed.\nLimit file access: Apps shouldn't be able to poke around in user files unless they really need to.\nFilter out unapproved tools: Block random SaaS or cloud apps that haven't been vetted. Let users request access if they need something.\nTrack file activity: Keep an eye on who's doing what with files—both on devices and in the cloud. It's key for spotting shady behavior.\nGo beyond defaults with monitoring and patching\nStrong defaults are just the beginning. Ongoing vigilance is critical:\nRegular patching: Most attacks use known bugs. Keep everything updated—including portable apps.\nAutomated threat detection: EDR tools are great, but if no one's watching alerts 24/7, threats can slip through. MDR services can jump in fast, even after hours.\nSecurity by default isn't just smart, it's non-negotiable. Blocking unknown apps, using strong authentication, locking down networks and app behavior can wipe out a ton of risk. Attackers only need one shot, but solid default settings keep your defenses ready all the time. The payoff? Fewer breaches, less hassle, and a stronger, more resilient setup.\nNote:\nThis article is expertly written and contributed by Yuriy Tsibere, Product Manager and Business Analyst at ThreatLocker.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Google Requires Crypto App Licenses in 15 Regions as FBI Warns of $9.9M Scam Losses",
        "Link": "https://thehackernews.com/2025/08/google-requires-crypto-app-licenses-in.html",
        "Summary": "Google said it's implementing a new policy requiring developers of cryptocurrency exchanges and wallets to obtain government licenses before publishing apps in 15 jurisdictions in order to \"ensure a safe and compliant ecosystem for users.\"\nThe policy applies to markets like Bahrain, Canada, Hong Kong, Indonesia, Israel, Japan, the Philippines, South Africa, South Korea, Switzerland, Thailand,",
        "Date": "2025-08-14",
        "Content": "Google said it's implementing a new policy requiring developers of cryptocurrency exchanges and wallets to obtain government licenses before publishing apps in 15 jurisdictions in order to \"ensure a safe and compliant ecosystem for users.\"\nThe policy applies to markets like Bahrain, Canada, Hong Kong, Indonesia, Israel, Japan, the Philippines, South Africa, South Korea, Switzerland, Thailand, the United Arab Emirates, the United Kingdom, the United States, and the European Union. The changes do not apply to non-custodial wallets.\nThis means developers publishing cryptocurrency exchange and wallet apps have to hold appropriate licences or be registered with relevant authorities like the Financial Conduct Authority (FCA) or Financial Crimes Enforcement Network (FinCEN), or authorized as a crypto-asset service provider (CASP) under the Markets in Crypto-Assets (MiCA) regulation before distribution.\n\"If your targeted location is not on the list, you may continue to publish cryptocurrency exchanges and software wallets. However, due to the rapidly evolving regulatory landscape worldwide, developers are expected to obtain any additional licensure requirements per local laws,\" the tech giant\nsaid\n.\nGoogle noted that developers have to declare under the App Content section that their app is a cryptocurrency exchange and/or software wallet in the Financial Features Declaration. In addition, the company said it may request developers to provide more information regarding their compliance in a given jurisdiction that's not covered in the aforementioned list.\nDevelopers who don't have the required registration or licensing information for certain locations are being urged to remove the apps from those targeting countries/regions.\nThe disclosure comes as the U.S. Federal Bureau of Investigation (FBI) issued an updated alert warning of cryptocurrency scams in which companies falsely claim to help victims recover their stolen funds to further defraud them.\nFraudsters have been observed posing as lawyers representing fictitious law firms, approaching scam victims on social media and other messaging platforms to assist with fund recovery, only to dupe them a second time under the pretext of receiving their information from the FBI, Consumer Financial Protection Bureau (CFPB), or other government agency.\n\"Between February 2023 and February 2024, cryptocurrency scam victims who were further exploited by fictitious law firms reported losses totaling over $9.9 million,\" the FBI\nsaid\nin an alert last June.\nThe FBI also listed a number of potential red flags that users are advised to look for that could indicate a potential scam -\nImpersonation of government entities or actual lawyers\nReferences to fictitious government or regulatory entities\nRequesting payment in cryptocurrency or prepaid gift cards (the U.S. government does not request payment for law enforcement services provided)\nHaving knowledge of the exact amounts and dates of previous wire transfers and the third-party company where the victim previously sent scammed funds\nStating the victim was on a government-affiliated list of scam victims\nReferring victims to a \"crypto recovery law firm\"\nStating the victims' funds are in an account held at a foreign bank and instructing them to register an account at that bank\nPlacing victims into a group chat on WhatsApp, or other messaging applications, for supposed client safety\nRequesting victims send payment to a third-party trading company for maintaining secrecy and safety\nInability to provide credentials or a license\n\"Be cautious of law firms contacting you unexpectedly, especially if you have not reported the crime to any law enforcement or civil protection agencies,\" the FBI\nsaid\n, urging citizens to exercise due diligence and adopt a zero-trust model.\n\"Request video verification or documentation or a photo of their law license. Request verification of employment for anyone claiming to work for the US Government or law enforcement.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "CISA Adds Two N-able N-central Flaws to Known Exploited Vulnerabilities Catalog",
        "Link": "https://thehackernews.com/2025/08/cisa-adds-two-n-able-n-central-flaws-to.html",
        "Summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday added two security flaws impacting N-able N-central to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation.&nbsp;\nN-able N-central is a Remote Monitoring and Management (RMM) platform designed for Managed Service Providers (MSPs), allowing customers to efficiently manage and secure",
        "Date": "2025-08-14",
        "Content": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday\nadded\ntwo security flaws impacting N-able N-central to its Known Exploited Vulnerabilities (\nKEV\n) catalog, citing evidence of active exploitation.\nN-able N-central is a Remote Monitoring and Management (RMM) platform designed for Managed Service Providers (MSPs), allowing customers to efficiently manage and secure their clients' Windows, Apple, and Linux endpoints from a single, unified platform.\nThe vulnerabilities in question are listed below -\nCVE-2025-8875\n(CVSS score: N/A) - An insecure deserialization vulnerability that could lead to command execution\nCVE-2025-8876\n(CVSS score: N/A) - A command injection vulnerability via improper sanitization of user input\nBoth shortcomings have been addressed in N-central versions\n2025.3.1\nand\n2024.6 HF2\nreleased on August 13, 2025. N-able is also urging customers to make sure that multi-factor authentication (MFA) is enabled, particularly for admin accounts.\n\"These vulnerabilities require authentication to exploit,\" N-able\nsaid\nin an alert. \"However, there is a potential risk to the security of your N-central environment, if unpatched. You must upgrade your on-premises N-central to 2025.3.1.\"\nIt's currently not known how the vulnerabilities are being exploited in real-world attacks, in what context, and what is the scale of such efforts. The Hacker News has reached out to N-able for comment, and we will update the story if we hear back.\nIn light of active exploitation, Federal Civilian Executive Branch (FCEB) agencies are recommended to apply the necessary fixes by August 20, 2025, to secure their networks.\nThe development comes a day after CISA\nplaced\ntwo-year-old security flaws affecting Microsoft Internet Explorer and Office in the KEV catalog -\nCVE-2013-3893\n(CVSS score: 8.8) - A memory corruption vulnerability in Microsoft Internet Explorer that allows for remote code execution\nCVE-2007-0671\n(CVSS score: 8.8) - A remote code execution vulnerability in Microsoft Office Excel that can be exploited when a specially crafted Excel file is opened to achieve remote code execution\nFCEB agencies have time till September 9, 2025, to update to the latest versions, or discontinue their use if the product has reached end-of-life (EoL) status, as is the case with\nInternet Explorer\n.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Over $300 million in cybercrime crypto seized in anti-fraud effort",
        "Link": "https://www.bleepingcomputer.com/news/security/over-300-million-in-cybercrime-crypto-seized-in-anti-fraud-effort/",
        "Summary": "More than $300 million worth of cryptocurrency linked to cybercrime and fraud schemes has been frozen due to two separate initiatives involving law enforcement and private companies. [...]",
        "Date": "2025-08-14",
        "Content": "More than $300 million worth of cryptocurrency linked to cybercrime and fraud schemes has been frozen due to two separate initiatives involving law enforcement and private companies.\nOne initiative is the T3+ Global Collaborator Program launched by the T3 Financial Crime Unit (T3 FCU), a joint effort deployed almost a year ago by intelligence firm TRM Labs, TRON, and Tether, with Binance joining as the first official member - all major forces in the blockchain space.\nAccording to intelligence firm TRM Labs, more than $250 million in criminal assets worldwide have been frozen since the program started in September 2024.\nThis includes a notable $6 million frozen in a joint action with Binance against perpetrators of ‘romance baiting’ scams.\n“Since its inception in September 2024, T3 FCU has worked closely with law enforcement agencies worldwide to identify and disrupt criminal networks,”\nreads TRM Labs' announcement\n.\n“The unit has analyzed millions of transactions across five continents, monitoring over $3 billion USD in total volume,” the company states.\nSince its launch, T3 FCU has assisted law enforcement agencies around the world into investigations on money laundering, investment fraud, extortion, terrorism financing, and other serious financial crimes.\nThe second initiative is a joint operation between the United States and Canada, supported by blockchain intelligence experts at Chainalysis.\nThe collaboration resulted in two operations - “Project Atlas,” led by the Ontario Provincial Police (OPP), and “Operation Avalanche” led by the British Columbia Securities Commission (BCSC), both entities relying on analytics from Chainalysis to trace scam proceeds.\nTracing crime proceeds on the blockchain\nSource: Chainalysis\nAccording to the blockchain data platform, these investigations have uncovered in the past six months more than $74.3 million in losses linked to various types of fraud, leading to the freezing of large portions of these amounts.\n“Driven from Canada but truly global in scope, Project Atlas identified more than 2,000 crypto wallet addresses linked to fraud victims across 14 countries, including Canada, the US, Australia, Germany, and the UK,”\nexplains Chainalysis\nin a press release today.\n“Working directly with Tether, we enabled the blacklisting of more than $50 million in USDT, preventing scammers from moving or liquidating these stolen assets,” the company states.\nThe two initiatives pair coordinated investigation sprints with structured global collaboration to detect and intervene at the blockchain level, significantly hindering cybercriminals from moving or spending scam proceeds.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nUS govt seizes $1 million in crypto from BlackSuit ransomware gang\nFBI seizes $2.4M in Bitcoin from new Chaos ransomware operation\nEuropol helps disrupt $540 million crypto investment fraud ring\nFTC: Older adults lost record $700 million to scammers in 2024\nHacker extradited to US for stealing $3.3 million from taxpayers"
    },
    {
        "Title": "Crypto24 ransomware hits large orgs with custom EDR evasion tool",
        "Link": "https://www.bleepingcomputer.com/news/security/crypto24-ransomware-hits-large-orgs-with-custom-edr-evasion-tool/",
        "Summary": "The Crypto24 ransomware group has been using custom utilities to evade security solutions on breached networks, exfiltrate data, and encrypt files. [...]",
        "Date": "2025-08-14",
        "Content": "The Crypto24 ransomware group has been using custom utilities to evade security solutions on breached networks, exfiltrate data, and encrypt files.\nThe threat group's earliest activity was reported on BleepingComputer forums\nin September 2024\n, though it never reached notable levels of notoriety.\nAccording to Trend Micro researchers tracking Crypto24's operations, the hackers have hit several large organizations in the United States, Europe, and Asia, focusing on high-value targets in the finance, manufacturing, entertainment, and tech sectors.\nThe security researchers report that Crypto24 appears to be knowledgeable and well-versed, suggesting a high likelihood that it was formed by former core members of now-defunct ransomware operations.\nPost-compromise activity\nAfter gaining initial access, Crypto24 hackers activate default administrative accounts on Windows systems within enterprise environments or create new local user accounts for stealthy, persistent access.\nFollowing a reconnaissance phase using a custom batch file and commands that enumerate accounts, profile system hardware, and the disk layout, the attacker creates malicious Windows services and scheduled tasks for persistence.\nThe first is WinMainSvc, a keylogger service, and the second is MSRuntime, a ransomware loader.\nCommands and processes used for escalating privileges\nSource: Trend Micro\nNext, Crypto24 operators use a custom variant of the open-source tool RealBlindingEDR, which targets security agents from multiple vendors by disabling their kernel drivers:\nTrend Micro\nKaspersky\nSophos\nSentinelOne\nMalwarebytes\nCynet\nMcAfee\nBitdefender\nBroadcom (Symantec)\nCisco\nFortinet\nAcronis\nCrypto24’s custom RealBlindingEDR extracts the company name from the driver’s metadata, compares it to a hardcoded list, and if there’s a match, it disables kernel-level hooks/callbacks to “blind” detection engines.\nConcerning Trend Micro products specifically, the report mentions that, if the attacker has administrator privileges, they run a batch script that invokes the legitimate ‘XBCUninstaller.exe’ to uninstall Trend Vision One.\n“We observed cases where attackers executed the Trend Vision One uninstaller, XBCUninstaller.exe, via gpscript.exe,”\nTrend Micro researchers say\n.\n“The file in question is a legitimate tool provided by Trend Micro for troubleshooting, specifically to resolve issues such as fixing inconsistent agents within Trend Vision One deployments.”\n“Its intended use is to cleanly uninstall Endpoint BaseCamp when required for maintenance or support.”\nThis tool essentially prevents the detection of follow-on payloads like the keylogger (WinMainSvc.dll) and the ransomware (MSRuntime.dll), both custom tools.\nThe keylogger, which masquerades as “Microsoft Help Manager,” logs both active window titles and keypresses, including control keys (Ctrl, Alt, Shift, function keys).\nThe attackers also use SMB shares for lateral movement and staging files for extraction.\nAll stolen data is exfiltrated to Google Drive using a custom tool that leverages the WinINET API to interact with Google’s service.\nThe ransomware payload executes after deleting volume shadow copies on Windows systems to prevent easy recovery.\nOverview of a Crypto24 attack\nSource: Trend Micro\nTrend Micro does not provide any details about the ransomware part of the attack, such as encryption scheme, the ransom notes, communication methods, targeted file paths, language, or branding clues.\nThe cybersecurity company has shared at the end of the report a list of\nindicators of compromise\nthat other defenders can use to detect and block Crypto24 ransomware attacks before they reach the ultimate stages.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nNew EDR killer tool used by eight different ransomware groups\nWhen Theft Replaces Encryption: Blue Report 2025 on Ransomware & Infostealers\nManpower discloses data breach affecting nearly 145,000 people\nUS govt seizes $1 million in crypto from BlackSuit ransomware gang\nMuddyWater’s DarkBit ransomware cracked for free data recovery"
    },
    {
        "Title": "Pro-Russian hackers blamed for water dam sabotage in Norway",
        "Link": "https://www.bleepingcomputer.com/news/security/pro-russian-hackers-blamed-for-water-dam-sabotage-in-norway/",
        "Summary": "The Norwegian Police Security Service (PST) says that pro-Russian hackers took control of critical operation systems at a dam and opened outflow valves. [...]",
        "Date": "2025-08-14",
        "Content": "The Norwegian Police Security Service (PST) says that pro-Russian hackers took control of critical operation systems at a dam and opened outflow valves.\nThe attack occurred in April and is thought to have been a demonstration of Russia’s ability to remotely hack critical infrastructure in the country.\nAt the Arendalsuka annual national forum in the city of Arendal, the head of the PST, Beate Gangås, spoke about the incident saying that it was less of an attempt to cause damage than a display of what the hackers can do.\n“They don’t necessarily aim to cause destruction, but to show what they are capable of,” stated Gangås during her talk about the sabotage operation.\n“The purpose of these kinds of actions is to exert influence and create fear or unrest in the population,” the PST chief also stated, noting that Russia has become more dangerous.\nAccording to\nlocal media reports\n, the hackers compromised a digital system controlling the water flow at the Bremanger dam, and set the outflow valves to open position.\nIt took dam operators roughly four hours to discover and reverse the malicious valve setting. By that time, though, more than 7.2 million liters (1.9 million gallons) of water had flown through.\nNorway’s National Criminal Investigation Service (Kripos) reached the\nsame conclusion\nin June, based on videos that Russian hacktivists published on the Telegram messaging service to prove their intrusion.\nSpecifically, the hacktivists published a three-minute video showing the dam’s control panel, featuring a watermark associated with a pro-Russian cybercriminal group.\nSuch acts have been previously associated with state-sponsored groups\nlike Sandworm\n(APT44), and aimed at exaggerating impact claims to create fear and uncertainty, and to publicly humiliate compromised organizations.\nThis is the second time Russia is associated with attacks against Norwegian entities, the previous one being a distributed denial-of-service\n(DDoS) attack\non the country’s state services.\nNorway’s Intelligence Chief, Nils Andreas Stensønes, stated that, while Norway is not at war with Russia, President Putin maintains tension through hybrid attacks against the entire West.\nStensønes characterized Russia as an unpredictable neighbor and the biggest threat that Norway faces currently.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nCurly COMrades cyberspies hit govt orgs with custom malware\nDetails emerge on WinRAR zero-day attacks that infected PCs with malware\nHacker leaks 386 million user records from 18 companies for free\nMicrosoft: Russian hackers use ISP access to hack embassies in AiTM attacks\nRussian airline Aeroflot grounds dozens of flights after cyberattack"
    },
    {
        "Title": "Microsoft fixes Windows Server bug causing cluster, VM issues",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-windows-server-bug-causing-cluster-vm-issues/",
        "Summary": "Microsoft has resolved a known issue that triggers Cluster service and VM restart issues after installing July's Windows Server 2019 security updates. [...]",
        "Date": "2025-08-14",
        "Content": "Microsoft has resolved a known issue that triggers Cluster service and VM restart issues after installing July's Windows Server 2019 security updates.\nThe company\nacknowledged the bug\nin a private advisory seen by BleepingComputer three weeks ago and asked businesses to reach out for support to mitigate the cluster issues.\nAs Redmond explained at the time, the Cluster service (a system component essential to cluster operation) may fail to function correctly after installing the\nKB5062557 update\nreleased on July 8th, while some nodes might also fail when attempting to rejoin their cluster and triggering errors on systems with the BitLocker Windows security feature enabled on Cluster Shared Volumes (CSV) drives.\n\"After installing the July Windows security update [..], the Cluster Service on Windows Server 2019 might repeatedly stop and restart, causing nodes to fail to rejoin the cluster or enter quarantine states, virtual machines to experience multiple restarts, and frequent Event ID 7031 errors within event logs,\" Microsoft said.\n\"If you need help to manage this issue on your organization and apply a mitigation, please contact Microsoft's Support for business.\"\nMicrosoft has\nnow fixed this known issue\nin the\nAugust 2025 KB5063877 cumulative update\nfor Windows Server 2019, which also includes other significant improvements and bug fixes.\nTo install it on affected systems, admins must first deploy the KB5005112 servicing stack update and then install KB5063877 via Windows Update, the\nMicrosoft Update Catalog\n, or Windows Server Update Services (WSUS).\nOn Wednesday, Microsoft\nresolved a widespread WSUS issue\nthat prevented organizations from deploying the August 2025 KB5063878 cumulative update on Windows 11 24H2 devices.\nLast month, it also\naddressed another WSUS bug\nthat blocked organizations from deploying the latest Windows updates due to Microsoft Update sync problems.\nAdditionally, the July 2024 cumulative updates\nfixed an issue triggered by the June 2025 security updates\n, which caused the DHCP service to freeze on some Windows Server systems.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nMicrosoft: Windows Server KB5062557 causes cluster, VM issues\nMicrosoft asks users to ignore certificate enrollment errors\nMicrosoft fixes known issue that breaks Windows 11 updates\nMicrosoft confirms Family Safety blocks Google Chrome from launching\nMicrosoft: June Windows Server security updates cause DHCP issues"
    },
    {
        "Title": "Booking.com phishing campaign uses sneaky 'ん' character to trick you",
        "Link": "https://www.bleepingcomputer.com/news/security/bookingcom-phishing-campaign-uses-sneaky-character-to-trick-you/",
        "Summary": "Threat actors are leveraging a Unicode character to make phishing links appear like legitimate Booking.com links in a new campaign distributing malware. The attack makes use of the Japanese hiragana character, ん, which can, on some systems, appear as a forward slash and make a phishing URL appear realistic to a person at first. [...]",
        "Date": "2025-08-14",
        "Content": "Threat actors are leveraging a Unicode character to make phishing links appear like legitimate Booking.com links in a new campaign distributing malware.\nThe attack makes use of the Japanese hiragana character, ん, which can, on some systems, appear as a forward slash and make a phishing URL appear realistic to a person at a casual glance.\nBleepingComputer has further come across an Intuit phishing campaign using a lookalike domain using the letter L instead of 'i' in Intuit.\nBooking.com phishing links using Japanese homoglyphs\nThe attack, first spotted by security researcher\nJAMESWT\n, abuses the Japanese hiragana character “ん” (Unicode U+3093), which closely resembles the Latin letter sequence '/n' or '/~', at a quick glance in some fonts. This visual similarity enables scammers to create URLs that appear to belong to the genuine Booking.com domain, but direct users to a malicious site.\nBelow is a copy of the phishing email\nshared by\nthe security researcher:\nCopy of phishing email shared by security researcher JamesWT\nThe text in the email,\nhttps://admin.booking.com/hotel/hoteladmin/...\nitself is deceptive. While it may look like a Booking.com address, the hyperlink points to:\nhttps://account.booking.comんdetailんrestric-access.www-account-booking.com/en/\nPhishing page as it appears in a web browser\nWhen rendered in a web browser's address bar, the 'ん' characters can trick users into thinking they are navigating through a subdirectory of booking.com.\nIn reality, the actual registered domain is\nwww-account-booking[.]com\n, a malicious lookalike, and everything before that is just a deceptive subdomain string.\nVictims who click through are eventually redirected to:\nwww-account-booking[.]com/c.php?a=0\nThis in turn delivers a malicious MSI installer from a CDN link,\nhttps://updatessoftware.b-cdn[.]net/john/pr/04.08/IYTDTGTF.msi\nSamples of the malicious site are available on abuse.ch's\nMalwareBazaar\n, with any.run\nanalysis\nshowing the infection chain. The MSI file is used to drop further payloads, potentially including infostealers or remote access trojans.\nThis phishing tactic exploits homoglyphs. A homoglyph is a character that looks similar to another character but belongs to a different character set or alphabet. These visually similar characters can be exploited in phishing attacks or to create misleading content. For example, Cyrillic character \"О\" (U+041E) may appear identical to the Latin letter \"O\" (U+004F) to a human, but they are different characters.\nGiven their visual similarities, homoglyphs have been leveraged\ntime and time again\nby threat actors in\nhomograph attacks\nand phishing emails. Defenders and software developers have also, over the last few years,\nrolled out security measures\nthat make it easy for users to distinguish between distinct homoglyphs.\nThis isn't the first time threat actors have targeted Booking.com customers either.\nIn March this year, Microsoft warned of phishing campaigns\nimpersonating Booking.com and using ClickFix\nsocial engineering attacks to infect hospitality workers with malware.\nIn 2023, Akamai revealed how hackers were redirecting hotel guests to\nfake Booking.com sites\nto steal credit card information.\n'Lntuit' not Intuit\nBleepingComputer's\nSergiu Gatlan\nspotted a separate phishing campaign involving users being targeted with Intuit-themed emails.\nThese emails appear to come from and take you to\nintuit.com\naddresses, but instead use domains starting with\nLntuit—\nwhich, in lowercase, can resemble \"intuit\" in certain fonts. A simple yet effective technique.\nIntuit phishing email from 'Lntuit.com' viewed on Mailspring for macOS\n(Sergiu Gatlan)\nThe unusually narrow layout of this email in desktop clients suggests it was primarily designed for mobile viewing, with attackers banking on mobile users clicking the \"Verify my email\" phishing link without closely inspecting it.\nThe button takes users to:\nhttps://intfdsl[.]us/sa5h17/\nHow Intuit phishing email appears on mobile\n(Sergiu Gatlan)\nInterestingly, the illicit link, when accessed directly i.e. not from the target user's email account appears to redirect the user back to the legitimate Intuit.com login page at\nhttps://accounts.intuit.com/app/sign-in\n.\nThese incidents are a reminder that attackers will continue to find creative ways to abuse typography for social engineering.\nTo protect yourself, always hover over links before clicking to reveal the true target.\nUsers should always check the actual domain at the rightmost end of the address before the first single / — this is the real registered domain. Granted, the use of visually deceptive Unicode characters like 'ん' create additional hurdles, and demonstrates that visual URL inspection alone isn't foolproof.\nKeeping endpoint security software up to date adds another layer of defense against attacks since modern phishing kits often deliver malware directly, after a phishing link is clicked.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nNew downgrade attack can bypass FIDO auth in Microsoft Entra ID\nThe Rise of Native Phishing: Microsoft 365 Apps Abused in Attacks\nWinRAR zero-day exploited to plant malware on archive extraction\nHacker extradited to US for stealing $3.3 million from taxpayers\nMozilla warns of phishing attacks targeting add-on developers"
    },
    {
        "Title": "When Theft Replaces Encryption: Blue Report 2025 on Ransomware & Infostealers",
        "Link": "https://www.bleepingcomputer.com/news/security/when-theft-replaces-encryption-blue-report-2025-on-ransomware-and-infostealers/",
        "Summary": "Ransomware and infostealers are winning on stealth, not encryption. Picus Blue Report 2025 reveals just 3% of data exfiltration attempts are stopped. Find and fix your biggest exposure gaps before they're exploited. [...]",
        "Date": "2025-08-14",
        "Content": "Ransomware and infostealer threats are evolving faster than most organizations can adapt.\nWhile security teams have invested heavily in ransomware resilience, particularly through backup and recovery systems,\nPicus Security's\nBlue Report 2025\nshows that today's most damaging attacks aren't always about encryption.\nInstead, both ransomware operators and infostealer campaigns often focus on\ncredential theft, data exfiltration,\nand\nlateral movement\n, leveraging old-school stealth and persistence to achieve their objectives with minimal disruption.\nThe evolving adversary tactics are clearly visible when comparing the findings from the Blue Report 2025, based on over 160 million real-world attack simulations, and the\nRed Report 2025\n, which analyzes the latest trends in malware, threat actors, and exploitation techniques.\nThe overlap between the two reports reveals a clear and concerning signal:\ndefenders are falling behind on detecting the very tactics that adversaries now favor the most\n.\nWhat Is the Blue Report?\nThe Picus Blue Report\nis an annual research publication that analyzes how well organizations are preventing and detecting real-world cyber threats.\nUnlike traditional reports that focus solely on threat trends or survey data, the Blue Report is based on\nempirical findings from over 160 million attack simulations\nconducted across the globe, using the\nPicus Security Validation Platform\n.\nNow in its third year, the\nBlue Report\nprovides a data-driven look at the state of enterprise defenses across industries, regions, and attack surfaces.\nIt evaluates prevention and detection performance against industry-recognized\nMITRE ATT&CK tactics and techniques, ransomware strains, infostealer behaviors\n, and newly disclosed\nvulnerabilities\ndiscovered in 2024 and 2025.\nBy revealing where organizations' real-world security controls are working and where they're silently, or not-so-silently, failing, the Blue Report offers security teams a clear path to\nprioritize high-risk\nexposures, improve their resilience, and adopt a\nContinuous Threat Exposure Management (CTEM)\nstrategy backed by\nAdversarial Exposure Validation (AEV)\n.\nRed Flags Confirmed: What the Blue Report Validates from the Red Report\nThe\nRed Report 2025\nwarned of a surge in\ninfostealer malware\nand the widespread use of encryptionless\nransomware attacks\n. Attackers are no longer relying solely on noisy malware and adversary tactics. Instead, they are quietly stealing sensitive data and using it for blackmail, disruption, or espionage.\nCredential-harvesting malware, browser-targeted infostealers, and techniques like\nCredentials from Password Stores (T1555)\nwere seen in\n25% of this year's malware samples\n, highlighting a broader pivot toward data theft.\nThe\nBlue Report 2025\nhas now validated these concerns with real-world evidence. In millions and millions of simulated attacks, the findings show t\nhe techniques powering modern ransomware and infostealer campaigns are the very ones defenders fail to stop\n.\nThe data exfiltration prevention rate dropped to just 3%\n, its lowest level yet, despite the rise of infostealers and double-extortion tactics.\nPassword cracking succeeded in 46%\nof tested environments, nearly doubling since 2024.\nValid Accounts (T1078) had a 98% success rate\n, confirming how easily attackers exploit stolen or weak credentials to bypass controls.\nTogether, these gaps illustrate a dangerous truth:\nadversaries have shifted their methods, but organizations are failing to keep up\n.\nInfostealers Are Booming, Why Are Defenders Lagging Behind?\nInfostealers are no longer just opportunistic malware scraping browser passwords from unsuspecting users. They've evolved into\ntargeted, persistent tools used in more complex adversary campaigns\n, designed to stay quiet, remain undetected, and\nexfiltrate data over long dwell times\n.\nThese threats are particularly dangerous because they often succeed\nwithout triggering alarms\n. By using stolen credentials and impersonating legitimate access, they can bypass traditional security controls, blend into normal traffic, and\nleak sensitive data over days or weeks\n.\nThe\nBlue Report 2025\nreinforces just how unprepared most organizations are for this reality. Despite the increase in infostealer usage,\ndata exfiltration prevention remains critically low at 3%\n.\nMost organizations have stronger visibility into what comes in, like malware payloads and phishing attachments, but a much more limited ability to detect what goes out.\nWhy is this happening? The report showed that a lack of outbound monitoring, insufficient DLP enforcement, and limited behavioral analytics are the key contributors. Attackers are exploiting these gaps to harvest credentials and steal sensitive files, usually without detection.\nWhy Backup Isn't a Silver Bullet Against Ransomware\nBackup and recovery solutions are essential components of any ransomware response plan, but they are\nnot enough to prevent damage from today's ransomware campaigns\n.\nAs organizations have matured their backup strategies, ransomware groups have responded by changing the rules of the game.\nRather than encrypting data and demanding payment for decryption, they now rely on\nencryptionless extortion\n: stealing data, then threatening to leak it publicly. No encryption. No ransom key. Just leverage.\nThe\nBlue Report 2025\nreflects this evolution. Ransomware variants like\nBlackByte\n(26% prevention)\n,\nBabLock (34% prevention)\n, and\nMaori (41% prevention)\ncontinue to evade controls not because defenders lack recovery strategies, but because\nother tactics like credential abuse, lateral movement, and exfiltration just aren't being effectively blocked\n.\nEven if data is backed up and restored, in these instances,the impact is already done once it's leaked.\nThat's why the report emphasizes the need for\nprevention and detection upstream\nbefore data leaves the network, and before credentials are abused to impersonate internal users.\nGet Your Copy of Picus Blue Report: The State of Exposure Management\nLearn how password cracking nearly doubled, rising from 25% to 46%, revealing critical vulnerabilities. Additionally, prevention rates dropped from 69% to 62% as attacks became more sophisticated.\nFind out how to strengthen your security posture and explore the latest insights in threat exposure management with the Picus Blue Report.\nDownload Now\nUsing The Blue Report 2025 to Prioritize The Threats That Matter Most\nIn a world of competing priorities and limited resources,\nknowing what to fix first is everything\n. The\nBlue Report 2025\nhelps organizations cut through the staggering amount of noise by analyzing over\n160 million attack simulations\nto reveal the\nreal-world effectiveness of security controls\n, not in theory, but in practice.\nThe report provides a comprehensive view of exposure across\nindustries, regions, attack vectors, ransomware families,\nMITRE ATT&CK tactics and techniques\n, and recently discovered vulnerabilities\n.\nThis level of granularity allows organizations to see\nexactly where their defenses are underperforming\nand, more importantly, which\ngaps present them with the greatest operational risk\n.\nBy understanding how their specific business sector or geographic region compares to others, and which attack techniques are most often successful in their sector or region, security teams can\nprioritize strengthening their defenses based on context, not assumptions\n.\nWhether it's improving data exfiltration prevention, stopping credential abuse, or tuning detection rules, this year's new Blue Report offers a\nclear path forward rooted in real-world adversary behavior\n.\nThe report enables defenders to align with\nContinuous Threat Exposure Management (CTEM)\n, operationalize\nAdversarial Exposure Validation (AEV)\n, and act decisively on the exposures that matter most.\nReady to Find and Fix Your Most Exploitable Gaps?\nThe Blue Report 2025 shows how attacker tactics are evolving, and organizations' defenses are performing against them. Unfortunately, what we're seeing this year is that infostealers are thriving, ransomware is getting stealthier, and data exfiltration is too often going undetected.\nIf you're relying on assumptions, static controls, or outdated detection logic, you're not seeing anywhere near the full picture.\nWith\nAdversarial Exposure Validation\n, you can go beyond alerts and dashboards to validate what's actually putting your organization at risk.\nSee where your defenses are working and where they're quietly failing.\nDon’t forget to get your copy today.\nSponsored and written by\nPicus Security\n."
    },
    {
        "Title": "Canada’s House of Commons investigating data breach after cyberattack",
        "Link": "https://www.bleepingcomputer.com/news/security/canadas-house-of-commons-investigating-data-breach-after-cyberattack/",
        "Summary": "The House of Commons of Canada is currently investigating a data breach after a threat actor reportedly stole employee information in a cyberattack on Friday. [...]",
        "Date": "2025-08-14",
        "Content": "The House of Commons of Canada is currently investigating a data breach after a threat actor reportedly stole employee information in a cyberattack on Friday.\nWhile the lower house of the Parliament of Canada has yet to issue a public statement regarding this incident,\nCBC News reports\nthat House of Commons staff were notified of a breach on Monday via email.\nThe alert states that the attacker exploited a recent Microsoft vulnerability to gain access to a database containing sensitive information used to manage House of Commons computers and mobile devices. During the breach, the threat actor also stole some employee data that isn't publicly available, including their names, job titles, office locations, and email addresses.\nEmployees and House of Commons members were also urged to be aware of potential fraudulent attempts to use the information stolen during the attack, which could be used to target and impersonate parliamentarians or exploited in scams.\nThe Canadian Centre for Cyber Security (Cyber Centre), a part of the country's Communications Security Establishment (CSE), told BleepingComputer that it's supporting the House of Commons' ongoing investigation but didn't link the attack to a particular threat group.\n\"However, we can tell you that we are aware of the incident and working with the House of Commons to provide support,\" said the Cyber Centre.\n\"Attribution of a cyber incident is difficult. Investigating cyber threat activity takes resources and time, and there are many considerations involved in the process of attributing malicious cyber activity to specific threat actors, and/or nation-states.\"\nA House of Commons spokesperson didn't reply to a request for comment when BleepingComputer reached out earlier today.\nRecently patched Microsoft vulnerabilities\nWhile the House of Commons and CSE didn't disclose the specific Microsoft vulnerability exploited in the breach, Canada's Cyber Centre recently warned IT professionals across Canada to secure their systems against two Microsoft security bugs: a\nMicrosoft SharePoint Server flaw\n(tracked as CVE-2025-53770 and dubbed ToolShell) and a\nMicrosoft Exchange vulnerability\n(CVE-2025-53786).\nThe former has been under active and widespread exploitation by various threat groups in zero-day attacks since early July, including\nChinese state-backed hacking groups\nand\nransomware gangs\n.\nAttackers have used CVE-2025-53770 exploits to breach\nnumerous high-profile targets,\nincluding the U.S. National Nuclear Security Administration, the Department of Education, Florida's Department of Revenue, the Rhode Island General Assembly, and government networks in Europe and the Middle East.\nThe CVE-2025-53786 high-severity Microsoft Exchange flaw, which can allow attackers to move laterally in Microsoft cloud environments, is\nthe subject of an emergency directive\nissued by the U.S. Cybersecurity and Infrastructure Security Agency (CISA) last Thursday.\nThe cybersecurity ordered all non-military agencies within the U.S. executive branch to mitigate this vulnerability over the weekend, and it also warned that failure to secure their systems in time could lead \"to a hybrid cloud and on-premises total domain compromise.\"\nOn Monday, security threat monitoring platform Shadowserver also reported that over 29,000 Exchange servers exposed online\nremain unpatched against CVE-2025-53786\n, with more than 800 IP addresses identified in Canada.\nUpdate August 14, 11:54 EDT: Added Canadian Cyber Centre statement.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nConnex Credit Union data breach impacts 172,000 members\nCisco discloses data breach impacting Cisco.com user accounts\nPandora confirms data breach amid ongoing Salesforce data theft attacks\nLouis Vuitton says regional data breaches tied to same cyberattack\nCo-op confirms data of 6.5 million members stolen in cyberattack"
    },
    {
        "Title": "Leak: OpenAI's browser will use ChatGPT Agent to control the browser",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/leak-openais-browser-will-use-chatgpt-agent-to-control-the-browser/",
        "Summary": "OpenAI is building an agentic future with its upcoming Chromium-based browser and a new leak confirms GPT Agent integration. [...]",
        "Date": "2025-08-14",
        "Content": "OpenAI is building an agentic future with its upcoming Chromium-based browser and a new leak confirms GPT Agent integration.\nChatGPT already comes with Agent mode, which uses a virtual machine to browse the web. The vrtual machine is powered by Linux and it works in a cloud environment (Azure).\nWhile Agent mode can do everything for you, it cannot control your browser. It also cannot see open tabs or other browser-related features. But this could change soon.\nAs\nspotted\nby Tibor, OpenAI wiring Agent mode to choose between two execution paths: a remote “cloud/virtual browser” and a first-party local browser (the rumored OpenAI browser).\nThe hidden “Use cloud browser” toggle plus a user-agent gate that matches “ChatGPT…Macintosh;…Chrome” strongly suggests the feature is enabled only when you’re on OpenAI’s own Mac app/browser, with the fallback being the cloud browser.\nThat lines up with OpenAI’s docs describing a virtual/visual browser for agents today, and separate reporting that an OpenAI Chromium-based browser is coming.\nOpenAI’s\nhelp page\nsays Agent uses screenshots of a virtual browser window to click, fill forms, and navigate, i.e., a cloud browser.\nReuters and others\nreported\nOpenAI is prepping its own Chromium-based browser, keeping more interactions inside a ChatGPT-style UI.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nOpenAI relaxes GPT-5 rate limit, promises to improve the personality\nOpenAI adds new GPT-5 models, restores o3, o4-mini and it's a mess all over again\nOpenAI is testing 3,000-per-week limit for GPT-5 Thinking\nHow to restore GPT-4o when you've GPT-5\nOpenAI to fix GPT-5 issues, double rate limits for paid users after outrage"
    },
    {
        "Title": "CISA warns of N-able N-central flaws exploited in zero-day attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/cisa-warns-of-n-able-n-central-flaws-exploited-in-zero-day-attacks/",
        "Summary": "​CISA warned on Wednesday that attackers are actively exploiting two security vulnerabilities in N‑able's N-central remote monitoring and management (RMM) platform. [...]",
        "Date": "2025-08-14",
        "Content": "​CISA warned on Wednesday that attackers are actively exploiting two security vulnerabilities in N‑able's N-central remote monitoring and management (RMM) platform.\nN-central is commonly used by managed services providers (MSPs) and IT departments to monitor, manage, and maintain client networks and devices from a centralized web-based console.\nAccording to CISA, the two flaws can allow authenticated attackers to gain command execution via an insecure deserialization weakness (\nCVE-2025-8875\n) and inject commands by exploiting an improper sanitization of user input vulnerability (\nCVE-2025-8876\n).\nN-able confirms CISA's report that the security bugs are now being exploited in the wild and has patched them in N-central 2025.3.1. It also urged admins to secure their systems before further information on the bugs is released.\n\"Our security investigations have shown evidence of this type of exploitation in a limited number of on-premises environments. We have not seen any evidence of exploitations within N-able hosted cloud environments,\" N-able told BleepingComputer today.\n\"You must upgrade your on-premises N-central to 2025.3.1. (Details of the CVEs will be published three weeks after the release as per our security practices.),\"\nN-able added in a Wednesday advisory\n.\nWhile the U.S. cybersecurity agency has not yet shared details regarding the attacks exploiting these N-central security bugs, it stated that there's no evidence that they're being used in ransomware attacks.\nAccording to\nShodan\nsearches\n, approximately 2,000 N-able N-central instances are exposed online (some of which are likely already patched), with the majority originating from the United States, Australia, and Germany.\nN-able N-central devices exposed online (Shodan)\n​CISA has also\nadded the flaws\nto its\nKnown Exploited Vulnerabilities Catalog\n, giving Federal Civilian Executive Branch (FCEB) agencies just one week to patch their systems by August 20, as mandated by the November 2021 Binding Operational Directive (BOD) 22-01.\nEven though BOD 22-01 primarily targets U.S. federal agencies, CISA encouraged all organizations, including those in the private sector, to prioritize securing their devices against this actively exploited security flaw as soon as possible.\n\"Apply mitigations per vendor instructions, follow applicable BOD 22-01 guidance for cloud services, or discontinue use of the product if mitigations are unavailable,\" CISA cautioned on Monday.\n\"These types of vulnerabilities are frequent attack vectors for malicious cyber actors and pose significant risks to the federal enterprise.\"\nLast week, CISA\nissued an emergency directive\nordering non-military agencies within the U.S. executive branch to mitigate a critical Microsoft Exchange hybrid vulnerability (CVE-2025-53786) by 9:00 AM ET on Monday morning.\nUpdate August 14, 10:18 EDT: Added N-able statement.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nCritical SonicWall SSLVPN bug exploited in ransomware attacks\nCISA flags PaperCut RCE bug as exploited in attacks, patch now\nCISA warns of hackers exploiting SysAid vulnerabilities in attacks\nCISA tags Citrix Bleed 2 as exploited, gives agencies a day to patch\nCISA: AMI MegaRAC bug enabling server hijacks exploited in attacks"
    },
    {
        "Title": "Microsoft fixes Windows 11 24H2 updates failing with 0x80240069 error",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-windows-11-24h2-updates-failing-with-0x80240069-error/",
        "Summary": "Microsoft has resolved a known issue preventing the August 2025 Windows 11 24H2 cumulative update from being delivered via Windows Server Update Services (WSUS). [...]",
        "Date": "2025-08-14",
        "Content": "Microsoft has resolved a known issue preventing the August 2025 Windows 11 24H2 cumulative update from being delivered via Windows Server Update Services (WSUS).\nIntroduced almost twenty years ago, WSUS helps IT administrators defer, approve, and schedule updates for Microsoft products on enterprise networks from a single local update server, rather than having each endpoint update from Redmond's servers.\nMicrosoft confirmed the known issue yesterday evening, one day after\nwidespread reports from Windows administrators\nregarding 0x80240069 errors when installing the Windows 11 24H2 KB5063878 update.\nThose affected also reported finding new entries in the Windows Event Log, which included \"Service wuauserv has unexpectedly stopped\" and \"The Windows Update service terminated unexpectedly\" messages.\n\"The August 12, 2025 Windows security update for Windows 11, version 24H2 (KB5063878), might fail to install with error code 0x80240069 when installed via Windows Server Update Services (WSUS),\"\nthe company said\nin a Wednesday Windows release health update.\n\"Home users are unlikely to experience this issue, as WSUS is designed for use across business and enterprise environments.\"\nFix pushed via Known Issue Rollback\nWhile a fix for this update issue is not yet being shipped to all customers through Windows Update, Microsoft has started rolling one out automatically through Known Issue Rollback (KIR) to all enterprise-managed devices.\nTo address the bug, Windows administrators must install\nthe Known Issue Rollback Group Policy\non impacted enterprise-managed devices running Windows 11 24H2.\nTo deploy this policy, admins must use the Group Policy Editor to select the Windows version they want to target in the Local Computer Policy or the Domain Policy on the domain controller, and then restart the affected devices to apply the group policy setting.\nYou can find additional guidance on deploying and configuring KIR Group Policies on\nMicrosoft's documentation website\n.\nAs a workaround for those who prefer to wait for the fix to be included in a future Windows update, Microsoft said that affected customers can also manually install the KB5063878 cumulative update via Windows Update or the\nMicrosoft Update Catalog\n.\nThis isn't the first time admins have experienced problems delivering a Windows 11 update via WSUS in recent months.\nIn April, Microsoft confirmed an identical issue after enterprise customers reported being\nplagued by the same Windows Update Service errors\nwhen trying to update Windows 11 22H2/23H2 systems.\nThe company\naddressed the issue in May\nby rolling out a fix through Known Issue Rollback (KIR) to all enterprise-managed devices.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nWindows 11 24H2 updates failing again with 0x80240069 errors\nMicrosoft fixes known issue that breaks Windows 11 updates\nWindows 11 KB5063878 & KB5063875 cumulative updates released\nMicrosoft asks users to ignore certificate enrollment errors\nMicrosoft fixes ‘Print to PDF’ feature broken by Windows update"
    },
    {
        "Title": "Google Gemini's Deep Research is finally coming to API",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/google-geminis-deep-research-is-finally-coming-to-api/",
        "Summary": "Google Gemini's one of the most powerful features is Deep Research, but up until now, it has been strictly limited to the Gemini interface. This could change soon. [...]",
        "Date": "2025-08-14",
        "Content": "Google Gemini's one of the most powerful features is Deep Research, but up until now, it has been strictly limited to the Gemini interface. This could change soon.\nWith Deep Research in Gemini, you can search about pretty much anything, including scholars, existing research papers, and more.\nGoogle describes Deep Research as an agentic Research Assistant that can browse up to hundreds of websites on your behalf, think through its findings, and create insightful multi-page reports in minutes.\n\"With the Gemini 2.5 model, Deep Research is even better at all stages of research, from planning to delivering even more insightful and detailed reports,\" Google\nnoted\nin a document.\nRight now, Gemini 2.5 Pro's Deep Research does not work outside gemini.google.com, but Google's Logan Kilpatrick has\nconfirmed\nthat Deep Research is coming to API.\nThere can be hundreds of use cases of Deep Research in API. For example, you can integrate it into your IDE, and then use Deep Research to prepare a report for your next vibe-coded project\nDeep Research is not just about writing long papers, but also about transforming a prompt into a personalised multi-point research plan.\nLast but not least, Deep Research autonomously searches and deeply browses the web to find relevant, up-to-date information.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nGoogle rolls out text-to-image model Imagen 4 for free\nGoogle Calendar invites let researchers hijack Gemini to leak user data\nFlaw in Gemini CLI AI coding assistant allowed stealthy code execution\nGoogle Gemini flaw hijacks email summaries for phishing\nGoogle releases Gemini CLI with free Gemini 2.5 Pro"
    },
    {
        "Title": "Downgrade Attack Allows Phishing Kits to Bypass FIDO",
        "Link": "https://www.darkreading.com/cybersecurity-operations/downgrade-attack-phishing-kits-bypass-fido",
        "Summary": "You probably can't break FIDO authentication. Still, researchers have shown that there are ways to get around it.",
        "Date": "2025-08-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/downgrade-attack-phishing-kits-bypass-fido"
    },
    {
        "Title": "State and Local Leaders Lobby Congress for Cybersecurity Resources",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/state-local-leaders-lobby-congress-cybersecurity-resources",
        "Summary": "Federal funding cuts to the Multi-State Information Sharing and Analysis Center (MS-ISAC) are about to leave more than 18,000 state and local organizations without access to basic cybersecurity resources they need to protect US national security, a letter sent to Congressional appropriators warns.",
        "Date": "2025-08-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/state-local-leaders-lobby-congress-cybersecurity-resources"
    },
    {
        "Title": "Police &amp; Government Email Access for Sale on Dark Web",
        "Link": "https://www.darkreading.com/threat-intelligence/government-email-sale-dark-web",
        "Summary": "Cybercriminals are auctioning off live email credentials, giving other criminals access to sensitive systems, confidential intelligence, and, potentially, a higher success rate than ever.",
        "Date": "2025-08-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/government-email-sale-dark-web"
    },
    {
        "Title": "CISA Warns N-able Bugs Under Attack, Patch Now",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/n-able-bugs-under-attack",
        "Summary": "Two critical N-able vulnerabilities enable local code execution and command injection; they require authentication to exploit, suggesting they wouldn't be seen at the beginning of an exploit chain.",
        "Date": "2025-08-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/n-able-bugs-under-attack"
    },
    {
        "Title": "Cybersecurity Spending Slows &amp; Security Teams Shrink",
        "Link": "https://www.darkreading.com/cybersecurity-operations/cybersecurity-spending-slows-teams-shrink",
        "Summary": "Security budgets are lowest in healthcare, professional and business services, retail, and hospitality, but budget growth remained above 5% in financial services, insurance, and tech.",
        "Date": "2025-08-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/cybersecurity-spending-slows-teams-shrink"
    },
    {
        "Title": "Navigating the Cybersecurity Budget Tug-of-War",
        "Link": "https://www.darkreading.com/cybersecurity-operations/navigating-cybersecurity-budget-tug-of-war",
        "Summary": "Companies ready to move beyond reactive defense and toward full-spectrum protection need to invest in strategies that rally around resiliency, unified cybersecurity, and data protection.",
        "Date": "2025-08-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/navigating-cybersecurity-budget-tug-of-war"
    },
    {
        "Title": "North Korea Attacks South Koreans With Ransomware",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/north-korea-attacks-south-koreans-ransomware",
        "Summary": "DPRK hackers are throwing every kind of malware at the wall and seeing what sticks, deploying stealers, backdoors, and ransomware all at once.",
        "Date": "2025-08-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/north-korea-attacks-south-koreans-ransomware"
    },
    {
        "Title": "Vulnerabilities in Xerox Print Orchestration Product Allow Remote Code Execution",
        "Link": "https://www.securityweek.com/vulnerabilities-in-xerox-print-orchestration-product-allow-remote-code-execution/",
        "Summary": "<p>Path traversal and XXE injection flaws allowing unauthenticated remote code execution have been patched in Xerox FreeFlow Core. </p>\n<p>The post <a href=\"https://www.securityweek.com/vulnerabilities-in-xerox-print-orchestration-product-allow-remote-code-execution/\">Vulnerabilities in Xerox Print Orchestration Product Allow Remote Code Execution</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/vulnerabilities-in-xerox-print-orchestration-product-allow-remote-code-execution/"
    },
    {
        "Title": "CISA Warns of Attacks Exploiting N-able Vulnerabilities",
        "Link": "https://www.securityweek.com/cisa-warns-of-attacks-exploiting-n-able-vulnerabilities/",
        "Summary": "<p>CISA reported becoming aware of attacks exploiting CVE-2025-8875 and CVE-2025-8876 in N-able N-central on the day they were patched.</p>\n<p>The post <a href=\"https://www.securityweek.com/cisa-warns-of-attacks-exploiting-n-able-vulnerabilities/\">CISA Warns of Attacks Exploiting N-able Vulnerabilities</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cisa-warns-of-attacks-exploiting-n-able-vulnerabilities/"
    },
    {
        "Title": "‘MadeYouReset’ HTTP2 Vulnerability Enables Massive DDoS Attacks",
        "Link": "https://www.securityweek.com/madeyoureset-http2-vulnerability-enables-massive-ddos-attacks/",
        "Summary": "<p>The new DDoS attack vector, which involves HTTP/2 implementation flaws, has been compared to Rapid Reset.</p>\n<p>The post <a href=\"https://www.securityweek.com/madeyoureset-http2-vulnerability-enables-massive-ddos-attacks/\">&#8216;MadeYouReset&#8217; HTTP2 Vulnerability Enables Massive DDoS Attacks</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/madeyoureset-http2-vulnerability-enables-massive-ddos-attacks/"
    },
    {
        "Title": "Passkey Login Bypassed via WebAuthn Process Manipulation",
        "Link": "https://www.securityweek.com/passkey-login-bypassed-via-webauthn-process-manipulation/",
        "Summary": "<p>Researchers at enterprise browser security firm SquareX showed how an attacker can impersonate a user and bypass passkey security. </p>\n<p>The post <a href=\"https://www.securityweek.com/passkey-login-bypassed-via-webauthn-process-manipulation/\">Passkey Login Bypassed via WebAuthn Process Manipulation</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/passkey-login-bypassed-via-webauthn-process-manipulation/"
    },
    {
        "Title": "Akira Ransomware Group Allegedly Breaches US Law Firm Rusin Law",
        "Link": "https://dailydarkweb.net/akira-ransomware-group-allegedly-breaches-us-law-firm-rusin-law/",
        "Summary": "The Akira ransomware group has claimed responsibility for an alleged cyberattack against 🇺🇸 Rusin Law, a premier civil litigation defense firm based in the United States. The firm is known for its specialization in workers&#8217; compensation cases, civil litigation, insurance defense, and employment law, making it a repository for highly sensitive legal and personal information. [&#8230;]",
        "Date": "2025-08-14",
        "Content": "The Akira ransomware group has claimed responsibility for an alleged cyberattack against 🇺🇸 Rusin Law, a premier civil litigation defense firm based in the United States. The firm is known for its specialization in workers’ compensation cases, civil litigation, insurance defense, and employment law, making it a repository for highly sensitive legal and personal information. The claim was posted on the threat actor’s data leak site on August 14, 2025.\nAccording to the ransomware group’s post, they are threatening to release over 134GB of data exfiltrated from the law firm’s network. The attackers boast of possessing critical corporate and client documents, the public disclosure of which could have severe implications for the firm, its employees, and its clients, potentially compromising ongoing legal cases and exposing confidential information.\nThe threat actors listed several types of data they allegedly stole, including:\nFinancial data (audits, payment details, financial reports, invoices)\nEmployee and customer information (birth certificates, medical information)\nPolice protocols\nCourt hearings\nOther confidential legal documents\nTags:\nAkira\nCyberSecurity\ndata-leak\nlaw firm\nransomware\nRusin Law\nUS"
    },
    {
        "Title": "Sinobi Ransomware Group Allegedly Breaches ECM Consultants, TELACU College, One Way Solutions, J. Derenzo Co., and Comprehensive Pain Centers",
        "Link": "https://dailydarkweb.net/sinobi-ransomware-group-allegedly-breaches-ecm-consultants-telacu-college-one-way-solutions-j-derenzo-co-and-comprehensive-pain-centers/",
        "Summary": "The Sinobi ransomware group has allegedly targeted a string of companies across the United States, adding five new victims to its dark web leak site on August 13, 2025. The cybercriminal gang claims to have breached and encrypted the systems of organizations in diverse sectors, including healthcare, IT, construction, and community development. The attackers are [&#8230;]",
        "Date": "2025-08-14",
        "Content": "The Sinobi ransomware group has allegedly targeted a string of companies across the United States, adding five new victims to its dark web leak site on August 13, 2025. The cybercriminal gang claims to have breached and encrypted the systems of organizations in diverse sectors, including healthcare, IT, construction, and community development. The attackers are threatening to publish sensitive information if their ransom demands are not met, with countdown timers already active for some of the victims.\nThe list of victims represents a significant breach of entities that handle critical infrastructure, healthcare information, and community services. For two of the victims, ECM Consultants and TELACU College, the threat actors have specifically stated their intention to release a “Full data leak,” signaling a severe potential data security incident. All victims are currently listed under the “Encrypted” category, indicating that their files are being held hostage by the ransomware group.\nThe alleged victims include:\n🇺🇸\nECM Consultants:\nA national engineering, architectural, and construction management firm based in Louisiana.\n🇺🇸\nTELACU College:\nA major community development organization focused on construction, real estate, financial services, and educational programs.\n🇺🇸\nOne Way Solutions:\nA Texas-based IT firm that provides specialized computer support for dental and healthcare practices.\n🇺🇸\nJ. Derenzo Co.:\nA premier site work contractor in New England with over 75 years of experience in complex excavation and construction projects.\n🇺🇸\nComprehensive Pain Centers:\nA wellness-based healthcare provider offering local and subscription-based medical services.\nTags:\nComprehensive Pain Centers\ncyberattack\nCyberSecurity\ndata-breach\nECM Consultants\nJ Derenzo\nOne Way Solutions\nransomware\nSinobi\nTELACU College\nUnited States"
    },
    {
        "Title": "Qilin Ransomware Allegedly Breaches The Paul Wilkinson Law Firm and Flavor & Fragrance Specialties",
        "Link": "https://dailydarkweb.net/qilin-ransomware-allegedly-breaches-the-paul-wilkinson-law-firm-and-flavor-fragrance-specialties/",
        "Summary": "The Qilin ransomware group has allegedly targeted multiple US-based organizations, adding them to its dark web leak site. The group claims to have exfiltrated a significant volume of sensitive data from a law firm and a specialty flavor manufacturer, publishing proof of the breaches. The attacks, posted on August 13, 2025, threaten to expose confidential [&#8230;]",
        "Date": "2025-08-14",
        "Content": "The Qilin ransomware group has allegedly targeted multiple US-based organizations, adding them to its dark web leak site. The group claims to have exfiltrated a significant volume of sensitive data from a law firm and a specialty flavor manufacturer, publishing proof of the breaches. The attacks, posted on August 13, 2025, threaten to expose confidential business and client information if the companies do not comply with the attackers’ demands.\nAmong the victims listed is The Paul Wilkinson Law Firm, which appears to have suffered a massive data breach. The threat actors claim to have stolen 1.8 TB of data, encompassing over 1.5 million files. Another victim, Flavor & Fragrance Specialties, also had its internal documents exposed. The leaks underscore the significant operational and reputational risks organizations face from sophisticated ransomware attacks that target sensitive legal, financial, and client data.\nThe victims of the alleged Qilin ransomware attack include:\nThe Paul Wilkinson Law Firm\n🇺🇸: A personal injury law firm based in Denver, USA, that specializes in representing victims of car, truck, and motor vehicle accidents. The allegedly exfiltrated data includes:\nDetailed descriptions of all cases handled by the firm\nClient personal data\nAccident reports and case details\nFlavor & Fragrance Specialties (FFS[.]com)\n🇺🇸: A US-based Lucta brand that creates flavorings for coffee and other beverages. The allegedly exfiltrated data includes:\nFinancial reports detailing cost items, salaries, taxes, and net profit.\nA completed Paycheck Protection Program (SBA) application form containing company legal details, financial indicators, and employee data.\nA corporate bank statement showing transactions, payment purposes, and counterparties.\nInternal financial reports with monthly and annual figures, budgets, and historical data.\nTags:\ncyberattack\ndata-breach\nFlavor & Fragrance Specialties\nLucta\nQilin\nransomware\nThe Paul Wilkinson Law Firm\nUSA"
    },
    {
        "Title": "Dubai Pharmacy College for Girls Allegedly Hit by Data Breach",
        "Link": "https://dailydarkweb.net/dubai-pharmacy-college-for-girls-allegedly-hit-by-data-breach/",
        "Summary": "A threat actor has allegedly leaked data from the Dubai Pharmacy College for Girls (dpc.edu) on a dark web forum. The post, made in August 2025, claims a &#8220;major breach&#8221; has occurred, exposing multiple databases belonging to the prominent educational institution. The Dubai Pharmacy College for Girls is a well-known higher education institution in the [&#8230;]",
        "Date": "2025-08-14",
        "Content": "A threat actor has allegedly leaked data from the Dubai Pharmacy College for Girls (dpc.edu) on a dark web forum. The post, made in August 2025, claims a “major breach” has occurred, exposing multiple databases belonging to the prominent educational institution. The Dubai Pharmacy College for Girls is a well-known higher education institution in the United Arab Emirates, specializing in pharmaceutical sciences.\nThe threat actor alleges that the leaked data contains sensitive information, including user credentials and internal records. A sample of the data shared on the forum suggests the exposure of personally identifiable information. If the claims are substantiated, this incident could pose significant privacy and security risks to the college’s students, faculty, and staff. The exposed information could potentially be exploited for phishing attacks, identity theft, and other malicious activities.\nBased on the sample provided by the threat actor, the allegedly leaked data includes:\nEmails\nNames\nUsernames\nPasswords\nTags:\nCyberSecurity\ndata-breach\nDubai\nEducation\nUAE"
    },
    {
        "Title": "Pincong Website Allegedly Breached – User Data for Sale Online",
        "Link": "https://dailydarkweb.net/pincong-website-allegedly-breached-user-data-for-sale-online/",
        "Summary": "A threat actor has allegedly leaked a significant amount of internal user data from the Pincong website and put it up for sale on a dark web forum. Pincong is a popular Chinese-language online community based in Hong Kong, known for hosting discussions on political topics that are often critical of the Chinese government. Due [&#8230;]",
        "Date": "2025-08-14",
        "Content": "A threat actor has allegedly leaked a significant amount of internal user data from the Pincong website and put it up for sale on a dark web forum. Pincong is a popular Chinese-language online community based in Hong Kong, known for hosting discussions on political topics that are often critical of the Chinese government. Due to the politically sensitive nature of the content, users rely heavily on the platform’s anonymity to protect their identities, making this alleged breach particularly severe.\nThe data is being offered for a price of $3,000. The seller claims to possess “many many lots of files” containing internal user information from the site. To prove their claim, the threat actor shared a sample showing a list of user credentials. The potential exposure of user identities could pose a significant risk to individuals who have participated in discussions on the platform, potentially subjecting them to state scrutiny or retaliation.\nBased on the evidence provided by the threat actor, the compromised information allegedly includes sensitive user credentials. The specific data types exposed in the breach appear to be:\nUsernames\nEmail Addresses\nPasswords\nTags:\nCyberSecurity\ndark web\ndata-breach\ndata-leak\nhong kong\nPII\nPincong"
    },
    {
        "Title": "Bouygues Allegedly Hit by Data Breach Affecting 6 Million Customers",
        "Link": "https://dailydarkweb.net/bouygues-allegedly-hit-by-data-breach-affecting-6-million-customers/",
        "Summary": "A threat actor has allegedly put a database belonging to the French industrial group Bouygues up for sale on a dark web forum. The post claims that the database contains the information of 6 million customers. The actor is offering to provide a sample of the data to prove the authenticity of their claims, signaling [&#8230;]",
        "Date": "2025-08-14",
        "Content": "A threat actor has allegedly put a database belonging to the French industrial group Bouygues up for sale on a dark web forum. The post claims that the database contains the information of 6 million customers. The actor is offering to provide a sample of the data to prove the authenticity of their claims, signaling a potentially significant data security incident for the French conglomerate.\nBouygues S.A. is a major industrial group headquartered in Paris, France. While it has diverse operations in construction, real estate development, and media, it is perhaps most widely known for its telecommunications subsidiary, Bouygues Telecom, which is one of the largest mobile network operators in France. A breach of this scale, if confirmed, could expose the sensitive personal information of millions of telecom and other service customers, leading to risks of fraud, phishing attacks, and identity theft.\nThe full scope and contents of the allegedly leaked database have not been specified by the threat actor in their initial post. At this time, the claim remains unverified, and Bouygues has not released an official statement regarding the potential breach. The cybersecurity community will be closely monitoring the situation for further details or confirmation from the company.\nTags:\nBouygues\nCyberSecurity\ndark web\ndata-breach\nFrance\nTelecom"
    },
    {
        "Title": "Borghese Contemporary Hotel Allegedly Breached – 7,600 Guest Passports and IDs for Sale",
        "Link": "https://dailydarkweb.net/borghese-contemporary-hotel-allegedly-breached-7600-guest-passports-and-ids-for-sale/",
        "Summary": "A threat actor is allegedly selling a highly sensitive database containing approximately 7,600 scanned identity documents belonging to guests of the Borghese Contemporary Hotel in Rome, Italy. The hotel is part of the prestigious Contemporary Collection group, known for hosting international travelers. The data was advertised on a dark web forum, with the seller claiming [&#8230;]",
        "Date": "2025-08-14",
        "Content": "A threat actor is allegedly selling a highly sensitive database containing approximately 7,600 scanned identity documents belonging to guests of the Borghese Contemporary Hotel in Rome, Italy. The hotel is part of the prestigious Contemporary Collection group, known for hosting international travelers. The data was advertised on a dark web forum, with the seller claiming the information was exfiltrated from the hotel’s guest management system following an unauthorized access event in early August 2025.\nThe seller is asking for $2,000 for the entire dataset, which they claim contains high-resolution and fully legible images of guest documents. According to the post, the data was collected as part of the hotel’s standard Know Your Customer (KYC) check-in process. The availability of such clear and personal documents poses a severe risk of identity fraud and synthetic identity creation for the affected guests, who come from various countries. The files are reportedly sorted by the guests’ country of origin and delivered in JPG format.\nThe compromised data allegedly includes:\nScanned passports from international guests\nNational ID cards (DNI)\nHigh-resolution images collected during hotel check-in\nTags:\nBorghese Contemporary Hotel\ncyberattack\ndata-breach\nhospitality\nItaly\nPII"
    },
    {
        "Title": "Nike USA Allegedly Compromised – Initial Network Access Offered for $5,000",
        "Link": "https://dailydarkweb.net/nike-usa-allegedly-compromised-initial-network-access-offered-for-5000/",
        "Summary": "A threat actor has allegedly put initial network access to Nike, the American multinational corporation, up for sale on a popular dark web forum. The seller claims to offer shell access with the highest level privileges, specifically &#8220;Root/Administrator,&#8221; to the sportswear giant&#8217;s systems. The asking price is listed as $5,000 USD, with the seller noting [&#8230;]",
        "Date": "2025-08-14",
        "Content": "A threat actor has allegedly put initial network access to Nike, the American multinational corporation, up for sale on a popular dark web forum. The seller claims to offer shell access with the highest level privileges, specifically “Root/Administrator,” to the sportswear giant’s systems. The asking price is listed as $5,000 USD, with the seller noting the price is negotiable and accepting payments in Monero (XMR) and Bitcoin (BTC).\nNike is a world-renowned designer and manufacturer of footwear, apparel, equipment, and accessories, with a reported revenue of $46 billion, making it a high-value target for cybercriminals. The post advertising the access specifies the geography as North America and mentions the access was obtained via a “Shell/Exploit.” As a form of proof, the threat actor included a screenshot that appears to show a scan result of a server running a potentially vulnerable version of OpenSSH, suggesting a possible entry point into the company’s network.\nThe sale of initial access is a critical component of the cybercrime ecosystem, often utilized by ransomware gangs and other malicious actors to gain a foothold within a target organization. Such access can be leveraged to escalate privileges, move laterally across the network, exfiltrate sensitive corporate data, and ultimately deploy ransomware. This alleged incident highlights the persistent and evolving threats that major global corporations face from Initial Access Brokers (IABs) operating on the dark web.\nTags:\ncyber-attack\nCyberSecurity\ndark web\ndata-breach\nexploit\nIAB\nInitial Access Broker\nNike\nshell\nUSA"
    }
]