[
    {
        "Title": "New PS1Bot Malware Campaign Uses Malvertising to Deploy Multi-Stage In-Memory Attacks",
        "Link": "https://thehackernews.com/2025/08/new-ps1bot-malware-campaign-uses.html",
        "Summary": "Cybersecurity researchers have discovered a new malvertising campaign that's designed to infect victims with a multi-stage malware framework called PS1Bot.\n\"PS1Bot features a modular design, with several modules delivered used to perform a variety of malicious activities on infected systems, including information theft, keylogging, reconnaissance, and the establishment of persistent system",
        "Date": "2025-08-13",
        "Content": "Cybersecurity researchers have discovered a new malvertising campaign that's designed to infect victims with a multi-stage malware framework called\nPS1Bot\n.\n\"PS1Bot features a modular design, with several modules delivered used to perform a variety of malicious activities on infected systems, including information theft, keylogging, reconnaissance, and the establishment of persistent system access,\" Cisco Talos researchers Edmund Brumaghin and Jordyn Dunk\nsaid\n.\n\"PS1Bot has been designed with stealth in mind, minimizing persistent artifacts left on infected systems and incorporating in-memory execution techniques to facilitate execution of follow-on modules without requiring them to be written to disk.\"\nCampaigns distributing the PowerShell and C# malware have been found to be active since early 2025, leveraging malvertising as a propagation vector, with the infection chains executing modules in-memory to minimize forensic trail. PS1Bot is assessed to share technical overlaps with AHK Bot, an AutoHotkey-based malware previously put to use by threat actors\nAsylum Ambuscade\nand\nTA866\n.\nFurthermore, the activity cluster has been identified as overlapping with previous ransomware-related campaigns utilizing a malware named\nSkitnet\n(aka Bossnet) with an aim to steal data and establish remote control over compromised hosts.\nThe starting point of the attack is a compressed archive that's delivered to victims via malvertising or search engine optimization (SEO) poisoning. Present within the ZIP file is a JavaScript payload that serves as a downloader to retrieve a scriptlet from an external server, which then writes a PowerShell script to a file on disk and executes it.\nThe PowerShell script is responsible for contacting a command-and-control (C2) server and fetching next-stage PowerShell commands that allow the operators to augment the malware's functionality in a modular fashion and carry out a wide range of actions on the compromised host -\nAntivirus detection, which obtains and reports the list of antivirus programs present on the infected system\nScreen capture, which captures screenshots on infected systems and transmits the resulting images to the C2 server\nWallet grabber, which steals data from web browsers (and wallet extensions), application data for cryptocurrency wallet applications, and files containing passwords, sensitive strings, or wallet seed phrases\nKeylogger, which logs keystrokes and gathers clipboard content\nInformation collection, which harvests and transmits information about the infected system and environment to the attacker\nPersistence, which creates a PowerShell script such that it's automatically launched when the system restarts, incorporating the same logic used to establish the C2 polling process to fetch the modules\n\"The information stealer module implementation leverages wordlists embedded into the stealer to enumerate files containing passwords and seed phrases that can be used to access cryptocurrency wallets, which the stealer also attempts to exfiltrate from infected systems,\" Talos noted.\n\"The modular nature of the implementation of this malware provides flexibility and enables the rapid deployment of updates or new functionality as needed.\"\nThe disclosure comes as Google said it's leveraging artificial intelligence (AI) systems powered by large language models (LLMs) to fight invalid traffic (\nIVT\n) and more precisely identify ad placements generating invalid behaviors.\n\"Our new applications provide faster and stronger protections by analyzing app and web content, ad placements and user interactions,\" Google\nsaid\n. \"For example, they've significantly improved our content review capabilities, leading to a 40% reduction in IVT stemming from deceptive or disruptive ad serving practices.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Zoom and Xerox Release Critical Security Updates Fixing Privilege Escalation and RCE Flaws",
        "Link": "https://thehackernews.com/2025/08/zoom-and-xerox-release-critical.html",
        "Summary": "Zoom and Xerox have addressed critical security flaws in Zoom Clients for Windows and FreeFlow Core that could allow privilege escalation and remote code execution.&nbsp;\nThe vulnerability impacting Zoom Clients for Windows, tracked as CVE-2025-49457 (CVSS score: 9.6), relates to a case of an untrusted search path that could pave the way for privilege escalation.\n\"Untrusted search path in",
        "Date": "2025-08-13",
        "Content": "Zoom and Xerox have addressed critical security flaws in Zoom Clients for Windows and FreeFlow Core that could allow privilege escalation and remote code execution.\nThe vulnerability impacting Zoom Clients for Windows, tracked as\nCVE-2025-49457\n(CVSS score: 9.6), relates to a case of an untrusted search path that could pave the way for privilege escalation.\n\"Untrusted search path in certain Zoom Clients for Windows may allow an unauthenticated user to conduct an escalation of privilege via network access,\" Zoom\nsaid\nin a security bulletin on Tuesday.\nThe issue, reported by its own Offensive Security team, affects the following products -\nZoom Workplace for Windows before version 6.3.10\nZoom Workplace VDI for Windows before version 6.3.10 (except 6.1.16 and 6.2.12)\nZoom Rooms for Windows before version 6.3.10\nZoom Rooms Controller for Windows before version 6.3.10\nZoom Meeting SDK for Windows before version 6.3.10\nThe disclosure comes as multiple vulnerabilities have been\ndisclosed\nin Xerox FreeFlow Core, the most severe of which could result in remote code execution. The issues, which have been addressed in version 8.0.4, include -\nCVE-2025-8355\n(CVSS score: 7.5) - XML External Entity (XXE) injection vulnerability leading to server-side request forgery (SSRF)\nCVE-2025-8356\n(CVSS score: 9.8) - Path traversal vulnerability leading to remote code execution\n\"These vulnerabilities are rudimentary to exploit and if exploited, could allow an attacker to execute arbitrary commands on the affected system, steal sensitive data, or attempt to move laterally into a given corporate environment to further their attack,\" Horizon3.ai said.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Fortinet Warns About FortiSIEM Vulnerability (CVE-2025-25256) With In-the-Wild Exploit Code",
        "Link": "https://thehackernews.com/2025/08/fortinet-warns-about-fortisiem.html",
        "Summary": "Fortinet is alerting customers of a critical security flaw in FortiSIEM for which it said there exists an exploit in the wild.\nThe vulnerability, tracked as CVE-2025-25256, carries a CVSS score of 9.8 out of a maximum of 10.0.\n\"An improper neutralization of special elements used in an OS command ('OS Command Injection') vulnerability [CWE-78] in FortiSIEM may allow an unauthenticated attacker to",
        "Date": "2025-08-13",
        "Content": "Fortinet is alerting customers of a critical security flaw in FortiSIEM for which it said there exists an exploit in the wild.\nThe vulnerability, tracked as\nCVE-2025-25256\n, carries a CVSS score of 9.8 out of a maximum of 10.0.\n\"An improper neutralization of special elements used in an OS command ('OS Command Injection') vulnerability [CWE-78] in FortiSIEM may allow an unauthenticated attacker to execute unauthorized code or commands via crafted CLI requests,\" the company\nsaid\nin a Tuesday advisory.\nThe following versions are impacted by the flaw -\nFortiSIEM 6.1, 6.2, 6.3, 6.4, 6.5, 6.6 (Migrate to a fixed release)\nFortiSIEM 6.7.0 through 6.7.9 (Upgrade to 6.7.10 or above)\nFortiSIEM 7.0.0 through 7.0.3 (Upgrade to 7.0.4 or above)\nFortiSIEM 7.1.0 through 7.1.7 (Upgrade to 7.1.8 or above)\nFortiSIEM 7.2.0 through 7.2.5 (Upgrade to 7.2.6 or above)\nFortiSIEM 7.3.0 through 7.3.1 (Upgrade to 7.3.2 or above)\nFortiSIEM 7.4 (Not affected)\nFortinet acknowledged in its advisory that a \"practical exploit code for this vulnerability was found in the wild,\" but did not share any additional specifics about the nature of the exploit and where it was found. It also noted that the exploitation code does not appear to produce distinctive indicators of compromise (IoCs).\nAs workarounds, the network security company is recommending that organizations limit access to the phMonitor port (7900).\nThe disclosure comes a day after GreyNoise\nwarned\nof a \"significant spike\" in brute-force traffic aimed at Fortinet SSL VPN devices, with dozens of IP addresses from the United States, Canada, Russia, and the Netherlands probing devices located across the world.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "AI SOC 101: Key Capabilities Security Leaders Need to Know",
        "Link": "https://thehackernews.com/2025/08/ai-soc-101-key-capabilities-security.html",
        "Summary": "Security operations have never been a 9-to-5 job. For SOC analysts, the day often starts and ends deep in a queue of alerts, chasing down what turns out to be false positives, or switching between half a dozen tools to piece together context. The work is repetitive, time-consuming, and high-stakes, leaving SOCs under constant pressure to keep up, yet often struggling to stay ahead of emerging",
        "Date": "2025-08-13",
        "Content": "Security operations have never been a 9-to-5 job. For SOC analysts, the day often starts and ends deep in a queue of alerts, chasing down what turns out to be false positives, or switching between half a dozen tools to piece together context. The work is repetitive, time-consuming, and high-stakes, leaving SOCs under constant pressure to keep up, yet often struggling to stay ahead of emerging threats. That combination of inefficiency, elevated risk, and a reactive operating model is exactly where AI-powered SOC capabilities are starting to make a difference.\nWhy AI SOC is gaining traction now\nThe recent Gartner Hype Cycle for Security Operations 2025 (download\na complimentary copy\n) recognizes\nAI SOC Agents\nas an innovation trigger, reflecting a broader shift in how teams approach automation. Instead of relying solely on static playbooks or manual investigation workflows, AI SOC capabilities bring reasoning, adaptability, and context-aware decision-making into the mix.\nSOC teams report that their most pressing challenges are inefficient investigations, siloed tools, and a lack of effective automation. These issues slow response and increase risk. The latest\nSANS SOC Survey\nunderscores this, showing these operational hurdles consistently outpace other concerns. AI-driven triage, investigation, and detection coverage analysis are well-positioned to address these gaps head-on.\nAI's biggest wins in the SOC\nAn AI SOC brings together a\nrange of capabilities\nthat strengthen and scale the core functions of a security operations center. These capabilities work alongside human expertise to improve how teams triage alerts, investigate threats, respond to incidents, and refine detections over time.\nTriage at speed and scale\nAI systems can review and prioritize every incoming alert within minutes, pulling telemetry from across the environment. True threats rise to the top quickly, while false positives are resolved without draining analyst time.\nFaster, deeper investigations and response\nBy correlating data from SIEM, EDR, identity, email, and cloud platforms, AI SOC tools reduce mean time to investigate (MTTI) and mean time to respond (MTTR). This shortens dwell time and limits the opportunity for threats to spread.\nDetection engineering insights\nAI can pinpoint coverage gaps against frameworks such as MITRE ATT&CK, identify rules that need tuning, and recommend adjustments based on real investigation data. This gives detection engineers a clear view of where changes will make the most impact.\nEnabling more threat hunting\nWith less time spent working alert queues, analysts can shift to proactive threat hunting. AI SOC platforms with natural language query support make it easier to explore data, run complex hunts, and surface hidden threats.\nSeparating hype from reality\nThe AI SOC market is filled with sweeping claims about fully\nautonomous SOC\nand instant results. While AI can automate large portions of tier 1 and tier 2 investigations and even support tier 3 work, it is not a replacement for experienced analysts. Complex, high impact cases still require human judgment, contextual understanding, and decision making.\nThe real value lies in shifting the balance of work. By removing repetitive triage and speeding investigations, AI frees analysts to focus on higher impact activities like advanced threat hunting, tuning detections, and investigating sophisticated threats. This is the work that improves both security outcomes and analyst retention.\nGuiding principles for evaluating AI SOC capabilities\nWhen assessing AI SOC solutions, focus on principles that determine whether they can deliver sustainable improvements to security operations:\nTransparency and explainability\n– The system should provide clear, detailed reasoning for its findings, allowing analysts to trace conclusions back to the underlying data and logic. This builds trust and enables informed decision making.\nData privacy and security\n– Understand exactly where data is processed and stored, how it is protected in transit and at rest, and whether the deployment model meets your compliance requirements.\nIntegration depth\n– The solution should integrate seamlessly with your existing SOC stack and workflows. This includes preserving the familiar user experience of tools like SIEM, EDR, and case management systems to avoid introducing friction.\nAdaptability and learning\n– AI should improve over time by incorporating analyst feedback, adapting to changes in your environment, and staying effective against evolving threats.\nAccuracy and trust\n– Evaluate not just the volume of work automated, but the precision and reliability of results. A tool that closes false positives at scale but misses real threats creates more risk than it solves.\nTime to value\n– Favor solutions that deliver measurable gains in investigation speed, accuracy, or coverage within weeks rather than months, without heavy customization or lengthy deployments.\nThe human and AI hybrid SOC\nThe most effective SOCs combine the speed and scale of AI with the contextual understanding and judgment of human analysts. This model gives people the capacity to focus on the work that matters most.\nHow Prophet Security aligns with this vision\nProphet Security\nhelps organizations move beyond manual investigations and alert fatigue with an agentic AI SOC platform that automates triage, accelerates investigations, and ensures every alert gets the attention it deserves. By integrating across the existing stack, Prophet AI improves analyst efficiency, reduces incident dwell time, and delivers more consistent security outcomes. Security leaders use Prophet AI to maximize the value of their people and tools, strengthen their security posture, and turn daily SOC operations into measurable business results. Visit\nProphet Security\nto request a demo and see how Prophet AI can elevate your SOC operations.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Webinar: What the Next Wave of AI Cyberattacks Will Look Like — And How to Survive",
        "Link": "https://thehackernews.com/2025/08/webinar-what-next-wave-of-ai.html",
        "Summary": "The AI revolution isn’t coming. It’s already here. From copilots that write our emails to autonomous agents that can take action without us lifting a finger, AI is transforming how we work.\nBut here’s the uncomfortable truth: Attackers are evolving just as fast.\nEvery leap forward in AI gives bad actors new tools — deepfake scams so real they trick your CFO, bots that can bypass human review,",
        "Date": "2025-08-13",
        "Content": "The AI revolution isn't coming. It's already here. From copilots that write our emails to autonomous agents that can take action without us lifting a finger, AI is transforming how we work.\nBut here's the uncomfortable truth: Attackers are evolving just as fast.\nEvery leap forward in AI gives bad actors new tools — deepfake scams so real they trick your CFO, bots that can bypass human review, and synthetic identities that slip quietly into your systems. The fight is no longer at your network's edge. It's at your login screen.\nAnd that's why identity has become the\nlast line of defense\n.\nWhy This Matters Now\nLegacy security can't keep up. Traditional models were built for slower threats and predictable patterns. AI doesn't play by those rules.\nToday's attackers:\nScale at machine speed.\nUse deepfakes to impersonate trusted people.\nExploit APIs through autonomous agents.\nCreate fake \"non-human\" identities that look perfectly legitimate.\nThe only security control that can adapt and scale as fast as AI?\nIdentity\n. If you can't verify\nwho\n— or\nwhat\n— is accessing your systems, you've already lost.\nThe Webinar That Connects the Dots\nIn\nAI's New Attack Surface: Why Identity Is the Last Line of Defense\n, Okta's Karl Henrik Smith will show you:\nWhere AI is creating hidden vulnerabilities\n— and how to find them before attackers do.\nHow \"synthetic identities\" work\n(and why they're scarier than you think).\nThe blueprint for an \"identity security fabric\"\nthat protects humans\nand\nnon-human actors.\nHow to build secure-by-design AI apps\nwithout slowing innovation.\nWhether you're a developer, security architect, or tech leader, you'll leave with a clear, practical plan for staying ahead of AI-powered threats.\nWatch this Webinar Now\nThe next wave of cyberattacks won't be about\nif\nsomeone can get past your defenses — it'll be about\nhow fast\nthey can.\nPut identity where it belongs: at the center of your security strategy.\nReserve your spot now\n→\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft August 2025 Patch Tuesday Fixes Kerberos Zero-Day Among 111 Total New Flaws",
        "Link": "https://thehackernews.com/2025/08/microsoft-august-2025-patch-tuesday.html",
        "Summary": "Microsoft on Tuesday rolled out fixes for a massive set of 111 security flaws across its software portfolio, including one flaw that has been disclosed as publicly known at the time of the release.\nOf the 111 vulnerabilities, 16 are rated Critical, 92 are rated Important, two are rated Moderate, and one is rated Low in severity. Forty-four of the vulnerabilities relate to privilege",
        "Date": "2025-08-13",
        "Content": "Microsoft on Tuesday rolled out fixes for a\nmassive set of 111 security flaws\nacross its software portfolio, including one flaw that has been disclosed as publicly known at the time of the release.\nOf the 111 vulnerabilities, 16 are rated Critical, 92 are rated Important, two are rated Moderate, and one is rated Low in severity. Forty-four of the vulnerabilities relate to privilege escalation, followed by remote code execution (35), information disclosure (18), spoofing (8), and denial-of-service (4) defects.\nThis is in addition to\n16 vulnerabilities\naddressed in Microsoft's Chromium-based Edge browser since the release of\nlast month's Patch Tuesday update\n, including two spoofing bugs affecting Edge for Android.\nIncluded among the vulnerabilities is a privilege escalation vulnerability impacting Microsoft Exchange Server hybrid deployments (\nCVE-2025-53786\n, CVSS score: 8.0) that Microsoft disclosed last week.\nThe publicly disclosed zero-day is\nCVE-2025-53779\n(CVSS score: 7.2), another privilege escalation flaw in Windows Kerberos that stems from a case of relative path traversal. Akamai researcher Yuval Gordon has been credited with discovering and reporting the bug.\nIt's worth mentioning here that the issue was publicly detailed back in May 2025 by the web infrastructure and security company, giving it the codename\nBadSuccessor\n. The novel technique essentially\nallows\na threat actor with sufficient privileges to compromise an Active Directory (AD) domain by misusing delegated Managed Service Account (dMSA) objects.\n\"The good news here is that successful exploitation of CVE-2025-53779 requires an attacker to have pre-existing control of two attributes of the hopefully well protected dMSA:\nmsds-groupMSAMembership\n, which determines which users may use credentials for the managed service account, and\nmsds-ManagedAccountPrecededByLink\n, which contains a list of users on whose behalf the dMSA can act,\" Adam Barnett, lead software engineer at Rapid7, told The Hacker News.\n\"However, abuse of CVE-2025-53779 is certainly plausible as the final link of a multi-exploit chain which stretches from no access to total pwnage.\"\nAction1's Mike Walters noted that the path traversal flaw can be abused by an attacker to create improper delegation relationships, enabling them to impersonate privileged accounts, escalate to a domain administrator, and potentially gain full control of the Active Directory domain.\n\"An attacker who already has a compromised privileged account can use it to move from limited administrative rights to full domain control,\" Walters\nadded\n. \"It can also be paired with methods such as Kerberoasting or Silver Ticket attacks to maintain persistence.\"\n\"With domain administrator privileges, attackers can disable security monitoring, modify Group Policy, and tamper with audit logs to hide their activity. In multi-forest environments or organizations with partner connections, this flaw could even be leveraged to move from one compromised domain to others in a supply chain attack.\"\nSatnam Narang, senior staff research engineer at Tenable, said the immediate impact of BadSuccessor is limited, as only 0.7% of Active Directory domains had met the prerequisite at the time of disclosure. \"To exploit BadSuccessor, an attacker must have at least one domain controller in a domain running Windows Server 2025 in order to achieve domain compromise,\" Narang pointed out.\nSome of notable Critical-rated vulnerabilities patched by Redmond this month are below -\nCVE-2025-53767\n(CVSS score: 10.0) - Azure OpenAI Elevation of Privilege Vulnerability\nCVE-2025-53766\n(CVSS score: 9.8) - GDI+ Remote Code Execution Vulnerability\nCVE-2025-50165\n(CVSS score: 9.8) - Windows Graphics Component Remote Code Execution Vulnerability\nCVE-2025-53792\n(CVSS score: 9.1) - Azure Portal Elevation of Privilege Vulnerability\nCVE-2025-53787\n(CVSS score: 8.2) - Microsoft 365 Copilot BizChat Information Disclosure Vulnerability\nCVE-2025-50177\n(CVSS score: 8.1) - Microsoft Message Queuing (MSMQ) Remote Code Execution Vulnerability\nCVE-2025-50176\n(CVSS score: 7.8) - DirectX Graphics Kernel Remote Code Execution Vulnerability\nMicrosoft noted that the three cloud service CVEs impacting Azure OpenAI, Azure Portal, and Microsoft 365 Copilot BizChat have already been remediated, and that they require no customer action.\nCheck Point, which disclosed\nCVE-2025-53766\nalongside\nCVE-2025-30388\n, said the vulnerabilities allow attackers to execute arbitrary code on the affected system, leading to a full system compromise.\n\"The attack vector involves interacting with a specially crafted file. When a user opens or processes this file, the vulnerability is triggered, allowing the attacker to take control,\" the cybersecurity company\nsaid\n.\nThe Israeli firm revealed that it also uncovered a vulnerability in a Rust-based component of the Windows kernel that can result in a system crash that, in turn, triggers a hard reboot.\n\"For organizations with large or remote workforces, the risk is significant: attackers could exploit this flaw to simultaneously crash numerous computers across an enterprise, resulting in widespread disruption and costly downtime,\" Check Point said. \"This discovery highlights that even with advanced security technologies like Rust, continuous vigilance and proactive patching are essential to maintaining system integrity in a complex software environment.\"\nAnother vulnerability of importance is\nCVE-2025-50154\n(CVSS score: 6.5), an NTLM hash disclosure spoofing vulnerability that's actually a bypass for a similar bug (\nCVE-2025-24054\n, CVSS score: 6.5) that was plugged by Microsoft in March 2025.\n\"The original vulnerability demonstrated how specially crafted requests could trigger NTLM authentication and expose sensitive credentials,\" Cymulate researcher Ruben Enkaoua\nsaid\n. \"This new vulnerability [...] allows an attacker to extract NTLM hashes without any user interaction, even on fully patched systems. By exploiting a subtle gap left in the mitigation, an attacker can trigger NTLM authentication requests automatically, enabling offline cracking or relay attacks to gain unauthorized access.\"\nSoftware Patches from Other Vendors\nIn addition to Microsoft, security updates have also been released by other vendors over the past several weeks to rectify several vulnerabilities, including —\n7-Zip\nAdobe\nAmazon Web Services\nAMD\nAMI\nApple\nArm\nASUS\nAtlassian\nAutodesk\nAxis Communications\nBosch\nBroadcom\n(including VMware)\nCheck Point\nCisco\nCODESYS\nD-Link\nDell\nDrupal\nElastic\nEmerson\nF5\nFortinet\nFortra\nFoxit Software\nFUJIFILM\nFujitsu\nGigabyte\nGitLab\nGoogle\nAndroid\nand\nPixel\nGoogle Chrome\nGoogle Cloud\nGoogle Wear OS\nHMS Networks\nHP\nHP Enterprise\n(including Aruba Networking)\nHuawei\nIBM\nIntel\nIvanti\nJuniper Networks\nLenovo\nLinux distributions\nAlmaLinux\n, Alpine Linux,\nAmazon Linux\n,\nArch Linux\n,\nDebian\n,\nGentoo\n,\nOracle Linux\n,\nMageia\n,\nRed Hat\n,\nRocky Linux\n,\nSUSE\n, and\nUbuntu\nMediaTek\nMitel\nMitsubishi Electric\nMoxa\nMozilla\nFirefox, Firefox ESR, and Thunderbird\nNVIDIA\nPalo Alto Networks\nQualcomm\nRockwell Automation\nSalesforce\nSamsung\nSAP\nSchneider Electric\nServiceNow\nSiemens\nSolarWinds\nSonicWall\nSophos\nSplunk\nSpring Framework\nSupermicro\nSynology\nTP-Link\nTrend Micro\nWinRAR\nXerox\nZimbra\nZoom\n, and\nZyxel\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Charon Ransomware Hits Middle East Sectors Using APT-Level Evasion Tactics",
        "Link": "https://thehackernews.com/2025/08/charon-ransomware-hits-middle-east.html",
        "Summary": "Cybersecurity researchers have discovered a new campaign that employs a previously undocumented ransomware family called Charon to target the Middle East's public sector and aviation industry.\nThe threat actor behind the activity, according to Trend Micro, exhibited tactics mirroring those of advanced persistent threat (APT) groups, such as DLL side-loading, process injection, and the ability",
        "Date": "2025-08-13",
        "Content": "Cybersecurity researchers have discovered a new campaign that employs a previously undocumented ransomware family called Charon to target the Middle East's public sector and aviation industry.\nThe threat actor behind the activity, according to Trend Micro, exhibited tactics mirroring those of advanced persistent threat (APT) groups, such as DLL side-loading, process injection, and the ability to evade endpoint detection and response (EDR) software.\nThe DLL side-loading techniques resemble those previously documented as part of attacks orchestrated by a China-linked hacking group called\nEarth Baxia\n, which was flagged by the cybersecurity company as targeting government entities in Taiwan and the Asia-Pacific region to deliver a backdoor known as EAGLEDOOR following the exploitation of a now-patched security flaw affecting OSGeo GeoServer GeoTools.\n\"The attack chain leveraged a legitimate browser-related file, Edge.exe (originally named cookie_exporter.exe), to sideload a malicious msedge.dll (SWORDLDR), which subsequently deployed the Charon ransomware payload,\" researchers Jacob Santos, Ted Lee, Ahmed Kamal, and Don Ovid Ladore\nsaid\n.\nLike other ransomware binaries, Charon is capable of disruptive actions that terminate security-related services and running processes, as well as delete shadow copies and backups, thereby minimizing the chances of recovery. It also employs\nmultithreading\nand partial encryption techniques to make the file-locking routine faster and more efficient.\nAnother notable aspect of the ransomware is the use of a driver compiled from the open-source\nDark-Kill project\nto disable EDR solutions by means of what's called a bring your own vulnerable driver (BYOVD) attack. However, this functionality is never triggered during the execution, suggesting that the feature is likely under development.\nThere is evidence to suggest that the campaign was targeted rather than opportunistic. This stems from the use of a customized ransom note that specifically calls out the victim organization by name, a tactic not observed in traditional ransomware attacks. It's currently not known how the initial access was obtained.\nDespite the technical overlaps with Earth Baxia, Trend Micro has emphasized that this could mean one of three things -\nDirect involvement of Earth Baxia\nA false flag operation designed to deliberately imitate Earth Baxia's tradecraft, or\nA new threat actor that has independently developed similar tactics\n\"Without corroborating evidence such as shared infrastructure or consistent targeting patterns, we assess this attack demonstrates limited but notable technical convergence with known Earth Baxia operations,\" Trend Micro pointed out.\nRegardless of the attribution, the findings exemplify the ongoing trend of ransomware operators increasingly adopting sophisticated methods for malware deployment and defense evasion, further blurring the lines between cybercrime and nation-state activity.\n\"This convergence of APT tactics with ransomware operations poses an elevated risk to organizations, combining sophisticated evasion techniques with the immediate business impact of ransomware encryption,\" the researchers concluded.\nThe disclosure comes as eSentire detailed an\nInterlock ransomware\ncampaign that leveraged ClickFix lures to drop a PHP-based backdoor that, in turn, deploys NodeSnake (aka Interlock RAT) for credential theft and a C-based implant that supports attacker-supplied commands for further reconnaissance and ransomware deployment.\n\"Interlock Group employs a complex multi-stage process involving PowerShell scripts, PHP/NodeJS/C backdoors, highlighting the importance of monitoring suspicious process activity, LOLBins, and other TTPs,\" the Canadian company\nsaid\n.\nThe findings show that ransomware continues to be an\nevolving threat\n, even as victims continue to pay ransoms to quickly recover access to systems. Cybercriminals, on the other hand, have begun resorting to physical threats and DDoS attacks as a way of putting pressure on victims.\nStatistics shared by Barracuda\nshow\nthat 57% of organizations experienced a successful ransomware attack in the last 12 months, of which 71% that had experienced an email breach were also hit with ransomware. What's more, 32% paid a ransom, but only 41% of the victims got all their data back.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "OpenAI relaxes GPT-5 rate limit, promises to improve the personality",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-relaxes-gpt-5-rate-limit-promises-to-improve-the-personality/",
        "Summary": "OpenAI is slowly addressing all concerns around GPT-5, including rate limits and now its personality, which has been criticized for being less affirmative. [...]",
        "Date": "2025-08-13",
        "Content": "OpenAI is slowly addressing all concerns around GPT-5, including rate limits and now its personality, which has been criticized for being less affirmative.\nIn a\nsupport document\n, OpenAI confirmed it has restored the older models for paid customers, so you can now use GPT4o, GPT o3, and more.\nYou just need to use the model selector and choose one of the models under legacy models.\nIn addition, GPT-5 automatically switches between Fast and Thinking, and you can also choose additional GPT-5 options directly from the top of the model picker. For example, we now have GPT-5 Fast, which offers instant answers.\nModel selector\nSource: BleepingComputer\nThen, there's Thinking, which offers deeper reasoning. GPT-5 Thinking mini offers faster reasoning, and there's also Pro, which OpenAI says is research-grade intelligence.\nGPT-5 Thinking limit has been increased to 3,000 per week for GPT Plus subscribers, but that's not all.\nIn a\npost\non X, OpenAI CEO Sam Altman confirmed it's working on an update to GPT-5's personality.\nOnce the update is rolled out, GPT-5 will feel warmer than the current version, but don't expect it to be as 'affirmative' as GPT-4o.\nOpenAI is also exploring per-user customization of model personality.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nOpenAI is testing 3,000-per-week limit for GPT-5 Thinking\nOpenAI to fix GPT-5 issues, double rate limits for paid users after outrage\nOpenAI prepares new open weight models along with GPT-5\nOpenAI prepares GPT-5 for roll out\nChatGPT's GPT-5-reasoning-alpha model spotted ahead of launch"
    },
    {
        "Title": "Fortinet warns of FortiSIEM pre-auth RCE flaw with exploit in the wild",
        "Link": "https://www.bleepingcomputer.com/news/security/fortinet-warns-of-fortisiem-pre-auth-rce-flaw-with-exploit-in-the-wild/",
        "Summary": "Fortinet is warning about a remote unauthenticated command injection flaw in FortiSIEM that has in-the-wild exploit code, making it critical for admins to apply the latest security updates. [...]",
        "Date": "2025-08-13",
        "Content": "Fortinet is warning about a remote unauthenticated command injection flaw in FortiSIEM that has in-the-wild exploit code, making it critical for admins to apply the latest security updates.\nFortiSIEM is a central security monitoring and analytics system used for logging, network telemetry, and security incident alerts, serving as an integral part of security operation centers, where it's an essential tool in the hands of IT ops teams and analysts.\nThe product is generally used by governments, large enterprises, financial institutions, healthcare providers, and managed security service providers (MSSPs).\nThe flaw, tracked as CVE-2025-25256 and rated critical (CVSS: 9.8), impacts multiple branches of SIEM, from 5.4 up to 7.3.\n\"An improper neutralization of special elements used in an OS command ('OS Command Injection') vulnerability [CWE-78] in FortiSIEM may allow an unauthenticated attacker to execute unauthorized code or commands via crafted CLI requests,\"\ndescribes Fortinet\n.\nWhile Fortinet does not outright state that the flaw was exploited as a zero-day, they did confirm that functional exploit code exists for the flaw.\n\"Practical exploit code for this vulnerability was found in the wild,\" noted the vendor.\nFortinet says exploitation of this flaw does not produce distinctive IOCs to determine if a device has been compromised.\nThis disclosure comes a day after GreyNoise warned of a\nmassive spike in brute-force attacks targeting Fortinet SSL VPNs\nearlier this month, followed by a switch to FortiManager. The network threat intelligence company warned that spikes of malicious traffic often precede the disclosure of a new vulnerability.\nIt is unclear if Fortinet's disclosure of  CVE-2025-25256 is related to GreyNoise's report.\nGiven the availability of an exploit proof of concept (PoC), organizations must apply the latest security updates for CVE-2025-25256 as soon as possible by upgrading to one of the following FortiSIEM versions:\nFortiSIEM 7.3.2\nFortiSIEM 7.2.6\nFortiSIEM 7.1.8\nFortiSIEM 7.0.4\nFortiSIEM 6.7.10\nFortiSIEM versions 5.4 to 6.6 are also vulnerable in all versions, but they are no longer supported and will not receive a patch for the flaw. Administrators managing older FortiSIEM versions are advised to migrate to a newer, actively supported release.\nFortinet also included a workaround of limiting access to the phMonitor on port 7900, indicating that this is the entry point for malicious exploitation.\nIt's important to note that such workarounds reduce exposure and buy time until an upgrade can be performed. However, they do not fix the underlying vulnerability.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nExploit available for critical Cisco ISE bug exploited in attacks\nAdobe issues emergency fixes for AEM Forms zero-days after PoCs released\nCisco: Maximum-severity ISE RCE flaws now exploited in attacks\nMax severity Cisco ISE bug allows pre-auth command execution, patch now\nHackers are exploiting critical RCE flaw in Wing FTP Server"
    },
    {
        "Title": "Windows 11 24H2 updates failing again with 0x80240069 errors",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-24h2-updates-failing-again-with-0x80240069-errors/",
        "Summary": "The KB5063878 Windows 11 24H2 cumulative update, released earlier this week, fails to install on some systems according to widespread reports from Windows administrators. [...]",
        "Date": "2025-08-13",
        "Content": "The KB5063878 Windows 11 24H2 cumulative update, released earlier this week, fails to install on some systems according to widespread reports from Windows administrators.\nAs many admins\nhave\nreported\non\nsocial media\nand\nBleepingComputer\n, this issue affects Windows Server Update Services (WSUS) users, who are experiencing 0x80240069 errors when installing the August 2025 security updates.\nOn impacted devices, users will also see \"Service wuauserv has unexpectedly stopped\" and \"The Windows Update service terminated unexpectedly\" messages in the event log.\n\"I'm in WSUS environment, the update is approved but all of the existing 24H2 client failed to install, with error code - Download Error - 0x80240069. Tried to decline in WSUS and approve again still no luck,\" someone\nsaid\n.\n\"Same here. I've got 100 failures via SCCM with that error code. 2 successful, which likely didn't get it from SCCM,\" another one replied.\nSince this issue appears to affect only systems receiving updates through WSUS, home users are unlikely to experience these update problems, since this network service is typically used only in enterprise environments.\nA Microsoft spokesperson was unable to provide a statement immediately when contacted by BleepingComputer earlier today.\nWhile Microsoft has yet to confirm these update problems and an official fix is not yet available, some admins have shared a\ntemporary workaround\nrequiring those impacted to import the update into WSUS manually using the following IDs:\nWSUS Sync: Update-ID 8018eab0-7242-4932-adf2-afda36f6b3f6\r\n\r\nUpdate Catalog Import: Update-ID 92061378-be93-4659-a72a-037225e6bb0f\nThis isn't the first Windows update that can't be delivered via WSUS in recent months. Microsoft confirmed an identical issue in April, when enterprise customers were also\nplagued by Windows Update Service errors with 0x80240069 codes\nwhen trying to update Windows 11 22H2/23H2 systems.\nThe company\naddressed the issue in May\nby rolling out a fix through Known Issue Rollback (KIR) to all enterprise-managed devices.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nWindows 11 KB5063878 & KB5063875 cumulative updates released\nMicrosoft fixes known issue that breaks Windows 11 updates\nMicrosoft asks users to ignore certificate enrollment errors\nMicrosoft fixes bug behind incorrect Windows Firewall errors\nMicrosoft asks users to ignore Windows Firewall config errors"
    },
    {
        "Title": "New downgrade attack can bypass FIDO auth in Microsoft Entra ID",
        "Link": "https://www.bleepingcomputer.com/news/security/new-downgrade-attack-can-bypass-fido-auth-in-microsoft-entra-id/",
        "Summary": "Security researchers have created a new FIDO downgrade attack against Microsoft Entra ID that tricks users into authenticating with weaker login methods, making them susceptible to phishing and session hijacking. [...]",
        "Date": "2025-08-13",
        "Content": "Security researchers have created a new FIDO downgrade attack against Microsoft Entra ID that tricks users into authenticating with weaker login methods, making them susceptible to phishing and session hijacking.\nThese weaker login channels are vulnerable to adversary-in-the-middle phishing attacks that employ tools like Evilginx, enabling attackers to snatch valid session cookies and hijack the accounts.\nAlthough the attack doesn't prove a vulnerability in FIDO itself, it shows that the system can be bypassed, which is a crucial weakness.\nThis is especially worrying considering the increased adoption of FIDO-based authentication in critical environments, a consequence of the technology being touted as extremely phishing-resistant.\nFIDO passkeys are a passwordless authentication method based on the FIDO2 and WebAuthn standards, designed to eliminate the weaknesses of passwords and traditional multi-factor authentication (MFA).\nWhen a user registers a passkey, their device generates a pair of keys (private + public), which are used for solving a random, unique challenge during login onto online services, verifying the user's identity.\nAs only the user's device holds the correct private key, which isn't transmitted anywhere during the login process, there's nothing phishing actors can intercept.\nDowngrading and bypassing FIDO\nThe new downgrade attack created by\nProofpoint researchers\nemploys a custom phishlet within the Evilginx adversary-in-the-middle (AiTM) framework to spoof a browser user agent that lacks FIDO support.\nSpecifically, the researchers spoof Safari on Windows, which is\nnot compatible\nwith FIDO-based authentication in Microsoft Entra ID.\n\"This seemingly insignificant gap in functionality can be leveraged by attackers,\" explains Proofpoint researcher Yaniv Miron.\n\"A threat actor can adjust the AiTM to spoof an unsupported user agent, which is not recognized by a FIDO implementation. Subsequently, the user would be forced to authenticate through a less secure method. This behavior, observed on Microsoft platforms, is a missing security measure.\"\nWhen the target clicks a phishing link delivered via email, SMS, or an OAuth consent prompt, they are directed to a phishing site running the custom phishlet. As this is an AiTM attack, the legitimate Microsoft Entra ID form is proxied by the phishing platform and shown to the targeted user.\nBecause the phishlet spoofs an unsupported browser user agent, Microsoft Entra ID turns off FIDO authentication and instead returns an error.\nThis error prompts the user to choose an alternate verification fallback method, such as the Microsoft Authenticator app, SMS code, or OTP.\nLogin error (left) and fallback options (right)\nSource: Proofpoint\nIf the user uses one of the alternative methods, the AiTM proxy intercepts both their account credentials and the MFA token or session cookie.\nThe attacker then imports the stolen cookie into their own browser, granting full access to the victim's account, which was theoretically phishing-resistant.\nProofpoint says it has observed no cases of this technique being used by hackers in the wild yet, as threat actors still focus on easier targets such as accounts lacking MFA protection. Still, the risk is significant, especially in limited, highly targeted attacks.\nTo mitigate risks from this emerging threat, consider turning off fallback authentication methods for your account or activating additional checks and confirmations when such processes are triggered.\nIf a login process suddenly asks for a different method instead of a registered passkey, it's a red flag, and users should abort and verify via official, trusted channels.\nIn July, Expel researchers presented a different FIDO downgrade attack\ndubbed 'PoisonSeed\n,' where a phishing site stole the target's credentials and initiated a cross-device authentication flow,  generating a QR code on the real service's login page, tricking the target to scan it to approve a login request from a rogue device.\nAlthough the concept was interesting, the researchers later discovered that it was practically infeasible due to proximity requirements, which led to the fraudulent authentication requests failing.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nCitrix Bleed 2 exploited weeks before PoCs as Citrix denied attacks\nThe Rise of Native Phishing: Microsoft 365 Apps Abused in Attacks\nWinRAR zero-day exploited to plant malware on archive extraction\nHacker extradited to US for stealing $3.3 million from taxpayers\nMozilla warns of phishing attacks targeting add-on developers"
    },
    {
        "Title": "Spike in Fortinet VPN brute-force attacks raises zero-day concerns",
        "Link": "https://www.bleepingcomputer.com/news/security/spike-in-fortinet-vpn-brute-force-attacks-raises-zero-day-concerns/",
        "Summary": "A massive spike in brute-force attacks targeted Fortinet SSL VPNs earlier this month, followed by a switch to FortiManager, marked a deliberate shift in targeting that has historically preceded new vulnerability disclosures. [...]",
        "Date": "2025-08-13",
        "Content": "A massive spike in brute-force attacks targeted Fortinet SSL VPNs earlier this month, followed by a switch to FortiManager, marked a deliberate shift in targeting that has historically preceded new vulnerability disclosures.\nThe campaign, detected by threat monitoring platform GreyNoise, manifested in two waves, on August 3 and August 5, with the second wave pivoting to FortiManager targeting with a different TCP signature.\nAs GreyNoise\npreviously reported\n, such spikes in deliberate scanning and brute-forcing precede the disclosure of new security vulnerabilities 80% of the time.\nOften, such scans aim at enumerating exposed endpoints, evaluating their significance, and estimating their exploitation potential, with actual attack waves following shortly after.\n\"New research shows spikes like this often precede the disclosure of new vulnerabilities affecting the same vendor — most within six weeks,\" warned GreyNoise.\n\"In fact, GreyNoise found that spikes in activity triggering this exact tag are significantly correlated with future disclosed vulnerabilities in Fortinet products.\"\nDue to this, defenders shouldn't dismiss those spikes in activity as failed attempts to exploit old, patched flaws, but rather treat them as potential precursors to zero-day disclosure and strengthen security measures to block them.\nThe Fortinet brute-force attacks\nOn August 3, 2025, GreyNoise recorded a spike in brute-forcing attempts targeting Fortinet SSL VPN as part of a steady activity it has been monitoring since earlier.\nJA4+ fingerprint analysis, a network fingerprinting method for identifying and classifying encrypted traffic, linked the spike to June activity originating from a FortiGate device on a residential IP address associated with Pilot Fiber Inc.\n\"This overlap doesn't confirm attribution, but it suggests possible reuse of tooling or network environments,\"\ncommented GreyNoise\nin its bulletin.\nActivity spike on August 3, 2025\nSource: GreyNoise\nTwo days later, on August 5, a new brute-force campaign from the same attacker emerged, which switched targeting from FortiOS SSL VPN endpoints to FortiManager's FGFM service.\n\"While the August 3 traffic has targeted the\nFortiOS\nprofile, traffic fingerprinted with TCP and client signatures — a meta signature — from August 5 onward was not hitting\nFortiOS\n,\" explained GreyNoise.\n\"Instead, it was consistently targeting our\nFortiManager - FGFM\nprofile albeit still triggering our Fortinet SSL VPN Bruteforcer tag.\"\nThis shift suggested that either the same attackers or the same toolset/infrastructure moved from trying to brute-force VPN logins to trying to brute-force FortiManager access.\nThe IP addresses associated with this activity, and which should be placed on blocklists, are:\n31.206.51.194\n23.120.100.230\n96.67.212.83\n104.129.137.162\n118.97.151.34\n180.254.147.16\n20.207.197.237\n180.254.155.227\n185.77.225.174\n45.227.254.113\nGreyNoise notes that the tracked malicious activity is evolving with time and is associated with a specific origin cluster that most likely performs adaptive testing.\nIn general, this activity is unlikely to be researcher scans, which are typically broader in scope and limited in rate, and wouldn't involve credential brute-forcing, which is seen as an apparent intrusion attempt.\nHence, defenders should block the listed IPs, increase login protection on Fortinet devices, and harden external access where possible, restricting access only to trusted IP ranges and VPNs.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nFortinet warns of FortiSIEM pre-auth RCE flaw with exploit in the wild\nExploits for pre-auth Fortinet FortiWeb RCE flaw released, patch now"
    },
    {
        "Title": "Pennsylvania attorney general's email, site down after cyberattack",
        "Link": "https://www.bleepingcomputer.com/news/security/pennsylvania-attorney-generals-email-site-down-after-cyberattack/",
        "Summary": "The Office of the Pennsylvania Attorney General has announced that a recent cyberattack has taken down its systems, including landline phone lines and email accounts. [...]",
        "Date": "2025-08-13",
        "Content": "The Office of the Pennsylvania Attorney General has announced that a recent cyberattack has taken down its systems, including landline phone lines and email accounts.\nAs Attorney General Dave Sunday revealed on social media on Monday, the office staff is currently working to restore affected services and investigate the incident with the help of law enforcement authorities.\n\"The network that hosts the Office of Attorney General's systems is currently down, meaning the office's website is offline, as are office email accounts and land phone lines,\"\nSunday said\n.\n\"We are taking steps to determine the cause of the cyber incident, and working to restore services on all avenues. Office of Attorney General staff are continuing to advocate on behalf of the Commonwealth and are working with supervisors to minimize any interruptions.\"\nPennsylvania's attorney general has yet to attribute the attack to a specific group officially. However, the incident's widespread and crippling impact bears all the signs of a ransomware attack, even though no ransomware operation has claimed responsibility to date.\nWhile incident responders\ncontinue to work on restoring impacted systems, the\nwebsite of Pennsylvania's Attorney General\nwas still\noffline at the time this article was published.\nOffice of Pennsylvania's attorney general website (BleepingComputer)\nAlthough the attack vector is still unknown,\ncybersecurity expert Kevin Beaumont had found,\none month prior, that several public-facing Citrix NetScaler appliances on the Pennsylvania AG's network were vulnerable to ongoing attacks exploiting a critical vulnerability tracked as CVE-2025-5777 (also known as\nCitrix Bleed 2\n).\nAccording to Shodan scans shared by Beaumont, one of the two devices\nhas been offline since July 29th\n, while the other\nwas taken down on August 7th\n.\nOn Monday, the internet security nonprofit Shadowserver Foundation\nreported\nthat over 3,300 Citrix NetScaler appliances were still vulnerable to CVE-2025-5777 attacks.\nThe same day, the Netherlands' National Cyber Security Centre (NCSC)\nwarned\nthat attackers have exploited the flaw as a zero-day since at least early May to breach multiple critical organizations in the country.\nThe Openbaar Ministerie (the Netherlands' Public Prosecution Service), which only\nrecently\nrestored its\nemail servers\n, also\ndisclosed a breach\non July 18th that led to\nsignificant operational disruptions\n.\nCISA has added the CVE-2025-5777 Citrix vulnerability to its Known Exploited Vulnerabilities catalog,\nordering federal agencies to patch their systems\nagainst active exploitation within a day.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nIngram Micro starts restoring systems after ransomware attack\nCurly COMrades cyberspies hit govt orgs with custom malware\nSaint Paul cyberattack linked to Interlock ransomware gang\nNational Bank of Canada online systems down due to 'technical issue'\nThe Heat Wasn't Just Outside: Cyber Attacks Spiked in Summer 2025"
    },
    {
        "Title": "Microsoft removes PowerShell 2.0 from Windows 11, Windows Server",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-removes-powershell-20-from-windows-11-windows-server/",
        "Summary": "Microsoft will remove PowerShell 2.0 from Windows starting in August, eight years after announcing its deprecation and keeping it around as an optional feature. [...]",
        "Date": "2025-08-13",
        "Content": "Microsoft will remove PowerShell 2.0 from Windows starting in August, eight years after\nannouncing its deprecation\nand keeping it around as an optional feature.\nThe 14-year-old command processor introduced with Windows 7 was already removed for Windows Insiders as of\nJuly 2025\n, with the release of Windows 11 Insider Preview Build 27891 to the Canary Channel.\nAs detailed in a\nsupport document\npublished on Monday, Microsoft will permanently remove PowerShell 2.0 from Windows 11 version 24H2, starting in August, and from Windows Server 2025 in September.\n\"For most users and organizations, this change will be uneventful – newer versions of PowerShell such as PowerShell 5.1 and PowerShell 7.x continue to be available and supported. However, if you have legacy scripts or software that explicitly depends on PowerShell 2.0, you will need to take action and update them or use a workaround to prevent any disruptions,\"\nMicrosoft said.\n\"PowerShell 2.0 will be removed in a later release starting in August 2025 for Windows 11, version 24H2 and a September 2025 release for Windows Server 2025. All later releases for Windows 11 and Windows Server 2025 will not include PowerShell 2.0.\"\nThis move is part of a broader effort to remove legacy code, reducing system complexity, and improving Windows security, according to Microsoft.\nRemoval affects customers using legacy scripts and software\nMicrosoft customers who use legacy applications, including older Microsoft server products such as Exchange, SharePoint, and SQL Server, that rely on PowerShell 2.0 scripting, will be directly impacted by this change.\nAlthough legacy scripts attempting to launch PowerShell 2.0 will automatically default to PowerShell 5.1, which is backward-compatible for most commands and modules, those using such tools are advised to update their systems to prevent disruptions.\nThe company added that customers should migrate their scripts and tools to PowerShell 5.1 or PowerShell 7 and replace outdated software that cannot function without PowerShell 2.0 support, since some older third-party installers may fail on newer Windows versions when attempting to enable PowerShell 2.0 during setup.\n\"By using the newer and supported PowerShell 7 or PowerShell 5.1, you can help ensure that scripts run safer,\"\nMicrosoft added\nin a new message center post.\n\"If you have legacy scripts or software that explicitly depend on PowerShell 2.0, you'll need to either update them or use a workaround to prevent disruptions.\"\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nMicrosoft asks users to ignore certificate enrollment errors\nMicrosoft fixes bug behind incorrect Windows Firewall errors\nMicrosoft asks users to ignore Windows Firewall config errors\nMicrosoft fixes known issue that breaks Windows 11 updates\nWindows 11 24H2 emergency update fixes Easy Anti-Cheat BSOD issue"
    },
    {
        "Title": "Microsoft asks users to ignore certificate enrollment errors",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-asks-users-to-ignore-certificate-enrollment-errors/",
        "Summary": "Microsoft has asked customers this week to disregard incorrect CertificateServicesClient (CertEnroll) errors that appear after installing the July 2025 preview update and subsequent Windows 11 24H2 updates. [...]",
        "Date": "2025-08-13",
        "Content": "Microsoft has asked customers this week to disregard incorrect CertificateServicesClient (CertEnroll) errors that appear after installing the July 2025 preview update and subsequent Windows 11 24H2 updates.\nIn recent months, Microsoft has addressed multiple similar issues affecting various Windows features that triggered erroneous warnings with no actual impact.\nFor instance, last month, Redmond advised users to\nturn a blind eye to Windows Firewall configuration errors\nthat occurred after rebooting their computers following the installation of the June 2025 preview update.\nIn April, the company\nconfirmed\nand fixed a known issue that\ncaused invalid 0x80070643 failure errors\nafter installing the April 2025 Windows Recovery Environment (WinRE) updates.\nThe same month, it also fixed a bug that was\ntriggering incorrect BitLocker drive encryption errors\non Windows 10 and Windows 11 devices due to a reporting issue.\nWhen it acknowledged the issue\nin October\n, Microsoft stated that it only impacted managed Windows environments where drive encryption was enforced for the operating system and fixed drives.\nMore errors added to the ignore list\nOn Monday, the company updated the Windows release health dashboard once again to ask users to ignore another error event caused by recent updates, logged in Event Viewer with Error ID 57 and a message warning that \"The 'Microsoft Pluton Cryptographic Provider' provider was not loaded because initialization failed.\"\n\"Following installation of the July 2025 Windows non-security preview update (KB5062660) and later updates including the August 2025 Windows security update, Event Viewer may display an error related to CertificateServicesClient (CertEnroll) which can be safely ignored,\"\nthe company said\n.\n\"Please note that although this event is logged in Event Viewer every time the device is restarted, it does not reflect an issue with any active Windows component.\"\nMicrosoft stated that this known issue is caused by a feature that's still under development and hasn't yet been fully integrated into the operating system.\nJust as it did when confirming other similar errors over the last few months, the company once again added that these errors have no impact on Windows processes and that users don't need to take any action to prevent or resolve this issue.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nMicrosoft asks users to ignore Windows Firewall config errors\nMicrosoft fixes known issue that breaks Windows 11 updates\nMicrosoft fixes bug behind incorrect Windows Firewall errors\nMicrosoft fixes ‘Print to PDF’ feature broken by Windows update\nMicrosoft confirms Family Safety blocks Google Chrome from launching"
    },
    {
        "Title": "OpenAI adds new GPT-5 models, restores o3, o4-mini and it's a mess all over again",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-adds-new-gpt-5-models-restores-o3-o4-mini-and-its-a-mess-all-over-again/",
        "Summary": "One of the few things many disliked about ChatGPT was the confusing number of models. OpenAI claimed GPT-5 would fix this, but it seems to have made it worse. [...]",
        "Date": "2025-08-13",
        "Content": "One of the few things many disliked about ChatGPT was the confusing number of models. OpenAI claimed GPT-5 would fix this, but it seems to have made it worse.\nA new update is rolling out to ChatGPT. It doesn't upgrade GPT-5, but instead adds more options that some of you would love.\nPreviously, GPT-5 had two variants - GPT (auto-rotates between reasoning and non-reasoning) and GPT-Thinking (reasoning).\nGPT-5 model selector\nSource: BleepingComputer\nToday's update populates the ChatGPT 5 model selection menu with several options.\nUnder GPT-5, you can choose Auto (decides how long to think), Fast (instant answers), Thinking mini (thinks quickly), Thinking (takes longer for better answers), and Pro (research-grade intelligence, requires upgrade).\nYou can choose the model that best suits your requirements, but if you select GPT-5, which is the default state, OpenAI will automatically pick the best model depending on the query.\nThere’s also a Legacy models section, which includes GPT-4o, GPT-4.1, o3, and o4-mini.\nIf you don't see the Legacy section, open your profile tab, then select Settings and turn on Legacy models. This works only on ChatGPT Plus and Pro accounts.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nNew ChatGPT o3-alpha model hints at coding upgrade\nOpenAI relaxes GPT-5 rate limit, promises to improve the personality\nOpenAI is testing 3,000-per-week limit for GPT-5 Thinking\nHow to restore GPT-4o when you've GPT-5\nOpenAI to fix GPT-5 issues, double rate limits for paid users after outrage"
    },
    {
        "Title": "Fortinet Products Are in the Crosshairs Again",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/fortinet-products-in-crosshairs-again",
        "Summary": "The company disclosed a critical FortiSIEM flaw with a PoC exploit for it the same week researchers warned of an ominous surge in malicious traffic targeting the vendor's SSL VPNs.",
        "Date": "2025-08-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/fortinet-products-in-crosshairs-again"
    },
    {
        "Title": "Whispers of XZ Utils Backdoor Live on in Old Docker Images",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/xz-utils-backdoor-live-old-docker-images",
        "Summary": "Developers maintaining the images made the &quot;intentional choice&quot; to leave the artifacts available as &quot;a historical curiosity,&quot; given the improbability they'd be exploited.",
        "Date": "2025-08-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/xz-utils-backdoor-live-old-docker-images"
    },
    {
        "Title": "Popular AI Systems Still a Work-in-Progress for Security",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/popular-ai-systems-still-work-in-progress-security",
        "Summary": "According to a recent Forescout analysis, open source models were significantly less successful in vulnerability research than commercial and underground models.",
        "Date": "2025-08-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/popular-ai-systems-still-work-in-progress-security"
    },
    {
        "Title": "Patch Now: Attackers Target OT Networks via Critical RCE Flaw",
        "Link": "https://www.darkreading.com/ics-ot-security/patch-now-attackers-target-ot-networks-critical-rce-flaw",
        "Summary": "Researchers observed exploitation attempts against a vulnerability with a CVSS score of 10 in a popular Erlang-based platform for critical infrastructure and OT development.",
        "Date": "2025-08-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/ics-ot-security/patch-now-attackers-target-ot-networks-critical-rce-flaw"
    },
    {
        "Title": "What the LockBit 4.0 Leak Reveals About RaaS Groups",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/what-lockbit-leak-reveals-raas-groups",
        "Summary": "The leak serves as a wake-up call: Being prepared is the cornerstone of a successful defense, and those who don't prepare are going to face uncertainty caused by the lack of attackers' accountability.",
        "Date": "2025-08-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/what-lockbit-leak-reveals-raas-groups"
    },
    {
        "Title": "How an AI-Based 'Pen Tester' Became a Top Bug Hunter on HackerOne",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/ai-based-pen-tester-top-bug-hunter-hackerone",
        "Summary": "AI researcher explains how an automated penetration-testing tool became the first non-human member on HackerOne to reach the top of the platform's US leaderboard.",
        "Date": "2025-08-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/ai-based-pen-tester-top-bug-hunter-hackerone"
    },
    {
        "Title": "China Questions Security of AI Chips From NVIDIA, AMD",
        "Link": "https://www.darkreading.com/cyber-risk/china-questions-security-ai-chips-nvidia-amd",
        "Summary": "The US banned the sale of AI chips to China and then backed off. Now, Chinese sources are calling on NVIDIA to prove its AI chips have no backdoors.",
        "Date": "2025-08-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/china-questions-security-ai-chips-nvidia-amd"
    },
    {
        "Title": "Chipmaker Patch Tuesday: Many Vulnerabilities Addressed by Intel, AMD, Nvidia",
        "Link": "https://www.securityweek.com/chipmaker-patch-tuesday-many-vulnerabilities-addressed-by-intel-amd-nvidia/",
        "Summary": "<p>Intel, AMD and Nvidia have published security advisories describing vulnerabilities found recently in their products.</p>\n<p>The post <a href=\"https://www.securityweek.com/chipmaker-patch-tuesday-many-vulnerabilities-addressed-by-intel-amd-nvidia/\">Chipmaker Patch Tuesday: Many Vulnerabilities Addressed by Intel, AMD, Nvidia</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chipmaker-patch-tuesday-many-vulnerabilities-addressed-by-intel-amd-nvidia/"
    },
    {
        "Title": "Manpower Says Data Breach Stemming From Ransomware Attack Impacts 140,000",
        "Link": "https://www.securityweek.com/manpower-says-data-breach-stemming-from-ransomware-attack-impacts-140000/",
        "Summary": "<p>The RansomHub ransomware group stole sensitive information from staffing and recruiting firm Manpower in January.</p>\n<p>The post <a href=\"https://www.securityweek.com/manpower-says-data-breach-stemming-from-ransomware-attack-impacts-140000/\">Manpower Says Data Breach Stemming From Ransomware Attack Impacts 140,000</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/manpower-says-data-breach-stemming-from-ransomware-attack-impacts-140000/"
    },
    {
        "Title": "Fortinet, Ivanti Release August 2025 Security Patches",
        "Link": "https://www.securityweek.com/fortinet-ivanti-release-august-2025-security-patches/",
        "Summary": "<p>Fortinet and Ivanti have published new security advisories for their August 2025 Patch Tuesday updates. </p>\n<p>The post <a href=\"https://www.securityweek.com/fortinet-ivanti-release-august-2025-security-patches/\">Fortinet, Ivanti Release August 2025 Security Patches</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/fortinet-ivanti-release-august-2025-security-patches/"
    },
    {
        "Title": "ICS Patch Tuesday: Major Vendors Address Code Execution Vulnerabilities",
        "Link": "https://www.securityweek.com/ics-patch-tuesday-major-vendors-address-code-execution-vulnerabilities/",
        "Summary": "<p>August 2025 ICS Patch Tuesday advisories have been published by Siemens, Schneider, Aveva, Honeywell, ABB and Phoenix Contact.</p>\n<p>The post <a href=\"https://www.securityweek.com/ics-patch-tuesday-major-vendors-address-code-execution-vulnerabilities/\">ICS Patch Tuesday: Major Vendors Address Code Execution Vulnerabilities</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/ics-patch-tuesday-major-vendors-address-code-execution-vulnerabilities/"
    },
    {
        "Title": "Adobe Patches Over 60 Vulnerabilities Across 13 Products",
        "Link": "https://www.securityweek.com/adobe-patches-over-60-vulnerabilities-across-13-products/",
        "Summary": "<p>Adobe’s security updates fix vulnerabilities in Commerce, Substance, InDesign, FrameMaker, Dimension and other products.</p>\n<p>The post <a href=\"https://www.securityweek.com/adobe-patches-over-60-vulnerabilities-across-13-products/\">Adobe Patches Over 60 Vulnerabilities Across 13 Products</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/adobe-patches-over-60-vulnerabilities-across-13-products/"
    },
    {
        "Title": "Microsoft Patches Over 100 Vulnerabilities",
        "Link": "https://www.securityweek.com/microsoft-patches-over-100-vulnerabilities/",
        "Summary": "<p>Microsoft’s August 2025 Patch Tuesday updates address critical vulnerabilities in Windows, Office, and Hyper-V.</p>\n<p>The post <a href=\"https://www.securityweek.com/microsoft-patches-over-100-vulnerabilities/\">Microsoft Patches Over 100 Vulnerabilities</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/microsoft-patches-over-100-vulnerabilities/"
    },
    {
        "Title": "Interlock Ransomware Gang Allegedly Breaches Box Elder County and Epperson Law Group",
        "Link": "https://dailydarkweb.net/interlock-ransomware-gang-allegedly-breaches-box-elder-county-and-epperson-law-group/",
        "Summary": "The ransomware group known as &#8220;Interlock&#8221; has allegedly added two new U.S.-based victims to its data leak site. The group claims to have successfully breached the systems of a government entity and a private law firm, publishing proof of the attacks. The targeted organizations are Box Elder County from Utah and the Epperson Law Group. [&#8230;]",
        "Date": "2025-08-13",
        "Content": "The ransomware group known as “Interlock” has allegedly added two new U.S.-based victims to its data leak site. The group claims to have successfully breached the systems of a government entity and a private law firm, publishing proof of the attacks. The targeted organizations are Box Elder County from Utah and the Epperson Law Group.\nThe alleged victims of the Interlock ransomware group include:\n🇺🇸\nBox Elder County:\nA county government in the northwestern part of Utah, described as a location for wildlife viewing and various recreational activities.\n🇺🇸\nEpperson Law Group:\nA U.S. law firm. The ransomware actors accused the firm of being “negligent and indifferent to their safety,” which allegedly resulted in the data compromise.\nInterlock claims to have exfiltrated a massive trove of data from both entities. From Box Elder County, the group allegedly stole approximately\n4510\nGB of data, containing\n2\n,\n118\n,\n363\nfiles in\n372\n,\n474\nfolders. For Epperson Law Group, the compromised data allegedly amounts to\n1040\nGB, consisting of\n775\n,\n230\nfiles in\n81\n,\n609\nfolders. The group has not yet detailed the specific contents of the stolen files.\nTags:\nBox Elder County\nCyberSecurity\ndata-breach\nEpperson Law Group\nInterlock\nransomware\nUtah"
    },
    {
        "Title": "Qilin Ransomware Allegedly Breaches Venture Credit Union, Haeger & Schmidt Logistics, Assisted Living Pharmacy, SYNCADD, Northern Construction, and Belle Vernon Schools",
        "Link": "https://dailydarkweb.net/qilin-ransomware-allegedly-breaches-venture-credit-union-haeger-schmidt-logistics-assisted-living-pharmacy-syncadd-northern-construction-and-belle-vernon-schools/",
        "Summary": "The Qilin ransomware group has allegedly added a diverse list of six new victims to its data leak portal, claiming to have breached organizations across the finance, logistics, healthcare, technology, construction, and education sectors. The attacks demonstrate a broad campaign targeting entities in North America, Europe, and the Caribbean, with the threat actors threatening to [&#8230;]",
        "Date": "2025-08-13",
        "Content": "The Qilin ransomware group has allegedly added a diverse list of six new victims to its data leak portal, claiming to have breached organizations across the finance, logistics, healthcare, technology, construction, and education sectors. The attacks demonstrate a broad campaign targeting entities in North America, Europe, and the Caribbean, with the threat actors threatening to release a trove of sensitive data exfiltrated from the victims’ networks.\nThe alleged breaches impact a wide range of individuals, from customers of financial and healthcare services to public school students and employees of government contractors. The data exposed reportedly includes personal identification, financial records, confidential corporate documents, and, in some cases, protected health information and documents related to US military contractors. The incident highlights the indiscriminate and far-reaching impact of modern ransomware operations.\nThe list of organizations allegedly compromised by the Qilin group includes:\n🇹🇹\nVenture Credit Union:\nA financial services provider in Trinidad and Tobago that offers loans, mortgages, and investment tools. The threat actors claim to have leaked personal documents of clients and internal financial data.\n🇩🇪\nHaeger & Schmidt Logistics:\nA German transport and logistics company established in 1887 that manages global cargo routes. The group allegedly leaked a complete company database from the last 10 years, including transportation routes, costs, budgets, and personal data of staff and customers.\n🇺🇸\nAssisted Living Pharmacy Service LLC:\nA US-based pharmacy service. The compromised data allegedly includes the complete customer database, detailing medication histories and the company’s financial information.\n🇺🇸\nSYNCADD:\nA technology solutions provider for global customers, including divisions of the US Armed Forces. Allegedly leaked files include:\nA scanned copy of a US passport\nWorkers’ Compensation audit documents\nA non-disclosure agreement\nA contractor access checklist for a secure or government facility\n🇺🇸\nNorthern Construction Service, LLC:\nA Massachusetts-based general contractor specializing in bridge and port construction. Leaked documents reportedly include:\nCompany invoices from a payment platform\nTechnical construction documentation for a bridge repair project\nEngineering plans for a causeway reconstruction\nA completion report for a highway reconstruction project\n🇺🇸\nThe Belle Vernon Area School District (BVASD):\nA public school district in Pennsylvania. The exposed data allegedly contains highly sensitive information, such as:\nA personal financial statement\nAn application for employment\nAn employee payroll accuracy report\nMedical reports concerning a patient at a children’s hospital\nTags:\nAssisted Living Pharmacy Service LLC\nCyberSecurity\ndata-breach\nHaeger & Schmidt Logistics\nNorthern Construction Service\nQilin\nransomware\nSYNCADD\nThe Belle Vernon Area School District\nVenture Credit Union"
    },
    {
        "Title": "Israel Railways Allegedly Targeted by Threat Actor Selling High-Privilege System Access",
        "Link": "https://dailydarkweb.net/israel-railways-allegedly-targeted-by-threat-actor-selling-high-privilege-system-access/",
        "Summary": "A threat actor has allegedly compromised Israel Railways, the state-owned company responsible for all passenger and freight rail transport in the country. In a recent post on a dark web forum, the actor claims to have obtained high-privilege system access and is now offering it for sale. Israel Railways is a critical component of the [&#8230;]",
        "Date": "2025-08-13",
        "Content": "A threat actor has allegedly compromised Israel Railways, the state-owned company responsible for all passenger and freight rail transport in the country. In a recent post on a dark web forum, the actor claims to have obtained high-privilege system access and is now offering it for sale. Israel Railways is a critical component of the nation’s infrastructure, operating hundreds of stations and serving millions of passengers monthly, making any potential security breach a matter of significant public concern.\nThe threat actor attempted to substantiate their claims by posting samples of what appears to be internal system configurations. The provided evidence suggests a potential compromise revolving around the service’s Application Programming Interfaces (APIs). The actor revealed several API keys and backend URLs associated with the railway’s services, hosted on platforms like\nisraelrail[.]azurefd[.]net\nand\nrail[.]co[.]il\n. This information could potentially allow unauthorized access to manipulate or retrieve sensitive operational data.\nThe exposed information allegedly includes:\nAPI Keys for train services\nInternal API and timetable base URLs\nTrain service configuration details, including user agents and timeouts\nTags:\nCritical Infrastructure\ncyberattack\ndark web\ndata-breach\nIsrael Railways"
    },
    {
        "Title": "Indian Online Pharmacy Zeelab Allegedly Breached – Data of 4 Million Users for Sale",
        "Link": "https://dailydarkweb.net/indian-online-pharmacy-zeelab-allegedly-breached-data-of-4-million-users-for-sale/",
        "Summary": "A threat actor has allegedly put a database containing the information of over four million users of Zeelab Pharmacy up for sale on a dark web forum. Zeelab is one of India&#8217;s largest online pharmacy chains, providing medicines and healthcare products to customers across the country. The breach, if confirmed, would represent a significant compromise [&#8230;]",
        "Date": "2025-08-13",
        "Content": "A threat actor has allegedly put a database containing the information of over four million users of Zeelab Pharmacy up for sale on a dark web forum. Zeelab is one of India’s largest online pharmacy chains, providing medicines and healthcare products to customers across the country. The breach, if confirmed, would represent a significant compromise of sensitive personal data for a large number of Indian citizens who rely on the service for their medical needs.\nThe seller posted evidence of the breach, including a sample of the data, and is asking for $600, negotiable, with payment accepted in Bitcoin (BTC) or Monero (XMR). The threat actor claims the information was previously leaked but was not widely circulated. The exposure of this data could place millions of customers at significant risk for targeted phishing attacks, identity theft, and other fraudulent activities.\nThe allegedly compromised database contains a wide range of personally identifiable information (PII). According to the forum post, the leaked data includes the following fields:\nFull Name\nAge\nGender\nPhone Number\nEmail Address\nFull Physical Address (street, landmark, city, state, zip code)\nGeographical coordinates (Longitude, Latitude)\nUser ID and account timestamps\nTags:\nCyberSecurity\ndata-breach\nHealthcare\nIndia\nPII\nZeelab"
    },
    {
        "Title": "Russian Southern Military District Allegedly Breached – Sensitive Data on Servicemen Leaked Online",
        "Link": "https://dailydarkweb.net/russian-southern-military-district-allegedly-breached-sensitive-data-on-servicemen-leaked-online/",
        "Summary": "A threat actor has allegedly leaked a highly sensitive database belonging to the Southern Military District of the Armed Forces of the Russian Federation. The database was published on a dark web forum and is claimed to contain personal information of servicemen who deserted or left their posts without permission between 2022 and 2024. The [&#8230;]",
        "Date": "2025-08-13",
        "Content": "A threat actor has allegedly leaked a highly sensitive database belonging to the Southern Military District of the Armed Forces of the Russian Federation. The database was published on a dark web forum and is claimed to contain personal information of servicemen who deserted or left their posts without permission between 2022 and 2024. The Southern Military District is one of Russia’s five military districts, playing a crucial role in operations in the North Caucasus and overseeing Russian bases in the South Caucasus, making any data leak from this entity a significant security event.\nThe compromised data appears to be extensive, potentially exposing personal and operational details of the listed individuals. The actor shared screenshots of spreadsheets as proof, showcasing numerous records. The leak’s availability on a public forum could have severe implications, not only for the operational security of the Russian military but also for the personal safety of the servicemen and their families.\nBased on the information provided by the threat actor, the allegedly leaked database includes the following details:\nFull Names\nMilitary Rank\nUnit and Formation details\nDates of Birth\nPersonal identification numbers\nDates and circumstances of leaving their service posts\nTags:\nCyberSecurity\ndata-breach\ndata-leak\nmilitary\nRussia\nSouthern Military District"
    }
]