[
    {
        "Title": "SocGholish Malware Spread via Ad Tools; Delivers Access to LockBit, Evil Corp, and Others",
        "Link": "https://thehackernews.com/2025/08/socgholish-malware-spread-via-ad-tools.html",
        "Summary": "The threat actors behind the SocGholish malware have been observed leveraging Traffic Distribution Systems (TDSs) like Parrot TDS and Keitaro TDS to filter and redirect unsuspecting users to sketchy content.\n\"The core of their operation is a sophisticated Malware-as-a-Service (MaaS) model, where infected systems are sold as initial access points to other cybercriminal organizations,\" Silent Push",
        "Date": "2025-08-07",
        "Content": "The threat actors behind the SocGholish malware have been observed leveraging Traffic Distribution Systems (TDSs) like\nParrot TDS and Keitaro TDS\nto filter and redirect unsuspecting users to sketchy content.\n\"The core of their operation is a sophisticated Malware-as-a-Service (MaaS) model, where infected systems are sold as initial access points to other cybercriminal organizations,\" Silent Push\nsaid\nin an analysis.\nSocGholish, also called FakeUpdates, is a\nJavaScript loader malware\nthat's distributed via compromised websites by masquerading as deceptive updates for web browsers like Google Chrome or Mozilla Firefox, as well as other software such as Adobe Flash Player or Microsoft Teams. It's attributed to a threat actor called TA569, which is also tracked as Gold Prelude, Mustard Tempest, Purple Vallhund, and UNC1543.\nAttack chains involve deploying SocGholish to establish initial access and broker that compromised system access to a diverse clientele, including Evil Corp (aka DEV-0243), LockBit, Dridex, and\nRaspberry Robin\n(aka Roshtyak). Interestingly, recent campaigns have also leveraged Raspberry Robin as a distribution vector for SocGholish.\n\"SocGholish infections typically originate from compromised websites that have been infected in multiple different ways,\" Silent Push said. \"Website infections can involve direct injections, where the SocGholish payload delivery injects JS directly loaded from an infected webpage or via a version of the direct injection that uses an intermediate JS file to load the related injection.\"\nBesides redirecting to SocGholish domains via compromised websites, another primary source of traffic involves using third-party TDSes like Parrot TDS and Keitaro TDS to direct web traffic to specific websites or to landing pages after performing extensive fingerprinting of the site visitor and determining if they are of interest based on certain predefined criteria.\nKeitaro TDS has long been involved in threat activity going beyond\nmalvertising and scams\nto deliver more sophisticated malware, including\nexploit kits\n,\nloaders\n,\nransomware\n, and\nRussian influence operations\n. Last year, Infoblox revealed how SocGholish, a\nVexTrio\npartner, used Keitaro to redirect victims to\nVexTrio's TDSes\n.\n\"Because Keitaro also has many legitimate applications, it is frequently difficult or impossible to simply block traffic through the service without generating excessive false positives, although organizations can consider this in their own policies,\" Proofpoint\nnoted\nback in 2019.\nKeitaro TDS is believed to be connected to\nTA2726\n, which has functioned as a traffic provider for both SocGholish and TA2727 by compromising websites and injecting a Keitaro TDS link, and then selling that to its customers.\n\"The intermediate C2 [command-and-control] framework dynamically generates payloads that victims download at runtime,\" Silent Push noted.\n\"It is essential to note that across the execution framework, from the initial SocGholish injection to the on-device execution of the Windows implant, the entire process is continuously tracked by SocGholish's C2 framework. If, at any time, the framework determines that a given victim is not 'legitimate,' it will stop the serving of a payload.\"\nThe cybersecurity company has also assessed that there are possibly former members who are involved in Dridex, Raspberry Robin, and SocGholish, given the\noverlapping\nnature\nof the campaigns observed.\nThe development comes as Zscaler detailed an updated version of Raspberry Robin that features improved obfuscation methods, changes to its network communication process, and embeds pointing to intentionally corrupted TOR C2 domains, signaling continued efforts to avoid detection and hinder reverse engineering efforts.\n\"The network encryption algorithm has changed from AES (CTR mode) to Chacha-20,\" the company\nsaid\n. \"Raspberry Robin has added a new local privilege escalation (LPE) exploit (\nCVE-2024-38196\n) to gain elevated privileges on targeted systems.\"\nThe disclosure also follows an evolution of\nDarkCloud Stealer attacks\nthat employ phishing emails to deliver a ConfuserEx-protected version of the stealer payload written in Visual Basic 6, which is launched and executed using a technique called process hollowing.\n\"DarkCloud Stealer is typical of an evolution in cyberthreats, leveraging obfuscation techniques and intricate payload structures to evade traditional detection mechanisms,\" Unit 42\nsaid\n. \"The shift in delivery methods observed in April 2025 indicates an evolving evasion strategy.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Webinar: How to Stop Python Supply Chain Attacks—and the Expert Tools You Need",
        "Link": "https://thehackernews.com/2025/08/webinar-how-to-stop-python-supply-chain.html",
        "Summary": "Python is everywhere in modern software. From machine learning models to production microservices, chances are your code—and your business—depends on Python packages you didn’t write.\nBut in 2025, that trust comes with a serious risk.\nEvery few weeks, we’re seeing fresh headlines about malicious packages uploaded to the Python Package Index (PyPI)—many going undetected until after they’ve caused",
        "Date": "2025-08-07",
        "Content": "Python is everywhere in modern software. From machine learning models to production microservices, chances are your code—and your business—depends on Python packages you didn't write.\nBut in 2025, that trust comes with a serious risk.\nEvery few weeks, we're seeing fresh headlines about malicious packages uploaded to the Python Package Index (PyPI)—many going undetected until after they've caused real harm. One of the most dangerous recent examples? In December 2024, attackers quietly compromised the Ultralytics YOLO package, widely used in computer vision applications. It was downloaded thousands of times before anyone noticed.\nThis wasn't an isolated event. This is the new normal.\nPython supply chain attacks are rising fast—and your next pip install could be the weakest link. Join our webinar to learn what's really happening, what's coming next, and how to secure your code with confidence. Don't wait for a breach.\nWatch this webinar now and take control.\n.\nWhat's Really Going On?\nAttackers are exploiting weak links in the open-source supply chain. They're using tricks like:\nTypo-squatting:\nUploading fake packages with names like requessts or urlib.\nRepojacking:\nHijacking abandoned GitHub repos once linked to trusted packages.\nSlop-squatting:\nPublishing popular misspellings\nbefore\na legit maintainer claims them.\nOnce a developer installs one of these packages—intentionally or not—it's game over.\nAnd it's not just rogue packages. Even the official Python container image ships with critical vulnerabilities. At the time of writing, there are over 100 high and critical CVEs in the standard Python base image. Fixing them isn't easy, either. That's the \"my boss told me to fix Ubuntu\" problem—when your app team inherits infra problems no one wants to own.\nIt's Time to Treat Python Supply Chain Security Like a First-Class Problem\nThe traditional approach—\"just pip install and move on\"—won't cut it anymore. Whether you're a developer, a security engineer, or running production systems, you need visibility and control over what you're pulling in.\nAnd here's the good news: you can secure your Python environment without breaking your workflow. You just need the right tools, and a clear playbook.\nThat's where this webinar comes in.\n🎥Join Us:\nHow to Secure Your Python Supply Chain in 2025\nIn this session, we'll walk through:\nThe Anatomy of Modern Python Supply Chain Attacks:\nWhat happened in recent PyPI incidents—and why they keep happening.\nWhat You Can Do Today:\nFrom pip install hygiene to using tools like pip-audit, Sigstore, and SBOMs.\nBehind the Scenes: Sigstore & SLSA:\nHow modern signing and provenance frameworks are changing how we trust code.\nHow PyPI is Responding:\nThe latest ecosystem-wide changes and what they mean for package consumers.\nZero-Trust for Your Python Stack:\nUsing Chainguard Containers and Chainguard Libraries to ship secure, CVE-free code out of the box.\nThe threats are getting smarter. The tooling is getting better. But most teams are stuck somewhere in the middle—relying on default images, no validation, and hoping their dependencies don't betray them.\nYou don't have to become a security expert overnight—but you do need a roadmap. Whether you're early in your journey or already doing audits and signing, this session will help you take your Python supply chain to the next level.\nWatch this Webinar Now\nYour application is only as secure as the weakest import. It's time to stop trusting blindly and start verifying. Join us. Get practical. Get secure.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Malicious Go, npm Packages Deliver Cross-Platform Malware, Trigger Remote Data Wipes",
        "Link": "https://thehackernews.com/2025/08/malicious-go-npm-packages-deliver-cross.html",
        "Summary": "Cybersecurity researchers have discovered a set of 11 malicious Go packages that are designed to download additional payloads from remote servers and execute them on both Windows and Linux systems.\n\"At runtime the code silently spawns a shell, pulls a second-stage payload from an interchangeable set of .icu and .tech command-and-control (C2) endpoints, and executes it in memory,\" Socket security",
        "Date": "2025-08-07",
        "Content": "Cybersecurity researchers have discovered a set of 11 malicious Go packages that are designed to download additional payloads from remote servers and execute them on both Windows and Linux systems.\n\"At runtime the code silently spawns a shell, pulls a second-stage payload from an interchangeable set of .icu and .tech command-and-control (C2) endpoints, and executes it in memory,\" Socket security researcher Olivia Brown\nsaid\n.\nThe list of identified packages is below -\ngithub.com/stripedconsu/linker\ngithub.com/agitatedleopa/stm\ngithub.com/expertsandba/opt\ngithub.com/wetteepee/hcloud-ip-floater\ngithub.com/weightycine/replika\ngithub.com/ordinarymea/tnsr_ids\ngithub.com/ordinarymea/TNSR_IDS\ngithub.com/cavernouskina/mcp-go\ngithub.com/lastnymph/gouid\ngithub.com/sinfulsky/gouid\ngithub.com/briefinitia/gouid\nThe packages conceal an obfuscated loader that harbors functionality to fetch second-stage ELF and portable executable (PE) binaries, which, in turn, can gather host information, access web browser data, and beacon out to its C2 server.\n\"Because the second-stage payload delivers a bash-scripted payload for Linux systems and retrieves Windows executables via certutil.exe, both Linux build servers and Windows workstations are susceptible to compromise,\" Brown said.\nComplicating matters is the decentralized nature of the Go ecosystem, which allows modules to be directly imported from GitHub repositories, causing significant developer confusion when searches for a package on pkg.go.dev can return several similarly named modules, although they may not necessarily be malicious in nature.\n\"Attackers exploit the confusion, carefully crafting their malicious module namespaces to appear trustworthy at a glance, significantly increasing the likelihood developers inadvertently integrate destructive code into their projects,\" Socket said.\nIt's assessed that the packages are the work of a single threat actor due to C2 reuse and the format of the code. The findings underscore the\ncontinued\nsupply chain risks\narising from the cross-platform nature of Go to push malware.\nThe development coincides with the discovery of two npm packages,\nnaya-flore\nand\nnvlore-hsc\n, that masquerade as WhatsApp socket libraries while incorporating a phone number-based kill switch that can remotely wipe developers' systems.\nThe packages, which have been collectively downloaded over 1,110 downloads, continue to remain available on the npm registry as of writing. Both libraries were published by a user named \"\nnayflore\n\" in early July 2025.\nCentral to their operations is their ability to retrieve a remote database of Indonesian phone numbers from a GitHub repository. Once the package is executed, it first checks if the current phone is in the database, and, if not, proceeds to recursively delete all files using the command \"rm -rf *\" following a WhatsApp pairing process.\nThe packages have also been found to contain a function to exfiltrate device information to an external endpoint, but calls to the function have been commented out, suggesting that the threat actor behind the scheme is signaling ongoing development.\n\"naya-flore also contains a hardcoded GitHub Personal Access Token that provides unauthorized access to private repositories,\" security researcher Kush Pandya\nsaid\n. \"The purpose of this token remains unclear from the available code.\"\n\"The presence of an unused GitHub token could indicate incomplete development, planned functionality that was never implemented, or usage in other parts of the codebase not included in these packages.\"\nOpen-source repositories continue to be an attractive malware distribution channel in software supply chains, with the packages designed to steal sensitive information and even targeting cryptocurrency wallets in some cases.\n\"While overall tactics have not evolved significantly, attackers continue to rely on proven techniques, such as minimizing file count, using installation scripts, and employing discreet data exfiltration methods that maximize impact,\" Fortinet FortiGuard Labs\nsaid\n.\n\"A continued rise in obfuscation also further notes the importance of vigilance and ongoing monitoring required by users of these services. And as OSS continues to grow, so too will the attack surface for supply chain threats.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "The AI-Powered Security Shift: What 2025 Is Teaching Us About Cloud Defense",
        "Link": "https://thehackernews.com/2025/08/the-ai-powered-security-shift-what-2025.html",
        "Summary": "Now that we are well into 2025, cloud attacks are evolving faster than ever and artificial intelligence (AI) is both a weapon and a shield. As AI rapidly changes how enterprises innovate, security teams are now tasked with a triple burden:\n\nSecure AI embedded in every part of the business.\nUse AI to defend faster and smarter.\nFight AI-powered threats that execute in minutes—or seconds.\n\nSecurity",
        "Date": "2025-08-07",
        "Content": "Now that we are well into 2025, cloud attacks are evolving faster than ever and artificial intelligence (AI) is both a weapon and a shield. As AI rapidly changes how enterprises innovate, security teams are now tasked with a triple burden:\nSecure AI\nembedded in every part of the business.\nUse AI\nto defend faster and smarter.\nFight AI-powered threats\nthat execute in minutes—or seconds.\nSecurity is no longer about balancing speed and safety. In today's cloud-native world, real-time, context-aware defense is a baseline expectation, not a competitive edge. The recent\nSysdig Cloud Defense Report 2025\nbreaks down this tectonic shift. Below, we unpack its key insights for security practitioners aiming to stay ahead of an accelerating threat landscape.\nAI: The Double-Edged Sword of Cloud Security\nAI is transforming the security paradigm. It's both empowering defenders while creating entirely new attack surfaces.\nAI for Security: Fighting Fire with Fire\nAttackers are automating faster. In campaigns like\nCRYSTALRAY\n, adversaries chain together open-source tools to perform reconnaissance, lateral movement, and credential harvesting. These attacks show a level of coordination and speed that would be impossible without automation. Security teams are responding in kind.\nTools like\nSysdig Sage\n™\n, a fully integrated AI cloud security analyst, are driving mean time to respond down by 76%. More than half of Sysdig customers now use Sysdig Sage, with the software and business services sectors leading adoption.\nKey ways security teams are leveraging AI include:\nContextual enrichment\n: AI quickly correlates related events and aggregates data that makes alerts understandable.\nSummarization and deduplication\n: AI links alerts to previous incidents and helps focus on what's relevant.\nWorkflow automation\n: AI handles repetitive tasks like ticket creation, vulnerability analysis, and escalation logic.\nDecision acceleration\n: By acting as a tier-one analyst, AI allows human defenders to move faster and make informed decisions.\nThe lesson is simple: in a cloud world where attacks happen at machine speed, defense must be equally agile.\nSecurity for AI: Protecting the New Digital Crown Jewels\nBut here's the flip side: AI itself is now a prime target that needs to be protected. The Sysdig Threat Research Team has been identifying and reporting more attacks against LLMs and other AI tools since mid-2024. Sysdig observed a 500% surge in cloud workloads containing AI/ML packages in 2024, indicating massive adoption. However, a recent 25% decline suggests teams are buckling down on security and improving governance.\nRecommendations to secure AI systems include securing APIs by authenticating and restricting access to public endpoints, hardening configurations by disabling open defaults like unauthenticated admin panels, enforcing least privilege to control root access and limit elevated permissions, monitoring for shadow AI through workload audits for unauthorized models and packages, and implementing data guardrails to filter prompts and outputs for sensitive information. The bottom line: AI requires the same level of rigor and protection as any other business-critical system, especially as it becomes deeply embedded across both customer-facing and back-end operations.\nRuntime Security: No Longer Optional, But Foundational\nPrevention may reign supreme, but in today's cloud-native, ephemeral world, runtime visibility is your best shot at catching in motion that slips through the cracks.\nThe Case for Real-Time Threat Detection\nRuntime detection isn't just a defensive layer—it's a strategic necessity in today's cloud-native environments. With 60% of containers living for one minute or less and CI/CD pipelines emerging as high-value targets due to misconfigurations and insecure defaults, the window to detect and respond is incredibly narrow. Cloud attacks now unfold in 10 minutes or less, prompting the creation of the\n555 Cloud Detection and Response Benchmark\n: a framework that guides security teams to detect threats in 5 seconds, investigate in 5 minutes, and respond within the next 5 minutes.\nWhy Runtime Context Matters\nTraditional vulnerability scans bury teams under noise. But less than 6% of high and critical vulnerabilities are active in production. That means the rest are distractions.\nRuntime insights help security teams:\nPrioritize real risks\n: Focus remediation on vulnerabilities loaded into memory.\nReduce noise\n: Cut vulnerability lists by up to 99%.\nCollaborate better\n: Provide developers with clear, contextual remediation steps.\nThe CI/CD Pipeline: A Growing Target\nCI/CD workflows sit at the heart of modern DevOps, enabling rapid, automated delivery. But in 2025, they've also emerged as an attractive and increasingly exploited attack surface. From repository compromises to misconfigured automation, attackers are finding creative ways to infiltrate build systems—often before code even reaches production.\nSeveral high-impact vulnerabilities uncovered this year reveal just how exposed the CI/CD pipeline can be. These incidents serve as a wake-up call: your build system is part of your attack surface—and without real-time visibility, you might not spot an attack until it's too late.\nTools like Falco and Falco Actions are helping defenders stay one step ahead by detecting threats as they execute, not after the damage is done.\nOpen Source: The Heart of Modern Security Innovation\nSecurity has always been about community. Attackers share tools, and defenders must too. Open source tools now power much of the modern cloud defense strategy.\nFalco has evolved from a basic intrusion detection system (IDS) into a powerful real-time detection engine, now supporting eBPF for deeper visibility into cloud-native environments, all with the support of the open source community. It integrates with tools like Falco Actions, Falcosidekick, and Falco Talon to provide broader control, automation, and workflow customization. This makes Falco especially valuable in regulated sectors such as finance, health care, and government, where self-hosted deployments and custom detection rules are critical for compliance and control.\nThe EU Data Act and the Rise of Sovereign Security\nWith regulations like the EU Data Act taking effect in September 2025, organizations are required to control and localize their data. Open source plays a critical role in meeting these requirements by enabling self-hosted deployments, offering transparent codebases for audit and compliance, and fostering community-driven innovation that supports trust and flexibility.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft Discloses Exchange Server Flaw Enabling Silent Cloud Access in Hybrid Setups",
        "Link": "https://thehackernews.com/2025/08/microsoft-discloses-exchange-server.html",
        "Summary": "Microsoft has released an advisory for a high-severity security flaw affecting on-premise versions of Exchange Server that could allow an attacker to gain elevated privileges under certain conditions.\nThe vulnerability, tracked as CVE-2025-53786, carries a CVSS score of 8.0. Dirk-jan Mollema with Outsider Security has been acknowledged for reporting the bug.\n\"In an Exchange hybrid deployment, an",
        "Date": "2025-08-07",
        "Content": "Microsoft has released an advisory for a high-severity security flaw affecting on-premise versions of Exchange Server that could allow an attacker to gain elevated privileges under certain conditions.\nThe vulnerability, tracked as\nCVE-2025-53786\n, carries a CVSS score of 8.0. Dirk-jan Mollema with Outsider Security has been acknowledged for reporting the bug.\n\"In an Exchange hybrid deployment, an attacker who first gains administrative access to an on-premises Exchange server could potentially escalate privileges within the organization's connected cloud environment without leaving easily detectable and auditable traces,\" the tech giant\nsaid\nin the alert.\n\"This risk arises because Exchange Server and Exchange Online share the same service principal in hybrid configurations.\"\nSuccessful exploitation of the flaw could allow an attacker to escalate privileges within the organization's connected cloud environment without leaving easily detectable and auditable traces, the company added. However, the attack hinges on the threat actor already having administrator access to an Exchange Server.\nThe U.S. Cybersecurity and Infrastructure Security Agency (CISA), in a bulletin of its own,\nsaid\nthe vulnerability could impact the identity integrity of an organization's Exchange Online service if left unpatched.\nAs mitigations, customers are recommended to\nreview\nExchange Server security changes for hybrid deployments, install the\nApril 2025 Hot Fix\n(or newer), and follow the\nconfiguration instructions\n.\n\"If you've previously configured Exchange hybrid or\nOAuth authentication between Exchange Server and your Exchange Online organization\nbut no longer use it, make sure to\nreset the service principal's keyCredentials\n,\" Microsoft said.\nIn a\npresentation\nat the Black Hat USA 2025 security conference, Mollema said on-premise versions of Exchange Server have a certificate credential that's used to authenticate to Exchange online and allow OAuth in hybrid scenarios.\nThese certificates can be leveraged to request Service-to-Service (\nS2S\n) actor tokens from Microsoft's Access Control Service (\nACS\n), ultimately providing unfettered access to Exchange Online and SharePoint without any\nConditional Access\nor security checks.\nMore importantly, these tokens can be used to impersonate any hybrid user within the tenant for a 24-hour period when the \"\ntrustedfordelegation\n\" property is set, and leave no logs when they are issued. As mitigations, Microsoft plans to enforce mandatory separation of Exchange on-premises and Exchange Online service principals by October 2025.\nThe development comes as the Windows maker\nsaid\nit will begin temporarily blocking Exchange Web Services (EWS) traffic using the Exchange Online shared service principal starting this month in an effort to increase the customer adoption of the dedicated Exchange hybrid app and improve the security posture of the hybrid environment.\nMicrosoft's advisory for CVE-2025-53786 also coincides with CISA's analysis of various malicious artifacts deployed following the exploitation of\nrecently disclosed SharePoint flaws\n, collectively tracked as ToolShell.\nThis includes two Base64-encoded DLL binaries and four Active Server Page Extended (ASPX) files that are designed to retrieve machine key settings within an ASP.NET application's configuration and act as a web shell to execute commands and upload files.\n\"Cyber threat actors could leverage this malware to steal cryptographic keys and execute a Base64-encoded PowerShell command to fingerprint the host system and exfiltrate data,\" the agency\nsaid\n.\nCISA is also urging entities to disconnect public-facing versions of Exchange Server or SharePoint Server that have reached their end-of-life (EOL) or end-of-service from the internet, not to mention discontinue the use of outdated versions.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "6,500 Axis Servers Expose Remoting Protocol; 4,000 in U.S. Vulnerable to Exploits",
        "Link": "https://thehackernews.com/2025/08/6500-axis-servers-expose-remoting.html",
        "Summary": "Cybersecurity researchers have disclosed multiple security flaws in video surveillance products from Axis Communications that, if successfully exploited, could expose them to takeover attacks.\n\"The attack results in pre-authentication remote code execution on Axis Device Manager, a server used to configure and manage fleets of cameras, and the Axis Camera Station, client software used to view",
        "Date": "2025-08-07",
        "Content": "Cybersecurity researchers have disclosed multiple security flaws in video surveillance products from Axis Communications that, if successfully exploited, could expose them to takeover attacks.\n\"The attack results in pre-authentication remote code execution on Axis Device Manager, a server used to configure and manage fleets of cameras, and the Axis Camera Station, client software used to view camera feeds,\" Claroty researcher Noam Moshe\nsaid\n.\n\"Furthermore, using internet scans of exposed Axis.Remoting services, an attacker can enumerate vulnerable servers and clients, and carry out granular, highly targeted attacks.\"\nThe list of identified flaws is below -\nCVE-2025-30023\n(CVSS score: 9.0) - A flaw in the communication protocol used between client and server that could lead to an authenticated user performing a remote code execution attack (Fixed in Camera Station Pro 6.9, Camera Station 5.58, and Device Manager 5.32)\nCVE-2025-30024\n(CVSS score: 6.8) - A flaw in the communication protocol used between client and server that could be leveraged to execute an adversary-in-the-middle (AitM) attack (Fixed in Device Manager 5.32)\nCVE-2025-30025\n(CVSS score: 4.8) - A flaw in the communication protocol used between the server process and the service control that could lead to a local privilege escalation (Fixed in Camera Station Pro 6.8 and Device Manager 5.32)\nCVE-2025-30026\n(CVSS score: 5.3) - A flaw in the Axis Camera Station Server that could lead to an authentication bypass (Fixed in Camera Station Pro 6.9 and Camera Station 5.58)\nSuccessful exploitation of the aforementioned vulnerabilities could allow an attacker to assume an AitM position between the Camera Station and its clients, effectively making it possible to alter requests/responses and execute arbitrary actions on either the server or client systems. There is\nno evidence\nthat the issues have been exploited in the wild.\nClaroty said it found more than 6,500 servers that expose the proprietary Axis.Remoting protocol and its services over the internet, out of which nearly 4,000 of them are located in the U.S.\n\"Successful exploits give attackers system-level access on the internal network and the ability to control each of the cameras within a specific deployment,\" Moshe noted. \"Feeds can be hijacked, watched, and/or shut down. Attackers can exploit these security issues to bypass authentication to the cameras and gain pre-authentication remote code execution on the devices.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "SonicWall Confirms Patched Vulnerability Behind Recent VPN Attacks, Not a Zero-Day",
        "Link": "https://thehackernews.com/2025/08/sonicwall-confirms-patched.html",
        "Summary": "SonicWall has revealed that the recent spike in activity targeting its Gen 7 and newer firewalls with SSL VPN enabled is related to an older, now-patched bug and password reuse.\n\"We now have high confidence that the recent SSL VPN activity is not connected to a zero-day vulnerability,\" the company said. \"Instead, there is a significant correlation with threat activity related to CVE-2024-40766.\"",
        "Date": "2025-08-07",
        "Content": "Error fetching article: ('Connection aborted.', ConnectionResetError(104, 'Connection reset by peer'))"
    },
    {
        "Title": "Fake WhatsApp developer libraries hide destructive data-wiping code",
        "Link": "https://www.bleepingcomputer.com/news/security/fake-whatsapp-developer-libraries-hide-destructive-data-wiping-code/",
        "Summary": "Two malicious NPM packages posing as WhatsApp development tools have been discovered deploying destructive data-wiping code that recursively deletes files on a developer's computers. [...]",
        "Date": "2025-08-07",
        "Content": "Two malicious NPM packages posing as WhatsApp development tools have been discovered deploying destructive data-wiping code that recursively deletes files on a developer's computers.\nTwo malicious NPM packages currently available in the registry target WhatsApp developers with destructive data-wiping code.\nThe packages,\ndiscovered by researchers at Socket\n, masquerade as WhatsApp socket libraries and were downloaded over 1,100 times since their publication last month.\nDespite Socket having filed takedown requests and flagging the publisher, nayflore, both remain available at the time of writing.\nThe names of the two malicious packages are\nnaya-flore\nand\nnvlore-hsc\n, though the same publisher has submitted more on NPM, like nouku-search, very-nay, naya-clone, node-smsk, and @veryflore/disc.\nAlthough these additional five packages are not currently malicious, extreme caution is advised, as an update pushed at any time could inject dangerous code.\nAll these packages mimic legitimate WhatsApp developer libraries used for building bots and automation tools around the WhatsApp Business API.\nSocket notes that these libraries have recently experienced a significant surge in demand, as more businesses utilize WhatsApp's Cloud API for customer communication.\nWiper code\nBoth naya-flore and nvlore-hs contain a function called 'requestPairingCode,' that is supposed to handle WhatsApp pairing, but which retrieves a base64 JSON file from a GitHub address.\nThe JSON file contains a list of Indonesian phone numbers that act as a kill switch, excluding owners of these numbers from the malicious functionality.\nFor the rest (valid targets), the code executes the 'rm -rf *' command, which deletes all files recursively in the current directory, effectively wiping code from the developer's system.\nThe data wiping code\nSource: Socket\nSocket also discovered a dormant data exfiltration function ('generateCreeds'), which could exfiltrate the victim's phone number, device ID, status, and hardcoded key. This function is present but commented out in both packages, so it's disabled.\nThe currently disabled data exfiltration function\nSource: Socket\nGo ecosystem hit too\nIn parallel news, Socket also\ndiscovered 11 malicious Go packages\nthat use string-array obfuscation to silently execute remote payloads at runtime.\nThese packages spawn a shell, fetch a second-stage script or executable from .icu or .tech domains, and run it in memory, targeting both Linux CI servers and Windows workstations.\nThe majority of the packages are typosquats, meaning they bet on developer mis-types and confusion to trick them into downloading them.\nSearch results containing links to a malicious package\nSource: Socket\nThe malicious packages and their locations are listed below:\ngithub.com/stripedconsu/linker\ngithub.com/agitatedleopa/stm\ngithub.com/expertsandba/opt\ngithub.com/wetteepee/hcloud-ip-floater\ngithub.com/weightycine/replika\ngithub.com/ordinarymea/tnsr_ids\ngithub.com/ordinarymea/TNSR_IDS\ngithub.com/cavernouskina/mcp-go\ngithub.com/lastnymph/gouid\ngithub.com/sinfulsky/gouid\ngithub.com/briefinitia/gouid\nMost of them are still live, so Go developers are advised to be very cautious and double-check their building blocks before using them in their environments.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nHackers breach Toptal GitHub account, publish malicious npm packages\nNorth Korean XORIndex malware hidden in 67 malicious npm packages\nMalware found in NPM packages with 1 million weekly downloads\nNPM package ‘is’ with 2.8M weekly downloads infected devs with malware\nPopular npm linter packages hijacked via phishing to drop malware"
    },
    {
        "Title": "CISA orders fed agencies to patch new Exchange flaw by Monday",
        "Link": "https://www.bleepingcomputer.com/news/security/cisa-orders-fed-agencies-to-patch-new-cve-2025-53786-exchange-flaw/",
        "Summary": "CISA has issued an emergency directive ordering all Federal Civilian Executive Branch (FCEB) agencies to mitigate a critical Microsoft Exchange hybrid vulnerability tracked as CVE-2025-53786 by Monday morning at 9:00 AM ET. [...]",
        "Date": "2025-08-07",
        "Content": "CISA has issued an emergency directive ordering all Federal Civilian Executive Branch (FCEB) agencies to mitigate a critical Microsoft Exchange hybrid vulnerability tracked as CVE-2025-53786 by Monday morning at 9:00 AM ET.\nFederal Civilian Executive Branch (FCEB) agencies are non-military agencies within the US executive branch, including the Department of Homeland Security, Department of the Treasury, Department of Energy, and Department of Health and Human Services.\nThe flaw tracked as\nCVE-2025-53786\nallows attackers who gain administrative access to on-premises Exchange servers to move laterally into Microsoft cloud environments, potentially leading to complete domain compromise.\nThe vulnerability impacts Microsoft Exchange Server 2016, 2019, and the Subscription Edition.\nIn hybrid configurations, Exchange Online and on-premises servers share the same service principal, which is a shared trust relationship used to authenticate with each other.\nAn attacker with admin privileges on an on-premise Exchange server can potentially forge or manipulate trusted tokens or API calls that the cloud side will accept as legitimate. This technique allows the attackers to spread laterally from the local network into the company's cloud environment, potentially compromising the company's entire active directory and infrastructure.\nTo make matters worse, Microsoft says cloud-based logging tools like Microsoft Purview may not log malicious activity if it originates from on-prem Exchange, making it hard to detect exploitation.\nThis flaw comes after Microsoft\nreleased guidance\nand an\nExchange server hotfix\nin April 2025 to support a new architecture that uses a dedicated hybrid application, rather than the shared one, as part of its Secure Future Initiative.\nYesterday, security researcher\nDirk-Jan Mollema\nof Outsider Security demonstrated how this shared service principal could be exploited in a post-exploitation attack during a\nBlack Hat presentation\n.\nThe researcher told BleepingComputer that he reported the flaw three weeks before the talk, to give Microsoft advance warning. In coordination with the presentation, Microsoft issued the CVE-2025-53786 CVE and guidance on how to mitigate it.\n\"I did not originally consider this a vulnerability because the protocol that is used for these attacks was designed with the features covered during the talk, and is just in general lacking important security controls,\" Mollema told BleepingComputer.\n\"The report describing the possibilities for attackers was sent as a heads up to the MSRC 3 weeks before Black Hat and the disclosure was coordinated with them. Aside from this guidance Microsoft also mitigated an attack path that could lead to full tenant compromise (Global Admin) from on-prem Exchange.\"\nThe good news is that Microsoft Exchange customers who previously implemented the hotfix and the April guidance are already protected from this new post-exploitation attack.\nHowever, those who have not implemented the mitigations are still impacted and should install the hotfix and follow Microsoft's instructions (\ndoc 1\nand\ndoc 2\n) on deploying the dedicated Exchange hybrid app.\n\"Only applying the hotfix is not sufficient in this case, there are manual follow-up actions required to migrate to a dedicated service principal,\" explained Mollema.\n\"The urgency from a security point of view depends on how much admins consider isolation between on-prem Exchange resources and cloud-hosted resources important. In the old setup, Exchange hybrid has full access to all resources in Exchange online and in SharePoint.\"\nMollema also reiterated that his technique is a post-exploitation attack, meaning an attacker already has to have compromised the on-premises environment or the Exchange servers, and in this case, have administrator privileges.\nAccording to CISA's\nEmergency Directive 25-02\n, federal agencies must now mitigate the attack by first taking an inventory of their Exchange environments using\nMicrosoft's Health Checker script\n. Any servers that are no longer supported by the April 2025 hotfix, such as end-of-life Exchange versions, must be disconnected.\nAll remaining servers must be updated to the latest cumulative updates (CU14 or CU15 for Exchange 2019, and CU23 for Exchange 2016) and patched with the April hotfix. Afterward, administrators must run Microsoft's\nConfigureExchangeHybridApplication.ps1\nPowerShell script to switch from the shared to the dedicated service principal in Entra ID.\nCISA warns that failing to implement these mitigations could result in hybrid environments being completely compromised.\nAgencies must complete the technical remediation steps by Monday morning and submit a report to CISA by 5:00 PM the same day.\nWhile non-government organizations are not required to take action under this directive, CISA urges all organizations to mitigate the attack.\n\"The risks associated with this Microsoft Exchange vulnerability extend to every organization and sector using this environment,\" said CISA Acting Director Madhu Gottumukkala.\n\"While federal agencies are mandated, we strongly urge all organizations to adopt the actions in this Emergency Directive.\"\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft warns of high-severity flaw in hybrid Exchange deployments\nCritical SonicWall SSLVPN bug exploited in ransomware attacks\nCISA open-sources Thorium platform for malware, forensic analysis\nCISA flags PaperCut RCE bug as exploited in attacks, patch now\nCISA warns of hackers exploiting SysAid vulnerabilities in attacks"
    },
    {
        "Title": "ChatGPT's GPT-5 models released: everything you need to know",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpts-gpt-5-models-released-everything-you-need-to-know/",
        "Summary": "After a long wait, GPT-5 is finally rolling out. It's available for free, Plus, Pro and Team users today. This means everyone gets to try GPT-5 today, but paid users get higher limits. [...]",
        "Date": "2025-08-07",
        "Content": "After a long wait, GPT-5 is finally rolling out. It's available for free, Plus, Pro and Team users today.\nThis means everyone gets to try GPT-5 today, but paid users get higher limits.\nIn a blog post, OpenAI\nsays\nGPT-5 is a big leap compared to previous models.\nOpenAI added that GPT-5 is the best coding model, and early benchmarks suggest it beats Opus 4.1 from Claude by a small margin, but real-life benchmarks are awaited.\nUnlike previous models, GPT-5 has built-in reasoning. It is a unified model that brings the best of the two worlds. It knows when to respond quickly and when to rely on its 'reasoning' or 'think longer' capability.\n\"One unified system GPT‑5 is a unified system with a smart, efficient model that answers most questions, a deeper reasoning model (GPT‑5 thinking) for harder problems.\" OpenAI noted.\nAs BleepingComputer previously reported, GPT-5 relies on a concept called router, which quickly decides which feature to use based on conversation type, complexity, tool needs, and your explicit intent.\n\"For example, if you say “think hard about this” in the prompt, the router is continuously trained on real signals, including when users switch models, preference rates for responses, and measured correctness, improving over time,\" OpenAI noted.\nGPT-5 is rolling out, so it may not show up immediately, but if you can't wait, you can also use it in Copilot.\nCopilot provides free access to GPT-5 with reasoning.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft accidentally confirms GPT-5, GPT-5-Mini, GPT-5-Nano ahead of launch\nOpenAI prepares new open weight models along with GPT-5\nOpenAI may be testing a cheaper paid plan for ChatGPT\nOpenAI prepares GPT-5 for roll out\nOpenAI confirms ChatGPT Agent is now rolling out for $20 Plus users"
    },
    {
        "Title": "New EDR killer tool used by eight different ransomware groups",
        "Link": "https://www.bleepingcomputer.com/news/security/new-edr-killer-tool-used-by-eight-different-ransomware-groups/",
        "Summary": "A new Endpoint Detection and Response (EDR) killer that is considered to be the evolution of 'EDRKillShifter,' developed by RansomHub, has been observed in attacks by eight different ransomware gangs. [...]",
        "Date": "2025-08-07",
        "Content": "A new Endpoint Detection and Response (EDR) killer that is considered to be the evolution of 'EDRKillShifter,' developed by RansomHub, has been observed in attacks by eight different ransomware gangs.\nSuch tools help ransomware operators turn off security products on breached systems so they can deploy payloads, escalate privileges, attempt lateral movement, and ultimately encrypt devices on the network without being detected.\nAccording to Sophos security researchers, the new tool, which wasn't given a specific name, is used by RansomHub, Blacksuit, Medusa, Qilin, Dragonforce, Crytox, Lynx, and INC.\nThe new EDR killer tool uses a heavily obfuscated binary that is self-decoded at runtime and injected into legitimate applications.\nThe tool searches for a digitally signed (stolen or expired certificate) driver with a random five-character name, which is hardcoded into the executable.\nStolen and expired certificate used by the malicious driver\nSource: Sophos\nIf found, the malicious driver is loaded into the kernel, as required to perform a 'bring your own vulnerable driver' (BYOVD) attack and achieve kernel privileges required to turn off security products.\nThe driver masquerades as a legitimate file such as the CrowdStrike Falcon Sensor Driver, but once active, it kills AV/EDR-related processes and stops services associated with security tools.\nThe targeted vendors include Sophos, Microsoft Defender, Kaspersky, Symantec, Trend Micro, SentinelOne, Cylance, McAfee, F-Secure, HitmanPro, and Webroot.\nAlthough variants of the new EDR killer tool differ in driver names, targeted AVs, and build characteristics, they all use HeartCrypt for packing, and evidence suggests knowledge and tool sharing among even competing threat groups.\nSophos specifically notes that it's unlikely the tool was leaked and then reused by other threat actors, but is rather developed via a shared and collaborative framework.\n\"To be clear, it's not that a single binary of the EDR killer leaked out and was shared between threat actors. Instead, each attack used a different build of the proprietary tool,\"\nexplained Sophos\n.\nThis tactic of tool sharing, especially in what concerns EDR killers, is common in the ransomware space.\nApart from\nEDRKillShifter\n, Sophos also discovered another tool called\nAuKill\n, which Medusa Locker and LockBit used in attacks.\nSentinelOne also reported last year about FIN7 hackers selling their custom \"\nAvNeutralizer\n\" tool to multiple ransomware gangs, including BlackBasta, AvosLocker, MedusaLocker, BlackCat, Trigona, and LockBit.\nThe complete indicators of compromise associated with this new EDR killer tool are\navailable on this GitHub repository\n.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nSonicWall finds no SSLVPN zero-day, links ransomware attacks to 2024 flaw\nCritical SonicWall SSLVPN bug exploited in ransomware attacks\nAkira ransomware abuses CPU tuning tool to disable Microsoft Defender\nNew Ghost Calls tactic abuses Zoom and Microsoft Teams for C2 operations\nSonicWall urges admins to disable SSLVPN amid rising attacks"
    },
    {
        "Title": "Bouygues Telecom confirms data breach impacting 6.4 million customers",
        "Link": "https://www.bleepingcomputer.com/news/security/bouygues-telecom-confirms-data-breach-impacting-64-million-customers/",
        "Summary": "Bouygues Telecom warns it suffered a data breach after the personal information of 6.4 million customers was exposed in a cyberattack. [...]",
        "Date": "2025-08-07",
        "Content": "Bouygues Telecom warns it suffered a data breach after the personal information of 6.4 million customers was exposed in a cyberattack.\nThe company is one of the largest telecommunication service providers in France, offering mobile, internet, and IPTV services. Bouygues Telecom has 14.5 million mobile subscribers, 9,000 employees, and an annual revenue of\n€56.8 billion\n($66B).\nBouygues Telecom confirmed in a\nFAQ\nand a press statement that the attack occurred last Sunday, August 4, 2025.\nAlthough Bouygues Telecom says that there has been no impact observed on customer services or networks, the personal data of 6.4 million customers was compromised.\n\"Bouygues Telecom was the victim of a cyberattack that allowed unauthorized access to certain personal data from 6.4 million customer account,\" reads the translated\npress statement\n.\n\"The situation was resolved as quickly as possible by Bouygues Telecom's technical teams, and all necessary additional measures have been implemented.\"\nA previous statement says that internal investigations confirmed that the attack was orchestrated by a 'known cybercriminal group' that targeted 'specific internal resources.'\nThe firm informed the French National Cybersecurity Agency (ANSSI) and the CNIL (French data protection authority) accordingly, noting that the perpetrator could face up to 5 years of imprisonment and a €150,000 fine for this attack.\nAccording to the FAQ, the following customer information was stolen:\nContact details\nContract information\nCivil status data\nCompany details (for business customers)\nInternational Bank Account Numbers (IBANs)\nImportantly, the company said that no credit card numbers or Bouygues Telecom account passwords were compromised.\nThe company has now blocked the attacker's access to its network, increased monitoring, and implemented additional security measures.\nCustomers are being informed of the breach directly via SMS and email, but the situation has exposed them to fraud and phishing risks.\nBouygues Telecom urges its customers not to give away sensitive information like their login credentials to people calling them and mentioning their name and account number to gain their trust.\nAlthough the leaked IBANs are not enough for initial transfers, impacted individuals are still advised to regularly check their debits and contact their bank immediately if they notice suspicious activity.\nJust last week, another French telecommunications giant, Orange,\ndisclosed a similar network breach\nthat occurred on July 25, 2025.\nInvestigations to determine whether customer data was stolen are still ongoing, and the company has not published an update on this.\nThese incidents targeting European telecom providers echo similar attacks against U.S.-based telcos, attributed to Chinese cyber-espionage agents of the\nSalt Typhoon\nhacking group.\nBleepingComputer contacted Bouygues Teleco with questions about the attack and will update the story if we receive a response.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nAir France and KLM disclose data breaches impacting customers\nCisco discloses data breach impacting Cisco.com user accounts\nGoogle suffers data breach in ongoing Salesforce data theft attacks\nPandora confirms data breach amid ongoing Salesforce data theft attacks\nPBS confirms data breach after employee info leaked on Discord servers"
    },
    {
        "Title": "SonicWall finds no SSLVPN zero-day, links ransomware attacks to 2024 flaw",
        "Link": "https://www.bleepingcomputer.com/news/security/sonicwall-finds-no-sslvpn-zero-day-links-ransomware-attacks-to-2024-flaw/",
        "Summary": "SonicWall says that recent Akira ransomware attacks exploiting Gen 7 firewalls with SSLVPN enabled are exploiting an older vulnerability rather than a zero-day flaw. [...]",
        "Date": "2025-08-07",
        "Content": "SonicWall says that recent Akira ransomware attacks exploiting Gen 7 firewalls with SSLVPN enabled are exploiting an older vulnerability rather than a zero-day flaw.\nThe company says that the attackers are targeting CVE-2024-40766, an unauthorized access flaw fixed in August 2024.\n\"We now have high confidence that the recent SSLVPN activity is not connected to a zero-day vulnerability,\" reads the update on the SonicWall bulletin published this week.\n\"Instead, there is a significant correlation with threat activity related to CVE-2024-40766, which was previously disclosed and documented in our public advisory\nSNWLID-2024-0015\n.\"\nCVE‑2024‑40766 is a critical\nSSLVPN access control flaw\nin SonicOS, allowing unauthorized access to vulnerable endpoints, enabling attackers to hijack sessions or gain VPN access in protected environments.\nThe flaw was\nexploited extensively\nfollowing its disclosure roughly a year ago, including by\nAkira\nand\nFog ransomware\noperators who leveraged it to breach corporate networks.\nOn Friday, Arctic Wolf Labs first hinted at the potential existence of a zero-day vulnerability in SonicWall Gen 7 firewalls, after noticing Akira ransomware attack patterns that supported this assumption.\nSonicWall quickly confirmed that it is aware of an ongoing campaign, and\nadvised customers\nto turn off SSL VPN services and limit connectivity to trusted IP addresses until the situation clears up.\nFollowing internal investigations on 40 incidents, the vendor now disputes the possibility of attackers exploiting a zero-day vulnerability in its products.\nInstead, SonicWall says the Akira attacks are targeting endpoints that did not follow the recommended course of action for mitigating CVE-2024-40766 when migrating from Gen 6 to Gen 7 firewalls.\n\"Many of the incidents relate to migrations from Gen 6 to Gen 7 firewalls, where local user passwords were carried over during the migration and not reset,\"\nexplains SonicWall\n.\n\"Resetting passwords was a critical step outlined in the original advisory.\"\nThe recommended action now is to update firmware to version 7.3.0 or later, which has stronger brute-force and MFA protections, and reset all local user passwords, especially those used for SSLVPN.\nAs SonicWall also emailed customers this latest update, many\ntook to Reddit\nto express their doubts about the accuracy of the vendor's claims, saying that not everything in it checks out with their own experience.\nSome\nnoted\nthat they had breaches on accounts that didn't exist before migrating to Gen 7 firewalls, and even claimed that SonicWall declined to examine their logs.\nThese contradicting reports, combined with the ambiguous wording SonicWall used in its update, leave room for uncertainty, so vigilance and immediate application of the recommended measures remain crucial.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nCritical SonicWall SSLVPN bug exploited in ransomware attacks\nSonicWall urges admins to disable SSLVPN amid rising attacks\nAkira ransomware abuses CPU tuning tool to disable Microsoft Defender\nSonicWall firewall devices hit in surge of Akira ransomware attacks\nSonicWall SSLVPN access control flaw is now exploited in attacks"
    },
    {
        "Title": "Wave of 150 crypto-draining extensions hits Firefox add-on store",
        "Link": "https://www.bleepingcomputer.com/news/security/wave-of-150-crypto-draining-extensions-hits-firefox-add-on-store/",
        "Summary": "A malicious campaign dubbed 'GreedyBear' has snuck onto the Mozilla add-ons store, targeting Firefox users with 150 malicious extensions and stealing an estimated $1,000,000 from unsuspecting victims. [...]",
        "Date": "2025-08-07",
        "Content": "A malicious campaign dubbed 'GreedyBear' has snuck onto the Mozilla add-ons store, targeting Firefox users with 150 malicious extensions and stealing an estimated $1,000,000 from unsuspecting victims.\nThe campaign, discovered and documented by Koi Security, impersonates cryptocurrency wallet extensions from well-known platforms such as MetaMask, TronLink, and Rabby.\nThese extensions are uploaded in a benign form initially, to be accepted by Firefox, and accumulate fake positive reviews.\nAt a later phase, the publishers strip out the original branding and replace it with new names and logos while also injecting malicious code to steal users' wallet credentials and IP addresses.\nAdd-on before it turns malicious\nSource: Koi Security\nThe malicious code acts as a keylogger, capturing input from form fields or within displayed popups, which are then sent to the attacker's server.\n\"The weaponized extensions captures wallet credentials directly from user input fields within the extension’s own popup interface, and exfiltrate them to a remote server controlled by the group,\"\nexplains Koi Security's Tuval Admoni\n.\n\"During initialization, they also transmit the victim’s external IP address, likely for tracking or targeting purposes.\"\nThe crypto-draining operation is complemented by dozens of Russian-speaking pirated software websites that facilitate the distribution of 500 distinct malware executables, and also a network of websites impersonating Trezor, Jupiter Wallet, and fake wallet repair services.\nIn the cases of malware, the payloads include generic trojans, info-stealers (LummaStealer), or even ransomware.\nAll of these sites are linked to the same IP address, 185.208.156.66, which serves as a command-and-control (C2) hub for the GreedyBear operation\nFake Jupiter Wallet site\nSource: Koi Security\nKoi Security reported its findings to Mozilla, and the offending extensions have been removed from Firefox's add-ons store.\nHowever, its wide scale and apparent ease in execution are a demonstration of how AI can help cybercriminals create large-scale schemes and quickly recover from total takedowns.\n\"Our analysis of the campaign's code shows clear signs of AI-generated artifacts,\" explains the report.\n\"This makes it faster and easier than ever for attackers to scale operations, diversify payloads, and evade detection.\"\nThe previous large-scale attack on the Firefox store\noccurred last month\n, involving over 40 fake extensions pretending to be wallets from Coinbase, MetaMask, Trust Wallet, Phantom, Exodus, OKX, Keplr, and MyMonero.\nIt's notable that these fraudulent extensions still find their way into the Firefox store despite Mozilla having\ndeployed a system\nin June 2025 to detect crypto-drainer add-ons.\nKoi Security also reports seeing signs that the operators of GreedyBear are exploring expansion to the Chrome Web Store, as they already spotted a malicious Chrome extension named \"Filecoin Wallet\" that uses the same data-theft logic and communicates with the same IP address.\nTo minimize the risk from these threats, always read multiple user reviews and check extension and publisher details before installing add-ons on your browser.\nYou can find the official wallet extensions on the websites of the projects themselves, either hosted directly or linking to the legitimate add-on on online stores.\nBleepingComputer contacted Mozilla and Google about this campaign and their efforts to protect users, and will update this article with any responses.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nDozens of fake wallet add-ons flood Firefox store to drain crypto\nMalicious VSCode extension in Cursor IDE led to $500K crypto theft\nCryptomixer founders pled guilty to laundering money for cybercriminals\nCTM360 spots Malicious ‘FraudOnTok’ Campaign Targeting TikTok Shop users\nMozilla warns of phishing attacks targeting add-on developers"
    },
    {
        "Title": "Cryptomixer founders pled guilty to laundering money for cybercriminals",
        "Link": "https://www.bleepingcomputer.com/news/security/samourai-cryptomixer-founders-pled-guilty-to-laundering-money-for-cybercriminals/",
        "Summary": "The founders of the Samourai Wallet (Samourai) cryptocurrency mixer have pleaded guilty to laundering over $200 million for criminals. [...]",
        "Date": "2025-08-07",
        "Content": "The founders of the Samourai Wallet (Samourai) cryptocurrency mixer have pleaded guilty to laundering over $200 million for criminals.\n​Samourai CEO Keonne Rodriguez and CTO William Lonergan Hill\nadmitted to their involvement\nin the Samourai money laundering operation, pleading guilty to conspiracy for operating a money transmitting business that handled criminal proceeds, and are now facing a maximum sentence of five years in prison.\nAs part of their plea agreements, Rodriguez and Hill have also agreed to forfeit $237,832,360.55.\nThe two defendants were arrested in April 2024 and\ncharged by the U.S. Department of Justice\nwith two counts of conspiracy: operating an unlicensed money-transmitting business (with a maximum sentence of 5 years) and money laundering (with a maximum sentence of 20 years).\nThe day they were apprehended, Icelandic law enforcement also seized Samourai's domains (samouraiwallet[.]com and samourai[.]io) and servers, while Google removed the Android mobile app from the Play Store after being served a seizure warrant.\nWhile this operation was active, the Samourai Wallet mobile application was downloaded over 100,000 times, enabling users to conduct anonymous financial transactions.\nSamourai seizure banner (DOJ)\nAccording to\ncourt documents\n, Rodriguez and Hill have also promoted Samourai as a tool for concealing illicit proceeds, clearly acknowledging its potential for illegal use. In one instance, Rodriguez referred to \"mixing\" as \"money laundering for bitcoin\" in a WhatsApp exchange.\nHill also advertised Samourai on a dark web forum as a way to make Bitcoin \"untraceable\" and for \"cleaning dirty BTC,\" acknowledging that the service's clients included dark and grey market participants.\nIn mid-2020, Rodriguez and Hill also tracked proceeds from a major hack and urged the hackers to use Samourai's Whirlpool service rather than report the crime to the authorities. When the hackers chose a different service, both expressed disappointment on social media.\nBetween 2015 and February 2024, criminals used Samourai's Whirlpool Bitcoin mixing service to process over 80,000 Bitcoins (valued at more than $2 billion) in illicit funds from cyber intrusions, illegal dark web markets, a spear phishing scheme, and schemes to defraud decentralized finance protocols.\nIn addition to its crypto mixing services, Samourai also offered \"Ricochet,\" a service that allowed users to send cryptocurrency through unnecessary intermediate transactions and thwart law enforcement and crypto exchange efforts to track funds sourced from criminal activities.\nThe two money laundering services allegedly generated over $6 million in fees from Whirlpool and Ricochet transactions for the two founders.\n\"The defendants created and operated a cryptocurrency mixing service that they knew enabled criminals to wash millions in dirty money, including proceeds from cryptocurrency thefts, drug trafficking operations, and fraud schemes,\"\nsaid\nAttorney for the United States Nicolas Roos in a Wednesday press release.\n\"Rodriguez and Hill admitted to operating a money transmitting business that transmitted crime proceeds, essentially 'washing' more than $200 million in 'dirty' money for criminals. They did not just facilitate this illicit movement of money, but also encouraged it,\" added IRS-CI Special Agent Harry T. Chavis, Jr.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nWave of 150 crypto-draining extensions hits Firefox add-on store\nCTM360 spots Malicious ‘FraudOnTok’ Campaign Targeting TikTok Shop users\nFBI seizes $2.4M in Bitcoin from new Chaos ransomware operation\nNew Koske Linux malware hides in cute panda images\nHacker steals $27 million in BigONE exchange crypto breach"
    },
    {
        "Title": "Massive IPTV piracy service with 28,000 channels taken offline",
        "Link": "https://www.bleepingcomputer.com/news/technology/massive-illegal-iptv-service-provider-rare-breed-tv-taken-offline/",
        "Summary": "The Alliance for Creativity and Entertainment (ACE) announced the shutdown of Rare Breed TV, a major illegal IPTV service provider, after reaching a financial settlement with its operators. [...]",
        "Date": "2025-08-07",
        "Content": "The Alliance for Creativity and Entertainment (ACE) announced the shutdown of Rare Breed TV, a major illegal IPTV service provider, after reaching a financial settlement with its operators.\nNorth Carolina-based Rare Breed TV was one of the world's largest digital piracy operations, claiming to offer subscribers access to over 28,000 channels and more than 100,000 movies and series.\n\"As part of the agreement, the operators will permanently shut down their illegal service and pay a significant financial settlement. Rare Breed IPTV was an unauthorized streaming platform that operated for years, offering thousands of live television channels and a video-on-demand library featuring more than 14,000 titles—all without the consent of the copyright holders,\"\nACE said\non Wednesday.\n\"With support from its member studios, ACE identified the individuals behind Rare Breed and contacted them in North Carolina. Following ACE's enforcement efforts, the operators agreed to cease their infringing activities, pay financial compensation, and fully cooperate with ACE going forward.\"\nHowever, while ACE says the pirate service operators agreed to shut down their illegal IPTV platform, the Rare Breed TV website was still online when this story was published, offering subscriptions ranging from $15.99/ month to $79.99 for a full year.\nAn ACE spokesperson was not immediately available for comment when contacted by BleepingComputer earlier today.\nRare Breed TV website (BleepingComputer)\n​ACE is a coalition of over 50 media and entertainment companies worldwide, including the world's largest film studios and television networks, focused on shutting down illegal streaming services.\nIt also collaborates with law enforcement organizations, including the U.S. Department of Justice, Europol, and Interpol, to target large-scale illegal streaming networks.\nThe coalition's governing board includes companies such as Amazon, Apple TV+, Universal Studios, The Walt Disney Studios, Netflix, Paramount Global, Sony Pictures, and Warner Bros. Discovery.\nSince its establishment in\nJune 2017\n, ACE has successfully taken down numerous piracy platforms, including the streaming providers\nOpenload and Streamango\n, the pirate IPTV service\nBeast IPTV\n, the\n123movies.la\nstreaming site, and the world's largest anime piracy site,\nZoro.to\n.\nLast year, it also helped sentence\nfive men linked to the Jetflicks illegal streaming service\n,\nshutter a pirate TV streaming network\nthat made millions of dollars since its launch in 2015,\ndismantle a pirate streaming service\nwith over 22 million users and making over €250 million ($263M) each month, and\ntake down Markkystreams\n, one of the largest live sports streaming piracy rings, with over 821 million yearly visits.\n\"This enforcement action sends a strong message to piracy operators worldwide,\" added Larissa Knapp, Executive Vice President at the Motion Picture Association (MPA), on Wednesday. \"Operating an illegal streaming service comes with serious consequences—including lawsuits, substantial financial penalties, and permanent shutdown.\"\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nOperator of Jetflicks illegal streaming service gets 7 years in prison"
    },
    {
        "Title": "Air France and KLM disclose data breaches impacting customers",
        "Link": "https://www.bleepingcomputer.com/news/security/air-france-and-klm-disclose-data-breaches-impacting-customers/",
        "Summary": "Air France and KLM announced on Wednesday that attackers had breached a customer service platform and stolen the data of an undisclosed number of customers. [...]",
        "Date": "2025-08-07",
        "Content": "Air France and KLM announced on Wednesday that attackers had breached a customer service platform and stolen the data of an undisclosed number of customers.\nTogether with Transavia, Air France and KLM are part of Air France–KLM Group, a French-Dutch multinational airline holding company founded in 2004 and a major player in international air transport.\nWith a fleet of 564 aircraft and 78,000 employees, Air France-KLM provides services to up to 300 destinations in 90 countries. In 2024, the aviation group transported 98 million passengers worldwide.\nThe two airlines stated that they've cut off the attackers' access to the compromised systems after discovering the breach and added that their networks were not affected by the attack.\n\"Air France and KLM have detected unusual activity on an external platform we use for customer service. This activity resulted in unauthorized access to customer data,\"\nthey said.\n\"Our IT security teams, along with the relevant external party, took immediate action to stop the unauthorized access. Measures have also been implemented to prevent recurrence. Internal Air France and KLM systems were not affected.\"\nWhile the attackers gained access to customer data, such as names, email addreses, phone numbers, rewards program information, and latest transactions, Air France and KLM said that the customers' financial and personal information was not affected.\nThe airlines have also notified relevant authorities in their countries of the incident and are now also alerting impacted individuals that their data was stolen.\n\"KLM has reported the incident to the Dutch Data Protection Authority; Air France has done so in France with the CNIL,\" they added. \"Customers whose data may have been accessed are currently being informed and advised to be extra vigilant for suspicious emails or phone calls.\"\nSalesforce data theft attacks\nBleepingComputer has learned that this incident is\npart of a wave\nof data breaches\nlinked to the ShinyHunters extortion group\n, which targets Salesforce instances in vishing and social engineering attacks.\nMultiple other high-profile companies, including\nAdidas\n,\nQantas\n,\nAllianz Life\n,\nLouis Vuitton\n,\nDior\n,\nTiffany & Co.\n,\nChanel\n, and, most recently,\nGoogle\n, were also recently breached in this campaign.\nAn Air France–KLM spokesperson stated that the company would not provide additional information due to an ongoing investigation when asked by BleepingComputer to confirm whether the data was stolen from a compromised Salesforce instance and disclose the number of individuals affected.\nThe Air France–KLM incident also comes on the heels of other aviation breaches linked to the Scattered Spider hacker collective, which has shifted its focus\nto aviation and transportation firms\nin recent months, breaching\nWestJet\nand\nHawaiian Airlines\nafter previously targeting the\ninsurance\nand\nretail\nsectors.\nUpdate August 07, 08:00 EDT:\nAdded Air France–KLM statement.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nRussian airline Aeroflot grounds dozens of flights after cyberattack\nQantas discloses cyberattack amid Scattered Spider aviation breaches\nBouygues Telecom confirms data breach impacting 6.4 million customers\nCisco discloses data breach impacting Cisco.com user accounts\nGoogle suffers data breach in ongoing Salesforce data theft attacks"
    },
    {
        "Title": "Microsoft warns of high-severity flaw in hybrid Exchange deployments",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-warns-of-high-severity-flaw-in-hybrid-exchange-deployments/",
        "Summary": "Microsoft has warned customers to mitigate a high-severity vulnerability in Exchange Server hybrid deployments that could allow attackers to escalate privileges in Exchange Online cloud environments undetected. [...]",
        "Date": "2025-08-07",
        "Content": "Microsoft has warned customers to mitigate a high-severity vulnerability in Exchange Server hybrid deployments that could allow attackers to escalate privileges in Exchange Online cloud environments undetected.\nExchange hybrid configurations connect on-premises Exchange servers to Exchange Online (part of Microsoft 365), allowing for seamless integration of email and calendar features between on-premises and cloud mailboxes, including shared calendars, global address lists, and mail flow.\nHowever, in hybrid Exchange deployments, on-prem Exchange Server and Exchange Online also share the same service principal, which is a shared identity used for authentication between the two environments.\nBy abusing this shared identity, attackers who control the on-prem Exchange can potentially forge or manipulate trusted tokens or API calls that the cloud side will accept as legitimate, as it implicitly trusts the on-premises server.\nAdditionally, actions originating from on-premises Exchange don't always generate logs associated with malicious behavior in Microsoft 365; therefore, traditional cloud-based auditing (such as Microsoft Purview or M365 audit logs) may not capture security breaches if they originated on-premises.\n\"In an Exchange hybrid deployment, an attacker who first gains administrative access to an on-premises Exchange server could potentially escalate privileges within the organization's connected cloud environment without leaving easily detectable and auditable trace,\" Microsoft\nsaid\non Wednesday in a security advisory describing a high-severity privilege escalation vulnerability now tracked as CVE-2025-53786.\nThe vulnerability affects Exchange Server 2016 and Exchange Server 2019, as well as Microsoft Exchange Server Subscription Edition, the latest version, which replaces the traditional perpetual license model with a subscription-based one.\nWhile Microsoft has yet to observe in-the-wild exploitation, the company has tagged it as \"Exploitation More Likely\" because its analysis revealed that exploit code could be developed to consistently exploit this vulnerability, increasing its attractiveness to attackers.\n\"Total domain compromise\"\nCISA\nissued a separate advisory\naddressing this issue and advised network defenders who want to secure their Exchange hybrid deployments against potential attacks targeting the CVE-2025-53786 flaw by:\nInstall Microsoft's\nApril 2025 Exchange Server Hotfix Updates\non the on-premise Exchange server and follow Microsoft's configuration instructions\nDeploy dedicated Exchange hybrid app\n.\nFor organizations using Exchange hybrid (or have previously configured Exchange hybrid but no longer use it), review Microsoft's\nService Principal Clean-Up Mode\nfor guidance on resetting the service principal's keyCredentials.\nUpon completion, run the\nMicrosoft Exchange Health Checker\nto determine if further steps are required.\nCISA warned that failing to mitigate this vulnerability could lead \"to a hybrid cloud and on-premises total domain compromise\" and urged admins to disconnect public-facing servers running end-of-life (EOL) or end-of-service versions of Exchange Server or SharePoint Server from the internet.\nIn January, Microsoft also\nreminded admins\nthat Exchange 2016 and Exchange 2019 will reach their end of extended support in October and shared guidance for those who need to decommission outdated servers, advising them to migrate to Exchange Online or upgrade to Exchange Server Subscription Edition (SE).\nIn recent years, financially motivated and state-sponsored hackers have exploited multiple Exchange security vulnerabilities, including\nProxyLogon\nand\nProxyShell\nzero-days, to breach servers.\nFor instance,\nat least ten hacking groups\nexploited ProxyLogon in March 2021, including a Chinese-sponsored threat group tracked as Hafnium or Silk Typhoon.\nTwo years ago, in January 2023, Microsoft also urged customers to apply the latest supported Cumulative Update (CU) and\nkeep their on-premises Exchange servers up to date\nto ensure they're always ready to deploy emergency security updates.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft increases Zero Day Quest prize pool to $5 million\nCISA warns of attackers exploiting Linux flaw with PoC exploit\nNew Linux udisks flaw lets attackers get root on major Linux distros\nCritical SonicWall SSLVPN bug exploited in ransomware attacks\nMicrosoft accidentally confirms GPT-5, GPT-5-Mini, GPT-5-Nano ahead of launch"
    },
    {
        "Title": "Microsoft accidentally confirms GPT-5, GPT-5-Mini, GPT-5-Nano ahead of launch",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/microsoft-accidentally-confirms-gpt-5-gpt-5-mini-gpt-5-nano-ahead-of-launch/",
        "Summary": "OpenAI is hosting a live stream at 10AM PT to announce GPT-5, but Microsoft has already confirmed the details. [...]",
        "Date": "2025-08-07",
        "Content": "OpenAI is hosting a live stream at 10AM PT to announce GPT-5, but Microsoft has already confirmed the details.\nIn a\nblog post\n, which has now been taken offline, Microsoft confirmed GPT-5 is launching later today. While it was obvious, this is the first official confirmation.\nMicrosoft also offered more details on GPT-5 models, including the base model, which is called just GPT-5. It is designed for logic and multi-step tasks.\nWe also have GPT-5-mini, which is a lightweight version for cost-sensitive applications. Then, we have GPT-5-nano, which is optimised for speed and ideal for applications requiring low latency.\nFinally, there's a new GPT-5 chat, which is designed for advanced, natural, multimodal, and context-aware conversations for enterprise applications.\nAs spotted on Internet Archive, GitHub blog says GPT-5 is OpenAI’s most advanced model, offering major improvements in reasoning, code quality, and user experience.\nMicrosoft added that GPT-5 handles complex coding tasks with minimal prompting, provides clear explanations.\n\"GPT-5 introduces enhanced agentic capabilities, making it a powerful coding collaborator and intelligent assistant for all users,\" Microsoft noted.\nOpenAI may limit GPT-5 advanced features to pricey plans\nOpenAI plans to ship GPT-5 for free, but if you pay for $20 Plus plan, you'll get GPT-5 with advanced reasoning, and those with $200 Pro plan will get 'pro reasoning.' This is according to documents seen by BleepingComputer.\nBleepingComputer previously reported that GPT-5 can automatically sync between reasoning and non-reasoning, but you can insist it to 'reason' or think harder to activate reasoning by default\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nOpenAI prepares new open weight models along with GPT-5\nOpenAI prepares GPT-5 for roll out\nChatGPT's GPT-5-reasoning-alpha model spotted ahead of launch\nNew ChatGPT o3-alpha model hints at coding upgrade\nOpenAI: GPT-5 is coming, \"we'll see\" if it creates a shockwave"
    },
    {
        "Title": "Air France, KLM Alert Authorities of Data Breach",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/air-france-klm-data-breach",
        "Summary": "While no sensitive financial data like credit card information was compromised, the threat actors were able to get away with names, email addresses, phone numbers, and more.",
        "Date": "2025-08-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/air-france-klm-data-breach"
    },
    {
        "Title": "Privilege Escalation Issue in Amazon ECS Leads to IAM Hijacking",
        "Link": "https://www.darkreading.com/cloud-security/privilege-escalation-amazon-ecs-iam-hijacking",
        "Summary": "A software developer discovered a way to abuse an undocumented protocol in Amazon's Elastic Container Service to escalate privileges, cross boundaries and gain access to other cloud resources.",
        "Date": "2025-08-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/privilege-escalation-amazon-ecs-iam-hijacking"
    },
    {
        "Title": "'Samourai' Cryptomixer Founders Plead Guilty to Money Laundering",
        "Link": "https://www.darkreading.com/threat-intelligence/cryptomixer-founders-guilty-money-laundering",
        "Summary": "As part of their plea deal, the cybercriminal founders will also have to forfeit more than $200 million.",
        "Date": "2025-08-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/cryptomixer-founders-guilty-money-laundering"
    },
    {
        "Title": "Citizen Lab Founder Flags Rise of US Authoritarianism",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/citizen-lab-founder-us-authoritarianism",
        "Summary": "Citizen Lab director and founder Ron Deibert explained how civil society is locked in &quot;vicious cycle,&quot; and human rights are being abused as a result, covering Israeli spyware, the Khashoggi killing, and an erosion of democratic norms in the US.",
        "Date": "2025-08-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/citizen-lab-founder-us-authoritarianism"
    },
    {
        "Title": "Payback: 'ShinyHunters' Clocks Google via Salesforce",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/payback-shinyhunters-google-salesforce",
        "Summary": "In 2024, it was Snowflake. In 2025, it's Salesforce. ShinyHunters is back, with low-tech hacks that nonetheless manage to bring down international megaliths like Google, Cisco, and Adidas.",
        "Date": "2025-08-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/payback-shinyhunters-google-salesforce"
    },
    {
        "Title": "The Critical Flaw in CVE Scoring",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/critical-flaw-cve-scoring",
        "Summary": "With informed decision-making, organizations can strengthen their overall resilience and maintain the agility needed to adapt to emerging threats, without sacrificing innovation or productivity.",
        "Date": "2025-08-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/critical-flaw-cve-scoring"
    },
    {
        "Title": "Chanel Alerts Clients of Third-Party Breach",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/chanel-alerts-third-party-breach",
        "Summary": "The fashion house is added to a list of other companies that have been impacted by similar breaches, including Tiffany &amp; Co. and Louis Vuitton.",
        "Date": "2025-08-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/chanel-alerts-third-party-breach"
    },
    {
        "Title": "Researcher Deploys Fuzzer to Test Autonomous Vehicle Safety",
        "Link": "https://www.darkreading.com/cyber-risk/researcher-deploys-fuzzer-to-test-autonomous-vehicle-safety",
        "Summary": "As autonomous vehicles continue to evolve, new research highlights the importance of rigorous security testing to protect against both intentional attacks and unintentional unsafe commands in teleoperation systems.",
        "Date": "2025-08-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/researcher-deploys-fuzzer-to-test-autonomous-vehicle-safety"
    },
    {
        "Title": "SonicWall Says Recent Attacks Don’t Involve Zero-Day Vulnerability",
        "Link": "https://www.securityweek.com/sonicwall-says-recent-attacks-dont-involve-zero-day-vulnerability/",
        "Summary": "<p>SonicWall has been investigating reports about a zero-day potentially being exploited in ransomware attacks, but found no evidence of a new vulnerability. </p>\n<p>The post <a href=\"https://www.securityweek.com/sonicwall-says-recent-attacks-dont-involve-zero-day-vulnerability/\">SonicWall Says Recent Attacks Don&#8217;t Involve Zero-Day Vulnerability</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/sonicwall-says-recent-attacks-dont-involve-zero-day-vulnerability/"
    },
    {
        "Title": "Black Hat USA 2025 – Summary of Vendor Announcements (Part 3)",
        "Link": "https://www.securityweek.com/black-hat-usa-2025-summary-of-vendor-announcements-part-3/",
        "Summary": "<p>Many companies are showcasing their products and services this week at the 2025 edition of the Black Hat conference in Las Vegas.</p>\n<p>The post <a href=\"https://www.securityweek.com/black-hat-usa-2025-summary-of-vendor-announcements-part-3/\">Black Hat USA 2025 – Summary of Vendor Announcements (Part 3)</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/black-hat-usa-2025-summary-of-vendor-announcements-part-3/"
    },
    {
        "Title": "Air France, KLM Say Hackers Accessed Customer Data",
        "Link": "https://www.securityweek.com/air-france-klm-say-hackers-accessed-customer-data/",
        "Summary": "<p>Airlines Air France and KLM have disclosed a data breach stemming from unauthorized access to a third-party platform.</p>\n<p>The post <a href=\"https://www.securityweek.com/air-france-klm-say-hackers-accessed-customer-data/\">Air France, KLM Say Hackers Accessed Customer Data</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/air-france-klm-say-hackers-accessed-customer-data/"
    },
    {
        "Title": "Organizations Warned of Vulnerability in Microsoft Exchange Hybrid Deployment",
        "Link": "https://www.securityweek.com/organizations-warned-of-vulnerability-in-microsoft-exchange-hybrid-deployment/",
        "Summary": "<p>CISA and Microsoft have issued advisories for CVE-2025-53786, a high-severity flaw allowing privilege escalation in cloud environments. </p>\n<p>The post <a href=\"https://www.securityweek.com/organizations-warned-of-vulnerability-in-microsoft-exchange-hybrid-deployment/\">Organizations Warned of Vulnerability in Microsoft Exchange Hybrid Deployment</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/organizations-warned-of-vulnerability-in-microsoft-exchange-hybrid-deployment/"
    },
    {
        "Title": "New HTTP Request Smuggling Attacks Impacted CDNs, Major Orgs, Millions of Websites",
        "Link": "https://www.securityweek.com/new-http-request-smuggling-attacks-impacted-cdns-major-orgs-millions-of-websites/",
        "Summary": "<p>A desync attack method leveraging HTTP/1.1 vulnerabilities impacted many websites and earned researchers more than $200,000 in bug bounties.</p>\n<p>The post <a href=\"https://www.securityweek.com/new-http-request-smuggling-attacks-impacted-cdns-major-orgs-millions-of-websites/\">New HTTP Request Smuggling Attacks Impacted CDNs, Major Orgs, Millions of Websites</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/new-http-request-smuggling-attacks-impacted-cdns-major-orgs-millions-of-websites/"
    },
    {
        "Title": "Mohammed VI Polytechnic University Allegedly Hit by Data Breach",
        "Link": "https://dailydarkweb.net/mohammed-vi-polytechnic-university-allegedly-hit-by-data-breach/",
        "Summary": "A threat actor has allegedly leaked sensitive data belonging to the Mohammed VI Polytechnic University (UM6P) of Morocco. The claim was made on a popular cybercrime forum, stating that private information from the university has been exposed and published on the Telegram messaging platform. UM6P is a prestigious non-profit research university located in Benguerir, Morocco, [&#8230;]",
        "Date": "2025-08-07",
        "Content": "A threat actor has allegedly leaked sensitive data belonging to the Mohammed VI Polytechnic University (UM6P) of Morocco. The claim was made on a popular cybercrime forum, stating that private information from the university has been exposed and published on the Telegram messaging platform. UM6P is a prestigious non-profit research university located in Benguerir, Morocco, known for its focus on science, technology, and sustainable development, making it a significant institution in Africa’s educational landscape.\nAccording to the post made by the cybercriminal, the leaked dataset contains highly personal and sensitive information belonging to individuals associated with the university. The breach raises serious privacy concerns for students, faculty, and staff whose data may have been compromised. The actor did not specify the total volume of the data or the method used to obtain it.\nThe allegedly leaked data includes:\nPrivate Photos\nID Cards\nTags:\ncyber-attack\ndata-breach\nEducation\nID cards\nMohammed VI Polytechnic University\nMorocco\nstudent data"
    },
    {
        "Title": "Indonesian Health Platform SatuSehat Kotim Kabupaten Allegedly Breached – Patient Data Leaked",
        "Link": "https://dailydarkweb.net/indonesian-health-platform-satusehat-kotim-kabupaten-allegedly-breached-patient-data-leaked/",
        "Summary": "A threat actor has allegedly leaked and is attempting to sell a database belonging to SatuSehat for the East Kotawaringin Regency (Kotim Kabupaten) in Indonesia. The data, which appears to contain sensitive patient information, was posted on a dark web forum. SatuSehat is Indonesia&#8217;s national health platform, designed to integrate patient health records from various [&#8230;]",
        "Date": "2025-08-07",
        "Content": "A threat actor has allegedly leaked and is attempting to sell a database belonging to SatuSehat for the East Kotawaringin Regency (Kotim Kabupaten) in Indonesia. The data, which appears to contain sensitive patient information, was posted on a dark web forum. SatuSehat is Indonesia’s national health platform, designed to integrate patient health records from various healthcare facilities into a single system, making this a potentially significant data breach affecting numerous individuals.\nThe post, made by a new user on the forum, includes a sample of the allegedly stolen data, which seems to span from 2020 to 2025. The database purportedly contains records from the Indonesian Social Security Administering Body for Health (BPJS Kesehatan). The threat actor is offering the full database for sale and has provided cryptocurrency wallet addresses for the transaction. This incident raises serious concerns about the security of citizen data within the national health system and the potential for misuse of the leaked information.\nThe leaked data sample includes the following types of information:\nTimestamp of the record\nMedical Record Number (No MR)\nBPJS Number\nPatient’s Full Name\nGender\nAssigned Polyclinic\nPrint status\nBarcode\nTags:\nBPJS\nCyberSecurity\ndata-breach\ndata-leak\nIndonesia\nKotim Kabupaten\npatient data\nSatuSehat"
    },
    {
        "Title": "Over 20 ‘Free Money Rewards’ Apps Allegedly Breached – User Data Leaked Online",
        "Link": "https://dailydarkweb.net/over-20-free-money-rewards-apps-allegedly-breached-user-data-leaked-online/",
        "Summary": "A threat actor has allegedly breached a company that operates a large portfolio of mobile applications promising users money and cryptocurrency rewards. In a post on a dark web forum, the individual claimed to have hacked the company and leaked a database containing sensitive information belonging to the users of approximately 24 different &#8220;reward&#8221; apps. [&#8230;]",
        "Date": "2025-08-07",
        "Content": "A threat actor has allegedly breached a company that operates a large portfolio of mobile applications promising users money and cryptocurrency rewards. In a post on a dark web forum, the individual claimed to have hacked the company and leaked a database containing sensitive information belonging to the users of approximately 24 different “reward” apps. These applications typically function by having users complete tasks, watch videos, or participate in offers in exchange for small payments.\nThe compromised data was made available for download via a file-sharing link posted on the forum. The threat actor claims the breach exposed a significant amount of user information. The potential exposure of session tokens is particularly concerning, as it could allow malicious actors to hijack user accounts without needing a password. The full scope of the incident is not yet known, and it is unclear if the developer of the applications has acknowledged or responded to the alleged breach.\nThe allegedly leaked data includes:\nIP Addresses\nEmails\nNames\nSession Tokens\nThe following applications were named in the alleged breach:\nfox coins\nsweet earn\ncash zoo\ncash dabba\nbuzzy coin\nrichy dollars\nzap reward\ncash freak\nreward master\nking coin\ncash cobra\neasy reward\nwin me\nreward keyboard\nbear reward\nplaywin\nreward joy\ncandy reward\nreward station\ncash guru\n2xrewards\ntask bee\ncoupon hub\nTags:\nCyberSecurity\ndark web\ndata-breach\nmobile apps\nPII Leak\nreward apps"
    },
    {
        "Title": "Tech Trivial Allegedly Breached – Client Database Leaked",
        "Link": "https://dailydarkweb.net/tech-trivial-allegedly-breached-client-database-leaked/",
        "Summary": "Tech Trivial, a supplier of testing equipment for the plastic and cable industries, has allegedly fallen victim to a significant data breach. A threat actor has posted a database purportedly containing the information of 40,000 clients on a well-known hacker forum. Tech Trivial, operating under the slogan &#8220;Optimized engineering,&#8221; provides specialized equipment, making this breach [&#8230;]",
        "Date": "2025-08-07",
        "Content": "Tech Trivial, a supplier of testing equipment for the plastic and cable industries, has allegedly fallen victim to a significant data breach. A threat actor has posted a database purportedly containing the information of 40,000 clients on a well-known hacker forum. Tech Trivial, operating under the slogan “Optimized engineering,” provides specialized equipment, making this breach a potential concern for industrial clients who rely on their products and services.\nThe leaked data appears to be a direct extraction from a “clients” table within the company’s database. The threat actor published a sample of the data, which includes sensitive client information. The origin of the leak is attributed to a member of the hacker forum. This incident could pose a risk to the affected clients, potentially exposing them to phishing attempts, spam, and other malicious activities.\nThe compromised information allegedly includes the following details for each client:\nClient ID\nClient Name\nPassword\nEmail Address\nPhone Number\nVerification Status\nPoints\nDate of Registration\nTags:\nclient data\nCyberSecurity\ndata-breach\ndatabase leak\nindustrial supplier\nTech Trivial"
    },
    {
        "Title": "MIS[.]co[.]il Allegedly Breached – Sensitive Israeli Citizen Data Leaked",
        "Link": "https://dailydarkweb.net/mis-co-il-allegedly-breached-sensitive-israeli-citizen-data-leaked/",
        "Summary": "An Israeli B2B software-as-a-service (SaaS) company, MIS.co.il, has allegedly suffered a significant data breach, resulting in the exposure of sensitive personal information. According to a post on a popular hacking forum, a threat actor has leaked a database containing the records of over 2,000 individuals. MIS.co.il provides research and management software services to other businesses, [&#8230;]",
        "Date": "2025-08-07",
        "Content": "An Israeli B2B software-as-a-service (SaaS) company, MIS.co.il, has allegedly suffered a significant data breach, resulting in the exposure of sensitive personal information. According to a post on a popular hacking forum, a threat actor has leaked a database containing the records of over 2,000 individuals. MIS.co.il provides research and management software services to other businesses, making the potential exposure of client and user data a serious concern.\nThe threat actor claims the leaked data, dated July 2, 2025, was exfiltrated directly from the company’s systems. The dump, approximately 530KB in size, is said to contain a combination of personal identification details and user credentials. The potential impact on the individuals whose data has been compromised is substantial, as the information could be used for identity theft, phishing attacks, and other malicious activities.\nThe compromised data allegedly includes a wide range of sensitive information:\nPersonal data:\nFull names, Israeli ID card numbers, father/mother names, and birthdays.\nUser credentials:\nUsernames, email addresses, passwords, and IP addresses.\nInternal information:\nMessage history, internal links, and IP traceback data.\nTags:\nCyberSecurity\ndata-breach\ndata-leak\nIsrael\nMIS.co.il\nPII\nSaaS"
    },
    {
        "Title": "Moscow’s Cappuccino Hotel Allegedly Hit by Data Breach – Guest Information Leaked",
        "Link": "https://dailydarkweb.net/moscows-cappuccino-hotel-allegedly-hit-by-data-breach-guest-information-leaked/",
        "Summary": "A threat actor has allegedly leaked the database of Cappuccino Hotel (&#8220;Отель Капучино&#8221;), a hospitality establishment based in Moscow, Russia. The data, which reportedly originates from a breach in July 2025, was posted on a dark web forum on July 16, 2025. The leak contains a total of over 50,700 records spread across two files, [&#8230;]",
        "Date": "2025-08-07",
        "Content": "A threat actor has allegedly leaked the database of Cappuccino Hotel (“Отель Капучино”), a hospitality establishment based in Moscow, Russia. The data, which reportedly originates from a breach in July 2025, was posted on a dark web forum on July 16, 2025. The leak contains a total of over 50,700 records spread across two files, exposing a vast amount of sensitive customer and operational data.\nThe Cappuccino Hotel is a business in the hospitality industry, providing accommodation services in the Russian capital. The breach impacts its customers, whose personal and booking information is now publicly exposed. The leak could lead to significant privacy violations for the individuals involved, putting them at risk of identity theft, phishing attacks, and other fraudulent activities. The exposed data appears to be from the hotel’s Customer Relationship Management (CRM) system.\nThe compromised database allegedly contains a wide array of highly sensitive information concerning the hotel’s guests and their reservations. The leaked data includes:\nFull names, dates of birth, and contact information (phone numbers, email addresses)\nSocial media profiles (Facebook, VKontakte, Telegram, Skype)\nBooking details (check-in/out dates, number of guests, room category, booking amount)\nIdentity document details, including passport series and number, issuing authority, and expiry dates\nPartial passport photos and registration pages\nInternal deal and company information\nTags:\nCappuccino Hotel\ndata-breach\ndata-leak\nhospitality\nPII\nRussia"
    },
    {
        "Title": "Medusa Ransomware Allegedly Breaches French Accounting Firm PANSARD & ASSOCIES",
        "Link": "https://dailydarkweb.net/medusa-ransomware-allegedly-breaches-french-accounting-firm-pansard-associes/",
        "Summary": "The Medusa ransomware group has allegedly added the French accounting firm, PANSARD &#38; ASSOCIES, to its list of victims. According to a post on the threat actor&#8217;s data leak site, the group claims to have successfully breached the company&#8217;s network and exfiltrated a significant amount of sensitive data. PANSARD &#38; ASSOCIES is a prominent firm [&#8230;]",
        "Date": "2025-08-07",
        "Content": "The Medusa ransomware group has allegedly added the French accounting firm, PANSARD & ASSOCIES, to its list of victims. According to a post on the threat actor’s data leak site, the group claims to have successfully breached the company’s network and exfiltrated a significant amount of sensitive data. PANSARD & ASSOCIES is a prominent firm based in Roubaix, France, that provides complementary services to companies, including public accounting, auditing, and strategic planning for mergers, acquisitions, and asset restructuring. The firm is also affiliated with the American Institute of Certified Public Accountants, highlighting its standing in the financial industry.\nThe ransomware gang alleges to have stolen 566.2 GB of data and has published a countdown timer on its blog, threatening to release the data publicly if their demands are not met. The post, dated August 6, 2025, gives the company approximately 11 days to respond. The attackers have also provided options to extend the deadline, delete the data, or download the data, each for a price, a common tactic used by ransomware groups to pressure their victims into paying the ransom.\nTo substantiate their claims, the attackers have released a screenshot of a file tree from what appears to be the company’s compromised systems.\nThe folders listed suggest that the stolen information could contain highly sensitive financial and corporate data.\nThe alleged leaked data includes directories titled:\nAuditSoft\nCommun\nOneDrive\nScans\nUsers\nTags:\nAccounting\ncyberattack\ndata-breach\nFrance\nMedusa\nPANSARD & ASSOCIES\nransomware"
    },
    {
        "Title": "Play Ransomware Allegedly Breaches The Magni Group, Brad’s Bedding Plants, Emprise, and Jamco Aerospace",
        "Link": "https://dailydarkweb.net/play-ransomware-allegedly-breaches-the-magni-group-brads-bedding-plants-emprise-and-jamco-aerospace/",
        "Summary": "The Play ransomware group has allegedly added four US-based companies to its data leak site, claiming to have successfully breached their networks. The threat actor listed the companies on August 6, 2025, and has set a publication deadline of August 10, 2025. This move suggests that the victims have not complied with the ransom demands, [&#8230;]",
        "Date": "2025-08-07",
        "Content": "The Play ransomware group has allegedly added four US-based companies to its data leak site, claiming to have successfully breached their networks. The threat actor listed the companies on August 6, 2025, and has set a publication deadline of August 10, 2025. This move suggests that the victims have not complied with the ransom demands, prompting the group to threaten the public release of stolen data.\nThe targeted organizations operate across various critical sectors, including aerospace, manufacturing, agriculture, and chemicals. The addition of these companies to the ransomware group’s leak blog serves as a pressure tactic, aiming to coerce payment by threatening reputational damage and the exposure of sensitive information. The list of victims includes prominent names vital to their respective industries.\nThe victims allegedly targeted by the Play ransomware group are:\nThe Magni Group:\nA company specializing in chemicals and related products, known for its corrosion-resistant coatings.\nBrad’s Bedding Plants:\nAn agricultural business focused on providing bedding plants.\nEmprise:\nA firm operating in the manufacturing sector.\nJamco Aerospace, Inc.:\nA key player in the aerospace industry, providing comprehensive machining and airframe sub-assembly services for both prototypes and full-scale production.\nThe ransomware group claims to have exfiltrated a significant amount of sensitive data from each company. The types of data allegedly stolen include:\nPrivate and personal confidential data\nClient documents\nBudgets\nPayroll information\nAccounting and tax records\nIDs\nFinancial information\nTags:\nBrad's Bedding Plants\nCyberSecurity\ndata-leak\nEmprise\nJamco Aerospace\nPlay Ransomware\nransomware\nThe Magni Group\nUnited States"
    },
    {
        "Title": "INC Ransom Allegedly Breaches French National Agency for Adult Vocational Training Afpa",
        "Link": "https://dailydarkweb.net/inc-ransom-allegedly-breaches-french-national-agency-for-adult-vocational-training-afpa/",
        "Summary": "The INC Ransom group has allegedly targeted the Agence nationale pour la formation professionnelle des adultes (Afpa), France&#8217;s leading organization for adult vocational training. On their data leak blog, the ransomware group listed Afpa as a victim, claiming to have exfiltrated a significant amount of data. The post included a description of the agency and [&#8230;]",
        "Date": "2025-08-07",
        "Content": "The INC Ransom group has allegedly targeted the Agence nationale pour la formation professionnelle des adultes (Afpa), France’s leading organization for adult vocational training. On their data leak blog, the ransomware group listed Afpa as a victim, claiming to have exfiltrated a significant amount of data. The post included a description of the agency and its mission to provide training for employment, highlighting its role since its creation in 1949.\nAccording to the threat actors’ post, they have successfully breached Afpa’s network and stolen 5 terabytes (TB) of “sensitive and personal data.” The group has threatened to publish this data on their blog, a common tactic used by ransomware gangs to pressure victims into paying a ransom. As a public establishment under the French Ministry of Labour, Afpa plays a crucial role in the country’s employment and training sector, making this alleged breach a significant security incident.\nThe full extent of the compromised data has not been publicly detailed by the attackers, but the claim of “sensitive and personal data” raises concerns about the potential exposure of information belonging to trainees, staff, and partners of the agency. The incident underscores the persistent threat that ransomware groups pose to critical public sector organizations across the globe.\nTags:\nAfpa\ndata-breach\nFrance\nINC Ransom\nransomware"
    },
    {
        "Title": "UK Steel Rope Manufacturer Brunton-Shaw Allegedly Hit by Everest Ransomware",
        "Link": "https://dailydarkweb.net/uk-steel-rope-manufacturer-brunton-shaw-allegedly-hit-by-everest-ransomware/",
        "Summary": "The Everest ransomware group has claimed another victim in what appears to be a connected attack, listing Brunton-Shaw on its dark web portal just after EMM Corp. The group alleges to have stolen 900 GB of data from Brunton-Shaw, a UK-based manufacturer of high-quality steel wire ropes and a brand operating under the Usha Martin [&#8230;]",
        "Date": "2025-08-07",
        "Content": "The Everest ransomware group has claimed another victim in what appears to be a connected attack, listing Brunton-Shaw on its dark web portal just after EMM Corp. The group alleges to have stolen 900 GB of data from Brunton-Shaw, a UK-based manufacturer of high-quality steel wire ropes and a brand operating under the Usha Martin corporate umbrella. The attackers have posted a new set of proof files and set a similar countdown timer, escalating the pressure on the parent organization.\nThe evidence leaked from Brunton-Shaw’s systems is highly specific and sensitive, demonstrating the depth of the alleged breach. Sample files include internal audit forms, technical engineering documents like reel capacity calculators, and confidential accident log reports containing the names of employees involved and details of workplace incidents. The publication of such information not only violates the privacy of the individuals named but also exposes the company to potential regulatory and legal challenges regarding health and safety.\nThis incident, following the attack on EMM Corp, suggests the Everest group has carried out a comprehensive compromise of the entire corporate network of Usha Martin UK and its related entities. By targeting multiple business units and leaking distinct datasets for each, the attackers are maximizing their leverage. The combined breach exposes a vast trove of financial, operational, and personal data, creating a multi-faceted crisis for the manufacturing giant.\nThe allegedly leaked data includes:\nPersonal data\nCustomer data\nFinancial documents\nInternal documents\nContracts\nInvoices\nHealth & Safety reports\nTags:\nBrunton-Shaw\ndata-leak\nEMM Corp\nEverest\nManufacturing\nransomware\nUK\nUsha Martin"
    }
]