[
    {
        "Title": "Researchers Uncover ECScape Flaw in Amazon ECS Enabling Cross-Task Credential Theft",
        "Link": "https://thehackernews.com/2025/08/researchers-uncover-ecscape-flaw-in.html",
        "Summary": "Cybersecurity researchers have demonstrated an \"end-to-end privilege escalation chain\" in Amazon Elastic Container Service (ECS) that could be exploited by an attacker to conduct lateral movement, access sensitive data, and seize control of the cloud environment.\nThe attack technique has been codenamed ECScape by Sweet Security researcher Naor Haziz, who presented the findings today at the",
        "Date": "2025-08-06",
        "Content": "Cybersecurity researchers have demonstrated an \"end-to-end privilege escalation chain\" in Amazon Elastic Container Service (\nECS\n) that could be exploited by an attacker to conduct lateral movement, access sensitive data, and seize control of the cloud environment.\nThe attack technique has been codenamed ECScape by Sweet Security researcher Naor Haziz, who\npresented\nthe findings today at the Black Hat USA security conference that's being held in Las Vegas.\n\"We identified a way to abuse an undocumented ECS internal protocol to grab AWS credentials belonging to other ECS tasks on the same EC2 instance,\" Haziz\nsaid\nin a report shared with The Hacker News. \"A malicious container with a low‑privileged IAM [Identity and Access Management] role can obtain the permissions of a higher‑privileged container running on the same host.\"\nAmazon ECS is a fully-managed container orchestration service that allows users to deploy, manage, and scale containerized applications, while integrating with Amazon Web Services (AWS) to run container workloads in the cloud.\nThe vulnerability identified by Sweet Security essentially allows for privilege escalation by allowing a low-privileged task running on an ECS instance to hijack the IAM privileges of a higher-privileged container on the same EC2 machine by stealing its credentials.\nIn other words, a malicious app in an ECS cluster could assume the role of a more privileged task. This is facilitated by taking advantage of a\nmetadata service running at 169.254.170[.]2\nthat exposes the temporary credentials associated with the task's IAM role.\nWhile this approach ensures that each task gets credentials for its IAM role and they are delivered at runtime, a leak of the ECS agent's identity could permit an attacker to impersonate the agent and obtain credentials for any task on the host. The entire sequence is as follows -\nObtain the host's IAM role credentials (EC2 Instance Role) so as to impersonate the agent\nDiscover the ECS control plane endpoint that the agent talks to\nGather the necessary identifiers (cluster name/ARN, container instance ARN, Agent version information, Docker version, ACS protocol version, and Sequence number) to authenticate as the agent using the Task Metadata endpoint and ECS introspection API\nForge and sign the Agent Communication Service (ACS) WebSocket Request impersonating the agent with the sendCredentials parameter set to \"true\"\nHarvest credentials for all running tasks on that instance\n\"The forged agent channel also remains stealthy,\" Haziz said. \"Our malicious session mimics the agent's expected behavior – acknowledging messages, incrementing sequence numbers, sending heartbeats – so nothing seems amiss.\"\n\"By impersonating the agent's upstream connection, ECScape completely collapses that trust model: one compromised container can passively collect every other task's IAM role credentials on the same EC2 instance and immediately act with those privileges.\"\nECScape can have severe consequences when running ECS tasks on shared EC2 hosts, as it opens the door to cross-task privilege escalation, secrets exposure, and metadata exfiltration.\nFollowing responsible disclosure, Amazon has emphasized the need for customers to adopt stronger isolation models where applicable, and make it clear in its\ndocumentation\nthat there is no task isolation in EC2 and that \"containers can potentially access credentials for other tasks on the same container instance.\"\nAs mitigations, it's\nadvised\nto avoid deploying high-privilege tasks alongside untrusted or low-privilege tasks on the same instance, use AWS Fargate for true isolation, disable or restrict the instance metadata service (IMDS) access for tasks, limit ECS agent permissions, and set up CloudTrail alerts to detect unusual usage of IAM roles.\n\"The core lesson is that you should treat each container as potentially compromiseable and rigorously constrain its blast radius,\" Haziz said. \"AWS's convenient abstractions (task roles, metadata service, etc.) make life easier for developers, but when multiple tasks with different privilege levels share an underlying host, their security is only as strong as the mechanisms isolating them – mechanisms which can have subtle weaknesses.\"\nThe development comes in the wake of several cloud-related security weaknesses that have been reported in recent weeks -\nA\nrace condition\nin Google Cloud Build's GitHub integration that could have allowed an attacker to bypass maintainer review and build un-reviewed code after a \"/gcbrun\" command is issued by the maintainer\nA\nremote code execution vulnerability\nin Oracle Cloud Infrastructure (OCI) Code Editor that an attacker could use to hijack a victim's Cloud Shell environment and potentially pivot across OCI services by tricking a victim, already logged into Oracle Cloud, to visit a malicious HTML page hosted on a server by means of a drive-by attack\nAn attack technique called\nI SPy\nthat exploits a Microsoft first-party application's Service principal (SP) in Entra ID for persistence and privilege escalation via federated authentication\nA\nprivilege escalation vulnerability\nin the Azure Machine Learning service that allows an attacker with only Storage Account access to modify invoker scripts stored in the AML storage account and execute arbitrary code within an AML pipeline, enabling them to extract secrets from Azure Key Vaults, escalate privileges, and gain broader access to cloud resources\nA\nscope vulnerability\nin the legacy\nAmazonGuardDutyFullAccess\nAWS managed policy that could allow a full organizational takeover from a compromised member account by registering an arbitrary delegated administrator\nAn\nattack technique\nthat abuses\nAzure Arc\nfor privilege escalation by leveraging the Azure Connected Machine Resource Administrator role and as a\npersistence mechanism\nby setting up as command-and-control (C2)\nA case of\nover-privileged Azure built-in Reader roles and a vulnerability in Azure API\nthat could be chained by an attacker to leak VPN keys and then use the key to gain access to both internal cloud assets and on-premises networks\nA\nsupply chain compromise vulnerability\nin Google Gerrit called GerriScary that enabled unauthorized code submissions to at least 18 Google projects, including ChromiumOS (\nCVE-2025-1568\n, CVSS score: 8.8), Chromium, Dart, and Bazel, by exploiting misconfigurations in the default \"addPatchSet\" permission, the voting system's label handling, and a race condition with bot code-submission timings during the code merge process\nA Google Cloud Platform\nmisconfiguration\nthat\nexposed\nthe subnetworks used for member exchanges at Internet Exchange Points (IXPs), thereby allowing attackers to potentially abuse Google's cloud infrastructure to gain unauthorized access to internal IXP LANs.\nAn extension of a Google Cloud\nprivilege escalation vulnerability\ncalled\nConfusedFunction\nthat can be adapted to other cloud platforms like AWS and Azure using AWS Lambda and Azure Functions, respectively, in addition to extending it to perform environment enumeration\n\"The most effective mitigation strategy to protect your environment from similar threat actor behavior is to ensure that all SAs [Service Account] within your cloud environment adhere to the principle of least privilege and that no legacy cloud SAs are still in use,\" Talos said. \"Ensure that all cloud services and dependencies are up to date with the latest security patches. If legacy SAs are present, replace them with least-privilege SAs.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Fake VPN and Spam Blocker Apps Tied to VexTrio Used in Ad Fraud, Subscription Scams",
        "Link": "https://thehackernews.com/2025/08/fake-vpn-and-spam-blocker-apps-tied-to.html",
        "Summary": "The malicious ad tech purveyor known as VexTrio Viper has been observed developing several malicious apps that have been published on Apple and Google's official app storefronts under the guise of seemingly useful applications.\nThese apps masquerade as VPNs, device \"monitoring\" apps, RAM cleaners, dating services, and spam blockers, DNS threat intelligence firm Infoblox said in an exhaustive",
        "Date": "2025-08-06",
        "Content": "The malicious ad tech purveyor known as\nVexTrio Viper\nhas been observed developing several malicious apps that have been published on Apple and Google's official app storefronts under the guise of seemingly useful applications.\nThese apps masquerade as VPNs, device \"monitoring\" apps, RAM cleaners, dating services, and spam blockers, DNS threat intelligence firm Infoblox said in an exhaustive analysis shared with The Hacker News.\n\"They released apps under several developer names, including HolaCode, LocoMind, Hugmi, Klover Group, and AlphaScale Media,\" the company\nsaid\n. \"Available in the Google Play and Apple store, these have been downloaded millions of times in aggregate.\"\nThese fake apps, once installed, deceive users into signing up for subscriptions that are difficult to cancel, flood them with ads, and part with personal information like email addresses. It's worth noting that LocoMind was\npreviously flagged\nby Cyjax as part of a phishing campaign serving ads that falsely claim their devices have been damaged.\nOne such Android app is\nSpam Shield block\n, which purports to be a spam blocker for push notifications but, in reality, charges users several times after convincing them to enroll in a subscription.\n\"Right away it asks for money, and if you don't, the ads are so disruptive that I uninstalled it before I was even able to try it,\" one user said in a review of the app on the Google Play Store.\nAnother review went: \"This app is supposed to be $14.99 a month. During the month of February I have been billed weekly for $14.99 that comes to $70 monthly/$720 a year. NOT WORTH IT. And having problems trying to uninstall it. They tell you one price and then they turn around and charge you something else. They're probably hoping that you won't see it. Or it will be too late to get a refund. All I want is this junk off of my phone.\"\nHow threat actors leverage compromised sites and smartlinks to earn money\nThe new findings lay bare the scale of the multinational criminal enterprise that's VexTrio Viper, which includes operating traffic distribution services (TDSes) to redirect massive volumes of internet traffic to scams through their advertising networks since 2015, as well as managing payment processors such as Pay Salsa and email validation tools like DataSnap.\n\"VexTrio and their partners are successful in part because their businesses are obfuscated,\" the company said. \"But a larger part of their success is likely because they stick to fraud, where they know there is less risk of consequences.\"\nVexTrio is known for running what's called a commercial affiliate network, serving as an intermediary between malware distributors who have, for example, compromised a collection of WordPress websites with malicious injects (aka publishing affiliates) and threat actors who advertise various fraudulent schemes ranging from sweepstakes to crypto scams (aka advertising affiliates).\nThe TDS is assessed to be created by a shell company called AdsPro Group, with key figures behind the organization from Italy, Belarus, and Russia engaging in fraudulent activity since at least 2004, before expanding their operations to Bulgaria, Moldova, Romania, Estonia, and the Czechia around 2015. In all, over 100 companies and brands have been linked to VexTrio.\n\"Russian organized crime groups began building an empire within ad tech starting in or around 2015,\" Dr. Renée Burton, VP of Infoblox Threat Intel, told The Hacker News. \"VexTrio is a key group within this industry, but there are other groups. All types of cybercrime, from dating scams to investment fraud and information stealers use malicious adtech, and it goes largely unnoticed.\"\nBut what makes the threat actor notable is that it controls both the publishing and advertising sides of affiliate networks through a vast network of intertwined companies like Teknology, Los Pollos, Taco Loco, and Adtrafico. In May 2024, Los Pollos said it had 200,000 affiliates and over 2 billion unique users every month.\nThe scams, more broadly, play out in this manner: Unsuspecting users who land on a legitimate-but-infected site are routed through a TDS under VexTrio's control, which then leads the users to scam landing pages. This is achieved by means of a smartlink that cloaks the final landing page and hinders analysis.\nLos Pollos and Adtrafico are both cost-per-action (CPA) networks that allow publishing affiliates to earn a commission when a site visitor performs an intended action. This could be accepting a website notification, providing their personal details, downloading an app, or giving credit card information.\nIt has also been found to be a major spam distributor that reaches out to millions of potential victims, leveraging lookalike domains of popular mail services like SendGrid (\"sendgrid[.]rest\") and MailGun (\"mailgun[.]fun\") to facilitate the service.\nAnother significant aspect is the use of cloaking services like IMKLO to disguise the real domains and evaluate criteria like the user's location, their device type, their browser, and then determine the exact nature of content to be delivered.\n\"The security industry, and much of the world, is more focused on malware right now,\" Burton said. \"This is in some sense victim blaming, in which there is a belief that people who fall for scams somehow deserve to be scammed more.\"\n\"So, stealing your credit card information via malware – even when it requires some ridiculous stroke of keys, like the current fake captcha/\nClickFix attacks\n– is somehow 'worse' than if you are conned into giving it up. Cybersecurity education and greater awareness for treating scams with the same severity as malware are two ways to combat malicious adtech.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "AI Slashes Workloads for vCISOs by 68% as SMBs Demand More – New Report Reveals",
        "Link": "https://thehackernews.com/2025/08/ai-slashes-workloads-for-vcisos-by-68.html",
        "Summary": "As the volume and sophistication of cyber threats and risks grow, cybersecurity has become mission-critical for businesses of all sizes. To address this shift, SMBs have been urgently turning to vCISO services to keep up with escalating threats and compliance demands. A recent report by Cynomi has found that a full 79% of MSPs and MSSPs see high demand for vCISO services among SMBs.\nHow are",
        "Date": "2025-08-06",
        "Content": "As the volume and sophistication of cyber threats and risks grow, cybersecurity has become mission-critical for businesses of all sizes. To address this shift, SMBs have been urgently turning to vCISO services to keep up with escalating threats and compliance demands. A recent report by Cynomi has found that a full 79% of MSPs and MSSPs see high demand for vCISO services among SMBs.\nHow are service providers scaling to meet this demand? Which business upside can they expect to see? And where does AI fit in?\nThe answers can be found in\n\"The 2025 State of the vCISO Report\".\nThis newly-released report offers a deep dive into the vCISO market evolution and the broader shift toward advanced cybersecurity services. The bottom line? What used to be a niche offering is now a foundational service, and AI is transforming how it's delivered. Below, we bring some of the main findings of the report.\n319% Growth in vCISO Adoption: MSPs & MSSPs Race to Meet SMB Demand\nvCISO offerings provide a flexible, cost-effective way for organizations to access high-level cybersecurity expertise without the overhead of a full-time executive. And with a growing number of attacks alongside the growing awareness of the importance of cybersecurity, it's no surprise that demand for vCISO services is skyrocketing among SMBs. Demand for vCISO services is outpacing even compliance readiness and cyber insurance support.\nFigure 1: Demand for Advanced Cybersecurity Services Among SMB Clients\nIn response, adoption of the vCISO offering among MSPs and MSSPs has jumped from 21% in 2024 to 67% in 2025. This is a 319% increase in just one year. In addition, 50% of the service providers who don't yet, plan to launch vCISO offerings by year's end. This adoption curve reflects a clear industry shift, from vCISO being a niche service to becoming a core one.\nFigure 2: Plans for Offering vCISO Services\nReal Business Impact: Higher Margins, Better Upsell, More Recurring Revenue\nThe growth in adoption isn't just driven by client demand. It's also underpinned by strong business outcomes for providers. Organizations that offer vCISO services report substantial gains:\n41%\nreport an increase in upsell opportunities, leveraging vCISO for additional service offerings\n40%\nsee improved operating margins\n39%\nreport a measurable expansion in their customer base, including access to new prospects\nAnd of course, vCISO services offer significant security benefits to clients. From the service provider angle, leading security expertise elevates them beyond mere temporary vendors to trusted, long-term strategic partners.\nAdoption Barriers Are Real, But They're Operational, Not Strategic\nWhile enthusiasm among service providers is high, not every provider has yet made the leap into vCISO services. Among those still in planning mode, the report identifies three primary concerns:\n35% cite uncertainty around profitability or ROI.\n33% highlight high upfront investment requirements.\n32% point to a shortage of qualified cybersecurity professionals.\nImportantly, few providers doubt the market demand or business value of vCISO services. Instead, they're struggling to implement them efficiently and profitably.\nThis is where technology and automation come into play. As AI-powered platforms reduce manual effort and enable scalable service delivery, the operational burden becomes far more manageable, opening the door for broader market participation.\nAI Is Reshaping the vCISO Delivery Model\nAI is no longer a future consideration. It's already having a profound impact on how vCISO services are delivered. According to the report, 81% of MSPs and MSSPs are already using AI or automation within their vCISO workflows, and an additional 15% plan to adopt it within the next year.\nFigure 3: Use of Automation and AI Tools in vCISO Service Delivery\nThe applications of AI in vCISO services are wide-ranging and impactful: reporting automation and insights, remediation planning, compliance readiness and monitoring, risk and security assessments, task prioritization, and more.\nThe result is a significant reduction in manual workload: an average decrease of 68%, with 42% of providers seeing 81–100% workload reductions in some areas.\nThis allows service providers to support more clients, deliver higher-quality outputs, and improve profit margins, all without expanding headcount. In effect, AI is enabling the kind of scale and consistency that traditional, human-led delivery models could not sustain.\nThe Road Ahead: AI-Driven Scale, Strategy and Service Differentiation\nThe 2025 State of the vCISO Report paints a clear picture: As service providers continue to invest in automation and intelligent tooling, the vCISO model will shift from resource-heavy to AI-powered and highly efficient.\nLooking forward, we expect to see:\nWider market penetration among MSPs and MSSPs\nDeeper integration of AI across vCISO services\nHigher ROI, as service providers implement AI and other technologies in their processes and offerings.\nFor a complete view of trends, benchmarks, and best practices shaping the future of virtual cybersecurity leadership, download the full\n2025 State of the vCISO Report\n.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft Launches Project Ire to Autonomously Classify Malware Using AI Tools",
        "Link": "https://thehackernews.com/2025/08/microsoft-launches-project-ire-to.html",
        "Summary": "Microsoft on Tuesday announced an autonomous artificial intelligence (AI) agent that can analyze and classify software without assistance in an effort to advance malware detection efforts.\nThe large language model (LLM)-powered autonomous malware classification system, currently a prototype, has been codenamed Project Ire by the tech giant.\nThe system \"automates what is considered the gold",
        "Date": "2025-08-06",
        "Content": "Microsoft on Tuesday announced an autonomous artificial intelligence (AI) agent that can analyze and classify software without assistance in an effort to advance malware detection efforts.\nThe large language model (LLM)-powered autonomous malware classification system, currently a prototype, has been codenamed\nProject Ire\nby the tech giant.\nThe system \"automates what is considered the gold standard in malware classification: fully reverse engineering a software file without any clues about its origin or purpose,\" Microsoft\nsaid\n. \"It uses decompilers and other tools, reviews their output, and determines whether the software is malicious or benign.\"\nProject Ire, per the Windows maker, is an effort to enable malware classification at scale, accelerate threat response, and reduce the manual efforts that analysts have to undertake in order to examine samples and determine if they are malicious or benign.\nSpecifically, it uses specialized tools to reverse engineer software, conducting analysis at various levels, ranging from low-level binary analysis to control flow reconstruction and high-level interpretation of code behavior.\n\"Its tool-use API enables the system to update its understanding of a file using a wide range of reverse engineering tools, including Microsoft memory analysis sandboxes based on Project Freta (opens in new tab), custom and open-source tools, documentation search, and multiple decompilers,\" Microsoft said.\nProject Freta is a Microsoft Research initiative that\nenables\n\"discovery sweeps for undetected malware,\" such as rootkits and advanced malware, in memory snapshots of live Linux systems during memory audits.\nThe evaluation is a multi-step process -\nAutomated reverse engineering tools identify the file type, its structure, and potential areas of interest\nThe system reconstructs the software's control flow graph using frameworks like angr and Ghidra\nThe LLM invokes specialized tools through an API to identify and summarize key functions\nThe system calls a validator tool to verify its findings against evidence used to reach the verdict and classify the artifact\nThe summarization leaves a detailed \"chain of evidence\" log that details how the system arrived at its conclusion, allowing security teams to review and refine the process in case of a misclassification.\nIn tests conducted by the Project Ire team on a dataset of publicly accessible Windows drivers, the classifier has been found to correctly flag 90% of all files and incorrectly identify only 2% of benign files as threats. A second evaluation of nearly 4,000 \"hard-target\" files rightly classified nearly 9 out of 10 malicious files as malicious, with a false positive rate of only 4%.\n\"Based on these early successes, the Project Ire prototype will be leveraged inside Microsoft's Defender organization as Binary Analyzer for threat detection and software classification,\" Microsoft said.\n\"Our goal is to scale the system's speed and accuracy so that it can correctly classify files from any source, even on first encounter. Ultimately, our vision is to detect novel malware directly in memory, at scale.\"\nThe development comes as Microsoft\nsaid\nit awarded a record $17 million in bounty awards to 344 security researchers from 59 countries through its vulnerability reporting program in 2024.\nA total of 1,469 eligible vulnerability reports were submitted between July 2024 and June 2025, with the highest individual bounty reaching $200,000. Last year, the company\npaid\n$16.6 million in bounty awards to 343 security researchers from 55 countries.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Trend Micro Confirms Active Exploitation of Critical Apex One Flaws in On-Premise Systems",
        "Link": "https://thehackernews.com/2025/08/trend-micro-confirms-active.html",
        "Summary": "Trend Micro has released mitigations to address critical security flaws in on-premise versions of Apex One Management Console that it said have been exploited in the wild.\nThe vulnerabilities (CVE-2025-54948 and CVE-2025-54987), both rated 9.4 on the CVSS scoring system, have been described as management console command injection and remote code execution flaws.\n\"A vulnerability in Trend Micro",
        "Date": "2025-08-06",
        "Content": "Trend Micro has released mitigations to address critical security flaws in on-premise versions of Apex One Management Console that it said have been exploited in the wild.\nThe vulnerabilities (\nCVE-2025-54948\nand\nCVE-2025-54987\n), both rated 9.4 on the CVSS scoring system, have been described as management console command injection and remote code execution flaws.\n\"A vulnerability in Trend Micro Apex One (on-premise) management console could allow a pre-authenticated remote attacker to upload malicious code and execute commands on affected installations,\" the cybersecurity company\nsaid\nin a Tuesday advisory.\nWhile both shortcomings are essentially the same, CVE-2025-54987 targets a different CPU architecture. The Trend Micro Incident Response (IR) Team and Jacky Hsieh at CoreCloud Tech have been credited with reporting the two flaws.\nThere are currently no details on how the issues are being exploited in real-world attacks. Trend Micro said it \"observed at least one instance of an attempt to actively exploit one of these vulnerabilities in the wild.\"\nMitigations for Trend Micro Apex One as a Service have already been deployed as of July 31, 2025. A short-term solution for on-premise versions is available in the form of a fix tool. A formal patch for the vulnerabilities is expected to be released in mid-August 2025.\nHowever, Trend Micro pointed out that while the tool fully protects against known exploits, it will disable the ability for administrators to utilize the Remote Install Agent function to deploy agents from the Trend Micro Apex One Management Console. It emphasized that other agent install methods, such as UNC path or agent package, are unaffected.\n\"Exploiting these type of vulnerabilities generally require that an attacker has access (physical or remote) to a vulnerable machine,\" the company said. \"In addition to timely application of patches and updated solutions, customers are also advised to review remote access to critical systems and ensure policies and perimeter security is up-to-date.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "CERT-UA Warns of HTA-Delivered C# Malware Attacks Using Court Summons Lures",
        "Link": "https://thehackernews.com/2025/08/cert-ua-warns-of-hta-delivered-c.html",
        "Summary": "The Computer Emergency Response Team of Ukraine (CERT-UA) has warned of cyber attacks carried out by a threat actor called UAC-0099 targeting government agencies, the defense forces, and enterprises of the defense-industrial complex in the country.\nThe attacks, which leverage phishing emails as an initial compromise vector, are used to deliver malware families like MATCHBOIL, MATCHWOK, and",
        "Date": "2025-08-06",
        "Content": "The Computer Emergency Response Team of Ukraine (CERT-UA) has\nwarned\nof cyber attacks carried out by a threat actor called\nUAC-0099\ntargeting government agencies, the defense forces, and enterprises of the defense-industrial complex in the country.\nThe attacks, which leverage phishing emails as an initial compromise vector, are used to deliver malware families like MATCHBOIL, MATCHWOK, and DRAGSTARE.\nUAC-0099, first publicly documented by the agency in June 2023, has a history of targeting Ukrainian entities for espionage purposes. Prior attacks have been\nobserved\nleveraging security flaws in WinRAR software (CVE-2023-38831, CVSS score: 7.8) to propagate a malware called LONEPAGE.\nThe latest infection chain involves using email lures related to court summons to entice recipients into clicking on links that are shortened using URL shortening services like Cuttly. These links, which are sent via UKR.NET email addresses, point to a double archive file containing an HTML Application (HTA) file.\nThe execution of the HTA payload triggers the launch of an obfuscated Visual Basic Script file that, in turn, creates a scheduled task for persistence and ultimately runs a loader named MATCHBOIL, a C#-based program that's designed to drop additional malware on the host.\nThis includes a backdoor called MATCHWOK and a stealer named DRAGSTARE. Also written using the C# programming language, MATCHWOK is capable of executing PowerShell commands and passing the results of the execution to a remote server.\nDRAGSTARE, on the other hand, is equipped to collect system information, data from web browsers, files matching a specific list of extensions (\".docx\", \".doc\", \".xls\", \".txt\", \".ovpn\", \".rdp\", \".txt\", and \".pdf\") from the \"Desktop\", \"Documents\", \"Downloads\" folders, screenshots, and running PowerShell commands received from an attacker-controlled server.\nThe disclosure comes a little over a month after ESET published a detailed report cataloging\nGamaredon's \"relentless\" spear-phshing attacks\nagainst Ukrainian entities in 2024, detailing its use of six new malware tools that are engineered for stealth, persistence, and lateral movement -\nPteroDespair\n, a PowerShell reconnaissance tool to collect diagnostic data on previously deployed malware\nPteroTickle\n, a PowerShell weaponizer that targets Python applications converted into executables on fixed and removable drives to facilitate lateral movement by injecting code that likely serves PteroPSLoad or another PowerShell downloader\nPteroGraphin\n, a PowerShell tool to establish persistence using Microsoft Excel add-ins and scheduled tasks, as well as create an encrypted communication channel for payload delivery, through the Telegraph API\nPteroStew\n, a VBScript downloader similar to PteroSand and PteroRisk) that stores its code in alternate data streams associated with benign files on the victim's system\nPteroQuark\n, a VBScript downloader introduced as a new component within the VBScript version of the PteroLNK weaponizer\nPteroBox\n, a PowerShell file stealer resembling PteroPSDoor but exfiltrating stolen files to Dropbox\n\"Gamaredon's spearphishing activities significantly intensified during the second half of 2024,\" security researcher Zoltán Rusnák\nsaid\n. \"Campaigns typically lasted one to five consecutive days, with emails containing malicious archives (RAR, ZIP, 7z) or XHTML files employing HTML smuggling techniques.\"\nThe attacks often result in the delivery of malicious HTA or LNK files that execute embedded VBScript downloaders such as\nPteroSand\n, along with distributing updated versions of its existing tools like PteroPSDoor, PteroLNK, PteroVDoor, and PteroPSLoad.\nOther notable aspects of the Russian-aligned threat actor's tradecraft include the use of fast-flux DNS techniques and the reliance on legitimate third-party services like Telegram, Telegraph, Codeberg, and Cloudflare tunnels to obfuscate its command-and-control (C2) infrastructure.\n\"Despite observable capacity limitations and abandoning older tools, Gamaredon remains a significant threat actor due to its continuous innovation, aggressive spearphishing campaigns, and persistent efforts to evade detections,\" ESET said.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "AI Is Transforming Cybersecurity Adversarial Testing - Pentera Founder’s Vision",
        "Link": "https://thehackernews.com/2025/08/ai-is-transforming-cybersecurity.html",
        "Summary": "When Technology Resets the Playing Field\nIn 2015 I founded a cybersecurity testing software company with the belief that automated penetration testing was not only possible, but necessary. At the time, the idea was often met with skepticism, but today, with 1200+ of enterprise customers and thousands of users, that vision has proven itself. But I also know that what we’ve built so far is only",
        "Date": "2025-08-06",
        "Content": "When Technology Resets the Playing Field\nIn 2015 I founded a cybersecurity testing software company with the belief that automated penetration testing was not only possible, but necessary. At the time, the idea was often met with skepticism, but today, with 1200+ of enterprise customers and thousands of users, that vision has proven itself. But I also know that what we've built so far is only the foundation of what comes next.\nWe are now witnessing an inflection point with AI in cybersecurity testing that is going to rewrite the rules of what's possible. You might not see the change in a month's time, but in five years the domain is going to be unrecognizable.\nAs the CTO of Pentera, I have a vision for the company: one where\nany security threat scenario you can imagine, you can test\nwith the speed and intelligence only AI can provide. We have already started to implement the individual pieces of this reality into our platform. This article portrays the full vision I have for Pentera in years to come.\nAI isn't just another optimization layer for red team tools or security dashboards. It represents a change across the entire lifecycle of adversarial testing. It changes how payloads are created, how tests are executed, and how findings are interpreted. It is redefining what our automated security validation platform can do. Like your cellphone's touchscreen revolution, AI will become the intuitive interface, the engine behind execution, and the translator that turns raw data into decisions.\nAt Pentera\nAI is transforming every layer of adversarial testing.\nVibe Red Teaming\nPicture this. You're a CISO responsible for protecting a hybrid environment: Active Directory on-prem, production apps in Azure, and a vibrant dev team working across containers and SaaS.\nYou've just learned that a contractor's credentials were\naccidentally exposed in a GitHub repo\n. What you want to know isn't buried in a CVE database or a threat feed, you need to test if that specific access could lead to real damage.\nSo, you open Pentera and simply say:\n\"Check if the credentials john.smith@company.io can be used to access the finance database in production.\"\nNo scripts. No workflows. No playbooks.\nIn seconds, the platform understands your intent, scopes the environment, builds an attack plan, and emulates the adversary, safely and surgically. It doesn't stop there.\nIt adapts mid-test if your defenses react. It bypasses detection where possible, pauses when needed, and reevaluates the path based on live evidence.\nAnd when it's done?\nYou get a summary tailored for you; not a dump of raw data. Executives receive a high-level risk briefing. Your SOC gets the logs and findings. Your cloud team gets a remediation path.\nThat's\nVibe Red Teaming\n: where security validation becomes conversational, intelligent, and instantly actionable.\nIt gets better - picture this as well:\nImagine that from any security application or agent, for example your SOC you want to test for acceptance of your new Cloud environment. Alternatively imagine that your devops team would like to roll your new LLM application model into production.\nThose management applications, soon to turn agentic, will call the Pentera Attack-testing API and execute those tests as part of their workflow, assuring that any and every action in your infrastructure is inherently secure as from its inception.\nThat's a\ncallable testing sub-agent\n: where any security application and any script can call on security validation operations from within and verify the efficacy and correctness of security controls on the fly.\nTransforming Every Layer of Adversarial Testing\nTo bring this future to life, we're reimagining the adversarial testing lifecycle around intelligence, infusing AI into every layer of how pentesting and red-teaming exercises are imagined, executed, adapted, and understood. These pillars form the foundation of our vision for a smarter, more intuitive, more human form of security validation.\n1. Agenting the Product: The End of Clicks, the Rise of Conversation\nIn the future, you won't build tests in a template; you'll drive them in natural language. And as the test runs, you won't sit back and wait for results, you'll shape what happens next.\n\"Launch an access attempt from the contractor-okta identity group. Check if any accounts in that group can access file shares on 10.10.22.0/24. If access is granted, escalate privileges and attempt credential extraction. If any domain admin credentials are captured, pivot toward prod-db-finance.\"\nAnd once the test is in motion, you keep steering:\n\"Pause lateral movement. Focus only on privilege escalation paths from Workstation-203.\"\n\"Re-run credential harvesting using memory scraping instead of LSASS injection.\"\n\"Drop all actions targeting dev subnets, this scenario is finance only.\"\nThis is\nVibe Red Teaming\nin action:\nNo rigid workflows. No clicking through trees of options. No translation between human thought and test logic.\nYou define the scenario. You direct the flow. You adapt the path. The test becomes an extension of your intent, and your imagination as a tester. Instantly you have the power of red-teaming at your fingertips. Work is already underway to bring this experience to life, starting with early agentic capabilities that act on natural language input to give you more control over your testing in real-time.\n2. API-First Intelligence: Unlocking Granular Control of the Attack\nWe are building an API-first foundation for adversarial testing. Every attack capability - such as credential harvesting, lateral movement, or privilege escalation - will be exposed as an individual backend function. This allows AI to access and activate techniques directly, without depending on the user interface or predefined workflows.\nThis architecture gives AI the flexibility to engage only what is relevant to the current scenario. It can call specific capabilities in response to what it observes, apply them with precision, and adjust based on the environment in real time.\nAn API-first model also accelerates development. As soon as a new capability is available in the backend, AI can use it. It knows how to invoke the function, interpret the output, and apply the result as part of the test. There is no need to wait for the UI to catch up.\nThis shift enables faster iteration, greater adaptability, and more efficient use of every new capability. AI gains the freedom to act with context and control, activating only what is needed, exactly when it is needed.\n3. AI for Web Testing: The Web Surface, Weaponized\nThe impact of AI becomes even more visible when you look at how it shapes common web attack techniques. It doesn't necessarily invent new methods. It enhances them by applying real context.\nPentera has already introduced AI-based web attack surface testing into the platform, including AI-driven payload generation, adaptive testing logic, and deeper system awareness. These capabilities allow the platform to emulate attacker behavior with more precision, speed, and environmental sensitivity than was previously possible.\nIn the future, AI will make this surface testable in ways that aren't practical today. When new threat intelligence emerges, the platform will generate relevant payloads and apply them as soon as it encounters a matching system or opportunity.\nAI will also transform how sensitive data is discovered and used. It will parse terabytes of files, scripts, and databases, not with rigid patterns, but with the awareness of what an attacker is looking for—credentials, tokens, API keys, session identifiers, environment variables, and configuration secrets. At the same time, it will recognize the type of system it is interacting with and determine how that system typically behaves. This context allows AI to apply what it finds with precision. Credentials will be tested against relevant login flows. Tokens and session artifacts will be injected where they matter. Each step of the test will advance with intent, shaped by an understanding of both the environment and the opportunity within it.\nLanguage, structure, and regional variation have often made meaningful testing difficult or even impossible. AI already enables Pentera to remove that barrier. The platform interprets interface logic across languages and regional conventions without the need to rewrite flows or localize scripts. It recognizes intent and adapts accordingly.\nThis is the direction we're building toward. A system that uses intelligence to emulate threats with precision and helps you understand where to focus, what to fix, and how to secure your environments with confidence.\n4. Validating the LLM Attack surface\nAI infrastructure is becoming a core part of how organizations operate. Large language models (LLMs) process user input, store memory, connect to external tools, and influence decisions across environments. These systems often carry broad permissions and implicit trust, making them a high-value target for attackers.\nThe attack surface is growing. Prompt injection, data leakage, context poisoning, and hidden control flows are already being exploited. As LLMs are embedded into more workflows, attackers are learning how to manipulate them, extract data, and redirect behavior in ways that evade traditional detection.\nPentera's role is to ensure you can close that gap.\nWe will engage with LLMs through real-world inputs, workflows, and integrations designed to surface misuse. When a model produces an output that can be exploited, the test will continue with intent. That output will be used to gain access, move laterally, escalate privileges, or trigger actions in connected systems. The objective is to demonstrate how a compromised model can lead to meaningful impact across the environment.\nThis is not just about hardening the model. It's about validating the security of the entire system around it. Pentera will give security teams a clear view into how AI infrastructure can be exploited and where they present a risk to the organization. The result is confidence that your AI-enabled systems are not just operational, but secured by design.\n5. AI Insights: A Report That Speaks to You\nEvery test ends with a question: What does this mean for me?\nWe've already started answering that with\nAI-powered reporting available in the platform today\n. It surfaces key exposure trends, highlights remediation priorities, and provides security teams with a clearer view of how their posture is evolving over time. But that is just the foundation.\nThe vision we are building goes further. AI won't just summarize results. It will understand who is reading, why it matters to them, and how to deliver that insight in the most useful way.\nA security leader sees posture trends across quarters, with risk benchmarks tied to business objectives.\nAn engineer gets clear, actionable findings - no fluff, no digging.\nAnd a boardroom gets a one-page readout that connects security exposure to operational continuity.\nAnd the breakthrough is not just in content. It is in communication. The IT team in Mexico sees the report in Spanish. The regional lead in France reads it in French. No translation delays. No loss of meaning. No need to filter the information through someone else.\nThe report adapts. It clarifies. It prioritizes. It speaks to your role, your focus, your language. It's not documentation. It's insight delivered like it was written just for you, because it was.\n6. AI Support: Testing Without Roadblocks\nAI will reshape the support experience by reducing friction at every step - from answering common questions to resolving complex technical issues faster.\nA conversational chatbot will help users get unstuck in the moment. It will answer straightforward questions about platform usage, test setup, findings navigation, and general how-to guidance. This reduces reliance on documentation or human intervention for common tasks, giving users immediate clarity when they need it.\nFor more involved issues, AI will take on a much deeper role behind the scenes. Instead of waiting for a ticket to move through multiple support tiers, users will upload logs, screenshots, or error details directly into the support flow. AI will analyze the input, identify known patterns, and generate suggested resolutions automatically. It will determine whether the issue is usage-related, a known product behavior, or a likely bug - and escalate it only when needed, with full context already attached.\nThe outcome is faster resolution, fewer back-and-forth cycles, and a shift in the human role - from triaging every request to reviewing and finalizing solutions. Customers spend less time blocked, and more time moving forward.\nConclusion: From Test to Transformation\nVibe Red Teaming is a new experience in security testing. It doesn't start with configuration or scripting. It starts with intent. You describe what you want to validate, and the platform translates that into action.\nAI makes that possible. It turns ideas into tests, adapts in real time, and reflects the conditions of your environment as they evolve. You're not building scenarios from templates. You're directing real validation, on your terms.\nBuilt on the foundation of\nPentera's safe-by-design attack techniques\n, every action is controlled and built to avoid disruption, so teams can test aggressively without ever putting production at risk.\nThis is the foundation for a new model. Testing becomes continuous, expressive, and part of how security teams operate every day. The barrier to action disappears. Testing keeps pace with the threat.\nWe're already building toward that future now.\nNote:\nThis article was written by Dr. Arik Liberzon, Founder & CTO of Pentera.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "CISA Adds 3 D-Link Vulnerabilities to KEV Catalog Amid Active Exploitation Evidence",
        "Link": "https://thehackernews.com/2025/08/cisa-adds-3-d-link-router-flaws-to-kev.html",
        "Summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Tuesday added three old security flaws impacting D-Link Wi-Fi cameras and video recorders to its Known Exploited Vulnerabilities (KEV) catalog, based on evidence of active exploitation in the wild.\nThe high-severity vulnerabilities, which are from 2020 and 2022, are listed below -\n\nCVE-2020-25078 (CVSS score: 7.5) - An",
        "Date": "2025-08-06",
        "Content": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Tuesday\nadded\nthree old security flaws impacting D-Link Wi-Fi cameras and video recorders to its Known Exploited Vulnerabilities (\nKEV\n) catalog, based on evidence of active exploitation in the wild.\nThe high-severity vulnerabilities, which are from 2020 and 2022, are listed below -\nCVE-2020-25078\n(CVSS score: 7.5) - An unspecified vulnerability in D-Link DCS-2530L and DCS-2670L devices that could allow for remote administrator password disclosure\nCVE-2020-25079\n(CVSS score: 8.8) - An authenticated command injection vulnerability in the cgi-bin/ddns_enc.cgi component affecting D-Link DCS-2530L and DCS-2670L devices\nCVE-2020-40799\n(CVSS score: 8.8) - A download of code without an integrity check vulnerability in D-Link DNR-322L that could allow an authenticated attacker to execute operating system-level commands on the device\nThere are currently no details on how these shortcomings are being exploited in the wild, although a December 2024 advisory from the U.S. Federal Bureau of Investigation (FBI) warned of\nHiatusRAT campaigns\nactively scanning web cameras that are vulnerable to CVE-2020-25078.\nIt's worth noting that CVE-2020-40799\nremains unpatched\ndue to the affected model reaching end-of-life (EoL) status as of November 2021. Users still relying on DNR-322L are advised to discontinue and replace them. Fixes for the other two flaws were\nreleased\nby D-Link in 2020.\nIn light of active exploitation, it's essential that Federal Civilian Executive Branch (FCEB) agencies carry out the necessary mitigation steps by August 26, 2025, to secure their networks.\n(The story was updated after publication to emphasize that the issues affect D-Link Wi-Fi cameras and video recorders and not routers as previously stated. The error is regretted.)\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Akira ransomware abuses CPU tuning tool to disable Microsoft Defender",
        "Link": "https://www.bleepingcomputer.com/news/security/akira-ransomware-abuses-cpu-tuning-tool-to-disable-microsoft-defender/",
        "Summary": "Akira ransomware is abusing a legitimate Intel CPU tuning driver to turn off Microsoft Defender in attacks from security tools and EDRs running on target machines. [...]",
        "Date": "2025-08-06",
        "Content": "Akira ransomware is abusing a legitimate Intel CPU tuning driver to turn off Microsoft Defender in attacks from security tools and EDRs running on target machines.\nThe abused driver is 'rwdrv.sys' (used by ThrottleStop), which the threat actors register as a service to gain kernel-level access.\nThis driver is likely used to load a second driver, 'hlpdrv.sys,' a malicious tool that manipulates Windows Defender to turn off its protections.\nThis is a 'Bring Your Own Vulnerable Driver' (BYOVD) attack, where threat actors use legitimate signed drivers that have known vulnerabilities or weaknesses that can be abused to achieve privilege escalation. This driver is then used to load a malicious tool that disables Microsoft Defender.\n\"The second driver, hlpdrv.sys, is similarly registered as a service. When executed, it modifies the DisableAntiSpyware settings of Windows Defender within \\REGISTRY\\MACHINE\\SOFTWARE\\Policies\\Microsoft\\Windows Defender\\DisableAntiSpyware,\"\nexplain the researchers\n.\n\"The malware accomplishes this via execution of regedit.exe.\"\nThis tactic was observed by Guidepoint Security, which reports seeing repeated abuse of the rwdrv.sys driver in Akira ransomware attacks since July 15, 2025.\n\"We are flagging this behavior because of its ubiquity in recent Akira ransomware IR cases. This high-fidelity indicator can be used for proactive detection and retroactive threat hunting,\" continued the report.\nTo help defenders detect and block these attacks, Guidepoint Security has provided a YARA rule for hlpdrv.sys, as well as complete indicators of compromise (IoCs) for both drivers, their service names, and file paths where they are dropped.\nAkira attacks on SonicWall SSLVPN\nAkira ransomware was recently linked to attacks on SonicWall VPNs using what is believed to be an unknown flaw.\nGuidepoint Security says it could neither confirm nor debunk the exploitation of a zero-day vulnerability in SonicWall VPNs by Akira ransomware operators.\nIn response to reports about elevated offensive activity,\nSonicWall advised\ndisabling or restricting SSLVPN, enforcing multi-factor authentication (MFA), enabling Botnet/Geo-IP protection, and removing unused accounts.\nMeanwhile,\nThe DFIR Report\nhas published an analysis of recent Akira ransomware attacks, highlighting the use of the Bumblebee malware loader delivered via trojanized MSI installers of IT software tools.\nAn example involves searches for \"ManageEngine OpManager\" on Bing, where SEO poisoning redirected the victim to the malicious site opmanager[.]pro.\nMalicious website starting an Akira attack\nSource: The DFIR Report\nBumblebee is launched via DLL sideloading, and once C2 communication is established, it drops AdaptixC2 for persistent access.\nThe attackers then conduct internal reconnaissance, create privileged accounts, and exfiltrate data using FileZilla, while maintaining access via RustDesk and SSH tunnels.\nAfter approximately 44 hours, the main Akira ransomware payload (locker.exe) is deployed to encrypt systems across domains.\nUntil the SonicWall VPN situation clears up, system administrators should monitor for Akira-related activity and apply filters and blocks as indicators emerge from security research.\nIt is also strongly advised to only download software from official sites and mirrors, as impersonation sites have become a common source for malware.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nSonicWall urges admins to disable SSLVPN amid rising attacks\nSonicWall firewall devices hit in surge of Akira ransomware attacks\nRansomware gangs join attacks targeting Microsoft SharePoint servers\nSonicWall urges admins to patch critical RCE flaw in SMA 100 devices\nInside a Real Clickfix Attack: How This Social Engineering Hack Unfolds"
    },
    {
        "Title": "New Ghost Calls tactic abuses Zoom and Microsoft Teams for C2 operations",
        "Link": "https://www.bleepingcomputer.com/news/security/new-ghost-calls-tactic-abuses-zoom-and-microsoft-teams-for-c2-operations/",
        "Summary": "A new post-exploitation command-and-control (C2) evasion method called 'Ghost Calls' abuses TURN servers used by conferencing apps like Zoom and Microsoft Teams to tunnel traffic through trusted infrastructure. [...]",
        "Date": "2025-08-06",
        "Content": "A new post-exploitation command-and-control (C2) evasion method called 'Ghost Calls' abuses TURN servers used by conferencing apps like Zoom and Microsoft Teams to tunnel traffic through trusted infrastructure.\nGhost Calls uses legitimate credentials, WebRTC, and custom tooling to bypass most existing defenses and anti-abuse measures, without relying on an exploit.\nThis new tactic was presented by\nPraetorian\n's security researcher Adam Crosser at BlackHat USA, where it was highlighted that the new technique can be used by Red Teams when performing penetration emulation exercises.\n\"We leverage web conferencing protocols, which are designed for real-time, low-latency communication and operate through globally distributed media servers that function as natural traffic relays,\"\nreads the presentation's briefing\n.\n\"This approach allows operators to blend interactive C2 sessions into normal enterprise traffic patterns, appearing as nothing more than a temporarily joined online meeting.\"\nHow Ghost Calls works\nTURN (Traversal Using Relays around NAT) is a networking protocol commonly used by video call, VoIP, and WebRTC services that helps devices behind NAT firewalls communicate with each other when a direct connection is not possible.\nWhen a Zoom or Teams client joins a meeting, it receives temporary TURN credentials that the Ghost Calls can hijack to set up a TURN-based WebRTC tunnel between the attacker and the victim.\nThis tunnel can then be used to proxy arbitrary data or disguise C2 traffic as regular video conferencing traffic through trusted infrastructure used by Zoom or Teams.\nAs the traffic is routed through legitimate domains and IPs that are widely used in the enterprise, malicious traffic can bypass firewalls, proxies, and TLS inspection. Additionally, WebRTC traffic is encrypted, so it's well hidden.\nBy abusing these tools, attackers also avoid exposing their own domains and infrastructure while enjoying high-performance, reliable connectivity, and the adaptability of using both UDP and TCP over port 443.\nIn comparison, traditional C2 mechanisms are slow, conspicuous, and often lack the real-time exchange capabilities required to facilitate VNC operations.\nLocal port forwarding via Ghost Calls\nSource: Praetorian\nTURNt-ing it\nCrosser's research culminated with the development of a custom open-source (\navailable on GitHub\n) utility called 'TURNt' that can be used for tunneling C2 traffic via WebRTC TURN servers provided by Zoom and Teams.\nTURNt consists of two components, namely a Controller running on the attacker's side, and a Relay deployed on a compromised host.\nThe Controller runs a SOCKS proxy server to accept connections tunneled through TURN. Relay connects back to the Controller using TURN credentials, and sets up a WebRTC data channel through the provider's TURN server.\nSOCKS proxying on TURNt\nSource: Praetorian\nTURNt can perform SOCKS proxying, local or remote port forwarding, data exfiltration, and facilitate hidden VNC (Virtual Network Computing) traffic tunneling.\nAlthough Ghost Calls does not exploit any vulnerabilities in Zoom or Microsoft Teams, BleepingComputer has contacted both vendors to ask if they plan to introduce additional safeguards to reduce its feasibility. We will update this post once we receive a response from either.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nAttackers exploit link-wrapping services to steal Microsoft 365 logins\nHackers exploit SAP NetWeaver bug to deploy Linux Auto-Color malware\nMicrosoft Teams voice calls abused to push Matanbuchus malware\nAndroid malware Konfety uses malformed APKs to evade detection\nHackers abuse leaked Shellter red team tool to deploy infostealers"
    },
    {
        "Title": "Hacker extradited to US for stealing $3.3 million from taxpayers",
        "Link": "https://www.bleepingcomputer.com/news/security/hacker-extradited-to-us-for-stealing-33-million-from-taxpayers/",
        "Summary": "Nigerian national Chukwuemeka Victor Amachukwu has been extradited from France to the U.S. to face charges of hacking, fraud, and identity theft for suspected spearphishing attacks on U.S. tax preparation businesses. [...]",
        "Date": "2025-08-06",
        "Content": "Nigerian national Chukwuemeka Victor Amachukwu has been extradited from France to the U.S. to face charges of hacking, fraud, and identity theft for suspected spearphishing attacks on U.S. tax preparation businesses.\nThe attack were designed to steal personal data and file fraudulent tax and loan applications, allowing threat actors to steal over $3 million in total.\nSpecifically, the Nigerian national allegedly obtained approximately $2,500,000 from fraudulent tax refunds (out of $8.4 million attempted), and another $819,000 from fraudulent SBA loan applications.\nThe DOJ says Amachukwu was running a separate scam involving fake investment opportunities.\n\"Chukwuemeka Victor Amachukwu took part in a scheme to hack into U.S. tax businesses, trade in the stolen identifying information of victims, and defraud the IRS and other governmental bodies,\"\nstated U.S. Attorney Jay Clayton.\n\"Amachukwu also allegedly took part in a separate fraud scheme that promised his victims valuable investments that did not in fact exist.\"\nAccording to\nthe indictment\n, Amachukwu launched spearphishing attacks between 2019 and 2021, along with co-defendant Kingsley Uchelue Utulu, and other co-conspirators in Nigeria, targeting U.S.-based entities.\nThe hackers used the phishing emails to gain unauthorized access to their targets' computers and steal tax and personally identifiable information (PII) of thousands of U.S. citizens.\nThey then used this information to file fraudulent IRS tax returns and SBA loan claims, causing damages of over $3.3 million to the U.S. state.\nIn parallel, Amachukwu ran a fake investment scheme involving non-existent standby letters of credit, where victims were convinced to invest millions of dollars in fictitious offerings. In reality, all money went directly to Amachukwu, and no investments were made.\nThe extradited individual now faces charges corresponding to six counts, including:\nConspiracy to Commit Computer Intrusions (5 years max)\nConspiracy to Commit Wire Fraud (two counts, 20 years each)\nWire Fraud (two counts, 20 years each)\nAggravated Identity Theft (mandatory 2-year consecutive sentence)\nMoreover, the U.S. seeks forfeiture of all fraud proceeds, including funds, property, or other valuables derived from the criminal schemes, or substitute assets of the same value.\nAmachukwu was extradited from France on August 4, 2025, and appeared before a U.S. Magistrate Judge Robert W. Lehrburger for his initial court hearing the next day. A trial date has not been scheduled yet.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nEuropol helps disrupt $540 million crypto investment fraud ring\nU.S. Army soldier pleads guilty to extorting 10 tech, telecom firms\nPolice dismantles investment fraud ring stealing €10 million\nFBI: Cybercriminals steal health data posing as fraud investigators\nUS arrests suspects behind $73M ‘pig butchering’ laundering scheme"
    },
    {
        "Title": "MFA matters… But it isn’t enough on its own",
        "Link": "https://www.bleepingcomputer.com/news/security/mfa-matters-but-it-isnt-enough-on-its-own/",
        "Summary": "MFA blocks 99% of attacks—but weak passwords still let attackers in. Specops helps you enforce strong password policies and MFA everywhere, so one layer doesn't undo the other. Book your free trial today. [...]",
        "Date": "2025-08-06",
        "Content": "Unprotected usernames and passwords offer little defense against account takeover attacks. Multi-factor authentication (MFA) has quite rightly become the de facto standard for strengthening access controls.\nThere’s a reason almost all cybersecurity guidelines recommend it – Microsoft research suggests that enabling MFA can\nblock over 99%\nof automated credential-stuffing and phishing attacks.\nYet even the best MFA implementations leave a critical gap: weak, reused or compromised passwords. When an attacker bypasses or circumvents MFA (whether by tricking a user into approving a push notification or exploiting a fallback) those same poor passwords become the attacker’s key to your systems.\nThat’s why a layered approach to identity security must include both robust password hygiene and MFA on every login point.\nThe benefits of MFA are undeniable\nBefore we explore why passwords still matter, let’s briefly recap what MFA brings to the table:\nAn extra barrier to entry:\nEven if an attacker steals or guesses your password, they still need a second factor (like a one-time code or biometric scan) to complete the login.\nPhishing resilience:\nMFA tokens and push-based approvals raise the bar for credential-harvesting campaigns. Stealing a password alone isn’t enough.\nRegulatory alignment:\nStandards such as NIST\nrecommend MFA for sensitive or high-value accounts. Implementing it helps meet compliance mandates in finance, healthcare, government, and beyond.\nUser confidence:\nWhen employees or customers know their accounts are protected by more than just a password, trust and engagement often rise.\nCost avoidance:\nThe upfront investment in MFA pays dividends in prevented breach costs—legal fees, incident response, brand damage and more.\nWhy MFA alone can leave you exposed\nDespite its strengths, MFA is not a silver bullet and\nit can be bypassed\n. Overreliance on it can lull organizations into complacency around the most basic authentication factor: the password. Layered defense depends on each layer holding its weight, and a password is the entry point for the MFA challenge.\nIf that password is weak, reused or already known to attackers, they’re one step closer to breaching your perimeter.\nLost or broken devices, forgotten tokens and service-desk resets often revert back to password-only access. Without a strong password policy, these “break-glass” scenarios become easy entry points. User behavior also doesn’t change overnight – organizations that adopt MFA without reinforcing password education frequently see users continue to pick weak or predictable passwords.\nThis undermines one of your strongest defenses.\nOn top of that, MFA itself can be targeted. Techniques such as SIM swapping, MFA prompt bombing, and social engineering around help-desk procedures can trick users or staff into approving fraudulent logins.\nFive tactics attackers use to bypass MFA\nMFA fatigue attacks (also known as\nMFA prompt-bombing\n)\n. By triggering dozens of push notifications in quick succession, attackers wear down victims until they approve “just to make it stop.”\nSIM swap & SMS hijack.\nDefaulting to SMS-based one-time codes exposes users to mobile-network attacks that hand control of the second factor over to the adversary.\nSocial engineering at the help desk.\nImpersonating a locked-out user, an attacker convinces support staff to disable MFA or reset credentials, often using nothing more than a plausible story. For example, the recent\nmajor hack on MGM Resorts\n.\nSession hijacking & token theft.\nCookies and session tokens can be intercepted or stolen through malware and man-in-the-middle exploits, letting attackers bypass both passwords and MFA.\nExploiting backup methods.\nForgotten-password questions, recovery codes and email resets frequently lack the rigor of primary MFA channels, creating alternative pathways into accounts.\nLayering strong passwords and MFA\nNo single control can stop every attack. By pairing comprehensive password defenses with robust MFA on every critical system (Windows logon, VPNs, remote desktop, cloud portals and more) you create multiple hurdles for adversaries to overcome. Even if one layer is bypassed, others remain to block or detect the intrusion.\nTo harden your defenses, incorporate these best practices:\nEnable MFA:\nIf you haven’t already, this is the obvious place to start. Consider a simple, effective MFA solution such as\nSpecops Secure Access\nthat can protect Windows Logon, VPNs, and RDP connections.\nEnforce minimum length and complexity.\nRequire at least 15 characters, as length offers the best protection against brute-force techniques.\nPassphrases are the best way\nto get users to create strong, long passwords.\nBlock known-compromised credentials.\nIntegrate real-time checks against breach-compiled lists to prevent users from choosing passwords that have already appeared in data leaks.\nSpecops Password Policy\nblocks the creation of weak passwords and continuously scans your Active Directory for over 4 billion breached passwords.\nBook a free trial today\n.\nProtect your service desk\n. Solutions such as\nSpecops Secure Service Desk\nenforce a secondary MFA challenge to confirm the identity of anyone contacting your service desk.\nMonitor for unusual login patterns.\nCombine password and MFA logs to detect anomalies—like logins from unfamiliar locations or devices—and trigger step-up authentication when needed.\nMFA dramatically reduces the risk of unauthorized access, but it should\nnever\nreplace strong password hygiene.\nTreat passwords as the important security layer they are. Enforce policies that keep them long, unique, and uncompromised – then add MFA as the critical second line of defense.\nTogether, they form a resilient authentication strategy that will keep your organization and your end users far safer.\nNeed advice on MFA or password security?\nGet in touch\n.\nSponsored and written by\nSpecops Software\n."
    },
    {
        "Title": "Google suffers data breach in ongoing Salesforce data theft attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/google-suffers-data-breach-in-ongoing-salesforce-data-theft-attacks/",
        "Summary": "Google is the latest company to suffer a data breach in an ongoing wave of Salesforce CRM data theft attacks conducted by the ShinyHunters extortion group. [...]",
        "Date": "2025-08-06",
        "Content": "Google is the latest company to suffer a data breach in an ongoing wave of Salesforce CRM data theft attacks conducted by the ShinyHunters extortion group.\nIn June,\nGoogle warned\nthat a threat actor they classify as 'UNC6040' is targeting companies' employees in voice phishing (vishing) social engineering attacks to breach Salesforce instances and download customer data. This data is then used to extort companies into paying a ransom to prevent the data from being leaked.\nIn a brief update to the article last night, Google said that it too fell victim to the same attack in June after one of its Salesforce CRM instances was breached and customer data was stolen.\n\"In June, one of Google's corporate Salesforce instances was impacted by similar UNC6040 activity described in this post. Google responded to the activity, performed an impact analysis and began mitigations,\"\nreads Google's update\n.\n\"The instance was used to store contact information and related notes for small and medium businesses. Analysis revealed that data was retrieved by the threat actor during a small window of time before the access was cut off.\"\n\"The data retrieved by the threat actor was confined to basic and largely publicly available business information, such as business names and contact details.\"\nGoogle is classifying the threat actors behind these attacks as 'UNC6040' or 'UNC6240.' However, BleepingComputer, which has been tracking these attacks, has learned that a notorious threat actor known as\nShinyHunters is behind the attacks\n.\nShinyHunters has been around for years, responsible for a wide range of breaches, including those at\nPowerSchool\n,\nOracle Cloud\n, the\nSnowflake data-theft attacks\n,\nAT&T\n,\nNitroPDF\n,\nWattpad\n,\nMathWay\n, and\nmany more\n.\nIn a conversation with BleepingComputer yesterday, ShinyHunters claimed to have breached many Salesforce instances, with attacks still ongoing.\nThe threat actor claimed yesterday to BleepingComputer that they breached a trillion-dollar company, and were considering just leaking the data rather than attempting to extort them. It is unclear if this company is Google.\nAs for the other companies impacted in these attacks, the threat actor is extorting them through email, demanding they pay a ransom to prevent the data from being publicly leaked.\nOnce the threat actor has finished privately extorting companies, they plan to publicly leak or sell data on a hacking forum.\nBleepingComputer has learned of one company that has already paid 4 Bitcoins, or approximately $400,000, to prevent the leak of their data.\nOther companies impacted in these attacks include\nAdidas\n,\nQantas\n,\nAllianz Life\n,\nCisco\n, and the LVMH subsidiaries\nLouis Vuitton\n,\nDior\n, and\nTiffany & Co.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nPandora confirms data breach amid ongoing Salesforce data theft attacks\nFashion giant Chanel hit in wave of Salesforce data theft attacks\nShinyHunters behind Salesforce data theft attacks at Qantas, Allianz Life, and LVMH\nHacker leaks 386 million user records from 18 companies for free\nCisco discloses data breach impacting Cisco.com user accounts"
    },
    {
        "Title": "National Bank of Canada online systems down due to 'technical issue'",
        "Link": "https://www.bleepingcomputer.com/news/technology/national-bank-of-canada-online-systems-down-due-to-technical-issue/",
        "Summary": "National Bank of Canada (Banque Nationale du Canada), the sixth largest commercial bank of Canada is currently experiencing a widespread service outage affecting its online banking and mobile app platforms. [...]",
        "Date": "2025-08-06",
        "Content": "National Bank of Canada (Banque Nationale du Canada), the sixth largest commercial bank of Canada is currently experiencing a widespread service outage affecting its online banking and mobile app platforms.\nSocial media reports suggest that the issues began earlier this morning, with customers encountering a \"maintenance\" message when attempting to access their accounts via online banking on web and mobile app.\nHeadquartered in Montreal, NBC (BNC) serves more than 2.4 million personal banking clients and employs over 30,000 staff across Canada.\nNational Bank customers experiencing widespread outage\nUsers visiting the National Bank's online banking website,\napp.bnc.ca\n, are being redirected to a \"Maintenance in progress\" placeholder page this morning:\nNational Bank of Canada website showing maintenance message\n(BleepingComputer)\nIn tests by BleepingComputer, the mobile app is also inaccessible as of earlier this morning:\nNational Bank of Canada's mobile app down\n(BleepingComputer)\nAt this time, it is unclear what caused the outage or when services will be fully restored.\nNeedless to say, the unavailability of digital banking services has left customers wondering:\n@nationalbank\nwhat's going on with your systems this morning?\n— Jordyn (@jordynhewer)\nAugust 6, 2025\n@nationalbank\nI am not able to open my account either through app or through website since last night. Need help here.\n— Ankit Mehta (@Ankit_2905)\nAugust 6, 2025\nBleepingComputer has approached the bank to learn about what is causing the outage. The bank is currently investigating the issue:\n(\nNational Bank on X\n, formerly Twitter)\n(\nNational Bank on X\n, formerly Twitter)\nUpdate(s):\nAugust 6th, 10:15 AM ET:\nOnline banking services appear to be slowly coming back up with limited functionality available for logged in users:\n\"Due to a technical issue, our transactional services are temporarily unavailable. However, you can still view your account information as well as your most recent transactions.\"\nBleepingComputer is still unable to view the most recent transactions screen, however, due to ongoing issues. The mobile app remains inaccessible.\nAugust 6th, 11:00 AM ET:\nBoth online banking and the mobile app are now accessible. The outage appears to have lasted at least three and a half hours.\nAugust 6th, 1:40 PM ET:\nA National Bank spokesperson confirmed to BleepingComputer via email that the outage did not result from any cybersecurity event:\n\"We experienced a temporary outage with our mobile and internet banking services. These services have been restored this morning.\nI can confirm that there is no indication that this interruption was related to any security or cybersecurity concerns.\"\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft investigates outage affecting Microsoft 365 admin center\nCloudflare says 1.1.1.1 outage not caused by attack or BGP hijack\nIngram Micro starts restoring systems after ransomware attack\nIngram Micro suffers global outage as internal systems inaccessible\nMicrosoft investigates ongoing SharePoint Online access issues"
    },
    {
        "Title": "ReVault flaws let hackers bypass Windows login on Dell laptops",
        "Link": "https://www.bleepingcomputer.com/news/security/revault-flaws-let-hackers-bypass-windows-login-on-dell-laptops/",
        "Summary": "ControlVault3 firmware vulnerabilities impacting over 100 Dell laptop models can allow attackers to bypass Windows login and install malware that persists across system reinstalls. [...]",
        "Date": "2025-08-06",
        "Content": "ControlVault3 firmware vulnerabilities impacting over 100 Dell laptop models can allow attackers to bypass Windows login and install malware that persists across system reinstalls.\nDell ControlVault is a hardware-based security solution that stores passwords, biometric data, and security codes within firmware on a dedicated daughterboard, known as the Unified Security Hub (USH).\nThe five vulnerabilities, reported by Cisco's Talos security division and dubbed \"\nReVault\n,\" affect both the ControlVault3 firmware and its Windows application programming interfaces (APIs) across Dell's business-focused Latitude and Precision laptop series.\nThese devices are popular in cybersecurity, government, and industrial environments, where smartcards, fingerprints, and NFC are also commonly used for authentication.\nThe complete list of ReVault vulnerabilities includes out-of-bounds flaws (CVE-2025-24311, CVE-2025-25050), an arbitrary free vulnerability (CVE-2025-25215), a stack overflow (CVE-2025-24922, and an unsafe deserialization issue (CVE-2025-24919) affecting ControlVault's Windows APIs.\nDell\nhas released security updates\nto address the ReVault flaws in the ControlVault3 driver and firmware between March and May. The full list of impacted models is available in\nDell's security advisory\n.\nWindows login bypass and privilege escalation\nChaining these vulnerabilities can allow attackers to gain arbitrary code execution on the firmware, potentially creating persistent implants that survive Windows reinstalls.\nThey can also leverage physical access to bypass Windows login or escalate local user privileges to the administrator level.\n\"A local attacker with physical access to a user's laptop can pry it open and directly access the USH board over USB with a custom connector,\"\nCisco Talos said\n.\n\"From there, all the vulnerabilities described previously become in-scope for the attacker without requiring the ability to log-in into the system or knowing a full-disk encryption password.\"\nSuccessful exploitation can also enable attackers to manipulate fingerprint authentication, forcing the targeted device\nto accept any fingerprint\nrather than only those of legitimate users.\nTalos recommends keeping systems updated through Windows Update or Dell's website, disabling unused security peripherals like fingerprint readers, smart card readers, and NFC readers, and disabling fingerprint login in high-risk situations.\nTo mitigate some of the physical attacks, the researchers also suggested enabling chassis intrusion detection in computer BIOS settings to flag physical tampering attempts and Enhanced Sign-in Security (ESS) in Windows to detect inappropriate CV firmware.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft July 2025 Patch Tuesday fixes one zero-day, 137 flaws\nWordPress Motors theme flaw mass-exploited to hijack admin accounts\nASUS Armoury Crate bug lets attackers get Windows admin privileges\nNew Secure Boot flaw lets attackers install bootkit malware, patch now\nHackers exploited Windows WebDav zero-day to drop malware"
    },
    {
        "Title": "WhatsApp adds new security feature to protect against scams",
        "Link": "https://www.bleepingcomputer.com/news/security/whatsapp-adds-new-security-feature-to-protect-against-scams/",
        "Summary": "WhatsApp is introducing a new security feature that will help users spot potential scams when they are being added to a group chat by someone not in their contact list. [...]",
        "Date": "2025-08-06",
        "Content": "WhatsApp is introducing a new security feature that will help users spot potential scams when they are being added to a group chat by someone not in their contact list.\nThis feature displays a \"safety overview\" context card that includes information about the group's creation date, the number of members, potential scam attempts, and instructions on how to control who can add you to WhatsApp groups.\n\"It will include key information about the group and tips to stay safe. From there, you can exit the group without ever having to look at the chat,\"\nthe company said\n.\n\"And if you think you might recognize the group after seeing the safety overview, you can choose to see the chat for more context. Regardless, notifications from the group will be silenced until you mark that you want to stay.\"\nTo defend users against scammers trying to reach out directly, WhatsApp also notifies them when contacted by someone outside their contacts, offering additional context about the person they're messaging.\n\"We encourage you to pause, question, and verify, before responding to a suspicious or unusual message, especially if it's from a number you don't know promising fast money,\" the company added.\nNew scam group alert (WhatsApp)\nWhatsApp also revealed on Tuesday that it has disabled over 6.8 million accounts in the first six months of this year, linked to scam centers targeting its users.\nEarlier this year, the company also\ncollaborated with OpenAI\nto dismantle a criminal scam center in Cambodia that operated scams ranging from luring targets to invest in cryptocurrency and offering payments for fake likes to enlisting victims in a rent-a-scooter pyramid scheme.\nIn one case, the scammers generated an initial text message using ChatGPT, which contained a link to a WhatsApp chat that redirected the target to Telegram, where the task was to like videos on TikTok.\n\"These scam centers typically run many scam campaigns at once – from cryptocurrency investments to pyramid schemes,\" the company said.\n\"Scams may start with a text message or on a dating app, then move to social media, private messaging apps and ultimately payment or crypto platforms.\"\nIn April, WhatsApp also\nintroduced a new Advanced Chat Privacy feature\ndesigned to protect sensitive information exchanged in private chats and group conversations.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nInstagram ads mimicking BMO, EQ Bank are finance scams\nPwn2Own hacking contest pays $1 million for WhatsApp exploit\nHackers scanning for TeleMessage Signal clone flaw exposing passwords\nWindows 11 now uses JScript9Legacy engine for improved security\nSamsung announces major security enhancements coming to One UI 8"
    },
    {
        "Title": "Trend Micro warns of Apex One zero-day exploited in attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/trend-micro-warns-of-endpoint-protection-zero-day-exploited-in-attacks/",
        "Summary": "Trend Micro has warned customers to immediately secure their systems against an actively exploited remote code execution vulnerability in its Apex One endpoint security platform. [...]",
        "Date": "2025-08-06",
        "Content": "Trend Micro has warned customers to immediately secure their systems against an actively exploited remote code execution vulnerability in its Apex One endpoint security platform.\nApex One\nis an endpoint security platform designed to automatically detect and respond to threats, including malicious tools, malware, and vulnerabilities.\nThis critical security flaw (tracked as\nCVE-2025-54948\nand\nCVE-2025-54987\ndepending on the CPU architecture) is due to a command injection weakness in the Apex One Management Console (on-premise) that enables pre-authenticated attackers to execute arbitrary code remotely on systems running unpatched software.\nTrend Micro has yet to issue security updates to patch this actively exploited vulnerability, but it has released a mitigation tool that provides short-term mitigation against exploitation attempts.\nThe Japanese CERT also\nissued an alert\nregarding the active exploitation of the two flaws, urging users to mitigate them as soon as possible.\n\"While it will fully protect against known exploits, it will disable the ability for administrators to utilize the Remote Install Agent function to deploy agents from the Trend Micro Apex One Management Console,\" the company\nexplained\nin a Tuesday advisory.\n\"Trend Micro has observed as least one instance of an attempt to actively exploit one of these vulnerabilities in the wild.\"\nSecurity patches coming mid-August\nThe company said it will release a patch around the middle of August 2025, which will also restore the Remote Install Agent functionality disabled by the mitigation tool.\nUntil a security patch is available, Trend Micro urged administrators to promptly secure vulnerable endpoints, even if this means temporarily losing remote management capabilities.\n\"For this particular vulnerability, an attacker must have access to the Trend Micro Apex One Management Console, so customers that have their console's IP address exposed externally should consider mitigating factors such as source restrictions if not already applied,\" it added.\n\"However, even though an exploit may require several specific conditions to be met, Trend Micro strongly encourages customers to update to the latest builds as soon as possible.\"\nTrend Micro has patched two other Apex One zero-day vulnerabilities, one of them exploited in the wild in\nSeptember 2022\n(CVE-2022-40139) and another in\nSeptember 2023\n(CVE-2023-41179).\nEarlier this month, the company\nalso addressed\nmultiple critical-severity remote code execution and authentication bypass flaws in its Apex Central and Endpoint Encryption (TMEE) PolicyServer products.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nTrend Micro fixes critical vulnerabilities in multiple products\nSonicWall urges admins to patch critical RCE flaw in SMA 100 devices\nCISA flags PaperCut RCE bug as exploited in attacks, patch now\nCisco: Maximum-severity ISE RCE flaws now exploited in attacks\nMax severity Cisco ISE bug allows pre-auth command execution, patch now"
    },
    {
        "Title": "Microsoft pays record $17 million in bounties over the last 12 months",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-pays-record-17-million-in-bounties-over-the-last-12-months/",
        "Summary": "​Microsoft paid a record $17 million this year to 344 security researchers across 59 countries through its bug bounty program. [...]",
        "Date": "2025-08-06",
        "Content": "​Microsoft paid a record $17 million this year to 344 security researchers across 59 countries through its bug bounty program.\nBetween July 2024 and June 2025, the researchers submitted a total of 1,469 eligible vulnerability reports, with the highest individual bounty reaching $200,000.\nThese reports helped resolve more than 1,000 potential security vulnerabilities across various Microsoft products and platforms, including Azure, Microsoft 365, Dynamics 365, Power Platform, Windows, Edge, and Xbox.\n\"By incentivizing independent researchers to identify vulnerabilities in high-impact areas, including the rapidly evolving field of AI, we're able to stay ahead of emerging threats,\" Microsoft\nstated\nin its annual bounty program review.\n\"Through Coordinated Vulnerability Disclosure, these researchers play a critical role in reinforcing the trust that millions of users place in Microsoft technologies every day.\"\nDuring the previous year, Microsoft\npaid another $16.6 million\nin bounty awards to 343 security researchers from 55 countries.\nBug bounty program updates\nThe company has also expanded several bounty programs this year, such as Copilot AI, Defender products, and various identity management systems.\nFor instance, the Copilot bounty program now includes traditional online service vulnerabilities, the Dynamics 365 and Power Platform programs introduced a new AI category, and the Windows program has added awards for remote denial-of-service attacks and local sandbox escape scenarios.\nAdditionally, the Identity bounty program now covers more APIs and domains, and the Defender program has added Microsoft Defender for Identity (MDI), Microsoft Defender for Office (MDO), and Microsoft Defender for Cloud Applications (MDA).\nMore recently, Microsoft announced\nhigher payouts\nfor moderate-severity Microsoft Copilot (AI) security flaws,\nincreased rewards to $40,000\nfor some .NET and ASP.NET Core vulnerabilities, and\nraised bounty awards\nfor Power Platform and Dynamics 365 AI flaws.\nOn Monday, the company\nrevealed\nthat it will offer up to $5 million in bounty awards at this year's Zero Day Quest hacking contest, described as the \"largest hacking event in history.\"\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft increases Zero Day Quest prize pool to $5 million\nMicrosoft now pays up to $40,000 for some .NET vulnerabilities\nMicrosoft: Outdated Office apps lose access to voice features in January\nMicrosoft to disable Excel workbook links to blocked file types\nMicrosoft Edge now an 'AI-powered browser' with Copilot Mode"
    },
    {
        "Title": "Critical Zero-Day Bugs Crack Open CyberArk, HashiCorp Password Vaults",
        "Link": "https://www.darkreading.com/cybersecurity-operations/critical-zero-day-bugs-cyberark-hashicorp-password-vaults",
        "Summary": "Secrets managers hold all the keys to an enterprise's kingdom. Two popular ones had longstanding, critical, unauthenticated RCE vulnerabilities.",
        "Date": "2025-08-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/critical-zero-day-bugs-cyberark-hashicorp-password-vaults"
    },
    {
        "Title": "'ReVault' Security Flaws Impact Millions of Dell Laptops",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/revault-security-flaws-dell-laptops",
        "Summary": "The now-patched vulnerabilities exist at the firmware level and enable deep persistence on compromised systems.",
        "Date": "2025-08-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/revault-security-flaws-dell-laptops"
    },
    {
        "Title": "VexTrio Cybercrime Outfit Run by Legit Ad Tech Firms",
        "Link": "https://www.darkreading.com/threat-intelligence/vextrio-cybercrime-outfit-legit-ad-tech",
        "Summary": "New research reveals that a malicious traffic distribution system (TDS) is run not by &quot;hackers in hoodies,&quot; but by a series of corporations operating in the commercial digital advertising industry.",
        "Date": "2025-08-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/vextrio-cybercrime-outfit-legit-ad-tech"
    },
    {
        "Title": "Google Gemini AI Bot Hijacks Smart Homes, Turns Off the Lights",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/google-gemini-ai-bot-hijacks-smart-homes",
        "Summary": "Using invisible prompts, the attacks demonstrate a physical risk that could soon become reality as the world increasingly becomes more interconnected with artificial intelligence.",
        "Date": "2025-08-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/google-gemini-ai-bot-hijacks-smart-homes"
    },
    {
        "Title": "Attackers Exploit Critical Trend Micro Apex One Zero-Day Flaw",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/attackers-exploit-trend-micro-apex-one-zero-day-flaw",
        "Summary": "Two critical vulnerabilities affect the security vendor's management console, one of which is under active exploitation. The company has updated cloud-based products but won't have a patch for its on-premises version until mid-August.",
        "Date": "2025-08-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/attackers-exploit-trend-micro-apex-one-zero-day-flaw"
    },
    {
        "Title": "What CMMC 3.0 Really Means for Government Contractors",
        "Link": "https://www.darkreading.com/cybersecurity-operations/what-cmmc-30-means-government-contractors",
        "Summary": "The ultimate goal of CMMC 3.0 is not just compliance — it's resilience.",
        "Date": "2025-08-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/what-cmmc-30-means-government-contractors"
    },
    {
        "Title": "Phishers Abuse Microsoft 365 to Spoof Internal Users",
        "Link": "https://www.darkreading.com/cyber-risk/phishers-abuse-m365-direct-send-to-spoof-internal-users",
        "Summary": "The &quot;Direct Send&quot; feature simplifies internal message delivery for trusted systems, and the campaign successfully duped both Microsoft Defender and third-party secure email gateways.",
        "Date": "2025-08-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/phishers-abuse-m365-direct-send-to-spoof-internal-users"
    },
    {
        "Title": "With Eyes on AI, African Orgs Push Security Awareness",
        "Link": "https://www.darkreading.com/cybersecurity-operations/eyes-ai-african-orgs-push-security-awareness",
        "Summary": "Against the backdrop of the artificial intelligence surge, most African organizations have some form of cybersecurity awareness training but fail to test frequently and don't trust the results.",
        "Date": "2025-08-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/eyes-ai-african-orgs-push-security-awareness"
    },
    {
        "Title": "To Raise or Not to Raise: Bootstrapped Founders Share Their Views",
        "Link": "https://www.darkreading.com/cyber-risk/to-raise-or-not-to-raise-bootstrapped-founders",
        "Summary": "A trio of startup founders — GreyNoise's Andrew Morris, Thinkst Canary's Haroon Meer, and runZero's HD Moore — agree that raising venture capital funding can be beneficial, but a company's success depends on how well the product fits customer needs.",
        "Date": "2025-08-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/to-raise-or-not-to-raise-bootstrapped-founders"
    },
    {
        "Title": "Who Got Arrested in the Raid on the XSS Crime Forum?",
        "Link": "https://krebsonsecurity.com/2025/08/who-got-arrested-in-the-raid-on-the-xss-crime-forum/",
        "Summary": "On July 22, 2025, the European police agency Europol said a long-running investigation led by the French Police resulted in the arrest of a 38-year-old administrator of XSS, a Russian-language cybercrime forum with more than 50,000 members. The action has triggered an ongoing frenzy of speculation and panic among XSS denizens about the identity of the unnamed suspect, but the consensus is that he is a pivotal figure in the crime forum scene who goes by the hacker handle \"Toha.\" Here's a deep dive on what's knowable about Toha, and a short stab at who got nabbed.",
        "Date": "2025-08-06",
        "Content": "On July 22, 2025, the European police agency Europol said a long-running investigation led by the French Police resulted in the arrest of a 38-year-old administrator of XSS, a Russian-language cybercrime forum with more than 50,000 members. The action has triggered an ongoing frenzy of speculation and panic among XSS denizens about the identity of the unnamed suspect, but the consensus is that he is a pivotal figure in the crime forum scene who goes by the hacker handle “Toha.” Here’s a deep dive on what’s knowable about Toha, and a short stab at who got nabbed.\nAn unnamed 38-year-old man was arrested in Kiev last month on suspicion of administering the cybercrime forum XSS. Image: ssu.gov.ua.\nEuropol did not name the accused, but published partially obscured photos of him from the raid on his residence in Kiev. The police agency said the suspect acted as a trusted third party — arbitrating disputes between criminals — and guaranteeing the security of transactions on XSS. A statement from Ukraine’s SBU security service said XSS counted among its members many cybercriminals from various ransomware groups, including REvil, LockBit, Conti, and Qiliin.\nSince the Europol announcement, the XSS forum resurfaced at a new address on the deep web (reachable only via the anonymity network Tor). But from reviewing the recent posts, there appears to be little consensus among longtime members about the identity of the now-detained XSS administrator.\nThe most frequent comment regarding the arrest was a message of solidarity and support for Toha, the handle chosen by the longtime administrator of XSS and several other major Russian forums. Toha’s accounts on other forums have been silent since the raid.\nEuropol said the suspect has enjoyed a nearly 20-year career in cybercrime, which roughly lines up with Toha’s history. In 2005, Toha was a founding member of the Russian-speaking forum Hack-All. That is, until it got massively hacked a few months after its debut. In 2006, Toha rebranded the forum to exploit[.]in, which would go on to draw tens of thousands of members, including an eventual Who’s-Who of wanted cybercriminals.\nToha announced in 2018 that he was selling the Exploit forum, prompting rampant speculation on the forums that the buyer was secretly a Russian or Ukrainian government entity or front person. However, those suspicions were unsupported by evidence, and Toha vehemently denied the forum had been given over to authorities.\nOne of the oldest Russian-language cybercrime forums was DaMaGeLaB, which operated from 2004 to 2017, when its administrator “Ar3s” was arrested. In 2018, a partial backup of the DaMaGeLaB forum was reincarnated as xss[.]is, with Toha as its stated administrator.\nClues about Toha’s early presence on the Internet — from ~2004 to 2010 — are available in the archives of Intel 471, a cyber intelligence firm that tracks forum activity. Intel 471 shows Toha used the same email address across multiple forum accounts, including at Exploit, Antichat, Carder[.]su and inattack[.]ru.\nDomainTools.com finds Toha’s email address — toschka2003@yandex.ru — was used to register at least a dozen domain names — most of them from the mid- to late 2000s. Apart from exploit[.]in and a domain called ixyq[.]com, the other domains registered to that email address end in .ua, the top-level domain for Ukraine (e.g. deleted.org[.]ua, lj.com[.]ua, and blogspot.org[.]ua).\nA 2008 snapshot of a domain registered to toschka2003@yandex.ru and to Anton Medvedovsky in Kiev. Note the message at the bottom left, “Protected by Exploit,in.” Image: archive.org.\nNearly all of the domains registered to toschka2003@yandex.ru contain the name Anton Medvedovskiy in the registration records, except for the aforementioned ixyq[.]com, which is registered to the name Yuriy Avdeev in Moscow.\nThis Avdeev surname came up in a lengthy conversation with Lockbitsupp, the leader of the rapacious and destructive ransomware affiliate group Lockbit. The conversation took place in February 2024, when Lockbitsupp asked for help identifying Toha’s real-life identity.\nIn early 2024, the leader of the Lockbit ransomware group — Lockbitsupp — asked for help investigating the identity of the XSS administrator Toha, which he claimed was a Russian man named Anton Avdeev.\nLockbitsupp didn’t share why he wanted Toha’s details, but he maintained that Toha’s real name was Anton Avdeev. I declined to help Lockbitsupp in whatever revenge he was planning on Toha, but his question made me curious to look deeper.\nIt appears Lockbitsupp’s query was based on a now-deleted Twitter post from 2022, when a user by the name “3xp0rt” asserted that Toha was a Russian man named Anton Viktorovich Avdeev, born October 27, 1983.\nSearching the web for Toha’s email address toschka2003@yandex.ru reveals a 2010 sales thread on the forum bmwclub.ru where a user named Honeypo was selling a 2007 BMW X5. The ad listed the contact person as Anton Avdeev and gave the contact phone number 9588693.\n\nA search on the phone number 9588693 in the breach tracking service Constella Intelligence finds plenty of official Russian government records with this number, date of birth and the name Anton Viktorovich Avdeev. For example, hacked Russian government records show this person has a Russian tax ID and SIN (Social Security number), and that they were flagged for traffic violations on several occasions by Moscow police; in 2004, 2006, 2009, and 2014.\nAstute readers may have noticed by now that the ages of Mr. Avdeev (41) and the XSS admin arrested this month (38) are a bit off. This would seem to suggest that the person arrested is someone other than Mr. Avdeev, who did not respond to requests for comment.\nFor further insight on this question, KrebsOnSecurity sought comments from Sergeii Vovnenko, a former cybercriminal from Ukraine who now works at the security startup paranoidlab.com. I reached out to Vovnenko because for several years beginning around 2010 he was the owner and operator of thesecure[.]biz, an encrypted “Jabber” instant messaging server that Europol said was operated by the suspect arrested in Kiev. Thesecure[.]biz grew quite popular among many of the top Russian-speaking cybercriminals because it scrupulously kept few records of its users’ activity, and its administrator was always a trusted member of the community.\nThe reason I know this historic tidbit is that in 2013, Vovnenko — using the hacker nicknames “Fly,” and “Flycracker” — hatched a plan to have a gram of heroin purchased off of the Silk Road darknet market and shipped to our home in Northern Virginia. The scheme was to spoof a call from one of our neighbors to the local police, saying this guy Krebs down the street was a druggie who was having narcotics delivered to his home.\nI happened to be lurking on Flycracker’s private cybercrime forum when his heroin-framing plan was carried out, and called the police myself before the smack eventually arrived in the U.S. Mail. Vovnenko was later arrested for unrelated cybercrime activities, extradited to the United States, convicted, and deported after a 16-month stay in the U.S. prison system [on several occasions, he has expressed heartfelt apologies for the incident, and we have since buried the hatchet].\nVovnenko said he purchased a device for cloning credit cards from Toha in 2009, and that Toha shipped the item from Russia. Vovnenko explained that he (Flycracker) was the owner and operator of thesecure[.]biz from 2010 until his arrest in 2014.\nVovnenko believes thesecure[.]biz was stolen while he was in jail, either by Toha and/or an XSS administrator who went by the nicknames N0klos and Sonic.\n“When I was in jail, [the] admin of xss.is stole that domain, or probably N0klos bought XSS from Toha or vice versa,” Vovnenko said of the Jabber domain. “Nobody from [the forums] spoke with me after my jailtime, so I can only guess what really happened.”\nN0klos was the owner and administrator of an early Russian-language cybercrime forum known as Darklife[.]ws. However, N0kl0s also appears to be a lifelong Russian resident, and in any case seems to have vanished from Russian cybercrime forums several years ago.\nAsked whether he believes Toha was the XSS administrator who was arrested this month in Ukraine, Vovnenko maintained that Toha is Russian, and that “the French cops took the wrong guy.”\nSo who did the Ukrainian police arrest in response to the investigation by the French authorities? It seems plausible that the BMW ad invoking Toha’s email address and the name and phone number of a Russian citizen was simply misdirection on Toha’s part — intended to confuse and throw off investigators. Perhaps this even explains the Avdeev surname surfacing in the registration records from one of Toha’s domains.\nBut sometimes the simplest answer is the correct one. “Toha” is a common Slavic nickname for someone with the first name “Anton,” and that matches the name in the registration records for more than a dozen domains tied to Toha’s toschka2003@yandex.ru email address: Anton Medvedovskiy.\nConstella Intelligence finds there is an Anton Gannadievich Medvedovskiy living in Kiev who will be 38 years old in December. This individual owns the email address itsmail@i.ua, as well an an Airbnb account featuring a profile photo of a man with roughly the same hairline as the suspect in the blurred photos released by the Ukrainian police. Mr. Medvedovskiy did not respond to a request for comment.\nMy take on the takedown is that the Ukrainian authorities likely arrested Medvedovskiy. Toha shared on DaMaGeLab in 2005 that he had recently finished the 11th grade and was studying at a university — a time when Mevedovskiy would have been around 18 years old. On Dec. 11, 2006, fellow Exploit members wished Toha a happy birthday. Records exposed in a 2022 hack at the Ukrainian public services portal diia.gov.ua show that Mr. Medvedovskiy’s birthday is Dec. 11, 1987.\nThe law enforcement action and resulting confusion about the identity of the detained has thrown the Russian cybercrime forum scene into disarray in recent weeks, with lengthy and heated arguments about XSS’s future spooling out across the forums.\nXSS relaunched on a new Tor address shortly after the authorities plastered their seizure notice on the forum’s  homepage, but all of the trusted moderators from the old forum were dismissed without explanation. Existing members saw their forum account balances drop to zero, and were asked to plunk down a deposit to register at the new forum. The new XSS “admin” said they were in contact with the previous owners and that the changes were to help rebuild security and trust within the community.\nHowever, the new admin’s assurances appear to have done little to assuage the worst fears of the forum’s erstwhile members, most of whom seem to be keeping their distance from the relaunched site for now.\nIndeed, if there is one common understanding amid all of these discussions about the seizure of XSS, it is that Ukrainian and French authorities now have several years worth of private messages between XSS forum users, as well as contact rosters and other user data linked to the seized Jabber server.\n“The myth of the ‘trusted person’ is shattered,” the user “GordonBellford” cautioned on Aug. 3 in an Exploit forum thread about the XSS admin arrest. “The forum is run by strangers. They got everything. Two years of Jabber server logs. Full backup and forum database.”\nGordonBellford continued:\nAnd the scariest thing is: this data array is not just an archive. It is material for analysis that has ALREADY BEEN DONE . With the help of modern tools, they see everything:\nGraphs of your contacts and activity.\nRelationships between nicknames, emails, password hashes and Jabber ID.\nTimestamps, IP addresses and digital fingerprints.\nYour unique writing style, phraseology, punctuation, consistency of grammatical errors, and even typical typos that will link your accounts on different platforms.\nThey are not looking for a needle in a haystack. They simply sifted the haystack through the AI sieve and got ready-made dossiers.\n\r\n         This entry was posted on Wednesday 6th of August 2025 08:12 AM \r\n         \nGreat reporting Brian.  Thanks for all you do.\nAs always, Brian, thank you for all the detective work.  To paraphrase the GordonBellford you referenced, “Whatever you say, whatever you do, sooner or later, comes back to you.”\nneed mo info\nask in tox\n28C316E4D255483A1EBFF28FBEC0E9D229775DC7032D93F19E7537F3CF90C2268F7AE18031CC\nthere is a certain amount of karma at work, and I try to remain hopeful.\nbut there also is a certain amount crime that seems to be seem perpetuating.\ndepending on the values kids learn in school and from observing the world.\nin the battle between good and evil, the internet has definitely made it more\nconvenient to do great evil from the comfort of one’s home, perhaps until\nsomeone ferrets out the misdeeds.  Thanks for another great bit of reporting.\nNo idea what most of this means, but I thank you fervently for your work, Things are incredibly scary for mere mortals, right now.\nInteresting comment “With the help of modern tools, they see everything:\nGraphs of your contacts and activity.\nRelationships between nicknames, emails, password hashes and Jabber ID.\nTimestamps, IP addresses and digital fingerprints.\nYour unique writing style, phraseology, punctuation, consistency of grammatical errors, and even typical typos that will link your accounts on different platforms.”\nThis not only applies to those on the forums but to normal every day people.  We have crossed a threshold where our entire lives are in databases and able to be scanned and graphed by AI.  The promise of AI is that it will make our lives easier, but in reality, the fear is that it will show that we have a lot more to hide than we think we do.\nGreat work as always… Always tried to warn them NOT to do crime 🙂\nHope to see you in Prague soon!\nAs a resentful x or a practical o?\nIs this another “silk road” kind of arrest? Did he directly commit crimes, or simply administered the forum, jabber and mediate? I’m aware you mention he has over 2 decades of history, but I don’t mean things like “he exploited a SQL injection on a puerto rican water safety portal!” or carding from when he was a juvenile (made up scenario).\nHandling large amounts of money for cybercriminals, not laundering or mixing, simply holding, shouldn’t be a crime. Are governments responsible for their infrastructure e.g public parks where drugs are dealt on? What about the garbge cans and benches used for dead drops?\nI believe he was the one who made the “no more ransomware” call as well, kinda like how darknet markets apparently ban fentanyl.\nThere’s also the possiblity of falsified data existing in these government databases. If they can get hacked & leaked in the first place, what’s stopping an insider or hacker from creating fradulent entries?\nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "Major Enterprise AI Assistants Can Be Abused for Data Theft, Manipulation",
        "Link": "https://www.securityweek.com/major-enterprise-ai-assistants-abused-for-data-theft-manipulation/",
        "Summary": "<p>Zenity has shown how AI assistants such as ChatGPT, Copilot, Cursor, Gemini, and Salesforce Einstein can be abused using specially crafted prompts.</p>\n<p>The post <a href=\"https://www.securityweek.com/major-enterprise-ai-assistants-abused-for-data-theft-manipulation/\">Major Enterprise AI Assistants Can Be Abused for Data Theft, Manipulation</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/major-enterprise-ai-assistants-abused-for-data-theft-manipulation/"
    },
    {
        "Title": "Enterprise Secrets Exposed by CyberArk Conjur Vulnerabilities",
        "Link": "https://www.securityweek.com/enterprise-secrets-exposed-by-cyberark-conjur-vulnerabilities/",
        "Summary": "<p>CyberArk has patched several vulnerabilities that could be chained for unauthenticated remote code execution.</p>\n<p>The post <a href=\"https://www.securityweek.com/enterprise-secrets-exposed-by-cyberark-conjur-vulnerabilities/\">Enterprise Secrets Exposed by CyberArk Conjur Vulnerabilities</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/enterprise-secrets-exposed-by-cyberark-conjur-vulnerabilities/"
    },
    {
        "Title": "Google Discloses Data Breach via Salesforce Hack",
        "Link": "https://www.securityweek.com/google-discloses-salesforce-hack/",
        "Summary": "<p>A Google Salesforce instance may have been targeted as part of a ShinyHunters campaign that hit several major companies. </p>\n<p>The post <a href=\"https://www.securityweek.com/google-discloses-salesforce-hack/\">Google Discloses Data Breach via Salesforce Hack </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/google-discloses-salesforce-hack/"
    },
    {
        "Title": "PLoB: A Behavioral Fingerprinting Framework to Hunt for Malicious Logins",
        "Link": "https://www.securityweek.com/plob-a-behavioral-fingerprinting-framework-to-hunt-for-malicious-logins/",
        "Summary": "<p>Splunk researchers developed a system to fingerprint post-logon behavior, using AI to find subtle signals of intrusion. </p>\n<p>The post <a href=\"https://www.securityweek.com/plob-a-behavioral-fingerprinting-framework-to-hunt-for-malicious-logins/\">PLoB: A Behavioral Fingerprinting Framework to Hunt for Malicious Logins</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/plob-a-behavioral-fingerprinting-framework-to-hunt-for-malicious-logins/"
    },
    {
        "Title": "WhatsApp Takes Down 6.8 Million Accounts Linked to Criminal Scam Centers, Meta Says",
        "Link": "https://www.securityweek.com/whatsapp-takes-down-6-8-million-accounts-linked-to-criminal-scam-centers-meta-says/",
        "Summary": "<p>Meta linked these scams to a criminal scam center in Cambodia — and said it disrupted the campaign in partnership with ChatGPT maker OpenAI.</p>\n<p>The post <a href=\"https://www.securityweek.com/whatsapp-takes-down-6-8-million-accounts-linked-to-criminal-scam-centers-meta-says/\">WhatsApp Takes Down 6.8 Million Accounts Linked to Criminal Scam Centers, Meta Says</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/whatsapp-takes-down-6-8-million-accounts-linked-to-criminal-scam-centers-meta-says/"
    },
    {
        "Title": "Trend Micro Patches Apex One Vulnerabilities Exploited in Wild",
        "Link": "https://www.securityweek.com/trend-micro-patches-apex-one-vulnerabilities-exploited-in-wild/",
        "Summary": "<p>Trend Micro has rushed to fix two Apex One zero-days that may have been exploited by Chinese threat actors.</p>\n<p>The post <a href=\"https://www.securityweek.com/trend-micro-patches-apex-one-vulnerabilities-exploited-in-wild/\">Trend Micro Patches Apex One Vulnerabilities Exploited in Wild</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/trend-micro-patches-apex-one-vulnerabilities-exploited-in-wild/"
    },
    {
        "Title": "Microsoft Paid Out $17 Million in Bug Bounties in Past Year",
        "Link": "https://www.securityweek.com/microsoft-paid-out-17-million-in-bug-bounties-in-past-year/",
        "Summary": "<p>Microsoft handed out $17 million in rewards to 344 security researchers through its bug bounty programs over the past year.</p>\n<p>The post <a href=\"https://www.securityweek.com/microsoft-paid-out-17-million-in-bug-bounties-in-past-year/\">Microsoft Paid Out $17 Million in Bug Bounties in Past Year</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/microsoft-paid-out-17-million-in-bug-bounties-in-past-year/"
    },
    {
        "Title": "Ox Security Launches AI Agent That Auto-Generates Code to Fix Vulnerabilities",
        "Link": "https://www.securityweek.com/ox-security-launches-ai-agent-that-auto-generates-code-to-fix-vulnerabilities/",
        "Summary": "<p>An AI extension to the Ox Security platform automatically generates organization specific code to fix vulnerabilities in the codebase.</p>\n<p>The post <a href=\"https://www.securityweek.com/ox-security-launches-ai-agent-that-auto-generates-code-to-fix-vulnerabilities/\">Ox Security Launches AI Agent That Auto-Generates Code to Fix Vulnerabilities</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/ox-security-launches-ai-agent-that-auto-generates-code-to-fix-vulnerabilities/"
    },
    {
        "Title": "Over 1 Million Impacted by DaVita Data Breach",
        "Link": "https://www.securityweek.com/over-1-million-impacted-by-davita-data-breach/",
        "Summary": "<p>DaVita has notified over 1 million individuals that their personal and health information was stolen in a ransomware attack.</p>\n<p>The post <a href=\"https://www.securityweek.com/over-1-million-impacted-by-davita-data-breach/\">Over 1 Million Impacted by DaVita Data Breach</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/over-1-million-impacted-by-davita-data-breach/"
    },
    {
        "Title": "Flaws Expose 100 Dell Laptop Models to Implants, Windows Login Bypass",
        "Link": "https://www.securityweek.com/flaws-expose-100-dell-laptop-models-to-implants-windows-login-bypass/",
        "Summary": "<p>ReVault vulnerabilities in the ControlVault3 firmware in Dell laptops could lead to firmware modifications or Windows login bypass.</p>\n<p>The post <a href=\"https://www.securityweek.com/flaws-expose-100-dell-laptop-models-to-implants-windows-login-bypass/\">Flaws Expose 100 Dell Laptop Models to Implants, Windows Login Bypass</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/flaws-expose-100-dell-laptop-models-to-implants-windows-login-bypass/"
    },
    {
        "Title": "INC Ransom Group Allegedly Breaches US Measurement Specialist Michelli",
        "Link": "https://dailydarkweb.net/inc-ransom-group-allegedly-breaches-us-measurement-specialist-michelli/",
        "Summary": "The INC Ransom group has allegedly claimed responsibility for a cyberattack against Michelli Weighing &#38; Measurement, a significant player in the US industrial measurement and calibration sector. Michelli, a company with a long history dating back to 1947, is a trusted provider of ISO 9001 certified services across thirty-seven locations in the United States. They [&#8230;]",
        "Date": "2025-08-06",
        "Content": "The INC Ransom group has allegedly claimed responsibility for a cyberattack against Michelli Weighing & Measurement, a significant player in the US industrial measurement and calibration sector. Michelli, a company with a long history dating back to 1947, is a trusted provider of ISO 9001 certified services across thirty-seven locations in the United States. They specialize in the calibration and repair of precision instruments for a wide range of industries, making them a critical component of their clients’ quality assurance and operational processes.\nThe ransomware group has allegedly threatened to release 82GB of data purportedly exfiltrated from the company’s network. As proof of their claim, the attackers have released a file list that suggests the compromised data is highly sensitive. The leak of such information could potentially impact Michelli’s operations and expose confidential data belonging to their clients.\nThe allegedly stolen data includes:\nCustomer-specific work orders and task tickets\nA2LA Approved ISO certification documents\nDocuments containing specific customer and equipment IDs\nTags:\nCyberSecurity\ndata-breach\nINC Ransom\nMichelli\nUSA"
    },
    {
        "Title": "Everest Ransomware Group Allegedly Breaches UK Manufacturer EMM Corp – Exposing Over 900GB of Data",
        "Link": "https://dailydarkweb.net/everest-ransomware-group-allegedly-breaches-uk-manufacturer-emm-corp-exposing-over-900gb-of-data/",
        "Summary": "The Everest ransomware group has allegedly targeted EMM Corp, a UK-based manufacturing entity, adding the company to its dark web leak site. The group claims to have exfiltrated over 900GB of sensitive internal data and has started leaking samples as proof of the breach. The published evidence suggests a deep compromise of the company&#8217;s network, [&#8230;]",
        "Date": "2025-08-06",
        "Content": "The Everest ransomware group has allegedly targeted EMM Corp, a UK-based manufacturing entity, adding the company to its dark web leak site. The group claims to have exfiltrated over 900GB of sensitive internal data and has started leaking samples as proof of the breach. The published evidence suggests a deep compromise of the company’s network, with the attackers threatening to release the full dataset if their demands are not met within a four-day deadline.\nEMM Corp appears to be closely associated with Usha Martin UK Ltd, a prominent manufacturer and distributor of wire ropes with a history dating back to 1989. The company is a significant player in the industrial manufacturing sector. The data allegedly stolen by the Everest group seems to encompass the entirety of the company’s operations, posing a severe risk to its business, employees, and customers. The proof files include detailed financial statements, internal file structures, and highly sensitive employee information.\nAmong the most alarming files leaked are documents containing system passwords in clear text, detailed profit and loss accounts, cyber insurance application forms, and extensive spreadsheets of employee data, including names, email addresses, and phone numbers. The exposure of such critical information could lead to significant financial and reputational damage for EMM Corp and its affiliates, while also placing its employees at high risk of identity theft and targeted phishing attacks.\nThe allegedly leaked data includes:\nPersonal Data\nCustomer Data\nFinancial Documents\nInternal Documents\nContracts\nInvoices\nSystem Passwords\nHR and Personnel files\nTags:\ndata-leak\nEMM Corp\nEverest\nManufacturing\nransomware\nUK\nUsha Martin"
    },
    {
        "Title": "Correos de Chile Allegedly Breached – Full System Access Put Up for Sale",
        "Link": "https://dailydarkweb.net/correos-de-chile-allegedly-breached-full-system-access-put-up-for-sale/",
        "Summary": "A threat actor has allegedly compromised the systems of Correos de Chile, the state-owned postal service of the country, and is now selling full access on a popular cybercrime forum. Correos de Chile is a critical entity, operating under the Ministry of Transport and Telecommunications, responsible for handling a significant volume of both national and [&#8230;]",
        "Date": "2025-08-06",
        "Content": "A threat actor has allegedly compromised the systems of Correos de Chile, the state-owned postal service of the country, and is now selling full access on a popular cybercrime forum. Correos de Chile is a critical entity, operating under the Ministry of Transport and Telecommunications, responsible for handling a significant volume of both national and international payments and postal services. The breach represents a major potential threat to the country’s infrastructure and the security of its citizens’ data.\nThe seller claims to have gained access to a core host that manages the company’s entire network access control via OpenAm. This level of access allegedly provides the buyer with full Remote Code Execution (RCE) capabilities, effectively handing over control of the compromised systems. The threat actor boasts that the access is deep, including credentials for various internal systems and the ability to deploy their own applications within the postal service’s network.\nTo substantiate their claims, the actor listed several types of sensitive data that have allegedly been exfiltrated from Correos de Chile’s network. The actor also claims to have cracked the passwords for 70 out of 120 employees. The data allegedly for sale includes:\nJDB files\nLDAP backups\nAudit logs\nConfiguration files containing credentials (storepass, keypass, etc.)\nTomcat credentials\nJDBC database credentials\nTags:\nChile\nCorreos de Chile\nCritical Infrastructure\ncyber-attack\nCyberSecurity\ndata-breach\ngovernment"
    },
    {
        "Title": "Venice Hotel Ca’ dei Conti Suffers Major Data Breach – 38,000 Guest IDs Allegedly for Sale",
        "Link": "https://dailydarkweb.net/venice-hotel-ca-dei-conti-suffers-major-data-breach-38000-guest-ids-allegedly-for-sale/",
        "Summary": "A threat actor has allegedly put a massive database of sensitive guest information up for sale on a dark web forum. The data is claimed to originate from Hotel Ca’ dei Conti, a prestigious 4-star boutique hotel located in the heart of Venice, Italy. According to the post, the data was exfiltrated through an unauthorized [&#8230;]",
        "Date": "2025-08-06",
        "Content": "A threat actor has allegedly put a massive database of sensitive guest information up for sale on a dark web forum. The data is claimed to originate from Hotel Ca’ dei Conti, a prestigious 4-star boutique hotel located in the heart of Venice, Italy. According to the post, the data was exfiltrated through an unauthorized access event that allegedly took place in July 2025. This breach targets the sensitive Know Your Customer (KYC) data that hotels are required to collect from guests during the check-in process.\nThe compromised data is particularly alarming due to its nature and scale. The seller claims to possess over 38,000 high-resolution scanned documents belonging to international guests. The availability of such clear and legible identity documents, including passports and national ID cards from countries like Spain, France, and Italy, poses a severe risk of identity theft, financial fraud, and the creation of synthetic identities for other malicious purposes.\nThe hotel, known for hosting travelers from around the globe, now faces a significant security incident that could have far-reaching consequences for the thousands of former guests whose personal information is now exposed. The threat actor is offering the entire collection of data in JPG format, sorted by the country of origin, making it easier for potential buyers to exploit.\nThe leaked data allegedly includes:\nHigh-resolution scans of guest passports\nHigh-resolution scans of guest national ID cards (DNI)\nTags:\nCyberSecurity\ndark web\ndata-breach\ndata-leak\nHotel\nidentity theft\nItaly\nPII"
    },
    {
        "Title": "Italian Hotel Casa Dorita Allegedly Suffers Data Breach – Guest IDs Surface on Dark Web",
        "Link": "https://dailydarkweb.net/italian-hotel-casa-dorita-allegedly-suffers-data-breach-guest-ids-surface-on-dark-web/",
        "Summary": "A threat actor has allegedly put a sensitive database belonging to Hotel Casa Dorita, located in Italy, up for sale on a dark web forum. The hotel, a destination for tourists, handles a significant amount of personally identifiable information (PII) from its international clientele as part of its booking and check-in processes. According to the [&#8230;]",
        "Date": "2025-08-06",
        "Content": "A threat actor has allegedly put a sensitive database belonging to Hotel Casa Dorita, located in Italy, up for sale on a dark web forum. The hotel, a destination for tourists, handles a significant amount of personally identifiable information (PII) from its international clientele as part of its booking and check-in processes. According to the forum post made on August 6, 2025, the data was exfiltrated through an unauthorized access incident that allegedly occurred in June 2025. This breach places the personal security of potentially thousands of former guests at high risk.\nThe seller claims the database contains a significant collection of sensitive documents and is being offered for $800. The post specifies that the data dump includes thousands of high-resolution scans and photos of guest identity documents. Sample images accompanying the listing display a wide variety of personal IDs, including international passports and national identity cards from numerous countries, exposing full names, dates of birth, photographs, and document numbers. The availability of such comprehensive identification documents on the dark web could lead to severe consequences for the individuals affected, including identity theft and financial fraud.\nThe allegedly leaked data includes:\n2,300 high-quality scans and photos of guest identity documents (Passports, National IDs)\nTags:\nCasa Dorita\nCyberSecurity\ndark web\ndata-breach\nhospitality\nItaly\nPII"
    },
    {
        "Title": "Indonesian Entertainment Site Cineverse Database Allegedly Leaked on Dark Web",
        "Link": "https://dailydarkweb.net/indonesian-entertainment-site-cineverse-database-allegedly-leaked-on-dark-web/",
        "Summary": "A threat actor has allegedly leaked the database of Cineverse[.]id, an Indonesian online platform focused on film and entertainment media. The data was posted on a dark web forum and is claimed to contain the records of approximately 10,000 users. Cineverse.id serves as a community and information hub for movie enthusiasts in the region, making [&#8230;]",
        "Date": "2025-08-06",
        "Content": "A threat actor has allegedly leaked the database of Cineverse[.]id, an Indonesian online platform focused on film and entertainment media. The data was posted on a dark web forum and is claimed to contain the records of approximately 10,000 users. Cineverse.id serves as a community and information hub for movie enthusiasts in the region, making the exposure of its user data a significant concern for its member base.\nThe compromised information appears to originate from the website’s user database, exposing a wide range of sensitive personal and technical data. The threat actor shared a list of database columns and a sample of the data, which includes user credentials and personally identifiable information (PII). This incident could expose affected users to various risks, including phishing campaigns, identity theft, and credential stuffing attacks on other platforms where they might have reused passwords.\nThe allegedly leaked data includes the following:\nUser logins and nicknames\nUser email addresses\nHashed passwords\nFirst and last names\nUser registration dates\nSocial media profile links (Facebook, Twitter, Instagram, etc.)\nIP addresses\nSession tokens and other site activity metrics\nTags:\nCineverse\nCyberSecurity\ndark web\ndata-breach\ndata-leak\nIndonesia"
    },
    {
        "Title": "Dire Wolf Ransomware Group Claims Breaches on Kingsford Development & LEADBUILD Construction Pte Ltd and HCK Capital Group",
        "Link": "https://dailydarkweb.net/dire-wolf-ransomware-group-claims-breaches-on-kingsford-development-leadbuild-construction-pte-ltd-and-hck-capital-group/",
        "Summary": "The ransomware group known as Dire Wolf has allegedly added two major corporations from Southeast Asia to its list of victims. The group claims to have successfully breached a prominent Singaporean construction firm and a Malaysian investment group, threatening to leak a significant amount of sensitive data if their demands are not met. The twin [&#8230;]",
        "Date": "2025-08-06",
        "Content": "The ransomware group known as\nDire Wolf\nhas allegedly added two major corporations from Southeast Asia to its list of victims. The group claims to have successfully breached a prominent Singaporean construction firm and a Malaysian investment group, threatening to leak a significant amount of sensitive data if their demands are not met. The twin attacks highlight the persistent and evolving threat that ransomware poses to businesses across various sectors in the region.\nAccording to the group’s post on their dark web leak site, they have exfiltrated a combined total of over 370 GB of data from the two companies. Dire Wolf has set a deadline of August 30, 2025, for the full publication of the stolen documents, having already released sample files to substantiate their claims. The victims are allegedly:\nKingsford Development & LEADBUILD Construction Pte Ltd:\nA Singapore-based civil engineering and construction company. The threat actors claim to have stolen 200 GB of data, including:\nFinancial Data\nSales Data\nProject Drawings\nHCK Capital Group:\nA Malaysian investment firm. The group alleges the theft of 173 GB of data, which purportedly contains a wide array of highly sensitive information such as:\nLegal Documents\nFinancial Documents\nCustomer Information\nInsurance and Business Contracts\nBank Transactions and Statements\nAccounting and Audit Files\nPassport and Tax documents\nEmployment Contracts\nThe nature of the allegedly stolen files, particularly from HCK Capital Group, which includes customer information, passports, and financial records, poses a severe risk of financial fraud and identity theft for the individuals and businesses involved. For Kingsford Development, the exposure of project drawings and financial data could compromise competitive advantages and corporate privacy. These incidents serve as a stark reminder for organizations to bolster their cybersecurity defenses against sophisticated ransomware operations.\nTags:\nConstruction\nCyberSecurity\ndata-breach\nDire Wolf\ninvestment\nMalaysia\nransomware\nSingapore"
    },
    {
        "Title": "Major Brazilian Real Estate Firm Cibraco Allegedly Hit by Lynx Ransomware",
        "Link": "https://dailydarkweb.net/major-brazilian-real-estate-firm-cibraco-allegedly-hit-by-lynx-ransomware/",
        "Summary": "The Lynx ransomware group has allegedly targeted Cibraco Imóveis, a prominent real estate company with over 80 years of experience in the Curitiba metropolitan area. The cybercriminal group has published claims on its dark web leak site, stating it has exfiltrated sensitive data from the company&#8217;s network and is demanding a ransom. Cibraco has been [&#8230;]",
        "Date": "2025-08-06",
        "Content": "The Lynx ransomware group has allegedly targeted Cibraco Imóveis, a prominent real estate company with over 80 years of experience in the Curitiba metropolitan area. The cybercriminal group has published claims on its dark web leak site, stating it has exfiltrated sensitive data from the company’s network and is demanding a ransom. Cibraco has been a staple in the region’s property market for decades, handling sales and rentals, making this attack particularly significant for its large client base and the local real estate sector.\nThe attackers released several screenshots of a file directory as proof of their successful intrusion. The compromised data allegedly includes a wide range of highly sensitive corporate and client information. Based on the folder names, the breach appears to have exposed critical operational data. The exfiltrated files seem to originate from various departments, suggesting a deep and widespread network compromise. The scale of the alleged breach raises serious concerns about the potential exposure of personal and financial information belonging to clients, employees, and business partners.\nAmong the allegedly stolen data are files from the following departments:\nFinance (FINANCEIRO)\nManagement/Directorate (DIRETORIA)\nHuman Resources (RH)\nIT (TI)\nSales and Broker Records (VENDAS_CIBRACO, VENDAS_CORRETORES)\nRental Administration (ADM_LOCACAO)\nMarketing\nLegal and Property-specific documents (CONTRATO, VISTORIAS)\nThis incident highlights the continued threat posed by ransomware groups like Lynx, which employ double-extortion tactics by not only encrypting data but also threatening to leak it publicly to pressure victims into paying. The attack on a long-standing institution like Cibraco 🇧🇷 serves as a stark reminder for businesses of all sizes and sectors to continually bolster their cybersecurity defenses.\nTags:\nBrazil\nCibraco\ncyberattack\ndata-breach\nLynx ransomware\nransomware\nreal estate"
    }
]