[
    {
        "Title": "Researchers Spot XZ Utils Backdoor in Dozens of Docker Hub Images, Fueling Supply Chain Risks",
        "Link": "https://thehackernews.com/2025/08/researchers-spot-xz-utils-backdoor-in.html",
        "Summary": "New research has uncovered Docker images on Docker Hub that contain the infamous XZ Utils backdoor, more than a year after the discovery of the incident.\nMore troubling is the fact that other images have been built on top of these infected base images, effectively propagating the infection further in a transitive manner, Binarly REsearch said in a report shared with The Hacker News.\nThe firmware",
        "Date": "2025-08-12",
        "Content": "New research has uncovered Docker images on Docker Hub that contain the infamous XZ Utils backdoor, more than a year after the discovery of the incident.\nMore troubling is the fact that other images have been built on top of these infected base images, effectively propagating the infection further in a transitive manner, Binarly REsearch\nsaid\nin a report shared with The Hacker News.\nThe firmware security company said it discovered a total of 35 images that ship with the backdoor. The incident once again highlights the risks faced by the software supply chain.\nThe XZ Utils supply chain event (CVE-2024-3094, CVSS score: 10.0)\ncame to light\nin late March 2024, when Andres Freund sounded the alarm on a backdoor embedded within XZ Utils versions 5.6.0 and 5.6.1.\nFurther\nanalysis\nof the malicious code and the broader compromise led to\nseveral startling discoveries\n, the first and foremost being that the backdoor could lead to unauthorized remote access and enable the execution of arbitrary payloads through SSH.\nSpecifically, the backdoor -- placed in the liblzma.so library and used by the OpenSSH server -- was designed such that it triggered when a client interacts with the infected SSH server.\nBy hijacking the RSA_public_decrypt function using the glibc's IFUNC mechanism, the malicious code allowed an attacker possessing a specific private key to bypass authentication and execute root commands remotely,\" Binarly explained.\nThe second finding was that the changes were pushed by a developer named \"Jia Tan\" (JiaT75), who spent almost two years contributing to the open-source project to build trust until they were given maintainer responsibilities, signaling the meticulous nature of the attack.\n\"This is clearly a very complex state-sponsored operation with impressive sophistication and multi-year planning,\" Binary noted at the time. \"Such a complex and professionally designed comprehensive implantation framework is not developed for a one-shot operation.\"\nThe latest research from the company shows that the impact of the incident continues to send aftershocks through the open-source ecosystem even after all these months.\nThis includes the discovery of 12 Debian Docker images that contain\none of the XZ Utils backdoor\n, and another set of second-order images that include the compromised Debian images.\nBinarly said it\nreported\nthe base images to the Debian maintainers, who said they have \"made an intentional choice to leave these artifacts available as a historical curiosity, especially given the following extremely unlikely (in containers/container image use cases) factors required for exploitation.\"\nHowever, the company pointed out that leaving publicly available Docker images that contain a potential network-reachable backdoor carries a significant security risk, despite the criteria required for successful exploitation – the need for network access to the infected device with the SSH service running.\n\"The xz-utils backdoor incident demonstrates that even short-lived malicious code can remain unnoticed in official container images for a long time, and that can propagate in the Docker ecosystem,\" it added.\n\"The delay underscores how these artifacts may silently persist and propagate through CI pipelines and container ecosystems, reinforcing the critical need for continuous binary-level monitoring beyond simple version tracking.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Fortinet SSL VPNs Hit by Global Brute-Force Wave Before Attackers Shift to FortiManager",
        "Link": "https://thehackernews.com/2025/08/fortinet-ssl-vpns-hit-by-global-brute.html",
        "Summary": "Cybersecurity researchers are warning of a \"significant spike\" in brute-force traffic aimed at Fortinet SSL VPN devices.\nThe coordinated activity, per threat intelligence firm GreyNoise, was observed on August 3, 2025, with over 780 unique IP addresses participating in the effort.\nAs many as 56 unique IP addresses have been detected over the past 24 hours. All the IP addresses have been",
        "Date": "2025-08-12",
        "Content": "Cybersecurity researchers are warning of a \"significant spike\" in brute-force traffic aimed at Fortinet SSL VPN devices.\nThe coordinated activity, per threat intelligence firm GreyNoise, was\nobserved\non August 3, 2025, with over 780 unique IP addresses participating in the effort.\nAs many as 56 unique IP addresses have been detected over the past 24 hours. All the IP addresses have been\nclassified\nas malicious, with the IPs originating from the United States, Canada, Russia, and the Netherlands. Targets of the brute-force activity include the United States, Hong Kong, Brazil, Spain, and Japan.\n\"Critically, the observed traffic was also targeting our FortiOS profile, suggesting deliberate and precise targeting of Fortinet's SSL VPNs,\" GreyNoise\nsaid\n. \"This was not opportunistic -- it was focused activity.\"\nThe company also pointed out that it identified two distinct assault waves spotted before and after August 5: One, a long-running, brute-force activity tied to a single TCP signature that remained relatively steady over time, and Two, which involved a sudden and concentrated burst of traffic with a different TCP signature.\n\"While the August 3 traffic has targeted the FortiOS profile, traffic fingerprinted with TCP and client signatures – a meta signature – from August 5 onward was not hitting FortiOS,\" the company noted. \"Instead, it was consistently targeting our FortiManager.\"\n\"This indicated a shift in attacker behavior – potentially the same infrastructure or toolset pivoting to a new Fortinet-facing service.\"\nOn top of that, a deeper examination of the historical data associated with the post-August 5 TCP fingerprint has uncovered an earlier spike in June featuring a unique client signature that resolved to a FortiGate device in a residential ISP block managed by Pilot Fiber Inc.\nThis has raised the possibility that the brute-force tooling was either initially tested or launched from a home network. An alternative hypothesis is the use of a residential proxy.\nThe development comes against the backdrop of findings that spikes in malicious activity are often followed by the disclosure of a new CVE affecting the same technology within six weeks.\n\"These patterns were exclusive to enterprise edge technologies like VPNs, firewalls, and remote access tools – the same kinds of systems increasingly targeted by advanced threat actors,\" the company\nnoted\nin its Early Warning Signals report published late last month.\nThe Hacker News has reached out to Fortinet for further comment, and we will update if we hear back.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Cybercrime Groups ShinyHunters, Scattered Spider Join Forces in Extortion Attacks on Businesses",
        "Link": "https://thehackernews.com/2025/08/cybercrime-groups-shinyhunters.html",
        "Summary": "An ongoing data extortion campaign targeting Salesforce customers may soon turn its attention to financial services and technology service providers, as ShinyHunters and Scattered Spider appear to be working hand in hand, new findings show.\n\"This latest wave of ShinyHunters-attributed attacks reveals a dramatic shift in tactics, moving beyond the group's previous credential theft and database",
        "Date": "2025-08-12",
        "Content": "An ongoing data extortion campaign targeting Salesforce customers may soon turn its attention to financial services and technology service providers, as ShinyHunters and Scattered Spider appear to be working hand in hand, new findings show.\n\"This latest wave of ShinyHunters-attributed attacks reveals a dramatic shift in tactics, moving beyond the group's previous credential theft and database exploitation,\" ReliaQuest\nsaid\nin a report shared with The Hacker News.\nThese include the use of adoption of tactics that mirror those of\nScattered Spider\n, such as highly-targeted\nvishing\n(aka\nvoice phishing\n) and social engineering attacks, leveraging apps that masquerade as legitimate tools, employing Okta-themed phishing pages to trick victims into entering credentials during vishing, and VPN obfuscation for data exfiltration.\nShinyHunters\n, which first emerged in 2020, is a financially motivated threat group that has orchestrated a\nseries of data breaches\ntargeting major corporations and monetizing them on cybercrime forums like RaidForums and BreachForums. Interestingly, the ShinyHunters persona has been a\nkey participant\nin these platforms both as a contributor and administrator.\n\"The ShinyHunters persona partnered with Baphomet to relaunch the second instance of BreachForums (v2) in June 2023 and later launched the June 2025 instance (v4) alone,\" Sophos\nnoted\nin a recent report. \"The interim version (v3) abruptly disappeared in April 2025, and the cause is unclear.\"\nWhile the relaunch of the forum was short-lived and the bulletin board went offline around June 9, the threat actor has since been\nlinked\nto attacks targeting Salesforce instances globally, a cluster of extortion-related activity that Google is tracking under the moniker UNC6240.\nCoinciding with these developments was the\narrest\nof four individuals suspected of running BreachForums, including ShinyHunters, by French law enforcement authorities. However, the threat actor\ntold\nDataBreaches.Net that \"France rushed to make FALSE, INACCURATE arrests,\" raising the possibility that an \"associate\" member may have been caught.\nAnd that's not all. On August 8, a new Telegram channel\nconflating\nShinyHunters,\nScattered Spider\n, and\nLAPSUS$\ncalled \"scattered lapsu$ hunters\" emerged, with the channel members also\nclaiming\nto be developing a ransomware-as-a-service solution called ShinySp1d3r that they said will rival LockBit and DragonForce. Three days later, the channel disappeared.\nBoth Scattered Spider and LAPSUS$ have ties to a broader, nebulous collective dubbed The Com, a notorious network of experienced English-speaking cybercriminals that's known to engage in a wide range of malicious activities, including SIM swapping, extortion, and physical crime.\nReliaQuest said it has identified a coordinated set of ticket-themed phishing domains and Salesforce credential harvesting pages that are likely created for similar campaigns targeting Salesforce that are aimed at high-profile companies across various industry verticals.\nThese domains, the company said, were registered using infrastructure typically associated with phishing kits commonly used to host single sign-on (SSO) login pages -- a hallmark of Scattered Spider's attacks\nimpersonating\nOkta sign-in pages.\nFurthermore, an analysis of over 700 domains registered in 2025 that matched Scattered Spider phishing patterns has revealed that domain registrations targeting financial companies have increased by 12% since July 2025, while targeting of technology firms has decreased by 5%, suggesting that banks, insurance companies and financial services could be next in line.\nThe tactical overlaps aside, that the two groups may be collaborating is borne out by the fact that they have targeted the same sectors (i.e., retail, insurance, and aviation) around the same time.\n\"Supporting this theory is evidence such as the appearance of a BreachForums' user with the alias 'Sp1d3rHunters,' who was linked to a past ShinyHunters breach, as well as overlapping domain registration patterns,\" researchers Kimberley Bromley and Ivan Righi said, adding the account was created in May 2024.\n\"If these connections are legitimate, they suggest that collaboration or overlap between ShinyHunters and Scattered Spider may have been ongoing for more than a year. The synchronized timing and similar targeting of these previous attacks strongly support the likelihood of coordinated efforts between the two groups.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "New ‘Curly COMrades’ APT Using NGEN COM Hijacking in Georgia, Moldova Attacks",
        "Link": "https://thehackernews.com/2025/08/new-curly-comrades-apt-using-ngen-com.html",
        "Summary": "A previously undocumented threat actor dubbed Curly COMrades has been observed targeting entities in Georgia and Moldova as part of a cyber espionage campaign designed to facilitate long-term access to target networks.\n\"They repeatedly tried to extract the NTDS database from domain controllers -- the primary repository for user password hashes and authentication data in a Windows network,\"",
        "Date": "2025-08-12",
        "Content": "A previously undocumented threat actor dubbed\nCurly COMrades\nhas been observed targeting entities in Georgia and Moldova as part of a cyber espionage campaign designed to facilitate long-term access to target networks.\n\"They repeatedly tried to extract the NTDS database from domain controllers -- the primary repository for user password hashes and authentication data in a Windows network,\" Bitdefender\nsaid\nin a report shared with The Hacker News. \"Additionally, they attempted to dump LSASS memory from specific systems to recover active user credentials, potentially plain-text passwords, from machines where users were logged on.\"\nThe activity, tracked by the Romanian cybersecurity company since mid-2024, has singled out judicial and government bodies in Georgia, as well as an energy distribution company in Moldova.\n\"Regarding the timeline, while we have been tracking the campaign since mid-2024, our analysis of the artifacts indicates that activity began earlier,\" Martin Zugec, technical solutions director at Bitdefender, told the publication. \"The earliest confirmed date we have for the use of the MucorAgent malware is November 2023, though it is highly probable that the group was active before that time.\"\nCurly COMrades are assessed to be operating with goals that are aligned with Russia's geopolitical strategy. It gets its name from the heavy reliance on the curl utility for command-and-control (C2) and data transfer, and the hijacking of the component object model (COM) objects.\nThe end goal of the attacks is to enable long-term access to carry out reconnaissance and credential theft, and leverage that information to burrow deeper into the network, collect data using custom tools, and exfiltrate to attacker-controlled infrastructure.\n\"The overall behavior indicates a methodical approach in which the attackers combined standard attack techniques with tailored implementations to blend into legitimate system activity,\" the company pointed out. \"Their operations were characterized by repeated trial-and-error, use of redundant methods, and incremental setup steps - all aimed at maintaining a resilient and low-noise foothold across multiple systems.\"\nA notable aspect of the attacks is the use of legitimate tools like\nResocks\n, SSH, and\nStunnel\nto create multiple conduits into internal networks and remotely execute commands using the stolen credentials. Another proxy tool deployed besides Resocks is\nSOCKS5\n. The exact initial access vector employed by the threat actor is currently not known.\nPersistent access to the infected endpoints is accomplished by means of a bespoke backdoor called MucorAgent, which hijacks class identifiers (\nCLSIDs\n) – globally unique identifiers that identify a COM class object – to target Native Image Generator (\nNgen\n), an ahead-of-time compilation service that's part of the .NET Framework.\n\"Ngen, a default Windows .NET Framework component that pre-compiles assemblies, provides a mechanism for persistence via a disabled scheduled task,\" Bitdefender noted. \"This task appears inactive, yet the operating system occasionally enables and executes it at unpredictable intervals (such as during system idle times or new application deployments), making it a great mechanism for restoring access covertly.\"\nAbusing the CLSID linked to Ngen underscores the adversary's technical prowess, while granting them the ability to execute malicious commands under the highly privileged SYSTEM account. It's suspected that there likely exists a more reliable mechanism for executing the specific task given the overall unpredictability associated with Ngen.\nA modular .NET implant, MucorAgent is launched via a three-stage process and is capable of executing an encrypted PowerShell script and uploading the output to a designated server. Bitdefender said it did not recover any other PowerShell payloads.\n\"The design of the MucorAgent suggests that it was likely intended to function as a backdoor capable of executing payloads on a periodic basis,\" the company explained. \"Each encrypted payload is deleted after being loaded into memory, and no additional mechanism for regularly delivering new payloads was identified.\"\nAlso weaponized by Curly COMrades are legitimate-but-compromised websites for use as relays during C2 communications and data exfiltration in a bid to fly under the radar by blending malicious traffic with normal network activity. Some of the other tools observed in the attacks are listed below -\nCurlCat, which is used to facilitate bidirectional data transfer between standard input and output streams (STDIN and STDOUT) and C2 server over HTTPS by routing the traffic through a compromised site\nRuRat, a legitimate Remote Monitoring and Management (RMM) program for persistent access\nMimikatz, which is used to extract credentials from memory\nVarious built-in commands like netstat, tasklist, systeminfo, ipconfig, and ping to conduct discovery\nPowershell scripts that use curl to exfiltrate stolen data (e.g., credentials, domain information, and internal application data)\n\"The campaign analyzed revealed a highly persistent and adaptable threat actor employing a wide range of known and customized techniques to establish and maintain long-term access within targeted environments,\" Bitdefender said.\n\"The attackers relied heavily on publicly available tools, open-source projects, and LOLBins, showing a preference for stealth, flexibility, and minimal detection rather than exploiting novel vulnerabilities.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "The Ultimate Battle: Enterprise Browsers vs. Secure Browser Extensions",
        "Link": "https://thehackernews.com/2025/08/the-ultimate-battle-enterprise-browsers.html",
        "Summary": "Most security tools can’t see what happens inside the browser, but that’s where the majority of work, and risk, now lives. Security leaders deciding how to close that gap often face a choice: deploy a dedicated Enterprise Browser or add an enterprise-grade control layer to the browsers employees already use and trust.\nThe Ultimate Battle: Enterprise Browsers vs. Enterprise Browser Extensions",
        "Date": "2025-08-12",
        "Content": "Most security tools can't see what happens inside the browser, but that's where the majority of work, and risk, now lives. Security leaders deciding how to close that gap often face a choice: deploy a dedicated Enterprise Browser or add an enterprise-grade control layer to the browsers employees already use and trust.\nThe Ultimate Battle: Enterprise Browsers vs. Enterprise Browser Extensions\nexamines this choice across nine \"rounds\": adoption, data protection, BYOD, productivity, management overhead, remote access, Zero Trust alignment, supply-chain security, and future-readiness, to show where each approach excels, and where trade-offs emerge.\nEach round uses practical, enterprise scenarios to compare the two models, making it easier to see not just what they can do, but how they perform at scale.\nThe Browser Is Now the Workspace\nThe browser has become the primary workspace for enterprise users. It is where sensitive data is created, accessed, and moved through copy/paste actions, form submissions, uploads, downloads, and increasingly through GenAI prompts.\nDefault-browser habits are deeply ingrained. Forcing a switch can slow adoption, especially in hybrid environments where unmanaged devices and contractors play a role.\nExtension ecosystems are both valuable and risky. They expand functionality but also widen the potential attack surface. The guide makes clear that neither Enterprise Browsers nor Enterprise Browser Extensions replace the rest of the security stack, instead, each addresses the in-session gap in a different way. One of the clearest examples of that gap is how GenAI usage plays out in the browser.\nGenAI: The Use Case That Tests Both Models\nEnterprise adoption of GenAI tools has introduced high-impact, in-session risks for browser security:\nProprietary code, business plans, and sensitive records can be pasted into prompts with no audit trail.\nIdentity context matters, controls must distinguish work from personal accounts in real time.\nCoverage must extend to unmanaged devices, third parties, and temporary access users.\nExtension governance must balance productivity with the ability to detect and restrict risky behavior.\nThe guide uses scenarios like these to stress-test both approaches in multiple rounds, revealing where coverage, control depth, and operational overhead diverge.\nEnterprise Browser vs. Secure Browser Extension: Side-by-Side Comparison in Nine Rounds\nThe Ultimate Battle\norganizes the comparison into nine operationally relevant rounds. Rather than listing features, it tests how each model responds to real conditions, from enabling BYOD access without weakening data-in-use controls to managing risky extensions without disrupting workflows.\nWhere the differences show most clearly:\nCoverage\nEnterprise Browser:\nStrong control inside its own environment, but adoption depends on users switching defaults and keeping sensitive activity within the EB.\nSecure Browser Extension:\nRuns in mainstream browsers (Chrome/Edge) to cover managed, unmanaged, and contractor devices without changing the user's primary workflow.\nControl & Enforcement\nEnterprise Browser:\nDeep guardrails within the EB, including session isolation and strict separation of work and personal contexts.\nEnterprise Browser Extension:\nDOM-level visibility to apply warnings, redactions, or blocks on copy/paste, form fills, uploads, downloads, and GenAI prompts; policies can be identity-bound to differentiate corporate and personal activity.\nIntegration & Operations\nEnterprise Browser:\nIntegrates cleanly while usage stays inside the EB, but requires parallel browser management and related support.\nEnterprise Browser Extension:\nStreams browser-layer telemetry to SIEM/XDR, influences IAM/ZTNA decisions, and updates centrally without retraining users on a new browser.\nMaking the Enterprise Browser vs. Secure Browser Extension Decision\nThe guide is designed to help security teams turn abstract pros and cons into a decision that fits their environment and risk profile. The choice between an Enterprise Browser and an Enterprise Browser Extension is not purely technical, it's about balancing depth of control with breadth of coverage, while factoring in adoption patterns and long-term manageability.\nThe comparison document\npresents these trade-offs in a structured, scenario-driven format, enabling teams to map them to their own environments and make an informed call.\nDownload the full comparison\nto see how each approach performs where it matters most for your organization.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Dutch NCSC Confirms Active Exploitation of Citrix NetScaler CVE-2025-6543 in Critical Sectors",
        "Link": "https://thehackernews.com/2025/08/dutch-ncsc-confirms-active-exploitation.html",
        "Summary": "The Dutch National Cyber Security Centre (NCSC-NL) has warned of cyber attacks exploiting a recently disclosed critical security flaw impacting Citrix NetScaler ADC products to breach organizations in the country.\nThe NCSC-NL said it discovered the exploitation of CVE-2025-6543 targeting several critical organizations within the Netherlands, and that investigations are ongoing to determine the",
        "Date": "2025-08-12",
        "Content": "The Dutch National Cyber Security Centre (NCSC-NL) has warned of cyber attacks exploiting a recently disclosed critical security flaw impacting Citrix NetScaler ADC products to breach organizations in the country.\nThe NCSC-NL\nsaid\nit discovered the exploitation of CVE-2025-6543 targeting several critical organizations within the Netherlands, and that investigations are ongoing to determine the extent of the impact.\nCVE-2025-6543\n(CVSS score: 9.2) is a critical security vulnerability in NetScaler ADC that results in unintended control flow and denial-of-service (DoS) when the devices are configured as a Gateway (VPN virtual server, ICA Proxy, CVPN, RDP Proxy) OR AAA virtual server.\nThe vulnerability was first disclosed in late June 2025, with patches released in the following versions -\nNetScaler ADC and NetScaler Gateway 14.1 prior to 14.1-47.46\nNetScaler ADC and NetScaler Gateway 13.1 prior to 13.1-59.19\nNetScaler ADC 13.1-FIPS and NDcPP prior to 13.1-37.236-FIPS and NDcPP\nAs of June 30, 2025, CVE-2025-6543 has been\nadded\nto the U.S. Cybersecurity and Infrastructure Security Agency's (CISA) Known Exploited Vulnerabilities (KEV) catalog. Another flaw in the same product (CVE-2025-5777, CVSS score: 9.3) was also placed on the list last month.\nNCSC-NL described the activity as likely the work of a sophisticated threat actor, adding the vulnerability has been exploited as a zero-day since early May 2025 – almost two months before it was publicly disclosed – and the attackers took steps to erase traces in an effort to conceal the compromise. The exploitation was discovered on July 16, 2025.\n\"During the investigation, malicious web shells were found on Citrix devices,\" the agency said. \"A web shell is a piece of rogue code that gives an attacker remote access to the system. The attacker can place a web shell by abusing a vulnerability.\"\nTo mitigate the risk arising from CVE-2025-6543, organizations are advised to apply the latest updates, and terminate permanent and active sessions by running the following commands -\nkill icaconnection -all\nkill pcoipConnection -all\nkill aaa session -all\nkill rdp connection -all\nclear lb persistentSessions\nOrganizations can also run a shell script\nmade available\nby NCSC-NL to hunt for indicators of compromise associated with the exploitation of CVE-2025-6543.\n\"Files with a different .php extension in Citrix NetScaler system folders may be an indication of abuse,\" NCSC-NL said. \"Check for newly created accounts on the NetScaler, and specifically for accounts with increased rights.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Claude gets 1M tokens support via API to take on Gemini 2.5 Pro",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/claude-gets-1m-tokens-support-via-api-to-take-on-gemini-25-pro/",
        "Summary": "Claude Sonnet 4 has been upgraded, and it can now remember up to 1 million tokens of context, but only when it's used via API. This could change in the future. [...]",
        "Date": "2025-08-12",
        "Content": "Claude Sonnet 4 has been upgraded, and it can now remember up to 1 million tokens of context, but only when it's used via API. This could change in the future.\nThis is 5x more than the previous limit. It also means that Claude now supports remembering over 75,000 lines of code, or even hundreds of documents in a single session.\nPreviously, you were required to submit details to Claude in small chunks, but that also meant Claude would forget the context as it hit the limit. With up to a 1 million context limit, you can build better apps, and Claude can remember more of your code than ever.\nIt is worth noting that the 1 million context limit is limited to Sonnet 4. Opus 4.1 still has the old limitations because it's an expensive model.\nOnly API gets 1 million tokens context limit\nThe new context limit is rolling out via the Anthropic API for customers with Tier 4 and custom rate limits, with broader availability rolling out over the coming weeks.\n\"Long context is also available in Amazon Bedrock and is coming soon to Google Cloud's Vertex AI,\" Anthropic\nnoted\n.\n\"With 1M tokens you can: load entire codebases with all dependencies, analyze hundreds of documents at once, and build agents that maintain context across hundreds of tool calls. Pricing adjusts for prompts over 200K tokens, but prompt caching can reduce costs and latency.\"\nClaude's mobile and web apps will be getting the 1 million token context limit at some point in the future.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nOpenAI, Anthropic, Google may disrupt education market with new AI tools\nxAI prepares Grok 4 Code as it plans to take on Claude and Gemini\nGoogle Calendar invites let researchers hijack Gemini to leak user data\nAnthropic says OpenAI engineers using Claude Code ahead of GPT-5 launch\nFlaw in Gemini CLI AI coding assistant allowed stealthy code execution"
    },
    {
        "Title": "Hackers leak Allianz Life data stolen in Salesforce attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/hackers-leak-allianz-life-data-stolen-in-salesforce-attacks/",
        "Summary": "Hackers have released stolen data belonging to US insurance giant Allianz Life, exposing 2.8 million records with sensitive information on business partners and customers in ongoing Salesforce data theft attacks. [...]",
        "Date": "2025-08-12",
        "Content": "Hackers have released stolen data belonging to US insurance giant Allianz Life, exposing 2.8 million records with sensitive information on business partners and customers in ongoing Salesforce data theft attacks.\nLast month,\nAllianz Life disclosed that it suffered a data breach\nwhen the personal information for the \"majority\" of its 1.4 million customers was stolen from a third-party, cloud-based CRM system on July 16th.\nWhile the company did not name the provider, BleepingComputer first reported the incident was part of a wave of Salesforce-targeted thefts carried out by the ShinyHunters extortion group.\nOver the weekend, ShinyHunters and other threat actors claiming overlap with \"Scattered Spider\" and \"Lapsus$\" created a Telegram channel called \"\nScatteredLapsuSp1d3rHunters\"\nto taunt cybersecurity researchers, law enforcement, and journalists while taking credit for a string of high-profile breaches.\nMany of these attacks had not previously been attributed to any threat actor, including the attacks on\nInternet Archive\n,\nPearson\n, and\nCoinbase\n.\nOne of the attacks claimed by the threat actors is Allianz Life, for which they proceeded to leak the complete databases that were stolen from the company's Salesforce instances.\nThese files consist of the Salesforce \"\nAccounts\n\" and \"\nContacts\n\" database tables, containing approximately 2.8 million data records for individual customers and business partners, such as wealth management companies, brokers, and financial advisors.\nThe leaked Salesforce data includes sensitive personal information, such as names, addresses, phone numbers, dates of birth, and Tax Identification Numbers, as well as professional details like licenses, firm affiliations, product approvals, and marketing classifications.\nBleepingComputer has been able to confirm with multiple people that their data in the leaked files is accurate, including their phone numbers, email addresses, tax IDs, and other information contained in the database.\nBleepingComputer contacted Allianz Life about the leaked database but was told that they could not comment as the investigation is ongoing.\nThe Salesforce data-theft attacks\nThe Salesforce data theft attacks are believed to have started at the beginning of the year, with the threat actors conducting social engineering attacks to trick employees into linking a malicious OAuth app with their company's Salesforce instances.\nOnce linked, the threat actors used the connection to download and steal the databases, which were then used to extort the company through email.\nExtortion demands were sent to the companies via email and were signed as coming from ShinyHunters. This notorious extortion group has been linked to many high-profile attacks over the years, including those against\nAT&T\n,\nPowerSchool\n, and the\nSnowFlake attacks\n.\nWhile ShinyHunters is known to target cloud SaaS applications and website databases, they are not known for these types of social engineering attacks, causing many researchers and the media to attribute some of the Salesforce attacks to Scattered Spider.\nHowever, ShinyHunters told BleepingComputer the \"ShinyHunters\" group and \"Scattered Spider\" are now one and the same.\n\"Like we have said repeatedly already, ShinyHunters and Scattered Spider are one and the same,\" ShinyHunters told BleepingComputer.\n\"They provide us with initial access and we conduct the dump and exfiltration of the Salesforce CRM instances. Just like we did with Snowflake.\"\nIt is also believed that many of the group's members share their roots in another hacking group known as Lapsus$, which was responsible for numerous attacks in 2022-2023, before some of their\nmembers were arrested\n.\nLapsus$ was behind breaches at\nRockstar Games\n,\nUber\n,\n2K\n,\nOkta\n,\nT-Mobile\n,\nMicrosoft\n,\nUbisoft\n, and\nNVIDIA\n.\nLike Scattered Spider, Lapsus$ was also adept at social engineering attacks and\nSIM swap attacks,\nallowing them to run over billion and trillion-dollar companies' IT defenses.\nOver the past couple of years, there have been many arrests linked to\nall\nthree\ncollectives\n, so it's not clear if the current threat actors are old threat actors, new ones who have picked up the mantle, or are simply utilizing these names to plant false flags.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nGoogle confirms data breach exposed potential Google Ads customers' info\nShinyHunters behind Salesforce data theft attacks at Qantas, Allianz Life, and LVMH\nGoogle suffers data breach in ongoing Salesforce data theft attacks\nPandora confirms data breach amid ongoing Salesforce data theft attacks\nFashion giant Chanel hit in wave of Salesforce data theft attacks"
    },
    {
        "Title": "OpenAI rolls out Gmail, Calendar, and Contacts integration in ChatGPT",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-rolls-out-gmail-calendar-and-contacts-integration-in-chatgpt/",
        "Summary": "OpenAI wants ChatGPT to know more about you, including your emails, calendar events in Google Calendar and even your Google contacts to reference everything in a conversation. [...]",
        "Date": "2025-08-12",
        "Content": "OpenAI wants ChatGPT to know more about you, including your emails, calendar events in Google Calendar, and even your Google contacts, to reference everything in a conversation.\nIn a new\nsupport document\nupdate, OpenAI confirmed it’s rolling out support for Gmail, Google Calendar, and Google Contacts Connectors in ChatGPT (Pro).\nFor those unaware, Connectors allow you to connect third-party services to ChatGPT. Once a service has been connected, ChatGPT can reference it in the chat.\nFor example, OpenAI recently added Dropbox support to GPT connectors. If you have dozens of files in your Dropbox, you can give ChatGPT access to the account and let it reference them in a future question or deep research.\nSimilarly, ChatGPT can now reference Google services when relevant.\nThe idea is to make it faster and easier to bring information from these tools into your conversations without having to manually select them each time.\n“Pro users globally [get] this week, followed by Plus, Team, Enterprise, and Edu plans in the coming weeks,” OpenAI noted.\nYou can turn on Google Connectors or other connectors from Settings → Connectors → Connect on the application.\nConnectors in ChatGPT\nSource: BleepingComputer\nTurning on features for deep research also allows you to use them for ChatGPT conversations.\nIf you’ve already given deep research access to Gmail or Google Calendar, you don’t need to independently turn on Connectors.\nYou can already use Gmail, Google Calendar, and Contacts in chat.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nOpenAI could rival Google Shopping with ChatGPT Shop\nChatGPT will analyze Gmail emails, manage schedule on Google Calendar\nChatGPT's new subscription costs less than $5, but it's not for everyone\nOpenAI is testing 3,000-per-week limit for GPT-5 Thinking\nOpenAI to fix GPT-5 issues, double rate limits for paid users after outrage"
    },
    {
        "Title": "ChatGPT's new subscription costs less than $5, but it's not for everyone",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpts-new-subscription-costs-less-than-5-but-its-not-for-everyone/",
        "Summary": "OpenAI has begun updating its pricing page to include a new plan called 'ChatGPT Go.' It costs 399 INR (Indian Rupee) or roughly $4.55, but there's a catch. [...]",
        "Date": "2025-08-12",
        "Content": "OpenAI has begun\nupdating\nits pricing page to include a new plan called\n'ChatGPT Go.'\nIt costs 399 INR (Indian Rupee) or roughly $4.55, but there’s a catch.\nThe GPT Go plan will be limited to certain regions, likely developing countries like India.\nIt’s unclear if OpenAI will expand the low-cost subscription to other regions, including the United States.\nThe ChatGPT web app warns that the Go plan is \"Only available in certain regions\" at ₹399 INR/month, with everything in Free. But it also offers expanded messaging and uploads.\nRight now, the ChatGPT Free subscription easily maxes out its upload limit, but Go adds more limit.\nIt also has expanded image creation, limited deep research, longer memory and context, and extended advanced data analysis.\nThe Go plan is hidden behind a feature flag, but it should begin showing up in select regions in the coming days.\nBleepingComputer understands that Google is also exploring a similar low-tier subscription for Gemini, but it’ll be limited to certain regions only, most likely India, which is price-sensitive.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nOpenAI is testing 3,000-per-week limit for GPT-5 Thinking\nOpenAI to fix GPT-5 issues, double rate limits for paid users after outrage\nOpenAI prepares new open weight models along with GPT-5\nOpenAI may be testing a cheaper paid plan for ChatGPT\nOpenAI prepares GPT-5 for roll out"
    },
    {
        "Title": "Docker Hub still hosts dozens of Linux images with the XZ backdoor",
        "Link": "https://www.bleepingcomputer.com/news/security/docker-hub-still-hosts-dozens-of-linux-images-with-the-xz-backdoor/",
        "Summary": "The XZ-Utils backdoor, first discovered in March 2024, is still present in at least 35 Linux images on Docker Hub, potentially putting users, organizations, and their data at risk. [...]",
        "Date": "2025-08-12",
        "Content": "The XZ-Utils backdoor, first discovered in March 2024, is still present in at least 35 Linux images on Docker Hub, potentially putting users, organizations, and their data at risk.\nDocker Hub is the official public container image registry operated by Docker, allowing developers and organizations to upload or download prebuilt images and share them with the community.\nMany CI/CD pipelines, developers, and production systems pull images directly from Docker Hub as base layers for their own containers, and if those images are compromised, the new build inherits the flaw or malicious code.\nBinarly researchers have discovered numerous Docker images still impacted by the XZ-Utils backdoor.\n\"At first glance, this might not seem alarming: if the distribution packages were backdoored, then any Docker images based on them would be infected as well,\" reports Binarly.\n\"However, what we discovered is that some of these compromised images are still publicly available on Docker Hub. And even more troubling, other images have been built on top of these infected base images, making them transitively infected.\"\nBinarly reported the images to Debian, one of the maintainers still offering backdoored images, who decided not to take them offline, citing low risk and importance of archiving continuity.\nThe XZ-Utils backdoor, tracked under CVE-2024-3094, was malicious code\nhidden in the liblzma.so library\nof the xz-utils compression tool, versions 5.6.0 and 5.6.1.\nIt hooked the RSA_public_decrypt function in OpenSSH via glibc's IFUNC mechanism, so if an attacker with a special private key connected over SSH to an affected system, they could bypass authentication and remotely run commands as root.\nThe backdoor was stealthily injected by a long-time project contributor named \"Jia Tan,\" and shipped in official Linux distro packages like Debian, Fedora, OpenSUSE, and Red Hat, making it one of the most severe software supply chain compromises last year.\nThe backdoor was discovered early on, giving attackers very little opportunity to leverage it, and scanners were released by\nBinarly\nand\nKaspersky\n, among others, to help detect it on dependent open-source software.\nDebian's response\nTo the researchers' surprise, Debian did not bother to retract 64-bit images using the backdoored version of the library from Docker Hub, finding at least 35 of them that are still available for download.\nBinarly comments that this figure is only a partial reflection of the real scale of the problem, as they did not perform a platform-wide scan for the XZ-Utils backdoor.\n\"We identified more than 35 images that ship with the backdoor,\"\nexplains Binarly in its report\n.\n\"While this may seem like a small number, we only scanned a small portion of the images published on DockerHub, stopping at second-order images.\"\nDebian says they\nintentionally opted not to remove these images\nfrom Docker Hub and to leave them as historical artifacts, telling users to only use up-to-date images and not old ones.\nThe maintainers made this decision as they believe the requirements for exploitation are unlikely, such as requiring sshd installed and running on the container, the attacker having network access to the SSH service on that container, and using a private key that matches the backdoor's trigger logic.\nDebian maintainer's response\nSource: Binarly\nBinarly expresses disagreement with this approach, underlining that merely making these images accessible to the public poses a significant risk from accidental pulls or use in automated builds.\nThe same applies to all images that may contain a compromised version of the XZ-Utils backdoor, so users should manually check and ensure the library is on version 5.6.2 or later (\nthe latest stable is 5.8.1\n).\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nNew Plague Linux malware stealthily maintains SSH access\nKali Linux can now run in Apple containers on macOS systems\nNew Koske Linux malware hides in cute panda images\nHackers exploit SAP NetWeaver bug to deploy Linux Auto-Color malware\nIntel announces end of Clear Linux OS project, archives GitHub repos"
    },
    {
        "Title": "Microsoft August 2025 Patch Tuesday fixes one zero-day, 107 flaws",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-august-2025-patch-tuesday-fixes-one-zero-day-107-flaws/",
        "Summary": "Today is Microsoft's August 2025 Patch Tuesday, which includes security updates for 107 flaws, including one publicly disclosed zero-day vulnerability in Windows Kerberos. [...]",
        "Date": "2025-08-12",
        "Content": "Today is Microsoft's August 2025 Patch Tuesday, which includes security updates for 107 flaws, including one publicly disclosed zero-day vulnerability in Windows Kerberos.\nThis Patch Tuesday also fixes thirteen \"Critical\" vulnerabilities, nine of which are remote code execution vulnerabilities, three are information disclosure, and one is elevation of privileges.\nThe number of bugs in each vulnerability category is listed below:\n44 Elevation of Privilege Vulnerabilities\n35 Remote Code Execution Vulnerabilities\n18 Information Disclosure Vulnerabilities\n4 Denial of Service Vulnerabilities\n9 Spoofing Vulnerabilities\nWhen BleepingComputer reports on the Patch Tuesday security updates, we only count those released on Patch Tuesday. Therefore, the number of flaws does not include Mariner, Azure, and Microsoft Edge bugs fixed earlier this month.\nTo learn more about the non-security updates released today, you can review our dedicated articles on the\nWindows 11 KB5063878 & KB5063875 cumulative updates\nand the\nWindows 10 KB5063709 cumulative update\n.\nOne publicly disclosed zero-day fixed\nThis month's Patch Tuesday fixes one publicly disclosed zero-day in Microsoft SQL Server. Microsoft\nclassifies a zero-day flaw\nas publicly disclosed or actively exploited while no official fix is available.\nThe publicly disclosed zero-day is:\nCVE-2025-53779\n- Windows Kerberos Elevation of Privilege Vulnerability\nMicrosoft fixes a flaw in Windows Kerberos that allows an authenticated attacker to gain domain administrator privileges.\n\"Relative path traversal in Windows Kerberos allows an authorized attacker to elevate privileges over a network,\" explains Microsoft.\nMicrosoft says that an attacker would need to have elevated access to the following dMSA attributes to exploit the flaw:\nmsds-groupMSAMembership:\nThis attribute allows the user to utilize the dMSA.\nmsds-ManagedAccountPrecededByLink:\nThe attacker needs write access to this attribute, which allows them to specify a user that the dMSA can act on behalf of.\nMicrosoft attributes the discovery of this flaw to Yuval Gordon of Akamai, who published a\ntechnical report\non the flaw in May.\nRecent updates from other companies\nOther vendors who released updates or advisories in July 2025 include:\n7-Zip\nreleased a security update\nfor a path traversal flaw that could lead to RCE.\nAdobe\nreleased emergency updates\nfor AEM Forms zero-days after PoCs were released.\nCisco\nreleased patches\nfor WebEx and Identity Services Engine.\nFortinet\nreleased security updates\ntoday for multiple products, including FortiOS, FortiManager, FortiSandbox, and FortiProxy.\nGoogle\nreleased security updates\nfor Android that fix two actively exploited Qualcomm vulnerabilities.\nMicrosoft\nwarned about a Microsoft Exchange flaw\ntracked as CVE-2025-53786 that could be used to hijack cloud environments.\nProton\nfixed a bug\nin its new Authenticator app for iOS that logged users' sensitive TOTP secrets in plaintext.\nSAP\nreleased the July security updates\nfor multiple products, including numerous vulnerabilities with a 9.9 rating.\nTrend Micro\nreleased a \"fix tool\"\nfor an actively exploited remote code execution vulnerability in Apex One. Full security updates will come at a later date.\nWinRAR\nreleased a security update\nat the end of July for an\nactively exploited path traversal bug\nthat could lead to remote code execution.\nThe August 2025 Patch Tuesday Security Updates\nBelow is the complete list of resolved vulnerabilities in the July 2025 Patch Tuesday updates.\nTo access the full description of each vulnerability and the systems it affects, you can view the\nfull report here\n.\nTag\nCVE ID\nCVE Title\nSeverity\nAzure File Sync\nCVE-2025-53729\nMicrosoft Azure File Sync Elevation of Privilege Vulnerability\nImportant\nAzure Stack\nCVE-2025-53793\nAzure Stack Hub Information Disclosure Vulnerability\nCritical\nAzure Stack\nCVE-2025-53765\nAzure Stack Hub Information Disclosure Vulnerability\nImportant\nAzure Virtual Machines\nCVE-2025-49707\nAzure Virtual Machines Spoofing Vulnerability\nCritical\nAzure Virtual Machines\nCVE-2025-53781\nAzure Virtual Machines Information Disclosure Vulnerability\nCritical\nDesktop Windows Manager\nCVE-2025-53152\nDesktop Windows Manager Remote Code Execution Vulnerability\nImportant\nDesktop Windows Manager\nCVE-2025-50153\nDesktop Windows Manager Elevation of Privilege Vulnerability\nImportant\nGitHub Copilot and Visual Studio\nCVE-2025-53773\nGitHub Copilot and Visual Studio Remote Code Execution Vulnerability\nImportant\nGraphics Kernel\nCVE-2025-50176\nDirectX Graphics Kernel Remote Code Execution Vulnerability\nCritical\nKernel Streaming WOW Thunk Service Driver\nCVE-2025-53149\nKernel Streaming WOW Thunk Service Driver Elevation of Privilege Vulnerability\nImportant\nKernel Transaction Manager\nCVE-2025-53140\nWindows Kernel Transaction Manager Elevation of Privilege Vulnerability\nImportant\nMicrosoft Brokering File System\nCVE-2025-53142\nMicrosoft Brokering File System Elevation of Privilege Vulnerability\nImportant\nMicrosoft Dynamics 365 (on-premises)\nCVE-2025-49745\nMicrosoft Dynamics 365 (on-premises) Cross-site Scripting Vulnerability\nImportant\nMicrosoft Dynamics 365 (on-premises)\nCVE-2025-53728\nMicrosoft Dynamics 365 (On-Premises) Information Disclosure Vulnerability\nImportant\nMicrosoft Edge for Android\nCVE-2025-49755\nMicrosoft Edge (Chromium-based) for Android Spoofing Vulnerability\nLow\nMicrosoft Edge for Android\nCVE-2025-49736\nMicrosoft Edge (Chromium-based) for Android Spoofing Vulnerability\nModerate\nMicrosoft Exchange Server\nCVE-2025-25005\nMicrosoft Exchange Server Tampering Vulnerability\nImportant\nMicrosoft Exchange Server\nCVE-2025-25006\nMicrosoft Exchange Server Spoofing Vulnerability\nImportant\nMicrosoft Exchange Server\nCVE-2025-25007\nMicrosoft Exchange Server Spoofing Vulnerability\nImportant\nMicrosoft Exchange Server\nCVE-2025-53786\nMicrosoft Exchange Server Hybrid Deployment Elevation of Privilege Vulnerability\nImportant\nMicrosoft Exchange Server\nCVE-2025-33051\nMicrosoft Exchange Server Information Disclosure Vulnerability\nImportant\nMicrosoft Graphics Component\nCVE-2025-49743\nWindows Graphics Component Elevation of Privilege Vulnerability\nImportant\nMicrosoft Graphics Component\nCVE-2025-50165\nWindows Graphics Component Remote Code Execution Vulnerability\nCritical\nMicrosoft Office\nCVE-2025-53732\nMicrosoft Office Remote Code Execution Vulnerability\nImportant\nMicrosoft Office\nCVE-2025-53740\nMicrosoft Office Remote Code Execution Vulnerability\nCritical\nMicrosoft Office\nCVE-2025-53731\nMicrosoft Office Remote Code Execution Vulnerability\nCritical\nMicrosoft Office Excel\nCVE-2025-53759\nMicrosoft Excel Remote Code Execution Vulnerability\nImportant\nMicrosoft Office Excel\nCVE-2025-53737\nMicrosoft Excel Remote Code Execution Vulnerability\nImportant\nMicrosoft Office Excel\nCVE-2025-53739\nMicrosoft Excel Remote Code Execution Vulnerability\nImportant\nMicrosoft Office Excel\nCVE-2025-53735\nMicrosoft Excel Remote Code Execution Vulnerability\nImportant\nMicrosoft Office Excel\nCVE-2025-53741\nMicrosoft Excel Remote Code Execution Vulnerability\nImportant\nMicrosoft Office PowerPoint\nCVE-2025-53761\nMicrosoft PowerPoint Remote Code Execution Vulnerability\nImportant\nMicrosoft Office SharePoint\nCVE-2025-53760\nMicrosoft SharePoint Elevation of Privilege Vulnerability\nImportant\nMicrosoft Office SharePoint\nCVE-2025-49712\nMicrosoft SharePoint Remote Code Execution Vulnerability\nImportant\nMicrosoft Office Visio\nCVE-2025-53730\nMicrosoft Office Visio Remote Code Execution Vulnerability\nImportant\nMicrosoft Office Visio\nCVE-2025-53734\nMicrosoft Office Visio Remote Code Execution Vulnerability\nImportant\nMicrosoft Office Word\nCVE-2025-53738\nMicrosoft Word Remote Code Execution Vulnerability\nImportant\nMicrosoft Office Word\nCVE-2025-53736\nMicrosoft Word Information Disclosure Vulnerability\nImportant\nMicrosoft Office Word\nCVE-2025-53784\nMicrosoft Word Remote Code Execution Vulnerability\nCritical\nMicrosoft Office Word\nCVE-2025-53733\nMicrosoft Word Remote Code Execution Vulnerability\nCritical\nMicrosoft Teams\nCVE-2025-53783\nMicrosoft Teams Remote Code Execution Vulnerability\nImportant\nRemote Access Point-to-Point Protocol (PPP) EAP-TLS\nCVE-2025-50159\nRemote Access Point-to-Point Protocol (PPP) EAP-TLS Elevation of Privilege Vulnerability\nImportant\nRemote Desktop Server\nCVE-2025-50171\nRemote Desktop Spoofing Vulnerability\nImportant\nRole: Windows Hyper-V\nCVE-2025-50167\nWindows Hyper-V Elevation of Privilege Vulnerability\nImportant\nRole: Windows Hyper-V\nCVE-2025-53155\nWindows Hyper-V Elevation of Privilege Vulnerability\nImportant\nRole: Windows Hyper-V\nCVE-2025-49751\nWindows Hyper-V Denial of Service Vulnerability\nImportant\nRole: Windows Hyper-V\nCVE-2025-53723\nWindows Hyper-V Elevation of Privilege Vulnerability\nImportant\nRole: Windows Hyper-V\nCVE-2025-48807\nWindows Hyper-V Remote Code Execution Vulnerability\nCritical\nSQL Server\nCVE-2025-49758\nMicrosoft SQL Server Elevation of Privilege Vulnerability\nImportant\nSQL Server\nCVE-2025-24999\nMicrosoft SQL Server Elevation of Privilege Vulnerability\nImportant\nSQL Server\nCVE-2025-53727\nMicrosoft SQL Server Elevation of Privilege Vulnerability\nImportant\nSQL Server\nCVE-2025-49759\nMicrosoft SQL Server Elevation of Privilege Vulnerability\nImportant\nSQL Server\nCVE-2025-47954\nMicrosoft SQL Server Elevation of Privilege Vulnerability\nImportant\nStorage Port Driver\nCVE-2025-53156\nWindows Storage Port Driver Information Disclosure Vulnerability\nImportant\nWeb Deploy\nCVE-2025-53772\nWeb Deploy Remote Code Execution Vulnerability\nImportant\nWindows Ancillary Function Driver for WinSock\nCVE-2025-53718\nWindows Ancillary Function Driver for WinSock Elevation of Privilege Vulnerability\nImportant\nWindows Ancillary Function Driver for WinSock\nCVE-2025-53134\nWindows Ancillary Function Driver for WinSock Elevation of Privilege Vulnerability\nImportant\nWindows Ancillary Function Driver for WinSock\nCVE-2025-49762\nWindows Ancillary Function Driver for WinSock Elevation of Privilege Vulnerability\nImportant\nWindows Ancillary Function Driver for WinSock\nCVE-2025-53147\nWindows Ancillary Function Driver for WinSock Elevation of Privilege Vulnerability\nImportant\nWindows Ancillary Function Driver for WinSock\nCVE-2025-53154\nWindows Ancillary Function Driver for WinSock Elevation of Privilege Vulnerability\nImportant\nWindows Ancillary Function Driver for WinSock\nCVE-2025-53137\nWindows Ancillary Function Driver for WinSock Elevation of Privilege Vulnerability\nImportant\nWindows Ancillary Function Driver for WinSock\nCVE-2025-53141\nWindows Ancillary Function Driver for WinSock Elevation of Privilege Vulnerability\nImportant\nWindows Cloud Files Mini Filter Driver\nCVE-2025-50170\nWindows Cloud Files Mini Filter Driver Elevation of Privilege Vulnerability\nImportant\nWindows Connected Devices Platform Service\nCVE-2025-53721\nWindows Connected Devices Platform Service Elevation of Privilege Vulnerability\nImportant\nWindows DirectX\nCVE-2025-53135\nDirectX Graphics Kernel Elevation of Privilege Vulnerability\nImportant\nWindows DirectX\nCVE-2025-50172\nDirectX Graphics Kernel Denial of Service Vulnerability\nImportant\nWindows Distributed Transaction Coordinator\nCVE-2025-50166\nWindows Distributed Transaction Coordinator (MSDTC) Information Disclosure Vulnerability\nImportant\nWindows File Explorer\nCVE-2025-50154\nMicrosoft Windows File Explorer Spoofing Vulnerability\nImportant\nWindows GDI+\nCVE-2025-53766\nGDI+ Remote Code Execution Vulnerability\nCritical\nWindows Installer\nCVE-2025-50173\nWindows Installer Elevation of Privilege Vulnerability\nImportant\nWindows Kerberos\nCVE-2025-53779\nWindows Kerberos Elevation of Privilege Vulnerability\nModerate\nWindows Kernel\nCVE-2025-49761\nWindows Kernel Elevation of Privilege Vulnerability\nImportant\nWindows Kernel\nCVE-2025-53151\nWindows Kernel Elevation of Privilege Vulnerability\nImportant\nWindows Local Security Authority Subsystem Service (LSASS)\nCVE-2025-53716\nLocal Security Authority Subsystem Service (LSASS) Denial of Service Vulnerability\nImportant\nWindows Media\nCVE-2025-53131\nWindows Media Remote Code Execution Vulnerability\nImportant\nWindows Message Queuing\nCVE-2025-53145\nMicrosoft Message Queuing (MSMQ) Remote Code Execution Vulnerability\nImportant\nWindows Message Queuing\nCVE-2025-53143\nMicrosoft Message Queuing (MSMQ) Remote Code Execution Vulnerability\nImportant\nWindows Message Queuing\nCVE-2025-50177\nMicrosoft Message Queuing (MSMQ) Remote Code Execution Vulnerability\nCritical\nWindows Message Queuing\nCVE-2025-53144\nMicrosoft Message Queuing (MSMQ) Remote Code Execution Vulnerability\nImportant\nWindows NT OS Kernel\nCVE-2025-53136\nNT OS Kernel Information Disclosure Vulnerability\nImportant\nWindows NTFS\nCVE-2025-50158\nWindows NTFS Information Disclosure Vulnerability\nImportant\nWindows NTLM\nCVE-2025-53778\nWindows NTLM Elevation of Privilege Vulnerability\nCritical\nWindows PrintWorkflowUserSvc\nCVE-2025-53133\nWindows PrintWorkflowUserSvc Elevation of Privilege Vulnerability\nImportant\nWindows Push Notifications\nCVE-2025-53725\nWindows Push Notifications Apps Elevation of Privilege Vulnerability\nImportant\nWindows Push Notifications\nCVE-2025-53724\nWindows Push Notifications Apps Elevation of Privilege Vulnerability\nImportant\nWindows Push Notifications\nCVE-2025-50155\nWindows Push Notifications Apps Elevation of Privilege Vulnerability\nImportant\nWindows Push Notifications\nCVE-2025-53726\nWindows Push Notifications Apps Elevation of Privilege Vulnerability\nImportant\nWindows Remote Desktop Services\nCVE-2025-53722\nWindows Remote Desktop Services Denial of Service Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-50157\nWindows Routing and Remote Access Service (RRAS) Information Disclosure Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-53153\nWindows Routing and Remote Access Service (RRAS) Information Disclosure Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-50163\nWindows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-50162\nWindows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-50164\nWindows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-53148\nWindows Routing and Remote Access Service (RRAS) Information Disclosure Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-53138\nWindows Routing and Remote Access Service (RRAS) Information Disclosure Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-50156\nWindows Routing and Remote Access Service (RRAS) Information Disclosure Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-49757\nWindows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-53719\nWindows Routing and Remote Access Service (RRAS) Information Disclosure Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-53720\nWindows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-50160\nWindows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability\nImportant\nWindows Security App\nCVE-2025-53769\nWindows Security App Spoofing Vulnerability\nImportant\nWindows SMB\nCVE-2025-50169\nWindows SMB Remote Code Execution Vulnerability\nImportant\nWindows StateRepository API\nCVE-2025-53789\nWindows StateRepository API Server file Elevation of Privilege Vulnerability\nImportant\nWindows Subsystem for Linux\nCVE-2025-53788\nWindows Subsystem for Linux (WSL2) Kernel Elevation of Privilege Vulnerability\nImportant\nWindows Win32K - GRFX\nCVE-2025-50161\nWin32k Elevation of Privilege Vulnerability\nImportant\nWindows Win32K - GRFX\nCVE-2025-53132\nWin32k Elevation of Privilege Vulnerability\nImportant\nWindows Win32K - ICOMP\nCVE-2025-50168\nWin32k Elevation of Privilege Vulnerability\nImportant\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nMicrosoft July 2025 Patch Tuesday fixes one zero-day, 137 flaws\nWindows 10 KB5063709 update fixes extended security updates enrollment\nWindows 10 KB5062554 cumulative update released with 13 changes, fixes\nMicrosoft releases emergency patches for SharePoint RCE flaws exploited in attacks\nMicrosoft fixes known issue that breaks Windows 11 updates"
    },
    {
        "Title": "Windows 11 KB5063878 & KB5063875 cumulative updates released",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5063878-and-kb5063875-cumulative-updates-released/",
        "Summary": "Microsoft has released Windows 11 KB5063878 and KB5063875 cumulative updates for versions 24H2 and 23H2 to fix security vulnerabilities and issues. [...]",
        "Date": "2025-08-12",
        "Content": "Microsoft has released Windows 11\nKB5063878\nand\nKB5063875\ncumulative updates for versions 24H2 and 23H2 to fix security vulnerabilities and issues.\nToday's updates are mandatory as they contain the\nAugust 2025 Patch Tuesday\nsecurity patches for vulnerabilities discovered in previous months.\nYou can install today's update by going to\nStart\n>\nSettings\n>\nWindows Update\nand clicking on\n'Check for Updates\n.'\nYou can also manually download and install the update from the\nMicrosoft Update Catalog\n.\nIf you use Windows 11 Enterprise or Windows Server with Hotpatch, you'll see KB5064010 and it includes the same set of fixes, but the build number is 26100.4851.\nWhat's new in the August 2025 Patch Tuesday update\nAfter installing today's security updates, Windows 11 24H2 (\nKB5063878\n) will have its build number changed to Build 26100.4946, and 23H2 (\nKB5063875\n) will be changed to 226x1.5768.\nIn case of Windows 11 23H2, Microsoft warned that support for 23H2 ends on November 11, 2025. You'll be either force upgraded to 24H2 or stop receiving updates after the deadline.\nHere's the full list of improvements:\nRecall and other AI features in Europe.\n[Settings]\nNew!\nOn non-Copilot+ PCs, the Settings app now shows the Search box at the top center to make searching easier and more consistent.\nFixed: If your PC is set to ‘\nDo nothing’\nwhen you close the lid (under\nSettings\n>\nSystem\n>\nPower and Battery\n) and the Settings window is left open when you close the lid, reopening the lid might cause the Settings window to stop responding. It might become unresponsive to input or resizing and instead just display your accent color.\nFixed: Settings might stop responding when you try to save Wi-Fi network credentials.\n[Windows Resiliency Initiative]\nThe following changes are part of the\nWindows Resiliency Initiative\nannounced at Ignite 2024:\nNew!\nQuick machine recovery\nis now available. When enabled, it automatically detects and fixes widespread issues on Windows 11 devices using the Windows Recovery Environment (WinRE). This reduces downtime and avoids the need for manual fixes. If a device experiences a widespread boot issue, it enters WinRE, connects to the internet, and Microsoft can deliver a targeted fix through Windows Update.\nIT admins\ncan enable or customize this experience for their organization through the Intune Settings Catalog UI using the\nRemoteRemediationCSP\n. There is also a dedicated quick machine recovery settings page available under\nSystem\n>\nRecovery\n>\nQuick machine recovery\n. Today, it’s enabled by default for home users.\nNew!\nA more streamlined interface appears during an unexpected restart. This updated design aligns with Windows 11’s visual style and helps you return to work faster. The screen displays a more readable layout while keeping the technical details visible. This screen appears with a black background.\n[Start menu]\nNew!\nWe are adding a Boolean option to the Configure Start Pins policy to allow admins to apply Start menu pins once. This means that a user will receive admin pins on day 0 but can then make any changes to their Start pinned layout and have those changes safeguarded\n.\nThese changes can be optionally applied through the existing\nconfiguration Service Provider (CSP)\n.\n[Snap]\nNew!\nImprovements make it easier to learn and use Snap in Windows 11. Inline messages now appear when you accidentally open the Snap Bar by dragging an app to the upper center of your desktop or open the Snap menu by hovering over the Minimize or Maximize button. These messages provide helpful tips on Snap app windows and show keyboard shortcuts.\n[Windows Search]\nNew!\nWindows Search settings are now easier to find. Instead of two separate pages for settings (“Search permissions” and “Searching Windows”), you can find everything in one place under\nSettings\n>\nPrivacy & security\n>\nSearch\n. This new page has a modern look and a better layout, so you can quickly view and manage all your Windows Search settings.\n[Input]\nNew!\nThe Gamepad layout of the Windows touch keyboard now includes enhanced controller navigation and improved focus handling for child keys, menus, word suggestions, language switching, and settings. A new Gamepad keyboard, designed for gaming, also supports PIN sign-in on the Windows lock screen. It offers controller shortcuts for quick PIN entry and full navigation for those who prefer not to use shortcuts.\n[File Explorer]\nFixed: If you open\nMore options\nin File Explorer to view the full list of folders for the current path, the dropdown menu might not display completely, making the bottom part inaccessible.\nFixed: File operation progress dialogs might stop appearing when displayed from apps.\nFixed: Syncing more SharePoint sites to File Explorer might slow performance when navigating folders or opening the context menu. This can also affect how quickly files launch.\n[Desktop icons\n] Fixed: If you have an app pinned to your desktop and it updates, the app icon might not display correctly and instead show a white page.\n[Notifications]\nFixed: When you select a Windows notification, it might not bring the related app to the foreground as expected—for example, this can happen with Outlook notifications.\nMicrosoft is not currently aware of any issues with this update.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nMicrosoft fixes known issue that breaks Windows 11 updates\nMicrosoft August 2025 Patch Tuesday fixes one zero-day, 107 flaws\nWindows 10 KB5063709 update fixes extended security updates enrollment\nMicrosoft lifts Windows 11 update block for Easy Anti-Cheat users\nMicrosoft fixes bug behind incorrect Windows Firewall errors"
    },
    {
        "Title": "Windows 10 KB5063709 update fixes extended security updates enrollment",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb5063709-update-fixes-extended-security-updates-enrollment/",
        "Summary": "Microsoft has released the KB5063709 cumulative update for Windows 10 22H2 and Windows 10 21H2, with seven fixes or changes, including a fix for a bug that prevented enrollment in extended security updates. [...]",
        "Date": "2025-08-12",
        "Content": "Microsoft has released the KB5063709 cumulative update for Windows 10 22H2 and Windows 10 21H2, with seven fixes or changes, including a fix for a bug that prevented enrollment in extended security updates.\nThe Windows 10 KB5063709 update is mandatory as it contains\nMicrosoft's July 2025 Patch Tuesday\nsecurity updates, which fix one zero-day vulnerability and 136 other flaws.\nWindows users can install this update by going into\nSettings\n, clicking on\nWindows Update,\nand manually performing a\n'Check for Updates\n.'\nHowever, as this update is mandatory, it will automatically start installing in Windows once you check for updates. To make this more manageable, you can schedule a time when your computer is restarted to finish the installation.\nWindows 10 KB5063709 update\nSource: BleepingComputer\nAfter installing this update, Windows 10 22H2 will be updated to build 19045.6216, and Windows 10 21H2 will be updated to build 19044.6216.\nWindows 10 users can also manually download and install the KB5063709 update from the\nMicrosoft Update Catalog\n.\nWhat's new in Windows 10 KB5063709\nAs Windows 10 nears the end of its life in October 2025, Microsoft is mainly focusing on minor bug fixes and improvements to the operating system. However, this cumulative update fixes a significant bug that prevented users from enrolling in extended security updates.\nThe KB5063709 update includes seven fixes and changes that were previously being tested as part of the July preview update. No other fixes were introduced in this update.\nThe changes and fixes are listed below:\n​​​​​[Extended Security Updates]\nFixed: An issue impacting the\nWindows 10 Extended Security Updates (ESU) enrollment wizard\n. Some users experienced a problem where clicking\n\"Enroll now\"\ncaused the wizard window to open, begin loading, and then close unexpectedly. This occurred due to incomplete app registration, which prevented the wizard from loading correctly. This update addresses that issue to ensure a smoother enrollment experience.\n[Mobile Operator Profiles]\nUpdated: Country and Operator Settings Asset (COSA) profiles.\n[Secure Boot]\nNew!\nAdds the ability to deploy SKUSiPolicy VBS Anti-rollback protections through the Secure Boot\nAvailableUpdates\nregistry key.\n[Core File Systems]\nFixed: An issue observed in rare cases after installing the May 2025 security update and subsequent updates causing devices to experience stability issues. Some devices became unresponsive and stopped responding in specific scenarios.\n[Input]\nFixed: A known issue with the\nMicrosoft Changjie Input Method\n. Users were unable to select words after a recent update.\nFixed: A known issue when searching for an emoji in the emoji panel. After a recent update, the search always returns no results.\nFixed: An issue in which phonetic input methods, including the Hindi Phonetic Input keyboard and Marathi Phonetic keyboard do not work correctly after a recent update.\nMicrosoft states that there are no known issues with this update.\nA complete list of fixes can be found in the\nKB5063709 support bulletin\nand last month's\nKB5062649 preview update bulletin\n.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nWindows 10 KB5062554 cumulative update released with 13 changes, fixes\nMicrosoft August 2025 Patch Tuesday fixes one zero-day, 107 flaws\nWindows 10 KB5062554 update breaks emoji panel search feature\nMicrosoft July 2025 Patch Tuesday fixes one zero-day, 137 flaws\nMicrosoft warns of Windows update delays due to wrong timestamp"
    },
    {
        "Title": "US govt seizes $1 million in crypto from BlackSuit ransomware gang",
        "Link": "https://www.bleepingcomputer.com/news/security/us-govt-seizes-1-million-in-crypto-from-blacksuit-ransomware-gang/",
        "Summary": "The U.S. Department of Justice (DoJ) seized cryptocurrency and digital assets worth $1,091,453 at the time of confiscation, on January 9, 2024, from the BlackSuit ransomware gang. [...]",
        "Date": "2025-08-12",
        "Content": "The U.S. Department of Justice (DoJ) seized cryptocurrency and digital assets worth $1,091,453 at the time of confiscation, on January 9, 2024, from the BlackSuit ransomware gang.\nThe authorities tracked the crypto as the cybercriminals moved it repeatedly across virtual currency exchange accounts, depositing and withdrawing it to obfuscate the trace. Eventually, the amount was frozen when it reached a cooperating exchange.\nThe action was made possible thanks to evidence collected by the U.S. Attorney's Office for the Eastern District of Virginia on or about June 21, 2024.\nThe confiscated amount was part of a ransom payment made on April 4, 2023, in exchange for a decryptor. The unnamed victim paid the ransomware actors 49.3 Bitcoin, valued at about $1,445,000 at the time.\nThis\nasset seizure announcement\ncomes shortly after the law enforcement authorities in the U.S. seized BlackSuit's extortion portals on the dark web, in an international action codenamed '\nOperation Checkmate\n.'\nThis law enforcement operation severely disrupted the operations of the cybercrime group, which is behind the BlackSuit and also the Royal, Quantum, and, more recently, the Chaos ransomware platforms.\nLast week, the U.S. Department of Homeland Security (DHS)\nhighlighted\nthat the Royal and BlackSuit were responsible for 450 successful attacks in the United States, including organizations in healthcare, education, government, energy, and public safety sectors.\n\"Combined, the groups have received more than $370 million in ransom payments, based on present-day valuations of cryptocurrency,\" stated HSI in a press release late last week, highlighting the scale of financial damage these cybercriminals have caused.\nOn July 28, FBI Dallas announced the\nseizure of 20 Bitcoins\n, valued at approximately $2.4 million, from a cryptocurrency address belonging to a prominent member of the Chaos ransomware group.\nThe U.S. Department of Justice filed a civil complaint seeking the forfeiture of the amount from the FBI.\nThe seizure of crime proceeds is crucial in the fight against ransomware, especially when operators and affiliates aren't apprehended during law enforcement crackdowns, and remain free to use those funds to rebuild their infrastructure and recruit new affiliates.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nFBI seizes $2.4M in Bitcoin from new Chaos ransomware operation\nRoyal and BlackSuit ransomware gangs hit over 450 US companies\nBlackSuit ransomware extortion sites seized in Operation Checkmate\nDOJ investigates ex-ransomware negotiator over extortion kickbacks\nUS disrupts North Korean IT worker \"laptop farm\" scheme in 16 states"
    },
    {
        "Title": "Android's pKVM hypervisor earns SESIP Level 5 security certification",
        "Link": "https://www.bleepingcomputer.com/news/security/androids-pkvm-hypervisor-earns-sesip-level-5-security-certification/",
        "Summary": "Google announced that its protected Kernel-based Virtual Machine (pKVM) for Android has achieved SESIP Level 5 certification, the highest security assurance level for IoT and mobile platforms. [...]",
        "Date": "2025-08-12",
        "Content": "Google announced that its protected Kernel-based Virtual Machine (pKVM) for Android has achieved SESIP Level 5 certification, the highest security assurance level for IoT and mobile platforms.\nThe pKVM is the hypervisor underpinning the Android Virtualization Framework (AVF), providing an isolated, high-assurance environment for executing critical workloads. These include Google's AI models like Gemini Nano for local personal data processing, biometric authentication (face, fingerprint), DRM content handling, and firmware-level security.\nLevel 5 in SESIP (Security Evaluation Standard for IoT Platforms) is the highest assurance tier in the system developed by TrustCB, meaning a system has been tested against AVA_VAN.5 from Common Criteria (ISO 15408).\n\"Today marks a watershed moment and new benchmark for open-source security and the future of consumer electronics,\" Google announced.\n\"Google is proud to announce that protected KVM (pKVM), the hypervisor that powers the Android Virtualization Framework, has officially achieved SESIP Level 5 certification.\"\n\"This makes pKVM the first software security system designed for large-scale deployment in consumer electronics to meet this assurance bar.\"\nGoogle says its pKVM was tested by DEKRA in certified testing laboratories, which was confirmed to be resistant to sophisticated and advanced threats.\nGoogle commented that many TEEs (Trusted Execution Environments) found in consumer devices aren't formally certified or have only achieved lower levels of security assurance.\nThe tech giant says this creates uncertainty and disincentivizes developers from building highly secure applications that incorporate top-notch data protection mechanisms.\nWhat does this mean for users?\nThe SESIP Level 5 certification comes at a timely moment for consumers, with AI processing moving locally into their phones rather than the cloud, which increases the risk of personal data exposure.\nSmartphones are gradually turning into \"vaults\" holding a detailed profile of users' lives, so compromising them isn't only about stealing account credentials and credit cards anymore.\n\"pKVM and this certification is specifically addressing the threat model of increasingly valuable processing on-device,\" Dave Kleidermacher, VP Engineering, Android Security & Privacy, explained to BleepingComputer.\n\"Highly personalized data is information that is synthesized to create a helpful, tailored experience for an individual, going beyond basic information.\"\n\"It's not so much the type of data, but the increased ROI for an attacker that comes from having a single, centralized trove of data that is attractive to attackers.\"\n\"This is why strong security measures are essential and why valuable media content, digital ID, and biometric processing was, as an industry standard, moved into Trusted Execution Environments (TEEs) a long time ago.\"\nWhile the SESIP Level 5 certification itself doesn't mean much to the average Android user, the takeaway is that the pKVM, which powers on-device security features, is much harder to hack even by knowledgeable threat actors.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nOpenAI rolls out Gmail, Calendar, and Contacts integration in ChatGPT\nChatGPT's new subscription costs less than $5, but it's not for everyone\nOpenAI is testing 3,000-per-week limit for GPT-5 Thinking\nMicrosoft increases Zero Day Quest prize pool to $5 million\nGoogle Calendar invites let researchers hijack Gemini to leak user data"
    },
    {
        "Title": "Curly COMrades cyberspies hit govt orgs with custom malware",
        "Link": "https://www.bleepingcomputer.com/news/security/curly-comrades-cyberspies-hit-govt-orgs-with-custom-malware/",
        "Summary": "A new cyber-espionage threat group has been using a new backdoor malware that provides persistent access through a seemingly inactive scheduled task. [...]",
        "Date": "2025-08-12",
        "Content": "A new cyber-espionage threat group has been using a new backdoor malware that provides persistent access through a seemingly inactive scheduled task.\nThe threat actor's operations appear to support Russian interests by targeting government and judicial bodies in Georgia, and energy firms in Moldova.\nThe attacker is currently tracked as Curly COMrades and has been active since mid-2024 and is using a custom three-stage mallware component that researchers call MucorAgent.\nCurly COMrades attack chain\nIn a report today, cybersecurity company Bitdefender describes MucorAgent as a \"complex\" piece of malware \"engineered as a .NET stealthy tool capable of executing an AES-encrypted PowerShell script and uploading the resulting output to a designated server.\"\nThe researchers named the threat actor Curly COMrades due to the heavy use of the curl.exe tool for data exfiltration and communicating with the command-and-control (C2) server, and because of hijacking Component Object Model (COM) objects during the attack.\nWhile no strong overlaps with known Russian APT groups have been found, the researchers say that the threat \"group's operations align with the geopolitical goals of the Russian Federation.\"\nThe researchers couldn't determine the initial access vector but observed the installation of multiple proxy agents, including the Go-based Resocks, across internal systems.\nResocks is retrieved via curl.exe and registered as scheduled tasks or Windows services for persistence, communicating with the C2 via TCP 443 or 8443.\nFor redundancy, the hackers also deploy custom SOCKS5 servers and SSH + Stunnel for remote port forwarding.\nSome SSH connections are routed through a custom tool, CurlCat, which uses the\nlibcurl\nlibrary and a custom Base64 alphabet to obfuscate traffic by relaying it through compromised legitimate websites.\nNetwork A (attacker), Network B (victim)\nSource: Bitdefender\nInconsistent persitence mechanism\nBitdefender notes that the persistence mechanism they discovered was an erratic one as it was achieved by hijacking CLSIDs to target NGEN (Native Image Generator).\nNGEN is a default Windows .NET Framework component for pre-compiling assemblies, and can offer persistence through a disabled scheduled task.\nHowever, even if the task appears inactive, the operating system enables and executes it at random intervals (e.g. idle times, when deploying a new app), the researchers explain.\n\"Given this unpredictability, it is probable that a secondary, more predictable mechanism for executing this specific task also existed\" -\nBitdefender\nIn some cases, the attackers also installed the legitimate Remote Utilities (RuRat) remote monitoring software to maintain interactive control.\nAdditionally, they used the Remote Monitoring and Management (RMM) tool, a legitimate utility widely used by IT professionals to monitor, manage, and maintain client IT assets, such as servers, desktops, and mobile devices.\nStealthy MucorAgent .NET backdoor\nThe MucorAgent backdoor consists of three components, that can hijack a legitimate COM handler and load a second .NET stage that executes a component for bypassing the Antimalware Scan Interface (AMSI)  in Windows.\nThe third payload looks in specific locations for index.png and icon.png files, which are encrypted data blobs (likely scripts) downloaded from compromised websites.\nAcording to Bitdefender, the attacker collected valid credentials, likely in an attempt to move around the network, steal and exfiltrate data.\nThey note that the threat actor \"repeatedly tried to extract the NTDS database from domain controllers\" and \"attempted to dump LSASS memory from specific systems to recover active user credentials.\"\nBitdefender also observed the execution of living-off-the-land commands like netstat, tasklist, systeminfo, wmic, and ipconfig, along with PowerShell Active Directory enumeration cmdlets, and batch scripts used for automation.\nAlthough Curly COMrades' operations were part of a larger espionage campaign, the researchers underline that the threat actor put in extensive effort to maintain their access to the target.\nNevertheless, despite using LOLbins and open-source tools that blend well with regular traffic, and the smart persistence mechanism, the group's malicious moves still generated sufficient noise to be picked up by modern EDR/XDR sensors.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nSalt Typhoon hackers backdoor telcos with new GhostSpider malware\n'Batavia' Windows spyware campaign targets dozens of Russian orgs\nCanada says Salt Typhoon hacked telecom firm via Cisco flaw\nDetails emerge on WinRAR zero-day attacks that infected PCs with malware\nMicrosoft: Russian hackers use ISP access to hack embassies in AiTM attacks"
    },
    {
        "Title": "Over 3,000 NetScaler devices left unpatched against CitrixBleed 2 bug",
        "Link": "https://www.bleepingcomputer.com/news/security/over-3-000-netscaler-devices-left-unpatched-against-actively-exploited-citrixbleed-2-flaw/",
        "Summary": "Over 3,300 Citrix NetScaler devices remain unpatched against a critical vulnerability that allows attackers to bypass authentication by hijacking user sessions, nearly two months after patches were released. [...]",
        "Date": "2025-08-12",
        "Content": "Over 3,300 Citrix NetScaler devices remain unpatched against a critical vulnerability that allows attackers to bypass authentication by hijacking user sessions, nearly two months after patches were released.\nTracked as CVE-2025-5777 and referred to as\nCitrixBleed 2\n, this out-of-bounds memory read vulnerability results from insufficient input validation, enabling unauthenticated attackers to access restricted memory regions remotely on devices configured as a Gateway (VPN virtual server, ICA Proxy, CVPN, RDP Proxy) or AAA virtual server.\nSuccessfully exploiting this security flaw could enable threat actors to steal session tokens, credentials, and other sensitive data from public-facing gateways and virtual servers, allowing them to\nhijack user sessions\nand bypass multi-factor authentication (MFA).\nProof-of-concept (PoC) exploits targeting CVE-2025-5777\nwere released\nless than two weeks after the flaw was disclosed, while active exploitation in zero-day attacks\nwas detected\nweeks before the release of these PoC exploits.\nA similar Citrix security flaw, known as \"CitrixBleed,\" was exploited two years ago to hack NetScaler devices and move laterally across compromised networks in\nransomware attacks\nand\nbreaches targeting government entities\n.\nOn Monday, security analysts from the internet security nonprofit Shadowserver Foundation\nreported\nthat 3,312 Citrix NetScaler appliances were still vulnerable to ongoing CVE-2025-5777 attacks.\nShadowserver also spotted 4,142 such devices left unpatched against another critical vulnerability (CVE-2025-6543), which Citrix has tagged as actively\nexploited in denial-of-service (DoS) attacks\n.\nCitrix NetScaler unpatched devices (Shadowserver)\n​While Citrix states that CVE-2025-6543 is a memory overflow vulnerability that can lead to unintended control flow and denial of service, the Netherlands' National Cyber Security Centre (NCSC)\nwarned on Monday\nthat attackers have exploited this flaw as a zero-day since at least early May to breach multiple critical organizations in the country.\n\"The NCSC has determined that multiple critical organizations in the Netherlands have been successfully attacked via a vulnerability identified as CVE-2025-6543 in Citrix NetScaler,\" the NCSC said..\n\"The NCSC assesses the attacks as the work of one or more actors with an advanced modus operandi. The vulnerability was exploited as a zero-day, and traces were actively removed to conceal compromise at affected organizations.\"\nAlthough the agency did not name any of the affected organizations, the Openbaar Ministerie (the Netherlands' Public Prosecution Service)\ndisclosed a breach\non July 18th following an NCSC alert. As a result of the attack, the Openbaar Ministerie experienced\nsignificant operational disruption\nand only\nrecently\nrestored its\nemail servers\n.\nThe U.S. Cybersecurity and Infrastructure Security Agency (CISA) has also added the two vulnerabilities to its catalog of actively exploited vulnerabilities, ordering federal agencies to secure their systems against\nCVE-2025-5777 attacks\nwithin a day and against\nCVE-2025-6543 exploitation\nby July 21st.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nCitrix Bleed 2 exploited weeks before PoCs as Citrix denied attacks\nCISA tags Citrix Bleed 2 as exploited, gives agencies a day to patch\nPublic exploits released for Citrix Bleed 2 NetScaler flaw, patch now\nCitrix Bleed 2 flaw now believed to be exploited in attacks\nNetherlands: Citrix Netscaler flaw CVE-2025-6543 exploited to breach orgs"
    },
    {
        "Title": "275M patient records breached—How to meet HIPAA password manager requirements",
        "Link": "https://www.bleepingcomputer.com/news/security/275m-patient-records-breached-how-to-meet-hipaa-password-manager-requirements/",
        "Summary": "Healthcare led all industries in 2024 breaches—over 275M patient records exposed, mostly via weak or stolen passwords. See how the self-hosted password manager by Passwork helps providers meet HIPAA requirements, protect ePHI, and keep healthcare running. Try it free for 1 month. [...]",
        "Date": "2025-08-12",
        "Content": "In 2024, the healthcare sector experienced over 700 data breach incidents, which is higher than any other industry, including finance. These breaches exposed more than 275 million patient records, with password-related vulnerabilities serving as the primary attack vector in\nmost of the cases\n.\nWhile threat actors use various penetration methods, compromised credentials remain the most consistent and damaging entry point.\nThese statistics reflect a fundamental threat to patient and organizational safety. Current implications extend far beyond financial penalties or reputational damage. A breach of electronic Protected Health Information (ePHI) can disrupt patient care, compromise safety, and undermine trust in the whole healthcare system.\n“Since 2020, as reported by HHS Office of Civil Rights, 590 million medical records have been impacted by health care breaches, meaning that the entirety of the U.S. population has had their health care records compromised in some manner, with most being impacted more than once.” —\nAmerican Hospital Association\nThis reality has transformed password management from a routine IT function into a mission-critical component of healthcare delivery.\nThe Health Insurance Portability and Accountability Act (HIPAA) sets specific requirements for password management that healthcare organizations must address through comprehensive policies and technical safeguards. Yet, the regulation leaves many security leaders struggling to translate broad requirements into actionable implementation strategies.\nWhat is HIPAA and who does it cover?\nHIPAA, introduced in 1996, is a U.S. federal law that sets strict rules for protecting sensitive patient health information from unauthorized disclosure. While it is often associated with privacy protections, HIPAA also includes the Security Rule, which specifically addresses the safeguarding of electronic Protected Health Information.\nePHI refers to any personally identifiable health information that is created, stored, transmitted, or received electronically by a covered entity or business associate.\n“The role of the CISO in healthcare is very unique. I believe that information security is a patient safety issue. And I think a lot of organizations are just starting to think about it as not just a risk to a patient's information but a risk to a patient's life. Bad information in a medical record could actually kill someone. I see the role of the CISO as integral to the delivery of quality patient care.” —\nAnahi Santiago\n, CISO at Christiana Care Health System\nHIPAA applies to two primary categories of entities:\nCovered entities\n. Organizations like hospitals, clinics, doctors, insurance companies, and other healthcare providers.\nBusiness associates.\nIT providers, cloud storage companies, billing services, and consultants — people or companies that work with covered entities and have access to ePHI.\nHIPAA violations can result in significant penalties and reputational damage. Since 2003, the HHS Office for Civil Rights has i\nmposed $144,878,972 in total penalties\n, with recent 2025 penalties including $3 million\nagainst Solara Medical Supplies\nand $1.5 million\nagainst Warby Parker\nfor cybersecurity failures.\nBeyond financial consequences, organizations face permanent listing on OCR's \"Wall of Shame\"\nbreach portal\n, potential criminal prosecution (with 2,419 cases referred to the Department of Justice), and severe reputational damage.\nTry a HIPAA-compliant password manager free for 1 month.\nBy understanding HIPAA requirements and choosing a compliant password manager like Passwork, organizations can enhance their defense mechanisms against cyber threats.\nFor healthcare security leaders, the takeaway is clear: prioritizing password management is not optional — it's a critical component of both compliance and patient safety.\nBy investing in the right tools and practices, organizations can protect sensitive data, reduce risks, and build a culture of cybersecurity awareness.\nGet free 1-month trial\nBalancing security and clinical realities\nThe challenge is compounded by the unique operational environment of healthcare organizations. Unlike other industries, healthcare operates in a 24/7 environment where authentication delays or failures can jeopardize patient safety, disrupt critical care delivery, and potentially lead to life-threatening consequences. Doctors need instant access to patient information during emergencies, yet this same accessibility creates vulnerabilities that threat actors actively exploit.\nNew cybersecurity standards have made compliance even more challenging. The National Institute of Standards and Technology (NIST) updated its Digital Identity Guidelines (SP 800-63B) in 2024, shifting away from complex password requirements towards longer, more memorable passphrases while emphasizing multi-factor authentication and\nbreach detection capabilities\n.\nThese changes align with evolving threat patterns but require healthcare organizations to reassess their existing password policies and technical implementations.\nThere’s another critical challenge — usability. Software must not get in the way of clinical work. Healthcare professionals should be able to start using their new solutions right away — without formal training or disruption to the workflow.\nFor CISOs, Security Directors, and Compliance Officers in healthcare, the priority is clear: create password management strategies that meet HIPAA, follow current security best practices, and fit real clinical workflows. This means knowing both the regulations and the technical tools needed to counter modern threats.\n\"You can say you make systems secure and compliant. Or you can have operational checks and balances to make sure they actually stay compliant.\" —\nMitchell Parker\n, CISO at Temple Health\nHIPAA password management requirements\nRegulatory framework overview\nThe HIPAA Security Rule establishes a risk-based framework for protecting ePHI. Password management is addressed in both administrative and technical safeguards:\n45 CFR § 164.308(a)(5)(ii)(D):\nAdministrative Safeguards – Security Awareness and Training (Password Management)\n45 CFR § 164.312(d):\nTechnical Safeguards – Person or Entity Authentication\nThese statutes require covered entities and business associates to implement policies and procedures that ensure only authorized individuals have access to ePHI, and that authentication mechanisms are properly managed and secured.\nAdministrative safeguards\nThis section mandates that organizations implement “Procedures for creating, changing, and safeguarding passwords.”\nKey requirements include:\nFormal password policies.\nDocumented procedures covering password creation, modification, and protection.\nUser training.\nContinuous training on password security, including the recognition of social engineering attacks and the importance of unique, complex passwords.\nRisk-based approach.\nThe Security Rule requires organizations to conduct a risk analysis to determine appropriate password controls based on the nature of their systems and user access patterns.\nDocumentation.\nAll procedures, risk assessments, and policy decisions must be documented and retained for six years.\n\"Security has always been a people issue. The toughest security problem is getting people to understand\" —\nJigar Kadakia\n, CISO at Partners HealthCare\nTechnical safeguards\nThis section requires “Implement procedures to verify that a person or entity seeking access to electronic protected health information is the one claimed.”\nIn practice, this means:\nAuthentication mechanisms.\nOrganizations must deploy technical controls to authenticate users.\nAccountability.\nSystems must log authentication events and support audit trails to detect and investigate unauthorized access.\nScalability and integration.\nAuthentication controls must work across diverse healthcare IT systems, including EHRs, medical devices, and cloud services.\nAddressable vs. required specifications\nHIPAA distinguishes between “required” and “addressable” implementation specifications:\nRequired.\nThese are mandatory. Failure to implement them constitutes non-compliance.\nAddressable.\nOrganizations must assess whether the specification is reasonable and appropriate in their environment. If not, they must document why and implement an equivalent alternative.\nAs for password management, many controls (such as unique user IDs) are required, while others (such as automatic logoff) are addressable.\nHowever, the burden of proof lies with the organization, which must justify its decisions, document them, and periodically review their effectiveness.\nKey criteria for choosing a password manager\nChoosing a password manager is an important step for healthcare providers. A well-chosen password manager does more than just store credentials — it becomes a foundation of cybersecurity strategy, protecting sensitive information while empowering users with seamless access management.\nEncryption.\nA password manager must use end-to-end encryption to ensure that passwords are inaccessible to unauthorized parties and can be decrypted only by the intended recipient.\nSecure architecture.\nA solution should operate on a zero-knowledge architecture, meaning that even the service provider must not be able to access or decipher confidential data.\nAccess management.\nA password manager should support role-based access control (RBAC), allowing administrators to define and enforce permissions based on user responsibilities.\nAudit trails.\nDetailed logs should make it possible for administrators to track user actions, identify potential security issues, and ensure compliance with regulatory requirements.\nUser experience.\nThe solution should offer an intuitive interface and seamless integration with existing systems, minimizing the learning curve for users. Features like auto-fill, password generation, and centralized management should be simple to navigate. This matters in healthcare, where staff spend up to 45 minutes per shift just logging into different systems.\nScalability and performance.\nA solution should male it possible to manage credentials for thousands of users across hundreds of applications, including electronic health records, medical devices, administrative systems, and third-party cloud services.\nFocusing on these features helps to choose a password manager that keeps organizations secure and easy to control. A good solution balances strong protection with a straightforward experience, reducing risks and encouraging better security habits.\nHIPAA and Passwork\nSelecting a password manager for healthcare institutions means meeting the highest standards of security, and regulatory compliance. At the same time, it should fit seamlessly into employees’ workflows, as overly complex tools risk immediate rejection — staff will normally find risky workarounds when systems are too complicated.\nPasswork\narchitecture and feature set address the specific compliance challenges and help healthcare providers safeguard electronic Protected Health Information and maintain compliance.\nCertifications and security practices.\nPasswork is\nISO 27001 certified\n, demonstrating adherence to internationally recognized information security standards. Regular penetration testing by HackerOne helps ensure the platform remains resilient against emerging threats.\nOn-premise deployment.\nSelf-hosted deployment allows healthcare organizations to host the password manager within their own infrastructure. This approach keeps credentials under direct control, supports HIPAA’s data protection requirements, and minimizes exposure to third-party risks.\nData protection by design.\nPasswork combines zero-knowledge architecture with AES-256 end-to-end encryption, reducing the risk of unauthorized disclosure and fully supports HIPAA’s privacy, security, and technical safeguard requirements\nAccess management.\nIntegration with LDAP and SSO simplifies user authentication and centralizes access management.\nGranular access control.\nRole-based access control enables administrators to define precise permissions for each user — only authorized staff can access specific data, supporting HIPAA’s minimum necessary standard.\nAudit trail and real-time monitoring.\nHIPAA requires detailed audit controls. Passwork provides comprehensive logging of all actions, allowing organizations to track access and modifications to sensitive data. Real-time notifications for critical events helping organizations respond quickly to potential security incidents.\nMulti-factor authentication.\nSupport for MFA adds an extra layer of security even if a password is compromised.\nEasy onboarding.\nIntuitive interface allows healthcare staff to adopt the system quickly, minimizing disruption and accelerating the transition to a secure, centralized password management. Passwork has received the \"Ease of Use\" award from Capterra, confirming that the solution is genuinely user-friendly and does not require extensive training.\n“We believe that security and usability must go hand in hand, especially in healthcare. Our mission is to make data protection stronger, without making life harder for everyday staff” — Alex Muntyan, CEO of Passwork\nBy combining advanced security features with compliance-focused design, Passwork helps healthcare organizations meet HIPAA requirements and protect their most sensitive patient related records.\nWay to compliance\nMeeting the HIPAA requirements demands sustained leadership commitment, ongoing technological investments, and agility when responding to new threats and regulations. Organizations that successfully implement comprehensive password management solutions will strengthen security posture and improve patient care capabilities in an increasingly digital healthcare environment.\nBy understanding HIPAA requirements and choosing a compliant password manager like\nPasswork\n, organizations can enhance their organization’s defense mechanisms against cyber threats.\nFor healthcare security leaders, the takeaway is clear: prioritizing password management is not optional, it is a critical component of both compliance and patient safety.\nBy investing in the right tools and practices, organizations can protect sensitive data, reduce risks, and build a culture of cybersecurity awareness.\nPasswork provides an advantage of effective teamwork with corporate passwords in a totally safe environment.\nTry the HIPAA-compliant Passwork password manager free for 1 month.\nSponsored and written by\nPasswork\n."
    },
    {
        "Title": "Windows 11 23H2 Home and Pro reach end of support in November",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-23h2-home-and-pro-reach-end-of-support-in-november/",
        "Summary": "Microsoft announced today that systems running Home and Pro editions of Windows 11 23H2 will stop receiving updates in three months. [...]",
        "Date": "2025-08-12",
        "Content": "Microsoft announced today that systems running Home and Pro editions of Windows 11 23H2 will stop receiving updates in three months.\nHowever, as the company\nexplains\non the Windows release health dashboard, Enterprise and Education editions will remain under mainstream support until November 10, 2026.\n\"Windows 11 Home and Pro, version 23H2 will reach the end of updates on November 11, 2025. This version was released in October of 2023,\" the company\nsaid today\n. \"Customers who contact Microsoft Support after this date will be directed to update their device to the latest version of Windows 11 to remain supported.\"\nLast month, Microsoft\nalso reminded customers\nthat the last supported editions of Windows 11 22H2 will reach their end of servicing on October 14.\nWindows 11 23H2 users are advised to upgrade to Windows 11 24H2, the latest version of Windows 11, also known as the Windows 11 2024 Update, which\nstarted rolling out\nin May 2024 to enterprise customers enrolled in the Windows Insider Release Preview Channel and became generally available\nto eligible Windows 11 22H2/23H2 devices\nin October 2024.\nHowever, before upgrading, it's important to note that Microsoft has introduced several\nWindows 11 24H2 safeguard holds\nfor devices with incompatible software and drivers.\nCompatibility holds that still stand will block upgrades to the latest Windows 11 version on systems with incompatible\nSenseShield Technology code-obfuscation drivers\n,\nintegrated cameras\n,\nIntel Smart Sound Technology (SST) audio drivers\n,\nwallpaper customization software\n, and\nDirac audio improvement software\n.\nYou can find more details about the end-of-service dates of other Windows releases using the\nLifecycle Policy\nsearch tool or on the\nWindows Lifecycle FAQ\npage. Redmond also provides the\ncomplete list\nof all products\nthat will be retired or will reach the end of support over the coming months.\nStatcounter Global Stats data\nshows that, three years after its\nOctober 2021 launch\n, Windows 11 has\nfinally surpassed Windows 10's install base\n, with over 53% of all Windows systems running Windows 11, compared to only 42% running Windows 10.\nSteam's Hardware & Software Survey\npaints an even better picture for Windows 11, with 59.9% of gamers running Windows 11 and only 35.1% using Windows 10 as of July 2025.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nMicrosoft will stop supporting Windows 11 22H2 in October\nOneNote finally gets \"paste text only\" feature on Windows and Mac\nMicrosoft fixes known issue that breaks Windows 11 updates\nMicrosoft confirms Family Safety blocks Google Chrome from launching\nWindows 10 users can get extended security updates using Microsoft points"
    },
    {
        "Title": "Elevation-of-Privilege Vulns Dominate Microsoft's Patch Tuesday",
        "Link": "https://www.darkreading.com/application-security/elevation-privilege-vulns-dominate-microsoft-patches",
        "Summary": "The company's August security update consisted of patches for 111 unique Common Vulnerabilities and Exposures (CVEs).",
        "Date": "2025-08-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/elevation-privilege-vulns-dominate-microsoft-patches"
    },
    {
        "Title": "Charon Ransomware Emerges With APT-Style Tactics",
        "Link": "https://www.darkreading.com/threat-intelligence/charon-ransomware-apt-tactics",
        "Summary": "The first documented deployment of the novel malware in a campaign against the Middle Eastern public sector and aviation industry may be tied to China's state-sponsored actor Earth Baxia.",
        "Date": "2025-08-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/charon-ransomware-apt-tactics"
    },
    {
        "Title": "How to Stay a Step Ahead of a Non-Obvious Threat",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/stay-step-ahead-non-obvious-threat",
        "Summary": "Securing business logic isn't just a technical requirement — it's a business imperative.",
        "Date": "2025-08-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/stay-step-ahead-non-obvious-threat"
    },
    {
        "Title": "ShinyHunters Tactics Now Mirror Scattered Spider",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/shinyhunters-tactics-mirror-scattered-spider",
        "Summary": "There's growing evidence that two of arguably the most dangerous cybercrime groups out there are tag-teaming big targets.",
        "Date": "2025-08-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/shinyhunters-tactics-mirror-scattered-spider"
    },
    {
        "Title": "Microsoft Patch Tuesday, August 2025 Edition",
        "Link": "https://krebsonsecurity.com/2025/08/microsoft-patch-tuesday-august-2025-edition/",
        "Summary": "Microsoft today released updates to fix more than 100 security flaws in its Windows operating systems and other software. At least 13 of the bugs received Microsoft's most-dire \"critical\" rating, meaning they could be abused by malware or malcontents to gain remote access to a Windows system with little or no help from users.",
        "Date": "2025-08-12",
        "Content": "Microsoft today released updates to fix more than 100 security flaws in its Windows operating systems and other software. At least 13 of the bugs received Microsoft’s most-dire “critical” rating, meaning they could be abused by malware or malcontents to gain remote access to a Windows system with little or no help from users.\n\nAugust’s patch batch from Redmond includes an update for CVE-2025-53786, a vulnerability that allows an attacker to pivot from a compromised Microsoft Exchange Server directly into an organization’s cloud environment, potentially gaining control over Exchange Online and other connected Microsoft Office 365 services. Microsoft first warned about this bug on Aug. 6, saying it affects Exchange Server 2016 and Exchange Server 2019, as well as its flagship Exchange Server Subscription Edition.\nBen McCarthy, lead cyber security engineer at Immersive, said a rough search reveals approximately 29,000 Exchange servers publicly facing on the internet that are vulnerable to this issue, with many of them likely to have even older vulnerabilities.\nMcCarthy said the fix for CVE-2025-53786 requires more than just installing a patch, such as following Microsoft’s manual instructions for creating a dedicated service to oversee and lock down the hybrid connection.\n“In effect, this vulnerability turns a significant on-premise Exchange breach into a full-blown, difficult-to-detect cloud compromise with effectively living off the land techniques which are always harder to detect for defensive teams,” McCarthy said.\nCVE-2025-53779 is a weakness in the Windows Kerberos authentication system that allows an unauthenticated attacker to gain domain administrator privileges. Microsoft credits the discovery of the flaw to Akamai researcher Yuval Gordon, who dubbed it “BadSuccessor” in a May 2025 blog post. The attack exploits a weakness in “delegated Managed Service Account” or dMSA — a feature that was introduced in Windows Server 2025.\nSome of the critical flaws addressed this month with the highest severity (between 9.0 and 9.9 CVSS scores) include a remote code execution bug in the Windows GDI+ component that handles graphics rendering (CVE-2025-53766) and CVE-2025-50165, another graphics rendering weakness. Another critical patch involves CVE-2025-53733, a vulnerability in Microsoft Word that can be exploited without user interaction and triggered through the Preview Pane.\nOne final critical bug tackled this month deserves attention: CVE-2025-53778, a bug in Windows NTLM, a core function of how Windows systems handle network authentication. According to Microsoft, the flaw could allow an attacker with low-level network access and basic user privileges to exploit NTLM and elevate to SYSTEM-level access — the highest level of privilege in Windows. Microsoft rates the exploitation of this bug as “more likely,” although there is no evidence the vulnerability is being exploited at the moment.\nFeel free to holler in the comments if you experience problems installing any of these updates. As ever, the SANS Internet Storm Center has its useful breakdown of the Microsoft patches indexed by severity and CVSS score, and AskWoody.com is keeping an eye out for Windows patches that may cause problems for enterprises and end users.\nWindows 10 users out there likely have noticed by now that Microsoft really wants you to upgrade to Windows 11. The reason is that after the Patch Tuesday on October 14, 2025, Microsoft will stop shipping free security updates for Windows 10 computers. The trouble is, many PCs running Windows 10 do not meet the hardware specifications required to install Windows 11 (or they do, but just barely).\nIf the experience with Windows XP is any indicator, many of these older computers will wind up in landfills or else will be left running in an unpatched state. But if your Windows 10 PC doesn’t have the hardware chops to run Windows 11 and you’d still like to get some use out of it safely, consider installing a newbie-friendly version of Linux, like Linux Mint.\nLike most modern Linux versions, Mint will run on anything with a 64-bit CPU that has at least 2GB of memory, although 4GB is recommended. In other words, it will run on almost any computer produced in the last decade.\nThere are many versions of Linux available, but Linux Mint is likely to be the most intuitive interface for regular Windows users, and it is largely configurable without any fuss at the text-only command-line prompt. Mint and other flavors of Linux come with LibreOffice, which is an open source suite of tools that includes applications similar to Microsoft Office, and it can open, edit and save documents as Microsoft Office files.\nIf you’d prefer to give Linux a test drive before installing it on a Windows PC, you can always just download it to a removable USB drive. From there, reboot the computer (with the removable drive plugged in) and select the option at startup to run the operating system from the external USB drive. If you don’t see an option for that after restarting, try restarting again and hitting the F8 button, which should open a list of bootable drives. Here’s a fairly thorough tutorial that walks through exactly how to do all this.\nAnd if this is your first time trying out Linux, relax and have fun: The nice thing about a “live” version of Linux (as it’s called when the operating system is run from a removable drive such as a CD or a USB stick) is that none of your changes persist after a reboot. Even if you somehow manage to break something, a restart will return the system back to its original state.\n\r\n         This entry was posted on Tuesday 12th of August 2025 06:14 PM \r\n         \nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "Inside the Dark Web’s Access Economy: How Hackers Sell the Keys to Enterprise Networks",
        "Link": "https://www.securityweek.com/inside-the-dark-webs-access-economy-how-hackers-sell-the-keys-to-enterprise-networks/",
        "Summary": "<p>Rapid7’s analysis of dark web forums reveals a thriving market where elite hackers sell corporate network access to buyers, turning cybercrime into a streamlined business.</p>\n<p>The post <a href=\"https://www.securityweek.com/inside-the-dark-webs-access-economy-how-hackers-sell-the-keys-to-enterprise-networks/\">Inside the Dark Web’s Access Economy: How Hackers Sell the Keys to Enterprise Networks</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/inside-the-dark-webs-access-economy-how-hackers-sell-the-keys-to-enterprise-networks/"
    },
    {
        "Title": "1Kosmos Raises $57 Million for Identity Verification and Authentication Platform",
        "Link": "https://www.securityweek.com/1kosmos-raises-57-million-for-identity-verification-and-authentication-platform/",
        "Summary": "<p>1Kosmos has raised $57 million in Series B funding, which brings the total raised by the company to $72 million.</p>\n<p>The post <a href=\"https://www.securityweek.com/1kosmos-raises-57-million-for-identity-verification-and-authentication-platform/\">1Kosmos Raises $57 Million for Identity Verification and Authentication Platform</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/1kosmos-raises-57-million-for-identity-verification-and-authentication-platform/"
    },
    {
        "Title": "Now Live: CodeSecCon – Where Software Security’s Next Chapter Unfolds (Virtual Event)",
        "Link": "https://www.securityweek.com/codeseccon-is-today-where-software-securitys-next-chapter-unfolds-virtual-event/",
        "Summary": "<p>Taking place August 12-13, CodeSecCon is the premier virtual event bringing together developers and cybersecurity professionals to revolutionize the way applications are built, secured, and maintained.</p>\n<p>The post <a href=\"https://www.securityweek.com/codeseccon-is-today-where-software-securitys-next-chapter-unfolds-virtual-event/\">Now Live: CodeSecCon &#8211; Where Software Security’s Next Chapter Unfolds (Virtual Event)</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/codeseccon-is-today-where-software-securitys-next-chapter-unfolds-virtual-event/"
    },
    {
        "Title": "SAP Patches Critical S/4HANA Vulnerability",
        "Link": "https://www.securityweek.com/sap-patches-critical-s-4hana-vulnerability/",
        "Summary": "<p>SAP has released 15 new security notes on the August 2025 Patch Tuesday, including for critical vulnerabilities.</p>\n<p>The post <a href=\"https://www.securityweek.com/sap-patches-critical-s-4hana-vulnerability/\">SAP Patches Critical S/4HANA Vulnerability</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/sap-patches-critical-s-4hana-vulnerability/"
    },
    {
        "Title": "OT Networks Targeted in Widespread Exploitation of Erlang/OTP Vulnerability",
        "Link": "https://www.securityweek.com/ot-networks-targeted-in-widespread-exploitation-of-erlang-otp-vulnerability/",
        "Summary": "<p>The recently patched Erlang/OTP flaw CVE-2025-32433 has been exploited since early May, shortly after its existence came to light.</p>\n<p>The post <a href=\"https://www.securityweek.com/ot-networks-targeted-in-widespread-exploitation-of-erlang-otp-vulnerability/\">OT Networks Targeted in Widespread Exploitation of Erlang/OTP Vulnerability</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/ot-networks-targeted-in-widespread-exploitation-of-erlang-otp-vulnerability/"
    },
    {
        "Title": "Interlock Ransomware Group Allegedly Breaches City of St. Paul – Leaking 43 GB of Data",
        "Link": "https://dailydarkweb.net/interlock-ransomware-group-allegedly-breaches-city-of-st-paul-leaking-43-gb-of-data/",
        "Summary": "The Interlock ransomware group has allegedly targeted the government of the City of St. Paul, Minnesota 🇺🇸. The threat actors added the city to their data leak site, claiming responsibility for a significant data breach. Saint Paul is the capital of Minnesota and a major metropolitan hub with a population of over 310,000 residents. The [&#8230;]",
        "Date": "2025-08-12",
        "Content": "The Interlock ransomware group has allegedly targeted the government of the City of St. Paul, Minnesota 🇺🇸. The threat actors added the city to their data leak site, claiming responsibility for a significant data breach.\nSaint Paul is the capital of Minnesota and a major metropolitan hub with a population of over 310,000 residents.\nThe ransomware group claims that carelessness on the part of the city’s government led to the compromise, resulting in infrastructure damage and the exposure of sensitive resident data.\nAccording to the post, the threat actors have exfiltrated approximately 43 GB of data, comprising over 66,400 files.\nAn analysis of the allegedly leaked file structure suggests that a wide range of sensitive municipal and employee information has been compromised.\nThe exposure of such data could have serious consequences for both city employees and residents, potentially leading to identity theft and fraud.\nThe compromised data allegedly includes a variety of internal documents.\nBased on the file names, the leaked information appears to contain:\nWork Plans and Restructuring Documents\nEmployee Job Descriptions and Title Studies\nPay Statements and Financial Information\nLetters of Recommendation\nInternal Schedules\nEvaluation and Test Group Information\nTags:\nCity of St. Paul\nCyberSecurity\ndata-breach\ngovernment\nInterlock\nransomware\nUSA"
    },
    {
        "Title": "Play Ransomware Group Allegedly Breaches Rite Track, Travancore Analytics, Bluewater Yacht Sales, and The Scharine Group",
        "Link": "https://dailydarkweb.net/play-ransomware-group-allegedly-breaches-rite-track-travancore-analytics-bluewater-yacht-sales-and-the-scharine-group/",
        "Summary": "The Play ransomware group has allegedly added four new US-based companies to its list of victims, claiming to have infiltrated their networks and exfiltrated sensitive data. The group, known for its double-extortion tactics, posted the names of the organizations on its dark web leak site on August 11, 2025, threatening to publish the stolen files [&#8230;]",
        "Date": "2025-08-12",
        "Content": "The Play ransomware group has allegedly added four new US-based companies to its list of victims, claiming to have infiltrated their networks and exfiltrated sensitive data. The group, known for its double-extortion tactics, posted the names of the organizations on its dark web leak site on August 11, 2025, threatening to publish the stolen files if their ransom demands are not met. The targeted companies span various industries, from semiconductor manufacturing to agriculture and luxury yacht sales.\nThe threat actors have set a publication deadline of August 15, 2025, for all four victims, a common tactic used to pressure companies into negotiating. The group claims to have stolen a wide range of confidential information. While the exact volume of data exfiltrated from each company has not been disclosed, the hackers assert that the stolen files include private and personal confidential data, client documents, financial records, and employee information. The victims of this alleged multi-pronged attack include:\nRite Track:\nA prominent supplier of customized equipment solutions for the semiconductor and other high-tech industries, founded in 1993.\nTravancore Analytics:\nA company operating in the business services sector.\nBluewater Yacht Sales:\nA well-established boat dealer founded in 1972, specializing in the sale of yachts across the United States.\nThe Scharine Group:\nAn entity involved in the agriculture sector.\nThe attackers claim the compromised data for each company contains similar categories of sensitive information. The list of allegedly stolen data types includes:\nPrivate and personal confidential data\nClient documents\nBudgets\nPayroll records\nAccounting and tax documents\nIDs\nFinance information\nTags:\nBluewater Yacht Sales\ncyberattack\ndata-breach\nPlay\nransomware\nRite Track\nThe Scharine Group\nTravancore Analytics\nUSA"
    },
    {
        "Title": "Rhysida Ransomware Allegedly Breaches US Printer Trans-Tex",
        "Link": "https://dailydarkweb.net/rhysida-ransomware-allegedly-breaches-us-printer-trans-tex/",
        "Summary": "The Rhysida ransomware group has allegedly targeted Trans-Tex, a prominent US-based printing company. The group has added Trans-Tex to its dark web leak site, claiming to have exfiltrated a significant amount of sensitive data. Trans-Tex, located in Cranston, Rhode Island, is known as a leader in the narrow web dye sublimation printing industry, with over [&#8230;]",
        "Date": "2025-08-12",
        "Content": "The Rhysida ransomware group has allegedly targeted Trans-Tex, a prominent US-based printing company. The group has added Trans-Tex to its dark web leak site, claiming to have exfiltrated a significant amount of sensitive data. Trans-Tex, located in Cranston, Rhode Island, is known as a leader in the narrow web dye sublimation printing industry, with over 25 years of experience. The attack places the company’s confidential and operational data at severe risk of exposure.\nThe threat actors are auctioning the allegedly stolen data, setting a 7-day deadline for the sale. According to their post, the data is being sold exclusively to a single buyer for a price of 5 BTC. Proof of the breach was provided in the form of screenshots displaying various internal documents. This public auction tactic is designed to pressure the victim company into paying the ransom to prevent the widespread dissemination of their sensitive information.\nBased on the evidence shared by the Rhysida group, the compromised data allegedly includes a variety of financial and business documents. The sample files displayed on the leak site suggest the following types of information were exfiltrated:\nEmployer’s Quarterly Federal Tax Returns (Form 941)\nPurchase Orders\nInvoices\nOther sensitive business and financial records\nTags:\ncyberattack\ndata-breach\nransomware\nRhysida\nTrans-Tex\nUSA"
    },
    {
        "Title": "Qilin Ransomware Group Allegedly Breaches Burmann and EMPUR Produktions GmbH",
        "Link": "https://dailydarkweb.net/qilin-ransomware-group-allegedly-breaches-burmann-and-empur-produktions-gmbh/",
        "Summary": "The Qilin ransomware group has allegedly added two German companies, Burmann and EMPUR Produktions GmbH, to its dark web leak site, claiming responsibility for a significant data breach. The threat actors posted evidence of the attack on August 11, 2025, threatening to publicly release sensitive files stolen from the companies&#8217; networks. This double-extortion attack puts [&#8230;]",
        "Date": "2025-08-12",
        "Content": "The Qilin ransomware group has allegedly added two German companies, Burmann and EMPUR Produktions GmbH, to its dark web leak site, claiming responsibility for a significant data breach. The threat actors posted evidence of the attack on August 11, 2025, threatening to publicly release sensitive files stolen from the companies’ networks. This double-extortion attack puts both companies at risk of severe operational disruption and reputational harm.\nBurmann is a key player in the physical security sector, providing automatic door and security structure solutions to a wide range of clients, including banks and large corporations. EMPUR Produktions GmbH is a notable manufacturer specializing in innovative heating and cooling systems. According to the claims made by the ransomware group, the stolen data is extensive. The leak from Burmann could potentially expose sensitive client details and security configurations, while the data from EMPUR allegedly contains a decade’s worth of financial reports, employee and customer PII, and proprietary technical documents.\nThe victims allegedly targeted by the Qilin ransomware group are:\nBurmann:\nA leading German company specializing in the installation of automatic doors and other security structures for the business sector, including shopping centers, movie theaters, and the offices of large corporations and banks. The group claims to have exfiltrated data including:\nInformation about all company clients\nFinancial documents\nOrder data\nEMPUR Produktions GmbH:\nA German producer and full-range retailer of innovative, high-quality surface heating and cooling systems. The group claims the leaked data contains:\nComplete financial reports for the last 10 years\nPersonal data of all customers and employees\nUnique technical documentation\nCompany’s research and development data\nTags:\nBurmann\nCyberSecurity\ndata-breach\nEMPUR\nGermany\nQilin\nransomware"
    },
    {
        "Title": "MMA Transfers Allegedly Hit by D4rk4rmy Ransomware Attack – 74GB of Data Leaked",
        "Link": "https://dailydarkweb.net/mma-transfers-allegedly-hit-by-d4rk4rmy-ransomware-attack-74gb-of-data-leaked/",
        "Summary": "Manchester-based airport transfer service, MMA Transfers, has allegedly been targeted by the D4rk4rmy ransomware group, resulting in the exfiltration of 74GB of sensitive data. The company, founded in 2016, is a prominent name in the UK&#8217;s travel industry, offering professional airport transfer services from Manchester to various destinations across the country. With a fleet of [&#8230;]",
        "Date": "2025-08-12",
        "Content": "Manchester-based airport transfer service, MMA Transfers, has allegedly been targeted by the D4rk4rmy ransomware group, resulting in the exfiltration of 74GB of sensitive data. The company, founded in 2016, is a prominent name in the UK’s travel industry, offering professional airport transfer services from Manchester to various destinations across the country. With a fleet of 110 professional drivers, MMA Transfers provides 24/7 transportation for a wide range of clients, including business travelers, families on vacation, and event attendees, priding itself on safety, punctuality, and customer comfort.\nThe D4rk4rmy group, a relatively new but aggressive ransomware operator, has claimed responsibility for the attack, which is said to have occurred on August 12, 2025. The group has threatened to release the stolen data unless a ransom is paid. The compromised information allegedly includes a vast amount of both corporate and personal data, which could have significant implications for the company and its clients.\nThe exfiltrated data reportedly includes:\nAll Driver and Client Data\nFleet Paperwork\nInsurance and Registration Documents\nKYC (Know Your Customer) for all Drivers\nCorporate Documents\nTags:\nCyberSecurity\nD4rk4rmy\ndata-breach\ndata-leak\nMMA Transfers\nransomware\nUK"
    },
    {
        "Title": "Lee & Associates Allegedly Hit by Major Data Leak – Confidential Files Exposed",
        "Link": "https://dailydarkweb.net/lee-associates-allegedly-hit-by-major-data-leak-confidential-files-exposed/",
        "Summary": "Lee &#38; Associates, a major commercial real estate brokerage firm in North America, has allegedly been targeted in a significant data breach. A threat actor has claimed responsibility on a dark web forum for compromising the company&#8217;s network and exfiltrating what they describe as the &#8220;whole domain with all their confidentials.&#8221; Lee &#38; Associates is [&#8230;]",
        "Date": "2025-08-12",
        "Content": "Lee & Associates, a major commercial real estate brokerage firm in North America, has allegedly been targeted in a significant data breach. A threat actor has claimed responsibility on a dark web forum for compromising the company’s network and exfiltrating what they describe as the “whole domain with all their confidentials.” Lee & Associates is a leading firm in the commercial real estate market, with its Irvine office noted as completing more transactions in South Orange County than any other competitor in the region, highlighting the potential impact of such a breach.\nThe malicious actor supported their claim by posting a link to a large repository of files allegedly stolen from the company’s systems. The attackers explicitly stated that the leaked dataset contains a wide range of sensitive information. This incident could have serious implications for the company’s operations, its brokers, and its clients, given the confidential nature of real estate transactions and business contracts.\nThe threat actor has listed the following types of data as being included in the leak:\nCVVS\nPersonal Confidentials\nBusiness contracts\nOnline platform accounts\nProjects\nTags:\ncyber-attack\nCyberSecurity\ndata-breach\ndata-leak\nLee & Associates\nreal estate"
    },
    {
        "Title": "Motorcycle Giant Royal Enfield Allegedly Hit by Ransomware Attack",
        "Link": "https://dailydarkweb.net/motorcycle-giant-royal-enfield-allegedly-hit-by-ransomware-attack/",
        "Summary": "Royal Enfield, the iconic and globally recognized motorcycle manufacturer, has allegedly been targeted in a severe ransomware attack. A threat actor posted a breach notice on a dark web forum claiming to have achieved a &#8220;FULL SYSTEM COMPROMISE&#8221; against the corporation. Royal Enfield, originally a British brand founded in 1901 and now a subsidiary of [&#8230;]",
        "Date": "2025-08-12",
        "Content": "Royal Enfield, the iconic and globally recognized motorcycle manufacturer, has allegedly been targeted in a severe ransomware attack. A threat actor posted a breach notice on a dark web forum claiming to have achieved a “FULL SYSTEM COMPROMISE” against the corporation. Royal Enfield, originally a British brand founded in 1901 and now a subsidiary of India’s Eicher Motors, is one of the oldest motorcycle brands in the world still in continuous production, making it a high-profile target.\nThe perpetrators of the attack claim to have enacted a complete data lockdown, asserting that “ALL SERVERS — ENCRYPTED” and “ALL BACKUPS — WIPED.” This suggests a devastating attack aimed at crippling the company’s IT infrastructure. According to the notice, a ransom demand has already been sent to Royal Enfield, with a tight deadline of only 12 hours remaining for the company to comply.\nThe threat actor is employing a double-extortion strategy by stating that they are accepting bids and offers for the compromised data, should the initial ransom demand go unpaid. This tactic is designed to maximize pressure on the victim organization, threatening not just operational paralysis from the encrypted systems but also the public or private sale of their sensitive information. The actor claims to have proof of access available for potential bidders.\nTags:\ncyberattack\ndata-breach\nIndia\nransomware\nRoyal Enfield"
    },
    {
        "Title": "BreachForums Seized and Turned into Honeypot by Law Enforcement",
        "Link": "https://dailydarkweb.net/breachforums-seized-and-turned-into-honeypot-by-law-enforcement/",
        "Summary": "The notorious cybercrime and data leak marketplace, BreachForums, has been compromised and is now allegedly operating as a honeypot controlled by international law enforcement. The startling announcement came from the well-known threat actor ShinyHunters via a PGP-signed message posted on Telegram. According to the message, French law enforcement, in coordination with the U.S. Department of [&#8230;]",
        "Date": "2025-08-12",
        "Content": "The notorious cybercrime and data leak marketplace,\nBreachForums\n, has been compromised and is now allegedly operating as a honeypot controlled by international law enforcement. The startling announcement came from the well-known threat actor\nShinyHunters\nvia a PGP-signed message posted on Telegram. According to the message, French law enforcement, in coordination with the U.S. Department of Justice (DOJ) and the Federal Bureau of Investigation (FBI), seized control of the platform, its infrastructure, and its official PGP key. Shortly after this warning was issued, the forum went offline, adding weight to the claims.\nIn the detailed message, ShinyHunters warned that law enforcement has had deep access to the site’s data since its recent reinstatement. The compromised administrator accounts include “Hollow” and “ShinyHunters” itself. Furthermore, the message alleges that the “Founder” account was created and is being operated by a federal agent. This breach means that sensitive user data—including\nprivate messages, plaintext passwords, IP addresses, and email addresses\n—has been exposed to authorities. ShinyHunters also claimed the forum’s source code was altered to capture all user activity, effectively turning the site into a surveillance tool.\nTo clear up long-standing speculation, the message also confirmed that the administrator accounts “Anastasia” and “Hollow” were indeed alternate identities controlled by ShinyHunters. While asserting that their personal PGP key remains secure and unaffected, ShinyHunters urged users to treat any reappearance of BreachForums as a law enforcement trap. The actor advised the community to stay away from the site, stating it “will not be returning under legitimate operation.” The swift takedown of the forum following this announcement suggests a major disruption in the cybercrime community.\nTags:\nbreachforums\ncybercrime\nCyberSecurity\ndata-breach\nDOJ\nFBI\nhoneypot\nlaw enforcement\nPGP\nShinyHunters"
    },
    {
        "Title": "Vistra Group Allegedly Breached – Sensitive Offshore Client Data Surfaces on Dark Web",
        "Link": "https://dailydarkweb.net/vistra-group-allegedly-breached-sensitive-offshore-client-data-surfaces-on-dark-web/",
        "Summary": "A threat actor has allegedly posted a significant trove of data for sale on a dark web forum, claiming it belongs to the clients of Vistra Group, a prominent global provider of corporate, trust, and fund administration services. Vistra is known for its specialization in managing company formations and navigating complex regulatory landscapes, particularly in [&#8230;]",
        "Date": "2025-08-12",
        "Content": "A threat actor has allegedly posted a significant trove of data for sale on a dark web forum, claiming it belongs to the clients of Vistra Group, a prominent global provider of corporate, trust, and fund administration services. Vistra is known for its specialization in managing company formations and navigating complex regulatory landscapes, particularly in offshore jurisdictions, making the potential exposure of its client data highly sensitive. The data is being sold for approximately\n10\n,\n000\nworth of Monero (XMR).\nAccording to the dark web post, the leak originates from Vistra’s Hong Kong operations, specifically from clients previously managed by Sertus, a company acquired by Vistra in 2024. The total data size is reported to be around\n90\nGB, encompassing approximately\n450\n,\n000\nfiles related to nearly\n2\n,\n000\noffshore companies registered in jurisdictions like the British Virgin Islands, Cayman Islands, and Seychelles. The actor claims the data is current up to 2025.\nThe compromised information is said to be extensive and contains highly confidential corporate and personal details. The threat actor listed the types of data allegedly included in the leak:\nCertificate of Incorporation\nMemorandum & Articles of Association\nRegisters of Directors, Beneficial Owners, Members, Secretaries, and Transfers\nShare Certificates\nCorporate authorization documents\nBoard and Shareholder Resolutions\nPersonal identity documents (passports, national IDs) and proof of address\nPersonal and institutional financial information (balance sheets, financial statements, bank account numbers, source of funds, invoices)\nTags:\nCyberSecurity\ndark web\ndata-breach\ndata-leak\nhong kong\noffshore\nVistra Group"
    }
]