[
    {
        "Title": "New Win-DDoS Flaws Let Attackers Turn Public Domain Controllers into DDoS Botnet via RPC, LDAP",
        "Link": "https://thehackernews.com/2025/08/new-win-ddos-flaws-let-attackers-turn.html",
        "Summary": "A novel attack technique could be weaponized to rope thousands of public domain controllers (DCs) around the world to create a malicious botnet and use it to conduct power distributed denial-of-service (DDoS) attacks.\nThe approach has been codenamed Win-DDoS by SafeBreach researchers Or Yair and Shahak Morag, who presented their findings at the DEF CON 33 security conference today.\n\"As we",
        "Date": "2025-08-10",
        "Content": "A novel attack technique could be weaponized to rope thousands of public domain controllers (DCs) around the world to create a malicious botnet and use it to conduct power distributed denial-of-service (DDoS) attacks.\nThe approach has been codenamed Win-DDoS by SafeBreach researchers Or Yair and Shahak Morag, who\npresented\ntheir findings at the DEF CON 33 security conference today.\n\"As we explored the intricacies of the Windows LDAP client code, we discovered a significant flaw that allowed us to manipulate the URL referral process to point DCs at a victim server to overwhelm it,\" Yair and Morag said in a report shared with The Hacker News.\n\"As a result, we were able to create Win-DDoS, a technique that would enable an attacker to harness the power of tens of thousands of public DCs around the world to create a malicious botnet with vast resources and upload rates. All without purchasing anything and without leaving a traceable footprint.\"\nIn transforming DCs into a DDoS bot without the need for code execution or credentials, the attack essentially turns the Windows platform into becoming both the victim and the weapon. The attack flow is as follows -\nAttacker sends an RPC call to DCs that triggers them to become CLDAP clients\nDCs send the CLDAP request to the attacker's CLDAP server, which then returns a referral response that refers the DCs to the attacker's LDAP server in order to switch from UDP to TCP\nDCs then send the LDAP query to the attacker's LDAP server over TCP\nAttacker's LDAP server responds with an LDAP referral response containing a long list of LDAP referral URLs, all of which point to a single port on a single IP address\nDCs send an LDAP query on that port, causing the web server that may be served via the port to close the TCP connection\n\"Once the TCP connection is aborted, the DCs continue to the next referral on the list, which points to the same server again,\" the researchers said. \"And this behavior repeats itself until all the URLs in the referral list are over, creating our innovative Win-DDoS attack technique.\"\nWhat makes Win-DDoS significant is that it has high bandwidth and does not require an attacker to purchase dedicated infrastructure. Nor does it necessitate them to breach any devices, thereby allowing them to fly under the radar.\nFurther analysis of the LDAP client code referral process has revealed that it's possible to trigger an LSASS crash, reboot, or a blue screen of death (\nBSoD\n) by sending lengthy referral lists to DCs by taking advantage of the fact that there are no limits on referral list sizes and referrals are not released from the DC's heap memory until the information is successfully retrieved.\nOn top of that, the transport-agnostic code that's executed to server client requests has been found to harbor three new denial-of-service (DoS) vulnerabilities that can crash domain controllers without the need for authentication, and one additional DoS flaw that provides any authenticated user with the ability to crash a domain controller or Windows computer in a domain.\nThe identified shortcomings are listed below -\nCVE-2025-26673\n(CVSS score: 7.5) - Uncontrolled resource consumption in Windows Lightweight Directory Access Protocol (LDAP) allows an unauthorized attacker to deny service over a network (Fixed in May 2025)\nCVE-2025-32724\n(CVSS score: 7.5) - Uncontrolled resource consumption in Windows Local Security Authority Subsystem Service (LSASS) allows an unauthorized attacker to deny service over a network (Fixed in June 2025)\nCVE-2025-49716\n(CVSS score: 7.5) - Uncontrolled resource consumption in Windows Netlogon allows an unauthorized attacker to deny service over a network (Fixed in July 2025)\nCVE-2025-49722\n(CVSS score: 5.7) - Uncontrolled resource consumption in Windows Print Spooler Components allows an authorized attacker to deny service over an adjacent network (Fixed in July 2025)\nLike the\nLDAPNightmare\n(CVE-2024-49113) vulnerability detailed earlier this January, the latest findings show that there exist blind spots in Windows that could be targeted and exploited, crippling business operations.\n\"The vulnerabilities we discovered are zero-click, unauthenticated vulnerabilities that allow attackers to crash these systems remotely if they are publicly accessible, and also show how attackers with minimal access to an internal network can trigger the same outcomes against private infrastructure,\" the researchers said.\n\"Our findings break common assumptions in enterprise threat modeling: that DoS risks only apply to public services, and that internal systems are safe from abuse unless fully compromised. The implications for enterprise resilience, risk modeling, and defense strategies are significant.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Researchers Detail Windows EPM Poisoning Exploit Chain Leading to Domain Privilege Escalation",
        "Link": "https://thehackernews.com/2025/08/researchers-detail-windows-epm.html",
        "Summary": "Cybersecurity researchers have presented new findings related to a now-patched security issue in Microsoft's Windows Remote Procedure Call (RPC) communication protocol that could be abused by an attacker to conduct spoofing attacks and impersonate a known server.\nThe vulnerability, tracked as CVE-2025-49760 (CVSS score: 3.5), has been described by the tech giant as a Windows Storage spoofing bug",
        "Date": "2025-08-10",
        "Content": "Cybersecurity researchers have\npresented\nnew findings related to a now-patched security issue in Microsoft's Windows Remote Procedure Call (RPC) communication protocol that could be abused by an attacker to conduct spoofing attacks and impersonate a known server.\nThe vulnerability, tracked as CVE-2025-49760 (CVSS score: 3.5), has been described by the tech giant as a Windows Storage spoofing bug. It was fixed in July 2025 as part of its monthly Patch Tuesday update. Details of the security defect were\nshared\nby SafeBreach researcher Ron Ben Yizhak at the DEF CON 33 security conference this week.\n\"External control of file name or path in Windows Storage allows an authorized attacker to perform spoofing over a network,\" the company\nsaid\nin an advisory released last month.\nThe Windows RPC protocol utilizes universally unique identifiers (UUIDs) and an Endpoint Mapper (EPM) to enable the use of dynamic endpoints in client-server communications, and connect an RPC client to an endpoint registered by a server.\nThe vulnerability essentially makes it possible to manipulate a core component of the RPC protocol and stage what's called an EPM poisoning attack that allows unprivileged users to pose as a legitimate, built-in service with the goal of coercing a protected process to authenticate against an arbitrary server of an attacker's choosing.\nGiven that the functioning of EPM is analogous to that of the Domain Name System (DNS) – it maps an interface UUID to an endpoint, just the DNS resolves a domain to an IP address – the attack plays out like\nDNS poisoning\n, in which a threat actor tampers with DNS data to redirect users to malicious websites -\nPoison the EPM\nMasquerade as a legitimate RPC Server\nManipulate RPC clients\nAchieve local/domain privilege escalation via an\nESC8\nattack\n\"I was shocked to discover that nothing stopped me from registering known, built-in interfaces that belong to core services,\" Ben Yizhak said in a report shared with The Hacker News. \"I expected, for example, if Windows Defender had a unique identifier, no other process would be able to register it. But that was not the case.\"\n\"When I tried registering an interface of a service that was turned off, its client connected to me instead. This finding was unbelievable—there were no security checks completed by the EPM. It connected clients to an unknown process that wasn't even running with admin privileges.\"\nThe crux of the attack hinges on finding interfaces that aren't mapped to an endpoint, as well as those that could be registered right after the system boots by taking advantage of the fact that many services are set to \"delayed start\" for performance reasons, and make the boot process faster.\nIn other words, any service with a manual startup is a security risk, as the RPC interface wouldn't be registered on boot, effectively making it susceptible to a hijack by allowing an attacker to register an interface before the original service does.\nSafeBreach has also released a tool called\nRPC-Racer\nthat can be used to flag insecure RPC services (e.g., the Storage Service or StorSvc.dll) and\nmanipulate\na\nProtected Process Light\n(\nPPL\n) process (e.g., the Delivery Optimization service or DoSvc.dll) to authenticate the machine account against any server selected by the attacker.\nThe PPL technology ensures that the operating system only loads trusted services and processes, and safeguards running processes from termination or infection by malicious code. It was introduced by Microsoft with the release of Windows 8.1.\nAt a high level, the entire attack sequence is as follows -\nCreate a scheduled task that will be executed when the current user logs in\nRegister the interface of the Storage Service\nTrigger the Delivery Optimization service to send an RPC request to the Storage Service, resulting in it connecting to the attacker's dynamic endpoint\nCall the method GetStorageDeviceInfo(), which causes the Delivery Optimization service to receive an SMB share to a rogue server set up by the attacker\nThe Delivery Optimization service authenticates with the malicious SMB server with the machine account credentials, leaking the NTLM hash\nStage an\nESC8\nattack\nto\nrelay\nthe\ncoerced NTLM hashes\nto the web-based certificate enrollment services (\nAD CS\n) and achieve privilege escalation\nTo accomplish this, an offensive open-source tool like\nCertipy\ncan be used to request a Kerberos Ticket-Granting Ticket (TGT) using the certificate generated by passing the NTLM information to the AD CS server, and then leverage it to dump all secrets from the domain controller.\nSafeBreach said the EPM poisoning technique could be further expanded to conduct adversary-in-the-middle (AitM) and denial-of-service (DoS) attacks by forwarding the requests to the original service or registering many interfaces and denying the requests, respectively. The cybersecurity company also pointed out that there could be other clients and interfaces that are likely vulnerable to EPM poisoning.\nTo better detect these kinds of attacks, security products can monitor calls to RpcEpRegister and use Event Tracing for Windows (\nETW\n), a security feature that logs events that are raised by user-mode applications and kernel-mode drivers.\n\"Just like SSL pinning verifies that the certificate is not only valid but uses a specific public key, the identity of an RPC server should be checked,\" Ben Yizhak said.\n\"The current design of the endpoint mapper (EPM) doesn't perform this verification. Without this verification, clients will accept data from unknown sources. Trusting this data blindly allows an attacker to control the client's actions and manipulate it to the attacker's will.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    }
]