[
    {
        "Title": "ERMAC V3.0 Banking Trojan Source Code Leak Exposes Full Malware Infrastructure",
        "Link": "https://thehackernews.com/2025/08/ermac-v30-banking-trojan-source-code.html",
        "Summary": "Cybersecurity researchers have detailed the inner workings of an Android banking trojan called ERMAC 3.0, uncovering serious shortcomings in the operators' infrastructure.\n\"The newly uncovered version 3.0 reveals a significant evolution of the malware, expanding its form injection and data theft capabilities to target more than 700 banking, shopping, and cryptocurrency applications,\" Hunt.io",
        "Date": "2025-08-16",
        "Content": "Cybersecurity researchers have detailed the inner workings of an Android banking trojan called ERMAC 3.0, uncovering serious shortcomings in the operators' infrastructure.\n\"The newly uncovered version 3.0 reveals a significant evolution of the malware, expanding its form injection and data theft capabilities to target more than 700 banking, shopping, and cryptocurrency applications,\" Hunt.io\nsaid\nin a report.\nERMAC was\nfirst documented\nby ThreatFabric in September 2021, detailing its ability to conduct overlay attacks against hundreds of banking and cryptocurrency apps across the world. Attributed to a threat actor named DukeEugene, it's assessed to be an evolution of Cerberus and BlackRock.\nOther commonly\nobserved\nmalware families\n– including Hook (ERMAC 2.0), Pegasus, and Loot – possess a shared lineage: An ancestor in the form of ERMAC from which source code components have been passed down and modified through generations.\nHunt.io said it managed to obtain the complete source code associated with the malware-as-a-service (MaaS) offering from an open directory on 141.164.62[.]236:443, right down to its PHP and Laravel backend, React-based frontend, Golang exfiltration server, and Android builder panel.\nThe functions of each of the components are listed below -\nBackend C2 server - Provides operators the ability to manage victim devices and access compromised data, such as SMS logs, stolen accounts, and device data\nFrontend panel - Allows operators to interact with connected devices by issuing commands, managing overlays, and accessing stolen data\nExfiltration server - A Golang server used for exfiltrating stolen data and managing information related to compromised devices\nERMAC backdoor - An Android implant written in Kotlin that offers the ability to control the compromised device and collect sensitive data based on incoming commands from the C2 server, while ensuring that the infections don't touch devices located in the Commonwealth of Independent States (CIS) nations\nERMAC builder - A tool to help customers configure and create builds for their malware campaigns by providing the application name, server URL, and other settings for the Android backdoor\nBesides an expanded set of app targets, ERMAC 3.0 adds new form injection methods, an overhauled command-and-control (C2) panel, a new Android backdoor, and AES-CBC encrypted communications.\n\"The leak revealed critical weaknesses, such as a hardcoded JWT secret and a static admin bearer token, default root credentials, and open account registration on the admin panel,\" the company said. \"By correlating these flaws with live ERMAC infrastructure, we provide defenders with concrete ways to track, detect, and disrupt active operations.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Russian Group EncryptHub Exploits MSC EvilTwin Vulnerability to Deploy Fickle Stealer Malware",
        "Link": "https://thehackernews.com/2025/08/russian-group-encrypthub-exploits-msc.html",
        "Summary": "The threat actor known as EncryptHub is continuing to exploit a now-patched security flaw impacting Microsoft Windows to deliver malicious payloads.\nTrustwave SpiderLabs said it recently observed an EncryptHub campaign that brings together social engineering and the exploitation of a vulnerability in the Microsoft Management Console (MMC) framework (CVE-2025-26633, aka MSC EvilTwin) to trigger",
        "Date": "2025-08-16",
        "Content": "The threat actor known as\nEncryptHub\nis continuing to exploit a now-patched security flaw impacting Microsoft Windows to deliver malicious payloads.\nTrustwave SpiderLabs said it recently observed an EncryptHub campaign that brings together social engineering and the exploitation of a vulnerability in the Microsoft Management Console (MMC) framework (CVE-2025-26633, aka MSC\nEvilTwin\n) to trigger the infection routine via a rogue Microsoft Console (MSC) file.\n\"These activities are part of a broad, ongoing wave of malicious activity that blends social engineering with technical exploitation to bypass security defenses and gain control over internal environments,\" Trustwave researchers Nathaniel Morales and Nikita Kazymirskyi\nsaid\n.\nEncryptHub, also tracked as LARVA-208 and Water Gamayun, is a Russian hacking group that first gained prominence in mid-2024. Operating at a high tempo, the financially motivated crew is\nknown\nfor leveraging several methods, including fake job offers, portfolio review, and even compromising Steam games, to infect targets with stealer malware.\nThe threat actor's abuse of CVE-2025-26633 was\npreviously documented\nby Trend Micro in March 2025, uncovering attacks that deliver two backdoors called SilentPrism and DarkWisp.\nThe latest attack sequence involves the threat actor claiming to be from the IT department and sending a Microsoft Teams request to the target with the goal of initiating a remote connection and deploying secondary payloads by means of PowerShell commands.\nAmong the files dropped are two MSC files with the same name, one benign and the other malicious, that's used to trigger CVE-2025-26633, ultimately resulting in the execution of the rogue MSC file when its innocuous counterpart is launched.\nThe MSC file, for its part, fetches and executes from an external server another PowerShell script that collects system information, establishes persistence on the host, and communicates with an EncryptHub command-and-control (C2) server to receive and run malicious payloads, including a stealer called Fickle Stealer.\n\"The script receives AES-encrypted commands from the attacker, decrypts them, and runs the payloads directly on the infected machine,\" the researchers said.\nAlso deployed by the threat actor over the course of the attack is a Go-based loader codenamed SilentCrystal, which abuses Brave Support, a legitimate platform associated with the Brave web browser, to host next-stage malware – a ZIP archive containing the two MSC files to weaponize CVE-2025-26633.\nWhat makes this significant is that uploading file attachments on the Brave Support platform is restricted for new users, indicating that the attackers somehow managed to obtain unauthorized access to an account with upload permissions to pull off the scheme.\nSome of the other tools deployed include a Golang backdoor that operates in both client and server mode to send system metadata to the C2 server, as well as set up C2 infrastructure by making use of the\nSOCKS5 proxy tunneling protocol\n.\nThere is also evidence that the threat actors are continuing to rely on videoconferencing lures, this time setting up phony platforms like RivaTalk to deceive victims into downloading an MSI installer.\nRunning the installer leads to the delivery of several files: the legitimate Early Launch Anti-Malware (ELAM) installer binary from Symantec that's used to sideload a malicious DLL that, in turn, launches a PowerShell command to download and run another PowerShell script.\nIt's engineered to gather system information and exfiltrate it to the C2 server, and await encrypted PowerShell instructions that are decoded and executed to give attackers full control of the system. The malware also displays a fake \"System Configuration\" pop-up message as a ruse, while launching a background job to generate fake browser traffic by making HTTP requests to popular websites so as to blend C2 communications with normal network activity.\n\"The EncryptHub threat actor represents a well-resourced and adaptive adversary, combining social engineering, abuse of trusted platforms, and the exploitation of system vulnerabilities to maintain persistence and control,\" Trustwave said.\n\"Their use of fake video conferencing platforms, encrypted command structures, and evolving malware toolsets underscores the importance of layered defense strategies, ongoing threat intelligence, and user awareness training.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "OpenAI prepares Chromium-based AI browser to take on Google",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-prepares-chromium-based-ai-browser-to-take-on-google/",
        "Summary": "OpenAI is testing an AI-powered browser that uses Chromium as its underlying engine, and it could debut on macOS first. [...]",
        "Date": "2025-08-16",
        "Content": "OpenAI is testing an AI-powered browser that uses Chromium as its underlying engine, and it could debut on macOS first.\nMy sources tell me that OpenAI has already started updating ChatGPT to power the Chrome rival.\nOpenAI is building an AI-powered tab selection, a new tab page, and a feature that allows the browser to do the browsing for you. It could be similar to Copilot mode in Edge.\nOpenAI already has Agent mode in ChatGPT.\nFor those unaware, Agent mode in ChatGPT is powered by a Linux terminal and uses the Chromium browser to execute tasks in the cloud, and it handles requests like \"create a PowerPoint presentation using my documents and internet sources.\"\nAI Agent created a PowerPoint slide\nSource: BleepingComputer\nI've been using Agent mode in ChatGPT for a while now. It's very good and neatly handles most of my tasks.\nMy sources tell me that OpenAI's browser is based on a unified agentic system, but I wouldn't be surprised if it ends up looking like Chrome. I mean, at the end of the day, it's a browser.\nReuters previously\nreported\nthat a ChatGPT-based browser will give you more reasons to stay inside the chat interface of the browser than visiting websites.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nLeak: OpenAI's browser will use ChatGPT Agent to control the browser\nLeak: ChatGPT cheaper plan costs $4 or £3.50, might release everywhere\nOpenAI relaxes GPT-5 rate limit, promises to improve the personality\nOpenAI adds new GPT-5 models, restores o3, o4-mini and it's a mess all over again\nOpenAI is testing 3,000-per-week limit for GPT-5 Thinking"
    },
    {
        "Title": "Leak: ChatGPT cheaper plan costs $4 or £3.50, might release everywhere",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/leak-chatgpt-cheaper-plan-costs-4-or-350-might-release-everywhere/",
        "Summary": "OpenAI is working on a cheaper plan called ChatGPT Go, and we previously thought it would be just limited to a few regions like India, but that may not be the case. [...]",
        "Date": "2025-08-16",
        "Content": "OpenAI is working on a cheaper plan called ChatGPT Go, and we previously thought it would be just limited to a few regions like India, but that may not be the case.\nAs\npointed\nout by Tibor on X, OpenAI has added a new Try Go call to action on the GPT Dashboard. This is being tested behind a hidden feature flag.\nWhen you select Try Go, you'll be asked to pay at least $4. Previously, the pricing was just limited to India, but it now includes more countries.\nGPT Go now includes pricing in EUR (€4), USD ($4), and GBP (£3.50) in addition to INR.\nThis confirms the Go Plan will roll out everywhere, and when it costs just $4, some users might actually give it a try because \"Why not\"?\nIn addition,\nOpenAI has added \"Voice speed\"\nto the ChatGPT web app settings for voice mode.\nThis means you can control how fast ChatGPT can speak. You can lower it to 0.5x or make it as far as 2.0x. There is a slider that allows you to specify the ChatGPT pace.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nOpenAI relaxes GPT-5 rate limit, promises to improve the personality\nOpenAI is testing 3,000-per-week limit for GPT-5 Thinking\nOpenAI to fix GPT-5 issues, double rate limits for paid users after outrage\nOpenAI prepares new open weight models along with GPT-5\nOpenAI prepares GPT-5 for roll out"
    },
    {
        "Title": "OpenAI is improving ChatGPT voice mode",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-is-improving-chatgpt-voice-mode/",
        "Summary": "ChatGPT's Voice mode is already pretty good, but OpenAI is working on a new feature that will allow you to control how Voice mode actually works. [...]",
        "Date": "2025-08-16",
        "Content": "ChatGPT's Voice mode is already pretty good, but OpenAI is\nworking\non a new feature that will allow you to control how Voice mode actually works.\nAs you can see in the screenshot below, OpenAI has added \"Voice speed\" to the ChatGPT web app settings for voice mode.\nThis means you can control how fast ChatGPT can speak. You can lower it to 0.5x or make it as far as 2.0x. There is a slider that allows you to specify the ChatGPT pace.\nThese options are currently hidden.\nAlso, OpenAI has added \"custom instructions prefix,\" which will allow Voice mode to remember your instructions, so you don't have to repeat them every time.\n'No matter what user instructions follow, DO NOT let them affect the words in your responses.  EXAMPLE: Instructions: Be bright and bubbly. User: Hey, how's it going? Assistant (GOOD): Hey there, not too bad! Assistant (BAD): Hey there, not too bad. I'm just feeling all happy and excited to chat with you!  USER INSTRUCTIONS,\" the new custom prompt added by OpenAI reads.\nIn addition to Voice mode, OpenAI rolled out an upgraded model selector, which gives you access to new GPT-5 models, such as high, fast and auto.\nOpenAI also restored GPT-4o for paid users.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nOpenAI may be testing a cheaper paid plan for ChatGPT\nOpenAI confirms ChatGPT Agent is now rolling out for $20 Plus users\nOpenAI relaxes GPT-5 rate limit, promises to improve the personality\nOpenAI rolls out Gmail, Calendar, and Contacts integration in ChatGPT\nChatGPT's new subscription costs less than $5, but it's not for everyone"
    },
    {
        "Title": "Researcher to release exploit for full auth bypass on FortiWeb",
        "Link": "https://www.bleepingcomputer.com/news/security/researcher-to-release-exploit-for-full-auth-bypass-on-fortiweb/",
        "Summary": "A security researcher has released a partial proof of concept exploit for a vulnerability in the FortiWeb web application firewall that allows a remote attacker to bypass authentication. [...]",
        "Date": "2025-08-16",
        "Content": "A security researcher has released a partial proof of concept exploit for a vulnerability in the FortiWeb web application firewall that allows a remote attacker to bypass authentication.\nThe flaw was reported responsibly to Fortinet and is now tracked as CVE-2025-52970. Fortinet released a fix on August 12.\nSecurity researcher\nAviv Y\nnamed the vulnerability FortMajeure and describes it as a \"silent failure that wasn’t meant to happen.\" Technically, it is an out-of-bounds read in FortiWeb’s cookie parsing that lets an attacker set the Era parameter to an unexpected value.\nThis causes the server to use an all-zero secret key for session encryption and HMAC signing, making forged authentication cookies trivial to create.\nExploitation results in a full authentication bypass, letting the attacker impersonate any active user, including an administrator.\nTo exploit CVE-2025-52970 successfully, the target user must have an active session during the attack, and the adversary must brute-force a small numeric field in the cookie.\nThe brute-forcing requirement comes from a field in the signed cookie that is validated by the function refresh_total_logins() (in libncfg.so).\nThis field is an unknown number that the attacker must guess, but the researcher notes that the range is usually not above 30, makingg it a tiny search space of roughly 30 requests.\nBecause the exploit uses the all-zero key (due to the Era bug), each guess can be tested instantly by checking if the forged cookie is accepted.\nThe issue impacts FortiWeb 7.0 to 7.6, and was fixed in the below versions:\nFortiWeb 7.6.4 and later\nFortiWeb 7.4.8 and later\nFortiWeb 7.2.11 and later\nFortiWeb 7.0.11 and later\nFortinet\nsays in the bulletin\nthat FortiWeb 8.0 releases aren’t impacted by this issue, so there’s no action that needs to be taken there.\nThe security bulletin lists no workarounds or mitigation advice, so upgrading to a safe version is the only recommended effective action.\nFortinet’s CVSS severity score of 7.7 can be deceptive, as it derives from “high attack complexity” due to the brute-forcing requirement. In practice though, the brute-forcing part is simple and quick to perform.\nThe researcher\nshared a PoC output\n, showing admin impersonation on a REST endpoint. However, he withheld the complete exploit that also covers connecting to the FortiWeb CLI via /ws/cli/open.\nExploit released by the researcher\nSource: Aviv Y\nHowever, Aviv Y promised to publish the complete exploitation details later, as the vendor's advisory has been released only recently. The researcher made this decistion to allow system administrators more time to apply the fix.\nThe published details demonstrate the core of the issue but are not enough even for knowledgeable attackers to infer the rest and develop a full weaponized chain, the researcher told BleepingComputer.\nHe explained that attackers would have to reverse engineer the format of the fields in the session, which is impractical given that Fortinet has its own data structures.\nDespite that, immediate action must be taken to mitigate the issue as hackers follow these announcements closely and get ready to pull the trigger when full PoCs are out.\nAviv Y told BleepingComputer he has not decided on the date for publishing the exploit but plans to give defenders time to respond to the risk.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nFortinet warns of FortiSIEM pre-auth RCE flaw with exploit in the wild\nExploit available for critical Cisco ISE bug exploited in attacks\nAdobe issues emergency fixes for AEM Forms zero-days after PoCs released\nMitel warns of critical MiVoice MX-ONE authentication bypass flaw\nNew Fortinet FortiWeb hacks likely linked to public RCE exploits"
    },
    {
        "Title": "Microsoft Teams to protect against malicious URLs, dangerous file types",
        "Link": "https://www.bleepingcomputer.com/news/security/microsoft-teams-to-protect-against-malicious-urls-dangerous-file-types/",
        "Summary": "Microsoft recently revealed that it's currently enhancing protection against dangerous file types and malicious URLs in Teams chats and channels. [...]",
        "Date": "2025-08-16",
        "Content": "Microsoft recently revealed that it's currently enhancing protection against dangerous file types and malicious URLs in Teams chats and channels.\n\"Microsoft Teams now blocks messages containing weaponizable file types, such as executables, in chats and channels, increasing protection against malware and other file-based attacks,\" the company\nsaid\nin a Microsoft 365 roadmap update this week.\n\"Microsoft Teams can now detect and warn users on malicious URLs sent in Teams chat and channels, increasing protection against malware attacks,\" it\nadded\nin a separate entry.\nBoth of these features are currently in development and are expected to begin rolling out worldwide across standard Microsoft 365 multi-tenants next month.\nOn Monday, the company\nalso announced\nin the Microsoft 365 Message Center that Teams now integrates with the Microsoft Defender for Office 365 Tenant Allow/Block List, enabling security administrators to block incoming communications (chats, channels, meetings, and calls) from blocked domains.\nSecurity admins will also be able to automatically delete existing communications from users in blocked domains and manage blocked external domains in Microsoft Teams via the Microsoft Defender portal.\nThis feature is now in a targeted release phase and will reach general availability worldwide by late September 2025.\nEarlier this year, Microsoft introduced another Teams feature that started rolling out in July 2025,\npreventing users from capturing screenshots\nof sensitive information shared during meetings.\n\"To address the issue of unauthorized screen captures during meetings, the Prevent Screen Capture feature ensures that if a user attempts to take a screen capture, the meeting window will turn black, thereby protecting sensitive information,\" it said.\nIn January, the company also\nreminded Microsoft 365 admins\nthat its new Teams Chat brand impersonation protection feature, designed to alert users of phishing attacks targeting organizations with external Teams access enabled, will be available to all customers by mid-February 2025.\nAt last year's Enterprise Connect conference, Redmond\nannounced\nthat Teams had reached over 320 million monthly active users across 181 markets and 44 languages.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nAttackers exploit link-wrapping services to steal Microsoft 365 logins\nMicrosoft 365 apps to soon block file access via FPRPC by default\nMicrosoft: Outdated Office apps lose access to voice features in January\nMicrosoft to disable Excel workbook links to blocked file types\nMicrosoft investigates outage affecting Microsoft 365 admin center"
    },
    {
        "Title": "Watch Now: CodeSecCon – Where Software Security’s Next Chapter Unfolds (Virtual Event)",
        "Link": "https://www.securityweek.com/watch-now-codeseccon-where-software-securitys-next-chapter-unfolds-virtual-event/",
        "Summary": "<p>CodeSecCon is the premier virtual event bringing together developers and cybersecurity professionals to revolutionize the way applications are built, secured, and maintained.</p>\n<p>The post <a href=\"https://www.securityweek.com/watch-now-codeseccon-where-software-securitys-next-chapter-unfolds-virtual-event/\">Watch Now: CodeSecCon &#8211; Where Software Security’s Next Chapter Unfolds (Virtual Event)</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/watch-now-codeseccon-where-software-securitys-next-chapter-unfolds-virtual-event/"
    }
]