[
    {
        "Title": "Cursor AI Code Editor Fixed Flaw Allowing Attackers to Run Commands via Prompt Injection",
        "Link": "https://thehackernews.com/2025/08/cursor-ai-code-editor-fixed-flaw.html",
        "Summary": "Cybersecurity researchers have disclosed a now-patched, high-severity security flaw in Cursor, a popular artificial intelligence (AI) code editor, that could result in remote code execution.\nThe vulnerability, tracked as CVE-2025-54135 (CVSS score: 8.6), has been addressed in version 1.3 released on July 29, 2025. It has been codenamed CurXecute by Aim Labs, which previously disclosed EchoLeak.",
        "Date": "2025-08-01",
        "Content": "Cybersecurity researchers have disclosed a now-patched, high-severity security flaw in Cursor, a popular artificial intelligence (AI) code editor, that could result in remote code execution.\nThe vulnerability, tracked as\nCVE-2025-54135\n(CVSS score: 8.6), has been addressed in\nversion 1.3\nreleased on July 29, 2025. It has been codenamed CurXecute by Aim Labs, which previously disclosed\nEchoLeak\n.\n\"Cursor runs with developer‑level privileges, and when paired with an MCP server that fetches untrusted external data, that data can redirect the agent's control flow and exploit those privileges,\" the Aim Labs Team\nsaid\nin a report shared with The Hacker News.\n\"By feeding poisoned data to the agent via MCP, an attacker can gain full remote code execution under the user privileges, and achieve any number of things, including opportunities for ransomware, data theft, AI manipulation and hallucinations, etc.\"\nIn other words, the remote code execution triggered by a single externally‑hosted prompt‑injection that silently rewrites the \"~/.cursor/mcp.json\" file and runs attacker‑controlled commands.\nThe vulnerability is similar to EchoLeak in that the tools, which are exposed by Model Control Protocol (MCP) servers for use by AI models and facilitate interaction with external systems, such as querying databases or invoking APIs, could fetch untrusted data that can poison the agent's expected behavior.\nSpecifically, Aim Security found that the\nmcp.json file\nused to configure custom MCP servers in Cursor can trigger the execution of any new entry (e.g., adding a Slack MCP server) without requiring any confirmation.\nThis\nauto-run mode\nis particularly dangerous because it can lead to the automatic execution of a malicious payload that's injected by the attacker via a Slack message. The attack sequence proceeds as follows -\nUser adds Slack MCP server via Cursor UI\nAttacker posts message in a public Slack channel with the command injection payload\nVictim opens a new chat and asks Cursor's agent to use the newly configured Slack MCP server to summarize their messages in a prompt: \"Use Slack tools to summarize my messages\"\nThe agent encounters a specially crafted message designed to inject malicious commands to its context\n\"The core cause of the flaw is that new entries to the global MCP JSON file are starting automatically,\" Aim Security said. \"Even if the edit is rejected, the code execution had already happened.\"\nThe entire attack is noteworthy for its simplicity. But it also highlights how AI-assisted tools can open up new attack surfaces when processing external content, in this case, any third-party MCP server.\n\"As AI agents keep bridging external, internal, and interactive worlds, security models must assume external context may affect the agent runtime - and monitor every hop,\" the company added.\nVersion 1.3 of Cursor also addresses another issue with auto-run mode that can easily circumvent the platform's denylist-based protections using methods like Base64-encoding, shell scripts, and enclosing shell commands within quotes (e.g., \"e\"cho bypass) to execute unsafe commands.\nFollowing responsible disclosure by the BackSlash Research Team, Cursor has taken the step of altogether deprecating the denylist feature for auto-run in favor of an allowlist.\n\"Don't expect the built-in security solutions provided by\nvibe coding platforms\nto be comprehensive or foolproof,\" researchers Mustafa Naamneh and Micah Gold\nsaid\n. \"The onus is on end-user organizations to ensure agentic systems are equipped with proper guardrails.\"\nThe disclosure comes as HiddenLayer also found that Cursor's ineffective denylist approach can be weaponized by embedding hidden malicious instructions with a GitHub README.md file, allowing an attacker to steal API keys, SSH credentials, and even run blocked system commands.\n\"When the victim viewed the project on GitHub, the prompt injection was not visible, and they asked Cursor to git clone the project and help them set it up, a common occurrence for an IDE-based agentic system,\" researchers Kasimir Schulz, Kenneth Yeung, and Tom Bonner\nnoted\n.\n\"However, after cloning the project and reviewing the readme to see the instructions to set up the project, the prompt injection took over the AI model and forced it to use the grep tool to find any keys in the user's workspace before exfiltrating the keys with curl.\"\nHiddenLayer said it also found additional weaknesses that could be abused to leak Cursor's system prompt by overriding the base URL provided for OpenAI API requests to a proxied model, as well as exfiltrate a user's private SSH keys by leveraging two benign tools, read_file and create_diagram, in what's called a tool combination attack.\nThis essentially involves inserting a prompt injection command within a GitHub README.md file that's parsed by Cursor when the victim user asks the code editor to summarize the file, resulting in the execution of the command.\nThe hidden instruction, for its part, uses the read_file tool to read private SSH keys belonging to the user and then utilizes the create_diagram tool to exfiltrate the keys to an attacker-controlled webhook.site URL. All the identified shortcomings have been remediated by Cursor in version 1.3.\nNews of various vulnerabilities in Cursor comes as Tracebit devised an attack targeting Google's\nGemini CLI\n, an open-source command-line tool fine-tuned for coding tasks, that exploited a default configuration of the tool to surreptitiously exfiltrate sensitive data to an attacker-controlled server using curl.\nLike observed in the case of Cursor, the attack requires the victim to (1) instruct Gemini CLI to interact with an attacker-created GitHub codebase containing a nefarious\nindirect prompt injection\nin the\nGEMINI.md context file\nand (2) add a benign command to an allowlist (e.g., grep).\n\"Prompt injection targeting these elements, together with significant validation and display issues within Gemini CLI could cause undetectable arbitrary code execution,\" Tracebit founder and CTO Sam Cox\nsaid\n.\nTo mitigate the risk posed by the attack, Gemini CLI users are advised to upgrade their installations to\nversion 0.1.14\nshipped on July 25, 2025.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Attackers Use Fake OAuth Apps with Tycoon Kit to Breach Microsoft 365 Accounts",
        "Link": "https://thehackernews.com/2025/08/attackers-use-fake-oauth-apps-with.html",
        "Summary": "Cybersecurity researchers have detailed a new cluster of activity where threat actors are impersonating enterprises with fake Microsoft OAuth applications to facilitate credential harvesting as part of account takeover attacks.\n\"The fake Microsoft 365 applications impersonate various companies, including RingCentral, SharePoint, Adobe, and Docusign,\" Proofpoint said in a Thursday report.\nThe",
        "Date": "2025-08-01",
        "Content": "Cybersecurity researchers have detailed a new cluster of activity where threat actors are impersonating enterprises with fake\nMicrosoft OAuth applications\nto facilitate credential harvesting as part of account takeover attacks.\n\"The fake Microsoft 365 applications impersonate various companies, including RingCentral, SharePoint, Adobe, and Docusign,\" Proofpoint\nsaid\nin a Thursday report.\nThe ongoing campaign, first detected in early 2025, is designed to use the OAuth applications as a gateway to obtain unauthorized access to users' Microsoft 365 accounts by means of\nphishing kits\nlike\nTycoon\nand ODx that are capable of conducting multi-factor authentication (MFA) phishing.\nThe enterprise security company said it observed the approach being used in email campaigns with more than 50 impersonated applications.\nThe attacks begin with phishing emails sent from compromised accounts and aim to trick recipients into clicking on URLs under the pretext of sharing requests for quotes (RFQ) or business contract agreements.\nClicking on these links directs the victim to a Microsoft OAuth page for an application named \"iLSMART\" that asks them to grant it permissions to view their basic profile and maintain continued access to the data that they have been granted access to.\nWhat makes this attack notable is the impersonation of ILSMart, a legitimate online marketplace for aviation, marine, and defense industries to buy and sell parts and repair services.\n\"The applications' permissions would provide limited use to an attacker, but it is used for setting up the next stage of the attack,\" Proofpoint said.\nRegardless of whether the target accepted or denied the permissions requested, they are first redirected to a CAPTCHA page and then to a phony Microsoft account authentication page once the verification is complete.\nThis fake Microsoft page makes use of adversary-in-the-middle (AitM) phishing techniques powered by the Tycoon Phishing-as-a-Service (PhaaS) platform to harvest the victim's credentials and MFA codes.\nAs recently as last month, Proofpoint said it detected another campaign impersonating Adobe in which the emails are sent via Twilio SendGrid, an email marketing platform, and are engineered with the same goal in mind: To gain user authorization or trigger a cancellation flow that redirects the victim to a phishing page.\nThe campaign represents just a drop in the bucket when compared to overall Tycoon-related activity, with the multiple clusters leveraging the toolkit to perform account takeover attacks. In 2025 alone, attempted account compromises affecting nearly 3,000 user accounts spanning more than 900 Microsoft 365 environments have been observed.\n\"Threat actors are creating increasingly innovative attack chains in an attempt to bypass detections and obtain access to organizations globally,\" the company said, adding it \"anticipates threat actors will increasingly target users' identity, with AiTM credential phishing becoming the criminal industry standard.\"\nAs of last month, Microsoft has\nannounced\nplans to update default settings to improve security by blocking legacy authentication protocols and requiring admin consent for third-party app access. The updates are expected to be completed by August 2025.\n\"This update will have a positive impact on the landscape overall and will hamstring threat actors that use this technique,\" Proofpoint pointed out.\nThe disclosure follows Microsoft's\ndecision\nto disable external workbook links to blocked file types by default between October 2025 and July 2026 in an attempt to enhance workbook security.\nThe findings also come as spear-phishing emails bearing purported payment receipts are used to deploy by means of an AutoIt-based injector a piece of .NET malware called\nVIP Keylogger\nthat can steal sensitive data from compromised hosts, Seqrite\nsaid\n.\nOver the course of several months, spam campaigns have been spotted concealing installation links to remote desktop software inside PDF files so as to bypass email and malware defenses. The campaign is believed to have been ongoing since November 2024, primarily targeting entities in France, Luxembourg, Belgium, and Germany.\n\"These PDFs are often disguised to look like invoices, contracts, or property listings to enhance credibility and lure victims into clicking the embedded link,\" WithSecure\nsaid\n. \"This design was intended to create the illusion of legitimate content that has been obscured, prompting the victim to install a program. In this case, the program was FleetDeck RMM.\"\nOther Remote Monitoring and Management (RMM) tools deployed as part of the activity cluster include Action1, OptiTune, Bluetrait, Syncro, SuperOps, Atera, and ScreenConnect.\n\"Although no post-infection payloads have been observed, the use of RMM tools strongly suggests their role as an initial access vector, potentially enabling further malicious activity,\" the Finnish company added. \"Ransomware operators in particular have favoured this approach.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "AI-Generated Malicious npm Package Drains Solana Funds from 1,500+ Before Takedown",
        "Link": "https://thehackernews.com/2025/08/ai-generated-malicious-npm-package.html",
        "Summary": "Cybersecurity researchers have flagged a malicious npm package that was generated using artificial intelligence (AI) and concealed a cryptocurrency wallet drainer.\nThe package, @kodane/patch-manager, claims to offer \"advanced license validation and registry optimization utilities for high-performance Node.js applications.\" It was uploaded to npm by a user named \"Kodane\" on July 28, 2025. The",
        "Date": "2025-08-01",
        "Content": "Cybersecurity researchers have flagged a malicious npm package that was generated using artificial intelligence (AI) and concealed a cryptocurrency wallet drainer.\nThe package, @kodane/patch-manager, claims to offer \"advanced license validation and registry optimization utilities for high-performance Node.js applications.\" It was uploaded to npm by a user named \"Kodane\" on July 28, 2025. The package is no longer available for download from the registry, but not before it attracted over 1,500 downloads.\nSoftware supply chain security company Safety, which\ndiscovered\nthe library, said the malicious features are advertised directly in the source code, calling it an \"enhanced stealth wallet drainer.\"\nSpecifically, the behavior is triggered as part of a postinstall script that drops its payload within hidden directories across Windows, Linux, and macOS systems, and then proceeds to connect to a command-and-control (C2) server at \"sweeper-monitor-production.up.railway[.]app.\"\n\"The script generates a unique machine ID code for the compromised host and shares that with the C2 server,\" Paul McCarty, head of research at Safety, said, noting that the C2 server lists two compromised machines.\nIn the npm ecosystem, postinstall scripts are often overlooked attack vectors—they run automatically after a package is installed, meaning users can be compromised without ever executing the package manually. This creates a dangerous blind spot, especially in CI/CD environments where dependencies are updated routinely without direct human review.\nThe malware is designed to scan the system for the presence of a wallet file, and if found, it proceeds to drain all funds from the wallet to a hard-coded wallet address on the Solana blockchain.\nWhile this is not the first time\ncryptocurrency drainers\nhave been\nidentified\nin open-source repositories, what makes @kodane/patch-manager stand out are clues that suggest the use of Anthropic's Claude AI chatbot to generate it.\nThis includes the presence of emojis, extensive JavaScript console logging messages, well-written and descriptive comments, the README.md markdown file written in a style that's consistent with Claude-generated markdown files, and Claude's pattern of calling code changes as \"Enhanced.\"\nThe discovery of the npm package highlights \"how threat actors are leveraging AI to create more convincing and dangerous malware,\" McCarty said.\nThe incident also underlines growing concerns in software supply chain security, where AI-generated packages may bypass conventional defenses by appearing clean or even helpful. This raises the stakes for package maintainers and security teams, who now need to monitor not just known malware, but increasingly polished, AI-assisted threats that exploit trusted ecosystems like npm.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "You Are What You Eat: Why Your AI Security Tools Are Only as Strong as the Data You Feed Them",
        "Link": "https://thehackernews.com/2025/08/you-are-what-you-eat-why-your-ai.html",
        "Summary": "Just as triathletes know that peak performance requires more than expensive gear, cybersecurity teams are discovering that AI success depends less on the tools they deploy and more on the data that powers them\nThe junk food problem in cybersecurity\nImagine a triathlete who spares no expense on equipment&mdash;carbon fiber bikes, hydrodynamic wetsuits, precision GPS watches&mdash;but fuels their",
        "Date": "2025-08-01",
        "Content": "Just as triathletes know that peak performance requires more than expensive gear, cybersecurity teams are discovering that AI success depends less on the tools they deploy and more on the data that powers them\nThe junk food problem in cybersecurity\nImagine a triathlete who spares no expense on equipment—carbon fiber bikes, hydrodynamic wetsuits, precision GPS watches—but fuels their training with processed snacks and energy drinks. Despite the premium gear, their performance will suffer because their foundation is fundamentally flawed. Triathletes see nutrition as the fourth discipline of their training that can have a significant impact on performance and can even determine race outcomes.\nToday's security operations centers (SOCs) face a similar issue. They're investing heavily in AI-powered detection systems, automated response platforms, and machine learning analytics—the equivalent of professional-grade triathlon equipment. But they're powering these sophisticated tools with legacy data feeds that lack the richness and context modern AI models need to perform effectively.\nJust as a triathlete needs to master swimming, cycling, and running in seamless coordination, SOC teams must excel at detection, investigation, and response. However, without their own “fourth discipline,” SOC analysts will be working with sparse endpoint logs, fragmented alert streams, and data silos that don't communicate, it's like trying to complete a triathlon fueled only by a bag of chips and a beer—no matter how good your training or equipment, you're not crossing the finish line first. While you may load up on sugar and calories on race day to ensure you have the energy to make it through, that isn’t a sustainable, long-term regimen that will optimize your body for the best performance.\nThe hidden cost of legacy data diets\n\"We’re living through the first wave of an AI revolution, and so far the spotlight has focused on models and applications,” said Greg Bell, Corelight chief strategy officer. “That makes sense, because the impacts for cyber defense are going to be huge. But I think there’s starting to be a dawning realization that ML and GenAI tools are gated by the quality of data they consume.”\nThis disconnect between advanced AI capabilities and outdated data infrastructure creates what security professionals are now calling \"data debt\"—the accumulated cost of building AI systems on foundations that weren't designed for machine learning consumption.\nTraditional security data often resembles a triathlete's training diary filled with incomplete entries: \"Ran today. Felt okay.\" It provides basic information but lacks the granular metrics, environmental context, and performance correlations that enable genuine improvement. Legacy data feeds typically include:\nSparse endpoint logs\nthat capture events but miss the behavioral context\nAlert-only feeds\nthat tell you something happened but not the full story\nSiloed data sources\nthat can't correlate across systems or time periods\nReactive indicators\nthat only activate after damage is already done without historical perspectives\nUnstructured formats\nthat require extensive processing before AI models can analyze them\nThe adversary is already performance-enhanced\nWhile defenders struggle with data that's nutritionally deficient for AI consumption, attackers have optimized their approach with the discipline of elite athletes. They're leveraging AI to create adaptive attack strategies that are faster, cheaper, and more precisely targeted than ever before by:\nAutomating reconnaissance\nand exploit development to accelerate attack speed\nReducing the cost per attack\n, increasing potential threat volume aster\nPersonalizing approaches\nbased on AI-gathered intelligence to deliver more targeted attacks\nGenerating quicker iteration\nand improvement of tactics based on what is working\nMeanwhile, many SOCs are still trying to defend against these AI-enhanced threats using data equivalent to a 1990s training regimen—with just basic heart rate information—when the competition is using comprehensive performance analytics, environmental sensors, and predictive modeling.\nThis creates an escalating performance gap. As attackers become more sophisticated in their use of AI, the quality of defensive data becomes increasingly critical. Poor data doesn't just slow down detection—it actively undermines the effectiveness of AI security tools, creating blind spots that sophisticated adversaries can exploit.\nAI-ready data: the performance enhancement SOCs need\nThe solution lies in fundamentally reimagining security data architecture around what AI models actually need to perform effectively. This means transitioning from legacy data feeds to what could be called \"AI-ready\" data—information that's structured, enriched, and optimized specifically for AI analysis and automation.\nAI-ready data shares characteristics with the comprehensive performance metrics that elite triathletes use to optimize their training. Just as these athletes track everything from power output and cadence to environmental conditions and recovery markers, AI-ready security data captures not just what happened, but the full context surrounding each event.\nThis includes network telemetry that provides visibility before encryption obscures the evidence, comprehensive metadata that reveals behavioral patterns, and structured formats that AI models can immediately process without extensive preprocessing. It's data that's been specifically designed to feed the three critical components of AI-powered security operations.\nAI-driven threat detection\nbecomes dramatically more effective when powered by forensic-grade network evidence\nthat includes full context and real-time collection across on-premise, hybrid, and multi-cloud environments. This enables AI models to identify subtle patterns and anomalies that would be invisible in traditional log formats.\nAI workflows\ntransform the analyst experience by providing expert-authored processes enhanced with AI-driven payload analysis, historical context, and session-level summaries. This is equivalent to having a world-class coach who can instantly analyze performance data and provide specific, actionable guidance for improvement.\nAI-enabled ecosystem integrations\nensure that AI-ready data flows seamlessly into existing SOC tools—SIEMs, SOAR platforms, XDR systems, and data lakes—without requiring custom integrations or format conversions. It's automatically compatible with nearly every tool in an analyst’s arsenal.\nThe compound effect of superior data\nThe impact of transitioning to AI-ready data creates a compound effect across security operations. Teams can correlate unusual access patterns and privilege escalations in ephemeral cloud environments, critical for addressing cloud-native threats that traditional tools miss. They gain expanded coverage for novel, evasive, and zero-day threats while enabling faster development of new detections.\nPerhaps most importantly, analysts can quickly understand incident timelines without parsing raw logs, get plain-language summaries of suspicious behaviors across hosts and sessions, and focus their attention on priority alerts with clear justifications for why each incident matters.\n\"High quality, context-rich data is the ‘clean fuel’ AI needs to achieve its full potential,” added Bell. “Models starved of quality data will inevitably disappoint. As AI augmentation becomes the standard for both attack and defense, organizations that succeed will be the ones that understand a fundamental truth: in the world of AI security, you are what you eat.”\nThe training decision every SOC must make\nAs AI becomes standard for both attack and defense, AI-driven security tools can’t reach their potential without the right data. Organizations that continue feeding these systems with legacy data may find their significant investment in next-generation technology underperforming against increasingly advanced threats. Those that recognize this isn't about replacing existing security investments — it's about\nproviding them with the high-quality fuel\nto deliver on their promise — will be positioned to unlock AI's competitive advantage.\nIn the escalating battle against AI-enhanced threats, peak performance truly begins with what you feed your engine.\nFor more information about industry-standard security data models that all the major LLMs have already been trained on, visit\nwww.corelight.com\n. Corelight delivers forensic-grade telemetry to power SOC workflows, drive detection, and enable the broader SOC ecosystem.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Storm-2603 Deploys DNS-Controlled Backdoor in Warlock and LockBit Ransomware Attacks",
        "Link": "https://thehackernews.com/2025/08/storm-2603-exploits-sharepoint-flaws-to.html",
        "Summary": "The threat actor linked to the exploitation of the recently disclosed security flaws in Microsoft SharePoint Server is using a bespoke command-and-control (C2) framework called AK47 C2 (also spelled ak47c2) in its operations.\nThe framework includes at least two different types of clients, HTTP-based and Domain Name System (DNS)-based, which have been dubbed AK47HTTP and AK47DNS, respectively, by",
        "Date": "2025-08-01",
        "Content": "The threat actor linked to the exploitation of the recently disclosed security flaws in Microsoft SharePoint Server is using a bespoke command-and-control (C2) framework called\nAK47 C2\n(also spelled ak47c2) in its operations.\nThe framework includes at least two different types of clients, HTTP-based and Domain Name System (\nDNS\n)-based, which have been dubbed AK47HTTP and AK47DNS, respectively, by Check Point Research.\nThe activity has been attributed to\nStorm-2603\n, which, according to Microsoft, is a suspected China-based threat actor that has leveraged the\nSharePoint flaws\n– CVE-2025-49706 and CVE-2025-49704 (aka ToolShell) – to deploy Warlock (aka X2anylock) ransomware.\nA previously unreported threat cluster, evidence gathered following an analysis of VirusTotal artifacts shows that the group may have been active since at least March 2025, deploying ransomware families like\nLockBit Black\nand Warlock together – something that's not observed commonly among established e-crime groups.\n\"Based on VirusTotal data, Storm-2603 likely targeted some organizations in Latin America throughout the first half of 2025, in parallel to attacking organizations in APAC,\" Check Point\nsaid\n.\nThe attack tools used by the threat actor includes legitimate open-source and Windows utilities like masscan, WinPcap, SharpHostInfo, nxc, and PsExec, as well as a custom backdoor (\"dnsclient.exe\") that uses DNS for command-and-control with the domain \"update.updatemicfosoft[.]com.\"\nThe backdoor is part of the AK47 C2 framework, alongside AK47HTTP, that's employed to gather host information and parse DNS or HTTP responses from the server and execute them on the infected machine via \"cmd.exe.\" The initial access pathway used in these attacks are unknown.\nA point worth mentioning here is that the aforementioned infrastructure was also flagged by Microsoft as used by the threat actor as a C2 server to establish communication with the \"spinstall0.aspx\" web shell. In addition to the open-source tools, Storm-2603 has been found to distribute three additional payloads -\n7z.exe and 7z.dll, the legitimate 7-Zip binary that's used to sideload a malicious DLL, which delivers Warlock\nbbb.msi, an installer that uses clink_x86.exe to sideload \"clink_dll_x86.dll,\" which leads to LockBit Black deployment\nCheck Point said it also discovered another MSI artifact uploaded to VirusTotal in April 2025 that's used to launch Warlock and LockBit ransomware, and also drop a custom antivirus killer executable (\"VMToolsEng.exe\") that employs the bring your own vulnerable driver (\nBYOVD\n) technique to\nterminate security software\nusing ServiceMouse.sys, a third-party driver provided by Chinese security vendor Antiy Labs.\nUltimately, Storm-2603's exact motivations remain unclear at this stage, making it harder to determine if it's espionage-focused or driven by profit motives. However, it bears noting that there have been\ninstances\nwhere nation-state actors from China, Iran, and North Korea have deployed ransomware on the side.\n\"Storm-2603 leverages BYOVD techniques to disable endpoint defenses and DLL hijacking to deploy multiple ransomware families – blurring the lines between APT and criminal ransomware operations,\" Check Point said. \"The group also uses open-source tools like PsExec and masscan, signaling a hybrid approach seen increasingly in sophisticated attacks.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "OpenAI may be testing a cheaper paid plan for ChatGPT",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-may-be-testing-a-cheaper-paid-plan-for-chatgpt/",
        "Summary": "OpenAI is reportedly working on a new plan called 'Go,' which would be cheaper than the existing $20 Plus subscription. [...]",
        "Date": "2025-08-01",
        "Content": "OpenAI is\nreportedly\nworking on a new plan called 'Go,' which would be cheaper than the existing $20 Plus subscription.\nLike every other AI chatbot, ChatGPT has two plans.\nOne is Plus, which gives access to new models and a few features for $20, and the second is the Pro plan.\nThe Pro plan costs $200 and provides nearly unlimited access to AI models. It also includes access to new features.\nBut what if you have a limited use case for ChatGPT and don't need access to advanced features like Agent? You might prefer a cheaper plan, which doesn't exist right now.\nOpenAI is preparing ChatGPT Go plan to target such use cases.\nChatGPT Go might be priced aggressively and may not cost more than $15.\nI wouldn't be surprised if it's priced around $10 and offers only increased access to AI models, such as o3.\nWe'll likely learn more about it next week when OpenAI is expected to unveil GPT-5.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nOpenAI confirms ChatGPT Agent is now rolling out for $20 Plus users\nChatGPT's AI coder Codex now lets you choose the best solution\nOpenAI prepares GPT-5 for roll out\nOpenAI could rival Google Shopping with ChatGPT Shop\nChatGPT is rolling out 'personality' toggles to become your assistant"
    },
    {
        "Title": "SonicWall firewall devices hit in surge of Akira ransomware attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/surge-of-akira-ransomware-attacks-hits-sonicwall-firewall-devices/",
        "Summary": "SonicWall firewall devices have been increasingly targeted since late July in a surge of Akira ransomware attacks, potentially exploiting a previously unknown security vulnerability, according to cybersecurity company Arctic Wolf. [...]",
        "Date": "2025-08-01",
        "Content": "SonicWall firewall devices have been increasingly targeted since late July in a surge of Akira ransomware attacks, potentially exploiting a previously unknown security vulnerability, according to cybersecurity company Arctic Wolf.\nAkira\nemerged\nin March 2023 and quickly claimed many victims worldwide across various industries. Over the last two years, Akira has added over 300 organizations to its dark web leak portal and claimed responsibility for multiple high-profile victims, including Nissan (\nOceania\nand\nAustralia\n),\nHitachi\n, and\nStanford University\n.\nThe FBI says the Akira ransomware gang has collected over $42 million in ransom payments as of April 2024 from\nmore than 250 victims\n.\nAs Arctic Wolf Labs observed, multiple ransomware intrusions involved unauthorized access through SonicWall SSL VPN connections, starting on July 15. However, while a zero-day vulnerability being exploited in these attacks is very likely, Arctic Wolf has not ruled out credential-based attacks.\n\"The initial access methods have not yet been confirmed in this campaign,\" the Arctic Wolf Labs researchers cautioned. \"While the existence of a zero-day vulnerability is highly plausible, credential access through brute force, dictionary attacks, and credential stuffing have not yet been definitively ruled out in all cases.\"\nThroughout this surge in ransomware activity, attackers quickly transitioned from initial network access via SSL VPN accounts to data encryption, a pattern consistent with similar attacks detected since at least October 2024, indicating a sustained campaign targeting SonicWall devices.\nAdditionally, Arctic Wolf noted the ransomware operators were observed using virtual private server hosting for VPN authentication, while legitimate VPN connections typically originate from broadband internet service providers.\nThe security researchers are still investigating the attack methods used in this campaign and will provide additional information to defenders as soon as it becomes available.\nDue to the strong possibility of a SonicWall zero-day vulnerability being exploited in the wild, Arctic Wolf advised administrators to temporarily disable SonicWall SSL VPN services. Additionally, they should implement further security measures, such as enhanced logging, endpoint monitoring, and blocking VPN authentication from hosting-related network providers, until patches become available.\nAdmins advised to secure SMA 100 appliances\nArctic Wolf's report comes one week after\nSonicWall warned customers\nto patch their SMA 100 appliances against a critical security vulnerability (CVE-2025-40599) that may be exploited to gain remote code execution on unpatched devices.\nAs the company explained, while attackers would need admin privileges for CVE-2025-40599 exploitation, and there is no evidence that this vulnerability is being actively exploited, it still urged administrators to secure their SMA 100 appliances, as they're already being targeted in\nattacks using compromised credentials\nto deploy new OVERSTEP rootkit malware according to Google Threat Intelligence Group (GTIG) researchers.\nSonicWall also 'strongly' advised customers with SMA 100 virtual or physical appliances to check for indicators of compromise (IoCs) from GTIG's report, suggesting that admins should review logs for unauthorized access and any suspicious activity and contact SonicWall Support immediately if they find any evidence of compromise.\nA SonicWall spokesperson was not immediately available for comment when contacted by BleepingComputer earlier today.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nCISA and FBI warn of escalating Interlock ransomware attacks\nSonicWall urges admins to patch critical RCE flaw in SMA 100 devices\nInside a Real Clickfix Attack: How This Social Engineering Hack Unfolds\nHackers target Python devs in phishing attacks using fake PyPI site\nSafePay ransomware threatens to leak 3.5TB of Ingram Micro data"
    },
    {
        "Title": "Pi-hole discloses data breach triggered by WordPress plugin flaw",
        "Link": "https://www.bleepingcomputer.com/news/security/pi-hole-discloses-data-breach-via-givewp-wordpress-plugin-flaw/",
        "Summary": "Pi-hole, a popular network-level ad-blocker, has disclosed that donor names and email addresses were exposed through a security vulnerability in the GiveWP WordPress donation plugin. [...]",
        "Date": "2025-08-01",
        "Content": "Pi-hole, a popular network-level ad-blocker, has disclosed that donor names and email addresses were exposed through a security vulnerability in the GiveWP WordPress donation plugin.\nPi-hole acts as a DNS sinkhole, filtering out unwanted content before it reaches the users' devices. While initially designed to run on Raspberry Pi single-board computers, it now supports various Linux systems on dedicated hardware or virtual machines.\nThe organization stated that they first learned of the incident on Monday, July 28, after donors\nbegan reporting\nthat they were receiving suspicious emails at\naddresses used exclusively for donations\n.\nAs explained in a\nFriday post-mortem\n, the breach affected users who donated through the Pi-hole website's donation form to support development, exposing personal information that was visible to anyone who viewed the webpage's source code due to a GiveWP security flaw.\nThe vulnerability\nstemmed from GiveWP, a WordPress plugin used to process donations on the Pi-hole website. The plugin inadvertently made donor information publicly accessible without requiring authentication or special access privileges.\nWhile Pi-hole didn't disclose the number of affected customers, the 'Have I Been Pwned' data breach notification service added the Pi-hole breach, saying that it impacted almost 30,000 donors, with 73% of the exposed records already in its database.\nNo financial information exposed\nPi-hole added that no donor financial data was compromised, as credit card information and other payment details are handled directly by Stripe and PayPal. It also clarified that the Pi-hole software product itself was not affected in any way.\n\"We make it clear in the donation form that we don't even require a valid name or email address, it's purely for users to see and manage their donations,\"\nPi-hole said\n. \"It is also important to note that Pi-hole the product is categorically not the subject of this breach. There is no action needed from users with a Pi-hole installed on their network.\"\nAlthough GiveWP released a patch within hours of the vulnerability being reported on GitHub, Pi-hole criticized the plugin developer's response, citing a 17.5-hour delay before notifying users and what it described as insufficient acknowledgment of the security flaw's potential impact on donor names and email addresses.\nPi-hole apologized to affected donors and acknowledged potential reputation damage stemming from this security incident, saying that while the vulnerability was unforeseeable, they accept accountability for the resulting data breach.\n\"The names and email addresses of anyone that had ever donated via our donation page was there for the entire world to see (provided they were savvy enough to right click->View page source). Within a couple of hours of this report, they had patched the bad code and released 4.6.1,\" Pi-hole added in a blog post analyzing the incident.\n\"We take full responsibility for the software we deploy. We placed our trust in a widely-used plugin, and that trust was broken.\"\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nShinyHunters behind Salesforce data theft attacks at Qantas, Allianz Life, and LVMH\nHackers actively exploit critical RCE in WordPress Alone theme\nRussian airline Aeroflot grounds dozens of flights after cyberattack\nTea app leak worsens with second database exposing user chats\nAllianz Life confirms data breach impacts majority of 1.4 million customers"
    },
    {
        "Title": "AI-powered Cursor IDE vulnerable to prompt-injection attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/ai-powered-cursor-ide-vulnerable-to-prompt-injection-attacks/",
        "Summary": "A vulnerability that researchers call CurXecute is present in almost all versions of the AI-powered code editor Cursor, and can be exploited to execute remote code with developer privileges. [...]",
        "Date": "2025-08-01",
        "Content": "A vulnerability that researchers call CurXecute is present in almost all versions of the AI-powered code editor Cursor, and can be exploited to execute remote code with developer privileges.\nThe security issue is now identified as CVE-2025-54135 and can be leveraged by feeding the AI agent a malicious prompt to trigger attacker-control commands.\nThe Cursor integrated development environment (IDE) relies on AI agents to help developers code faster and more efficiently, allowing them to connect with external resources and systems using the Model Context Protocol (MCP).\nAccording to the researchers, a hacker successfully exploiting the CurXecute vulnerability could open the door to ransomware and data theft incidents.\nPrompt-injection attack\nCurXecute is similar to the\nEchoLeak vulnerability in Microsoft 365 CoPilot\nthat could be used to steal sensitive data without any user interaction.\nAfter discovering and understanding EchoLeak, the researchers at Aim Security, an AI cybersecurity company, learned that even local AI agent could be influenced by an external factor for malicious actions.\nCursor IDE has support for the MCP open-standard framework, which extends an agent’s capabilities and context by allowing it to connect to external data sources and tools.\n“MCP turns a local agent into a Swiss‑army knife by letting it spin up arbitrary servers - Slack, GitHub, databases - and call their\ntools\nfrom natural language” -\nAim Security\nHowever, the researchers warn that this can compromise the agent as it is exposed to external, untrusted data that can affect its control flow.\nA hacker could leverage this to hijack the agents session and privileges to act on behalf of the user.\nBy using an externally-hosted prompt injection, an attacker could rewrite the\n~/.cursor/mcp.json\nfile in the project directory to enable remote execution of arbitrary commands.\nThe researchers explain that Cursor does not require confirmation for executing new entries to the\n~/.cursor/mcp.json\nfile and that suggested edits to are live and trigger the execution of the command even if the user rejects them.\nIn a report shared with BleepingComputer, Aim Security says that adding to Cursor a standard MCP server, such as Slack, could expose the agent to untrusted data.\nAn attacker could post to a public channel a malicious prompt with an injection payload for the\nmcp.json\nconfiguration file.\nWhen the victim opens the new chat and instructs the agent to summarize the messages, the payload, which could be a shell, lands on the disk immediately without the user’s approval.\n“The attack surface is\nany\nthird‑party MCP server that processes external content: issue trackers, customer support inboxes, even search engines. A single poisoned document can morph an AI agent into a local shell” -\nAim Security\nThe researchers created a video to demonstrate how CurXecute can be leveraged in attacks:\nAim Security researchers say that a CurXecute attack may lead to ransomware and data theft incidents, or even AI manipulation through hallucination that can ruin the project, or enable\nslopsquatting attacks\n.\nThe researchers reported CurXecute privately to Cursor on July 7 and the next day the vendor merged a patch into the main branch.\nOn July 29, Cursor version 1.3 was released with multiple improvements and a fix for CurXecute. Cursor also published a\nsecurity advisory\nfor CVE-2025-54135, which received a medium-severity score of 8.6.\nUsers are recommended to download and install the latest version of Cursor to avoid known security risks.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nFlaw in Gemini CLI AI coding assistant allowed stealthy code execution\nOpenAI prepares GPT-5 for roll out\nOpenAI could rival Google Shopping with ChatGPT Shop\nOpenAI confirms ChatGPT Agent is now rolling out for $20 Plus users\nProton launches privacy-respecting encrypted AI assistant Lumo"
    },
    {
        "Title": "Pwn2Own hacking contest pays $1 million for WhatsApp exploit",
        "Link": "https://www.bleepingcomputer.com/news/security/pwn2own-hacking-contest-pays-1-million-for-whatsapp-exploit/",
        "Summary": "The Zero Day Initiative is offering a $1 million reward to security researchers who will demonstrate a zero-click WhatsApp exploit at its upcoming Pwn2Own Ireland 2025 hacking contest. [...]",
        "Date": "2025-08-01",
        "Content": "The Zero Day Initiative is offering a $1 million reward to security researchers who will demonstrate a zero-click WhatsApp exploit at its upcoming Pwn2Own Ireland 2025 hacking contest.\nThe record bounty targets zero-click security flaws that allow code execution without user interaction on the messaging platform used by more than three billion people worldwide.\nMeta, alongside Synology and QNAP, is co-sponsoring the Pwn2Own Ireland 2025 competition, which will take place from October 21 to October 24 in Cork, Ireland.\n\"As you might have guessed from the title, we're excited to announce that Meta is co-sponsoring this year's event, and they are hoping to see some great WhatsApp exploits. They are so excited for it, we're putting up $1,000,000 for a 0-click WhatsApp bug that leads to code execution,\" the Zero Day Initiative\nannounced\nThursday.\n\"We also will have lesser cash awards for other WhatsApp exploits, so be sure to check out the Messaging section for full details. We introduced this category last year, but no one attempted it. Perhaps a number with two commas will provide the needed motivation.\"\nWhatsApp Pwn2Own awards (ZDI)\n​The contest features eight categories targeting mobile phones, messaging apps, home networking equipment, smart home devices, printers, network storage systems, surveillance equipment, and wearable technology, including Meta's Ray-Ban Smart Glasses and Quest 3/3S headsets, as well as Samsung Galaxy S25, Google Pixel 9, and Apple iPhone 16 flagship smartphones.\nThe ZDI has also expanded the attack vectors for the mobile category to include USB port exploitation for mobile devices, requiring contestants to compromise locked phones through physical connections. Traditional wireless protocols, such as Wi-Fi, Bluetooth, and near-field communication, remain valid attack methods.\nRegistration closes on October 16 at 5 p.m. Irish Standard Time, with the contest order determined by a random drawing. The Zero Day Initiative operates the event to identify vulnerabilities before malicious actors can exploit them, coordinating responsible disclosure with affected vendors.\nAfter the flaws are exploited during Pwn2Own events, vendors have 90 days to release security updates before Trend Micro's Zero Day Initiative publicly discloses them.\nLast year's Pwn2Own Ireland event\nawarded $1,078,750\nfor over 70 unique zero-day vulnerabilities, with Viettel Cyber Security collecting $205,000 for flaws demonstrated in QNAP NAS, Sonos speakers, and Lexmark printers.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nVMware fixes four ESXi zero-day bugs exploited at Pwn2Own Berlin\nU.S. Army soldier pleads guilty to extorting 10 tech, telecom firms\nMan pleads guilty to hacking networks to pitch security services\nInstagram ads mimicking BMO, EQ Bank are finance scams\nKali Linux 2025.2 released with 13 new tools, car hacking updates"
    },
    {
        "Title": "Dark Reading News Desk Turns 10, Back at Black Hat USA for 2025",
        "Link": "https://www.darkreading.com/cybersecurity-operations/dark-reading-news-desk-black-hat-usa-2025",
        "Summary": "Dark Reading's 2025 News Desk marks a decade of Black Hat USA memories. We're making our return with a slate of interviews that help you stay up on the latest research from Black Hat — no trip to Las Vegas required.",
        "Date": "2025-08-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/dark-reading-news-desk-black-hat-usa-2025"
    },
    {
        "Title": "LLMs' AI-Generated Code Remains Wildly Insecure",
        "Link": "https://www.darkreading.com/application-security/llms-ai-generated-code-wildly-insecure",
        "Summary": "Security debt ahoy: Only about half of the code that the latest large language models (LLMs) create is cybersecure, and more and more of it is being created all the time.",
        "Date": "2025-08-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/llms-ai-generated-code-wildly-insecure"
    },
    {
        "Title": "Male-Dominated Cyber Industry Still Holds Space for Women With Resilience",
        "Link": "https://www.darkreading.com/cybersecurity-operations/male-dominated-cyber-industry-still-holds-space-for-women-with-resilience",
        "Summary": "When trying to crack your way into a cyber career, true passion and a bold love of the industry is a must, if you want to set yourself apart from hundreds of other job applicants, according to Weave CISO Jessica Sica.",
        "Date": "2025-08-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/male-dominated-cyber-industry-still-holds-space-for-women-with-resilience"
    },
    {
        "Title": "Building the Perfect Post-Security Incident Review Playbook",
        "Link": "https://www.darkreading.com/cybersecurity-operations/perfect-post-security-incident-review-playbook",
        "Summary": "By creating a safe environment for open discussion, prioritizing human context alongside technical data, and involving diverse stakeholders, organizations can turn security incidents into accelerators of resilience.",
        "Date": "2025-08-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/perfect-post-security-incident-review-playbook"
    },
    {
        "Title": "New 'Shade BIOS' Technique Beats Every Kind of Security",
        "Link": "https://www.darkreading.com/endpoint-security/shade-bios-technique-beats-security",
        "Summary": "What if malware didn't require an operating system to function? How would anyone possibly notice, let alone disable it?",
        "Date": "2025-08-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/shade-bios-technique-beats-security"
    },
    {
        "Title": "ISC2 Launches New Security Certificate for AI Expertise",
        "Link": "https://www.darkreading.com/cybersecurity-careers/isc2-launches-security-certificate-ai-expertise",
        "Summary": "The six-course program cover topics such as AI fundamentals, ethics, and risks.",
        "Date": "2025-08-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-careers/isc2-launches-security-certificate-ai-expertise"
    },
    {
        "Title": "SIEMs: Dying a Slow Death or Poised for AI Rebirth?",
        "Link": "https://www.darkreading.com/cybersecurity-analytics/siems-dying-slow-death-ai-rebirth",
        "Summary": "The SIEM market is at a pivotal point as XDR platforms and generative AI shake up the security analytics space.",
        "Date": "2025-08-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-analytics/siems-dying-slow-death-ai-rebirth"
    },
    {
        "Title": "Gen Z in the Crosshairs: Cybercriminals Shift Focus to Young, Digital-Savvy Workers",
        "Link": "https://www.securityweek.com/gen-z-in-the-crosshairs-cybercriminals-shift-focus-to-young-digital-savvy-workers/",
        "Summary": "<p>Should Gen Z to be treated as a separate attack surface within your company?</p>\n<p>The post <a href=\"https://www.securityweek.com/gen-z-in-the-crosshairs-cybercriminals-shift-focus-to-young-digital-savvy-workers/\">Gen Z in the Crosshairs: Cybercriminals Shift Focus to Young, Digital-Savvy Workers</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/gen-z-in-the-crosshairs-cybercriminals-shift-focus-to-young-digital-savvy-workers/"
    },
    {
        "Title": "In Other News: Microsoft Probes ToolShell Leak, Port Cybersecurity, Raspberry Pi ATM Hack",
        "Link": "https://www.securityweek.com/in-other-news-microsoft-probes-toolshell-leak-port-cybersecurity-raspberry-pi-atm-hack/",
        "Summary": "<p>Noteworthy stories that might have slipped under the radar: Microsoft investigates whether the ToolShell exploit was leaked via MAPP, two reports on port cybersecurity, physical backdoor used for ATM hacking attempt.</p>\n<p>The post <a href=\"https://www.securityweek.com/in-other-news-microsoft-probes-toolshell-leak-port-cybersecurity-raspberry-pi-atm-hack/\">In Other News: Microsoft Probes ToolShell Leak, Port Cybersecurity, Raspberry Pi ATM Hack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/in-other-news-microsoft-probes-toolshell-leak-port-cybersecurity-raspberry-pi-atm-hack/"
    },
    {
        "Title": "Microsoft Boosts .NET Bounty Program Rewards to $40,000",
        "Link": "https://www.securityweek.com/microsoft-boosts-net-bounty-program-rewards-to-40000/",
        "Summary": "<p>Valid, complete reports detailing remote code execution or elevation of privilege bugs in .NET qualify for the maximum rewards.</p>\n<p>The post <a href=\"https://www.securityweek.com/microsoft-boosts-net-bounty-program-rewards-to-40000/\">Microsoft Boosts .NET Bounty Program Rewards to $40,000</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/microsoft-boosts-net-bounty-program-rewards-to-40000/"
    },
    {
        "Title": "Russian Cyberspies Target Foreign Embassies in Moscow via AitM Attacks: Microsoft",
        "Link": "https://www.securityweek.com/russian-cyberspies-target-foreign-embassies-in-moscow-via-aitm-attacks-microsoft/",
        "Summary": "<p>Russian state-sponsored APT Secret Blizzard has used ISP-level AitM attacks to infect diplomatic devices with malware.</p>\n<p>The post <a href=\"https://www.securityweek.com/russian-cyberspies-target-foreign-embassies-in-moscow-via-aitm-attacks-microsoft/\">Russian Cyberspies Target Foreign Embassies in Moscow via AitM Attacks: Microsoft</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/russian-cyberspies-target-foreign-embassies-in-moscow-via-aitm-attacks-microsoft/"
    },
    {
        "Title": "Cyber Risk Management Firm Safe Raises $70 Million",
        "Link": "https://www.securityweek.com/cyber-risk-management-firm-safe-raises-70-million/",
        "Summary": "<p>Safe has raised $70 million in Series C funding to advance cyber risk management through specialized AI agents.</p>\n<p>The post <a href=\"https://www.securityweek.com/cyber-risk-management-firm-safe-raises-70-million/\">Cyber Risk Management Firm Safe Raises $70 Million</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cyber-risk-management-firm-safe-raises-70-million/"
    },
    {
        "Title": "Echo Raises $15M in Seed Funding for Vulnerability-Free Container Images",
        "Link": "https://www.securityweek.com/echo-raises-15m-in-seed-funding-for-vulnerability-free-container-images/",
        "Summary": "<p>Echo received funding for creating thousands of container images that are not affected by any CVE, for enterprise-grade software infrastructure.  </p>\n<p>The post <a href=\"https://www.securityweek.com/echo-raises-15m-in-seed-funding-for-vulnerability-free-container-images/\">Echo Raises $15M in Seed Funding for Vulnerability-Free Container Images</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/echo-raises-15m-in-seed-funding-for-vulnerability-free-container-images/"
    },
    {
        "Title": "Bill Aims to Create National Strategy for Quantum Cybersecurity Migration",
        "Link": "https://www.securityweek.com/bill-aims-to-create-national-strategy-for-quantum-cybersecurity-migration/",
        "Summary": "<p>Two US senators introduced a bipartisan bill to help prepare federal government agencies for quantum computing threats.</p>\n<p>The post <a href=\"https://www.securityweek.com/bill-aims-to-create-national-strategy-for-quantum-cybersecurity-migration/\">Bill Aims to Create National Strategy for Quantum Cybersecurity Migration</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/bill-aims-to-create-national-strategy-for-quantum-cybersecurity-migration/"
    },
    {
        "Title": "$1 Million Offered for WhatsApp Exploit at Pwn2Own Ireland 2025",
        "Link": "https://www.securityweek.com/1-million-offered-for-whatsapp-exploit-at-pwn2own-ireland-2025/",
        "Summary": "<p>Meta is sponsoring ZDI’s Pwn2Own hacking competition, where participants can earn big prizes for smartphone, WhatsApp and wearable device exploits.</p>\n<p>The post <a href=\"https://www.securityweek.com/1-million-offered-for-whatsapp-exploit-at-pwn2own-ireland-2025/\">$1 Million Offered for WhatsApp Exploit at Pwn2Own Ireland 2025</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/1-million-offered-for-whatsapp-exploit-at-pwn2own-ireland-2025/"
    }
]