[
    {
        "Title": "CL-STA-0969 Installs Covert Malware in Telecom Networks During 10-Month Espionage Campaign",
        "Link": "https://thehackernews.com/2025/08/cl-sta-0969-installs-covert-malware-in.html",
        "Summary": "Telecommunications organizations in Southeast Asia have been targeted by a state-sponsored threat actor known as CL-STA-0969 to facilitate remote control over compromised networks.\nPalo Alto Networks Unit 42 said it observed multiple incidents in the region, including one aimed at critical telecommunications infrastructure between February and November 2024.\nThe attacks are characterized by the",
        "Date": "2025-08-02",
        "Content": "Telecommunications organizations in Southeast Asia have been targeted by a state-sponsored threat actor known as\nCL-STA-0969\nto facilitate remote control over compromised networks.\nPalo Alto Networks Unit 42 said it observed multiple incidents in the region, including one aimed at critical telecommunications infrastructure between February and November 2024.\nThe attacks are characterized by the use of several tools to enable remote access, as well as the deployment of Cordscan, which can collect location data from mobile devices.\nHowever, the cybersecurity company said it found no evidence of data exfiltration from the networks and systems it investigated. Nor were any efforts made by the attackers to track or communicate with target devices within mobile networks.\n\"The threat actor behind CL-STA-0969 maintained high operational security (OPSEC) and employed various defense evasion techniques to avoid detection,\" security researchers Renzon Cruz, Nicolas Bareil, and Navin Thomas\nsaid\n.\nCL-STA-0969, per Unit 42, shares significant overlaps with a cluster tracked by CrowdStrike under the name\nLiminal Panda\n, a China-nexus espionage group that has been attributed to attacks directed against telecommunications entities in South Asia and Africa since at least 2020 with the goal of intelligence gathering.\nIt's worth noting that some aspects of Liminal Panda's tradecraft were previously attributed to another threat actor called\nLightBasin\n(aka UNC1945), which has also singled out the telecom sector since 2016. LightBasin, for its part, overlaps with a third cluster dubbed\nUNC2891\n, a financially motivated crew known for its attacks on Automatic Teller Machine (ATM) infrastructure.\n\"While this cluster significantly overlaps with Liminal Panda, we have also observed overlaps in attacker tooling with other reported groups and activity clusters, including Light Basin,\nUNC3886\n, UNC2891, and UNC1945,\" the researchers pointed out.\nIn at least one case, CL-STA-0969 is believed to have employed brute-force attacks against SSH authentication mechanisms for initial compromise, leveraging the access to drop various implants such as -\nAuthDoor\n, a malicious Pluggable Authentication Module (\nPAM\n) that works similar to SLAPSTICK (originally attributed to UNC1945) to conduct credential theft and provide persistent access to the compromised host via a hard-coded magic password\nCordscan\n, a network scanning and packet capture utility (previously attributed to Liminal Panda)\nGTPDOOR\n, a malware explicitly\ndesigned\nto be deployed in telecom networks that are adjacent to GPRS roaming exchanges\nEchoBackdoor\n, a passive backdoor that listens for ICMP echo request packets containing command-and-control (C2) instructions to extract the command and send the results of the execution back to the server via an unencrypted ICMP Echo Reply packet\nServing GPRS Support Node (SGSN) Emulator (\nsgsnemu\n)\n, an emulation software to tunnel traffic via the telecommunications network and bypass firewall restrictions (previously attributed to Liminal Panda)\nChronosRAT\n, a modular ELF binary that's capable of shellcode execution, file operations, keylogging, port forwarding, remote shell, screenshot capture, and proxy capabilities\nNoDepDNS\n(internally referred to as MyDns), a Golang backdoor that creates a raw socket and passively listens for UDP traffic on port 53 to parse incoming commands via DNS messages\n\"CL-STA-0969 leveraged different shell scripts that established a reverse SSH tunnel along with other functionalities,\" Unit 42 researchers noted. \"CL-STA-0969 systematically clears logs and deletes executables when they are no longer needed, to maintain a high degree of OPSEC.\"\nAdding to the already broad portfolio of malicious tools that the threat actor has deployed are\nMicrosocks proxy\n, Fast Reverse Proxy (\nFRP\n),\nFScan\n,\nResponder\n, and\nProxyChains\n, as well as programs to exploit flaws in Linux and UNIX-based systems (CVE-2016-5195, CVE-2021-4034, and CVE-2021-3156) to achieve privilege escalation.\nBesides using a combination of bespoke and publicly available tooling, the threat actors have been found to adopt a number of strategies to fly under the radar. This encompasses DNS tunneling of traffic, routing traffic through compromised mobile operators, erasing authentication logs, disabling Security-Enhanced Linux (\nSELinux\n), and disguising process names with convincing names that match the target environment.\n\"CL-STA-0969 demonstrates a deep understanding of telecommunications protocols and infrastructure,\" Unit 42 said. \"Its malware, tools and techniques reveal a calculated effort to maintain persistent, stealthy access. It achieved this by proxying traffic through other telecom nodes, tunneling data using less-scrutinized protocols and employing various defense evasion techniques.\"\nChina Accuses U.S. Agencies of Targeting Military and Research Institutions\nThe disclosure comes as the National Computer Network Emergency Response Technical Team/Coordination Center of China (CNCERT)\naccused\nU.S. intelligence agencies of weaponizing a Microsoft Exchange zero-day exploit to steal defense-related information and hijack more than 50 devices belonging to a \"major Chinese military enterprise\" between July 2022 and July 2023.\nThe agency also said high-tech military-related universities, scientific research institutes, and enterprises in the country were targeted as part of these attacks to siphon valuable data from compromised hosts. Among those targeted was a Chinese military enterprise in the communications and satellite internet sectors that was attacked from July to November of 2024 by exploiting vulnerabilities in electronic file systems, CNCERT alleged.\nThe attribution effort\nmirrors tactics from the West\n, which has repeatedly blamed China for major cyber attacks, counting the latest zero-day exploitation of Microsoft SharePoint Server.\nAsked last month about Chinese hacking into U.S. telecom systems and theft of intellectual property on Fox News, U.S. President Donald Trump\nsaid\n, \"You don't think we do that to them? We do. We do a lot of things. That's the way the world works. It's a nasty world.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "New ‘Plague’ PAM Backdoor Exposes Critical Linux Systems to Silent Credential Theft",
        "Link": "https://thehackernews.com/2025/08/new-plague-pam-backdoor-exposes.html",
        "Summary": "Cybersecurity researchers have flagged a previously undocumented Linux backdoor dubbed Plague that has managed to evade detection for a year.\n\"The implant is built as a malicious PAM (Pluggable Authentication Module), enabling attackers to silently bypass system authentication and gain persistent SSH access,\" Nextron Systems researcher Pierre-Henri Pezier said.\nPluggable Authentication Modules",
        "Date": "2025-08-02",
        "Content": "Cybersecurity researchers have flagged a previously undocumented Linux backdoor dubbed\nPlague\nthat has managed to evade detection for a year.\n\"The implant is built as a malicious\nPAM\n(Pluggable Authentication Module), enabling attackers to silently bypass system authentication and gain persistent SSH access,\" Nextron Systems researcher Pierre-Henri Pezier\nsaid\n.\nPluggable Authentication Modules refers to a suite of shared libraries used to manage user authentication to applications and services in Linux and UNIX-based systems.\nGiven that PAM modules are loaded into privileged authentication processes, a rogue PAM can\nenable\ntheft of user credentials, bypass authentication checks, and remain undetected by security tools.\nThe cybersecurity company said it uncovered multiple Plague artifacts uploaded to VirusTotal since July 29, 2024, with none of them detected by antimalware engines as malicious. What's more, the presence of several samples signals active development of the malware by the unknown threat actors behind it.\nPlague boasts of four prominent features: Static credentials to allow covert access, resist analysis and reverse engineering using anti-debugging and string obfuscation; and enhanced stealth by erasing evidence of an SSH session.\nThis, in turn, is accomplished by unsetting environment variables such as\nSSH_CONNECTION and SSH_CLIENT\nusing unsetenv, and redirecting\nHISTFILE\nto /dev/null to prevent shell command logging, in order otherwise avoid leaving an audit trail.\n\"Plague integrates deeply into the authentication stack, survives system updates, and leaves almost no forensic traces,\" Pezier noted. \"Combined with layered obfuscation and environment tampering, this makes it exceptionally hard to detect using traditional tools.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Akira Ransomware Exploits SonicWall VPNs in Likely Zero-Day Attack on Fully-Patched Devices",
        "Link": "https://thehackernews.com/2025/08/akira-ransomware-exploits-sonicwall.html",
        "Summary": "SonicWall SSL VPN devices have become the target of Akira ransomware attacks as part of a newfound surge in activity observed in late July 2025.\n\"In the intrusions reviewed, multiple pre-ransomware intrusions were observed within a short period of time, each involving VPN access through SonicWall SSL VPNs,\" Arctic Wolf Labs researcher Julian Tuin said in a report.\nThe cybersecurity company",
        "Date": "2025-08-02",
        "Content": "SonicWall SSL VPN devices have become the target of Akira ransomware attacks as part of a newfound surge in activity observed in late July 2025.\n\"In the intrusions reviewed, multiple pre-ransomware intrusions were observed within a short period of time, each involving VPN access through SonicWall SSL VPNs,\" Arctic Wolf Labs researcher Julian Tuin\nsaid\nin a report.\nThe cybersecurity company suggested that the attacks could be exploiting an as-yet-undetermined security flaw in the appliances, meaning a zero-day vulnerability, given that some of the incidents affected fully-patched SonicWall devices. However, the possibility of credential-based attacks for initial access hasn't been ruled out.\nThe uptick in attacks involving SonicWall SSL VPNs was first registered on July 15, 2025, although Arctic Wolf said that it has observed similar malicious VPN logins\nas far back as October 2024\n, suggesting sustained efforts to target the devices.\n\"A short interval was observed between initial SSL VPN account access and ransomware encryption,\" it said. \"In contrast with legitimate VPN logins which typically originate from networks operated by broadband internet service providers, ransomware groups often use Virtual Private Server hosting for VPN authentication in compromised environments.\"\nQueries sent to SonicWall for further details on the activity did not elicit a response until the publishing of this article. As mitigations, organizations are advised to consider disabling the SonicWall SSL VPN service until a patch is made available and deployed, given the likelihood of a zero-day vulnerability.\nOther best practices include enforcing multi-factor authentication (MFA) for remote access, deleting inactive or unused local firewall user accounts, and following password hygiene.\nAs of early 2024, Akira ransomware actors are\nestimated\nto have extorted approximately $42 million in illicit proceeds after targeting more than 250 victims. It first emerged in March 2023.\nStatistics shared by Check Point show that Akira was the second most active group in the second quarter of 2025 after Qilin, claiming 143 victims during the time period.\n\"Akira ransomware maintains a special focus on Italy, with 10% of its victims from Italian companies compared to 3% in the general ecosystem,\" the cybersecurity company\nsaid\n.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "OpenAI prepares new open weight models along with GPT-5",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-prepares-new-open-weight-models-along-with-gpt-5/",
        "Summary": "OpenAI isn't just working on GPT-5. It looks like OpenAI is also preparing to release new open-source weights, living up to its name, OpenAI.' [...]",
        "Date": "2025-08-02",
        "Content": "OpenAI isn't just working on GPT-5. It looks like OpenAI is also preparing to release new open-source weights, living up to its name, \"OpenAI.\"\nAs\nspotted\non X, two new open-source weights, \"gpt-oss-20b\" and \"gpt-oss-120b,\" have been spotted on HuggingFace, which is an AI platform to host models.\nThe models are on HuggingFace ahead of the public release.\nTypically, companies like OpenAI need to share the model weights with partner companies. This is done in preparation for the release.\nOpenAI has apparently begun sharing open-weight models with external organizations like HuggingFace.\nWe'll likely see more references to these open weights in the coming days as OpenAI prepares for the release.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nOpenAI prepares GPT-5 for roll out\nChatGPT's GPT-5-reasoning-alpha model spotted ahead of launch\nOpenAI: GPT-5 is coming, \"we'll see\" if it creates a shockwave\nOpenAI says GPT-5 will unify breakthroughs from different models\nLeaks hint at Operator-like tool in ChatGPT ahead of GPT-5 launch"
    },
    {
        "Title": "Anthropic says OpenAI engineers using Claude Code ahead of GPT-5 launch",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/anthropic-says-openai-engineers-using-claude-code-ahead-of-gpt-5-launch/",
        "Summary": "Anthropic says it has revoked OpenAI's access to the Claude API after ChatGPT's engineers were found using Claude's coding tools. [...]",
        "Date": "2025-08-02",
        "Content": "Anthropic says it has revoked OpenAI's access to the Claude API after ChatGPT's engineers were found using Claude's coding tools.\nClaude Code is better than any other coding tool in the AI coding industry, also known as \"Vibe coding.\"\nWith Claude, you can create web apps from scratch, and it's also pretty efficient with infra-related work.\nNot just vibe coders who don't know how to code use Claude, but also professional engineers.\nIn fact, Claude Code is also used in Claude's development at Anthropic.\nAnthropic offers API access to Claude, which means OpenAI could also access it.\nBut on Friday, Anthropic confirmed that it revoked OpenAI's access to Claude Code after the company was found using its coding tools ahead of the GPT-5 launch.\n“Claude Code has become the go-to choice for coders everywhere, and so it was no surprise to learn OpenAI's own technical staff were also using our coding tools ahead of the launch of GPT-5,” Anthropic spokesperson Christopher Nulty noted in a\nstatement\nto Wired.\nIt's unclear how OpenAI engineers were using Claude Code, but it's possible it was used to improve GPT-5's coding capabilities.\nGPT-5 is expected to launch next week with \"auto\" and reasoning modes.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nOpenAI prepares new open weight models along with GPT-5\nOpenAI prepares GPT-5 for roll out\nChatGPT's GPT-5-reasoning-alpha model spotted ahead of launch\nOpenAI, Anthropic, Google may disrupt education market with new AI tools\nNew ChatGPT o3-alpha model hints at coding upgrade"
    }
]