[
    {
        "Title": "Taiwan Web Servers Breached by UAT-7237 Using Customized Open-Source Hacking Tools",
        "Link": "https://thehackernews.com/2025/08/taiwan-web-servers-breached-by-uat-7237.html",
        "Summary": "A Chinese-speaking advanced persistent threat (APT) actor has been observed targeting web infrastructure entities in Taiwan using customized versions of open-sourced tools with an aim to establish long-term access within high-value victim environments.\nThe activity has been attributed by Cisco Talos to an activity cluster it tracks as UAT-7237, which is believed to be active since at least 2022.",
        "Date": "2025-08-15",
        "Content": "A Chinese-speaking advanced persistent threat (APT) actor has been observed targeting web infrastructure entities in Taiwan using customized versions of open-sourced tools with an aim to establish long-term access within high-value victim environments.\nThe activity has been attributed by Cisco Talos to an activity cluster it tracks as\nUAT-7237\n, which is believed to be active since at least 2022. The hacking group is assessed to be a sub-group of\nUAT-5918\n, which is known to be attacking critical infrastructure entities in Taiwan as far back as 2023.\n\"UAT-7237 conducted a recent intrusion targeting web infrastructure entities within Taiwan and relies heavily on the use of open-sourced tooling, customized to a certain degree, likely to evade detection and conduct malicious activities within the compromised enterprise,\" Talos\nsaid\n.\nThe attacks are characterized by the use of a bespoke shellcode loader dubbed SoundBill that's designed to decode and launch secondary payloads, such as Cobalt Strike.\nDespite the tactical overlaps with UAT-5918, UAT-7237's tradecraft exhibits notable deviations, including its reliance on Cobalt Strike as a primary backdoor, the selective deployment of web shells after initial compromise, and the incorporation of direct remote desktop protocol (RDP) access and SoftEther VPN clients for persistent access.\nThe attack chains begin with the exploitation of known security flaws against unpatched servers exposed to the internet, followed by conducting initial reconnaissance and fingerprinting to determine if the target is of interest to the threat actors for follow-on exploitation.\n\"While UAT-5918 immediately begins deploying web shells to establish backdoored channels of access, UAT-7237 deviates significantly, using the\nSoftEther VPN client\n(similar to Flax Typhoon) to persist their access, and later access the systems via RDP,\" researchers Asheer Malhotra, Brandon White, and Vitor Ventura said.\nOnce this step is successful, the attacker pivots to other systems across the enterprise to expand their reach and carry out further activities, including the deployment of SoundBill, a shellcode loader based on\nVTHello\n, for launching Cobalt Strike.\nAlso deployed on compromised hosts is JuicyPotato, a privilege escalation tool widely used by various Chinese hacking groups, and Mimikatz to extract credentials. In an interesting twist, subsequent attacks have leveraged an updated version of SoundBill that embeds a Mimikatz instance into it in order to achieve the same goals.\nBesides using\nFScan\nto identify open ports against IP subnets, UAT-7237 has been observed attempting to make Windows Registry changes to disable User Account Control (UAC) and turn on storage of cleartext passwords.\n\"UAT-7237 specified Simplified Chinese as the preferred display language in their [SoftEther] VPN client's language configuration file, indicating that the operators were proficient with the language,\" Talos noted.\nThe disclosure comes as Intezer said it discovered a new variant of a known backdoor called FireWood that's associated with a China-aligned threat actor called Gelsemium, albeit with low confidence.\nFireWood was\nfirst documented\nby ESET in November 2024, detailing its ability to leverage a kernel driver rootkit module called usbdev.ko to hide processes, and run various commands sent by an attacker-controlled server.\n\"The core functionality of the backdoor remains the same but we did notice some changes in the implementation and the configuration of the backdoor,\" Intezer researcher Nicole Fishbein\nsaid\n. \"It is unclear if the kernel module was also updated as we were not able to collect it.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "U.S. Sanctions Garantex and Grinex Over $100M in Ransomware-Linked Illicit Crypto Transactions",
        "Link": "https://thehackernews.com/2025/08/us-sanctions-garantex-and-grinex-over.html",
        "Summary": "The U.S. Department of the Treasury's Office of Foreign Assets Control (OFAC) on Thursday renewed sanctions against Russian cryptocurrency exchange platform Garantex for facilitating ransomware actors and other cybercriminals by processing more than $100 million in transactions linked to illicit activities since 2019.\nThe Treasury said it's also imposing sanctions on Garantex's successor, Grinex",
        "Date": "2025-08-15",
        "Content": "The U.S. Department of the Treasury's Office of Foreign Assets Control (OFAC) on Thursday renewed sanctions against Russian cryptocurrency exchange platform\nGarantex\nfor facilitating ransomware actors and other cybercriminals by processing more than $100 million in transactions linked to illicit activities since 2019.\nThe Treasury said it's also imposing sanctions on Garantex's successor,\nGrinex\n, as well as three executives of Garantex and six associated companies in Russia and the Kyrgyz Republic that have enabled these activities -\nSergey Mendeleev (Co-founder)\nAleksandr Mira Serda (Co-founder)\nPavel Karavatsky (Co-founder)\nIndependent Decentralized Finance Smartbank and Ecosystem (InDeFi Bank)\nExved\nOld Vector\nA7 LLC\nA71 LLC\nA7 Agent LLC\n\"Digital assets play a crucial role in global innovation and economic development, and the United States will not tolerate abuse of this industry to support cybercrime and sanctions evasion,\"\nsaid\nUnder Secretary of the Treasury for Terrorism and Financial Intelligence, John K. Hurley.\n\"Exploiting cryptocurrency exchanges to launder money and facilitate ransomware attacks not only threatens our national security, but also tarnishes the reputations of legitimate virtual asset service providers.\"\nGarantex was\nfirst sanctioned\nby the U.S. in April 2022 for facilitating transactions from darknet markets and illicit actors such as Hydra and Conti. The cryptocurrency exchange's website was\nseized\nas part of a coordinated law enforcement operation back in March 2025, and its co-founder, Aleksej Besciokov, was arrested in India.\nMerely months later, TRM Labs\nrevealed\nthat Garantex may have rebranded as Grinex, likely in an effort to evade sanctions, with the former continuing to process more than $100 million in transactions since the sanctions were levied. Eighty-two percent of its total volume was linked to sanctioned entities worldwide.\n\"Days after Garantex's takedown, Telegram channels affiliated with the exchange began promoting Grinex, a platform with a nearly identical interface, registered in Kyrgyzstan in December 2024,\" TRM Labs noted in May.\nThe U.S. Treasury said criminal users use Garantex to launder their ill-gotten funds, processing funds from those related to Conti, Black Basta, LockBit, NetWalker, and Phoenix Cryptolocker ransomware variants. It also said Garantex moved its infrastructure and customer deposits to Grinex shortly after the March law enforcement actions.\nFurthermore, Garantex is said to have worked with affected customers to regain access to their accounts using a ruble-backed stablecoin called\nA7A5 token\n, which is issued by a Kyrgyzstani firm called Old Vector. The token's creator is A7 LLC.\nAccording to a report from Elliptic, A7A5 has been\nused\nto transfer no less than $1 billion per day, with the aggregate value of A7A5 transfers pegged at $41.2 billion. In all, Grinex is estimated to have facilitated the transfer of billions of dollars in cryptocurrency transactions within the few months it has been operational.\n\"Garantex has also provided account and exchange services to actors associated with the Ryuk ransomware gang,\" the agency said. \"Ekaterina Zhdanova, a prolific money launderer, exchanged over $2 million in Bitcoin for Tether (USDT) via Garantex.\"\nGarantex's outgoing funds from September 2024 through May 2025\nZhdanova was\npreviously sanctioned\nby the U.S. in November 2023 for laundering virtual currency for the country's elites and cybercriminal crews, including Ryuk.\n\"Garantex's senior executives have supported its ability to enable cybercrime and sanctions evasion by procuring computer infrastructure for Garantex, registering its trademarks, and engaging in business development efforts to make its activities appear legitimate,\" the Treasury added. \"Garantex's network of partner companies has also enabled it to move money, including illicit funds, outside of Russia.\"\nThe U.S. Department of State has\nannounced\na $5 million reward for information leading to the arrest of Serda and $1 million for information on other key leaders of Garantex. It's worth noting that A7 was sanctioned by the U.K. in May 2025 and by the European Union last month.\n\"The March 2025 multinational takedown did not halt these activities,\" TRM Labs\nsaid\n. \"Instead, Garantex's leadership quickly activated a contingency plan that appears to have been in place for months.\"\n\"The integration of A7A5 into Grinex represents only the most recent chapter in Garantex's long-standing role in illicit finance. Both before and after its designation by the U.S. Treasury, Garantex operated as a key conduit for ransomware laundering, darknet market transactions, sanctions evasion, and the movement of funds through high-risk Russian financial networks.\"\nThe new wave of sanctions comes as the U.S. Department of Justice (DoJ) unsealed six warrants authorizing the seizure of over $2.8 million in cryptocurrency, $70,000 in cash, and a luxury vehicle.\nThe cryptocurrency, the DoJ said, was seized from a cryptocurrency wallet controlled by Ianis Aleksandrovich Antropenko, who has been charged in the U.S. for allegedly using Zeppelin ransomware to target individuals, businesses, and organizations worldwide.\n\"The cryptocurrency and other assets are proceeds of (or were involved in laundering the proceeds of) ransomware activity,\"\naccording to the DoJ\n.\n\"Those assets were laundered in various ways, including by using the cryptocurrency mixing service ChipMixer, which was taken down in a coordinated international operation in 2023. Antropenko also laundered cryptocurrency by exchanging cryptocurrency for cash and depositing the cash in structured cash deposits.\"\nIn a related development, more than $300 million in cryptocurrency assets linked to\ncybercrime\nand\nfraud schemes\n, including romance baiting (aka pig butchering) scams, have been frozen as part of an ongoing effort to identify and disrupt criminal networks.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Zero Trust + AI: Privacy in the Age of Agentic AI",
        "Link": "https://thehackernews.com/2025/08/zero-trust-ai-privacy-in-age-of-agentic.html",
        "Summary": "We used to think of privacy as a perimeter problem: about walls and locks, permissions, and policies. But in a world where artificial agents are becoming autonomous actors — interacting with data, systems, and humans without constant oversight — privacy is no longer about control. It’s about trust. And trust, by definition, is about what happens when you’re not looking.\nAgentic AI — AI that",
        "Date": "2025-08-15",
        "Content": "We used to think of privacy as a perimeter problem: about walls and locks, permissions, and policies. But in a world where artificial agents are becoming autonomous actors — interacting with data, systems, and humans without constant oversight — privacy is no longer about control. It's about trust. And trust, by definition, is about what happens when you're not looking.\nAgentic AI — AI that perceives, decides, and acts on behalf of others — isn't theoretical anymore. It's routing our traffic, recommending our treatments, managing our portfolios, and negotiating our digital identity across platforms. These agents don't just handle sensitive data — they interpret it. They make assumptions, act on partial signals, and evolve based on feedback loops. In essence, they build internal models not just of the world, but of us.\nAnd that should give us pause.\nBecause once an agent becomes adaptive and semi-autonomous, privacy isn't just about who has access to the data; it's about what the agent infers, what it chooses to share, suppress, or synthesize, and whether its goals remain aligned with ours as contexts shift.\nTake a simple example: an AI health assistant designed to optimize wellness. It starts by nudging you to drink more water and get more sleep. But over time, it begins triaging your appointments, analyzing your tone of voice for signs of depression, and even withholding notifications it predicts will cause stress. You haven't just shared your data — you've ceded narrative authority. That's where privacy erodes, not through a breach, but through a subtle drift in power and purpose.\nThis is no longer just about Confidentiality, Integrity, and Availability, the classic CIA triad. We must now factor in authenticity (can this agent be verified as itself?) and veracity (can we trust its interpretations and representations?). These aren't merely technical qualities — they're trust primitives.\nAnd trust is brittle when intermediated by intelligence.\nIf I confide in a human therapist or lawyer, there are assumed boundaries — ethical, legal, psychological. We have expected norms of behavior on their part and limited access and control. But when I share with an AI assistant, those boundaries blur. Can it be subpoenaed? Audited? Reverse-engineered? What happens when a government or corporation queries my agent for its records?\nWe have no settled concept yet of AI-client privilege. And if jurisprudence finds there isn't one, then all the trust we place in our agents becomes retrospective regret. Imagine a world where every intimate moment shared with an AI is legally discoverable — where your agent's memory becomes a weaponized archive, admissible in court.\nIt won't matter how secure the system is if the social contract around it is broken.\nToday's privacy frameworks — GDPR, CCPA — assume linear, transactional systems. But agentic AI operates in context, not just computation. It remembers what you forgot. It intuits what you didn't say. It fills in blanks that might be none of its business, and then shares that synthesis — potentially helpfully, potentially recklessly — with systems and people beyond your control.\nSo we must move beyond access control and toward ethical boundaries. That means building agentic systems that understand the intent behind privacy, not just the mechanics of it. We must design for legibility; AI must be able to explain why it acted. And for intentionality. It must be able to act in a way that reflects the user's evolving values, not just a frozen prompt history.\nBut we also need to wrestle with a new kind of fragility: What if my agent betrays me? Not out of malice, but because someone else crafted better incentives — or passed a law that superseded its loyalties?\nIn short: what if the agent is both mine and not mine?\nThis is why we must start treating AI agency as a first-order moral and legal category. Not as a product feature. Not as a user interface. But as a participant in social and institutional life. Because privacy in a world of minds — biological and synthetic — is no longer a matter of secrecy. It's a matter of reciprocity, alignment, and governance.\nIf we get this wrong, privacy becomes performative — a checkbox in a shadow play of rights. If we get it right, we build a world where autonomy, both human and machine, is governed not by surveillance or suppression, but by ethical coherence.\nAgentic AI forces us to confront the limits of policy, the fallacy of control, and the need for a new social contract. One built for entities that think — and one that has the strength to survive when they speak back.\nLearn more about Zero Trust + AI\n.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Cisco Warns of CVSS 10.0 FMC RADIUS Flaw Allowing Remote Code Execution",
        "Link": "https://thehackernews.com/2025/08/cisco-warns-of-cvss-100-fmc-radius-flaw.html",
        "Summary": "Cisco has released security updates to address a maximum-severity security flaw in Secure Firewall Management Center (FMC) Software that could allow an attacker to execute arbitrary code on affected systems.\nThe vulnerability, assigned the CVE identifier CVE-2025-20265 (CVSS score: 10.0), affects the RADIUS subsystem implementation that could permit an unauthenticated, remote attacker to inject",
        "Date": "2025-08-15",
        "Content": "Cisco has released security updates to address a maximum-severity security flaw in Secure Firewall Management Center (FMC) Software that could allow an attacker to execute arbitrary code on affected systems.\nThe vulnerability, assigned the CVE identifier\nCVE-2025-20265\n(CVSS score: 10.0), affects the RADIUS subsystem implementation that could permit an unauthenticated, remote attacker to inject arbitrary shell commands that are executed by the device.\nThe networking equipment major said the issue stems from a lack of proper handling of user input during the authentication phase, as a result of which an attacker could send specially crafted input when entering credentials that get authenticated at the configured RADIUS server.\n\"A successful exploit could allow the attacker to execute commands at a high privilege level,\" the company\nsaid\nin a Thursday advisory. \"For this vulnerability to be exploited, Cisco Secure FMC Software must be configured for RADIUS authentication for the web-based management interface, SSH management, or both.\"\nThe shortcoming impacts Cisco Secure FMC Software releases 7.0.7 and 7.7.0 if they have RADIUS authentication enabled. There are no workarounds other than applying the patches provided by the company. Brandon Sakai of Cisco has been credited with discovering the issue during internal security testing.\nBesides CVE-2025-20265, Cisco has also resolved a number of high-severity bugs -\nCVE-2025-20217\n(CVSS score: 8.6) - Cisco Secure Firewall Threat Defense Software Snort 3 Denial-of-Service Vulnerability\nCVE-2025-20222\n(CVSS score: 8.6) - Cisco Secure Firewall Adaptive Security Appliance and Secure Firewall Threat Defense Software for Firepower 2100 Series IPv6 over IPsec Denial-of-Service Vulnerability\nCVE-2025-20224, CVE-2025-20225, CVE-2025-20239\n(CVSS scores: 8.6) - Cisco IOS, IOS XE, Secure Firewall Adaptive Security Appliance, and Secure Firewall Threat Defense Software IKEv2 Denial-of-Service Vulnerabilities\nCVE-2025-20133, CVE-2025-20243\n(CVSS scores: 8.6) - Cisco Secure Firewall Adaptive Security Appliance and Secure Firewall Threat Defense Software Remote Access SSL VPN Denial-of-Service Vulnerabilities\nCVE-2025-20134\n(CVSS score: 8.6) - Cisco Secure Firewall Adaptive Security Appliance and Secure Firewall Threat Defense Software SSL/TLS Certificate Denial-of-Service Vulnerability\nCVE-2025-20136\n(CVSS score: 8.6) - Cisco Secure Firewall Adaptive Security Appliance and Secure Firewall Threat Defense Software Network Address Translation DNS Inspection Denial-of-Service Vulnerability\nCVE-2025-20263\n(CVSS score: 8.6) - Cisco Secure Firewall Adaptive Security Appliance and Secure Firewall Threat Defense Software Web Services Denial-of-Service Vulnerability\nCVE-2025-20148\n(CVSS score: 8.5) - Cisco Secure Firewall Management Center Software HTML Injection Vulnerability\nCVE-2025-20251\n(CVSS score: 8.5) - Cisco Secure Firewall Adaptive Security Appliance and Secure Firewall Threat Defense Software VPN Web Server Denial-of-Service Vulnerability\nCVE-2025-20127\n(CVSS score: 7.7) - Cisco Secure Firewall Adaptive Security Appliance and Secure Firewall Threat Defense Software for Firepower 3100 and 4200 Series TLS 1.3 Cipher Denial-of-Service Vulnerability\nCVE-2025-20244\n(CVSS score: 7.7) - Cisco Secure Firewall Adaptive Security Appliance and Secure Firewall Threat Defense Software Remote Access VPN Web Server Denial-of-Service Vulnerability\nWhile none of the flaws have come under active exploitation in the wild, with network appliances repeatedly getting caught in the attackers' crosshairs, it's essential that users move quickly to update their instances to the latest version.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Colt Telecom attack claimed by WarLock ransomware, data up for sale",
        "Link": "https://www.bleepingcomputer.com/news/security/colt-telecom-attack-claimed-by-warlock-ransomware-data-up-for-sale/",
        "Summary": "UK-based telecommunications company Colt Technology Services is dealing with a cyberattack that has caused a multi-day outage of some of the company's operations, including hosting and porting services, Colt Online and Voice API platforms. [...]",
        "Date": "2025-08-15",
        "Content": "UK-based telecommunications company Colt Technology Services is dealing with a cyberattack that has caused a multi-day outage of some of the company's operations, including hosting and porting services, Colt Online, and Voice API platforms.\nThe British telecommunications and network services provider disclosed that the attack started on August 12 and the disruption continues as its IT staff works around the clock to mitigate its effects.\nFounded in 1992 as City of London Telecommunications (COLT) and acquired by Fidelity Investments in 2015, Colt is a major telecommunications service provider operating in 30 countries across Europe, Asia, and North America. The company employs 75,000 km of fiber networks linking 900 data centers.\nServices still offline\nInitially, the company announced a “technical issue” without confirming a cyber incident. However, the nature of the event was communicated in subsequent\nstatus updates\n.\nThe attack forced the firm to take specific systems offline as a protective measure, which affected the operations of support services, including Colt Online and the Voice API platform.\nCustomer communication through online portals is currently unavailable, and clients are advised to contact Colt by email or phone and expect slower-than-usual responses.\nThe company underlined that the impacted systems are support services, not the core customer network infrastructure.\nAs of today, there is no estimation for restoring affected systems and operations.\nColt says it has notified the authorities about the incident without providing any details about the perpetrators or the type of attack.\nWarLock claims the attack\nA threat actor using the alias ‘cnkjasdfgd’ and claiming to be a member of the WarLock ransomware gang claimed the attack and offered to sell for $200,000 a batch of one million documents allegedly stolen from Colt.\nSeveral data samples have also been published to prove the validity of the files. According to the threat actor, the stolen files include financial, employee, customer, and executive data, internal emails, and software development information.\nThreat actor's post on a hacker forum\nSource:\nKELA\nAlthough the telecommunications company did not disclose the cause of the breach, security researcher\nKevin Beaumont\nsays that the hacker likely managed to gain initial access by exploiting a remote code execution vulnerability in Microsoft SharePoint tracked as CVE-2025-53770.\nThe security issue has been\nexploited as a zero-day\nsince at least July 18 and is considered critical in severity. Microsoft addressed it in a\nsecurity update on July 21\n.\nAccording to Beaumont, the hackers stole a few hundred gigabytes of files with customer data and documentation.\nBleepingComputer has contacted Colt to ask for verification of these allegations, and a spokesperson sent us the below comment:\n\"We’re aware of claims regarding the cyber incident. We are currently investigating these claims.\"\n\"Our technical team is focused on restoring the internal systems impacted by the cyber incident and is working closely with third-party cyber experts. We are grateful for our customers’ understanding as we work towards a resolution to fix the impacted internal systems.\" - Colt spokesperson\nUpdate 8/15\n- Added comment from Colt\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nIngram Micro starts restoring systems after ransomware attack\nCanada’s House of Commons investigating data breach after cyberattack\nPennsylvania attorney general's email, site down after cyberattack\nFrench telecom giant Orange discloses cyberattack\nMicrosoft: SharePoint flaws exploited in Warlock ransomware attacks"
    },
    {
        "Title": "Cisco warns of max severity flaw in Firewall Management Center",
        "Link": "https://www.bleepingcomputer.com/news/security/cisco-warns-of-max-severity-flaw-in-firewall-management-center/",
        "Summary": "Cisco is warning about a critical remote code execution (RCE) vulnerability in the RADIUS subsystem of its Secure Firewall Management Center (FMC) software. [...]",
        "Date": "2025-08-15",
        "Content": "Cisco is warning about a critical remote code execution (RCE) vulnerability in the RADIUS subsystem of its Secure Firewall Management Center (FMC) software.\nCisco FCM is a management platform for the vendor’s Secure Firewall products, which provides a centralized web or SSH-based interface to allow administrators to configure, monitor, and update Cisco firewalls.\nRADIUS in FMC is an optional external authentication method that permits connecting to a Remote Authentication Dial-In User Service server instead of local accounts.\nThis configuration is commonly used in enterprise and government networks where administrators want centralized login control and accounting for network device access.\nThe recently disclosed vulnerability is tracked as CVE-2025-20265 and received the maximum severity score of 10 out of 10.\nIt can be exploited to allow an unauthenticated remote attacker to send specially crafted input when entering credentials during the RADIUS authentication step.\nAn adversary could thus achieve arbitrary shell command execution with elevated privileges.\n“A vulnerability in the RADIUS subsystem implementation of Cisco Secure Firewall Management Center (FMC) Software could allow an unauthenticated, remote attacker to inject arbitrary shell commands that are executed by the device,”\nwarns Cisco in the security bulletin\n.\n“This vulnerability is due to a lack of proper handling of user input during the authentication phase,” the vendor says. CVE-2025-20265 impacts FMC versions 7.0.7 and 7.7.0 when the RADIUS authentication is enabled for the web-based management interface, SSH management, or both.\nCisco has released free software updates that address the issue. The fix was released through regular channels to customers with a valid service contract.\nIf the patch cannot be installed, Cisco's recommended mitigation is to disable RADIUS authentication and replace it with a different method (e.g. local user accounts, external LDAP, or SAML single sign-on).\nCisco notes that this mitigation worked in testing, but customers must verify its applicability and the impact it has in their environments.\nThe vulnerability was discovered internally by Cisco’s security researcher Brandon Sakai, and the vendor is not aware of the vulnerability being exploited in the wild.\nAlong with CVE-2025-20265, Cisco also released fixes for 13 high-severity flaws across various products, none of them marked as actively exploited:\nCVE-2025-20217\n– Secure Firewall Threat Defense Snort 3 denial of service.\nCVE-2025-20222\n– ASA & Secure FTD (Firepower 2100) IPv6 over IPsec denial of service.\nCVE-2025-20148\n– Secure Firewall Management Center HTML injection.\nCVE-2025-20244\n– ASA & Secure FTD Remote Access VPN web server denial of service.\nCVE-2025-20133, CVE-2025-20243\n– ASA & Secure FTD Remote Access SSL VPN denial of service.\nCVE-2025-20134\n– ASA & Secure FTD SSL/TLS certificate denial of service.\nCVE-2025-20136\n– ASA & Secure FTD NAT DNS inspection denial of service.\nCVE-2025-20251\n– ASA & Secure FTD VPN web server denial of service.\nCVE-2025-20224, CVE-2025-20225\n– IOS, IOS XE, ASA & Secure FTD IKEv2 denial of service.\nCVE-2025-20263\n– ASA & Secure FTD web services denial of service.\nCVE-2025-20127\n– ASA & Secure FTD (Firepower 3100/4200) TLS 1.3 cipher denial of service.\nThe vendor says that there are no workarounds for any of the above security issues except for CVE-2025-20127, where the recommendation is to remove the TLS 1.3 cipher.\nFor all other issues the vendor recommends installing the latest updates available.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nCisco: Maximum-severity ISE RCE flaws now exploited in attacks\nMax severity Cisco ISE bug allows pre-auth command execution, patch now\nHackers are exploiting critical RCE flaw in Wing FTP Server\nCisco warns of max severity RCE flaws in Identity Services Engine\nSitecore CMS exploit chain starts with hardcoded 'b' password"
    },
    {
        "Title": "Microsoft reminds of Windows 10 support ending in two months",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-reminds-users-of-windows-10-retirement-in-october/",
        "Summary": "Microsoft has reminded customers that Windows 10 will be retired in two months after all editions of Windows 10, version 22H2 reach their end of servicing on October 14. [...]",
        "Date": "2025-08-15",
        "Content": "Microsoft has reminded customers that Windows 10 will be retired in two months after all editions of Windows 10, version 22H2 reach their end of servicing on October 14.\nOn the same date, Windows 10 2015 LTSB and Windows 10 IoT Enterprise LTSB 2015 will also reach the end of extended support.\nAfter Windows 10 is retired, Microsoft will no longer provide bug fixes or technical assistance for issues affecting the system's security, stability, or usability.\n\"On October 14, 2025, Windows 10, version 22H2 (Home, Pro, Enterprise, Education, and IoT Enterprise editions) will reach end of servicing,\" the company announced in a\nmessage center update\n. \"The October 2025 monthly security update will be the last update available for these versions. After this date, devices running these versions will no longer receive monthly security and preview updates containing protections from the latest security threats.\"\nMicrosoft advises customers who want their Windows 10 devices to keep receiving essential security updates and bug fixes to upgrade eligible systems to Windows 11 or migrate to Windows 11 in the cloud with Windows 365.\nWindows 10 users who want to delay switching to Windows 11 can enroll in the Extended Security Updates (ESU) program, $61 per device for one year for enterprise customers and $30 for home users. This program is also\navailable for free to consumers\nwho enable Windows Backup to sync their data to the cloud or use Microsoft Rewards points to enroll.\nWindows 10 devices that access Windows 11 Cloud PCs via Windows 365 and Virtual Machines can also use ESU at no additional charge, receiving automatic security updates without requiring any extra steps.\nThe other option is to switch to Long-Term Servicing Channel (LTSC) releases, which cater to specialized devices such as those controlling medical or industrial equipment, to receive updates beyond October 2025.\nFor instance, Windows 10 Enterprise LTSC 2021\nreaches\nits Mainstream End Date on January 12, 2027 (with extended support for the IoT Enterprise edition only), while Windows 10 Enterprise LTSC 2019\nwill reach\nits Extended End Date two years later, on January 9, 2029.\nAccording to Statcounter Global Stats data, Windows 11\nhas finally surpassed\nWindows 10 in terms of install base three years after its launch in\nOctober 2021\n. Currently, over 53% of all Windows systems run Windows 11, while only 42% are on Windows 10.\nSteam's Hardware & Software Survey\nalso shows that 59.9% of gamers are running Windows 11, while only 35.1% use Windows 10 as of July 2025.\nYou can find more information regarding the end-of-service dates of other Windows releases using the\nLifecycle Policy\nsearch tool or via the\nWindows Lifecycle FAQ\npage. Redmond also provides a\ncomplete list\nof all products\nthat will be retired or will reach the end of support this year.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nWindows 10 users can get extended security updates using Microsoft points\nWindows 11 23H2 Home and Pro reach end of support in November\nMicrosoft will stop supporting Windows 11 22H2 in October\nMicrosoft confirms Family Safety blocks Google Chrome from launching\nMicrosoft fixes Surface Hub boot issues with emergency update"
    },
    {
        "Title": "Plex warns users to patch security vulnerability immediately",
        "Link": "https://www.bleepingcomputer.com/news/security/plex-warns-users-to-patch-security-vulnerability-immediately/",
        "Summary": "Plex has notified some of its users on Thursday to urgently update their media servers due to a recently patched security vulnerability. [...]",
        "Date": "2025-08-15",
        "Content": "Plex has notified some of its users on Thursday to urgently update their media servers due to a recently patched security vulnerability.\nThe company has yet to assign a CVE-ID to track the flaw and didn't provide additional details regarding the patch, only saying that it impacts Plex Media Server versions 1.41.7.x to 1.42.0.x.\nYesterday, four days\nafter releasing security updates\nthat addressed the mysterious security bug, Plex emailed those running affected versions to update their software as soon as possible.\n\"We recently received a report via our bug bounty program that there was a potential security issue affecting Plex Media Server versions 1.41.7.x to 1.42.0.x. Thanks to that user, we were able to address the issue, release an updated version of the server, and continue to improve our security and defenses,\" the company said in the email.\n\"You're receiving this notice because our information indicates that a Plex Media Server owned by your Plex account is running an older version of the server. We strongly recommend that everyone update their Plex Media Server to the most recent version as soon as possible, if you have not already done so.\"\nPlex Media Server 1.42.1.10060, the version that patches this vulnerability, can be downloaded from the server management page or the\nofficial downloads page\n.\nPlex email (BleepingComputer)\n​While Plex hasn't shared any details regarding the vulnerability so far, users are advised to follow the company's advice and patch their software before threat actors reverse engineer the patches and develop an exploit.\nAlthough Plex has experienced its share of critical and high-severity security flaws over the years, this is one of the few instances where the company has emailed customers about securing their systems against a specific vulnerability.\nIn March 2023, CISA tagged a three-year-old remote code execution (RCE) flaw (CVE-2020-5741) in the Plex Media Server\nas actively exploited in attacks\n. As Plex\nexplained two years earlier\n, when it released patches, successful exploitation can allow attackers to make the server execute malicious code.\nWhile the cybersecurity agency didn't provide any information on the attacks exploiting CVE-2020-5741, they were likely linked to LastPass' disclosure that one of its senior DevOps engineers' computers\nhad been hacked in 2022\nto install a keylogger by abusing a third-party media software RCE bug.\nThe attackers exploited this access to steal the engineer's credentials and compromise the LastPass corporate vault, resulting in a\nmassive data breach in August 2022\nafter stealing LastPass's production backups and critical database backups.\nThe same month, Plex also\nnotified users of a data breach\nand asked them to reset passwords after an attacker gained access to a database containing emails, usernames, and encrypted passwords.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nCisco warns of max severity flaw in Firewall Management Center\nFortinet warns of FortiSIEM pre-auth RCE flaw with exploit in the wild\nMicrosoft August 2025 Patch Tuesday fixes one zero-day, 107 flaws\nOver 3,000 NetScaler devices left unpatched against CitrixBleed 2 bug\nCitrix Bleed 2 exploited weeks before PoCs as Citrix denied attacks"
    },
    {
        "Title": "US sanctions Grinex crypto-exchange, successor to Garantex",
        "Link": "https://www.bleepingcomputer.com/news/security/us-sanctions-grinex-crypto-exchange-garantexs-successor/",
        "Summary": "The U.S. Department of the Treasury has announced sanctions against Grinex, the successor to Russian cryptocurrency exchange Garantex, which was previously sanctioned for helping ransomware gangs launder their money. [...]",
        "Date": "2025-08-15",
        "Content": "The U.S. Department of the Treasury has announced sanctions against Grinex, the successor to Russian cryptocurrency exchange Garantex, which was previously sanctioned for helping ransomware gangs launder their money.\nA TRM Labs report,\nreleased in April\n, revealed that Grinex has strong ties to Garantex's previous operations, but stopped short of providing evidence that it was being used for illicit transactions.\nGrinex was promoted on Telegram channels linked to Garantex soon after U.S. authorities\nseized Garantex's domains\nin early March 2025 for processing $100 million worth of illicit transactions and laundering money for cybercriminals. Two Garantex administrators, Aleksandr Mira Serda and Aleksej Besciokov, were later\ncharged\n, with\nBesciokov being arrested\ndays later while vacationing in India.\nGarantex was\nsanctioned by the Treasury Department's Office of Foreign Assets Control (OFAC)\nin April 2022, following its association with darknet markets and cybercrime groups, including the Hydra dark web market, the notorious Conti Ransomware-as-a-Service (RaaS) operation, and the Black Basta, LockBit, NetWalker, Ryuk, and Phoenix Cryptolocker ransomware gangs.\n\"Immediately following the March 6, 2025 law enforcement actions led by the U.S. Secret Service, Garantex officers created the infrastructure to continue to provide key services to Garantex, specifically transferring Garantex customer deposits to Grinex,\"\nOFAC said\non Thursday.\n\"Grinex’s promotional materials state that the exchange was formed in response to sanctions and asset freezes that affected Garantex.  Since its creation, Grinex has facilitated the transfer of billions of dollars in cryptocurrency transactions.\"\nYesterday, OFAC has also renewed sanctions against Garantex, three of its co-founders (Sergey Mendeleev, Aleksandr Mira Serda, and Pavel Karavatsky), and six partner companies in Russia and Kyrgyzstan, including InDeFi Bank, Exved, Old Vector, A7, A71, and A7 Agent, for their alleged involvement with the two sanctioned crypto-exchanges.\nOn Thursday, the Department of State also announced\na reward of up to $6 million\nfor any information leading to the arrests or convictions of Garantex executives.\n\"Exploiting cryptocurrency exchanges to launder money and facilitate ransomware attacks not only threatens our national security, but also tarnishes the reputations of legitimate virtual asset service providers,\" said Under Secretary of the Treasury for Terrorism and Financial  Intelligence John K. Hurley. \"By exposing these malicious actors, Treasury remains committed to and supportive of the digital asset industry’s integrity.\"\nThe Department of State said that Garantex processed over $96 billion in cryptocurrency transactions between April 2019 and March 2025.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nGrinex exchange suspected rebrand of sanctioned Garantex crypto firm\nFBI warns of scammers posing as crypto exchange employees\nUS sanctions North Korean firm, nationals behind IT worker schemes\nHacker steals $27 million in BigONE exchange crypto breach\nPro-Israel hackers hit Iran's Nobitex exchange, burn $90M in crypto"
    },
    {
        "Title": "RealDefense Opens $10M Fund to Help OEMs Monetize Installs With SmartScan Cybersecurity SDK",
        "Link": "https://www.darkreading.com/endpoint-security/realdefense-opens-10m-fund-smartscan-cybersecurity-sdk",
        "Summary": "No summary available",
        "Date": "2025-08-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/realdefense-opens-10m-fund-smartscan-cybersecurity-sdk"
    },
    {
        "Title": "New Crypto24 Ransomware Attacks Bypass EDR",
        "Link": "https://www.darkreading.com/cybersecurity-operations/crypto24-ransomware-bypass-edr",
        "Summary": "While several cybercrime groups have embraced &quot;EDR killers,&quot; researchers say the deep knowledge and technical skills demonstrated by Crypto24 signify a dangerous escalation.",
        "Date": "2025-08-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/crypto24-ransomware-bypass-edr"
    },
    {
        "Title": "Colt Telecommunications Struggles in Wake of Cyber Incident",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/colt-telecommunications-cyber-incident",
        "Summary": "The UK telco said it temporarily took some systems offline as a &quot;protective&quot; measure in its investigation.",
        "Date": "2025-08-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/colt-telecommunications-cyber-incident"
    },
    {
        "Title": "Using Security Expertise to Bridge the Communication Gap",
        "Link": "https://www.darkreading.com/cybersecurity-operations/using-security-expertise-bridge-communication-gap",
        "Summary": "Cybersecurity-focused leadership delivers better products and business outcomes.",
        "Date": "2025-08-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/using-security-expertise-bridge-communication-gap"
    },
    {
        "Title": "Water Systems Under Attack: Norway, Poland Blame Russia Actors",
        "Link": "https://www.darkreading.com/ics-ot-security/water-systems-attack-norway-poland-russia-actors",
        "Summary": "Water and wastewater systems have become a favored target of nation-state actors, drawing increasing scrutiny following attacks on systems in multiple countries.",
        "Date": "2025-08-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/ics-ot-security/water-systems-attack-norway-poland-russia-actors"
    },
    {
        "Title": "Mobile Phishers Target Brokerage Accounts in ‘Ramp and Dump’ Cashout Scheme",
        "Link": "https://krebsonsecurity.com/2025/08/mobile-phishers-target-brokerage-accounts-in-ramp-and-dump-cashout-scheme/",
        "Summary": "Cybercriminal groups peddling sophisticated phishing kits that convert stolen card data into mobile wallets have recently shifted their focus to targeting customers of brokerage services, new research shows. Undeterred by security controls at these trading platforms that block users from wiring funds directly out of accounts, the phishers have pivoted to using multiple compromised brokerage accounts in unison to manipulate the prices of foreign stocks.",
        "Date": "2025-08-15",
        "Content": "Cybercriminal groups peddling sophisticated phishing kits that convert stolen card data into mobile wallets have recently shifted their focus to targeting customers of brokerage services, new research shows. Undeterred by security controls at these trading platforms that block users from wiring funds directly out of accounts, the phishers have pivoted to using multiple compromised brokerage accounts in unison to manipulate the prices of foreign stocks.\nImage: Shutterstock, WhataWin.\nThis so-called ‘ramp and dump‘ scheme borrows its name from age-old “pump and dump” scams, wherein fraudsters purchase a large number of shares in some penny stock, and then promote the company in a frenzied social media blitz to build up interest from other investors. The fraudsters dump their shares after the price of the penny stock increases to some degree, which usually then causes a sharp drop in the value of the shares for legitimate investors.\nWith ramp and dump, the scammers do not need to rely on ginning up interest in the targeted stock on social media. Rather, they will preposition themselves in the stock that they wish to inflate, using compromised accounts to purchase large volumes of it and then dumping the shares after the stock price reaches a certain value. In February 2025, the FBI said it was seeking information from victims of this scheme.\n“In this variation, the price manipulation is primarily the result of controlled trading activity conducted by the bad actors behind the scam,” reads an advisory from the Financial Industry Regulatory Authority (FINRA), a private, non-profit organization that regulates member brokerage firms. “Ultimately, the outcome for unsuspecting investors is the same—a catastrophic collapse in share price that leaves investors with unrecoverable losses.”\nFord Merrill is a security researcher at SecAlliance, a CSIS Security Group company. Merrill said he has tracked recent ramp-and-dump activity to a bustling Chinese-language community that is quite openly selling advanced mobile phishing kits on Telegram.\n“They will often coordinate with other actors and will wait until a certain time to buy a particular Chinese IPO [initial public offering] stock or penny stock,” said Merrill, who has been chronicling the rapid maturation and growth of the China-based phishing community over the past three years.\n“They’ll use all these victim brokerage accounts, and if needed they’ll liquidate the account’s current positions, and will preposition themselves in that instrument in some account they control, and then sell everything when the price goes up,” he said. “The victim will be left with worthless shares of that equity in their account, and the brokerage may not be happy either.”\nMerrill said the early days of these phishing groups — between 2022 and 2024 — were typified by phishing kits that used text messages to spoof the U.S. Postal Service or some local toll road operator, warning about a delinquent shipping or toll fee that needed paying. Recipients who clicked the link and provided their payment information at a fake USPS or toll operator site were then asked to verify the transaction by sharing a one-time code sent via text message.\nIn reality, the victim’s bank is sending that code to the mobile number on file for their customer because the fraudsters have just attempted to enroll that victim’s card details into a mobile wallet. If the visitor supplies that one-time code, their payment card is then added to a new mobile wallet on an Apple or Google device that is physically controlled by the phishers.\nThe phishing gangs typically load multiple stolen cards to digital wallets on a single Apple or Android device, and then sell those phones in bulk to scammers who use them for fraudulent e-commerce and tap-to-pay transactions.\nAn image from the Telegram channel for a popular Chinese mobile phishing kit vendor shows 10 mobile phones for sale, each loaded with 4-6 digital wallets from different financial institutions.\nThis China-based phishing collective exposed a major weakness common to many U.S.-based financial institutions that already require multi-factor authentication: The reliance on a single, phishable one-time token for provisioning mobile wallets. Happily, Merrill said many financial institutions that were caught flat-footed on this scam two years ago have since strengthened authentication requirements for onboarding new mobile wallets (such as requiring the card to be enrolled via the bank’s mobile app).\nBut just as squeezing one part of a balloon merely forces the air trapped inside to bulge into another area, fraudsters don’t go away when you make their current enterprise less profitable: They just shift their focus to a less-guarded area. And lately, that gaze has settled squarely on customers of the major brokerage platforms, Merrill said.\nMerrill pointed to several Telegram channels operated by some of the more accomplished phishing kit sellers, which are full of videos demonstrating how every feature in their kits can be tailored to the attacker’s target. The video snippet below comes from the Telegram channel of “Outsider,” a popular Mandarin-speaking phishing kit vendor whose latest offering includes a number of ready-made templates for using text messages to phish brokerage account credentials and one-time codes.\nAccording to Merrill, Outsider is a woman who previously went by the handle “Chenlun.” KrebsOnSecurity profiled Chenlun’s phishing empire in an October 2023 story about a China-based group that was phishing mobile customers of more than a dozen postal services around the globe. In that case, the phishing sites were using a Telegram bot that sent stolen credentials to the “@chenlun” Telegram account.\nChenlun’s phishing lures are sent via Apple’s iMessage and Google’s RCS service and spoof one of the major brokerage platforms, warning that the account has been suspended for suspicious activity and that recipients should log in and verify some information. The missives include a link to a phishing page that collects the customer’s username and password, and then asks the user to enter a one-time code that will arrive via SMS.\nThe new phish kit videos on Outsider’s Telegram channel only feature templates for Schwab customers, but Merrill said the kit can easily be adapted to target other brokerage platforms. One reason the fraudsters are picking on brokerage firms, he said, has to do with the way they handle multi-factor authentication.\nSchwab clients are presented with two options for second factor authentication when they open an account. Users who select the option to only prompt for a code on untrusted devices can choose to receive it via text message, an automated inbound phone call, or an outbound call to Schwab. With the “always at login” option selected, users can choose to receive the code through the Schwab app, a text message, or a Symantec VIP mobile app.\nIn response to questions, Schwab said it regularly updates clients on emerging fraud trends, including this specific type, which the company addressed in communications sent to clients earlier this year.\nThe 2FA text message from Schwab warns recipients against giving away their one-time code.\n“That message focused on trading-related fraud, highlighting both account intrusions and scams conducted through social media or messaging apps that deceive individuals into executing trades themselves,” Schwab said in a written statement. “We are aware and tracking this trend across several channels, as well as others like it, which attempt to exploit SMS-based verification with stolen credentials. We actively monitor for suspicious patterns and take steps to disrupt them. This activity is part of a broader, industry-wide threat, and we take a multi-layered approach to address and mitigate it.”\nOther popular brokerage platforms allow similar methods for multi-factor authentication. Fidelity requires a username and password on initial login, and offers the ability to receive a one-time token via SMS, an automated phone call, or by approving a push notification sent through the Fidelity mobile app. However, all three of these methods for sending one-time tokens are phishable; even with the brokerage firm’s app, the phishers could prompt the user to approve a login request that they initiated in the app with the phished credentials.\nVanguard offers customers a range of multi-factor authentication choices, including the option to require a physical security key in addition to one’s credentials on each login. A security key implements a robust form of multi-factor authentication known as Universal 2nd Factor (U2F), which allows the user to complete the login process simply by connecting an enrolled USB or Bluetooth device and pressing a button. The key works without the need for any special software drivers, and the nice thing about it is your second factor cannot be phished.\nMerrill said that in many ways the ramp-and-dump scheme is the perfect crime because it leaves precious few connections between the victim brokerage accounts and the fraudsters.\n“It’s really genius because it decouples so many things,” he said. “They can buy shares [in the stock to be pumped] in their personal account on the Chinese exchanges, and the price happens to go up. The Chinese or Hong Kong brokerages aren’t going to see anything funky.”\nMerrill said it’s unclear exactly how those perpetrating these ramp-and-dump schemes coordinate their activities, such as whether the accounts are phished well in advance or shortly before being used to inflate the stock price of Chinese companies. The latter possibility would fit nicely with the existing human infrastructure these criminal groups already have in place.\nFor example, KrebsOnSecurity recently wrote about research from Merrill and other researchers showing the phishers behind these slick mobile phishing kits employed people to sit for hours at a time in front of large banks of mobile phones being used to send the text message lures. These technicians were needed to respond in real time to victims who were supplying the one-time code sent from their financial institution.\nThe ashtray says: You’ve been phishing all night.\n“You can get access to a victim’s brokerage with a one-time passcode, but then you sort of have to use it right away if you can’t set new security settings so you can come back to that account later,” Merrill said.\nThe rapid pace of innovations produced by these China-based phishing vendors is due in part to their use of artificial intelligence and large language models to help develop the mobile phishing kits, he added.\n“These guys are vibe coding stuff together and using LLMs to translate things or help put the user interface together,” Merrill said. “It’s only a matter of time before they start to integrate the LLMs into their development cycle to make it more rapid. The technologies they are building definitely have helped lower the barrier of entry for everyone.”\n\r\n         This entry was posted on Friday 15th of August 2025 02:27 PM \r\n         \nah, i remember watching something similar, but they used email phishing https://www.youtube.com/watch?v=S9aUwQ84NB8\n❤️ the Wilco reference beneath the picture of the cell phones!\nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "In Other News: Critical Zoom Flaw, City’s Water Threatened by Hack, $330 Billion OT Cyber Risk",
        "Link": "https://www.securityweek.com/in-other-news-critical-zoom-flaw-citys-water-threatened-by-hack-330-billion-ot-cyber-risk/",
        "Summary": "<p>Other noteworthy stories that might have slipped under the radar: Canada’s House of Commons hacked, Russia behind court system attack, Pennsylvania AG targeted in cyberattack.</p>\n<p>The post <a href=\"https://www.securityweek.com/in-other-news-critical-zoom-flaw-citys-water-threatened-by-hack-330-billion-ot-cyber-risk/\">In Other News: Critical Zoom Flaw, City&#8217;s Water Threatened by Hack, $330 Billion OT Cyber Risk</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/in-other-news-critical-zoom-flaw-citys-water-threatened-by-hack-330-billion-ot-cyber-risk/"
    },
    {
        "Title": "Tight Cybersecurity Budgets Accelerate the Shift to AI-Driven Defense",
        "Link": "https://www.securityweek.com/tight-cybersecurity-budgets-accelerate-the-shift-to-ai-driven-defense/",
        "Summary": "<p>With cybersecurity budgets strained, organizations are turning to AI-powered automation to plug staffing gaps, maintain defenses, and survive escalating threats.</p>\n<p>The post <a href=\"https://www.securityweek.com/tight-cybersecurity-budgets-accelerate-the-shift-to-ai-driven-defense/\">Tight Cybersecurity Budgets Accelerate the Shift to AI-Driven Defense</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/tight-cybersecurity-budgets-accelerate-the-shift-to-ai-driven-defense/"
    },
    {
        "Title": "Google Says Android pKVM Earns Highest Level of Security Assurance",
        "Link": "https://www.securityweek.com/google-says-android-pkvm-earns-highest-level-of-security-assurance/",
        "Summary": "<p>Android pKVM has achieved SESIP Level 5 certification, which means it’s resistant to highly skilled, motivated, and funded attackers.</p>\n<p>The post <a href=\"https://www.securityweek.com/google-says-android-pkvm-earns-highest-level-of-security-assurance/\">Google Says Android pKVM Earns Highest Level of Security Assurance</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/google-says-android-pkvm-earns-highest-level-of-security-assurance/"
    },
    {
        "Title": "Critical Flaws Patched in Rockwell FactoryTalk, Micro800, ControlLogix Products",
        "Link": "https://www.securityweek.com/critical-flaws-patched-in-rockwell-factorytalk-micro800-controllogix-products/",
        "Summary": "<p>Rockwell Automation has published several advisories describing critical and high-severity vulnerabilities affecting its products.</p>\n<p>The post <a href=\"https://www.securityweek.com/critical-flaws-patched-in-rockwell-factorytalk-micro800-controllogix-products/\">Critical Flaws Patched in Rockwell FactoryTalk, Micro800, ControlLogix Products</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/critical-flaws-patched-in-rockwell-factorytalk-micro800-controllogix-products/"
    },
    {
        "Title": "Cisco Patches Critical Vulnerability in Firewall Management Platform",
        "Link": "https://www.securityweek.com/cisco-patches-critical-vulnerability-in-firewall-management-platform/",
        "Summary": "<p>Cisco has released over 20 advisories as part of its August 2025 bundled publication for ASA, FMC and FTD products.</p>\n<p>The post <a href=\"https://www.securityweek.com/cisco-patches-critical-vulnerability-in-firewall-management-platform/\">Cisco Patches Critical Vulnerability in Firewall Management Platform</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cisco-patches-critical-vulnerability-in-firewall-management-platform/"
    },
    {
        "Title": "Major Turkish Crypto Exchange BtcTurk Allegedly Hacked for Nearly $50 Million",
        "Link": "https://dailydarkweb.net/major-turkish-crypto-exchange-btcturk-allegedly-hacked-for-nearly-50-million/",
        "Summary": "BtcTurk Pro, a prominent Turkish cryptocurrency exchange, is investigating a potential security breach after suspicious outflows totaling approximately $48 million were detected on August 14th 2025. As a major digital asset platform in Turkey with millions of users, the exchange has taken immediate action by temporarily suspending all cryptocurrency deposit and withdrawal operations. The incident [&#8230;]",
        "Date": "2025-08-15",
        "Content": "BtcTurk Pro, a prominent Turkish cryptocurrency exchange, is investigating a potential security breach after suspicious outflows totaling approximately $48 million were detected on August 14th 2025. As a major digital asset platform in Turkey with millions of users, the exchange has taken immediate action by temporarily suspending all cryptocurrency deposit and withdrawal operations. The incident has sent ripples through the cryptocurrency community, with security firms and users closely monitoring the developing situation.\nThe alarm was first raised by the blockchain security firm Cyvers Alerts, which identified significant and unusual movements of funds from wallets associated with BtcTurk. In response, the exchange acknowledged the “unusual technical issue” and assured users that its teams are conducting a thorough investigation. BtcTurk has emphasized that the majority of its assets are held securely in offline cold storage and that its robust financial structure far exceeds the affected amount, ensuring that user assets will not be impacted by this event.\nThe attackers were observed moving a diverse range of crypto assets across multiple blockchains in an apparent effort to launder the funds. While a full official list has not been released by the exchange, analysis of blockchain activity indicates the movement of several cryptocurrencies, including but not limited to Ethereum (ETH), Avalanche (AVAX), Arbitrum (ARB), Base (BASE), Optimism (OP), Mantle (MNT), Polygon (MATIC).\nTags:\nAVAX\nBlockchain\nBtcTurk\ncrypto exchange\ncryptocurrency\nCyberSecurity\nCyvers Alerts\nEthereum\nhack\nsecurity breach\nTurkey"
    },
    {
        "Title": "Karndean International LLC Allegedly Breached by Crypto24 Ransom Group",
        "Link": "https://dailydarkweb.net/karndean-international-llc-allegedly-breached-by-crypto24-ransom-group/",
        "Summary": "Karndean International, LLC, a prominent global supplier of luxury vinyl flooring, has allegedly become the latest victim of a significant cyberattack. The ransom group known as Crypto24 has claimed responsibility for the breach, targeting the US-based company known for its innovative and stylish flooring solutions sold in numerous countries. The attack puts the company&#8217;s sensitive [&#8230;]",
        "Date": "2025-08-15",
        "Content": "Karndean International, LLC, a prominent global supplier of luxury vinyl flooring, has allegedly become the latest victim of a significant cyberattack. The ransom group known as Crypto24 has claimed responsibility for the breach, targeting the US-based company known for its innovative and stylish flooring solutions sold in numerous countries. The attack puts the company’s sensitive corporate and personal data at risk, potentially impacting its operations, employees, and customer base.\nThe threat actors announced the data breach by publishing a notice claiming they have exfiltrated over 600GB of sensitive information from the company’s network, and have already leaked 300GB of it. According to their claims, the compromised files contain a wide array of confidential data. The group has listed the types of allegedly stolen information, which includes:\nFinancial information\nTechnical and operational data\nPersonal information of customers and employees\nStrategic business plans\nTags:\nCrypto24\ncyberattack\nCyberSecurity\ndata-breach\nKarndean\nransomware\nUnited States"
    },
    {
        "Title": "SFA Engineering Allegedly Hit by Ransomware Attack – 2.3TB of Data Leaked",
        "Link": "https://dailydarkweb.net/sfa-engineering-allegedly-hit-by-ransomware-attack-2-3tb-of-data-leaked/",
        "Summary": "South Korean industrial automation giant, SFA Engineering, has allegedly become the latest victim of a significant ransomware attack. The ransomware group known as &#8216;Underground&#8217; has claimed responsibility, posting the company on its data leak site on August 15, 2025. SFA Engineering is a major player in the industry, boasting a revenue of $1.7 billion, and [&#8230;]",
        "Date": "2025-08-15",
        "Content": "South Korean industrial automation giant, SFA Engineering, has allegedly become the latest victim of a significant ransomware attack. The ransomware group known as ‘Underground’ has claimed responsibility, posting the company on its data leak site on August 15, 2025. SFA Engineering is a major player in the industry, boasting a revenue of $1.7 billion, and specializes in manufacturing equipment for various high-tech sectors. The attackers claim to have exfiltrated 2.3 TBytes of sensitive data from the company’s network.\nThe alleged breach appears to be extensive and highly sensitive, compromising not only SFA Engineering’s internal operations but also the intellectual property and project details of its major international clients. The leaked data reportedly includes everything from financial documents and contracts to trade secrets and confidential drawings. Personal information such as Korean and Chinese passports, driver’s licenses, and medical certifications are also said to be included in the leak, alongside data from the personal computers of the company’s President, CEO, and other managers. This incident could have severe repercussions, impacting major corporations like Micron, Samsung Display Company, SK Hynix, and Northvolt, whose project documentation was allegedly compromised.\nThe list of allegedly stolen data includes:\nNEO AI development files\nKorean and Chinese passports, driver’s licenses, medical certifications, and Visas\nConfidential inspection reports and design reviews\nConfidential and private drawings and models\nTrade secrets and intellectual property of other companies\nFinance documents, contracts, agreements, and NDAs\nBusiness presentations and business plans for 2025\nProject documentation for clients such as Micron, Samsung Display Company, BOE, Northvolt, and SK Hynix\nPatent applications\nResearch and development for battery manufacturing\nData from personal computers of the company President, CEO, and other managers\nTags:\nCyberSecurity\ndata-breach\nindustrial\nManufacturing\nransomware\nSFA Engineering\nSouth Korea\nUnderground"
    },
    {
        "Title": "Plex Urges Users to Immediately Patch Critical Vulnerability in Media Server",
        "Link": "https://dailydarkweb.net/plex-urges-users-to-immediately-patch-critical-vulnerability-in-media-server/",
        "Summary": "Plex is strongly advising users to update their Plex Media Server software to the latest version, 1.42.1.10060, to patch a significant security flaw. The vulnerability affects versions 1.41.7.x through 1.42.0.x and could leave servers exposed to potential exploits. The company has been actively notifying users via email about the urgency of this update, a measure [&#8230;]",
        "Date": "2025-08-15",
        "Content": "Plex is strongly advising users to update their Plex Media Server software to the latest version, 1.42.1.10060, to patch a significant security flaw. The vulnerability affects versions 1.41.7.x through 1.42.0.x and could leave servers exposed to potential exploits. The company has been actively notifying users via email about the urgency of this update, a measure they rarely take, highlighting the seriousness of the issue. While the specific details of the vulnerability have not been publicly disclosed, the fact that it was reported through their bug bounty program suggests a credible and potentially severe threat.\nThe company’s proactive approach in alerting users underscores the importance of applying the patch without delay. Although no CVE-ID has been assigned to this vulnerability yet, users are encouraged to treat this with the utmost seriousness. Leaving the server unpatched could allow threat actors to reverse engineer the security fixes and develop exploits, potentially leading to unauthorized access or other malicious activities. This incident serves as a critical reminder of the importance of keeping all software up-to-date to mitigate security risks, especially for services that manage personal media collections.\nPlex, a popular media server software, allows users to organize and stream their personal video, music, and photo collections to various devices. Its widespread use makes its security a paramount concern for its large user base. The company has a history of addressing security issues, including a past incident where a vulnerability in Plex Media Server was exploited in a high-profile data breach at LastPass. Users can download the latest version from their server management page or the official Plex downloads website to ensure their media servers are protected against this new threat.\nTags:\nCyberSecurity\npatch\nPlex\nPlex Media Server\nsecurity\nupdate\nvulnerability"
    },
    {
        "Title": "French Cosmetics Giant Peggy Sage Allegedly Hit by Datacarry Ransomware Group",
        "Link": "https://dailydarkweb.net/french-cosmetics-giant-peggy-sage-allegedly-hit-by-datacarry-ransomware-group/",
        "Summary": "The prominent French cosmetics and beauty brand, Peggy Sage, has allegedly fallen victim to a cyberattack by the emerging ransomware group known as Datacarry. The perpetrators have reportedly exfiltrated a significant amount of data, releasing a 11.3 GB zip file containing the company&#8217;s sensitive information. This incident marks another high-profile attack by the Datacarry group, [&#8230;]",
        "Date": "2025-08-15",
        "Content": "The prominent French cosmetics and beauty brand, Peggy Sage, has allegedly fallen victim to a cyberattack by the emerging ransomware group known as Datacarry. The perpetrators have reportedly exfiltrated a significant amount of data, releasing a 11.3 GB zip file containing the company’s sensitive information. This incident marks another high-profile attack by the Datacarry group, which has been increasingly active in targeting organizations across various sectors.\nPeggy Sage is a well-established and respected name in the professional beauty industry, not only in its home country of France but also internationally. With a history stretching back decades, the company offers a wide range of products for nail care, makeup, skincare, and professional beauty training. Its clientele includes beauty professionals, salons, and individual consumers, making the potential scope of the compromised data particularly concerning. The brand’s importance lies in its long-standing reputation and its role as a key supplier and educator within the beauty sector.\nThe Datacarry ransom group is a relatively new entrant to the cybercrime scene, having reportedly emerged in May 2025. Despite its recent appearance, the group has quickly built a reputation for its aggressive tactics, employing a double-extortion model where they not only encrypt their victims’ files but also steal sensitive data and threaten to leak it publicly if their ransom demands are not met. The attack on Peggy Sage underscores the group’s continued targeting of commercial entities and their capability to breach the defenses of established companies. The full extent and specific contents of the leaked data have not been publicly detailed at this time.\nTags:\nbeauty industry\nCyberSecurity\ndata-breach\nDatacarry\nFrance\nPeggy Sage\nransomware"
    },
    {
        "Title": "Maselli Misure S.p.A. Allegedly Targeted by Sarcoma Ransomware Group",
        "Link": "https://dailydarkweb.net/maselli-misure-s-p-a-allegedly-targeted-by-sarcoma-ransomware-group/",
        "Summary": "The Sarcoma ransomware group has allegedly added Maselli Misure S.p.A. to its list of victims, claiming to have exfiltrated a significant amount of data. Maselli Misure is a prominent Italian family-owned business based in Parma, specializing in the design and manufacture of innovative optical technology for quality control analysis. With over 70 years in the [&#8230;]",
        "Date": "2025-08-15",
        "Content": "The Sarcoma ransomware group has allegedly added Maselli Misure S.p.A. to its list of victims, claiming to have exfiltrated a significant amount of data. Maselli Misure is a prominent Italian family-owned business based in Parma, specializing in the design and manufacture of innovative optical technology for quality control analysis. With over 70 years in the industry and a global network of partners, the company is a leading supplier of analytical instruments for critical sectors, including Food & Beverage, Pharmaceutical, Chemical, and Petro-Chemical industries.\nAccording to the claims made by the threat actors, a total of 49 GB of data was allegedly stolen from the company’s systems. The leak appears to contain highly sensitive corporate and personal information, posing a significant risk to the company, its employees, and its clients. The origin of this claim is a post from the ransomware group, which included sample files as proof of the breach. The exposed data reportedly includes a wide range of internal documents, from financial records to employee health information.\nThe leaked data allegedly includes:\nEmployee medical records and fitness-for-work assessments\nInternal risk assessment documents\nFinancial data and client information\nSQL databases\nTags:\nCyberSecurity\ndata-leak\nItaly\nMaselli Misure\nransomware\nSarcoma"
    },
    {
        "Title": "Qilin Ransomware Group Allegedly Breaches Morgenstern AG, MARMA Polskie Folie, and Fort Smith School District",
        "Link": "https://dailydarkweb.net/qilin-ransomware-group-allegedly-breaches-morgenstern-ag-marma-polskie-folie-and-fort-smith-school-district/",
        "Summary": "The Qilin ransomware group has allegedly claimed responsibility for a series of cyberattacks targeting three distinct organizations across Europe and the United States, leading to significant data breaches. The victims, operating in document solutions, industrial manufacturing, and public education, have reportedly had sensitive internal, client, and personal data exfiltrated and exposed. The attacks highlight a [&#8230;]",
        "Date": "2025-08-15",
        "Content": "The Qilin ransomware group has allegedly claimed responsibility for a series of cyberattacks targeting three distinct organizations across Europe and the United States, leading to significant data breaches. The victims, operating in document solutions, industrial manufacturing, and public education, have reportedly had sensitive internal, client, and personal data exfiltrated and exposed. The attacks highlight a troubling trend of targeting critical sectors with wide-ranging impacts on clients, employees, and students.\nAccording to the claims, the threat actors successfully compromised the networks of each organization despite public statements suggesting the situations were contained. In the case of German firm Morgenstern AG, a statement about repelling an attack is allegedly contradicted by the full-scale leak of its own and its clients’ confidential data. Similarly, Polish manufacturer MARMA Polskie Folie’s description of data leak risks as “hypothetical” is reportedly at odds with the exposure of detailed employee records, financial information, and proprietary technical processes. The most alarming alleged breach involves the Fort Smith School District in the US, where the personal files of over 13,000 students, including addresses and family information, have been purportedly compromised.\nThe alleged victims of the Qilin ransomware group include:\n🇩🇪\nMorgenstern AG:\nA German company specializing in comprehensive print and document management solutions, including digital workspace implementation for a wide range of business clients. The breach allegedly exposed the company’s internal financial data and the confidential documents of dozens of its corporate clients.\n🇵🇱\nMARMA Polskie Folie:\nOne of Europe’s largest plastics processors, manufacturing products for agriculture, construction, and packaging with over 1,000 employees. The alleged leak includes extensive personal data for every employee and client, confidential financial information, and detailed descriptions of proprietary manufacturing technologies.\n🇺🇸\nFort Smith School District:\nA major public school district in Arkansas, USA, serving over 13,000 students across 28 schools. The attack has allegedly resulted in the public release of every student’s personnel file, including academic records, home addresses, and parent information, as well as sensitive financial records detailing sponsor contributions and district expenditures.\nTags:\ncyberattack\ndata-breach\nEducation\nFort Smith School District\nGermany\nManufacturing\nMARMA Polskie Folie\nMorgenstern AG\nPoland\nQilin\nransomware\nUSA"
    }
]