[
    {
        "Title": "Google is adding \"Projects\" feature to Gemini to run research tasks",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/google-is-adding-projects-feature-to-gemini-to-run-research-tasks/",
        "Summary": "Google's Gemini is now testing a new feature called \"Projects.\" This will be similar to OpenAI's Project Feature for ChatGPT. [...]",
        "Date": "2025-08-17",
        "Content": "Google's Gemini is now\ntesting\na new feature called \"Projects.\" This will be similar to OpenAI's Project Feature for ChatGPT.\nWith Projects, you can add files, documents or your code. Then, you can ask Gemini to reference those files in project conversations.\nGoogle describes this as a feature where you \"start by adding files to the project. Gemini can reference these files in project conversations and use them to generate new documents and code.\"\nWith Projects, you can group similar tasks together and create your own workplace within Gemini.\nIt's unclear when the feature will begin rolling out, but it could be limited to enterprise customers initially.\nIn addition to Projects, Google is working on Gemini 3, which would be the company's most powerful model to date, and it could deliver a big blow to OpenAI.\nGoogle rolls out Genie 3\nGoogle recently\nannounced\nGenie 3, which is developed by Google DeepMind, the same team behind Gemini.\nWith Genie 3, you can simulate the real world and turn a text prompt into a new, playable, interactive world you can move through in real time.\nAs one user on Reddit\nfound\n, you can even look down and see how you're walking in a world simulation created using Genie 3.\nGenie 3 also generates a real human walking in the simulated world\nGoogle says Genie 3 renders the world at 720p and 24 fps, and keeps the scene physically consistent for several minutes.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nGoogle Gemini's Deep Research is finally coming to API\nGoogle rolls out text-to-image model Imagen 4 for free\nGoogle Calendar invites let researchers hijack Gemini to leak user data\nFlaw in Gemini CLI AI coding assistant allowed stealthy code execution\nGoogle Gemini flaw hijacks email summaries for phishing"
    },
    {
        "Title": "U.S. seizes $2.8 million in crypto from Zeppelin ransomware operator",
        "Link": "https://www.bleepingcomputer.com/news/security/us-seizes-28-million-in-crypto-from-zeppelin-ransomware-operator/",
        "Summary": "The U.S. Department of Justice (DoJ) announced the seizure of over $2,800,000 in cryptocurrency from alleged ransomware operator Ianis Aleksandrovich Antropenko. [...]",
        "Date": "2025-08-17",
        "Content": "The U.S. Department of Justice (DoJ) announced the seizure of more than $2.8 million in cryptocurrency from suspected ransomware operator Ianis Aleksandrovich Antropenko.\nAntropenko, indicted in Texas for computer fraud and money laundering, was linked to Zeppelin ransomware, a now-defunct extortion operation that ran between 2019 and 2022.\nApart from the digital asset seizure, the authorities also confiscated $70,000 in cash and a luxury vehicle.\n“Antropenko used Zeppelin ransomware to target and attack a wide range of individuals, businesses, and organizations worldwide, including in the United States,”\nreads the U.S. DoJ announcement\n.\n“Specifically, Antropenko and his coconspirators would encrypt and exfiltrate the victim’s data, and typically demand a ransom payment to decrypt the victim’s data, refrain from publishing it, or to arrange the data’s deletion.”\nAfter receiving the ransom payments, Antropenko attempted to launder the amounts on the coin tumbling service ChipMixer,\nseized by authorities\nin March 2023.\nOther money laundering methods Antropenko used include crypto-to-cash exchanges and structured deposits, meaning breaking large sums into smaller deposits to avoid bank reporting rules.\nThe Zeppelin ransomware came into existence\nin late 2019\nas a new variant of the VegaLocker/Buran ransomware, targeting healthcare and IT firms through\nMSP software flaws\n.\nIn 2021, following a period of dormancy, Zeppelin operators\nreturned with updated versions\n, though the encryption scheme used in subsequent attacks\nindicated sloppiness\n.\nBy November 2022 the Zeppelin operation was essentially defunct. It was revealed at that time that security researchers from Unit221b had the decryption key to help victims\nrecover files for free\nsince early 2020.\nIn January 2024, news came out suggesting that the Zeppelin ransomware source code was\nsold on a hacking forum\nfor just $500.\nThe indictment against Antropenko shows that evidence can lead to unmasking ransomware operators even years after halting their cybercriminal activities.\nThe seizure of the $2.8 million believed to be from ransom proceeds follows other similar actions that the U.S. authorities announced recently, including the confiscation of cryptocurrency worth\n$1 million from BlackSuit ransomware\nand $2.4 million worth of\nBitcoin from Chaos ransomware\n.\nSeizing crime proceeds is vital in the fight against ransomware, especially in cases where no arrests are made, as it prevents operators and affiliates from using those funds to rebuild infrastructure or recruit new members.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nUS govt seizes $1 million in crypto from BlackSuit ransomware gang\nOver $300 million in cybercrime crypto seized in anti-fraud effort\nRoyal and BlackSuit ransomware gangs hit over 450 US companies\nFBI seizes $2.4M in Bitcoin from new Chaos ransomware operation\nBlackSuit ransomware extortion sites seized in Operation Checkmate"
    },
    {
        "Title": "Anthropic: Claude can now end conversations to prevent harmful uses",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/anthropic-claude-can-now-end-conversations-to-prevent-harmful-uses/",
        "Summary": "OpenAI rival Anthropic says Claude has been updated with a rare new feature that allows the AI model to end conversations when it feels it poses harm or is being abused. [...]",
        "Date": "2025-08-17",
        "Content": "OpenAI rival Anthropic says Claude has been updated with a rare new feature that allows the AI model to end conversations when it feels it poses harm or is being abused.\nThis only applies to Claude Opus 4 and 4.1, the two most powerful models available via paid plans and API. On the other hand, Claude Sonnet 4, which is the company's most used model, won't be getting this feature.\nAnthropic describes this move as a \"model welfare.\"\n\"In\npre-deployment testing of Claude Opus 4\n, we included a preliminary model welfare assessment,\" Anthropic noted.\n\"As part of that assessment, we investigated Claude’s self-reported and behavioral preferences, and found a robust and consistent aversion to harm.\"\nClaude does not plan to give up on the conversations when it's unable to handle the query. Ending the conversation will be the last resort when Claude's attempts to redirect users to useful resources have failed.\n\"The scenarios where this will occur are extreme edge cases—the vast majority of users will not notice or be affected by this feature in any normal product use, even when discussing highly controversial issues with Claude,\" the company added.\nSource: BleepingComputer\nAs you can see in the above screenshot, you can also explicitly ask Claude to end a chat. Claude uses end_conversation tool to end a chat.\nThis feature is now rolling out.\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nGet the Blue Report 2025\nRelated Articles:\nClaude gets 1M tokens support via API to take on Gemini 2.5 Pro\nAnthropic says OpenAI engineers using Claude Code ahead of GPT-5 launch\nOpenAI, Anthropic, Google may disrupt education market with new AI tools\nxAI prepares Grok 4 Code as it plans to take on Claude and Gemini\nClaude catches up to ChatGPT with built-in memory support"
    }
]