[
    {
        "Title": "NVIDIA Triton Bugs Let Unauthenticated Attackers Execute Code and Hijack AI Servers",
        "Link": "https://thehackernews.com/2025/08/nvidia-triton-bugs-let-unauthenticated.html",
        "Summary": "A newly disclosed set of security flaws in NVIDIA's Triton Inference Server for Windows and Linux, an open-source platform for running artificial intelligence (AI) models at scale, could be exploited to take over susceptible servers.\n\"When chained together, these flaws can potentially allow a remote, unauthenticated attacker to gain complete control of the server, achieving remote code execution",
        "Date": "2025-08-04",
        "Content": "A newly disclosed set of security flaws in\nNVIDIA's Triton Inference Server\nfor Windows and Linux, an open-source platform for running artificial intelligence (AI) models at scale, could be exploited to take over susceptible servers.\n\"When chained together, these flaws can potentially allow a remote, unauthenticated attacker to gain complete control of the server, achieving remote code execution (RCE),\" Wiz researchers Ronen Shustin and Nir Ohfeld\nsaid\nin a report published today.\nThe\nvulnerabilities\nare listed below -\nCVE-2025-23319\n(CVSS score: 8.1) - A vulnerability in the Python backend, where an attacker could cause an out-of-bounds write by sending a request\nCVE-2025-23320\n(CVSS score: 7.5) - A vulnerability in the Python backend, where an attacker could cause the shared memory limit to be exceeded by sending a very large request\nCVE-2025-23334\n(CVSS score: 5.9) - A vulnerability in the Python backend, where an attacker could cause an out-of-bounds read by sending a request\nSuccessful exploitation of the aforementioned vulnerabilities could result in information disclosure, as well as remote code execution, denial of service, data tampering in the case of CVE-2025-23319. The issues have been addressed in version 25.07.\nThe cloud security company said the three shortcomings could be combined together that transforms the problem from an information leak to a full system compromise without requiring any credentials.\nSpecifically, the problems are rooted in the Python backend that's designed to handle inference requests for Python models from any major AI frameworks such as PyTorch and TensorFlow.\nIn the attack outlined by Wiz, a threat actor could exploit CVE-2025-23320 to leak the full, unique name of the backend's internal IPC shared memory region, a key that should have remained private, and then leverage the remaining two flaws to gain full control of the inference server.\n\"This poses a critical risk to organizations using Triton for AI/ML, as a successful attack could lead to the theft of valuable AI models, exposure of sensitive data, manipulating the AI model's responses, and a foothold for attackers to move deeper into a network,\" the researchers said.\nNVIDIA's August bulletin for Triton Inference Server also highlights fixes for three critical bugs (CVE-2025-23310, CVE-2025-23311, and CVE-2025-23317) that, if successfully exploited, could result in remote code execution, denial of service, information disclosure, and data tampering.\nWhile there is no evidence that any of these vulnerabilities have been exploited in the wild, users are advised to apply the latest updates for optimal protection.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Vietnamese Hackers Use PXA Stealer, Hit 4,000 IPs and Steal 200,000 Passwords Globally",
        "Link": "https://thehackernews.com/2025/08/vietnamese-hackers-use-pxa-stealer-hit.html",
        "Summary": "Cybersecurity researchers are calling attention to a new wave of campaigns distributing a Python-based information stealer called PXA Stealer.\nThe malicious activity has been assessed to be the work of Vietnamese-speaking cybercriminals who monetize the stolen data through a subscription-based underground ecosystem that automates the resale and reuse via Telegram APIs, according to a joint",
        "Date": "2025-08-04",
        "Content": "Cybersecurity researchers are calling attention to a new wave of campaigns distributing a Python-based information stealer called PXA Stealer.\nThe malicious activity has been assessed to be the work of Vietnamese-speaking cybercriminals who monetize the stolen data through a subscription-based underground ecosystem that automates the resale and reuse via Telegram APIs, according to a joint report published by Beazley Security and SentinelOne and shared with The Hacker News.\n\"This discovery showcases a leap in tradecraft, incorporating more nuanced anti-analysis techniques, non-malicious decoy content, and a hardened command-and-control pipeline that frustrates triage and attempts to delay detection,\" security researchers Jim Walter, Alex Delamotte, Francisco Donoso, Sam Mayers, Tell Hause, and Bobby Venal\nsaid\n.\nThe campaigns have infected over 4,000 unique IP addresses spanning 62 countries, including South Korea, the United States, the Netherlands, Hungary, and Austria. Data captured via the stealer includes more than 200,000 unique passwords, hundreds of credit card records, and more than 4 million harvested browser cookies.\nPXA Stealer was\nfirst documented\nby Cisco Talos in November 2024, attributing it to attacks targeting government and education entities in Europe and Asia. It's capable of harvesting passwords, browser autofill data, information from cryptocurrency wallets and financial institutions.\nData stolen by the malware using Telegram as an exfiltration channel is fed into criminal platforms like Sherlock, a purveyor of stealer logs, from where downstream threat actors can purchase the information to engage in cryptocurrency theft or infiltrate organizations for follow-on purposes, fueling a cybercriminal ecosystem that runs at scale.\nCampaigns distributing the malware in 2025 have witnessed a steady tactical evolution, with the threat actors employing DLL side-loading techniques and elaborate staging layers in an effort to fly under the radar.\nThe malicious DLL takes care of conducting the rest of the steps in the infection sequence, ultimately paving the way for the deployment of the stealer, but not before taking steps to display a decoy document, such as a copyright infringement notice, to the victim.\nThe stealer is an updated version boasting capabilities to extract cookies from Chromium-based web browsers by injecting a DLL into running instances with an aim to defeat\napp-bound encryption safeguards\n. It also plunders data from VPN clients, cloud command-line interface (CLI) utilities, connected fileshares, and applications like Discord.\n\"PXA Stealer uses the BotIDs (stored as TOKEN_BOT) to establish the link between the main bot and the various ChatID (stored as CHAT_ID),\" the researchers said. \"The ChatIDs are Telegram channels with various properties, but they primarily serve to host exfiltrated data and provide updates and notifications to the operators.\"\n\"This threat has since matured into a highly evasive, multi-stage operation driven by Vietnamese-speaking actors with apparent ties to an organized cybercriminal Telegram-based marketplace that sells stolen victim data.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "⚡ Weekly Recap: VPN 0-Day, Encryption Backdoor, AI Malware, macOS Flaw, ATM Hack & More",
        "Link": "https://thehackernews.com/2025/08/weekly-recap-vpn-0-day-encryption.html",
        "Summary": "Malware isn’t just trying to hide anymore—it’s trying to belong. We’re seeing code that talks like us, logs like us, even documents itself like a helpful teammate. Some threats now look more like developer tools than exploits. Others borrow trust from open-source platforms, or quietly build themselves out of AI-written snippets. It’s not just about being malicious—it’s about being believable.",
        "Date": "2025-08-04",
        "Content": "Malware isn't just trying to hide anymore—it's trying to belong. We're seeing code that talks like us, logs like us, even documents itself like a helpful teammate. Some threats now look more like developer tools than exploits. Others borrow trust from open-source platforms, or quietly build themselves out of AI-written snippets. It's not just about being malicious—it's about being believable.\nIn this week's cybersecurity recap, we explore how today's threats are becoming more social, more automated, and far too sophisticated for yesterday's instincts to catch.\n⚡ Threat of the Week\nSecret Blizzard Conduct ISP-Level AitM Attacks to Deploy ApolloShadow\n— Russian cyberspies are abusing local internet service providers' networks to target foreign embassies in Moscow and likely collect intelligence from diplomats' devices. The activity has been attributed to the Russian advanced persistent threat (APT) known as Secret Blizzard (aka Turla). It likely involves using an adversary-in-the-middle (AiTM) position within domestic telecom companies and ISPs that diplomats are using for Internet access to push a piece of malware called ApolloShadow. This indicates that the ISP may be\nworking\nwith the threat actor to facilitate the attacks using the System for Operative Investigative activities (SORM) systems. Microsoft declined to say how many organizations were targeted, or successfully infected, in this campaign.\nInside the 2025 Security Shift: What Every Cloud Leader Must Know Now\nCloud security is shifting fast. Sysdig's 2025 Cloud Defense Report shows how AI tools like Sysdig Sage™ cut response time by 76%, while runtime security and open source tools like Falco reshape defense. Get insights and strategies to stay ahead.\nGet the report ➝\n🔔 Top News\nCompanies that Employed Hafnium Hackers Linked to Over a Dozen Patents\n— Threat actors linked to the notorious Hafnium hacking group have worked for companies that registered several patents for highly intrusive forensics and data collection technologies. The findings highlight China's diverse private sector offensive ecosystem and an underlying problem with mapping tradecraft to a specific cluster, which may not accurately reflect the true organizational structure of the attackers. The fact that the threat actors have been attributed to three different companies shows that multiple companies may be working in tandem to conduct the intrusions and those companies may be providing their tools to other actors, leading to incomplete or misleading attribution. It's currently not known how the threat actors came to possess the Microsoft Exchange Server flaws that were used to target various entities in a widespread campaign in early 2021. But their close relationship with the Shanghai State Security Bureau (SSSB) has raised the possibility that the bureau may have obtained access to information about the zero-days through some evidence collection method and passed it on to the attackers. The discovery also highlights another important aspect: China-based Advanced Persistent Threats (APTs) may actually consist of different companies that serve many clients owing to the contracting ecosystem, which forces these companies to collaborate on intrusions. In June 2025, Recorded Future\nrevealed\nthat a Chinese state-owned defense research institute filed a patent in late December 2024 that analyzes various kinds of intelligence, including OSINT, HUMINT, SIGINT, GEOINT, and TECHINT, to train a military-specific large language model in order to \"support every phase of the intelligence cycle and improve decision-making during military operations.\"\nLikely 0-Day SonicWall SSL VPN Flaw Used in Akira Ransomware Attacks\n— SonicWall SSL VPN devices have become the target of Akira ransomware attacks as part of a newfound surge in activity observed in late July 2025. Arctic Wolf Labs said that the attacks could be exploiting an as-yet-undetermined security flaw in the appliances, meaning a zero-day vulnerability, given that some of the incidents affected fully-patched SonicWall devices. However, the possibility of credential-based attacks for initial access hasn't been ruled out. The development came as watchTowr Labs detailed multiple vulnerabilities in SonicWall SMA 100 Series appliances (\nCVE-2025-40596, CVE-2025-40597, and CVE-2025-40598\n) that an attacker could exploit to cause denial-of-service or code execution. \"We stumbled across vulnerabilities that feel like they were preserved in amber from a more naïve era of C programming,\" security researcher Sina Kheirkhah\nsaid\n. \"While we understand (and agree) that these vulnerabilities are ultimately difficult - or in some cases, currently not exploitable – the fact that they exist at all is, frankly, disappointing. Pre-auth stack and heap overflows triggered by malformed HTTP headers aren't supposed to happen anymore.\"\nUNC2891 Breaches ATM Network via 4G Raspberry Pi in Cyber-Physical Attack\n— The threat actor known as UNC2891 has been observed targeting Automatic Teller Machine (ATM) infrastructure using a 4G-equipped Raspberry Pi as part of a covert attack. The cyber-physical attack involved the adversary leveraging their physical access to install the Raspberry Pi device and have it connected directly to the same network switch as the ATM, effectively placing it within the target bank's network. The end goal of the infection was to deploy the CAKETAP rootkit on the ATM switching server and facilitate fraudulent ATM cash withdrawals. UNC2891 is assessed to share tactical overlaps with another threat actor called UNC1945 (aka LightBasin), which was previously identified compromising managed service providers and striking targets within the financial and professional consulting industries. UNC1945 is also known for its attacks aimed at the telecom sector.\nActive Exploitation of Alone WordPress Theme Flaw\n— Threat actors are actively exploiting a critical security flaw in \"Alone – Charity Multipurpose Non-profit WordPress Theme\" to take over susceptible sites. The vulnerability, tracked as CVE-2025-5394 (CVSS score: 9.8), is an arbitrary file upload affecting all versions of the plugin prior to and including 7.8.3. It has been fixed in version 7.8.5 released on June 16, 2025. In the observed attacks, the flaw is averaged to upload a ZIP archive containing a PHP-based backdoor to execute remote commands and upload additional files. Alternatively, the flaw has also been weaponized to deliver fully-featured file managers and backdoors capable of creating rogue administrator accounts.\nMultiple Flaws Patched in AI Code Editor Cursor\n— Several security vulnerabilities have been addressed in Cursor, including one high-severity bug (CVE-2025-54135 aka CurXecute) that could result in remote code execution (RCE) when processing external content from a third-party model context protocol (MCP) server. \"If chained with a separate prompt injection vulnerability, this could allow the writing of sensitive MCP files on the host by the agent,\" Cursor\nsaid\n. \"This can then be used to directly execute code by adding it as a new MCP server.\" Also addressed in Cursor version 1.3 is CVE-2025-54136 (CVSS score of 7.2), which could have allowed attackers to swap harmless MCP configuration files for a malicious command, without triggering a warning. \"If an attacker has write permissions on a user's active branches of a source repository that contains existing MCP servers the user has previously approved, or an attacker has arbitrary file-write locally, the attacker can achieve arbitrary code execution,\" the company\nsaid\n.\n‎️‍🔥 Trending CVEs\nHackers are quick to jump on newly discovered software flaws – sometimes within hours. Whether it's a missed update or a hidden bug, even one unpatched CVE can open the door to serious damage. Below are this week's high-risk vulnerabilities making waves. Review the list, patch fast, and stay a step ahead.\nThis week's list includes —\nCVE-2025-7340, CVE-2025-7341, CVE-2025-7360\n(HT Contact Form plugin),\nCVE-2025-54782\n(@nestjs/devtools-integration),\nCVE-2025-54418\n(CodeIgniter4),\nCVE‑2025‑4421, CVE‑2025‑4422, CVE‑2025‑4423, CVE‑2025‑4424, CVE‑2025‑4425, CVE‑2025‑4426\n(\nLenovo\n),\nCVE-2025-6982\n(TP-Link Archer C50),\nCVE-2025-2297\n(BeyondTrust Privilege Management for Windows),\nCVE-2025-5394\n(Alone theme),\nCVE-2025-2523\n(Honeywell Experion PKS),\nCVE-2025-54576\n(OAuth2-Proxy),\nCVE-2025-46811\n(SUSE),\nCVE-2025-6076, CVE-2025-6077, and CVE-2025-6078\n(Partner Software).\n📰 Around the Cyber World\nCritical RCE in @nestjs/devtools-integration\n— A critical remote code execution flaw (CVE-2025-54782, CVSS score: 9.4) has been uncovered in @nestjs/devtools-integration, a NestJS npm package downloaded over 56,000 times per week. The package sets up a local development server with an endpoint that executes arbitrary code inside a JavaScript \"sandbox\" built with node:vm module and the now-abandoned safe-eval, ultimately allowing for execution of untrusted user code in a sandboxed environment, Socket\nsaid\n. Further analysis has found that the sandbox is trivially escapable and because the server is\naccessible on localhost\n, any malicious website can trigger code execution on a developer's machine via CSRF using the inspector/graph/interact endpoint. \"Due to improper sandboxing and missing cross-origin protections, any malicious website visited by a developer can execute arbitrary code on their local machine,\" Nestjs maintainer Kamil Mysliwiec\nsaid\nin an advisory. \"By chaining these issues, a malicious website can trigger the vulnerable endpoint and achieve arbitrary code execution on a developer's machine running the NestJS devtools integration.\"\nAttackers Exploit Compromised Email Accounts for Attacks\n— Threat actors are increasingly using compromised internal or trusted business partner email accounts to send malicious emails to obtain initial access. \"Using a legitimate trusted account affords an attacker numerous advantages, such as potentially bypassing an organization's security controls as well as appearing more trustworthy to the recipient,\" Talos\nsaid\n. The disclosure comes as bad actors are also\ncontinuing to exploit\nMicrosoft 365's Direct Send feature to deliver phishing emails that appear to originate from within the organization by using a spoofed internal From address and increases the likelihood of success of social engineering attacks. The messages are injected into Microsoft 365 tenants via unsecured third-party email security appliances used as SMTP relays. \"This tactic allows attackers to send malicious payloads to Microsoft 365 users with increased credibility, often resulting in successful delivery despite failed authentication checks,\" Proofpoint\nsaid\n.\nSignal Warns it Will Exit Australia Over Encryption Backdoor Push\n— Signal Foundation president Meredith Whittaker\nsaid\nthe secure messaging application will leave Australia if the government forces it to incorporate a backdoor into its encryption algorithm or demand access to encrypted user data. Earlier this year, the U.K. government issued a secret order demanding that Apple allow it access to encrypted user data to assist in investigations, resulting in Apple\nremoving\nits Advanced Data Protection (ADP) feature for users in the region. While the U.K. government\nappears to be backing down\nfrom its earlier demand, Google\ntold\nTechCrunch that, unlike Apple, it did not receive any request from the U.K. to build a secret backdoor. This is the first time Google has formally commented on the matter.\nGoogle Hardens Chrome Extension Supply Chain Against Account Compromise\n— Google has rolled out a new security feature called Verified CRX Upload for Chrome extension developers that enforces cryptographic signatures for all Chrome extension updates and prevents bad actors from compromising developer accounts and publishing malicious updates to the Chrome Web Store (CWS). The security protection is also designed to address scenarios where CWS code reviews may not always flag such malicious attacks. \"When opting an extension into Verified CRX Upload, the developer gives Google a public key. After that, the developer can no longer upload unsigned ZIP files for that extension and must instead upload a CRX file signed with the corresponding private key,\" Google\nsaid\n[PDF]. \"Verified upload acts as a second factor for the act of uploading to CWS. A malicious actor who compromises a developer's account password, session cookies, or even an OAuth token, would not be able to upload a malicious update unless they also gain access to the developer's private signing key.\"\nKimsuky Targets South Korea with Stealer Malware\n— The North Korea-linked\nKimsuky\nhacking group has been linked to a spear-phishing campaign that targets South Korean entities using Windows shortcut (LNK) files as an initial access vector to trigger a multi-stage infection chain to deploy a keylogger, information stealer, establish persistent control over compromised hosts, and deliver unknown next-stage payloads. In parallel, users are displayed with lure PDF documents related to tax notices and government alerts about alleged sex offenders in the area. \"Once inside, the malware performs extensive system profiling, steals credentials and sensitive documents, monitors user activity through keylogging and clipboard capture, and exfiltrates data in discreet segments over standard web traffic—helping it blend into normal network operations,\" Aryaka\nsaid\n.\nApple macOS Flaw Can Bypass TCC\n— Attackers could have used a recently patched macOS vulnerability to bypass Transparency, Consent, and Control (\nTCC\n) security checks and steal sensitive user information from locations such as the Downloads directory and Apple Intelligence caches. The flaw, dubbed\nSploitlight\nby Microsoft and tracked as CVE-2025-31199, was addressed by Apple with the release of macOS Sequoia 15.4 in March 2025. The attack is so named because it exploits Spotlight plugins called importers, which are used to index data found on a device and surface it via its built-in search tool. Sploitlight turns these plugins into a TCC bypass, allowing valuable data to be leaked without a user's consent.\nImproved Version of XWorm Spotted\n— A new version of a remote access trojan called\nXWorm\n(version 6.0) has been\ndiscovered\nwith new features such as process protection and enhanced anti-analysis capabilities, indicating continued attempts by the developers to iterate and refine their tactics. The starting point of the attack is a Visual Basic Script that's likely delivered to targets via social engineering, which then proceeds to set up persistence on the host via Windows Registry (as opposed to scheduled tasks in the previous version), although it's important to note that the builder offers three different methods, including the aforementioned techniques and the adding the payload to the Startup folder. It's also designed to run a PowerShell script that includes the ability to bypass Antimalware Scan Interface (AMSI) via in-memory modification of \"clr.dll\" to sidestep detection. Some of the new features observed in the latest version of XWorm are its ability to prevent process termination by marking itself as a critical process and killing itself if the compromised host is running Windows XP.\nMozilla Warns Add-ons Devs Against Phishing Attack\n— Browser maker Mozilla is\nwarning\nof a phishing campaign targeting its Firefox Add-ons infrastructure that aims to trick developers into parting with their account credentials as part of emails containing messages like \"Your Mozilla Add-ons account requires an update to continue accessing developer features\" that are designed to provoke engagement. The disclosure follows the\nemergence\nof bogus Firefox add-ons that masquerade as TronLink, Solflare, Rabby Wallet and are\ndesigned to steal cryptocurrency wallet secrets\n, security researcher Lukasz Olejnik said.\nNew Stealer Malware Dissected\n— Cybersecurity researchers have detailed three new stealer malware families called\nCyber Stealer\n,\nRaven Stealer\n, and\nSHUYAL Stealer\nthat combine extensive credential theft capabilities with advanced system reconnaissance and evasion tactics. \"Beyond credential theft, SHUYAL captures system screenshots and clipboard content, exfiltrating this data alongside stolen Discord tokens through a Telegram bot infrastructure,\" Hybrid Analysis said. \"The malware maintains operational stealth through self-deletion mechanisms, removing traces of its activity using a batch file after completing its primary functions.\" Cyber Stealer, for its part, maintains communication with its command-and-control (C2) server through heartbeat checks, XMR miner configuration, task checks, and data exfiltration. It also comes with a clipper, remote shell, reverse proxy, DDoS, XMR mining, and DNS poisoning capabilities based on the subscription tier chosen by a customer. \"The C2 URL can be dynamically updated through Pastebin, with a hardcoded backup URL if that fails,\" eSentire said. While there are a number of stealers on the cybercrime scene already, the emergence of new stealers demonstrates the lucrative nature of such tools to enable data theft at scale. The third new infostealer malware is Raven Stealer, which is actively distributed through GitHub repositories and promoted via a Telegram channel operated by the threat actors. The stealer is consistent with other stealers, facilitating credential theft, browser data harvesting, and real-time data exfiltration via Telegram bot integration.\nNOVABLIGHT Node.js Stealer Spotted in the Wild\n— Developed and sold by the Sordeal Group, a threat actor demonstrating French-language proficiency, NOVABLIGHT is marketed as an \"educational tool\" on platforms like Telegram and Discord from €25 for a month to €140 for six months ($28 to $162). However, this aspect masks its true intent: A modular, feature-rich NodeJS-based malware built on the Electron framework, designed to steal sensitive information, including login credentials and cryptocurrency wallet data. The malware is said to be distributed via fake websites advertising video game installers. \"NOVABLIGHT is a modular and feature-rich information stealer built on Node.js with the Electron framework,\" Elastic Security Labs\nsaid\n. \"Its capabilities go beyond simple credential theft, incorporating methods for data collection and exfiltration, sandbox detection, and heavy obfuscation.\"\n$3.5B LuBian Bitcoin Theft Goes Undetected for Nearly Five Years\n— A previously undisclosed theft of\n127,426 Bitcoin\n, valued at $3.5 billion at the time (presently approximately $14.5 billion), has been traced back to a December 2020 attack on a little-known Chinese mining pool called LuBian, making it as the largest cryptocurrency theft to date, surpassing the\n$1.5 billion Bybit hack\nthat occurred in February 2025. \"They appear to have been first hacked on December 28th, 2020, for over 90% of their BTC,\" Arkham Intelligence\nsaid\n. \"Subsequently, on December 29th, around $6M of additional BTC and USDT was stolen from a Lubian address active on the Bitcoin Omni layer. On the 31st, LuBian rotated their remaining funds to recovery wallets.\" It's believed that the unknown attackers may have exploited a flawed private key generation algorithm that left it susceptible to brute-force attacks. \"LuBian preserved 11,886 BTC, currently worth $1.35B, which they still hold,\" Arkham said. \"The hacker also still holds the stolen BTC, with their last known movement being a wallet consolidation in July 2024.\" Neither LuBian nor the suspected hacker has ever publicly acknowledged the breach.\nRussia Blocks Access to Speedtest\n— Russia\nblocked\naccess to Speedtest, a popular internet speed testing tool developed by U.S. company Ookla, claiming the service poses a national security threat and could aid cyber attacks. The restriction is due to the \"identified threats to the security of the public communication network and the Russian segment of the internet,\" Roskomnadzor, country's communications watchdog,\nsaid\n, adding it \"collects data on the layout and capacity of Russian communications nodes\" that could be used to \"plan, conduct, and assess attacks on Russian networks and related systems.\"\nCISA Releases Thorium\n— The U.S. Cybersecurity and Infrastructure Security Agency (CISA)\nannounced\nthe public availability of\nThorium\n, an open-source platform for malware and forensic analysts across the government, public, and private sectors. \"Thorium enhances cybersecurity teams' capabilities by automating analysis workflows through seamless integration of commercial, open-source, and custom tools,\" CISA said. \"It supports various mission functions, including software analysis, digital forensics, and incident response, allowing analysts to efficiently assess complex malware threats.\" The agency has also\nreleased\nthe Eviction Strategies Tool, which helps security teams during the incident response by providing the necessary actions to contain and evict adversaries from compromised networks and devices.\nRussian Entities Targeted to Deploy Cobalt Strike\n— The Russian information technology (IT) sector, and to a certain extent companies in China, Japan, Malaysia, and Peru, has been at the receiving end of a spear-phishing email campaign that\ndelivers\nthe Cobalt Strike Beacon by means of intermediate payloads that reach out to fake profiles on social media platforms to obtain the URL hosting the post-exploitation toolkit. The accounts, created on GitHub, Quora, and Russian-language social networks, are said to have been created specifically for the attacks and act as\ndead drop resolvers\nto facilitate operational resiliency. The activity was first recorded in the second half of 2024, reaching its peak in November and December. The campaign has not been attributed to any known threat actor or group.\nAPT36 Targets Indian Railways, Oil & Gas Sectors\n— A suspected Pakistani threat actor known as APT36 (aka Transparent Tribe) has been attributed to attacks targeting Indian railway systems, oil and gas infrastructure, and the Ministry of External Affairs via spear-phishing attacks to deliver a known malware called\nPoseidon\n. \"They use .desktop files disguised as PDF documents to execute scripts that download malware and establish persistence using cron jobs,\" Hunt.io\nsaid\n. \"The Poseidon backdoor, built on the Mythic framework and written in Go, is used to maintain access and support lateral movement.\"\nQilin Ransomware Attack Leverages BYOVD Technique\n— Threat actors associated with\nQilin\nransomware have been observed leveraging a previously unknown driver, TPwSav.sys, to stealthily disable security tools using a custom version of EDRSandblast as part of a Bring Your Own Vulnerable Driver (BYOVD) attack. \"This driver, originally developed for power-saving features on Toshiba laptops, is a signed Windows kernel driver, making it an attractive choice for bypassing EDR protections through a BYOVD attack,\" Blackpoint Cyber\nsaid\n. Prior to this incident, there has been no evidence of in-the-wild exploitation of the driver. \"Compiled in 2015 and holding a valid signature, this driver is an appealing candidate for BYOVD attacks aimed at disabling EDR. While interacting with the driver requires only low-level privileges, loading it and enumerating physical memory demand administrative privileges,\" the company added.\nPhishing Campaign Distributes 0bj3ctivity Stealer\n— Phishing emails bearing purchase order-lures are being used to distribute via JavaScript files a\nstealer\ncalled\n0bj3ctivity Stealer\n, which has been propagated via Ande Loader in the past. \"The further stages are uncommon, including custom PowerShell scripts to deploy the next stages and steganography to hide some of the payloads,\" Trellix\nsaid\n. \"Once decoded, the PowerShell script will download from archive.org a JPG image, which contains the next stage hidden using steganography.\" The United States, Germany, and Montenegro exhibit a high volume of detections, although telemetry data has also revealed noticeable activity in Europe, North America, Southeast Asia, and Australia, indicating the global nature of the threat.\nIncreasing Number of Flaws Leveraged as 0- or 1-Days\n— A third of flaws leveraged by attackers this year have been zero-day or 1-day flaws, indicating that threat actors are becoming faster at exploiting vulnerabilities. \"We observed an 8.5% increase in the percentage of KEVs [Known Exploited Vulnerabilities] that had exploitation evidence disclosed on or before the day a CVE was published — 32.1% in H1-2025 as compared to the 23.6% we reported in 2024,\" VulnCheck\nsaid\n. In total, the company added 432 new vulnerabilities to its KEV list in the first half of 2025, with 92 unique threat actors linked to the exploitation efforts. Of these, 56 (60.8%) were attributed to specific countries, including China (20), Russia (11), North Korea (9), and Iran (6). In a related development, a GreyNoise report\nfound\nthat in 80% of reconnaissance spikes against enterprise gear, the increase in activity was followed by the publication of a new CVE within six weeks, suggesting threat actors or researchers are testing their exploits ahead of time. \"These patterns were exclusive to enterprise edge technologies like VPNs, firewalls, and remote access tools – the same kinds of systems increasingly targeted by advanced threat actors,\" the threat intelligence firm said.\nBreachForums Comes Back Online\n— BreachForums\nappears to be back again\nafter it went offline in April. The popular cybercrime forum was\nshut down\nand\nresurrected\nseveral times over the past year. According to DataBreaches.Net, the official site appears to be back online on its dark web address, while preserving the original user database, reputation, credits, and posts. What's more, the site seems to have returned under new leadership – a user with the online moniker \"N/A.\" In an introductory post, N/A also claimed that none of its administrators have been arrested and that it's \"business as usual.\"\nRedCurl's New Attacks Deliver RedLoader\n— The threat actor known as\nGold Blade\n(aka Earth Kapre, RedCurl, and Red Wolf) has been\nlinked to a new set of attacks\nin July 2025 that combine malicious LNK files and WebDAV to execute remotely hosted DLLs to ultimately launch RedLoader using DLL side-loading. The LNK files, disguised as cover letters in the PDF format, are distributed via phishing emails via third-party job search sites like Indeed.\nMimo Exploits SharePoint Flaws to Deliver Ransomware\n— The threat actor known as\nMimo\nis\nexploiting\nthe recently disclosed Microsoft SharePoint flaws to deliver the Go-based 4L4MD4r ransomware. The hacking group was\nrecently linked\nto the abuse of a critical Craft CMS flaw to drop miners. The development marks the first time the hacking group has deployed ransomware in the wild.\nSilver Fox APT Uses Fake Flash Plugin to Deliver Malware\n— The threat actor tracked as Silver Fox has been observed delivering the\nWinos\ntrojan under the guise of popular tools like Adobe Flash, Google Translate, and WPS. Typical distribution vectors include email,\nphishing websites\n, and instant messaging software. \"However, with the leakage of core remote control Trojan source code (such as Winos 4.0) in the cybercrime circle, Silver Fox has gradually transformed from a single organization into a malicious family widely redeveloped by cybercrime groups and even APT organizations,\" the Knownsec 404 team\nsaid\n. \"Winos has a rich set of functional plug-ins that enable various remote control functions and data theft on the target host.\"\nGirona Hacker Arrested\n— Spanish authorities have\napprehended\na cybercriminal who allegedly stole sensitive data from major financial institutions, educational organizations, and private companies across the country. The accused, described as a man with advanced computer programming skills, stands accused of targeting Spanish banks, a driving school, and a public university, among others. The suspect is alleged to have stolen personal databases of employees and customers, as well as internal documents of companies and organizations, and then sold them for profit.\nShadowSyndicate Infrastructure Analyzed\n— Cybersecurity researchers have found connections between\nShadowSyndicate\ninfrastructure and various malware families like AMOS Stealer, TrueBot, and a number of ransomware strains such as Cl0p, BlackCat, LockBit, Play, Royal, CACTUS, and RansomHub. Aside from having access to a network of bulletproof hosters (BPHs) in Europe, it's believed that ShadowSyndicate functions as an initial access broker (IAB) fueling Russian, North Korean, and Chinese APTs. \"It remains unclear whether ShadowSyndicate has a structured business model with formal clients or partners in cybercrime, or whether it represents a more fluid, hybrid threat actor,\" Intrinsec\nsaid\n.\nWho is Lionishackers?\n— Threat hunters have ripped the cover off Lionishackers, a corporate database seller and a financially motivated threat actor focused on exfiltrating and selling corporate databases through Telegram and underground forums since July 2024. \"Even though they seem to have an opportunistic approach when choosing their targets, there seems to be a certain preference for victims located in Asian countries,\" Outpost24\nsaid\n. \"They have shown a high level of collaboration with the 'Hunt3r Kill3rs' group and extensive participation in relevant underground communities' Telegram channels. Furthermore, they also worked on and offered other services such as pen testing, the commercialization of the Ghost botnet, and the launch of a forum project dubbed Stressed Forums.\"\nEdskManager RAT, Pulsar RAT, and Retro-C2 RAT Exposed\n— Three new remote access trojans called EdskManager RAT, Pulsar RAT, and Retro-C2 RAT have been flagged by cybersecurity researchers, flagging their ability to evade detection and maintain control over compromised systems. \"The malware employs a downloader disguised as legitimate software, followed by in-memory decryption and stealth communication with command-and-control servers,\" CYFIRMA\nsaid\nabout EdskManager RAT. \"Its use of HVNC (Hidden Virtual Network Computing), advanced persistence techniques, and anti-analysis measures indicates a strong focus on long-term, covert access to infected systems.\"\nPulsar RAT\n, on the other hand, is an Android trojan that exploits\naccessibility services\nto gain near-total control of the device, accessing messages, calls, GPS data, the camera, microphone, and other sensitive data. Developed by a Turkish-speaking threat actor known as ZeroTrace, Retro-C2 RAT employs reflective loading techniques to evade detection and siphon data from compromised machines. \"The command-and-control infrastructure is fully web-based and provides threat actors with real-time client monitoring, action management such as CMD, PowerShell, Remote Desktop, keylogging, clipboard capture, file and process management, registry and network operations, audio recording, wallet scanning, persistence operations, and credential recovery,\" ThreatMon\nsaid\n.\nApple to Enable Advanced Fingerprinting Protection for All Safari Browsing Sessions\n— Apple has\nrevealed\nthat it intends to make advanced fingerprinting protection the default for all browsing sessions in Safari with the release of iOS 26, iPadOS 26, and macOS 26 in September 2025. Currently, the option is limited to Private Browsing mode. The feature was\nfirst introduced\nin Safari 17.0.\nSecurity Flaw Uncovered in Catwatchful Spyware\n— An SQL injection vulnerability in an Android stalkerware operation called\nCatwatchful\nhas\nexposed\nmore than 62,000 of its customers, including its Uruguay-based administrator, Omar Soca Charcov. The bug, discovered by researcher Eric Daigle, could be exploited to leak the application's database, compromising customers' email addresses and plaintext passwords. Google has since\nadded protections\nto flag such malicious apps and\nsuspended the developer's Firebase account\nfor abusing its infrastructure to operate the monitoring software.\nRansomware Continues to be a Threat\n— DragonForce has claimed more than 250 victims on its dark web leak site, with 58 in the second quarter of 2025 alone, indicating that the ransomware cartel is gaining traction after purportedly absorbing RansomHub. Some of the groups that appear to have exited the scene include RansomHub, Babuk-Bjorka, FunkSec, BianLian, 8Base, Cactus, and Hunters International. \"With major RaaS services shutting down, many affiliates are operating independently or seeking new partnerships,\" Check Point\nsaid\n. \"The result is a growing number of smaller, often short-lived, ransomware entities. At the same time, established players are actively competing to recruit these 'orphaned' affiliates.\" Ransomware attacks have also been observed evolving beyond double extortion to coerce victims into paying up with threats of data leaks and DDoS attacks. \"Double, triple, and quadruple extortion tactics add pressure by threatening to expose customer information, disrupting operations with distributed denial-of-service (DDoS) attacks, and sending harassing messages to business partners, customers, and others -- including informing media of the breach,\" Akamai\nsaid\n.\nThreat Actors Hide Malware in DNS Records\n— While it's known that threat actors have leveraged the Domain Name System (DNS) for command-and-control purposes using a technique called\nDNS tunneling\n, it has been observed that cybercriminals are\nevolving their tactics\nfurther by\nconcealing malicious commands in DNS TXT records\nby converting them into their hexadecimal representation and storing them in chunks. The practice is both clever and sneaky as it allows malicious scripts and early-stage malware to fetch binary files without having to download them from attacker-controlled sites or attach them to emails, which have a higher chance of being detected by antivirus software.\n🎥 Cybersecurity Webinars\nMalicious Python Packages Are Everywhere — Learn How to Spot and Stop Them\n: In 2025, attacks on the Python ecosystem are rising fast—from typosquatting to dangerous container image flaws. If you're still \"pip installing and praying,\" it's time to level up. Join us for a hands-on webinar where we break down real supply chain threats and show you how to defend your code with practical tools, smarter workflows, and hardened images. No hype—just clear steps to secure your Python stack.\nSecure Your AI Stack: Learn How to Defend Identity Before It's Too Late\n: AI is changing the way we work—and the way we get attacked. Join Okta's Karl Henrik Smith to explore how identity is becoming the last, and most critical, line of defense against AI-powered threats. From deepfakes to autonomous agents, attackers are moving faster than traditional tools can handle. In this free webinar, you'll learn why identity-first security is the key to staying ahead—and how to put it into action.\n🔧 Cybersecurity Tools\nThorium\n: Released by the U.S. CISA, this new open-source tool is a scalable platform for automating file analysis and aggregating results across diverse tools. It helps cybersecurity teams streamline malware triage, forensics, and tool testing by integrating with existing workflows through event-driven automation and a scalable infrastructure.\nLangExtract\n: It is an open-source Python library, developed by Google, that helps developers extract structured information from unstructured text using Gemini and other LLMs. It's designed for tasks like parsing medical records, legal documents, or customer feedback by combining prompt-driven extraction, source-grounded outputs, and schema enforcement. LangExtract supports flexible backends, scales across long documents, and makes it easy to visualize and verify results—all without fine-tuning a model.\nDisclaimer: These newly released tools are for educational use only and haven't been fully audited. Use at your own risk—review the code, test safely, and apply proper safeguards.\n🔒 Tip of the Week\nYour Keyboard Could Be Spying on You — Here's How to Tell —\nMost people don't realize it, but your smartphone keyboard can do more than just type. Some of them quietly connect to the internet, sending back what you type, when you type, and even what's in your clipboard. Even trusted apps like Gboard and SwiftKey have cloud sync features that share your typing patterns. And in worse cases, rogue keyboards can log passwords or steal crypto wallet seeds without any visible signs.\nThe fix isn't just \"don't use shady keyboards.\" It's knowing how to control what they can do. Start by using a firewall app like NetGuard or RethinkDNS to block your keyboard from sending data over the internet. Go into your keyboard's settings and turn off \"personalization\" or sync features. Watch out for weird behavior like a keyboard asking for access to your mic, contacts, or location — those are red flags. On newer Android versions, clipboard alerts will warn you if a keyboard is snooping.\nIf you want full peace of mind, switch to a keyboard that respects your privacy by design. Options like OpenBoard or Simple Keyboard have no internet access at all. They're fast, clean, and open source — meaning their code can be audited for hidden behavior. In short: if your keyboard wants to \"learn from you,\" make sure it's not learning too much.\nConclusion\nEvery threat we covered this week tells the same story: attackers are evolving faster because they're learning from us. From how we code to how we trust, they're watching closely. But the flipside? So are we.\nThe more we share, the faster we adapt. Keep pushing, keep questioning, and never let \"normal\" make you comfortable.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Man-in-the-Middle Attack Prevention Guide",
        "Link": "https://thehackernews.com/2025/08/man-in-middle-attack-prevention-guide.html",
        "Summary": "Some of the most devastating cyberattacks don&rsquo;t rely on brute force, but instead succeed through stealth. These quiet intrusions often go unnoticed until long after the attacker has disappeared. Among the most insidious are man-in-the-middle (MITM) attacks, where criminals exploit weaknesses in communication protocols to silently position themselves between two unsuspecting parties",
        "Date": "2025-08-04",
        "Content": "Some of the most devastating cyberattacks don’t rely on brute force, but instead succeed through stealth. These quiet intrusions often go unnoticed until long after the attacker has disappeared. Among the most insidious are man-in-the-middle (MITM) attacks, where criminals exploit weaknesses in communication protocols to silently position themselves between two unsuspecting parties\nFortunately, protecting your communications from MITM attacks doesn’t require complex measures. By taking a few simple steps, your security team can go a long way in securing users’ data and keeping silent attackers at bay.\nKnow your enemy\nIn a\nMITM attack\n, a malicious actor intercepts communications between two parties (such as a user and a web app) to steal sensitive information. By secretly positioning themselves between the two ends of the conversation, MITM attackers can capture data like credit card numbers,\nlogin credentials\n, and account details. This stolen information often fuels further crimes, including unauthorized purchases, financial account takeovers, and identity theft.\nThe widespread use of MITM attacks speaks to their effectiveness, with several high-profile incidents making headlines and showcasing just how damaging these attacks can be. Notable examples include the\nEquifax data breach\n, the\nLenovo Superfish\nscandal, and the\nDigiNotar\ncompromise – all of which highlight how devastating MitM attacks can be when security controls fail.\nCommon MITM threat vectors\nMITM attacks are especially common in environments with unsecured Wi-Fi and a high volume of potential victims (e.g., coffee shops, hotels, or airports). Cybercriminals will look to exploit misconfigured or unsecured networks or deploy rogue hardware that mimics legitimate access points. Once the rogue access point is active, the attacker spoofs the Wi-Fi name (i.e., service set identifier or SSID) to closely resemble a trusted network. Unsuspecting users, whose devices automatically connect to familiar or strong-signal networks, often join without realizing they’re on a malicious connection.\nThe role of spoofing in MITM attacks\nSpoofing is what allows attackers to disguise themselves as a trusted entity within the environment. This deception enables them to intercept, monitor, or manipulate the data being exchanged without raising suspicion.\nmDNS and DNS spoofing\nmDNS and DNS spoofing are common tactics that trick devices into trusting malicious sources. Attackers exploit mDNS on local networks by replying to name requests with fake addresses, while DNS spoofing injects false data to redirect users to harmful websites, where sensitive information can be stolen.\nARP spoofing\nHackers may intercept local network traffic by exploiting the address resolution protocol (ARP). By replying to a device’s request for a MAC address with their own, attackers redirect data meant for another device to themselves. This lets them capture and analyze private communications, potentially stealing sensitive information like session tokens and gaining unauthorized access to accounts.\nProtecting against MITM attacks\nDespite seeming complicated, MITM attacks can be effectively thwarted with the following set of best practices.\nEncrypt everything\nTo prevent your data from being intercepted or tampered with, enforce HTTPS and TLS across all web traffic. Use HTTP Strict Transport Security (HSTS) to ensure browsers connect only over secure channels, and apply secure cookie flags to protect sensitive information from exposure on unencrypted connections. For mobile and desktop apps, implement certificate pinning to bind apps to specific server certificates – this makes it harder for attackers to impersonate trusted services and intercept communications.\nSecure your network\nAvoid public Wi-Fi when possible, or use a trusted VPN to\nencrypt\nyour traffic and shield it from eavesdroppers. Within your network, segmenting internal systems and isolating untrusted zones helps contain breaches and restrict attackers’ lateral movement. Additionally, deploying DNSSEC cryptographically validates DNS responses, while DNS over HTTPS (DoH) and DNS over TLS (DoT) make it harder for attackers to tamper with or spoof domain resolutions by encrypting DNS queries.\nAuthenticate and validate\nImplement mutual TLS to require both clients and servers to authenticate each other before connecting, blocking impersonation and interception. Enforcing\nstrong multi-factor authentication (MFA)\non critical services adds another layer of protection, making it harder for attackers to exploit stolen credentials. Regularly auditing and rotating TLS certificates and encryption keys is also vital to close security gaps caused by compromised or outdated cryptographic materials.\nEndpoint and traffic monitoring\nTo mitigate MITM attacks, security teams should implement a layered defense strategy. Intrusion detection and prevention systems (IDS/IPS) can be configured to flag unusual SSL/TLS handshake patterns.\nExternal attack surface management (EASM)\ntools are crucial for uncovering vulnerabilities and expired or misconfigured certificates on unknown or unmanaged internet-facing assets. Continuous monitoring for certificate mismatches or unexpected certificate authorities can expose spoofed services and fraudulent intermediaries. Also, advanced endpoint detection and response (EDR) solutions can detect common MITM tactics such as ARP spoofing and rogue proxy use, enabling faster investigation and remediation.\nEducate users\nEducating users to heed invalid certificate warnings helps them avoid connecting to malicious or spoofed servers. At the same time, developers must follow secure-by-default coding practices that never disable certificate validation, as skipping these checks creates critical vulnerabilities. Incorporating both static application security testing (SAST) and dynamic application security testing (DAST) into the development cycle ensures issues like weak encryption or improper certificate handling are detected and fixed early.\nStrengthen your Active Directory security today\nBy focusing on strong, unique passphrases; actively scanning AD for breached credentials; and enforcing MFA everywhere it matters, you eliminate the easiest avenue for attackers to exploit intercepted data.\nSpecops Password Policy\naugments Active Directory’s native password mechanisms by embedding a real-time check against both global breached-password feeds and any custom ban‐lists you configure.\nBecause it hooks directly into your domain controllers via a lightweight password filter, it intercepts and blocks risky passwords at the moment of creation – stopping attackers from leveraging exposed credentials. With granular OU-based policy objects, centralized reporting dashboards, and integration points for MFA and\nSelf Service Password Resets (SSPR)\n, it provides a comprehensive, low-overhead way to ensure that nobody in your organization is reusing or choosing weak or breached passwords.\nReach out for a live demo\n.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "New ‘Plague’ PAM Backdoor Exposes Critical Linux Systems to Silent Credential Theft",
        "Link": "https://thehackernews.com/2025/08/new-plague-pam-backdoor-exposes.html",
        "Summary": "Cybersecurity researchers have flagged a previously undocumented Linux backdoor dubbed Plague that has managed to evade detection for a year.\n\"The implant is built as a malicious PAM (Pluggable Authentication Module), enabling attackers to silently bypass system authentication and gain persistent SSH access,\" Nextron Systems researcher Pierre-Henri Pezier said.\nPluggable Authentication Modules",
        "Date": "2025-08-04",
        "Content": "Cybersecurity researchers have flagged a previously undocumented Linux backdoor dubbed\nPlague\nthat has managed to evade detection for a year.\n\"The implant is built as a malicious\nPAM\n(Pluggable Authentication Module), enabling attackers to silently bypass system authentication and gain persistent SSH access,\" Nextron Systems researcher Pierre-Henri Pezier\nsaid\n.\nPluggable Authentication Modules refers to a suite of shared libraries used to manage user authentication to applications and services in Linux and UNIX-based systems.\nGiven that PAM modules are loaded into privileged authentication processes, a rogue PAM can\nenable\ntheft of user credentials, bypass authentication checks, and remain undetected by security tools.\nThe cybersecurity company said it uncovered multiple Plague artifacts uploaded to VirusTotal since July 29, 2024, with none of them detected by antimalware engines as malicious. What's more, the presence of several samples signals active development of the malware by the unknown threat actors behind it.\nPlague boasts of four prominent features: Static credentials to allow covert access, resist analysis and reverse engineering using anti-debugging and string obfuscation; and enhanced stealth by erasing evidence of an SSH session.\nThis, in turn, is accomplished by unsetting environment variables such as\nSSH_CONNECTION and SSH_CLIENT\nusing unsetenv, and redirecting\nHISTFILE\nto /dev/null to prevent shell command logging, in order otherwise avoid leaving an audit trail.\n\"Plague integrates deeply into the authentication stack, survives system updates, and leaves almost no forensic traces,\" Pezier noted. \"Combined with layered obfuscation and environment tampering, this makes it exceptionally hard to detect using traditional tools.\"\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "The Wild West of Shadow IT",
        "Link": "https://thehackernews.com/2025/08/the-wild-west-of-shadow-it.html",
        "Summary": "Everyone’s an IT decision-maker now. The employees in your organization can install a plugin with just one click, and they don’t need to clear it with your team first. It’s great for productivity, but it’s a serious problem for your security posture.\nWhen the floodgates of SaaS and AI opened, IT didn’t just get democratized, its security got outpaced. Employees are onboarding apps faster than",
        "Date": "2025-08-04",
        "Content": "Everyone's an IT decision-maker now. The employees in your organization can install a plugin with just one click, and they don't need to clear it with your team first. It's great for productivity, but it's a serious problem for your security posture.\nWhen the floodgates of SaaS and AI opened, IT didn't just get democratized, its security got outpaced. Employees are onboarding apps faster than security teams can say, \"We need to check this out first.\" The result is a sprawling mess of shadow IT, embedded AI, and OAuth permissions that would make any CISO break into a cold sweat.\nHere are five ways IT democratization can undermine your organization's security posture and how to prevent it from doing so.\n1. You can't secure what you can't see\nRemember when IT security used to control what was allowed to pass the firewall? Good times. Today, anyone can find an app to do the heavy lifting for them. They won't notice or care when the app requires access to your company's Google Drive or has embedded AI. These apps are entering your stack right under your nose. The process is fast, decentralized, and a security nightmare.\nHow to solve it:\nYou need full visibility into the entire application stack, including any shadow IT or shadow AI in use. How can this be achieved? This comes down to one question: How good is your discovery? Wing automatically discovers every app in use, whether its SaaS, internal app, if it has embedded AI or if it's an AI agent, even the ones hiding behind personal logins, OAuth connections, and browser extensions. It surfaces the risk levels, flags redundant or suspicious tools, and gives you the power to review, restrict, or remove them.\n2. The growing attack surface of Shadow AI\nAI tools are tech's new shiny object and your organization's users are all in. From copy to deck generators, code assistants, and data crunchers, most of them were never reviewed or approved. The productivity gains of AI are huge. Productivity has been catapulted forward in every department and across every vertical.\nSo what could go wrong? Oh, just sensitive data leaks, uncontrolled API connections, persistent OAuth tokens, and no monitoring, audit logs, or privacy policies… and that's just to name a few of the very real and dangerous issues.\nHow to solve it:\nYou need a discovery tool that detects where AI is being used and how, even when it's embedded within applications. Wing continuously detects apps with embedded AI, AI agents and Agetic AI across your environment, not just the ones you're aware of, but also the ones that snuck into your stack unnoticed. It even alerts you when an app in use suddenly adds AI capabilities, so you are aware of this and not caught by surprise.\n3. Supply chain breaches: your weakest link\nModern SaaS stacks form an interconnected ecosystem. Applications integrate with each other through OAuth tokens, API keys, and third-party plug-ins to automate workflows and enable productivity. But every integration is a potential entry point — and attackers know it.\nCompromising a lesser-known SaaS tool with broad integration permissions can serve as a stepping stone into more critical systems. Shadow integrations, unvetted AI tools, and abandoned apps connected via OAuth can create a fragmented, risky supply chain. Worse, many of these connections operate outside the security team's visibility, especially when installed by end users without formal review or approval.\nThis supply chain sprawl introduces hidden dependencies and expands your attack surface — turning SaaS connectivity from a productivity driver into a threat vector.\nHow to solve it:\nYou need complete visibility into your app-to-app ecosystem. Wing Security maps every integration across your stack, showing not just which SaaS and internal apps are connected, but how. This includes OAuth tokens, API scopes, and data access levels. Shadow and user-installed integrations are flagged so you can assess their security posture at a glance. With Wing, you can monitor third-party access continuously, enforce integration policies, and revoke risky connections before they become threats.\n4. Compliance: yours and your vendors'\nLet's be honest - compliance has become a jungle due to IT democratization. From GDPR to SOC 2… your organization's compliance is hard to gauge when your employees use hundreds of SaaS tools and your data is scattered across more AI apps than you even know about. You have two compliance challenges on the table: You need to make sure the apps in your stack are compliant and you also need to assure that your environment is under control should an audit take place.\nHow to solve it:\nYou need visibility into all of the apps in your stack, but also how they add up when it comes to compliance. Wing gives you what you need by identifying all apps in use and if they are compliant with industry regulations like SOC2. Bottom line? If you're subject to an audit, you'll be ready.\n5. Offboarding: the users you forgot about\nIT democratization didn't just change how tools get adopted, but how access gets removed. When employees leave, their personal app accounts, browser extensions, and third-party integrations often stick around. Still active, connected and accessing corporate data.\nThis creates a serious security risk. Former employees often retain active OAuth tokens connected to corporate systems. Tools connected through personal accounts may continue to sync sensitive company data to external environments, creating hidden data exposure risks. Even if the employee left the company on good terms, their leftover access can later be exploited if their accounts are compromised. And because many of these apps aren't visible to IT security, they are extra risky.\nHow to solve it:\nYou need to be able to see all identities connected to applications in your system - both human and non-human. Both active and stale, including those no longer with the company. Wing detects lingering accounts, tokens, and app access tied to former employees, even across apps you didn't know they used, ensuring nothing stays connected that shouldn't be.\nThe bottom line\nYou can't put the IT democratization genie back in the bottle. Your teams will keep exploring new tools, connecting apps, and experimenting with AI. But you also can't turn a blind eye. You need continuous visibility that helps you take back control over your quickly expanding attack surface. More than just having a list of all unsanctioned apps, you need to know who has access to them, if they pose a risk to your organization, and you need the ability to act fast if a response is necessary. Context is key when it comes to securing the application attack surface.\nWing helps you embrace agility without sacrificing safety. We bring visibility to your chaos and control back to your team, without slowing your organization down.\nReady to see what's hiding in your stack?\nSee what Wing can show you.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "PlayPraetor Android Trojan Infects 11,000+ Devices via Fake Google Play Pages and Meta Ads",
        "Link": "https://thehackernews.com/2025/08/playpraetor-android-trojan-infects.html",
        "Summary": "Cybersecurity researchers have discovered a nascent Android remote access trojan (RAT) called PlayPraetor that has infected more than 11,000 devices, primarily across Portugal, Spain, France, Morocco, Peru, and Hong Kong.\n\"The botnet's rapid growth, which now exceeds 2,000 new infections per week, is driven by aggressive campaigns focusing on Spanish and French speakers, indicating a strategic",
        "Date": "2025-08-04",
        "Content": "Cybersecurity researchers have discovered a nascent Android remote access trojan (RAT) called\nPlayPraetor\nthat has infected more than 11,000 devices, primarily across Portugal, Spain, France, Morocco, Peru, and Hong Kong.\n\"The botnet's rapid growth, which now exceeds 2,000 new infections per week, is driven by aggressive campaigns focusing on Spanish and French speakers, indicating a strategic shift away from its previous common victim base,\" Cleafy researchers Simone Mattia, Alessandro Strino, and Federico Valentini\nsaid\nin an analysis of the malware.\nPlayPraetor, managed by a Chinese command-and-control (C2) panel, doesn't significantly deviate from other Android trojans in that it abuses accessibility services to gain remote control and can serve fake overlay login screens atop nearly 200 banking apps and cryptocurrency wallets in an attempt to hijack victim accounts.\nPlayPraetor was\nfirst documented\nby CTM360 in March 2025, detailing the operation's use of thousands of fraudulent Google Play Store download pages to perpetrate an interconnected large-scale scam campaign that can harvest banking credentials, monitor clipboard activity, and log keystrokes.\n\"The links to the impersonated Play Store pages are distributed through Meta Ads and SMS messages to effectively reach a wide audience,\" the Bahrain-based company noted at the time. \"These deceptive ads and messages trick users to click on the links, leading them to the fraudulent domains hosting the malicious APKs.\"\nAssessed to be a globally coordinated operation, PlayPraetor\ncomes\nin five different variants that install deceptive Progressive Web Apps (PWAs), WebView-based apps (Phish), exploit accessibility services for persistent and C2 (Phantom), facilitate invite code-based phishing and trick users into purchasing counterfeit products (Veil), and grant full remote control via EagleSpy and SpyNote (RAT).\nThe Phantom variant of PlayPraetor, per the Italian fraud prevention company, is capable of on-device fraud (\nODF\n) and is dominated by two principal affiliate operators who control about 60% of the botnet (roughly 4,500 compromised devices) and appear to center their efforts around Portuguese-speaking targets.\n\"Its core functionality relies on abusing Android's accessibility services to gain extensive, real-time control over a compromised device,\" Cleafy said. \"This allows an operator to perform fraudulent actions directly on the victim's device.\"\nImage Source: CTM360\nOnce installed, the malware beacons out to the C2 server via HTTP/HTTPS and makes use of a WebSocket connection to create a bidirectional channel to issue commands. It also sets up a Real-Time Messaging Protocol (RTMP) connection to initiate a video livestream of the infected device's screen.\nThe evolving nature of the supported commands indicates that PlayPraetor is being actively developed by its operators, allowing for comprehensive data theft. In recent weeks, attacks distributing the malware have increasingly targeted Spanish- and Arabic-speaking victims, signaling a broader expansion of the malware-as-a-service (MaaS) offering.\nThe C2 panel, for its part, is not only used to actively interact with compromised devices in real-time, but also enable the creation of bespoke malware delivery pages that mimic Google Play Store on both desktop and mobile devices.\n\"The campaign's success is built upon a well-established operational methodology, leveraging a multi-affiliate MaaS model,\" Cleafy said. \"This structure allows for broad and highly targeted campaigns.\"\nPlayPraetor is the latest malware originating from Chinese-speaking threat actors with an aim to conduct financial fraud, a trend exemplified by the emergence of\nToxicPanda\nand\nSuperCard X\nover the past year.\nToxicPanda Evolves\nAccording to data from Bitsight, ToxicPanda has compromised around 3,000 Android devices in Portugal, followed by Spain, Greece, Morocco and Peru. Campaigns distributing the malware have leveraged TAG-1241, a traffic distribution system (TDS), for malware distribution using\nClickFix\nand fake Google Chrome update lures.\n\"This carefully orchestrated redirection is part of the TDS's design to ensure that only selected targets are funneled to these malicious endpoints,\" security researcher Pedro Falé\nsaid\nin a report last week.\nThe latest version of ToxicPanda improves upon its predecessors by incorporating a Domain Generation Algorithm (DGA) to establish C2 and enhance operational resilience in the face of infrastructure takedowns. Also baked into the malware are new commands to set a fallback C2 domain and better control malicious overlays.\nDoubleTrouble Rises\nThe findings come as Zimperium disclosed another sophisticated Android banking trojan dubbed DoubleTrouble that has evolved beyond overlay attacks to record the device screen, log keystrokes, and run various commands for data exfiltration and entrenched device control.\nBesides leaning heavily on abusing Android's accessibility services to carry out its fraudulent activities, DoubleTrouble's distribution strategy involves leveraging bogus websites that host malware samples directly within Discord channels.\n\"The new functionalities include: displaying malicious UI overlays to steal PIN codes or unlock patterns, comprehensive screen recording capabilities, the ability to block the opening of specific applications, and advanced keylogging functionality,\" Zimperium zLabs researcher Vishnu Madhav\nsaid\n.\nFound this article interesting?  Follow us on\nGoogle News\n,\nTwitter\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Fashion giant Chanel hit in wave of Salesforce data theft attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/fashion-giant-chanel-hit-in-wave-of-salesforce-data-theft-attacks/",
        "Summary": "French fashion giant Chanel is the latest company to suffer a data breach in an ongoing wave of Salesforce data theft attacks. [...]",
        "Date": "2025-08-04",
        "Content": "French fashion giant Chanel is the latest company to suffer a data breach in an ongoing wave of Salesforce data theft attacks.\nChanel says the breach was first detected on July 25th after threat actors gained access to a Chanel database hosted at a third-party service provider, as first reported by\nWWD\n.\nThe breach only impacted customers in the United States and exposed personal contact information.\n\"Based on the findings of the investigation, the data obtained by the unauthorized external party contained limited details of a subset of individuals who contacted our client care center in the U.S. —specifically name, email address, mailing address and phone number,\" a Spokesperson told WWD.\n\"No other information was contained in the database. The clients affected have been informed.\"\nWhile Chanel has not replied to our emails and the name of the third-party service provider was not mentioned, BleepingComputer has learned that it was stolen from the company's Salesforce instance.\nThis attack has been attributed to the\nongoing wave of Salesforce data-theft attacks\nconducted by the ShinyHunters extortion group.\nAs first reported by Mandiant, threat actors have been\nactively targeting Salesforce customers\nin vishing (voice phishing) attacks to compromise credentials or to trick employees into authorizing a malicious OAuth app with their organization's Salesforce portal.\nOnce they gain access to the Salesforce instance, they exfiltrate the database and use it as leverage in extortion demands on customers.\nIn a statement to BleepingComputer, Salesforce emphasized that its platform was not compromised, but rather, customers' accounts are being breached in social engineering attacks.\n\"Salesforce has not been compromised, and the issues described are not due to any known vulnerability in our platform. While Salesforce builds enterprise-grade security into everything we do, customers also play a critical role in keeping their data safe — especially amid a rise in sophisticated phishing and social engineering attacks,\" Salesforce told BleepingComputer.\n\"We continue to encourage all customers to follow security best practices, including enabling multi-factor authentication (MFA), enforcing the principle of least privilege, and carefully managing connected applications. For more information, please visit:\nhttps://www.salesforce.com/blog/protect-against-social-engineering/\n.\"\nThe threat actors have not publicly leaked the data for any companies to date, with companies currently extorted via email.\nOther companies impacted in these Salesforce data theft attacks include\nAdidas\n,\nQantas\n,\nAllianz Life\n, and the LVMH brands,\nLouis Vuitton\n,\nDior\n, and\nTiffany & Co.\nBleepingComputer knows of other allegedly breached companies that have not yet disclosed attacks, but we have not been able to verify them independently as of yet.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nShinyHunters behind Salesforce data theft attacks at Qantas, Allianz Life, and LVMH\nAllianz Life confirms data breach impacts majority of 1.4 million customers\nGoogle: Hackers target Salesforce accounts in data extortion attacks\nStolen Ticketmaster data from Snowflake attacks briefly for sale again\nPi-hole discloses data breach triggered by WordPress plugin flaw"
    },
    {
        "Title": "Proton fixes Authenticator bug leaking TOTP secrets in logs",
        "Link": "https://www.bleepingcomputer.com/news/security/proton-fixes-authenticator-bug-leaking-totp-secrets-in-logs/",
        "Summary": "Proton fixed a bug in its new Authenticator app for iOS that logged users' sensitive TOTP secrets in plaintext, potentially exposing multi-factor authentication codes if the logs were shared. [...]",
        "Date": "2025-08-04",
        "Content": "Proton fixed a bug in its new Authenticator app for iOS that logged users' sensitive TOTP secrets in plaintext, potentially exposing multi-factor authentication codes if the logs were shared.\nLast week,\nProton released a new Proton Authenticator app\n, which is a free standalone two-factor authentication (2FA) application for Windows, macOS, Linux, Android, and iOS.\nThe app is used to store multi-factor authentication TOTP secrets that can be used to generate one-time passcodes for authentication on websites and applications.\nOver the weekend, a user posted in a\nnow-deleted Reddit post\nthat the iOS version was exposing TOTP secrets in the app's debug logs found under\nSettings\n>\nLogs\n.\n\"Imported my 2FA accounts, enabled backup and sync, everything looked good at first. At some point, after I changed the label on one of my entries and switched apps briefly,\" reads an\narchive\nof the post.\n\"I came back to find that about half of my 2FA entries were gone. I think it might've happened after the label edit, but I'm not 100% sure. Could've been something else. Either way, they disappeared without any error or warning.\"\n\"I wanted to do the right thing and submit a bug report. While preparing it, I opened the log file the app generates, and that's when it went from mildly annoying to deeply concerning. Turns out, the log contains full TOTP secrets in plaintext. Yes, including the one for my Bitwarden account.\"\nAnother commenter noted that the leak stems from code on the iOS app [\n1\n,\n2\n] that adds a lot of data about a TOTP entry to a params variable, which is then passed to two functions used for adding or updating a TOTP secret on the app.\nTOTP secret passed to 'params' variable which is added to logs\nWhen this is done, the functions will also add this data to a log entry, which exposes the TOTP secret.\nProton confirmed the bug in the iOS version, stating that it is now fixed in version 1.1.1, released to the App Store approximately 7 hours ago.\n\"Secrets are never transmitted to the server in plaintext, and all sync of secrets is done with end-to-end encryption. Logs are local only (never sent to the server), and these secrets can also be exported on your device to meet GDPR data portability requirements,\" Proton told BleepingComputer.\n\"In other words, even if this was not in the logs, somebody who has access to your device to get these logs, would still be able to obtain the secrets. Proton's encryption cannot protect against device side compromise, so you must always secure your device as that is outside of our threat model.\"\n\"We have updated the iOS app to change the logging behavior, but this isn't a vulnerability that can be exploited by an attacker, and if the attacker has access to your device to access the local logs, they will anyways be able to obtain the secrets, and there is nothing Proton (or any 2FA app) can do to prevent that.\"\nWhile this log data can't be exploited remotely, the concern was that if the logs were shared or posted anywhere to help diagnose an issue or bug, it would also expose the sensitive TOTP secret to a third party.\nThese secrets could then be imported to another Authenticator to generate one-time passcodes for that account.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nProton launches free standalone cross-platform Authenticator app\nThreat actors try to downgrade FIDO2 MFA auth in PoisonSeed phishing attack\nProton launches privacy-respecting encrypted AI assistant Lumo\nMicrosoft Authenticator on iOS moves backups fully to iCloud\nThe MFA You Trust Is Lying to You – and Here's How Attackers Exploit It"
    },
    {
        "Title": "Microsoft: Outdated Office apps lose access to voice features in January",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-outdated-office-apps-lose-access-to-voice-features-in-january/",
        "Summary": "Microsoft announced that the transcription, dictation, and read aloud features will stop working in older versions of Office 365 applications in late January 2026. [...]",
        "Date": "2025-08-04",
        "Content": "Microsoft announced that the transcription, dictation, and read aloud features will stop working in older versions of Office 365 applications in late January 2026.\nRead aloud\nlets users hear documents and emails read back,\ntranscription\nconverts speech into text in real-time, and the\ndictation\nfeature allows for voice-to-text input across Office applications.\nThe company advised customers to update their Microsoft 365 Office apps to a version higher than 16.0.18827.20202 (released in\nearly July\n) by the end of January 2026 to maintain access to these accessibility and productivity features.\nThis deadline provides most organizations with approximately one year to plan and implement the necessary software updates across their environments.\nHowever, Redmond added that government cloud customers using GCC, GCC High, and DoD environments have two more months, until March 2026, to update their software.\n\"To ensure continued high-quality performance of the Read Aloud, Transcription, and Dictation features in Microsoft 365 Office apps, we're upgrading the backend service that powers these capabilities,\"\nthe company said\nin a Friday message center message.\n\"As a result, these features will no longer function on Office clients running versions earlier than 16.0.18827.20202 after January 2026.\"\nThe change stems from Microsoft's decision to upgrade the backend service that powers these voice-enabled capabilities. Users running Office clients with version numbers below the specified threshold will lose access to the features after the deadline.\nThe company stated that Office clients running versions higher than 16.0.18827.20202 will not be affected by the infrastructure upgrade and will experience no changes to their current functionality.\nIn May, Redmond also\nannounced plans\nto end support for Office apps on Windows 10 later this year and that it will continue providing security updates for three more years, until 2028.\nOne month earlier, in April, Microsoft\nreminded customers\nthat Office 2016 and Office 2019 will reach the end of extended support two months from now, on October 14, 2025.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft to disable Excel workbook links to blocked file types\nMicrosoft blocks ActiveX by default in Microsoft 365, Office 2024\nMicrosoft investigates outage affecting Microsoft 365 admin center\nMicrosoft 365 'Direct Send' abused to send phishing as internal users\nMicrosoft 365 to block file access via legacy auth protocols by default"
    },
    {
        "Title": "CTM360 spots Malicious ‘ClickTok’ Campaign Targeting TikTok Shop users",
        "Link": "https://www.bleepingcomputer.com/news/security/ctm360-spots-malicious-clicktok-campaign-targeting-tiktok-shop-users/",
        "Summary": "The ClickTok campaign lures victims with fake TikTok shops and drains their crypto wallets. CTM360 exposes how SparkKitty spyware spreads via trojanized apps, phishing pages, and AI-powered scams. [...]",
        "Date": "2025-08-04",
        "Content": "CTM360\nhas discovered a new global malware campaign dubbed \"ClickTok\" that spreads the SparkKitty spyware through fake TikTok shops to steal cryptocurrency wallets and drain funds.\nThe unique spyware trojan\ndiscovered by CTM360\nis specifically engineered to exploit TikTok Shop users across the globe.\nDubbed as “ClickTok”, this highly coordinated scam operation employs a hybrid scam model that combines phishing and malware to deceive buyers and affiliate program participants on TikTok’s growing e-commerce platform.\nIn the ClickTok campaign, TikTok shops were identified embedded with SparkKitty spyware, a variant closely resembling SparkCat, previously identified by Kaspersky.\nOnce installed, it infiltrates the user’s device, accesses the photo gallery, and extracts screenshots that may contain cryptocurrency wallet credentials. What makes ClickTok unique is its simultaneous use of phishing and malware tactics, significantly increasing its impact and stealth.\nThe scam begins with the impersonation of TikTok’s commercial ecosystem, including TikTok Shop, TikTok Wholesale, and TikTok Mall. Threat actors create fake TikTok websites that closely mimic the official interface, deceiving users into thinking they’re interacting with the real platform.\nVictims are lured into logging in and attempting to make purchases. During the checkout process, they are instructed to pay via cryptocurrency wallets.\nOnce payment is made, the trojanized app embedded with SparkKitty spyware, covertly captures sensitive data, including wallet credentials, by reading screenshots and images stored on the device, ultimately enabling the theft of digital funds.\nRead the full ClickTok SparkKitty Report.\nCTM360 has run a deep analysis of the ClickTok scam and published a detailed report on the ClickTok trojan.\nLearn how the SparkKitty spyware spreads via trojanized apps, phishing pages, and AI-powered scams.\nRead the full report\nThe Motive Behind ClickTok - A Hybrid Scam Structure\nThe attacker has two main objectives:\nPhishing Websites:\nThey incite users to open the fake Shop URLs distributed through meta ads, prompting users to enter login credentials, payment details, or seller information, all of which are silently harvested.\nCTM360\nhas tracked down a unique spyware trojan specifically engineered to exploit TikTok Shop users across the globe.\nDubbed as “ClickTok”, this highly coordinated scam operation employs a hybrid scam model that combines phishing and malware to deceive buyers and affiliate program participants on TikTok’s growing e-commerce platform.\nTrojanized Apps:\nOn mobile, the sites urge users to install modified TikTok Apps that are infected with SparkKitty, a malicious spyware variant capable of deep device surveillance, clipboard scraping, and credential theft.\nThese fake apps have the exact user interfaces as original TikTok shops, tricking victims into believing they’re interacting with a legitimate TikTok App while silently siphoning sensitive data in the background.\nFake Ads, AI Videos & Lookalike Domains\nClickTok scammers use Fake AI-generated Videos and Meta ads to reach a wider audience. These ads direct users to fake cybersquatted domains carefully crafted to look like real TikTok URLs.\nTo date, CTM360 has observed:\n10,000+ impersonated TikTok websites, many using free or inexpensive TLDs such as .top, .shop, .icu, and others.\nOver 5,000+ unique malicious app instances, spread via QR codes, messaging apps, and in-app downloads.\nFraudulent campaigns impersonating not just TikTok Shop, but also TikTok Wholesale and TikTok Mall.\nMotive & Monetization\nThe ClickTok campaign uses fake TikTok Shop login pages to harvest user credentials and malware distribution through trojanized apps that enable account hijacking. It implements an alternative payment structure that excludes traditional card transactions, instead requiring payments through cryptocurrency wallets.\nVictims are often encouraged to “top up” fake TikTok wallets or digital currencies like USDT, ETH and more.\nCTM360’s Recommendations\nCTM360 urges users and organizations to stay vigilant and take the following precautions:\nAvoid downloading modded, cracked, or unknown software, especially from torrent sites and Telegram.\nAlways verify domain authenticity before entering login or payment information, and manually check for spelling errors or suspicious domain extensions.\nReport any suspicious TikTok-related content, ads, or apps directly to TikTok or cybersecurity authorities in your country.\nBrands and sellers should regularly monitor brand abuse and impersonation trends using threat intelligence platforms.\nStrong antivirus or EDR Solution to prevent SparkKitty spyware breaches.\nIf you use a crypto wallet, go for one that is clipboard-protected.\nDetect Cyber Threats 24/7 with CTM360\nMonitor, analyze, and promptly mitigate risks across your external digital landscape with the CTM360.\nJoin our Community Edition\nSponsored and written by\nCTM360\n."
    },
    {
        "Title": "New Plague Linux malware stealthily maintains SSH access",
        "Link": "https://www.bleepingcomputer.com/news/security/new-plague-malware-backdoors-linux-devices-removes-ssh-session-traces/",
        "Summary": "A newly discovered Linux malware, which has evaded detection for over a year, allows attackers to gain persistent SSH access and bypass authentication on compromised systems. [...]",
        "Date": "2025-08-04",
        "Content": "A newly discovered Linux malware, which has evaded detection for over a year, allows attackers to gain persistent SSH access and bypass authentication on compromised systems.\nNextron Systems security researchers, who identified the malware and dubbed it \"Plague,\" describe it as a malicious Pluggable Authentication Module (PAM) that uses layered obfuscation techniques and environment tampering to avoid detection by traditional security tools.\nThis malware features anti-debugging capabilities to thwart analysis and reverse engineering attempts, string obfuscation to make detection more difficult, hardcoded passwords for covert access, as well as the ability to hide session artifacts that would normally reveal the attacker's activity on infected devices.\nOnce loaded, it will also scrub the runtime environment of any traces of malicious activity by unsetting SSH-related environment variables and redirecting command history to /dev/null to prevent logging, eliminating audit trails and login metadata, and erasing the attacker's digital footprint from system history logs and interactive sessions.\n\"Plague integrates deeply into the authentication stack, survives system updates, and leaves almost no forensic traces. Combined with layered obfuscation and environment tampering, this makes it exceptionally hard to detect using traditional tools,\"\nthreat researcher Pierre-Henri Pezier said\n.\n\"The malware actively sanitizes the runtime environment to eliminate evidence of an SSH session. Environment variables such as SSH_CONNECTION and SSH_CLIENT are unset using unsetenv, while HISTFILE is redirected to /dev/null to prevent shell command logging.\"\nWhile analyzing the malware, the researchers also discovered compilation artifacts indicating active development over an extended period, with samples compiled using various GCC versions across different Linux distributions.\nAdditionally, although multiple variants of the backdoor have been uploaded to VirusTotal over the past year, none of the antivirus engines have flagged them as malicious, suggesting that the creators of the malware have been operating undetected.\n\"The Plague backdoor represents a sophisticated and evolving threat to Linux infrastructure, exploiting core authentication mechanisms to maintain stealth and persistence,\" Pezier added. \"Its use of advanced obfuscation, static credentials, and environment tampering makes it particularly difficult to detect using conventional methods.\"\nIn May, Nextron Systems\ndiscovered another malware\nexploiting the flexibility of the PAM (Pluggable Authentication Modules) Linux authentication infrastructure, which enables its creators to steal credentials, bypass authentication, and gain stealthy persistence on compromised devices.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nHackers exploit SAP NetWeaver bug to deploy Linux Auto-Color malware\nNew Koske Linux malware hides in cute panda images\nMalicious npm packages posing as utilities delete project directories\nCISA open-sources Thorium platform for malware, forensic analysis\nInside a Real Clickfix Attack: How This Social Engineering Hack Unfolds"
    },
    {
        "Title": "Ransomware gangs join attacks targeting Microsoft SharePoint servers",
        "Link": "https://www.bleepingcomputer.com/news/security/ransomware-gangs-join-attacks-targeting-microsoft-sharepoint-servers/",
        "Summary": "Ransomware gangs have recently joined ongoing attacks targeting a Microsoft SharePoint vulnerability chain, part of a broader exploitation campaign that has already led to the breach of at least 148 organizations worldwide. [...]",
        "Date": "2025-08-04",
        "Content": "Ransomware gangs have recently joined ongoing attacks targeting a Microsoft SharePoint vulnerability chain, part of a broader exploitation campaign that has already led to the breach of at least 148 organizations worldwide.\nSecurity researchers at Palo Alto Networks' Unit 42 have discovered a 4L4MD4R ransomware variant, based on open-source\nMauri870\ncode, while analyzing incidents involving this SharePoint exploit chain (dubbed \"ToolShell\").\nThe ransomware was detected on July 27 after discovering a malware loader that downloads and executes the ransomware from theinnovationfactory[.]it (145.239.97[.]206).\nThe loader was spotted following a failed exploitation attempt that revealed malicious PowerShell commands designed to disable security monitoring on the targeted device.\n\"Analysis of the 4L4MD4R payload revealed that it is UPX-packed and written in GoLang. Upon execution, the sample decrypts an AES-encrypted payload in memory, allocates memory to load the decrypted PE file, and creates a new thread to execute it,\"\nUnit 42 said\n.\nThe 4L4MD4R ransomware encrypts files on the compromised system and demands a payment of 0.005 Bitcoin, generating ransom notes and encrypted file lists on infected systems.\n4L4MD4R decryption instructions (Unit 42)\n​Microsoft and Google\nhave also linked\nthe ToolShell attacks to Chinese threat actors, with Microsoft security researchers naming three separate state-backed hacking groups: Linen Typhoon, Violet Typhoon, and Storm-2603.\nTo date,\nnumerous high-profile targets have been compromised\nin this ongoing campaign, including the U.S. National Nuclear Security Administration, the Department of Education, Florida's Department of Revenue, the Rhode Island General Assembly, and government networks in Europe and the Middle East.\n\"Microsoft has observed two named Chinese nation-state actors, Linen Typhoon and Violet Typhoon exploiting these vulnerabilities targeting internet-facing SharePoint servers,\" Microsoft said. \"In addition, we have observed another China-based threat actor, tracked as Storm-2603, exploiting these vulnerabilities. Investigations into other actors also using these exploits are still ongoing.\"\nDutch cybersecurity firm Eye Security\nfirst detected\nToolShell exploitation targeting CVE-2025-49706 and CVE-2025-49704 in zero-day attacks, initially identifying 54 compromised organizations, including government entities and multinational companies. Check Point Research subsequently\nrevealed\nexploitation signs dating to July 7, targeting government, telecommunications, and technology organizations across North America and Western Europe.\nMicrosoft has patched the two flaws with the\nJuly 2025 Patch Tuesday updates\nand assigned two new CVE IDs (CVE-2025-53770 and CVE-2025-53771) for zero-days exploited to compromise fully patched SharePoint servers.\nEye Security Chief Technology Officer Piet Kerkhofs has also told BleepingComputer that the actual scope extends far beyond initial estimates, with the firm's data indicating that the attackers have infected at least 400 servers with malware across the networks of at least 148 organizations, many of which have been compromised for extended periods.\nThe Cybersecurity and Infrastructure Security Agency (CISA)\nhas added\nthe CVE-2025-53770 remote code execution vulnerability, part of the ToolShell exploit chain, to its catalog of exploited flaws and ordered federal agencies to secure their systems within 24 hours.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft: SharePoint flaws exploited in Warlock ransomware attacks\nUS nuclear weapons agency hacked in Microsoft SharePoint attacks\nMicrosoft links Sharepoint ToolShell attacks to Chinese hackers\nMicrosoft SharePoint zero-day exploited in RCE attacks, no patch available\nMicrosoft releases emergency patches for SharePoint RCE flaws exploited in attacks"
    },
    {
        "Title": "Mozilla warns of phishing attacks targeting add-on developers",
        "Link": "https://www.bleepingcomputer.com/news/security/mozilla-warns-of-phishing-attacks-targeting-add-on-developers/",
        "Summary": "Mozilla has warned browser extension developers of an active phishing campaign targeting accounts on its official AMO (addons.mozilla.org) repository. [...]",
        "Date": "2025-08-04",
        "Content": "Mozilla has warned browser extension developers of an active phishing campaign targeting accounts on its official AMO (addons.mozilla.org) repository.\nMozilla's add-on platform hosts\nover 60,000 browser extensions\nand\nmore than 500,000 themes\nused by tens of millions of users worldwide.\nAccording to Mozilla's advisory, these phishing emails are impersonating the AMO team and claim that the targeted developer accounts require updates to maintain access to development features.\n\"The developer community should be aware we've detected a phishing campaign targeting AMO (addons.mozilla.org) accounts. Add-on developers should exercise extreme caution and scrutiny when receiving emails claiming to be from Mozilla/AMO,\"\nMozilla cautioned\non Friday.\n\"Phishing emails typically state some variation of the message' Your Mozilla Add-ons account requires an update to continue accessing developer features.'\"\nTo secure their accounts, developers are advised to always verify if emails they receive are sent from a Mozilla domain (firefox.com, mozilla.org, mozilla.com, or their subdomains), that they pass standard email authentication checks (including SPF, DKIM, and DMARC), and not to click on links embedded in suspicious emails.\nMozilla also urged developers to navigate directly to its websites rather than following email links, and only enter their login credentials on official Mozilla or Firefox domains.\nMozilla phishing email (\nJuraj\n)\n​While Mozilla has yet to disclose the scale of this phishing campaign, the end goal of the attacks, or whether any developer accounts had already been successfully compromised, at least one developer\nclaims\nto have fallen victim.\nMozilla said it would provide updates if additional details about this campaign become available.\nThe warning comes after last month's announcement that Mozilla's Add-ons Operations team has launched a new security feature to help\nblock malicious Firefox extensions\ndesigned to drain cryptocurrency wallets.\nAndreas Wagner, the Add-ons Operations Manager who oversees the content security and review efforts for addons.mozilla.org (AMO), stated that Mozilla has identified and removed hundreds of extensions, including fraudulent cryptocurrency wallets, over the past few years.\nWhile not all of these extensions were directly linked to malicious activities, cybercriminals\nstole $494 million\nworth of cryptocurrency last year through wallet-draining attacks affecting over 300,000 wallet addresses.\nRed Report 2025: Analyzing the Top ATT&CK Techniques Used by 93% of Malware\nMalware targeting password stores surged 3X as attackers executed stealthy Perfect Heist scenarios, infiltrating and exploiting critical systems.\nDiscover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nHackers target Python devs in phishing attacks using fake PyPI site\nAttackers exploit link-wrapping services to steal Microsoft 365 logins\nSonicWall firewall devices hit in surge of Akira ransomware attacks\nHow attackers are still phishing \"phishing-resistant\" authentication\nThreat actors try to downgrade FIDO2 MFA auth in PoisonSeed phishing attack"
    },
    {
        "Title": "Nvidia Patches Critical RCE Vulnerability Chain",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/nvidia-patches-critical-rce-vulnerability-chain",
        "Summary": "The flaws in the company's Triton Inference Server enables model theft, data leaks, and response manipulation.",
        "Date": "2025-08-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/nvidia-patches-critical-rce-vulnerability-chain"
    },
    {
        "Title": "CISA &amp; FEMA Announce $100M+ in Community Cybersecurity Grants",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/cisa-fema-100m-cybersecurity-grants",
        "Summary": "The grants are intended to help states, tribes, and localities enhance their cybersecurity resilience by providing them with monetary resources to reduce risks and implement new procedures.",
        "Date": "2025-08-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/cisa-fema-100m-cybersecurity-grants"
    },
    {
        "Title": "Threat Actors Increasingly Leaning on GenAI Tools",
        "Link": "https://www.darkreading.com/remote-workforce/threat-actors-leaning-genai-tools",
        "Summary": "From &quot;eCrime&quot; actors to fake IT tech workers, CrowdStrike researchers found that adversaries are using AI to enhance their offensive cyber operations.",
        "Date": "2025-08-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/threat-actors-leaning-genai-tools"
    },
    {
        "Title": "Darktrace Acquires Mira Security",
        "Link": "https://www.darkreading.com/cybersecurity-operations/darktrace-acquires-mira-security",
        "Summary": "No summary available",
        "Date": "2025-08-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/darktrace-acquires-mira-security"
    },
    {
        "Title": "42% of Developers Using AI Say Their Codebase is Now Mostly AI-Generated",
        "Link": "https://www.darkreading.com/application-security/developers-using-ai-say-codebase-mostly-ai-generated",
        "Summary": "No summary available",
        "Date": "2025-08-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/developers-using-ai-say-codebase-mostly-ai-generated"
    },
    {
        "Title": "Akira Ramps Up Assault on SonicWall Firewalls, Suggesting Zero-Day",
        "Link": "https://www.darkreading.com/threat-intelligence/akira-sonicwall-firewalls-zero-day",
        "Summary": "An uptick of ransomware activity by the group in late July that uses the vendor's SSL VPN devices for initial intrusion shows evidence of an as-yet-undisclosed flaw under exploitation.",
        "Date": "2025-08-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/akira-sonicwall-firewalls-zero-day"
    },
    {
        "Title": "Turning Human Vulnerability Into Organizational Strength",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/human-vulnerability-organizational-strength",
        "Summary": "Investing in building a human-centric defense involves a combination of adaptive security awareness training, a vigilant and skeptical culture, and the deployment of layered technical controls.",
        "Date": "2025-08-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/human-vulnerability-organizational-strength"
    },
    {
        "Title": "Nvidia Triton Vulnerabilities Pose Big Risk to AI Models",
        "Link": "https://www.securityweek.com/nvidia-triton-vulnerabilities-pose-big-risk-to-ai-models/",
        "Summary": "<p>Nvidia has patched over a dozen vulnerabilities in Triton Inference Server, including another set of vulnerabilities that threaten AI systems. </p>\n<p>The post <a href=\"https://www.securityweek.com/nvidia-triton-vulnerabilities-pose-big-risk-to-ai-models/\">Nvidia Triton Vulnerabilities Pose Big Risk to AI Models</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/nvidia-triton-vulnerabilities-pose-big-risk-to-ai-models/"
    },
    {
        "Title": "US Announces $100 Million for State, Local and Tribal Cybersecurity",
        "Link": "https://www.securityweek.com/us-announces-100-million-for-state-local-and-tribal-cybersecurity/",
        "Summary": "<p>CISA and FEMA announced two grants of more than $100 million for state, local, and tribal governments looking to improve cybersecurity.</p>\n<p>The post <a href=\"https://www.securityweek.com/us-announces-100-million-for-state-local-and-tribal-cybersecurity/\">US Announces $100 Million for State, Local and Tribal Cybersecurity</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/us-announces-100-million-for-state-local-and-tribal-cybersecurity/"
    },
    {
        "Title": "AI Guardrails Under Fire: Cisco’s Jailbreak Demo Exposes AI Weak Points",
        "Link": "https://www.securityweek.com/ai-guardrails-under-fire-ciscos-jailbreak-demo-exposes-ai-weak-points/",
        "Summary": "<p>Cisco’s latest jailbreak method reveals just how easily sensitive data can be extracted from chatbots trained on proprietary or copyrighted content.</p>\n<p>The post <a href=\"https://www.securityweek.com/ai-guardrails-under-fire-ciscos-jailbreak-demo-exposes-ai-weak-points/\">AI Guardrails Under Fire: Cisco&#8217;s Jailbreak Demo Exposes AI Weak Points</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/ai-guardrails-under-fire-ciscos-jailbreak-demo-exposes-ai-weak-points/"
    },
    {
        "Title": "Sean Cairncross Confirmed by Senate as National Cyber Director",
        "Link": "https://www.securityweek.com/sean-cairncross-confirmed-by-senate-as-national-cyber-director/",
        "Summary": "<p>The US Senate voted to confirm Sean Cairncross as the National Cyber Director, five months after nominalization.</p>\n<p>The post <a href=\"https://www.securityweek.com/sean-cairncross-confirmed-by-senate-as-national-cyber-director/\">Sean Cairncross Confirmed by Senate as National Cyber Director</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/sean-cairncross-confirmed-by-senate-as-national-cyber-director/"
    },
    {
        "Title": "Cybersecurity M&A Roundup: 44 Deals Announced in July 2025",
        "Link": "https://www.securityweek.com/cybersecurity-ma-roundup-44-deals-announced-in-july-2025/",
        "Summary": "<p>Forty-four cybersecurity merger and acquisition (M&#038;A) deals were announced in July 2025.</p>\n<p>The post <a href=\"https://www.securityweek.com/cybersecurity-ma-roundup-44-deals-announced-in-july-2025/\">Cybersecurity M&#038;A Roundup: 44 Deals Announced in July 2025</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cybersecurity-ma-roundup-44-deals-announced-in-july-2025/"
    },
    {
        "Title": "Northwest Radiologists Data Breach Impacts 350,000 Washingtonians",
        "Link": "https://www.securityweek.com/northwest-radiologists-data-breach-impacts-350000-washingtonians/",
        "Summary": "<p>Northwest Radiologists says the personal information of 350,000 Washington State residents was stolen in a January 2025 data breach.</p>\n<p>The post <a href=\"https://www.securityweek.com/northwest-radiologists-data-breach-impacts-350000-washingtonians/\">Northwest Radiologists Data Breach Impacts 350,000 Washingtonians</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/northwest-radiologists-data-breach-impacts-350000-washingtonians/"
    },
    {
        "Title": "Several Vulnerabilities Patched in AI Code Editor Cursor",
        "Link": "https://www.securityweek.com/several-vulnerabilities-patched-in-ai-code-editor-cursor/",
        "Summary": "<p>Attackers could silently modify sensitive MCP files to trigger the execution of arbitrary code without requiring user approval.</p>\n<p>The post <a href=\"https://www.securityweek.com/several-vulnerabilities-patched-in-ai-code-editor-cursor/\">Several Vulnerabilities Patched in AI Code Editor Cursor </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/several-vulnerabilities-patched-in-ai-code-editor-cursor/"
    },
    {
        "Title": "Gene Sequencing Giant Illumina Settles for $9.8M Over Product Vulnerabilities",
        "Link": "https://www.securityweek.com/gene-sequencing-giant-illumina-settles-for-9-8m-over-product-vulnerabilities/",
        "Summary": "<p>Illumina will pay $9.8 million to settle accusations that products provided to the US government were affected by cybersecurity flaws.</p>\n<p>The post <a href=\"https://www.securityweek.com/gene-sequencing-giant-illumina-settles-for-9-8m-over-product-vulnerabilities/\">Gene Sequencing Giant Illumina Settles for $9.8M Over Product Vulnerabilities</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-08-04",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/gene-sequencing-giant-illumina-settles-for-9-8m-over-product-vulnerabilities/"
    },
    {
        "Title": "Antalya Veterinary Doctors Association Allegedly Breached",
        "Link": "https://dailydarkweb.net/antalya-veterinary-doctors-association-allegedly-breached/",
        "Summary": "A threat actor has allegedly put the database and system access for the Antalya Veterinary Doctors Association up for sale on a cybercrime forum. The victim, the official professional organization for veterinarians in the major Turkish province of Antalya, is a crucial body that regulates and represents hundreds of animal health professionals in the region. [&#8230;]",
        "Date": "2025-08-04",
        "Content": "A threat actor has allegedly put the database and system access for the Antalya Veterinary Doctors Association up for sale on a cybercrime forum. The victim, the official professional organization for veterinarians in the major Turkish province of Antalya, is a crucial body that regulates and represents hundreds of animal health professionals in the region. The data breach appears to be severe, with the seller claiming to offer full administrative control over the association’s digital assets.\nAccording to the forum post, the threat actor is selling a package that includes administrator panel access, a web shell for executing commands on the server, and full access to the organization’s MySQL database. The sale highlights a significant compromise of the association’s infrastructure. The post claims the database contains highly sensitive and personal information belonging to the member veterinarians.\nThe leaked data allegedly includes a wide range of personally identifiable information (PII). The exposure of such data could place the victims at high risk for identity theft, fraud, and targeted phishing attacks. The data fields listed for sale are:\nFull name\nMother/Father names\nHeight, weight, shoe size\nRelative contact numbers\nVeterinarian’s phone numbers\nFull physical address\nEmail(s)\nBlood type\nTurkish ID number\nPasswords (hashed, some weak)\nDate of birth\nProfile photo (JPEG links)\nTags:\nAntalya\nCyberSecurity\ndata for sale\ndata-breach\nPII\nTurkey\nveterinary"
    },
    {
        "Title": "Iranian Government Portal Allegedly Breached",
        "Link": "https://dailydarkweb.net/iranian-government-portal-allegedly-breached/",
        "Summary": "A threat actor has allegedly breached the official website of the Iranian government, iran[.]gov[.]ir, and is offering a database containing sensitive information for sale. The targeted website serves as the main portal for the government of Iran, making it a critical piece of national digital infrastructure. A successful breach of this magnitude could expose personal [&#8230;]",
        "Date": "2025-08-04",
        "Content": "A threat actor has allegedly breached the official website of the Iranian government,\niran[.]gov[.]ir\n, and is offering a database containing sensitive information for sale. The targeted website serves as the main portal for the government of Iran, making it a critical piece of national digital infrastructure. A successful breach of this magnitude could expose personal details of both government officials and private citizens, posing a significant national security risk.\nThe threat actor claims the compromised database contains a wealth of personally identifiable information (PII). The data is being advertised on a dark web forum and is said to include details on high-ranking government officials as well as the general populace. The seller has listed the price for the entire database at $2,000 USDT.\nAccording to the forum post, the following data types are included in the breach:\nName\nSurname\nFather’s Name\nPhone Number\nEmail\nAddress\nTags:\ncybersecurity news\ndata-breach\ngovernment\nIran\nPII Leak"
    },
    {
        "Title": "Qilin Ransomware Group Allegedly Breaches US Industrial Supplier Aggressive Air Compressor & Co",
        "Link": "https://dailydarkweb.net/qilin-ransomware-group-allegedly-breaches-us-industrial-supplier-aggressive-air-compressor-co/",
        "Summary": "The Qilin ransomware group has allegedly added Aggressive Air Compressor &#38; Co., a US-based industrial equipment supplier, to its list of victims. In a dark web post dated August 3, 2025, the group claimed to have exfiltrated 74 GB of data from the Michigan company, which specializes in the sale and service of air compressors. [&#8230;]",
        "Date": "2025-08-04",
        "Content": "The Qilin ransomware group has allegedly added Aggressive Air Compressor & Co., a US-based industrial equipment supplier, to its list of victims. In a dark web post dated August 3, 2025, the group claimed to have exfiltrated 74 GB of data from the Michigan company, which specializes in the sale and service of air compressors. The operators have threatened to release the data publicly if their demands are not met within a 10-day period, putting significant pressure on the firm.\nTo substantiate their claims, the threat actors allegedly leaked a cache of files as proof of the breach. The sample data suggests a deep compromise of the company’s network and purportedly includes a wide range of sensitive information. The compromised data allegedly contains:\nCorporate financial records and internal invoices\nEmployee and customer contact lists\nScanned personal identification documents, including driver’s licenses\nHuman resources and insurance-related documents\nTags:\nAggressive Air Compressor & Co\nCyberSecurity\ndata-breach\ndata-leak\nPII\nQilin\nransomware\nUSA"
    },
    {
        "Title": "Dell Technologies Allegedly Hit by Massive 1.3 TB Data Breach",
        "Link": "https://dailydarkweb.net/dell-technologies-allegedly-hit-by-massive-1-3-tb-data-breach/",
        "Summary": "A threat actor has allegedly breached the American technology giant Dell Technologies and is attempting to sell a massive trove of internal data. The actor posted on a popular cybercrime forum claiming to possess 1.3 TB of data, encompassing over 416,000 files allegedly exfiltrated from the company&#8217;s systems. The post offers the data for sale, [&#8230;]",
        "Date": "2025-08-04",
        "Content": "A threat actor has allegedly breached the American technology giant Dell Technologies and is attempting to sell a massive trove of internal data. The actor posted on a popular cybercrime forum claiming to possess 1.3 TB of data, encompassing over 416,000 files allegedly exfiltrated from the company’s systems. The post offers the data for sale, signaling a potentially significant security incident for the multinational corporation.\nDell Technologies is a globally recognized leader in the personal computer market, also providing a vast range of hardware, software, and service solutions to businesses and consumers worldwide. Headquartered in Texas, USA, the company is a critical part of the global technology supply chain, making any significant data breach a matter of high concern due to the potential exposure of sensitive corporate, employee, or partner information.\nThe origin of the breach is claimed to be from Dell’s own infrastructure. An analysis of the allegedly leaked file list suggests the data originates from internal file servers, with directory paths referencing regions like the Americas and EMEA (Europe, the Middle East, and Africa). The contents appear to be highly technical and internal in nature. The allegedly leaked data includes:\nInformation on internal systems and infrastructure\nTechnical data related to virtualization products like VMware and Nutanix\nFiles from internal user folders\nPerformance reports and knowledge base articles\nInternal project files and system configurations\nTags:\ncyber-attack\nCyberSecurity\ndata-breach\ndata-leak\nDell\nUSA"
    },
    {
        "Title": "D4rk4rmy Ransomware Allegedly Breaches Casino de Monte-Carlo and Big Rock Resort",
        "Link": "https://dailydarkweb.net/d4rk4rmy-ransomware-allegedly-breaches-casino-de-monte-carlo-and-big-rock-resort/",
        "Summary": "The D4rk4rmy ransomware group has allegedly added two prominent hospitality sector entities to its list of victims. In a post dated August 3, 2025, the threat actor claimed to have successfully breached the networks of Monaco&#8217;s world-famous Casino de Monte-Carlo and California&#8217;s Big Rock Resort. The group&#8217;s claims suggest a significant data theft from both [&#8230;]",
        "Date": "2025-08-04",
        "Content": "The D4rk4rmy ransomware group has allegedly added two prominent hospitality sector entities to its list of victims. In a post dated August 3, 2025, the threat actor claimed to have successfully breached the networks of Monaco’s world-famous Casino de Monte-Carlo and California’s Big Rock Resort. The group’s claims suggest a significant data theft from both establishments, targeting sensitive customer and corporate information.\nThe alleged victims are major players in their respective luxury and leisure markets, making them high-value targets for cybercriminals. The attack highlights the increasing focus of ransomware gangs on the hospitality industry, which holds vast amounts of personal and financial data. The targeted organizations allegedly include:\nCasino de Monte-Carlo (Monte-Carlo Société des Bains de Mer):\nA prestigious hospitality group founded in 1863, renowned for shaping Monaco’s identity as a global symbol of luxury. The group operates iconic properties including the Hôtel de Paris Monte-Carlo, the Casino de Monte-Carlo, and hosts exclusive events like the Formula 1 Monaco Grand Prix.\nBig Rock Resort:\nA lakefront cabin resort located in June Lake, California. It specializes in accommodations for individuals, families, weddings, and corporate retreats, offering a private and exclusive experience for its guests.\nAccording to the threat actor’s post, a substantial amount of sensitive data was exfiltrated from both victims. For the Casino de Monte-Carlo, the allegedly stolen data includes:\nCustomer logs\nHotel registration details\nFinancial transactions\nVIP client information\nEmployee data and IDs\nPassport details\nDamage reports\nFor Big Rock Resort, the group claims to have obtained:\nVIP reservation client information\nBanking information\nTags:\nBig Rock Resort\nD4rk4rmy\ndata-breach\nhospitality\nMonte-Carlo\nransomware"
    },
    {
        "Title": "Lynx Ransomware Allegedly Breaches Clean Energy Firm Frontline Bioenergy",
        "Link": "https://dailydarkweb.net/lynx-ransomware-allegedly-breaches-clean-energy-firm-frontline-bioenergy/",
        "Summary": "The Lynx ransomware group has allegedly added Frontline Bioenergy, a key player in the renewable energy sector, to its list of victims. Frontline Bioenergy, a company with a reported income of $5 million, has been a specialist in designing systems and proprietary equipment for biomass gasification since 2003. The company plays an important role in [&#8230;]",
        "Date": "2025-08-04",
        "Content": "The Lynx ransomware group has allegedly added Frontline Bioenergy, a key player in the renewable energy sector, to its list of victims. Frontline Bioenergy, a company with a reported income of $5 million, has been a specialist in designing systems and proprietary equipment for biomass gasification since 2003. The company plays an important role in the development and exploration of alternatives for clean fuel and energy production, making this alleged attack particularly noteworthy.\nAccording to a post on the threat actor’s dark web leak site dated August 4, 2025, the ransomware group claims to have successfully breached the company’s network and exfiltrated sensitive data. The attackers have published what they describe as proof of the breach, suggesting a double-extortion tactic is in play. The group alleges to have stolen various types of critical information.\nThe threat actors listed the categories of the compromised data, which allegedly include:\nProof of compromise\nEncrypted files\nActive Directory (AD) Dump\nThis development indicates a significant security incident, with the potential exposure of sensitive corporate and infrastructure data. As of now, Frontline Bioenergy has not released an official statement regarding the alleged cyberattack.\nTags:\nClean Energy\nCyberSecurity\ndata-breach\nFrontline Bioenergy\nLynx\nransomware\nRenewable Energy"
    }
]