[
    {
        "Title": "[Webinar] From Code to Cloud to SOC: Learn a Smarter Way to Defend Modern Applications",
        "Link": "https://thehackernews.com/2025/05/from-code-to-cloud-to-soc-learn-smarter.html",
        "Summary": "Modern apps move fast—faster than most security teams can keep up. As businesses rush to build in the cloud, security often lags behind. Teams scan code in isolation, react late to cloud threats, and monitor SOC alerts only after damage is done.\nAttackers don’t wait. They exploit vulnerabilities within hours. Yet most organizations take days to respond to critical cloud alerts. That delay isn’t",
        "Date": "2025-05-17",
        "Content": "Modern apps move fast—faster than most security teams can keep up. As businesses rush to build in the cloud, security often lags behind. Teams scan code in isolation, react late to cloud threats, and monitor SOC alerts only after damage is done.\nAttackers don't wait. They exploit vulnerabilities within hours. Yet most organizations take days to respond to critical cloud alerts. That delay isn't just risky—it's an open door.\nThe problem? Security is split across silos. DevSecOps, CloudSec, and SOC teams all work separately. Their tools don't talk. Their data doesn't sync. And in those gaps, 80% of cloud exposures slip through—exploitable, avoidable, and often invisible until it's too late.\nThis free webinar ,\"\nBreaking Down Security Silos: Why Application Security Must Span from Code to Cloud to SOC\n,\" shows you how to fix that. Join Ory Segal, Technical Evangelist at Cortex Cloud (Palo Alto Networks), and discover a practical approach to securing your apps from code to cloud to SOC—all in one connected strategy.\nYou'll learn:\nWhy code scanning alone isn't enough\nWhere attackers find your biggest blind spots\nHow to unify your security tools and teams\nHow to cut response times from days to hours\nIf you're in AppSec, CloudOps, DevSecOps, or SOC—you'll walk away with insights you can apply immediately.\nWatch this Webinar\nStill relying on just code reviews or siloed tools? That's only part of the picture. Attackers see your whole environment. It's time you did too.\nJoin us and take the first step toward smarter, faster, full-stack security.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "New 'Defendnot' tool tricks Windows into disabling Microsoft Defender",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/new-defendnot-tool-tricks-windows-into-disabling-microsoft-defender/",
        "Summary": "A new tool called 'Defendnot' can disable Microsoft Defender on Windows devices by registering a fake antivirus product, even when no real AV is installed. [...]",
        "Date": "2025-05-17",
        "Content": "A new tool called 'Defendnot' can disable Microsoft Defender on Windows devices by registering a fake antivirus product, even when no real AV is installed.\nThe trick utilizes an undocumented Windows Security Center (WSC) API that antivirus software uses to tell Windows it is installed and is now managing the real-time protection for the device.\nWhen an antivirus program is registered, Windows automatically disables Microsoft Defender to avoid conflicts from running multiple security applications on the same device.\nThe\nDefendnot tool\n, created by researcher\nes3n1n\n, abuses this API by registering a fake antivirus product that meets all of Windows' validation checks.\nThe tool is based on a previous project called\nno-defender\n, which used code from a third-party antivirus product to spoof registration with WSC. That earlier tool was pulled from GitHub after the vendor filed a DMCA takedown.\n\"Then, after a few weeks after the release, the project blew up quite a bit and gained ~1.5k stars, after that the developers of the antivirus I was using filed a DMCA takedown request and I didn't really want to do anything with that so just erased everything and called it a day,\" the developer explains in a\nblog post\n.\nDefendnot avoids copyright issues by building the functionality from scratch through a dummy antivirus DLL.\nNormally, WSC API is safeguarded through Protected Process Light (PPL), valid digital signatures, and other features.\nTo bypass these requirements, Defendnot injects its DLL into a system process, Taskmgr.exe, that is signed and already trusted by Microsoft. From within that process, it can register the dummy antivirus with a spoofed display name.\nOnce registered, Microsoft Defender immediately shuts itself off, leaving no active protection on the device.\nDefendnot registered on a device\nSource: BleepingComputer\nThe tool also includes a loader that passes configuration data via a ctx.bin file and lets you set the antivirus name you want to use, turn off registration, and enable verbose logging.\nFor persistence, Defendnot creates an autorun through the Windows Task Scheduler so that it starts when you log in to Windows.\nWhile Defendnot is considered a research project, the tool demonstrates how trusted system features can be manipulated to turn off security features.\nMicrosoft Defender is currently detecting and quarantining Defendnot as a 'Win32/Sabsik.FL.!ml; detection.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft Defender will isolate undiscovered endpoints to block attacks\nMicrosoft May 2025 Patch Tuesday fixes 5 exploited zero-days, 72 flaws\nPlay ransomware exploited Windows logging flaw in zero-day attacks\nMicrosoft: Windows Server hotpatching to require subscription\nWindows \"inetpub\" security fix can be abused to block future updates"
    }
]