[
    {
        "Title": "New HTTPBot Botnet Launches 200+ Precision DDoS Attacks on Gaming and Tech Sectors",
        "Link": "https://thehackernews.com/2025/05/new-httpbot-botnet-launches-200.html",
        "Summary": "Cybersecurity researchers are calling attention to a new botnet malware called HTTPBot that has been used to primarily single out the gaming industry, as well as technology companies and educational institutions in China.\n\"Over the past few months, it has expanded aggressively, continuously leveraging infected devices to launch external attacks,\" NSFOCUS said in a report published this week. \"By",
        "Date": "2025-05-16",
        "Content": "Cybersecurity researchers are calling attention to a new botnet malware called\nHTTPBot\nthat has been used to primarily single out the gaming industry, as well as technology companies and educational institutions in China.\n\"Over the past few months, it has expanded aggressively, continuously leveraging infected devices to launch external attacks,\" NSFOCUS\nsaid\nin a report published this week. \"By employing highly simulated HTTP Flood attacks and dynamic feature obfuscation techniques, it circumvents traditional rule-based detection mechanisms.\"\nHTTPBot, first spotted in the wild in August 2024, gets its name from the use of HTTP protocols to launch distributed denial-of-service attacks. Written in Golang, it's something of an anomaly given its targeting of Windows systems.\nThe Windows-based botnet trojan is noteworthy for its use in precisely targeted attacks aimed at high-value business interfaces such as game login and payment systems.\n\"This attack with 'scalpel-like' precision poses a systemic threat to industries that rely on real-time interaction,\" the Beijing-headquartered company said. \"HTTPBot marks a paradigm shift in DDoS attacks, moving from 'indiscriminate traffic suppression' to 'high-precision business strangulation.'\"\nHTTPBot is estimated to have issued no less than 200 attack instructions since the start of April 2025, with the attacks designed to strike the gaming industry, technology companies, educational institutions, and tourism portals in China.\nOnce installed and run, the malware conceals its graphical user interface (GUI) to sidestep process monitoring by both users and security tools in an effort to increase the stealthiness of the attacks. It also resorts to unauthorized Windows Registry manipulation to ensure that it's run automatically on system startup.\nThe botnet malware then proceeds to establish contact with a command-and-control (C2) server to await further instructions to execute HTTP flood attacks against specific targets by sending a high volume of HTTP requests. It supports various attack modules -\nBrowserAttack, which involves using hidden Google Chrome instances to mimic legitimate traffic while exhausting server resources\nHttpAutoAttack, which makes use of a cookie-based approach to accurately simulate legitimate sessions\nHttpFpDlAttack, which uses the HTTP/2 protocol and opts for an approach that seeks to increase the CPU loader on the server by coercing it into returning large responses\nWebSocketAttack, which uses \"ws://\" and \"wss://\" protocols to establish WebSocket connections\nPostAttack, which forces the use of HTTP POST to conduct the attack\nCookieAttack, which adds a cookie processing flow based on the BrowserAttack attack method\n\"DDoS Botnet families tend to congregate on Linux and IoT platforms,\" NSFOCUS said. \"However, the HTTPBot Botnet family has specifically targeted the Windows platform.\"\n\"By deeply simulating protocol layers and mimicking legitimate browser behavior, HTTPBot bypasses defenses that rely on protocol integrity. It also continuously occupies server session resources through randomized URL paths and cookie replenishment mechanisms, rather than relying on sheer traffic volume.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Top 10 Best Practices for Effective Data Protection",
        "Link": "https://thehackernews.com/2025/05/top-10-best-practices-for-effective.html",
        "Summary": "Data is the lifeblood of productivity, and protecting sensitive data is more critical than ever. With cyber threats evolving rapidly and data privacy regulations tightening, organizations must stay vigilant and proactive to safeguard their most valuable assets. But how do you build an effective data protection framework?\nIn this article, we'll explore data protection best practices from meeting",
        "Date": "2025-05-16",
        "Content": "Data is the lifeblood of productivity, and protecting sensitive data is more critical than ever. With cyber threats evolving rapidly and data privacy regulations tightening, organizations must stay vigilant and proactive to safeguard their most valuable assets. But how do you build an effective data protection framework?\nIn this article, we'll explore data protection best practices from meeting compliance requirements to streamlining day-to-day operations. Whether you're securing a small business or a large enterprise, these top strategies will help you build a strong defense against breaches and keep your sensitive data safe.\n1. Define your data goals\nWhen tackling any data protection project, the first step is always to understand the outcome you want.\nFirst, understand what data you need to protect. Identify your crown jewel data, and where you THINK it lives. (It's probably more distributed than you expect, but this is a key step to help you define your protection focus.) Work with business owners to find any data outside the typical scope that you need to secure.\nThis is all to answer the question: \"What data would hurt the company if it were breached?\"\nSecond, work with the C-suit and board of directors to define what your data protection program will look like. Understand your budget, your risk tolerance to data loss, and what resources you have (or may need). Define how aggressive your protection program will be so you can balance risk and productivity. All organizations need to strike a balance between the two.\n2. Automate data classification\nNext, begin your data classification journey—that is, find your data and catalog it. This is often the most difficult step in the journey, as organizations create new data all the time.\nYour first instinct may be to try to keep up with all your data, but this may be a fool's errand. The key to success is to have classification capabilities everywhere data moves (endpoint, inline, cloud), and rely on your DLP policy to jump in when risk arises. (More on this later.)\nAutomation in data classification is becoming a lifesaver thanks to the power of AI. AI-powered classification can be faster and more accurate than traditional ways of classifying data with DLP. Ensure any solution you are evaluating can use AI to instantly uncover and discover data without human input.\n3. Focus on zero trust security for access control\nAdopting a zero trust architecture is crucial for modern data protection strategies to be effective. Based on the maxim \"never trust, always verify,\" zero trust assumes security threats can come from inside or outside your network. Every access request is authenticated and authorized, greatly reducing the risk of unauthorized access and data breaches.\nLook for a zero trust solution that emphasizes the importance of least-privileged access control between users and apps. With this approach, users never access the network, reducing the ability for threats to move laterally and propagate to other entities and data on the network. The principle of least privilege ensures that users have only the access they need for their roles, reducing the attack surface.\n4. Centralize DLP for consistent alerting\nData loss prevention (DLP) technology is the core of any data protection program. That said, keep in mind that DLP is only a subset of a larger data protection solution. DLP enables the classification of data (along with AI) to ensure you can accurately find sensitive data. Ensure your DLP engine can consistently alert correctly on the same piece of data across devices, networks, and clouds.\nThe best way to ensure this is to embrace a centralized DLP engine that can cover all channels at once. Avoid point products that bring their own DLP engine (endpoint, network, CASB), as this can lead to multiple alerts on one piece of moving data, slowing down incident management and response.\nLook to embrace Gartner's security service edge approach, which delivers DLP from a centralized cloud service. Focus on vendors that support the most channels so that, as your program grows, you can easily add protection across devices, inline, and cloud.\n5. Ensure blocking across key loss channels\nOnce you have a centralized DLP, focus on the most important data loss channels to your organization. (You'll need to add more channels as you grow, so ensure your platform can accommodate all of them and grow with you.) The most important channels can vary, but every organization focuses on certain common ones:\nWeb/Email:\nThe most common ways users accidentally send sensitive data outside the organization.\nSaaS data (CASB):\nAnother common loss vector, as users can easily share data externally.\nEndpoint:\nA key focus for many organizations looking to lock down USB, printing, and network shares.\nUnmanaged devices/BYOD:\nIf you have a large BYOD footprint, browser isolation is an innovative way to secure data headed to these devices without an agent or VDI. Devices are placed in an isolated browser, which enforces DLP inspection and prevents cut, paste, download, or print. (More on this later.)\nSaaS posture control (SSPM/supply chain):\nSaaS platforms like Microsoft 365 can often be misconfigured. Continuously scanning for gaps and risky third-party integrations is key to minimizing data breaches.\nIaaS posture control (DSPM):\nMost companies have a lot of sensitive data across AWS, Azure, or Google Cloud. Finding it all, and closing risky misconfigurations that expose it, is the driver behind data security posture management (DSPM).\n6. Understand and maintain compliance\nGetting a handle on compliance is a key step for great data protection. You may need to keep up with many different regulations, depending on your industry (GDPR, PCI DSS, HIPAA, etc.). These rules are there to make sure personal data is safe and organizations are handling it the right way. Stay informed on the latest mandates to avoid fines and protect your brand, all while building trust with your customers and partners.\nTo keep on top of compliance, strong data governance practices are a must. This means regular security audits, keeping good records, and making sure your team is well-trained. Embrace technological approaches that help drive better compliance, such as data encryption and monitoring tools. By making compliance part of your routine, you can stay ahead of risks and ensure your data protection is both effective and in line with requirements.\n7. Strategize for BYOD\nAlthough not a concern for every organization, unmanaged devices present a unique challenge for data protection. Your organization doesn't own or have agents on these devices, so you can't ensure their security posture or patch level, wipe them remotely, and so on. Yet their users (like partners or contractors) often have legitimate reasons to access your critical data.\nYou don't want sensitive data to land on a BYOD endpoint and vanish from your sight. Until now, solutions to secure BYOD have revolved around CASB reverse proxies (problematic) and VDI approaches (expensive).\nBrowser isolation provides an effective and eloquent way to secure data without the cost and complexity of those approaches. By placing BYOD endpoints in an isolated browser (part of the security service edge), you can enforce great data protection without an endpoint agent. Data is streamed to the device as pixels, allowing interaction with the data but preventing download and cut/paste. You can also apply DLP inspection to the session and data based on your policy.\n8. Control your cloud posture with SSPM and DSPM\nCloud posture is one of the most commonly overlooked aspects of data hygiene. SaaS platforms and public clouds have many settings that DevOps teams without security expertise can easily overlook. The resulting misconfigurations can lead to dangerous gaps that expose sensitive data. Many of the largest data breaches in history have happened because such gaps let adversaries walk right in.\nSaaS security posture management (SSPM) and data security posture management (DSPM for IaaS) are designed to uncover and help remediate these risks. By leveraging API access, SSPM and DSPM can continuously scan your cloud deployment, locate sensitive data, identify misconfigurations, and remediate exposures. Some SSPM approaches also feature integrated compliance with frameworks like NIST, ISO, and SOC 2.\n9. Don't forget about data security training\nData security training is often where data protection programs fall apart. If users don't understand or support your data protection goals, dissent can build across your teams and derail your program. Spend time building a training program that highlights your objectives and the value data protection will bring the organization. Ensure upper management supports and sponsors your data security training initiatives.\nSome solutions offer built-in user coaching with incident management workflows. This valuable feature allows you to notify users about incidents via Slack or email for justification, education, and policy adjustment if needed. Involving users in their incidents helps promote awareness of data protection practices as well as how to identify and safely handle sensitive content.\n10. Automate incident management and workflows\nLastly, no data protection program would be complete without day-to-day operations. Ensuring your team can efficiently manage and quickly respond to incidents is critical. One way to ensure streamlined processes is to embrace a solution that enables workflow automation.\nDesigned to automate common incident management and response tasks, this feature can be a lifesaver for IT teams. By saving time and money while improving response times, IT teams can do more with less. Look for solutions that have a strong workflow automation offering integrated into the SSE to make incident management efficient and centralized.\nBringing it all together\nData protection is not a one-time project; it's an ongoing commitment. Staying informed of data protection best practices will help you build a resilient defense against evolving threats and ensure your organization's long-term success.\nRemember: investing in data protection is not just about mitigating risks and preventing data breaches. It's also about building trust, maintaining your reputation, and unlocking new opportunities for growth.\nLearn more at\nzscaler.com/security\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Researchers Expose New Intel CPU Flaws Enabling Memory Leaks and Spectre v2 Attacks",
        "Link": "https://thehackernews.com/2025/05/researchers-expose-new-intel-cpu-flaws.html",
        "Summary": "Researchers at ETH Zürich have discovered yet another security flaw that they say impacts all modern Intel CPUs and causes them to leak sensitive data from memory, showing that the vulnerability known as Spectre continues to haunt computer systems after more than seven years.\nThe vulnerability, referred to as Branch Privilege Injection (BPI), \"can be exploited to misuse the prediction",
        "Date": "2025-05-16",
        "Content": "Researchers at ETH Zürich have discovered yet another security flaw that they say impacts all modern Intel CPUs and causes them to leak sensitive data from memory, showing that the vulnerability known as\nSpectre\ncontinues to haunt computer systems after more than seven years.\nThe vulnerability, referred to as Branch Privilege Injection (BPI), \"can be exploited to misuse the prediction calculations of the CPU (central processing unit) in order to gain unauthorized access to information from other processor users,\" ETH Zurich\nsaid\n.\nKaveh Razavi, head of the Computer Security Group (COMSEC) and one of the authors of the study, said the shortcoming affects all Intel processors, potentially enabling bad actors to read the contents of the processor's cache and the working memory of another user of the same CPU.\nThe attack leverages what's called Branch Predictor Race Conditions (\nBPRC\n) that emerge when a processor switches between prediction calculations for two users with different permissions, opening the door to a scenario where an unprivileged hacker could exploit it to bypass security barriers and access confidential information from a privileged process.\nIntel has issued microcode patches to address the vulnerability, which has been assigned the CVE identifier CVE-2024-45332 (CVSS v4 score: 5.7).\n\"Exposure of sensitive information caused by shared microarchitectural predictor state that influences transient execution in the indirect branch predictors for some Intel Processors may allow an authenticated user to potentially enable information disclosure via local access,\" Intel\nsaid\nin an advisory released on May 13.\nThe disclosure comes as researchers from the Systems and Network Security Group (VUSec) at Vrije Universiteit Amsterdam detailed a category of self-training\nSpectre v2\nattacks codenamed\nTraining Solo\n.\n\"Attackers can speculatively hijack control flow within the same domain (e.g., kernel) and leak secrets across privilege boundaries, re-enabling classic Spectre v2 scenarios without relying on powerful sandboxed environments like eBPF,\" VUSec\nsaid\n.\nThe hardware exploits, tracked as CVE-2024-28956 and CVE-2025-24495, can be used against Intel CPUs to leak kernel memory at up to 17 Kb/s, with the study finding that they could \"completely break the domain isolation and re-enable traditional user-user, guest-guest, and even guest-host Spectre-v2 attacks.\"\nCVE-2024-28956\n(CVSS v4 score: 5.7) - Indirect Target Selection (ITS), which affects Intel Core 9th-11th, and Intel Xeon 2nd-3rd, among others.\nCVE-2025-24495\n(CVSS v4 score: 6.8) - Lion Cove BPU issue, which affects Intel CPUs with Lion Cove core\nWhile Intel has shipped microcode updates for these defects, AMD\nsaid\nit has revised its existing guidance on\nSpectre and Meltdown\nto explicitly highlight the risk from the use of classic Berkeley Packet Filter (cBPF).\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Fileless Remcos RAT Delivered via LNK Files and MSHTA in PowerShell-Based Attacks",
        "Link": "https://thehackernews.com/2025/05/fileless-remcos-rat-delivered-via-lnk.html",
        "Summary": "Cybersecurity researchers have shed light on a new malware campaign that makes use of a PowerShell-based shellcode loader to deploy a remote access trojan called Remcos RAT.\n\"Threat actors delivered malicious LNK files embedded within ZIP archives, often disguised as Office documents,\" Qualys security researcher Akshay Thorve said in a technical report. \"The attack chain leverages mshta.exe for",
        "Date": "2025-05-16",
        "Content": "Cybersecurity researchers have shed light on a new malware campaign that makes use of a PowerShell-based shellcode loader to deploy a remote access trojan called Remcos RAT.\n\"Threat actors delivered malicious LNK files embedded within ZIP archives, often disguised as Office documents,\" Qualys security researcher Akshay Thorve\nsaid\nin a technical report. \"The attack chain leverages\nmshta.exe\nfor proxy execution during the initial stage.\"\nThe latest wave of attacks, as detailed by Qualys, employs tax-related lures to entice users into opening a malicious ZIP archive containing a Windows shortcut (LNK) file, which, in turn, makes use of mshta.exe, a legitimate Microsoft tool used to run HTML Applications (HTA).\nThe binary is used to execute an obfuscated HTA file named \"xlab22.hta\" hosted on a remote server, which incorporates Visual Basic Script code to download a PowerShell script, a decoy PDF, and another HTA file similar to xlab22.hta called \"311.hta.\" The HTA file is also configured to make Windows Registry modifications to ensure that \"311.hta\" is automatically launched upon system startup.\nOnce the PowerShell script is executed, it decodes and reconstructs a shellcode loader that ultimately proceeds to launch the Remcos RAT payload entirely in memory.\nRemcos RAT is a well-known malware that offers threat actors full control over compromised systems, making it an ideal tool for cyber espionage and data theft. A 32-bit binary compiled using Visual Studio C++ 8, it features a modular structure and can gather system metadata, log keystrokes, capture screenshots, monitor clipboard data, and retrieve a list of all installed programs and running processes.\nIn addition, it establishes a TLS connection to a command-and-control (C2) server at \"readysteaurants[.]com,\" maintaining a persistent channel for data exfiltration and control.\nThis is not the first time fileless versions of Remcos RAT have been spotted in the wild. In November 2024, Fortinet FortiGuard Labs\ndetailed\na phishing campaign that filelessly deployed the malware by making use of order-themed lures.\nWhat makes the attack method attractive to threat actors is that it allows them to operate undetected by many traditional security solutions as the malicious code runs directly in the computer's memory, leaving very few traces on the disk.\n\"The rise of PowerShell-based attacks like the new Remcos RAT variant demonstrates how threat actors are evolving to evade traditional security measures,\" J Stephen Kowski, Field CTO at SlashNext, said.\n\"This fileless malware operates directly in memory, using LNK files and MSHTA.exe to execute obfuscated PowerShell scripts that can bypass conventional defenses. Advanced email security that can detect and block malicious LNK attachments before they reach users is crucial, as is real-time scanning of PowerShell commands for suspicious behaviors.\"\nThe disclosure comes as\nPalo Alto Networks Unit 42\nand\nThreatray\ndetailed a new .NET loader that's used to detonate a wide range of commodity information stealers and RATS like Agent Tesla, NovaStealer, Remcos RAT, VIPKeylogger, XLoader, and XWorm.\nThe loader features three stages that work in tandem to deploy the final-stage payload: A .NET executable that embeds the second and third stages in encrypted form, a .NET DLL that decrypts and loads the next stage, and a .NET DLL that manages the deployment of the main malware.\n\"While earlier versions embedded the second stage as a hardcoded string, more recent versions use a bitmap resource,\" Threatray said. \"The first stage extracts and decrypts this data, then executes it in memory to launch the second stage.\"\nUnit 42 described the use of bitmap resources to conceal malicious payloads a a steganography technique that can bypass traditional security mechanisms and evade detection.\nThe findings also coincide with the emergence of several phishing and social engineering campaigns that are engineered for credential theft and malware delivery -\nUse of trojanized versions of the KeePass password management software – codenamed\nKeeLoader\n– to drop a Cobalt Strike beacon and steal sensitive KeePass database data, including administrative credentials. The malicious installers are hosted on KeePass typosquat domains that are served via Bing ads.\nUse of\nClickFix lures\nand\nURLs embedded within PDF documents\nand a series of intermediary dropper URLs to deploy\nLumma Stealer\n.\nUse of\nbooby-trapped Microsoft Office documents\nthat are used to deploy the\nFormbook\ninformation stealer protected using a malware distribution service referred to as\nHorus Protector\n.\nUse of\nblob URIs\nto locally loads a credential phishing page via phishing emails, with the blob URIs served using allow-listed pages (e.g., onedrive.live[.]com) that are abused to redirect victims to a malicious site that contains a link to a threat actor-controlled HTML page.\nUse of\nRAR archives\nmasquerading as setup files to distribute\nNetSupport RAT\nin attacks targeting Ukraine and Poland.\nUse of phishing emails to distribute\nHTML attachments\nthat contain malicious code to capture victims' Outlook, Hotmail, and Gmail credentials and exfiltrate them to a Telegram bot named \"Blessed logs\" that has been active since February 2025\nThe developments have also been complemented by the rise in artificial intelligence (AI)-powered campaigns that leverage polymorphic tricks that mutate in real-time to sidestep detection efforts. These include modifying email subject lines, sender names, and body content to slip past signature-based detection.\n\"AI gave threat actors the power to automate malware development, scale attacks across industries, and personalize phishing messages with surgical precision,\" Cofense\nsaid\n.\n\"These evolving threats are increasingly able to bypass traditional email filters, highlighting the failure of perimeter-only defenses and the need for post-delivery detection. It also enabled them to outmaneuver traditional defenses through polymorphic phishing campaigns that shift content on the fly. The result: deceptive messages that are increasingly difficult to detect and even harder to stop.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "[Webinar] From Code to Cloud to SOC: Learn a Smarter Way to Defend Modern Applications",
        "Link": "https://thehackernews.com/2025/05/from-code-to-cloud-to-soc-learn-smarter.html",
        "Summary": "Modern apps move fast—faster than most security teams can keep up. As businesses rush to build in the cloud, security often lags behind. Teams scan code in isolation, react late to cloud threats, and monitor SOC alerts only after damage is done.\nAttackers don’t wait. They exploit vulnerabilities within hours. Yet most organizations take days to respond to critical cloud alerts. That delay isn’t",
        "Date": "2025-05-16",
        "Content": "Modern apps move fast—faster than most security teams can keep up. As businesses rush to build in the cloud, security often lags behind. Teams scan code in isolation, react late to cloud threats, and monitor SOC alerts only after damage is done.\nAttackers don't wait. They exploit vulnerabilities within hours. Yet most organizations take days to respond to critical cloud alerts. That delay isn't just risky—it's an open door.\nThe problem? Security is split across silos. DevSecOps, CloudSec, and SOC teams all work separately. Their tools don't talk. Their data doesn't sync. And in those gaps, 80% of cloud exposures slip through—exploitable, avoidable, and often invisible until it's too late.\nThis free webinar ,\"\nBreaking Down Security Silos: Why Application Security Must Span from Code to Cloud to SOC\n,\" shows you how to fix that. Join Ory Segal, Technical Evangelist at Cortex Cloud (Palo Alto Networks), and discover a practical approach to securing your apps from code to cloud to SOC—all in one connected strategy.\nYou'll learn:\nWhy code scanning alone isn't enough\nWhere attackers find your biggest blind spots\nHow to unify your security tools and teams\nHow to cut response times from days to hours\nIf you're in AppSec, CloudOps, DevSecOps, or SOC—you'll walk away with insights you can apply immediately.\nWatch this Webinar\nStill relying on just code reviews or siloed tools? That's only part of the picture. Attackers see your whole environment. It's time you did too.\nJoin us and take the first step toward smarter, faster, full-stack security.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft confirms May Windows 10 updates trigger BitLocker recovery",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-confirms-may-windows-10-updates-trigger-bitlocker-recovery/",
        "Summary": "​Microsoft has confirmed that some Windows 10 and Windows 10 Enterprise LTSC 2021 systems will boot into BitLocker recovery after installing the May 2025 security updates. [...]",
        "Date": "2025-05-16",
        "Content": "​Microsoft has confirmed that some Windows 10 and Windows 10 Enterprise LTSC 2021 systems will boot into BitLocker recovery after installing the May 2025 security updates.\nThe BitLocker Windows security feature encrypts storage drives to prevent data theft, and Windows computers typically enter BitLocker recovery mode after events like TPM (Trusted Platform Module) updates or hardware changes to regain access to protected drives.\n​Today, Microsoft confirmed the issue and said it's investigating reports that \"a small number\" of Windows 10 PCs display BitLocker recovery screens after installing the KB5058379 update.\n\"On affected devices, upon installing the update, Windows might fail to start enough times to trigger an Automatic Repair. On devices with BitLocker enabled, BitLocker requires the input of your BitLocker recovery key to initiate an Automatic Repair,\"\nthe company said\nin a Windows release health update.\nImpacted users who check the Windows Event Viewer will also see LSASS errors and installation failure events with 0x800F0845 errors in the System event log. Additionally, while some devices will enter a BitLocker recovery loop after Startup Repair fails to initiate an automatic repair, others will successfully roll back to the previously installed update after several attempts to install KB5058379.\nYou can retrieve the BitLocker recovery key by logging into the\nBitLocker recovery screen portal\nwith your Microsoft account. This\nsupport page\nprovides further details on how to find the recovery key in Windows.\nMicrosoft says it's investigating the issue and will provide an update once more information regarding the root cause becomes available.\nBitLocker recovery screen (Microsoft)\nMicrosoft's acknowledgment of this issue comes after many Windows users and admins\nhave reported\nseeing devices unexpectedly enter the Windows Recovery Environment (WinRE) and displaying a BitLocker recovery screen after installing the\nKB5058379 cumulative update\nreleased as part of the\nMay 2025 Patch Tuesday\n.\nCurrently, these reports point to a wide variety of system configurations and devices from Lenovo, Dell, and HP being affected, so it's unclear if this is caused by a specific hardware or software issue.\n\"The latest KB5058379 released May 13 quality update failed in Windows 10 devices. Some devices it caused triggering bitlocker key window after restart,\" one user said on\nMicrosoft's forums\n.\n\"We have about a half dozen laptops that experienced various intermittent issues after receiving the same KB - some require bitlocker keys to start up, others refusing to start at all,\" a Windows admin added on\nReddit\n.\nTo get back into Windows on systems stuck at a BitLocker recovery prompt, you can try disabling the Intel Trusted Execution Technology (TXT) from the BIOS. If that fails, as\nMicrosoft support advises\n, you can also try to disable Secure Boot, Virtualization Technologies (if the issue persists), or Firmware Protection.\nIn August 2024, Microsoft\nfixed another issue\nthat triggered BitLocker recovery prompts on Windows 10, Windows 11, and Windows Server systems after\ninstalling the July 2024 Windows security updates\n.\nTwo years earlier, in August 2022, Windows devices were impacted by similar issues after the KB5012170 security update caused some devices to\nboot into the BitLocker recovery screen\n.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nWindows 10 KB5058379 update triggers BitLocker recovery on some devices\nMicrosoft silently fixes Start menu bug affecting Windows 10 PCs\nMicrosoft fixes bug causing incorrect Windows Recovery errors\nMicrosoft: New Windows updates fix Active Directory policy issues\nWindows 11 update breaks Veeam recovery, causes connection errors"
    },
    {
        "Title": "Israel arrests new suspect behind Nomad Bridge $190M crypto hack",
        "Link": "https://www.bleepingcomputer.com/news/legal/israel-arrests-new-suspect-behind-nomad-bridge-190m-crypto-hack/",
        "Summary": "An American-Israeli national named Osei Morrell has been arrested in Israel for his alleged involvement in exploiting the Nomad bridge smart-contract in August 2022 that allowed hackers to siphon $190 million. [...]",
        "Date": "2025-05-16",
        "Content": "An American-Israeli national named Osei Morrell has been arrested in Israel for his alleged involvement in exploiting the Nomad bridge smart-contract in August 2022 that allowed hackers to siphon $190 million.\nBlockchain intelligence platform TRM Labs supplied key information to international law enforcement authorities, leading to the identification of Morrell, who is believed to have played a central role in what is one of the largest hacks in DeFi history.\n\"The suspect, American-Israeli dual national Osei Morrell, was arrested in Jerusalem by Israeli police working in coordination with the DOJ, the FBI, and Interpol,\"\nexplained TRM Labs\n.\nAccording to the blockchain intelligence firm, Morell will soon be extradited to the United Statesas the legal precedures have already been approved.\nMorrell's links to Nomad Bridge hack\nThe Nomad bridge is a cross-chain communication standard that allows users to transfer assets between different blockchains.\nOn August 1, 2022, attackers exploited a critical vulnerability introduced in an update to its Replica smart contract, specifically in the 'process() function.'\nThough the contract was supposed to verify message proofs before releasing funds, a misconfiguration allowed any message with a correct root hash to be accepted, even if the underlying proof was invalid.\nOnce a single attacker figured out the flaw, the exploit method was quickly picked up by hundreds of other wallets, as it consisted in simply copy-pasting a specific transaction format.\nThis \"mob-style\" attack led to a chaotic and decentralized looting of the bridge, draining over $190 million in ETH, USDC, WBTC, and ERC-20 tokens.\nOverview of the attack at Nomad Bridge\nSource: TRM Labs\nTRM Labs comments that the vulnerability was very easy to leverage, so even people with no hacking skills or deep blockchain knowledge joined in the exploitation. However, experienced North Korean actors\nwere also implicated\n.\nOsei Morrell is not believed to have written or initiated the exploit code itself, but TRM Labs says he \"played a central role,\" and evidence suggests he conspired with others to launder large amounts of funds stolen during the exploit.\nWallets linked to Morrell received stolen assets within hours of the bridge being drained, suggesting close coordination with early attackers.\nTMR Labs' data shows that Morrell used 'chain-hopping' to move the stolen tokens across various blockchains, the Tornado Cash mixer to obfuscate the origin of the funds, and swapped ETH into the privacy-boosting Monero (XMR) and Dash.\nMorrell's money laundering process\nSource: TRM Labs\nTo cash out the proceeds, he used non-custodial exchanges, OTC brokers, and offshore bank accounts tied to fake or opaque legal entities, and also converted some crypto to fiat through providers with no KYC standards.\nDespite all the obfuscation efforts and the time that has passed since these events, blockchain transaction analysis still yielded enough clues to uncover Morrell's identity, resulting in his arrest.\nMorrell's arrest follows that of another suspected hacker, a Russian-Israeli citizen named Alexander Gurevich, who was caught on May 1st at the Ben Gurion airport in Tel Aviv using documents under a new name, Alexander Block, he had officially changed.\nAccording to prosecutors, Gurevich exploited the Nomad bridge flaw and withdrew about $2.89 million in digital tokens. This was followed by others finding the issue and leveraging it to siphon assets.\nJerusalem Post\nreports\nthat on August 4, 2022, Gurevich contacted Nomad's Chief Technology Officer and admitted he had been probing Nomad for weaknesses, apologizing for the trouble and later demanding a $500,000 reward for identifying the vulnerability.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nU.S. seized $8.2 million in crypto linked to 'Romance Baiting' scams\nUS charges 12 more suspects linked to $230 million crypto theft\nGermany takes down eXch cryptocurrency exchange, seizes servers\nGrinex exchange suspected rebrand of sanctioned Garantex crypto firm\nBlockchain gaming platform WEMIX hacked to steal $6.1 million"
    },
    {
        "Title": "ChatGPT rolls out Codex, an AI tool for software programming",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-rolls-out-codex-an-ai-tool-for-software-programming/",
        "Summary": "OpenAI is rolling out 'Codex' for ChatGPT, which is an AI agent that automates and delegates programming tasks for software engineers. [...]",
        "Date": "2025-05-16",
        "Content": "OpenAI is rolling out 'Codex' for ChatGPT, which is an AI agent that automates and delegates programming tasks for software engineers.\nOpenAI isn't explicitly claiming that Codex will eventually replace junior software engineers.\nInstead, the company states Codex could help developers achieve more by delegating their tasks to different agents.\nThe idea is to move faster with development and become more productive with AI, but how does Codex work?\nCodex in ChatGPT\nAccording to OpenAI, Codex is based on codex-1, which is a new version of ChatGPT based on the existing o3 model, but it has been optimized for coding, which results in increased accuracy.\nCodex pulls codebase from Github and closely mirrors the existing PR style.\nIt can write new code, propose pull requests, and run each task in its own sandbox.\n\"Task completion typically takes between 1 and 30 minutes, depending on complexity, and you can monitor Codex’s progress in real time,\" OpenAI\nnoted\nin a blog post.\n\"Once Codex completes a task, it commits its changes in its environment. Codex provides verifiable evidence of its actions through citations of terminal logs and test outputs, allowing you to trace each step taken during task completion.\"\nCodex is rolling out, but only if you've a Pro subscription, which costs $200 per month.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nOpenAI document explains when to use each ChatGPT model\nOpenAI's $20 ChatGPT Plus is now free for students until the end of May\nChatGPT is down worldwide with something went wrong error\nOpenAI says Deep Research is coming to ChatGPT free \"very soon\"\nLeak confirms OpenAI's ChatGPT will integrate MCP"
    },
    {
        "Title": "Hackers exploit VMware ESXi, Microsoft SharePoint zero-days at Pwn2Own",
        "Link": "https://www.bleepingcomputer.com/news/security/hackers-exploit-vmware-esxi-microsoft-sharepoint-zero-days-at-pwn2own/",
        "Summary": "During the second day of Pwn2Own Berlin 2025, competitors earned $435,000 after exploiting zero-day bugs in multiple products, including Microsoft SharePoint, VMware ESXi, Oracle VirtualBox, Red Hat Enterprise Linux, and Mozilla Firefox. [...]",
        "Date": "2025-05-16",
        "Content": "During the second day of Pwn2Own Berlin 2025, competitors earned $435,000 after exploiting zero-day bugs in multiple products, including Microsoft SharePoint, VMware ESXi, Oracle VirtualBox, Red Hat Enterprise Linux, and Mozilla Firefox.\nThe highlight was a successful attempt from Nguyen Hoang Thach of STARLabs SG against the VMware ESXi, which earned him $150,000 for an integer overflow exploit.\nDinh Ho Anh Khoa of Viettel Cyber Security was awarded $100,000 for hacking Microsoft SharePoint by leveraging an exploit chain combining an auth bypass and an insecure deserialization flaw.\nPalo Alto Networks' Edouard Bochin and Tao Yan also demoed an out-of-bounds write zero-day in Mozilla Firefox, while Gerrard Tai of STAR Labs SG escalated privileges to root on Red Hat Enterprise Linux using a use-after-free bug, and Viettel Cyber Security used another out-of-bounds write for an Oracle VirtualBox guest-to-host escape.\nIn the AI category, Wiz Research security researchers used a use-after-free zero-day to exploit Redis and Qrious Secure chained four security flaws to hack Nvidia's Triton Inference Server.\nOn the first day\n, competitors were awarded $260,000 after successfully exploiting zero-day vulnerabilities in Windows 11, Red Hat Linux, and Oracle VirtualBox, reaching a total of $695,000\nearned over the first two days\nof the contest after demonstrating 20 unique 0-days.\nPwn2Own Berlin day two rankings (ZDI)\n​​​The\nPwn2Own Berlin 2025\nhacking competition focuses on enterprise technologies, introduces an AI category for the first time, and takes place during the\nOffensiveCon\nconference between May 15 and May 17.\nSecurity researchers will be able to earn over $1,000,000 in rewards for demonstrating zero-day bugs in fully patched products in the AI, web browser, virtualization, local privilege escalation, servers, enterprise applications, cloud-native/container, and automotive categories.\nHowever, no Tesla attempts were registered before Pwn2Own started, even though two 2025 Tesla Model Y and 2024 Tesla Model 3 bench-top units were also available as targets.\nOn the\nlast day of the contest\n, the hackers will attempt to exploit zero-day bugs in Windows 11, Oracle VirtualBox, VMware ESXi, VMware Workstation, Mozilla Firefox, as well as Nvidia's Triton Inference Server and Container Toolkit.\nAfter zero-day exploits are disclosed during the Pwn2Own contest, vendors have 90 days to release security fixes for their software and hardware products before Trend Micro's Zero Day Initiative publishes technical details.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nWindows 11 and Red Hat Linux hacked on first day of Pwn2Own\nMicrosoft Teams, Virtualbox, Tesla zero-days exploited at Pwn2Own\nCISA tags recently patched Chrome bug as actively exploited\nGoogle tags a tenth Chrome zero-day as exploited this year\nSAP patches second zero-day flaw exploited in recent attacks"
    },
    {
        "Title": "Printer maker Procolored offered malware-laced drivers for months",
        "Link": "https://www.bleepingcomputer.com/news/security/printer-maker-procolored-offered-malware-laced-drivers-for-months/",
        "Summary": "For at least half a year, the official software supplied with Procolored printers included malware in the form of a remote access trojan and a cryptocurrency stealer. [...]",
        "Date": "2025-05-16",
        "Content": "For at least half a year, the official software supplied with Procolored printers included malware in the form of a remote access trojan and a cryptocurrency stealer.\nProcolored is a digital printing solutions provider making Direct-to-Film (DTF), UV DTF, UV, and Direct-to-Garment (DTG) printers. It is particularly known for affordable and efficient fabric printing solutions.\nThe Shenzhen-based company has grown quickly since it started in 2018, and is now selling its products in over 31 countries, with a significant operational presence in the United States.\nCameron Coward, a YouTuber known as\nSerial Hobbyism\n, discovered the malware when his security solution warned of the presence of the Floxif USB worm on his computer when installing the companion software and drivers for a $7,000 Procolored UV printer.\nAn analysis conducted by researchers at cybersecurity company G Data, Procolored’s official software packages delivered the malware for at least six months.\nDiscovering RATs and coin stealers\nAfter getting the threat alerts on his machine, Coward contacted Procolored, who denied shipping malware in their software, pointing to the security solution generating false positives.\n\"If I try to download the files from their website or unzip the files on the USB drive they gave me, my computer immediately quarantines them,\" the YouTuber said.\nPerplexed by the situation, the YouTuber\nturned to Reddit\nfor help with malware analysis before he could confidently make allegations in\nhis review\nof the Procolored V11 Pro product.\nG Data researcher\nKarsten Hahn offered to investigate\n, finding that at least six printer models (F8, F13, F13 Pro, V6, V11 Pro, and VF13 Pro) with accompanying software hosted on the Mega file sharing platform that included contained malware.\nProcolored uses the Mega service to host the software resources for its printers, and offers a direct link to them from the support section of the official website.\nFiles hosted on Mega.nz\nSource: G Data\nThe analyst found 39 files infected with:\nXRedRAT\n– Known malware previously analyzed by eSentire. Its capabilities include keylogging, screenshot capturing, remote shell access, and file manipulation. Hardcoded C2 URLs matched older samples.\nSnipVex\n– A previously undocumented clipper malware that infects .EXE files, attaches to them, and replaces clipboard BTC addresses. Detected in multiple download files. Likely infected Procolored developer systems or build machines.\nSince the files were last updated in October 2024, it can be assumed that the malware was shipped with Procolored software for at least six months.\nSnipVex infection routine\nSource: G Data\nHahn says the address SnipVex uses to offload stolen cryptocurrency has received about 9.308 BTC, which is worth nearly $1 million at today's exchange rate.\nDespite Procolored’s initial denial, the software packages were taken down on May 8 and an internal investigation was launched.\nWhen G Data asked the printer vendor for an explanation, Procolored admitted that they had uploaded the files to Mega.nz using a USB drive that could have been infected by Floxif.\n“As a precaution, all software has been temporarily removed from the Procolored official website,” explained Procolored to G Data.\n“We are conducting a comprehensive malware scan of every file. Only after passing stringent virus and security checks will the software be re-uploaded.”\nG Data received the clean software packages and confirmed they’re safe to use.\nProcolored customers are recommended to replace the old software with the new versions and to perform a system scan to remove XRedRAT and SnipVex.\nGiven that SnipVex performs binary alterations, a deeper cleaning of the system is recommended to ensure all files are clean.\nBleepingComputer has contacted Procolored for a comment on the situation and whether they informed their customers of the risk but we have yet to receive a response.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nSupply chain attack hits npm package with 45,000 weekly downloads\nMalicious PyPi package hides RAT malware, targets Discord devs since 2022\nPyPI packages caught stealing credit card numbers, Discord tokens\nChinese hackers target Russian govt with upgraded RAT malware\nNew ResolverRAT malware targets pharma and healthcare orgs worldwide"
    },
    {
        "Title": "Ransomware gangs increasingly use Skitnet post-exploitation malware",
        "Link": "https://www.bleepingcomputer.com/news/security/ransomware-gangs-increasingly-use-skitnet-post-exploitation-malware/",
        "Summary": "Ransomware gang members increasingly use a new malware called Skitnet (\"Bossnet\") to perform stealthy post-exploitation activities on breached networks. [...]",
        "Date": "2025-05-16",
        "Content": "Ransomware gang members increasingly use a new malware called Skitnet (\"Bossnet\") to perform stealthy post-exploitation activities on breached networks.\nThe malware has been offered for sale on underground forums like RAMP since April 2024, but according to\nProdaft researchers\n, it started gaining significant traction among ransomware gangs since early 2025.\nProdaft told BleepingComputer they have observed multiple ransomware operations deploying Skitnet in real-world attacks, including BlackBasta in Microsoft Teams phishing attacks against the enterprise, and Cactus.\nThe malware promoted on underground forums\nSource: Prodaft\nStealthy and powerful backdoor\nThe Skitnet infection begins with a Rust-based loader dropped and executed on the target system, which decrypts a ChaCha20 encrypted Nim binary and loads it into memory.\nThe Nim payload establishes a DNS-based reverse shell for communication with the command and control (C2) server, initiating the session with randomized DNS queries.\nThe malware starts three threads, one for sending heartbeat DNS requests, one for monitoring and exfiltrating shell output, and one for listening for and decrypting commands from DNS responses.\nCommunication and commands to be executed are sent via HTTP or DNS, based on commands issued via the Skitnet C2 control panel. The C2 panel allows the operator to see the target's IP, location, status, and issue commands for execution.\nSkitnet's admin panel\nSource: Prodaft\nThe supported commands are:\nstartup\n- Establishes persistence by downloading three files (including a malicious DLL) and creating a shortcut to a legitimate Asus executable (ISP.exe) in the Startup folder. This triggers a DLL hijack that executes a PowerShell script (pas.ps1) for ongoing C2 communication.\nScreen\n– Captures a screenshot of the victim's desktop using PowerShell, uploads it to Imgur, and sends the image URL back to the C2 server.\nAnydesk\n– Downloads and silently installs AnyDesk, a legitimate remote access tool, while hiding the window and notification tray icon.\nRutserv\n– Downloads and silently installs RUT-Serv, another legitimate remote access tool.\nShell\n– Starts a PowerShell command loop. Sends an initial \"Shell started..\" message, then repeatedly polls (?m) the server every 5 seconds for new commands which it executes using Invoke-Expression, and sends results back.\nAv\n– Enumerates installed antivirus and security software by querying WMI (SELECT * FROM AntiVirusProduct in the root\\SecurityCenter2 namespace). Sends results to the C2 server.\nApart from the core command set, the operators may also leverage a separate capability involving a .NET loader, which allows them to execute PowerShell scripts in memory, for even deeper attack customization.\nSkitnet's .NET loader\nSource: Prodaft\nThough ransomware groups often use custom tools tailored to specific operations and have low AV detection, these are costly to develop and require skilled developers who aren't always available, especially in lower-tier groups.\nUsing an off-the-shelf malware like Skitnet is cheaper, quicker to deploy, and can make attribution harder, as many threat actors use it.\nIn the ransomware space, there's room for both approaches, even a mix of the two, but Skitnet's capabilities make it particularly enticing for hackers.\nProdaft has published indicators of compromise (IoCs) associated with Skitnet on its\nGitHub repository\n.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nRansomHub ransomware uses new Betruger ‘multi-function’ backdoor\nWordPress plugin disguised as a security tool injects backdoor\nFBI warnings are true—fake file converters do push malware\nPrinter maker Procolored offered malware-laced drivers for months\nRansomware gangs join ongoing SAP NetWeaver attacks"
    },
    {
        "Title": "US charges 12 more suspects linked to $230 million crypto theft",
        "Link": "https://www.bleepingcomputer.com/news/security/us-charges-12-more-suspects-linked-to-230-million-crypto-theft/",
        "Summary": "Twelve more suspects were charged in a RICO conspiracy for their alleged involvement in the theft of over $230 million in cryptocurrency and laundering the funds using crypto exchanges and mixing services. [...]",
        "Date": "2025-05-16",
        "Content": "Twelve more suspects were charged in a RICO conspiracy for their alleged involvement in the theft of over $230 million in cryptocurrency and laundering the funds using crypto exchanges and mixing services.\nTwo other suspects linked to this conspiracy, 20-year-old Malone Lam (aka \"Greavys,\" \"Anne Hathaway,\" and \"$$$\") and 21-year-old Jeandiel Serrano (aka \"Box,\" \"VersaceGod,\" and \"@SkidStar\"),\nwere arrested and charged\nin September 2024.\nAccording to\ncourt documents\n, Lam, Serrano, and others involved in the scheme allegedly gained unauthorized access to victims' cryptocurrency accounts and transferred funds into crypto wallets they controlled. In an August 18th attack, they stole over 4,100 Bitcoin from a Washington, D.C., victim (worth more than $230 million at the time).\nCrypto fraud investigator ZachXBT, who\nassisted the FBI investigators\n, revealed that the group targeted a creditor of the Genesis crypto exchange, using spoofed phone numbers and impersonating customer support at Google and Gemini.\nWhile posing as a Gemini support representative, they deceived the victim into resetting two-factor authentication (2FA) and sharing their screen via AnyDesk (a remote desktop application) after claiming the account had been compromised, which gave them access to private keys from Bitcoin Core and allowed them to steal the target's cryptocurrency funds.\nStolen crypto being transferred (ZachXBT)\n\"An initial tracing showed $243M split multiple ways between each party before funds quickly peeled off to 15+ exchanges immediately swapping back and forth between Bitcoin, Litecoin, Ethereum, and Monero,\" ZachXBT said.\n​Besides cyber-enabled racketeering conspiracy and money laundering, the following defendants, who were indicted this week, also face charges of obstruction of justice and conspiracy to commit wire fraud:\nMarlon Ferro, 19 (Santa Ana, California)\nHamza Doost, 21 (Hayward, California)\nConor Flansburg, 21 (Newport Beach, California)\nKunal Mehta, 45 (Irvine, California)\nEthan Yarally, 18 (Richmond Hill, New York)\nCody Demirtas, 19 (Stuart, Florida)\nAakash Anand, 22 (New Zealand)\nEvan Tangeman, 21 (Newport Beach, California)\nJoel Cortes, 21 (Laguna Niguel, California)\nFirst Name Unknown-1, Last Name Unknown-1 aka \"Chen\" and \"Squiggly\" (location unknown)\nFirst Name Unknown-2, Last Name Unknown-2 aka \"Danny\" and \"Meech\" (location unknown)\nJohn Tucker Desmond, 19 (Huntington Beach, California)\nWhile most of the stolen cryptocurrency assets were converted to Monero for added anonymity, the attackers reportedly made some critical errors, linking the laundered funds to the original stolen amounts.\nThey\nreportedly\nlaundered the stolen cryptocurrency using crypto mixers and exchanges, pass-through wallets, \"peel chains,\" and virtual private networks (VPNs) to hide their identities and locations.\nThe stolen cryptocurrency was subsequently used to finance lavish lifestyles, with the defendants allegedly spending the stolen funds on luxury cars, high-end watches, designer handbags, nightclub outings, and international travel.\n\"Members and associates of the enterprise used the stolen virtual currency to purchase, among other things, nightclub services ranging up to $500,000 per evening, luxury handbags valued in the tens of thousands of dollars that were given away at nightclub parties, luxury watches valued between $100,000 and $500,000,\" U.S. Department of Justice prosecutors\nsaid\n, as well as \"luxury clothing valued in the tens of thousands of dollars, rental homes in Los Angeles, the Hamptons, and Miami, private jet rentals, a team of private security guards, and a fleet of at least 28 exotic cars ranging in value from $100,000 to $3.8 million.\"\n\"Members of the enterprise held different responsibilities. The various roles included database hackers, organizers, target identifiers, callers, money launderers, and residential burglars targeting hardware virtual currency wallets.\"\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nIsrael arrests new suspect behind Nomad Bridge $190M crypto hack\nGrinex exchange suspected rebrand of sanctioned Garantex crypto firm\nOKX suspends DEX aggregator after Lazarus hackers try to launder funds\nCoinbase data breach exposes customer info and government IDs\nGermany takes down eXch cryptocurrency exchange, seizes servers"
    },
    {
        "Title": "CISA tags recently patched Chrome bug as actively exploited",
        "Link": "https://www.bleepingcomputer.com/news/security/cisa-tags-recently-patched-chrome-bug-as-actively-exploited-zero-day/",
        "Summary": "On Thursday, CISA warned U.S. federal agencies to secure their systems against ongoing attacks exploiting a high-severity vulnerability in the Chrome web browser. [...]",
        "Date": "2025-05-16",
        "Content": "On Thursday, CISA warned U.S. federal agencies to secure their systems against ongoing attacks exploiting a high-severity vulnerability in the Chrome web browser.\nSolidlab security researcher Vsevolod Kokorin discovered the flaw (CVE-2025-4664) and shared technical details online on May 5th. Google\nreleased security updates\nto patch it on Wednesday.\nAs Kokorin explained, the vulnerability is\ndue\nto insufficient policy enforcement in Google Chrome's Loader component, and successful exploitation can allow remote attackers to leak cross-origin data via maliciously crafted HTML pages.\n\"You probably know that unlike other browsers, Chrome resolves the Link header on subresource requests. But what's the problem? The issue is that the Link header can set a referrer-policy. We can specify unsafe-url and capture the full query parameters,\"\nKokorin noted\n.\n\"Query parameters can contain sensitive data - for example, in OAuth flows, this might lead to an Account Takeover. Developers rarely consider the possibility of stealing query parameters via an image from a 3rd-party resource.\"\nWhile Google didn't disclose if the vulnerability was previously abused in attacks or if it's still being exploited, it warned in a security advisory that it has a public exploit, which is how it usually hints at active exploitation.\nFlagged as actively exploited\nOne day later,\nCISA confirmed\nCVE-2025-4664 is being abused in the wild and added it to the\nKnown Exploited Vulnerabilities catalog\n, which lists security flaws actively exploited in attacks.\nAs mandated by the November 2021 Binding Operational Directive (BOD) 22-01, U.S. Federal Civilian Executive Branch (FCEB) agencies must patch their Chrome installation within three weeks, by May 7th, to secure their systems against potential breaches.\nWhile this directive only applies to federal agencies, all network defenders are advised to prioritize patching this vulnerability as soon as possible.\n\"These types of vulnerabilities are frequent attack vectors for malicious cyber actors and pose significant risks to the federal enterprise,\" the cybersecurity agency warned.\nThis is the second actively exploited Chrome zero-day patched by Google this year, after\nanother high-severity Chrome zero-day\nbug (CVE-2025-2783), which was abused to target Russian government organizations, media outlets, and educational institutions in cyber-espionage attacks.\nKaspersky researchers who spotted the zero-day attacks said that the threat actors used CVE-2025-2783 exploits to bypass Google Chrome's sandbox protections and infect targets with malware.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nGoogle tags a tenth Chrome zero-day as exploited this year\nGoogle fixes Android zero-days exploited in attacks, 60 other flaws\nCISA emergency directive: Mitigate Ivanti zero-days immediately\nGoogle fixes Chrome zero-day exploited in espionage campaign\nGoogle fixes high severity Chrome flaw with public exploit"
    },
    {
        "Title": "Coinbase Extorted, Offers $20M for Info on Its Hackers",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/coinbase-extorted-20m-hackers",
        "Summary": "Coinbase is going Liam Neeson on its attackers, potentially setting a new precedent for incident response in the wake of crypto- and blockchain-targeting cyberattacks.",
        "Date": "2025-05-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/coinbase-extorted-20m-hackers"
    },
    {
        "Title": "Australian Human Rights Commission Leaks Docs in Data Breach",
        "Link": "https://www.darkreading.com/application-security/australian-human-rights-commission-leaks-data-breach",
        "Summary": "An internal error led to public disclosure of reams of sensitive data that could be co-opted for follow-on cyberattacks.",
        "Date": "2025-05-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/australian-human-rights-commission-leaks-data-breach"
    },
    {
        "Title": "Dynamic DNS Emerges as Go-to Cyberattack Facilitator",
        "Link": "https://www.darkreading.com/threat-intelligence/dynamic-dns-cyberattack-facilitator",
        "Summary": "Scattered Spider and other phishers and hacking groups are using rentable subdomains from dynamic DNS providers to obfuscate their activity and impersonate well-known brands.",
        "Date": "2025-05-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/dynamic-dns-cyberattack-facilitator"
    },
    {
        "Title": "Attacker Specialization Puts Threat Modeling on Defensive",
        "Link": "https://www.darkreading.com/threat-intelligence/attackers-specialize-cyber-threat-models-adapt",
        "Summary": "Specialization among threat groups poses challenges for defenders, who now must distinguish between different actors responsible for different facets of an attack.",
        "Date": "2025-05-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/attackers-specialize-cyber-threat-models-adapt"
    },
    {
        "Title": "How to Develop and Communicate Metrics for CSIRPs",
        "Link": "https://www.darkreading.com/cybersecurity-operations/develop-communicate-metrics-csirps",
        "Summary": "A well-documented cybersecurity incident response program (CSIRP) provides the transparency needed for informed decision-making, protecting the organization in a constantly changing threat environment.",
        "Date": "2025-05-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/develop-communicate-metrics-csirps"
    },
    {
        "Title": "Turkish APT Exploits Chat App Zero-Day to Spy on Iraqi Kurds",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/turkish-apt-exploits-chat-app-zero-day-spy-iraqi-kurds",
        "Summary": "Even after their zero-day turned into an n-day, attackers known as Marbled Dust or Sea Turtle continued to spy on military targets that had failed to patch Output Messenger.",
        "Date": "2025-05-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/turkish-apt-exploits-chat-app-zero-day-spy-iraqi-kurds"
    },
    {
        "Title": "Google Warns UK Retailer Hackers Now Targeting US",
        "Link": "https://www.securityweek.com/google-warns-uk-retailer-hackers-now-targeting-us/",
        "Summary": "<p>Google says the hacking group behind the recent cyberattacks on UK retailers is now shifting focus to the US.</p>\n<p>The post <a href=\"https://www.securityweek.com/google-warns-uk-retailer-hackers-now-targeting-us/\">Google Warns UK Retailer Hackers Now Targeting US</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/google-warns-uk-retailer-hackers-now-targeting-us/"
    },
    {
        "Title": "In Other News: Hackers Not Behind Blackout, CISO Docuseries, Dior Data Breach",
        "Link": "https://www.securityweek.com/in-other-news-hackers-not-behind-blackout-ciso-docuseries-dior-data-breach/",
        "Summary": "<p>A summary of noteworthy stories that might have slipped under the radar this week.</p>\n<p>The post <a href=\"https://www.securityweek.com/in-other-news-hackers-not-behind-blackout-ciso-docuseries-dior-data-breach/\">In Other News: Hackers Not Behind Blackout, CISO Docuseries, Dior Data Breach</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/in-other-news-hackers-not-behind-blackout-ciso-docuseries-dior-data-breach/"
    },
    {
        "Title": "From 60 to 4,000: NATO’s Locked Shields Reflects Cyber Defense Growth",
        "Link": "https://www.securityweek.com/from-60-to-4000-natos-locked-shields-reflects-cyber-defense-growth/",
        "Summary": "<p>The 15th edition of NATO’s Locked Shields cyber defense exercise brought together 4,000 experts from 41 countries.</p>\n<p>The post <a href=\"https://www.securityweek.com/from-60-to-4000-natos-locked-shields-reflects-cyber-defense-growth/\">From 60 to 4,000: NATO&#8217;s Locked Shields Reflects Cyber Defense Growth</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/from-60-to-4000-natos-locked-shields-reflects-cyber-defense-growth/"
    },
    {
        "Title": "Russian APT Exploiting Mail Servers Against Government, Defense Organizations",
        "Link": "https://www.securityweek.com/russian-apt-exploiting-mail-servers-against-government-defense-organizations/",
        "Summary": "<p>Russia-linked APT28 has been exploiting mail server vulnerabilities against government and defense entities since September 2023.</p>\n<p>The post <a href=\"https://www.securityweek.com/russian-apt-exploiting-mail-servers-against-government-defense-organizations/\">Russian APT Exploiting Mail Servers Against Government, Defense Organizations</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/russian-apt-exploiting-mail-servers-against-government-defense-organizations/"
    },
    {
        "Title": "FBI Warns of Deepfake Messages Impersonating Senior Officials",
        "Link": "https://www.securityweek.com/fbi-warns-of-deepfake-messages-impersonating-senior-officials/",
        "Summary": "<p>The FBI says former federal and state government officials are targeted with texts and AI-generated voice messages impersonating senior US officials.</p>\n<p>The post <a href=\"https://www.securityweek.com/fbi-warns-of-deepfake-messages-impersonating-senior-officials/\">FBI Warns of Deepfake Messages Impersonating Senior Officials</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/fbi-warns-of-deepfake-messages-impersonating-senior-officials/"
    },
    {
        "Title": "Hackers Win $260,000 on First Day of Pwn2Own Berlin 2025",
        "Link": "https://www.securityweek.com/hackers-win-260000-on-first-day-of-pwn2own-berlin-2025/",
        "Summary": "<p>Pwn2Own participants have earned tens of thousands of dollars for Red Hat, Windows, Oracle VirtualBox, Docker Desktop, and AI exploits.</p>\n<p>The post <a href=\"https://www.securityweek.com/hackers-win-260000-on-first-day-of-pwn2own-berlin-2025/\">Hackers Win $260,000 on First Day of Pwn2Own Berlin 2025</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-16",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/hackers-win-260000-on-first-day-of-pwn2own-berlin-2025/"
    }
]