[
    {
        "Title": "Hackers Use TikTok Videos to Distribute Vidar and StealC Malware via ClickFix Technique",
        "Link": "https://thehackernews.com/2025/05/hackers-use-tiktok-videos-to-distribute.html",
        "Summary": "The malware known as Latrodectus has become the latest to embrace the widely-used social engineering technique called ClickFix as a distribution vector.\n\"The ClickFix technique is particularly risky because it allows the malware to execute in memory rather than being written to disk,\" Expel said in a report shared with The Hacker News. \"This removes many opportunities for browsers or security",
        "Date": "2025-05-23",
        "Content": "The malware known as\nLatrodectus\nhas become the latest to embrace the widely-used social engineering technique called\nClickFix\nas a distribution vector.\n\"The\nClickFix technique\nis particularly risky because it allows the malware to execute in memory rather than being written to disk,\" Expel said in a report shared with The Hacker News. \"This removes many opportunities for browsers or security tools to detect or block the malware.\"\nLatrodectus, believed to be a successor to IcedID, is the name given to a malware that acts as a downloader for other payloads, such as ransomware. It was first documented by Proofpoint and Team Cymru in April 2024.\nIncidentally, the malware is one among the many malicious software to suffer an operational setback as part of Operation Endgame, which\ntook down\n300 servers worldwide and neutralized 650 domains related to Bumblebee, Lactrodectus, QakBot, HijackLoader, DanaBot, TrickBot, and WARMCOOKIE between May 19 and 22, 2025.\nIn the latest set of Latrodectus attacks observed by Expel in May 2025, unsuspecting users are tricked into copying and executing a PowerShell command from an infected website, a tactic that has become a prevalent method to distribute a wide range of malware.\n\"When run by a user, these commands will attempt to install a file located at the remote URL using MSIExec, and then execute it in memory,\" Expel said. \"This keeps the attacker from having to write the file to the computer and risk being detected by the browser or an antivirus that might detect it on disk.\"\nThe MSI installer contains a legitimate application from NVIDIA, which is used to sideload a malicious DLL, which then uses curl to download the main payload.\nTo mitigate attacks of this type, it's advised to disable the Windows Run program using Group Policy Objects (GPOs) or turn off the \"Windows + R\" hot key via a Windows Registry change.\nFrom ClickFix to TikTok\nThe disclosure comes as Trend Micro revealed details of a new engineering campaign that instead of relying on fake CAPTCHA pages employs TikTok videos likely generated using artificial intelligence (AI) tools to deliver the Vidar and StealC information stealers by instructing users to run malicious commands on their systems to activate Windows, Microsoft Office, CapCut, and Spotify.\nThese videos have been posted from various TikTok accounts such as @gitallowed, @zane.houghton, @allaivo2, @sysglow.wow, @alexfixpc, and @digitaldreams771. These accounts are no longer active. One of the videos claiming to provide instructions on how to \"boost your Spotify experience instantly\" has amassed nearly 500,000 views, with over 20,000 likes and more than 100 comments.\nThe campaign marks a new escalation of ClickFix in that users searching for ways to activate pirated apps are verbally and visually guided to open the Windows Run dialog by pressing the \"Windows + R\" hot key, launch PowerShell, and run the command highlighted in the video, ultimately compromising their own systems.\n\"Threat actors are now using TikTok videos that are potentially generated using AI-powered tools to socially engineer users into executing PowerShell commands under the guise of guiding them to activate legitimate software or unlock premium features,\" security researcher Junestherry Dela Cruz\nsaid\n.\n\"This campaign highlights how attackers are ready to weaponize whichever social media platforms are currently popular to distribute malware.\"\nFake Ledger Apps Used to Steal Mac Users' Seed Phrases\nThe findings also follow the discovery of four different malware campaigns that leverage a cloned version of the Ledger Live app to steal sensitive data, including seed phrases, with the goal of draining victims' cryptocurrency wallets. The activity has been ongoing\nsince August 2024\n.\nThe attacks make use of the malicious DMG files that, when launched, launches AppleScript to exfiltrate passwords and Apple Notes data, and then download a trojanized version of Ledger Live. Once the app is opened, it warns users of a supposed account problem and that it requires their seed phrase for recovery. The entered seed phrase is sent to an attacker-controlled server.\nMoonlock Lab, which shed light on the campaign, said the rogue apps make use of macOS stealer malware like Atomic macOS Stealer (AMOS) and Odyssey, the latter of which introduced the novel phishing scheme in March 2025. It's worth noting that the activity overlaps with a macOS infostealer campaign that targets Ledger Live users through PyInstaller-packed binaries, as\nrevealed\nby Jamf this month.\n\"On dark web forums, chatter around anti-Ledger schemes is growing. The next wave is already taking shape,\" MacPaw's cybersecurity division\nnoted\n. \"Hackers will continue to exploit the trust crypto owners place in Ledger Live.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "ViciousTrap Uses Cisco Flaw to Build Global Honeypot from 5,300 Compromised Devices",
        "Link": "https://thehackernews.com/2025/05/vicioustrap-uses-cisco-flaw-to-build.html",
        "Summary": "Cybersecurity researchers have disclosed that a threat actor codenamed ViciousTrap has compromised nearly 5,300 unique network edge devices across 84 countries and turned them into a honeypot-like network.\nThe threat actor has been observed exploiting a critical security flaw impacting Cisco Small Business RV016, RV042, RV042G, RV082, RV320, and RV325 Routers (CVE-2023-20118) to corral them into",
        "Date": "2025-05-23",
        "Content": "Cybersecurity researchers have disclosed that a threat actor codenamed ViciousTrap has compromised nearly 5,300 unique network edge devices across 84 countries and turned them into a honeypot-like network.\nThe threat actor has been observed exploiting a critical security flaw impacting Cisco Small Business RV016, RV042, RV042G, RV082, RV320, and RV325 Routers (CVE-2023-20118) to corral them into a set of honeypots en masse. A majority of the infections are located in Macau, with 850 compromised devices.\n\"The infection chain involves the execution of a shell script, dubbed NetGhost, which redirects incoming traffic from specific ports of the compromised router to a honeypot-like infrastructure under the attacker's control allowing them to intercept network flows,\" Sekoia\nsaid\nin an analysis published Thursday.\nIt's worth noting that the exploitation of CVE-2023-20118 was previously attributed by the French cybersecurity company to another botnet dubbed\nPolarEdge\n.\nWhile there is no evidence that these two sets of activities are connected, it's believed that the threat actor behind ViciousTrap is likely setting up honeypot infrastructure by breaching a wide range of internet-facing equipment, including SOHO routers, SSL VPNs, DVRs, and BMC controllers from more than 50 brands like Araknis Networks, ASUS, D-Link, Linksys, and QNAP.\n\"This setup would allow the actor to observe exploitation attempts across multiple environments and potentially collect non-public or zero-day exploits, and reuse access obtained by other threat actors,\" it added.\nThe attack chain entails the weaponization of CVE-2023-20118 to download and execute a bash script via ftpget, which then contacts an external server to fetch the wget binary. In the next step, the Cisco flaw is exploited a second time, using it to execute a second script retrieved using the previously dropped wget.\nThe second-stage shell script, internally referenced as NetGhost, is configured to redirect network traffic from the compromised system to third-party infrastructure controlled by the attacker, thereby facilitating adversary-in-the-middle (AitM) attacks. It also comes with capabilities to remove itself from the compromised host to minimize forensic trail.\nSekoia said all exploitation attempts have originated from a single IP address (\"101.99.91[.]151\"), with the earliest activity dating back to March 2025. In a noteworthy event observed a month later, the ViciousTrap actors are said to have repurposed an undocumented web shell previously employed in PolarEdge botnet attacks for their own operations.\n\"This assumption aligns with the attacker's use of NetGhost,\" security researchers Felix Aimé and Jeremy Scion said. \"The redirection mechanism effectively positions the attacker as a silent observer, capable of collecting exploitation attempts and, potentially, web shell accesses in transit.\"\nAs recently as this month, exploitation efforts have also targeted ASUS routers but from a different IP address (\"101.99.91[.]239\"), although the threat actors have not been found to create any honeypot on the infected devices. All the IP addresses actively used in the campaign are located in Malaysia and are part of an Autonomous System (AS45839) operated by hosting provider Shinjiru.\nThe actor is believed to be of Chinese-speaking origin on the basis of a weak overlap with the GobRAT infrastructure and the fact that traffic is redirected to numerous assets in Taiwan and the United States.\n\"The final objective of ViciousTrap remains unclear even [though] we assess with high confidence that it's a honeypot-style network,\" Sekoia concluded.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "300 Servers and €3.5M Seized as Europol Strikes Ransomware Networks Worldwide",
        "Link": "https://thehackernews.com/2025/05/300-servers-and-35m-seized-as-europol.html",
        "Summary": "As part of the latest \"season\" of Operation Endgame, a coalition of law enforcement agencies have taken down about 300 servers worldwide, neutralized 650 domains, and issued arrest warrants against 20 targets.\nOperation Endgame, first launched in May 2024, is an ongoing law enforcement operation targeting services and infrastructures assisting in or directly providing initial or consolidating",
        "Date": "2025-05-23",
        "Content": "As part of the latest \"season\" of\nOperation Endgame\n, a coalition of law enforcement agencies have taken down about 300 servers worldwide, neutralized 650 domains, and issued arrest warrants against 20 targets.\nOperation Endgame, first launched in May 2024, is an ongoing law enforcement operation targeting services and infrastructures assisting in or directly providing initial or consolidating access for ransomware. The previous edition\nfocused\non dismantling the initial access malware families that have been used to deliver ransomware.\nThe latest iteration, per Europol, targeted new malware variants and successor groups that re-emerged after last year's takedowns such as Bumblebee, Lactrodectus, QakBot, HijackLoader, DanaBot, TrickBot, and\nWARMCOOKIE\n. The interaction action was carried out between May 19 and 22, 2025.\n\"In addition, €3.5 million in cryptocurrency was seized during the action week, bringing the total amount seized during the Operation Endgame to more than €21.2 million,\" the agency\nsaid\n.\nEuropol noted that the malware variants are offered as a service to other threat actors and are used to conduct large-scale ransomware attacks. Furthermore, international arrest warrants have been issued against 20 key actors who are believed to be providing or operating initial access services to ransomware crews.\n\"This new phase demonstrates law enforcement's ability to adapt and strike again, even as cybercriminals retool and reorganize,\" Europol Executive Director Catherine De Bolle said. \"By disrupting the services criminals rely on to deploy ransomware, we are breaking the kill chain at its source.\"\nGermany's Federal Criminal Police Office (aka Bundeskriminalamt or BKA) has\nrevealed\nthat criminal proceedings have been initiated against 37 identified actors. Some of the individuals who have been added to the\nE.U. Most Wanted list\nare listed below -\nRoman Mikhailovich Prokop (aka carterj), 36, a member of the QakBot group\nDanil Raisowitsch Khalitov (aka dancho), 37, a member of the QakBot group\nIskander Rifkatovich Sharafetdinov (aka alik, gucci), 32, a member of the TrickBot group\nMikhail Mikhailovich Tsarev (aka mango), 36, a member of the TrickBot group\nMaksim Sergeevich Galochkin (aka bentley, manuel, Max17, volhvb, crypt), 43, a member of the TrickBot group\nVitalii Nikolaevich Kovalev (aka stern, ben, Grave, Vincent, Bentley, Bergen, Alex Konor), 36, a member of the TrickBot group\nThe disclosure comes as Europol took the wraps off a large-scale law enforcement operation that resulted in 270 arrests of dark web vendors and buyers across 10 countries: the United States (130), Germany (42), the United Kingdom (37), France (29), South Korea (19), Austria (4), the Netherlands (4), Brazil (3), Switzerland (1), and Spain (1).\nThe suspects, Europol noted, were identified based on intelligence gathered from the takedowns of the dark web marketplaces Nemesis, Tor2Door, Bohemia, and Kingdom Markets. Several suspects are alleged to have conducted thousands of sales on illicit marketplaces, often using encryption tools and cryptocurrencies to conceal their digital footprints.\n\"Known as Operation RapTor, this international sweep has dismantled networks trafficking in drugs, weapons, and counterfeit goods, sending a clear signal to criminals hiding behind the illusion of anonymity,\" Europol\nsaid\n.\nAlong with the arrests, €184 million in cash and cryptocurrencies, 2 tons of drugs, 180 firearms, 12,500 counterfeit products, and more than 4 tons of illegal tobacco have been seized by authorities. The joint action follows\nOperation SpecTor\nin May 2023, which led to the arrest of 288 dark web vendors and buyers and the seizure of €50.8 million in cash and cryptocurrency.\n\"With traditional marketplaces under increasing pressure, criminal actors are shifting to smaller, single-vendor shops — sites run by individual sellers to avoid marketplace fees and minimize exposure,\" Europol said. \"Illegal drugs remain the top commodity sold on the dark web, but 2023 also saw a surge in prescription drug trafficking and a rise in fraudulent services, including fake hitmen and bogus listings designed to scam buyers.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "SafeLine WAF: Open Source Web Application Firewall with Zero-Day Detection and Bot Protection",
        "Link": "https://thehackernews.com/2025/05/safeline-waf-open-source-web.html",
        "Summary": "From zero-day exploits to large-scale bot attacks — the demand for a powerful, self-hosted, and user-friendly web application security solution has never been greater.\nSafeLine is currently the most starred open-source Web Application Firewall (WAF) on GitHub, with over 16.4K stars and a rapidly growing global user base.\nThis walkthrough covers what SafeLine is, how it works, and why it’s",
        "Date": "2025-05-23",
        "Content": "From zero-day exploits to large-scale bot attacks — the demand for a powerful, self-hosted, and user-friendly web application security solution has never been greater.\nSafeLine is currently the most starred open-source Web Application Firewall (WAF) on GitHub, with over 16.4K stars and a rapidly growing global user base.\nThis walkthrough covers what SafeLine is, how it works, and why it's becoming the go-to solution over cloud-based WAFs.\nWhat is SafeLine WAF?\nSafeLine is a self-hosted web application firewall that acts as a reverse proxy, filtering and monitoring HTTP/HTTPS traffic to block malicious requests before they reach your backend web applications. Unlike cloud-based WAFs, SafeLine runs entirely on your own servers—giving you unmatched visibility and data sovereignty.\nKey Features of SafeLine WAF\nComprehensive Attack Prevention\nSafeLine effectively blocks a wide range of common and advanced web attacks, including SQL injection(SQLi), cross-site scripting (XSS), OS command injection, CRLF injection, XML External Entity (XXE) attacks, Server Side Request Forgery (SSRF), and directory traversal, etc.\nZero-Day Detection via Semantic Analysis\nUnlike traditional signature-based WAFs, SafeLine uses a patented semantic analysis engine that deeply parses HTTP traffic semantics.\nThis approach enables it to detect complex and zero-day attacks with high accuracy, resulting in an industry-leading detection rate of 99.45% and an ultra-low false positive rate of 0.07%. (The chart below compares SafeLine with the two versions of a globally recognized open-source WAF.)\nRobust Bot Protection\nSafeLine delivers comprehensive, multi-layered defenses against automated bot attacks, a growing threat vector responsible for credential stuffing, malicious scraping, inventory hoarding, and vulnerability scanning.\nIt combines several out-of-box powerful mechanisms:\nCAPTCHA Challenges:\nDynamically issued to distinguish human users from automated clients, especially in suspicious or high-risk traffic scenarios.\nDynamic Protection:\nRandomly encrypts and obfuscates frontend code, such as HTML and JavaScript, before delivering it to the client. This prevents bots from reliably parsing page structures or interacting with DOM elements, rendering automated scripts ineffective.\nAnti-Replay Mechanisms:\nDetect and block reuse of tokens, headers, or payloads often leveraged in scripted attacks or credential stuffing campaigns.\nHTTP Flood DDoS Mitigation\nHTTP flood DDoS attacks attempt to overwhelm servers by sending massive volumes of HTTP requests in a short period of time. These attacks can exhaust server resources, degrade performance, or take applications offline entirely.\nTo counter this, SafeLine implements\nrate limiting\nto cap request frequency and mitigate abuse. These measures are highly configurable, allowing defenders to tailor thresholds based on real-world traffic patterns.\nFor sudden traffic spikes—whether legitimate or malicious—SafeLine provides a\nvirtual waiting room\nmechanism. This ensures service availability by queuing excess users and releasing them gradually, preventing backend overload while maintaining a fair and orderly access experience.\nAuthentication Challenges\nSafeLine is also designed with Zero Trust principles in mind—never trust, always verify. It offers configurable visitor authentication to secure access to protected applications, enhancing security through enforced identity checks.\nAs a built-in identity gateway, it supports modern authentication protocols such as OIDC and integrates seamlessly with identity providers like GitHub and others.\nSafeLine also supports Single Sign-On (SSO) to streamline user authentication and simplify login experience in the meantime.\nBest of all, these enterprise-grade identity features are included for free.\nSimple Deployment in Minutes\nSafeLine is designed for quick setup and easy management. It requires the following environment to be installed and run:\nOperating System: Linux (x86_64 or arm64)\nDependencies: Docker (version 20.10.14 or higher) and Docker Compose (version 2.0.0 or higher)\nMinimum System Requirements: 1 CPU core, 1 GB of RAM, and 5 GB of available disk space\nOnce the environment is ready, installation takes just a few minutes with a single command.\nbash -c \"$(curl -fsSLk https://waf.chaitin.com/release/latest/manager.sh)\" -- --en\nA user-friendly, wizard-based interface guides you through configuration. Full documentation is available\nhere\n.\nWhy Choose SafeLine Over Cloud-Based WAFs?\nUnlike traditional cloud-based WAFs that route your traffic through third-party infrastructure, SafeLine offers complete deployment autonomy. Here are the advantages:\nFull Data Control:\nSensitive traffic and logs remain on-premises, reducing exposure to third-party cloud risks.\nCost Efficiency:\nAvoids recurring subscription fees common with cloud WAFs, especially beneficial for high-traffic environments.\nFree and Out-of-Box Enterprise Features:\nAdvanced threat detection, bot protection, identity authentication, and more—typically gated behind \"premium\" tiers elsewhere—are out-of-box and included for free.\nGet SafeLine\n— free forever for personal use, with optional 7-day Pro trial.\nUse Cases Ideal for SafeLine\nSafeLine is a versatile solution built for a wide range of web application security needs. It's particularly well-suited for:\nOrganizations with strict data privacy or regulatory compliance requirements\nTeams Targeted by Sophisticated Bots and Automated Threats\nSmall and medium-sized businesses seeking affordable, enterprise-grade protection\nDevOps and Security Teams Requiring Full Deployment Control and Customization\nProjects requiring rapid deployment and easy maintenance\nFinal Words\nSafeLine stands out as a powerful, open-source alternative to traditional cloud-based WAFs. With cutting-edge zero-day detection, robust bot mitigation, and zero trust–aligned identity features—all bundled into a self-hosted, easy-to-deploy package—SafeLine empowers developers, security teams, and organizations of all sizes to take control of their web security.\nGet SafeLine\n— free forever for personal use, with optional 7-day Pro trial.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "U.S. Dismantles DanaBot Malware Network, Charges 16 in $50M Global Cybercrime Operation",
        "Link": "https://thehackernews.com/2025/05/us-dismantles-danabot-malware-network.html",
        "Summary": "The U.S. Department of Justice (DoJ) on Thursday announced the disruption of the online infrastructure associated with DanaBot (aka DanaTools) and unsealed charges against 16 individuals for their alleged involvement in the development and deployment of the malware, which it said was controlled by a Russia-based cybercrime organization.\nThe malware, the DoJ said, infected more than 300,000",
        "Date": "2025-05-23",
        "Content": "The U.S. Department of Justice (DoJ) on Thursday\nannounced\nthe disruption of the online infrastructure associated with\nDanaBot\n(aka DanaTools) and unsealed charges against 16 individuals for their alleged involvement in the development and deployment of the malware, which it said was controlled by a Russia-based cybercrime organization.\nThe malware, the DoJ said, infected more than 300,000 victim computers around the world, facilitated fraud and ransomware, and caused at least $50 million in damages. Two of the defendants, Aleksandr Stepanov (aka JimmBee), 39, and Artem Aleksandrovich Kalinkin (aka Onix), 34, both from Novosibirsk, Russia, are currently at large.\nStepanov has been charged with conspiracy, conspiracy to commit wire fraud and bank fraud, aggravated identity theft, unauthorized access to a protected computer to obtain information, unauthorized impairment of a protected computer, wiretapping, and use of an intercepted communication. Kalinkin has been charged with conspiracy to gain unauthorized access to a computer to obtain information, to gain unauthorized access to a computer to defraud, and to commit unauthorized impairment of a protected computer.\nThe unsealed criminal complaint and indictment show that many of the defendants, counting Kalinkin, exposed their real-life identities after accidentally infecting their own systems with the malware.\n\"In some cases, such self-infections appeared to be deliberately done in order to test, analyze, or improve the malware,\" the\ncomplaint\n[PDF] read. \"In other cases, the infections seemed to be inadvertent – one of the hazards of committing cybercrime is that criminals will sometimes infect themselves with their own malware by mistake.\"\n\"The inadvertent infections often resulted in sensitive and compromising data being stolen from the actor's computer by the malware and stored on the DanaBot servers, including data that helped identify members of the DanaBot organization.\"\nIf convicted, Kalinkin is expected to face a statutory maximum sentence of 72 years in federal prison. Stepanov would face a jail term of five years. Concurrent with the action, the law enforcement effort, carried out as part of\nOperation Endgame\n, saw DanaBot's command-and-control (C2) servers seized, including dozens of virtual servers hosted in the United States.\n\"DanaBot malware used a variety of methods to infect victim computers, including spam email messages containing malicious attachments or hyperlinks,\" the DoJ said. \"Victim computers infected with DanaBot malware became part of a botnet (a network of compromised computers), enabling the operators and users of the botnet to remotely control the infected computers in a coordinated manner.\"\nExample of typical Danabot infrastructure\nDanaBot, like the\nrecently dismantled\nLumma Stealer malware, operates under a malware-as-a-service (MaaS) scheme, with the administrators leasing out access starting from $500 to \"several thousand dollars\" a month. Tracked under the monikers Scully Spider and\nStorm-1044\n, is a multi-functional tool along the lines of Emotet, TrickBot, QakBot, and IcedID that's capable of acting as a stealer and a delivery vector for next-stage payloads, such as ransomware.\nThe Delphi-based modular malware is equipped to siphon data from victim computers, hijack banking sessions, and steal device information, user browsing histories, stored account credentials, and virtual currency wallet information. It can also provide full remote access, log keystrokes, and capture videos. It's been active in the wild since its\ndebut in May 2018\n, when it started off as a banking trojan.\n\"DanaBot initially targeted victims in Ukraine, Poland, Italy, Germany, Austria, and Australia prior to expanding its targeting posture to include U.S.- and Canada-based financial institutions in October 2018,\" CrowdStrike\nsaid\n. \"The malware's popularity grew due to its early modular development supporting Zeus-based web injects, information stealer capabilities, keystroke logging, screen recording, and hidden virtual network computing (HVNC) functionality.\"\nAccording to Black Lotus Labs and Team Cymru, DanaBot employs a layered communications infrastructure between a victim and the botnet controllers, wherein the C2 traffic is proxied through two or three server tiers before it reaches the final level. At least five to six tier-2 servers were active at any given time. A majority of DanaBot victims are concentrated around Brazil, Mexico, and the United States.\n\"The operators have shown their commitment to their craft, adapted to detection and changes in enterprise defense, and with later iterations, insulating the C2s in tiers to obfuscate tracking,\" the companies\nsaid\n. \"Throughout this time, they have made the bot more user-friendly with structured pricing and customer support.\"\nNumber of DanaBot campaigns observed in Proofpoint email threat data from May 2018 to April 2025\nTelemetry data\ngathered\nby Proofpoint shows that DanaBot was \"nearly entirely absent\" from the email threat landscape from July 2020 through June 2024, indicating that threat actors propagated the malware through other methods like SEO poisoning and malvertising campaigns.\nThe DoJ said DanaBot administrators operated a second version of the botnet that was specially designed to target victim computers in military, diplomatic, government, and related entities in North America and Europe. This variant, emerging in January 2021, came fitted with capabilities to record all interactions happening on a victim device and send the data to a different server.\n\"Pervasive malware like DanaBot harms hundreds of thousands of victims around the world, including sensitive military, diplomatic, and government entities, and causes many millions of dollars in losses,\" said United States Attorney Bill Essayli for the Central District of California.\nHigh-level diagram of multi-tiered C2 architecture\nThe DoJ further credited several private sector firms, Amazon, CrowdStrike, ESET, Flashpoint, Google, Intel 471, Lumen, PayPal, Proofpoint, Spycloud, Team Cymru, and Zscaler, for providing \"valuable assistance.\"\nSome of the noteworthy aspects of DanaBot, compiled from various reports, are below -\nDanaBot's sub-botnet 5 received commands to download a Delphi-based executable leveraged to conduct HTTP-based distributed denial-of-service (DDoS) attacks\nagainst\nthe Ukrainian Ministry of Defence (MOD) webmail server and the National Security and Defense Council (NSDC) of Ukraine in March 2022, shortly after Russia's invasion of the country\nTwo DanaBot sub-botnets, 24 and 25, were specifically used for espionage purposes likely with an aim to further intelligence-gathering activities on behalf of Russian government interests\nDanaBot operators have periodically restructured their offering since 2022 to focus on defense evasion, with at least\n85 distinct build numbers\nidentified to date (The most recent version is 4006, which was compiled in March 2025)\nThe malware's infrastructure\nconsists\nof multiple components: A \"bot\" that infects target systems and performs data collection, an \"OnlineServer\" that manages the RAT functionalities, a \"client\" for processing collected logs and bot management, and a \"server\" that handles bot generation, packing, and C2 communication\nDanaBot has been used in targeted espionage attacks against government officials in the Middle East and Eastern Europe\nThe authors of DanaBot operate as a single group, offering the malware for rent to potential affiliates, who subsequently use it for their own malicious purposes by establishing and managing their own botnets using private servers\nDanaBot's developers have\npartnered\nwith the authors of several malware cryptors and loaders, such as\nMatanbuchus\n, and offered special pricing for distribution bundles\nDanaBot\nmaintained\nan average of 150 active tier-1 C2 servers per day, with approximately 1,000 daily victims across more than 40 countries, making it one of the largest MaaS platforms active in 2025\nProofpoint, which\nfirst identified and named DanaBot\nin May 2018, said the disruption of the MaaS operation is a win for defenders and that it will have an impact on the cybercriminal threat landscape.\n\"Cybercriminal disruptions and law enforcement actions not only impair malware functionality and use but also impose a cost to threat actors by forcing them to change their tactics, cause mistrust in the criminal ecosystem, and potentially make criminals think about finding a different career,\" Selena Larson, a staff threat researcher at Proofpoint, said.\n\"These successes against cyber criminals only come about when business IT teams and security service providers share much-needed insight into the biggest threats to society, affecting the greatest number of people around the world, which law enforcement can use to track down the servers, infrastructure, and criminal organizations behind the attacks. Private and public sector collaboration is crucial to knowing how actors operate and taking action against them.\"\nDanaBot's features as promoted on its support site\nDoJ Unseals Charges Against QakBot Leader\nThe development comes as the DoJ unsealed charges against a 48-year-old Moscow resident, Rustam Rafailevich Gallyamo, for leading efforts to develop and maintain the\nQakBot\nmalware, which was\ndisrupted\nin a multinational operation in August 2023. The agency also filed a civil forfeiture complaint against over $24 million in cryptocurrency seized from Gallyamov over the course of the investigation.\n\"Gallyamov developed, deployed, and controlled the Qakbot malware beginning in 2008,\" the DoJ said. \"From 2019 onward, Gallyamov allegedly used the Qakbot malware to infect thousands of victim computers around the world in order to establish a network, or 'botnet,' of infected computers.\"\nThe DoJ revealed that, following the takedown, Gallyamov and his co-conspirators\ncontinued their criminal activities\nby switching to other tactics like \"spam bomb\" attacks in order to gain unauthorized access to victim networks and deploy ransomware families like Black Basta and CACTUS. Court documents accuse the e-crime group of engaging in these methods as recently as January 2025.\n\"Mr. Gallyamov's bot network was crippled by the talented men and women of the FBI and our international partners in 2023, but he brazenly continued to deploy alternative methods to make his malware available to criminal cyber gangs conducting ransomware attacks against innocent victims globally,\" said Assistant Director in Charge Akil Davis of the FBI's Los Angeles Field Office.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "CISA Warns of Suspected Broader SaaS Attacks Exploiting App Secrets and Cloud Misconfigs",
        "Link": "https://thehackernews.com/2025/05/cisa-warns-of-suspected-broader-saas.html",
        "Summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Thursday revealed that Commvault is monitoring cyber threat activity targeting applications hosted in their Microsoft Azure cloud environment.\n\"Threat actors may have accessed client secrets for Commvault's (Metallic) Microsoft 365 (M365) backup software-as-a-service (SaaS) solution, hosted in Azure,\" the agency said.\n\"This",
        "Date": "2025-05-23",
        "Content": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Thursday revealed that Commvault is monitoring cyber threat activity targeting applications hosted in their Microsoft Azure cloud environment.\n\"Threat actors may have accessed client secrets for Commvault's (Metallic) Microsoft 365 (M365) backup software-as-a-service (SaaS) solution, hosted in Azure,\" the agency\nsaid\n.\n\"This provided the threat actors with unauthorized access to Commvault's customers' M365 environments that have application secrets stored by Commvault.\"\nCISA further noted that the activity may be part of a broader campaign targeting various software-as-a-service (SaaS) providers' cloud infrastructures with default configurations and elevated permissions.\nThe advisory comes weeks after Commvault revealed that Microsoft notified the company in February 2025 of unauthorized activity by a nation-state threat actor within its Azure environment.\nThe incident led to the\ndiscovery\nthat the threat actors had been exploiting a zero-day vulnerability (\nCVE-2025-3928\n), an unspecified flaw in the Commvault Web Server that enables a remote, authenticated attacker to create and execute web shells.\n\"Based on industry experts, this threat actor uses sophisticated techniques to try to gain access to customer M365 environments,\" Commvault\nsaid\nin an announcement. \"This threat actor may have accessed a subset of app credentials that certain Commvault customers use to authenticate their M365 environments.\"\nCommvault said it has taken several remedial actions, including rotating app credentials for M365, but emphasized that there has been no unauthorized access to customer backup data.\nTo mitigate such threats, CISA is recommending that users and administrators follow the below guidelines -\nMonitor Entra audit logs for unauthorized modifications or additions of credentials to service principals initiated by Commvault applications/service principals\nReview Microsoft logs (Entra audit, Entra sign-in, unified audit logs) and conduct internal threat hunting\nFor single tenant apps, implement a conditional access policy that limits authentication of an application service principal to an approved IP address that is listed within Commvault's allowlisted range of IP addresses\nReview the list of Application Registrations and Service Principals in Entra with administrative consent for higher privileges than the business need\nRestrict access to Commvault management interfaces to trusted networks and administrative systems\nDetect and block path-traversal attempts and suspicious file uploads by deploying a Web Application Firewall and removing external access to Commvault applications\nCISA, which added\nCVE-2025-3928\nto its Known Exploited Vulnerabilities Catalog in late April 2025, said it's continuing to investigate the malicious activity in collaboration with partner organizations.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "GitLab Duo Vulnerability Enabled Attackers to Hijack AI Responses with Hidden Prompts",
        "Link": "https://thehackernews.com/2025/05/gitlab-duo-vulnerability-enabled.html",
        "Summary": "Cybersecurity researchers have discovered an indirect prompt injection flaw in GitLab's artificial intelligence (AI) assistant Duo that could have allowed attackers to steal source code and inject untrusted HTML into its responses, which could then be used to direct victims to malicious websites.\nGitLab Duo is an artificial intelligence (AI)-powered coding assistant that enables users to write,",
        "Date": "2025-05-23",
        "Content": "Cybersecurity researchers have discovered an indirect prompt injection flaw in GitLab's artificial intelligence (AI) assistant Duo that could have allowed attackers to steal source code and inject untrusted HTML into its responses, which could then be used to direct victims to malicious websites.\nGitLab Duo\nis an artificial intelligence (AI)-powered\ncoding assistant\nthat enables users to write, review, and edit code. Built using Anthropic's Claude models, the service was first launched in June 2023.\nBut as Legit Security\nfound\n, GitLab Duo Chat has been susceptible to an indirect prompt injection flaw that permits attackers to \"steal source code from private projects, manipulate code suggestions shown to other users, and even exfiltrate confidential, undisclosed zero-day vulnerabilities.\"\nPrompt injection refers to a\nclass of vulnerabilities\ncommon in AI systems that enable threat actors to weaponize large language models (LLMs) to\nmanipulate responses\nto users' prompts and result in undesirable behavior.\nIndirect prompt injections\nare a\nlot more trickier\nin that instead of providing an AI-crafted input directly, the rogue instructions are embedded within another context, such as a document or a web page, which the model is designed to process.\nRecent studies have shown that LLMs are also vulnerable to\njailbreak attack techniques\nthat make it\npossible\nto trick AI-driven chatbots into generating harmful and illegal information that\ndisregards their ethical and safety guardrails\n, effectively obviating the need for carefully crafted prompts.\nWhat's more, Prompt Leakage (PLeak) methods could be used to inadvertently reveal the preset system prompts or instructions that are meant to be followed by the model.\n\"For organizations, this means that private information such as internal rules, functionalities, filtering criteria, permissions, and user roles can be leaked,\" Trend Micro\nsaid\nin a report published earlier this month. \"This could give attackers opportunities to exploit system weaknesses, potentially leading to data breaches, disclosure of trade secrets, regulatory violations, and other unfavorable outcomes.\"\nPLeak attack demonstration - Credential Excess / Exposure of Sensitive Functionality\nThe latest findings from the Israeli software supply chain security firm show that a hidden comment placed anywhere within merge requests, commit messages, issue descriptions or comments, and source code was enough to leak sensitive data or inject HTML into GitLab Duo's responses.\nThese prompts could be concealed further using encoding tricks like Base16-encoding, Unicode smuggling, and KaTeX rendering in white text in order to make them less detectable. The lack of input sanitization and the fact that GitLab did not treat any of these scenarios with any more scrutiny than it did source code could have enabled a bad actor to plant the prompts across the site.\n\"Duo analyzes the entire context of the page, including comments, descriptions, and the source code — making it vulnerable to injected instructions hidden anywhere in that context,\" security researcher Omer Mayraz said.\nThis also means that an attacker could deceive the AI system into including a malicious JavaScript package in a piece of synthesized code, or present a malicious URL as safe, causing the victim to be redirected to a fake login page that harvests their credentials.\nOn top of that, by taking advantage of GitLab Duo Chat's ability to access information about specific merge requests and the code changes inside of them, Legit Security found that it's possible to insert a hidden prompt in a merge request description for a project that, when processed by Duo, causes the private source code to be exfiltrated to an attacker-controlled server.\nThis, in turn, is made possible owing to its use of streaming markdown rendering to interpret and render the responses into HTML as the output is generated. In other words, feeding it HTML code via indirect prompt injection could cause the code segment to be executed on the user's browser.\nFollowing responsible disclosure on February 12, 2025, the issues have been\naddressed\nby GitLab.\n\"This vulnerability highlights the double-edged nature of AI assistants like GitLab Duo: when deeply integrated into development workflows, they inherit not just context — but risk,\" Mayraz said.\n\"By embedding hidden instructions in seemingly harmless project content, we were able to manipulate Duo's behavior, exfiltrate private source code, and demonstrate how AI responses can be leveraged for unintended and harmful outcomes.\"\nThe disclosure comes as Pen Test Partners\nrevealed\nhow\nMicrosoft Copilot for SharePoint\n, or SharePoint Agents, could be exploited by local attackers to access sensitive data and documentation,\neven from files\nthat have the \"Restricted View\" privilege.\n\"One of the primary benefits is that we can search and trawl through massive datasets, such as the SharePoint sites of large organisations, in a short amount of time,\" the company said. \"This can drastically increase the chances of finding information that will be useful to us.\"\nThe attack techniques follow new research that\nElizaOS\n(formerly Ai16z), a nascent decentralized AI agent framework for automated Web3 operations, could be manipulated by injecting malicious instructions into prompts or historical interaction records, effectively corrupting the stored context and leading to unintended asset transfers.\n\"The implications of this vulnerability are particularly severe given that ElizaOSagents are designed to interact with multiple users simultaneously, relying on shared contextual inputs from all participants,\" a group of academics from Princeton University\nwrote\nin a paper.\n\"A single successful manipulation by a malicious actor can compromise the integrity of the entire system, creating cascading effects that are both difficult to detect and mitigate.\"\nPrompt injections and jailbreaks aside, another significant issue ailing LLMs today is hallucination, which occurs when the models generate responses that are not based on the input data or are simply fabricated.\nAccording to a new study published by AI testing company Giskard, instructing LLMs to be concise in their answers can negatively affect factuality and worsen hallucinations.\n\"This effect seems to occur because effective rebuttals generally require longer explanations,\" it\nsaid\n. \"When forced to be concise, models face an impossible choice between fabricating short but inaccurate answers or appearing unhelpful by rejecting the question entirely.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "OpenAI confirms Operator Agent is now more accurate with o3",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-confirms-operator-agent-is-now-more-accurate-with-o3/",
        "Summary": "OpenAI says Operator Agent now uses the o3 model, which means it's now significantly better at reasoning capabilities. [...]",
        "Date": "2025-05-23",
        "Content": "OpenAI says Operator Agent now uses the o3 model, which means it's now significantly better at reasoning capabilities.\nFor those unaware, Operator, which is still in research preview, allows users to delegate web tasks to the AI agent.\nYou can use it to automate repetitive tasks, such as filling forms and ordering products.\nOperator isn't exactly new and has been around since January 2025, but only those who pay for a $200 Pro and Enterprise subscription have access to it.\nI recently\nreported\nthat OpenAI is planning to improve Operator and turn it into a \"very useful tool.\"\nWhile we are yet to see any meaningful improvements to the UX, OpenAI\nconfirmed\nthat it has updated Operator to o3.\nPreviously, the web Agent used 4o, a non-reasoning models to automate tasks. With o3, Operator is more persistent and accurate when interacting with the browser.\n\"Now Operator is more persistent and accurate when interacting with the browser, improving overall task success rate. Responses are also more clear, thorough and better structured,\" the company noted.\n\"Operator continues to be available as a research preview to ChatGPT Pro users globally. This upgraded model is only available in Operator in ChatGPT.\"\nHowever, the question remains: would you pay $200 to automate grocery shopping and similar tasks? Most people won't, and that's why OpenAI is internally testing new ways to make the tool more useful.\nWhile Operator remains exclusive to the $200 Pro subscription, OpenAI has plans to release the feature for $20 Plus subscribers in the future.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nOpenAI hints at a big upgrade for ChatGPT Operator Agent\nOpenAI document explains when to use each ChatGPT model\nOpenAI plans to combine multiple models into GPT-5\nLeak confirms OpenAI's ChatGPT will integrate MCP\nChatGPT is finally adding Download as PDF for Deep Research"
    },
    {
        "Title": "Dozens of malicious packages on NPM collect host and network data",
        "Link": "https://www.bleepingcomputer.com/news/security/dozens-of-malicious-packages-on-npm-collect-host-and-network-data/",
        "Summary": "60 packages have been discovered in the NPM index that attempt to collect sensitive host and network data and send it to a Discord webhook controlled by the threat actor. [...]",
        "Date": "2025-05-23",
        "Content": "60 packages have been discovered in the NPM index that attempt to collect sensitive host and network data and send it to a Discord webhook controlled by the threat actor.\nAccording to\nSocket’s Threat Research team\n, the packages were uploaded to the NPM repository starting May 12 from three publisher accounts.\nEach of the malicious packages contains a post-install script that automatically executes during ‘npm install’ and collects the following information:\nHostname\nInternal IP address\nUser home directory\nCurrent working directory\nUsername\nSystem DNS servers\nThe script checks for hostnames related to cloud providers, reverse DNS strings, in an attempt to determine if it is running in an analysis environment.\nSocket did not observe the delivery of second-stage payloads, privilege escalation, or any persistent mechanisms. However, given the type of data collected, the danger of targeted network attacks is significant.\nPackages still available on NPM\nThe researchers reported the malicious packages but at the time of writing they were still available on NPM and showed a cumulative download count of 3,000. By publishing time, though, none of them were present in the repository.\nTo trick developers into using them, the threat actor behind the campaign used names similar to legitimate packages in the index, like ‘flipper-plugins,’ ‘react-xterm2,’ and ‘hermes-inspector-msggen,’ generic trust-evoking names, and others that hint at testing, possibly targeting CI/CD pipelines.\nThe complete list of the 60 malicious packages is available at the bottom section of Socket’s report.\nIf you have installed any of them, it is recommended to remove them immediately and perform a full system scan to eradicate any infection remnants.\nData wipers on NPM\nAnother malicios campaign that\nSocket uncovered\nyesterday on NPM involved eight malicious packages that mimic legitimate tools through typosquatting but can delete files, corrupt data, and shut down systems.\nThe packages, which targeted the React, Vue.js, Vite, Node.js, and Quill ecosystems, existed on NPM for the past two years, getting 6,200 downloads.\nEvading this long was partly due to the payloads being activated based on hardcoded system dates and were structured to progressively destroy framework files, corrupt core JavaScript methods, and sabotage browser storage mechanisms.\nScript designed to delete Vue.js-related files on June 19–30, 2023\nSource: Socket\nThe threat actor behind this campaign, who published them under the name ‘xuxingfeng’, has also listed several legitimate packages to build trust and evade detection.\nAlthough the danger has passed now based on the hardcoded dates, removing the packages is crucially important as their author could introduce updates that will re-trigger their wiping functions in the future.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nHackers use fake Ledger apps to steal Mac users’ seed phrases\nLumma infostealer malware operation disrupted, 2,300 domains seized\nSupply chain attack hits npm package with 45,000 weekly downloads\nStealC malware enhanced with stealth upgrades and data theft tools\nTikTok videos now push infostealer malware in ClickFix attacks"
    },
    {
        "Title": "Hacker steals $223 million in Cetus Protocol cryptocurrency heist",
        "Link": "https://www.bleepingcomputer.com/news/security/hacker-steals-223-million-in-cetus-protocol-cryptocurrency-heist/",
        "Summary": "The decentralized exchange Cetus Protocol announced that hackers have stolen $223 million in cryptocurrency and is offering a deal to stop all legal action if the funds are returned. [...]",
        "Date": "2025-05-23",
        "Content": "The decentralized exchange Cetus Protocol announced that hackers have stolen $223 million in cryptocurrency and is offering a deal to stop all legal action if the funds are returned.\nThe project also announced a $5 million bounty to anyone providing relevant information leading to the identification and arrest of the attacker.\nCetus Protocol is a decentralized exchange (DEX) and liquidity protocol operating on the Sui and Aptos blockchains.\nIt employs a Concentrated Liquidity Market Maker (CLMM) model, allowing liquidity providers to allocate assets within specific price ranges, enhancing capital efficiency and enabling advanced trading strategies.\nCetus Protocol boasts a total trading volume of $57 billion (as of May 2025), with over 15 million accounts executing 144 million trades on the platform.\nThe incident occurred yesterday, initially prompting Cetus Protocol to\npause its smart contract\nfor investigations.\nA few hours later, the project confirmed the theft and that \"$162M of the compromised funds have been successfully paused.\"\nIn a later statement, Cetus Protocol announced that the hacker had exploited a vulnerable package but no details have been disclosed.\n“We identified the root cause of the exploit and, fixed the related package, and informed ecosystem builders as fast as we could with help from ecosystem members to prevent other teams being affected,”\nstated Cetus Protocol\n.\nAdditionally, the platform noted that it has identified the attacker’s Ethereum wallet address and accounts, and is working with third parties to trace and freeze funds. Law enforcement has also been informed.\nCetus Protocol also offered the hacker \"a time-sensitive whitehat settlement,\" promising not to pursue legal action if the funds are returned. To put more pressure on the attacker, the project announced a $5 million bounty for information leading to the identification and the arrest of the hacker.\nMeanwhile, a significant $162 million was paused on the Sui blockchain following an emergency vote by the validators.\nBlockchain analytics company Elliptic\npublished a report\nbased on its visibility of the incident, pointing to a flaw in the automated market maker (AMM) logic, possibly involving pool price manipulation enabling flash loan-style attacks.\nThe blockchain intelligence firm also offers an overview of the attacker’s fund movement attempts, including swaps from USDT to USDC and cross-chain movement from Suit to Ethereum.\nOverview of the Cetus Protocol hack transactions\nSource: Elliptic\nElliptic is actively tracing the transactions from the initial exploit on Sui to the attacker’s wallets on Ethereum, and the hacker’s address is flagged on all major exchanges and virtual asset service providers, preventing laundering or transfer attempts.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nIsrael arrests new suspect behind Nomad Bridge $190M crypto hack\nUS charges 12 more suspects linked to $230 million crypto theft\nGermany takes down eXch cryptocurrency exchange, seizes servers\nGrinex exchange suspected rebrand of sanctioned Garantex crypto firm\nU.S. seized $8.2 million in crypto linked to 'Romance Baiting' scams"
    },
    {
        "Title": "FBI warns of Luna Moth extortion attacks targeting law firms",
        "Link": "https://www.bleepingcomputer.com/news/security/fbi-warns-of-luna-moth-extortion-attacks-targeting-law-firms/",
        "Summary": "The FBI warned that an extortion gang known as the Silent Ransom Group has been targeting U.S. law firms over the last two years in callback phishing and social engineering attacks. [...]",
        "Date": "2025-05-23",
        "Content": "The FBI warned that an extortion gang known as the Silent Ransom Group has been targeting U.S. law firms over the last two years in callback phishing and social engineering attacks.\nAlso known as Luna Moth, Chatty Spider, and UNC3753, this threat group has been active\nsince 2022\nand was also behind\nBazarCall campaigns\nthat provided initial access to corporate networks for Ryuk and Conti ransomware attacks.\nIn March 2022, following\nConti's shutdown\n, the threat actors separated from the cybercrime syndicate and formed their own\noperation called Silent Ransom Group (SRG)\n.\nIn recent attacks, SRG impersonates the targets' IT support in email, fake sites, and phone calls using social engineering tactics to gain access to the targets' networks.\nThis extortion group doesn't encrypt the victims' systems and is known for demanding ransoms not to leak sensitive information stolen from compromised devices online.\n\"SRG will then direct the employee to join a remote access session, either through an email sent to them, or navigating to a web page. Once the employee grants access to their device, they are told that work needs to be done overnight,\" the FBI\nsaid\nin a private industry notification on Friday.\n\"Once in the victim's device, a typical SRG attack involves minimal privilege escalation and quickly pivots to data exfiltration conducted through 'WinSCP' (Windows Secure Copy) or a hidden or renamed version of 'Rclone.'\"\nAfter stealing the victims' data, they extort them via ransom emails, threatening to sell or publish the information, and they'll also call employees of breached organizations to pressure them into ransom negotiations. While they have a dedicated website where they're leaking their victims' data, the FBI says the extortion gang doesn't always follow up on their data leak threats.\nSRG targets over the past year (EclecticIQ)\nTo defend against their attacks, the FBI advises using robust passwords, enabling two-factor authentication for all employees, making regular data backups, and conducting staff training on detecting phishing attempts.\nFBI's warning follows a recent\nEclecticIQ report\ndetailing SRG attacks targeting legal and financial institutions in the United States, with the attackers being observed registering domains to \"impersonate IT helpdesk or support portals for major U.S. law firms and financial services firms, using typosquatted patterns.\"\nVictims are being sent malicious emails with fake helpdesk numbers, urging them to call to resolve various non-existent problems. However, Luna Moth operators impersonating IT staff on the other end will attempt to trick targeted companies' employees into installing remote monitoring & management (RMM) software from fake IT help desk sites.\nOnce the RMM tool is installed and launched, the threat actors gain hands-on keyboard access, which allows them to look for valuable documents on compromised devices and shared drivers that will be later exfiltrated using Rclone (cloud syncing) or WinSCP (via SFTP).\nAccording to EclecticIQ, ransom demands sent by the Silent Ransom Group range between one and eight million USD, depending on the breached company's size.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nLuna Moth extortion hackers pose as IT help desks to breach US firms\nCoinbase data breach exposes customer info and government IDs\nFBI: Ransomware gangs hack casinos via 3rd party gaming vendors\nNew ‘Luna Moth’ hackers breach orgs via fake subscription renewals\nMicrosoft: Octo Tempest is one of the most dangerous financial hacking groups"
    },
    {
        "Title": "TikTok videos now push infostealer malware in ClickFix attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/tiktok-videos-now-push-infostealer-malware-in-clickfix-attacks/",
        "Summary": "Cybercriminals are using TikTok videos to trick users into infecting themselves with Vidar and StealC information-stealing malware in ClickFix attacks. [...]",
        "Date": "2025-05-23",
        "Content": "Cybercriminals are using TikTok videos to trick users into infecting themselves with Vidar and StealC information-stealing malware in ClickFix attacks.\nAs Trend Micro recently discovered, the threat actors behind this TikTok social engineering campaign are using videos likely generated using AI that ask viewers to run commands claiming to activate Windows and Microsoft Office, as well as premium features in various legitimate software like CapCut and Spotify.\n\"This attack uses videos (possibly AI-generated) to instruct users to execute PowerShell commands, which are disguised as software activation steps. TikTok's algorithmic reach increases the likelihood of widespread exposure, with one video reaching more than half a million views,\"\nTrend Micro said\n.\n\"The videos are highly similar, with only minor differences in camera angles and the download URLs used by PowerShell to fetch the payload,\" it added.\n\"These suggest that the videos were likely created through automation. The instructional voice also appears AI-generated, reinforcing the likelihood that AI tools are being used to produce these videos.\"\nOne of the videos claiming to provide instructions on how to \"boost your Spotify experience instantly,\" has reached almost 500,000 views, with over 20,000 likes and more than 100 comments.\nTikTok ClickFix video (Trend Micro)\n​In the video, the attackers prompt viewers to run a PowerShell command that will instead download and execute a remote script from\nhxxps://allaivo[.]me/spotify\nthat installs Vidar or StealC information-stealing malware, launching it as a hidden process with elevated permissions.\nAfter being deployed,\nVidar\ncan take desktop screenshots and steal credentials, credit cards, cookies, cryptocurrency wallets, text files, and Authy 2FA authenticator databases.\nStealc\ncan also harvest a wide range of sensitive information from infected computers as it targets dozens of web browsers and cryptocurrency wallets.\nAfter the device is compromised, the script will download a second PowerShell script payload from\nhxxps://amssh[.]co/script[.]ps1\nthat will add a registry key to launch at startup automatically.\nAttack flow (Trend Micro)\n​What is ClickFix?\nClickFix\nis a tactic where attackers employ fake errors or verification systems, such as\nCAPTCHA prompts\n, to trick potential targets into running malicious scripts to download and install malware on their devices.\nWhile generally targeting\nWindows\nusers\nthrough PowerShell commands, ClickFix has also been adopted in attacks against\nmacOS\nand\nLinux\nusers.\nState-sponsored threat groups have also hacked their targets in similar attacks, with APT28 and ColdRiver (Russia), Kimsuky (North Korea), and MuddyWater (Iran)\nhaving all used these tactics\nin espionage campaigns in recent months.\nThis is not the first time TikTok videos were used to push malware, with cybercriminals capitalizing on a trending TikTok challenge named 'Invisible Challenge' to infect thousands with a fake app that installed\nWASP Stealer (Discord Token Grabber) malware\n.\nThe malware was pushed through videos that received over a million views shortly after being posted and can steal Discord accounts, passwords, credit cards, and cryptocurrency wallets.\nIn recent years, scammers have also been\nflooding TikTok\nwith fake cryptocurrency giveaways, almost all using Elon Musk, Tesla, or SpaceX themes.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nLumma infostealer malware operation disrupted, 2,300 domains seized\nStealC malware enhanced with stealth upgrades and data theft tools\nHackers now testing ClickFix attacks against Linux targets\nFake AI video generators drop new Noodlophile infostealer malware\nDozens of malicious packages on NPM collect host and network data"
    },
    {
        "Title": "Windows 11 Notepad gets AI-powered text writing capabilities",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-notepad-gets-ai-powered-text-writing-capabilities/",
        "Summary": "Microsoft is testing a new AI-powered text generation feature in Notepad that can let Windows Insiders create content based on custom prompts. [...]",
        "Date": "2025-05-23",
        "Content": "Microsoft is testing a new AI-powered text generation feature in Notepad that can let Windows Insiders create content based on custom prompts.\nDubbed \"Write,\" the new Notepad feature is rolling out to Windows 11 Insiders in the Canary and Dev Channels, who have upgraded to Notepad version 11.2504.46.0.\n\"The new write feature helps you quickly draft text based on your prompt, making it easy to start from a blank page or build upon existing content with AI-powered assistance. To get started, place your cursor where you want to insert new text or select content you'd like to use as a reference,\"\nsaid\nDave Grochocki, Principal Group Product Manager for Windows Inbox Apps.\n\"Then right-click and choose Write, select Write from the Copilot menu, or use the Ctrl + Q keyboard shortcut. Enter your instruction into the dialog and click Send. The AI-generated output will appear directly on the canvas.\"\nYou can add the generated text to the document by clicking the \"Keep text\" button and hitting \"Discard\" if it doesn't fit your requirements. You can also enter additional prompts to refine the output.\nGrochocki added that users must sign in to their Microsoft personal account to use the Writee tool, which will use AI credits linked to their Microsoft 365 Personal, Family, and Copilot Pro subscriptions.\nNotepad Write (Microsoft)\nOver the last few years, Microsoft has been actively working to add more AI features to the Windows 11 Notepad application. For example, in November, it included a\nnew text rewriting tool\ncalled \"Rewrite\" with the release of Notepad version 11.2410.15.0.\nFormerly known as\nCoWriter\n, it uses generative AI to rewrite content automatically, and it can rephrase sentences, modify the length of the text, and adjust the tone.\nAdditionally, in December 2023, Microsoft introduced a\nbuilt-in character counter\n, and in July 2024, they rolled out a\nspell-check and autocorrect feature\n.\nIf you don't want Notepad's AI options in the user interface, you can disable them from the app's settings or uninstall the Notepad app to use the Windows built-in notepad.exe program.\nOn Thursday, the company also started rolling out new AI capabilities for Paint and Snipping Tool users enrolled in the Windows Insider program.\nThose who have installed Paint version 11.2504.451.0 can create custom stickers by clicking the \"Sticker generator button\" in the Copilot menu and isolate individual image elements more easily using an AI-powered selection tool.\nSnipping Tool version 11.2504.38.0 adds perfect screenshot and color picker features, which will automatically resize the current screenshot based on the selected content and select the HEX, RGB, or HSL color code of any pixel on the screen.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft unveils Windows AI Foundry for AI-powered PC apps\nMicrosoft starts testing Windows 11 taskbar icon scaling\nMicrosoft's killing script used to avoid Microsoft Account in Windows 11\nOpenAI plans to combine multiple models into GPT-5\nChatGPT will soon record, transcribe, and summarize your meetings"
    },
    {
        "Title": "Police takes down 300 servers in ransomware supply-chain crackdown",
        "Link": "https://www.bleepingcomputer.com/news/security/police-takes-down-300-servers-in-ransomware-supply-chain-crackdown/",
        "Summary": "In the latest phase of Operation Endgame, an international law enforcement operation, national authorities from seven countries seized 300 servers and 650 domains used to launch ransomware attacks. [...]",
        "Date": "2025-05-23",
        "Content": "In the latest phase of Operation Endgame, an international law enforcement operation, national authorities from seven countries seized 300 servers and 650 domains used to launch ransomware attacks.\n\"From 19 to 22 May, authorities took down some 300 servers worldwide, neutralised 650 domains, and issued international arrest warrants against 20 targets, dealing a direct blow to the ransomware kill chain,\" according to\nthe joint action's official website\n.\n\"In addition, EUR 3.5 million in cryptocurrency was seized during the action week, bringing the total amount seized during Operation Endgame to EUR 21.2 million.\"\nTogether with private sector partners, authorities coordinated by\nEuropol\nand\nEurojust\ntargeted multiple cybercrime operations, including Bumblebee, Lactrodectus, Qakbot, DanaBot, Trickbot, and Warmcookie.\nThese malware strains are frequently provided as a service to other cybercriminals and are used to gain access to the networks of victims targeted in ransomware attacks.\n\"This new phase demonstrates law enforcement's ability to adapt and strike again, even as cybercriminals retool and reorganise,\" Europol Executive Director Catherine De Bolle\nadded\n. \"By disrupting the services criminals rely on to deploy ransomware, we are breaking the kill chain at its source.\"\nDanaBot charges\nOn Thursday, the U.S. Department of Justice also\nunsealed charges\nagainst 16 defendants allegedly part of a Russian cybercrime gang that controlled the DanaBot malware operation.\nThe U.S. authorities named eight of the 16 Russian nationals indicted (Aleksandr Stepanov, Artem Aleksandrovich Kalinkin, Danil Khalitov, Aleksey Efremov, Kamil Sztugulewski, Ibrahim Idowu, Artem Shubin, and Aleksey Khudiakov), while eight others were mentioned by their pseudonyms.\nAccording to a\ncomplaint\n, they used the botnet to deploy additional malware payloads, including ransomware, and have infected over 300,000 computers globally, causing damages exceeding $50 million.\nDanaBot malware has been active since 2018, and it operates on a malware-as-a-service model and allows administrators to lease access to their botnet and support tools for thousands of dollars per month. The malware can also hijack banking sessions, steal data and browsing histories, and provide full remote access to compromised systems, enabling keystroke logging and video recording of user activities.\nDanaBot's admins have also used a second version of this botnet for cyberespionage purposes, targeting military, diplomatic, and government organizations.\n\"This version of the botnet recorded all interactions with the computer and sent stolen data to a different server than the fraud-oriented version of DanaBot,\" the\nJustice Department said\n. \"This variant was allegedly used to target diplomats, law enforcement personnel, and members of the military in North America, and Europe.\"\nImage:\nLumen\n​Previous Operation Endgame actions\nThis week's action follows multiple other Operation Endgame phases, including the\nseizure of over 100 servers\nhosting over 2,000 domains used by multiple malware loader operations, including IcedID, Pikabot, Trickbot, Bumblebee, Smokeloader, and SystemBC.\nSince then, law enforcement agents also\narrested a Conti and LockBit ransomware crypter\nspecialist in June 2024, who helped make the malware undetectable by antivirus software.\nIn April, police also\ntracked down Smokeloader botnet's customers\nand detained at least five individuals using intelligence obtained after seizing a database containing information on cybercriminals who paid for Smokeloader subscriptions.\nThis week, Russian national Rustam Rafailevich Gallyamov, the leader of the Qakbot malware operation that compromised over 700,000 computers and enabled ransomware attacks, was also\nindicted in the United States\n.\nAdditionally,\napproximately 2,300 domains were seized\nearlier this month in a Microsoft-led disruption action targeting the Lumma malware-as-a-service (MaaS) information stealer operation.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nPolice arrest Conti and LockBit ransomware crypter specialist\nEuropol identifies 8 cybercriminals tied to malware loader botnets\nRansomware gangs increasingly use Skitnet post-exploitation malware\nDozens of malicious packages on NPM collect host and network data\nUS indicts leader of Qakbot botnet linked to ransomware attacks"
    },
    {
        "Title": "3 Critical Pillars of Cyber-Resilience",
        "Link": "https://www.darkreading.com/cyber-risk/three-critical-pillars-of-cyber-resilience",
        "Summary": "Encryption, collaboration, and AI can help organizations build up essential protection against ransomware.",
        "Date": "2025-05-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/three-critical-pillars-of-cyber-resilience"
    },
    {
        "Title": "How AI Is Transforming SASE, Zero Trust for Modern Enterprises",
        "Link": "https://www.darkreading.com/cybersecurity-operations/how-ai-transform-sase-zero-trust-networks-security",
        "Summary": "By automating security policies and threat detection while coaching users on data protection, companies will be better able to take control of and protect their data.",
        "Date": "2025-05-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/how-ai-transform-sase-zero-trust-networks-security"
    },
    {
        "Title": "Rethinking Data Privacy in the Age of Generative AI",
        "Link": "https://www.darkreading.com/cyber-risk/rethinking-data-privacy-age-generative-ai",
        "Summary": "The key to navigating this new GenAI landscape is a balanced approach — one that fosters transparency, strengthens regulatory frameworks, and embraces privacy-enhancing technologies.",
        "Date": "2025-05-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/rethinking-data-privacy-age-generative-ai"
    },
    {
        "Title": "3 Severe Bugs Patched in Versa's Concerto Orchestrator",
        "Link": "https://www.darkreading.com/endpoint-security/critical-bugs-patched-versa-sd-wan-platform",
        "Summary": "Three zero-days could have allowed an attacker to completely compromise the Concerto application and the host system running it.",
        "Date": "2025-05-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/critical-bugs-patched-versa-sd-wan-platform"
    },
    {
        "Title": "Companies Look to AI to Tame the Chaos of Event Security, Operations",
        "Link": "https://www.darkreading.com/threat-intelligence/companies-ai-tame-chaos-event-security-operations",
        "Summary": "As the summer event season kicks off, venue managers and security firms aim to make AI part of the solution for keeping control of crowds and protecting against cyber-physical threats.",
        "Date": "2025-05-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/companies-ai-tame-chaos-event-security-operations"
    },
    {
        "Title": "Signal Adds Screenshot-Blocker to Thwart ‘Windows Recall’",
        "Link": "https://www.securityweek.com/signal-adds-screenshot-blocker-to-thwart-windows-recall/",
        "Summary": "<p>Signal said the privacy feature is on by default for every Windows 11 user to block Microsoft from taking screenshots for Windows Recall.</p>\n<p>The post <a href=\"https://www.securityweek.com/signal-adds-screenshot-blocker-to-thwart-windows-recall/\">Signal Adds Screenshot-Blocker to Thwart ‘Windows Recall’ </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/signal-adds-screenshot-blocker-to-thwart-windows-recall/"
    },
    {
        "Title": "In Other News: Volkswagen App Hacked, DR32 Sentenced, New OT Security Solution",
        "Link": "https://www.securityweek.com/in-other-news-volkswagen-app-hacked-dr32-sentenced-new-ot-security-solution/",
        "Summary": "<p>Noteworthy stories that might have slipped under the radar: serious vulnerabilities found in a Volkswagen app, Australian hacker DR32 sentenced in the US, and Immersive launches OT security training solution.</p>\n<p>The post <a href=\"https://www.securityweek.com/in-other-news-volkswagen-app-hacked-dr32-sentenced-new-ot-security-solution/\">In Other News: Volkswagen App Hacked, DR32 Sentenced, New OT Security Solution</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/in-other-news-volkswagen-app-hacked-dr32-sentenced-new-ot-security-solution/"
    },
    {
        "Title": "On Demand: Threat Detection & Incident Response (TDIR) Summit",
        "Link": "https://www.securityweek.com/virtual-event-today-threat-detection-incident-response-tdir-summit/",
        "Summary": "<p>SecurityWeek’s 2025 Threat Detection &#038; Incident Response (TDIR) Summit took place as a virtual summit on May 21st.</p>\n<p>The post <a href=\"https://www.securityweek.com/virtual-event-today-threat-detection-incident-response-tdir-summit/\">On Demand: Threat Detection &amp; Incident Response (TDIR) Summit</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/virtual-event-today-threat-detection-incident-response-tdir-summit/"
    },
    {
        "Title": "Russian Qakbot Gang Leader Indicted in US",
        "Link": "https://www.securityweek.com/russian-qakbot-gang-leader-indicted-in-us/",
        "Summary": "<p>Russian national Rustam Gallyamov was indicted in the US for his leading role in the development and distribution of Qakbot malware.</p>\n<p>The post <a href=\"https://www.securityweek.com/russian-qakbot-gang-leader-indicted-in-us/\">Russian Qakbot Gang Leader Indicted in US</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/russian-qakbot-gang-leader-indicted-in-us/"
    },
    {
        "Title": "Companies Warned of Commvault Vulnerability Exploitation",
        "Link": "https://www.securityweek.com/companies-warned-of-commvault-vulnerability-exploitation/",
        "Summary": "<p>CISA warns companies of a widespread campaign targeting a Commvault vulnerability to hack Azure environments.</p>\n<p>The post <a href=\"https://www.securityweek.com/companies-warned-of-commvault-vulnerability-exploitation/\">Companies Warned of Commvault Vulnerability Exploitation</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/companies-warned-of-commvault-vulnerability-exploitation/"
    },
    {
        "Title": "Cityworks Zero-Day Exploited by Chinese Hackers in US Local Government Attacks",
        "Link": "https://www.securityweek.com/cityworks-zero-day-exploited-by-chinese-hackers-in-us-local-government-attacks/",
        "Summary": "<p>A Chinese threat actor exploited a zero-day vulnerability in Trimble Cityworks to hack local government entities in the US.</p>\n<p>The post <a href=\"https://www.securityweek.com/cityworks-zero-day-exploited-by-chinese-hackers-in-us-local-government-attacks/\">Cityworks Zero-Day Exploited by Chinese Hackers in US Local Government Attacks</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cityworks-zero-day-exploited-by-chinese-hackers-in-us-local-government-attacks/"
    },
    {
        "Title": "DanaBot Botnet Disrupted, 16 Suspects Charged",
        "Link": "https://www.securityweek.com/danabot-botnet-disrupted-by-law-enforcement-16-suspects-charged/",
        "Summary": "<p>The DanaBot botnet ensnared over 300,000 devices and caused more than $50 million in damages before being disrupted.</p>\n<p>The post <a href=\"https://www.securityweek.com/danabot-botnet-disrupted-by-law-enforcement-16-suspects-charged/\">DanaBot Botnet Disrupted, 16 Suspects Charged</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/danabot-botnet-disrupted-by-law-enforcement-16-suspects-charged/"
    },
    {
        "Title": "Chinese Spies Exploit Ivanti Vulnerabilities Against Critical Sectors",
        "Link": "https://www.securityweek.com/chinese-spies-exploit-ivanti-vulnerabilities-against-critical-sectors/",
        "Summary": "<p>A Chinese espionage group has been chaining two recent Ivanti EPMM vulnerabilities in attacks against organizations in multiple critical sectors.</p>\n<p>The post <a href=\"https://www.securityweek.com/chinese-spies-exploit-ivanti-vulnerabilities-against-critical-sectors/\">Chinese Spies Exploit Ivanti Vulnerabilities Against Critical Sectors</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-23",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chinese-spies-exploit-ivanti-vulnerabilities-against-critical-sectors/"
    },
    {
        "Title": "Evaly E-commerce Platform Allegedly Breached",
        "Link": "https://dailydarkweb.net/evaly-e-commerce-platform-allegedly-breached/",
        "Summary": "<p>Bangladeshi e-commerce platform Evaly is allegedly the target of a significant data breach, with claims circulating that sensitive customer and merchant information has been compromised. The alleged breach, reportedly occurring today, May 23, 2025, impacts approximately 783,611 users. Evaly&#8217;s website currently displays a message stating, &#8220;HACKED, I HAVE ALL CUSTOMER DATA. EVALY STAFF PLEASE CONTACT [&#8230;]</p>\n<p>The post <a href=\"https://dailydarkweb.net/evaly-e-commerce-platform-allegedly-breached/\">Evaly E-commerce Platform Allegedly Breached</a> appeared first on <a href=\"https://dailydarkweb.net\">Daily Dark Web</a>.</p>",
        "Date": "2025-05-23",
        "Content": "Bangladeshi e-commerce platform Evaly is allegedly the target of a significant data breach, with claims circulating that sensitive customer and merchant information has been compromised. The alleged breach, reportedly occurring today, May 23, 2025, impacts approximately 783,611 users.\nEvaly’s website currently displays a message stating, “HACKED, I HAVE ALL CUSTOMER DATA. EVALY STAFF PLEASE CONTACT OR ELSE I WILL RELEASE THIS DATA TO THE PUBLIC.”\nAccording to posts circulating on the clear web and dark web forums, the compromised data includes full names, email addresses, phone numbers, and details regarding all orders and merchants. The alleged perpetrator is offering the stolen data for $500, with samples purportedly showing customer order information, including shipping addresses and contact details.\nCustomers of Evaly are advised to remain vigilant for any suspicious activity, such as phishing attempts or unauthorized use of their personal information.\nTags:\nalleged hack\nBangladesh\ncustomer-data\nCyberSecurity\ndata-breach\ne-commerce\nEvaly"
    },
    {
        "Title": "Russian Fashion Retailer Prizmoda Allegedly Hit by Massive Data Leak",
        "Link": "https://dailydarkweb.net/russian-fashion-retailer-prizmoda-allegedly-hit-by-massive-data-leak/",
        "Summary": "<p>A significant data leak, allegedly impacting Russian fashion brand Prizmoda.ru, has come to light in May 2025. The breach, attributed to an unauthorized party, reportedly exposed a staggering 22.1GB of sensitive information from the company. Prizmoda.ru, a fashion brand based in Novosibirsk, specializes in clothing for women, men, and children, operating through both retail (Priz) [&#8230;]</p>\n<p>The post <a href=\"https://dailydarkweb.net/russian-fashion-retailer-prizmoda-allegedly-hit-by-massive-data-leak/\">Russian Fashion Retailer Prizmoda Allegedly Hit by Massive Data Leak</a> appeared first on <a href=\"https://dailydarkweb.net\">Daily Dark Web</a>.</p>",
        "Date": "2025-05-23",
        "Content": "A significant data leak, allegedly impacting Russian fashion brand Prizmoda.ru, has come to light in May 2025. The breach, attributed to an unauthorized party, reportedly exposed a staggering 22.1GB of sensitive information from the company.\nPrizmoda.ru, a fashion brand based in Novosibirsk, specializes in clothing for women, men, and children, operating through both retail (Priz) and wholesale (Stilla) divisions, via an online platform and physical stores.\nThe compromised data, contained within various file types including XLSX, CSV, Word, PDF, MP4, MP3, and JPEG, is said to include a broad spectrum of internal and customer-related details. The affected entities include employees, tasks, call logs, company information, client contacts, deals, and sales leads.\nSpecifically, the leaked data allegedly contains employee names, emails, phone numbers, roles, hire dates, skills, and social media links. Furthermore, detailed task and project information, call logs, company banking details, client contact information, sales transaction records, and lead data are also purported to be part of the breach. The volume of affected records is substantial, with over 160 employee entries, more than 11,500 task records, nearly 50,000 call logs, around 4,000 company entries, over 660 contacts, 12 deal records, and over 36,000 lead entries.\nSamples and proof of possession of the compromised data are reportedly available.\nTags:\ncorporate data\nCyberSecurity\ndata-breach\ndata-leak\nFashion Industry\nPersonal Data\nPriz\nPrizmoda.ru\nRussia"
    },
    {
        "Title": "Stormous Ransomware Group Allegedly Leaks French Government Data",
        "Link": "https://dailydarkweb.net/stormous-ransomware-group-allegedly-leaks-french-government-data/",
        "Summary": "<p>The Stormous ransomware group has allegedly claimed responsibility for a significant data leak impacting several high-profile French government organizations. The group claims to have obtained a comprehensive set of email addresses and password hashes from entities including Carsat, Finance, Retraite, and IGAS, as well as domains such as ac-lyon.fr, cnaf.fr, and cnsa.fr. The alleged breach, [&#8230;]</p>\n<p>The post <a href=\"https://dailydarkweb.net/stormous-ransomware-group-allegedly-leaks-french-government-data/\">Stormous Ransomware Group Allegedly Leaks French Government Data</a> appeared first on <a href=\"https://dailydarkweb.net\">Daily Dark Web</a>.</p>",
        "Date": "2025-05-23",
        "Content": "The Stormous ransomware group has allegedly claimed responsibility for a significant data leak impacting several high-profile French government organizations. The group claims to have obtained a comprehensive set of email addresses and password hashes from entities including Carsat, Finance, Retraite, and IGAS, as well as domains such as ac-lyon.fr, cnaf.fr, and cnsa.fr.\nThe alleged breach, announced by the ransomware group, suggests a wide-ranging compromise of sensitive information belonging to various administrative bodies within the French government.\nFurther investigation is underway to verify the authenticity and full extent of the claimed data leak.\nTags:\ncyberattack\nCyberSecurity\ndata-breach\nFrance\nFrench government\nleak\nransomware\nStormous"
    }
]