[
    {
        "Title": "Fake Security Plugin on WordPress Enables Remote Admin Access for Attackers",
        "Link": "https://thehackernews.com/2025/05/fake-security-plugin-on-wordpress.html",
        "Summary": "Cybersecurity researchers have shed light on a new campaign targeting WordPress sites that disguises the malware as a security plugin.\nThe plugin, which goes by the name \"WP-antymalwary-bot.php,\" comes with a variety of features to maintain access, hide itself from the admin dashboard, and execute remote code.\n\"Pinging functionality that can report back to a command-and-control (C&amp;C) server",
        "Date": "2025-05-01",
        "Content": "Cybersecurity researchers have shed light on a new campaign targeting WordPress sites that disguises the malware as a security plugin.\nThe plugin, which goes by the name \"WP-antymalwary-bot.php,\" comes with a variety of features to maintain access, hide itself from the admin dashboard, and execute remote code.\n\"Pinging functionality that can report back to a command-and-control (C&C) server is also included, as is code that helps spread malware into other directories and inject malicious JavaScript responsible for serving ads,\" Wordfence's Marco Wotschka\nsaid\nin a report.\nFirst discovered during a site cleanup effort in late January 2025, the malware has since been detected in the wild with new variants. Some of the other names used for the plugin are listed below -\naddons.php\nwpconsole.php\nwp-performance-booster.php\nscr.php\nOnce installed and activated, it provides threat actors administrator access to the dashboard and makes use of the REST API to facilitate remote code execution by injecting malicious PHP code into the site theme's header file or clearing the caches of popular caching plugins.\nA new iteration of the malware includes notable changes to the manner code injections are handled, fetching JavaScript code hosted on another compromised domain to serve ads or spam.\nThe plugin is also complemented by a malicious wp-cron.php file, which recreates and reactivates the malware automatically upon the next site visit should it be removed from the plugins directory.\nIt's currently not clear how the sites are breached to deliver the malware or who is behind the campaign. However, the presence of Russian language comments and messages likely indicates that the threat actors are Russian-speaking.\nThe disclosure comes as Sucuri\ndetailed\na web skimmer campaign that uses a fake fonts domain named \"italicfonts[.]org\" to display a fake payment form on checkout pages, steal entered information, and exfiltrate the data to the attacker's server.\nAnother \"advanced, multi-stage carding attack\" examined by the website security company involves targeting Magento e-commerce portals with JavaScript malware designed to harvest a wide range of sensitive information.\n\"This malware leveraged a fake GIF image file, local browser sessionStorage data, and tampered with the website traffic using a malicious reverse proxy server to facilitate the theft of credit card data, login details, cookies, and other sensitive data from the compromised website,\" security researcher Ben Martin\nsaid\n.\nThe GIF file, in reality, is a PHP script that acts as a reverse proxy by capturing incoming requests and using it to collect the necessary information when a site visitor lands on the checkout page.\nAdversaries have also been observed injecting Google AdSense code into at least 17 WordPress sites in various places with the goal of delivering unwanted ads and generating revenue on either a per-click or per-impression basis.\n\"They're trying to use your site's resources to continue serving ads, and worse, they could be stealing your ad revenue if you're using AdSense yourself,\" security researcher Puja Srivastava\nsaid\n. \"By injecting their own Google AdSense code, they get paid instead of you.\"\nThat's not all. Deceptive CAPTCHA verifications served on compromised websites have been found to trick users into downloading and executing Node.js-based backdoors that gather system information, grant remote access, and deploy a Node.js remote access trojan (RAT), which is designed to tunnel malicious traffic through SOCKS5 proxies.\nThe activity has been attributed by Trustwave SpiderLabs to a traffic distribution system (TDS) called\nKongtuke\n(aka 404 TDS, Chaya_002, LandUpdate808, and TAG-124).\n\"The JS script which, was dropped in post-infection, is designed as a multi-functional backdoor capable of detailed system reconnaissance, executing remote commands, tunneling network traffic (SOCKS5 proxy), and maintaining covert, persistent access,\" security researcher Reegun Jayapaul\nsaid\n.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Why top SOC teams are shifting to Network Detection and Response",
        "Link": "https://thehackernews.com/2025/05/why-top-soc-teams-are-shifting-to.html",
        "Summary": "Security Operations Center (SOC) teams are facing a fundamentally new challenge &mdash; traditional cybersecurity tools are failing to detect advanced adversaries who have become experts at evading endpoint-based defenses and signature-based detection systems. The reality of these &ldquo;invisible intruders&rdquo; is driving a significant need for a multi-layered approach to detecting threats,",
        "Date": "2025-05-01",
        "Content": "Security Operations Center (SOC) teams are facing a fundamentally new challenge — traditional cybersecurity tools are failing to detect advanced adversaries who have become experts at evading endpoint-based defenses and signature-based detection systems. The reality of these “invisible intruders” is driving a significant need for a multi-layered approach to detecting threats, including Network Detection and Response (NDR) solutions.\nThe invisible intruder problem\nImagine your network has been compromised — not today or yesterday, but months ago. Despite your significant investments in security tools running 24/7, an advanced adversary has been quietly moving through your systems, carefully avoiding detection. They've stolen credentials, established backdoors, and exfiltrated sensitive data, all while your dashboards showed nothing but green.\nThis scenario is not hypothetical. The average dwell time for attackers — the period between initial compromise and detection — still hovers around 21 days in many industries, with some breaches remaining undiscovered for years.\n\"We hear this story repeatedly from security teams,\" says\nVince Stoffer, field CTO at Corelight\n, the fastest growing provider of NDR solutions. \"They install an NDR solution and immediately discover basic network visibility issues or suspicious activity that's been undiscovered on their networks for months — sometimes years. Adversaries have been conducting reconnaissance, establishing persistence, making lateral moves, and exfiltrating data, all below the detection capabilities of their existing security stack.\"\nThe problem lies in how modern attackers operate. Today's sophisticated threat actors don't rely on malware with known signatures or behaviors that trigger endpoint alerts. Instead, they:\nUse living-off-the-land techniques, leveraging legitimate system tools like PowerShell\nMove laterally through networks using stolen but valid credentials\nCommunicate through encrypted channels\nCarefully time their activities to blend with normal business operations\nExploit trusted relationships between systems\nThese techniques specifically target blind spots in traditional security approaches focused on known indicators of compromise. Signature-based detection and endpoint monitoring simply weren't designed to catch adversaries who operate primarily within legitimate processes and authenticated sessions.\nHow can NDR address these invisible intruders and help security teams regain control of their systems?\nWhat is Network Detection and Response?\nNDR represents an evolution in network security monitoring that goes beyond traditional intrusion detection systems and complements the broader security stack. At their core,\nNDR solutions\ncapture and analyze raw network traffic and metadata to detect malicious activities, security anomalies, and protocol violations that other security tools might miss.\nUnlike legacy network security tools that relied primarily on signatures of known threats, modern NDR incorporates a multi-layered detection strategy:\nBehavioral analytics to identify unusual patterns in network traffic\nMachine learning models that establish baselines and flag deviations\nProtocol analysis that understands the \"conversations\" happening between systems\nThreat intelligence integration to identify known malicious indicators\nAdvanced analytical capabilities for retrospective threat hunting\nThe \"response\" element is equally important. NDR platforms provide detailed forensic data for investigations and often include capabilities for automated or guided response actions to contain threats quickly.\nWhy SOC teams are embracing NDR\nThe shift toward NDR stems from several fundamental changes in the security landscape that have transformed how organizations approach threat detection.\n1. Rapidly expanding and diversifying attack surfaces\nModern enterprise environments have grown exponentially more complex with cloud adoption, containerization, IoT proliferation, and hybrid work models. This expansion has created critical visibility challenges, particularly for lateral movement across environments (east-west traffic) that traditional perimeter-focused tools can miss. NDR provides comprehensive and normalized visibility across these diverse environments, unifying monitoring of on-premises, cloud, and multi-cloud infrastructure under a single analytical umbrella.\n2. Privacy-centric technology evolution\nThe widespread adoption of encryption has fundamentally changed security monitoring. With more than 90% of web traffic now encrypted, traditional inspection approaches have become ineffective. Advanced NDR solutions have evolved to analyze encrypted traffic patterns without decryption, maintaining security visibility while respecting privacy through metadata analysis, JA3/JA3S fingerprinting, and other techniques that don't require breaking encryption.\n3. Unmanageable device proliferation\nThe explosion of connected devices — from IoT sensors to operational technology — has created environments where traditional agent-based security is impractical or impossible. NDR's agentless approach provides visibility into devices where endpoint solutions cannot be deployed, addressing the security blind spots that increasingly dominate modern networks as device types multiply faster than security teams can manage them.\n4. Complementary detection approach\nSOC teams have recognized that different security technologies excel at detecting different types of threats. While EDR excels at detecting process-level activities on managed endpoints, NDR monitors network traffic for an objective record of communications that is difficult for attackers to manipulate or erase. While logs can be altered and endpoint telemetry can be disabled, network communications must occur for attackers to accomplish their objectives. This \"ground truth\" quality makes network data particularly valuable for threat detection and forensic investigations. This complementary approach closes critical visibility gaps that attackers exploit.\n5. Cybersecurity workforce crisis\nThe global shortage of security professionals (estimated at over 3.5 million unfilled positions) has pushed organizations to adopt technologies that maximize analyst effectiveness. NDR helps address this talent gap by providing high-fidelity detections with rich context that reduce alert fatigue and accelerate investigation processes. By consolidating related activities and providing comprehensive views of potential attack sequences, NDR reduces the cognitive load on already-stretched security teams, allowing them to handle more incidents with existing staff.\n6. Evolving regulatory landscape\nOrganizations face increasingly stringent compliance requirements with shorter reporting timeframes. Regulations like GDPR, CCPA, NIS2, and industry-specific frameworks mandate rapid incident notification (often within 72 hours or less) and require detailed forensic evidence. NDR solutions provide the comprehensive audit trails and forensic data necessary to meet these requirements, enabling organizations to demonstrate due diligence and provide required documentation for regulatory reporting. This data is also critical in helping the security team confidently state that the threat has been fully contained and mitigated and to understand the true scope and scale of what the attackers touched when they were inside the network.\nThe future of NDR\nAs more organizations recognize the limitations of traditional security approaches, NDR adoption continues to accelerate. While NDR innovation is moving quickly to stay ahead of attackers, critical capabilities for any NDR solution must include:\nCloud-native solutions that provide visibility across multi-cloud environments\nIntegration with SOAR (Security Orchestration, Automation and Response) platforms for streamlined workflows\nAdvanced analytical capabilities for proactive threat hunting\nOpen architectures that facilitate integration with broader security ecosystems\nFor SOC teams dealing with increasingly complex threats, NDR has become not just another security tool but a foundational capability that provides the visibility needed to detect and respond to today's sophisticated attackers. While no single technology can solve all security challenges, NDR addresses critical blind spots that have been exploited repeatedly in major breaches.\nAs attack surfaces continue to expand and adversaries grow more creative in how they infiltrate a secure environment, the ability to see and understand network communications has become essential for organizations serious about security. The network, after all, doesn't lie — and that truth has become invaluable in an era where deception is an attacker's primary strategy.\nCorelight provides elite defenders of all shapes and sizes with the tools and resources they need to ensure comprehensive network visibility and advanced NDR capabilities, based on the open-source Zeek network monitoring platform. Visit\nCorelight.com\nfor more information.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Claude AI Exploited to Operate 100+ Fake Political Personas in Global Influence Campaign",
        "Link": "https://thehackernews.com/2025/05/claude-ai-exploited-to-operate-100-fake.html",
        "Summary": "Artificial intelligence (AI) company Anthropic has revealed that unknown threat actors leveraged its Claude chatbot for an \"influence-as-a-service\" operation to engage with authentic accounts across Facebook and X.\nThe sophisticated activity, branded as financially-motivated, is said to have used its AI tool to orchestrate 100 distinct persons on the two social media platforms, creating a",
        "Date": "2025-05-01",
        "Content": "Artificial intelligence (AI) company Anthropic has\nrevealed\nthat unknown threat actors leveraged its Claude chatbot for an \"influence-as-a-service\" operation to engage with authentic accounts across Facebook and X.\nThe sophisticated activity, branded as financially-motivated, is said to have used its AI tool to orchestrate 100 distinct persons on the two social media platforms, creating a network of \"politically-aligned accounts\" that engaged with \"10s of thousands\" of authentic accounts.\nThe now-disrupted operation, Anthropic researchers said, prioritized persistence and longevity over vitality and sought to amplify moderate political perspectives that supported or undermined European, Iranian, the United Arab Emirates (U.A.E.), and Kenyan interests.\nThese included promoting the U.A.E. as a superior business environment while being critical of European regulatory frameworks, focusing on energy security narratives for European audiences, and cultural identity narratives for Iranian audiences.\nThe efforts also pushed narratives supporting Albanian figures and criticizing opposition figures in an unspecified European country, as well as advocated development initiatives and political figures in Kenya. These influence operations are consistent with state-affiliated campaigns, although exactly who were behind them remains unknown, it added.\n\"What is especially novel is that this operation used Claude not just for content generation, but also to decide when social media bot accounts would comment, like, or re-share posts from authentic social media users,\" the company noted.\n\"Claude was used as an orchestrator deciding what actions social media bot accounts should take based on politically motivated personas.\"\nThe use of Claude as a tactical engagement decision-maker notwithstanding, the chatbot was utilized to generate appropriate politically-aligned responses in the persona's voice and native language, and create prompts for two popular image-generation tools.\nThe operation is believed to be the work of a commercial service that caters to different clients across various countries. At least four distinct campaigns have been identified using this programmatic framework.\n\"The operation implemented a highly structured JSON-based approach to persona management, allowing it to maintain continuity across platforms and establish consistent engagement patterns mimicking authentic human behavior,\" researchers Ken Lebedev, Alex Moix, and Jacob Klein said.\n\"By using this programmatic framework, operators could efficiently standardize and scale their efforts and enable systematic tracking and updating of persona attributes, engagement history, and narrative themes across multiple accounts simultaneously.\"\nAnother interesting aspect of the campaign was that it \"strategically\" instructed the automated accounts to respond with humor and sarcasm to accusations from other accounts that they may be bots.\nAnthropic said the operation highlights the need for new frameworks to evaluate influence operations revolving around relationship building and community integration. It also warned that similar malicious activities could become common in the years to come as AI lowers the barrier further to conduct influence campaigns.\nElsewhere, the company noted that it banned a sophisticated threat actor using its models to scrape leaked passwords and usernames associated with security cameras and devise methods to brute-force internet-facing targets using the stolen credentials.\nThe threat actor further employed Claude to process posts from information stealer logs posted on Telegram, create scripts to scrape target URLs from websites, and improve their own systems to better search functionality.\nTwo other cases of misuse spotted by Anthropic in March 2025 are listed below -\nA recruitment fraud campaign that leveraged Claude to enhance the content of scams targeting job seekers in Eastern European countries\nA novice actor that leveraged Claude to enhance their technical capabilities to develop advanced malware beyond their skill level with capabilities to scan the dark web and generate undetectable malicious payloads that can evade security control and maintain long-term persistent access to compromised systems\n\"This case illustrates how AI can potentially flatten the learning curve for malicious actors, allowing individuals with limited technical knowledge to develop sophisticated tools and potentially accelerate their progression from low-level activities to more serious cybercriminal endeavors,\" Anthropic said.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "New Research Reveals: 95% of AppSec Fixes Don’t Reduce Risk",
        "Link": "https://thehackernews.com/2025/05/new-research-reveals-95-of-appsec-fixes.html",
        "Summary": "For over a decade, application security teams have faced a brutal irony: the more advanced the detection tools became, the less useful their results proved to be. As alerts from static analysis tools, scanners, and CVE databases surged, the promise of better security grew more distant. In its place, a new reality took hold—one defined by alert fatigue and overwhelmed teams.\nAccording to OX",
        "Date": "2025-05-01",
        "Content": "For over a decade, application security teams have faced a brutal irony: the more advanced the detection tools became, the less useful their results proved to be. As alerts from static analysis tools, scanners, and CVE databases surged, the promise of better security grew more distant. In its place, a new reality took hold—one defined by alert fatigue and overwhelmed teams.\nAccording to OX Security's\n2025 Application Security Benchmark Report\n, a staggering\n95–98% of AppSec alerts do not require action\n- and may, in fact, be harming organizations more than helping.\nOur research, spanning over 101 million security findings across 178 organizations, shines a spotlight on a fundamental inefficiency in modern AppSec operations. Of nearly 570,000 average alerts per organization, just 202 represented true, critical issues.\nIt's a startling conclusion that's hard to ignore: security teams are chasing shadows, wasting time, burning through budgets, and straining relations with developers over vulnerabilities that pose no real threat. The worst part of it - is that security gets in the way of actual innovation. As Chris Hughes puts it in\nResilient Cyber\n: \"We do all this while masquerading as business enablers, actively burying our peers in toil, delaying development velocity, and ultimately impeding business outcomes.\nHow We Got Here: Mountains of Issues, Zero Context\nBack in 2015, the application security challenge was simpler. That year, just 6,494 CVEs were publicly disclosed. Detection was king. Tools were measured by how many issues they found - not whether they mattered.\nFast forward to 2025: Applications went cloud-native, development cycles accelerated, and attack surfaces ballooned. In just the past year, over 40,000 new CVEs were published, bringing the global total to over 200,000. Yet, despite these major changes, many AppSec tools have failed to evolve: they've doubled down on detection, flooding dashboards with unfiltered, context-free alerts.\nOX's benchmark confirms what practitioners have long suspected:\n32%\nof reported issues have a low probability of exploitation\n25%\nhave no known public exploit\n25%\nstem from unused or development-only dependencies\nThis flood of irrelevant findings doesn't just slow security down - it actively impairs it.\nWhile most alerts can be disregarded, it is essential to accurately identify the 2-5% that require immediate attention.\nThe report\nshows these rare alerts usually involve KEV issues, secrets management problems, and in some cases, posture management issues.\nThe Need for A Holistic Prioritization Approach\nTo combat this doom-spiral, organizations must adopt a more sophisticated approach to application security, based on evidence-driven prioritization. This requires a shift from generic alert handling to a comprehensive model that covers code from design stages to runtime, and includes multiple elements:\nReachability\n: Is the vulnerable code used, and is it reachable?\nExploitability\n: Are the conditions for exploitation present in this environment?\nBusiness Impact\n: Would a breach here cause real damage?\nCloud-to-Code Mapping\n: Where in the SDLC did this issue originate?\nBy implementing such a framework, organizations can effectively filter out the noise and focus their efforts on the small percentage of alerts that pose a genuine threat. This improves security effectiveness, frees up valuable resources, and enables more confident development practices.\nOX Security\nis addressing this challenge with Code Projection, an evidence-based security technology that maps cloud and runtime elements back to code origin, enabling contextual understanding and dynamic risk prioritization.\nReal-World Impact\nThe data tells a powerful story: By using evidence-based prioritization, the alarming average of\n569,354 total alerts\nper organization can be reduced to\n11,836\n, of which only\n202\nrequire immediate action.\nIndustry benchmarks reveal several key insights:\nConsistent Noise Thresholds\n: Baseline noise levels remain remarkably similar across different environments, whether enterprise or commercial, regardless of industry.\nEnterprise Security Complexity\n: Enterprise environments face significantly greater challenges due to their broader tool ecosystem, larger application footprint, higher volume of security events, more frequent incidents, and elevated overall risk exposure.\nFinancial Sector Vulnerability\n: Financial institutions experience distinctively higher alert volumes. Their processing of financial transactions and sensitive data makes them high-value targets. As the Verizon Data Breach Investigations Report indicates, 95% of attackers are motivated primarily by financial gain rather than espionage or other reasons. Financial institutions' proximity to monetary assets creates direct profit opportunities for attackers.\nThe findings have far-reaching implications. If less than 95% of application security fixes are critical to the organization, then all organizations invest enormous resources in triage, programming, and cybersecurity hours in vain. This waste extends to payments for bug-bounty programs, where white-hat hackers find vulnerabilities to fix, as well as the costs of complicated fixes for vulnerabilities that were not discovered early and reached production. The final significant cost is the tension created within organizations between development teams and security teams, who demand fixes for vulnerabilities that aren't relevant.\nDetection failed, Prioritization is the Way Forward\nAs organizations face a projected 50,000 new vulnerabilities in 2025 alone, the stakes for effective security triage have never been higher. The old model of \"detect everything, fix later\" is not just outdated - it's dangerous.\nOX Security's Report makes a compelling case: The future of application security lies not in addressing every possible vulnerability but in intelligently identifying and focusing on the issues that pose real risk.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "DarkWatchman, Sheriff Malware Hit Russia and Ukraine with Stealth and Nation-Grade Tactics",
        "Link": "https://thehackernews.com/2025/05/darkwatchman-sheriff-malware-hit-russia.html",
        "Summary": "Russian companies have been targeted as part of a large-scale phishing campaign that's designed to deliver a known malware called DarkWatchman.\nTargets of the attacks include entities in the media, tourism, finance and insurance, manufacturing, retail, energy, telecom, transport, and biotechnology sectors, Russian cybersecurity company F6 said.\nThe activity is assessed to be the work of a",
        "Date": "2025-05-01",
        "Content": "Russian companies have been targeted as part of a large-scale phishing campaign that's designed to deliver a known malware called\nDarkWatchman\n.\nTargets of the attacks include entities in the media, tourism, finance and insurance, manufacturing, retail, energy, telecom, transport, and biotechnology sectors, Russian cybersecurity company F6\nsaid\n.\nThe activity is assessed to be the work of a financially motivated group called Hive0117, which has been attributed by IBM X-Force to\nattacks\naimed at users in Lithuania, Estonia, and Russia spanning telecom, electronic, and industrial sectors.\nThen in September 2023, the DarkWatchman malware was once again\nused\nin a phishing campaign targeting energy, finance, transport, and software security industries based in Russia, Kazakhstan, Latvia, and Estonia.\nRussian banks, retailers and marketplaces, telecom operators, agro-industrial enterprises, fuel and energy companies, logistics businesses, and IT firms were\nsingled out\nagain in November 2023 with DarkWatchman using courier delivery-themed lures.\nA JavaScript-based remote access trojan, DarkWatchman is capable of keylogging, collecting system information, and deploying secondary payloads. It was\nfirst documented\nin December 2021.\n\"The fileless nature of the DarkWatchman malware, and its use of JavaScript and a keylogger written in C#, as well as the ability to remove traces of its existence on compromised systems when instructed, are evidence of somewhat sophisticated capabilities,\" IBM noted in 2023.\nThe latest set of attacks involves sending phishing emails containing password-protected malicious archives that, once opened, deliver a variant of DarkWatchman with improved capabilities to evade detection.\nUkraine Targeted by New Sheriff Backdoor\nThe disclosure comes as IBM X-Force said an unspecified entity within Ukraine's defense sector was targeted in the first half of 2024 with a previously undocumented Windows backdoor called\nSheriff\n.\n\"The threat actor used a popular news portal in Ukraine, ukr.net, to host the Sheriff backdoor,\" security researcher Golo Mühr\nsaid\nin a report published in late March 2025. \"The modular backdoor can execute actor-directed commands, collect screenshots, and covertly exfiltrate victim data using the Dropbox cloud storage API.\"\n\"The malware focuses on exfiltrating data and taking screenshots while maintaining a low profile designed for prolonged compromises.\"\nIt's suspected that the website may have been breached to stage the malware in early March 2024. Sheriff is equipped to download and manage multiple components, including a screenshot module, with commands and configuration values received as ZIP file comments.\n\"A threat actor's access to Ukraine's largest news portal would position them to conduct a range of high-impact attacks and operate with enhanced obfuscation,\" Mühr said. \"In this specific incident, the threat actor may have abused the trusted domain to stage malware without raising suspicion.\"\nThe backdoor also comes fitted with a \"suicide\" function that, when invoked remotely by the operator, ceases all activity and deletes the directory containing the malware and the folder on Dropbox used for command-and-control (C2) communications.\nIBM pointed out that certain aspects of the malware overlap with that of Turla's\nKazuar\nand\nCrutch\n, as well as\nOperation Groundbait's Prikormka and Bad Magic's CloudWizard\n.\n\"Both CloudWizard and Sheriff contain a function 'GetSettings'/'get_Settings' to retrieve each module's configuration,\" the company said. \"CloudWizard, Prikormka, and Sheriff share the same screenshot taking intervals of 15 minutes. CloudWizard and Prikormka's file listing modules are called 'tree,' which is the name Sheriff uses for exfiltration of a list of files.\"\nThe discovery of the backdoor follows a report from Ukraine's State Service for Special Communications and Information Protection (SSSCIP), warning of a 48% increase in the number of incidents in the second half of 2024 (2,576), compared to the previous six-month period (1,739).\nIn total, 4,315 cyber incidents were registered in 2024, up from 1,350 in 2021, 2,194 in 2022, and 2,543 in 2023. The number of critical and high-severity incidents, on the other hand, dropped significantly to 59, a decline from 1,048 in 2022 and 367 in 2023.\n\"Russian hackers are actively implementing automation, employing supply chain attacks for infiltration through software vendors, and combining espionage and sabotage techniques,\" SSSCIP\nsaid\n. \"The primary focus of attacks is the collection of intelligence that could influence the operational situation at the front. In particular, the adversary is targeting situational awareness systems and specialized defense enterprises.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Commvault Confirms Hackers Exploited CVE-2025-3928 as Zero-Day in Azure Breach",
        "Link": "https://thehackernews.com/2025/05/commvault-confirms-hackers-exploited.html",
        "Summary": "Enterprise data backup platform Commvault has revealed that an unknown nation-state threat actor breached its Microsoft Azure environment by exploiting CVE-2025-3928 but emphasized there is no evidence of unauthorized data access.\n\"This activity has affected a small number of customers we have in common with Microsoft, and we are working with those customers to provide assistance,\" the company",
        "Date": "2025-05-01",
        "Content": "Enterprise data backup platform Commvault has revealed that an unknown nation-state threat actor breached its Microsoft Azure environment by exploiting CVE-2025-3928 but emphasized there is no evidence of unauthorized data access.\n\"This activity has affected a small number of customers we have in common with Microsoft, and we are working with those customers to provide assistance,\" the company\nsaid\nin an update.\n\"Importantly, there has been no unauthorized access to customer backup data that Commvault stores and protects, and no material impact on our business operations or our ability to deliver products and services.\"\nIn an advisory\nissued\non March 7, 2025, Commvault said it was notified by Microsoft on February 20 about unauthorized activity within its Azure environment and that the threat actor exploited CVE-2025-3928 as a zero-day. It also said it rotated affected credentials and enhanced security measures.\nThe disclosure comes as the U.S. Cybersecurity and Infrastructure Security Agency (CISA)\nadded\nCVE-2025-3928 to its Known Exploited Vulnerabilities (KEV) catalog, requiring Federal Civilian Executive Branch (FCEB) agencies to apply the necessary patches for Commvault Web Server by May 19, 2025.\nTo mitigate the risk posed by such attacks, customers are advised to apply a Conditional Access policy to all Microsoft 365, Dynamics 365, and Azure AD single-tenant app registrations, and rotate and sync client secrets between Azure portal and Commvault every 90 days.\nThe company is also urging users to monitor sign-in activity to detect any access attempts originating from IP addresses outside of the allowlisted ranges. The following IP addresses have been associated with malicious activity -\n108.69.148.100\n128.92.80.210\n184.153.42.129\n108.6.189.53, and\n159.242.42.20\n\"These IP addresses should be explicitly blocked within your Conditional Access policies and monitored in your Azure sign-in logs,\" Commvault\nsaid\n. \"If any access attempts from these IPs are detected, please report the incident immediately to Commvault Support for further analysis and action.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "SonicWall Confirms Active Exploitation of Flaws Affecting Multiple Appliance Models",
        "Link": "https://thehackernews.com/2025/05/sonicwall-confirms-active-exploitation.html",
        "Summary": "SonicWall has revealed that two now-patched security flaws impacting its SMA100 Secure Mobile Access (SMA) appliances have been exploited in the wild.\nThe vulnerabilities in question are listed below -\n\nCVE-2023-44221 (CVSS score: 7.2) - Improper neutralization of special elements in the SMA100 SSL-VPN management interface allows a remote authenticated attacker with administrative privilege to",
        "Date": "2025-05-01",
        "Content": "SonicWall has revealed that two now-patched security flaws impacting its SMA100 Secure Mobile Access (SMA) appliances have been exploited in the wild.\nThe vulnerabilities in question are listed below -\nCVE-2023-44221\n(CVSS score: 7.2) - Improper neutralization of special elements in the SMA100 SSL-VPN management interface allows a remote authenticated attacker with administrative privilege to inject arbitrary commands as a 'nobody' user, potentially leading to OS Command Injection Vulnerability\nCVE-2024-38475\n(CVSS score: 9.8) - Improper escaping of output in mod_rewrite in Apache HTTP Server 2.4.59 and earlier allows an attacker to map URLs to file system locations that are permitted to be served by the server\nBoth the flaws affect SMA 100 Series devices, including SMA 200, 210, 400, 410, 500v, and were addressed in the following versions -\nCVE-2023-44221 - 10.2.1.10-62sv and higher versions (Fixed on December 4, 2023)\nCVE-2024-38475 - 10.2.1.14-75sv and higher versions (Fixed on December 4, 2024)\nIn an update to the advisories on April 29, 2025, SonicWall said the vulnerabilities are potentially being exploited in the wild, urging customers to review their SMA devices to ensure that there are no unauthorized logins.\n\"During further analysis, SonicWall and trusted security partners identified an additional exploitation technique using CVE-2024-38475, through which unauthorized access to certain files could enable session hijacking,\" the company said.\nThere are currently no details on how the vulnerabilities are being exploited, who may have been targeted, and the scope and scale of these attacks.\nThe disclosures come weeks after the U.S. Cybersecurity and Infrastructure Security Agency (CISA)\nadded\nanother security flaw impacting SonicWall SMA 100 Series gateways (CVE-2021-20035, CVSS score: 7.2) to its Known Exploited Vulnerabilities (KEV) catalog, based on evidence of active exploitation.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Hacker 'NullBulge' pleads guilty to stealing Disney's Slack data",
        "Link": "https://www.bleepingcomputer.com/news/security/hacker-nullbulge-pleads-guilty-to-stealing-disneys-slack-data/",
        "Summary": "A California man who used the alias \"NullBulge\" has pleaded guilty to illegally accessing Disney's internal Slack channels and stealing over 1.1 terabytes of internal company data. [...]",
        "Date": "2025-05-01",
        "Content": "A California man who used the alias \"NullBulge\" has pleaded guilty to illegally accessing Disney's internal Slack channels and stealing over 1.1 terabytes of internal company data.\nAccording to the U.S. Department of Justice, a 25-year-old named Ryan Kramer created a malicious program in early 2024 that was promoted as an AI image generation tool on GitHub and other platforms.\nHowever, the DOJ says this program was actually malware that allowed Kramer to access the computer of those who installed it to steal data and passwords from the device.\nAccording to the\nWall Street Journal\n, one of the people who downloaded the program was a Disney employee, Matthew Van Andel, who executed it on his computer. This gave Kramer access to his device, including the passwords stored in his 1Password password manager.\nUsing Van Andel's stolen credentials, Kramer gained access to Disney's Slack channels, where he downloaded 1.1TB of corporate data.\n\"By accessing M.V.'s Disney Slack account, defendant gained access to non-public Disney Slack channels, and in or around May 2024, defendant downloaded approximately 1.1 terabytes of confidential data from thousands of Disney Slack channels,\" reads a plea agreement seen by BleepingComputer.\nThe\nDepartment of Justice says\nthat Kramer then contacted Van Andel, posing as a Russian hacktivist group called \"NullBulge,\" warning that his personal information and Disney's stolen Slack data would be published if he didn't cooperate.\nAfter receiving no response, NullBulge posted a message on the BreachForums hacking forum on July 12, 2024, titled \"DISNEY INTERNAL SLACK,\" where he claimed to have breached Disney and leaked the 1.1TB of stolen data, including Van Andel's personal info.\n\"1.1TiB of data. almost 10,000 channels, every message and file possible, dumped. Unreleased projects, raw images and code, some logins, links to internal api/ web pages, and more! Have fun sifting through it, there is a lot there,\" reads the forum post.\nKramer's Disney post on the BreachForum hacking forum\nSource: BleepingComputer\nKramer has pleaded guilty to one count of accessing a computer and obtaining information and one count of threatening to damage a protected computer. Each charge carries a statutory maximum sentence of five years in federal prison.\nHe has also confirmed that two additional people downloaded his malware, allowing him to gain access to their computers. The FBI is currently investigating these additional people.\nHis initial court appearance in Los Angeles federal court is expected to be in the coming weeks.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nBrowser-Based Data Leaks: 3 Biggest Data Security Challenges Today\nGet lifetime access to cybersecurity courses in this $70 deal\nCoinbase fixes 2FA log error making people think they were hacked\nInterlock ransomware claims DaVita attack, leaks stolen data\nGet started as an ethical hacker with this $35 course bundle deal"
    },
    {
        "Title": "Pro-Russia hacktivists bombard Dutch public orgs with DDoS attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/pro-russia-hacktivists-bombard-dutch-public-orgs-with-ddos-attacks/",
        "Summary": "Russia-aligned hacktivists persistently target key public and private organizations in the Netherlands with distributed denial of service (DDoS) attacks, causing access problems and service disruptions. [...]",
        "Date": "2025-05-01",
        "Content": "Russia-aligned hacktivists persistently target key public and private organizations in the Netherlands with distributed denial of service (DDoS) attacks, causing access problems and service disruptions.\nThe situation was acknowledged via a statement by the country's National Cyber Security Center (NCSC), part of the Dutch Ministry of Justice.\n\"This week, several Dutch organizations have been targeted by large-scale DDoS attacks,\"\nreads the NCSC announcement\n.\n\"The DDoS attacks are directed at both Dutch and other European organizations. Within the Netherlands, both public and private entities are being attacked.\"\nThe NCSC noted that the attacks were claimed by the hacktivist group named NoName057(16) on the threat actor's Telegram channel.\nSource: BleepingComputer\nAlthough the NCSC said the threat actor's motive is unclear, NoName057(16) declared it was retribution for the Netherlands sending €6 billion in military aid to Ukraine and planning to allocate another €3.5 billion in 2026.\nThe threat group's latest message on Telegram from yesterday indicates that the attacks continue.\nSource: BleepingComputer\nAccording to\nlocal media outlets\n, the DDoS attacks have impacted the provinces of Groningen, Noord-Holland, Zeeland, Drenthe, Overijssel, Noord-Brabant, and the municipalities of Apeldoorn, Breda, Nijmegen, and Tilburg.\nThe online portals of these public organizations were reportedly unreachable for several hours this week, though according to officials, there has been no compromise of internal systems or data.\nNoName057(16) is a threat actor that, since March 2022, has had\nsignificant involvement\nin numerous DDoS attacks targeting European and American organizations.\nThe threat group even launched a crowdsourced DDoS platform called '\nDDoSIA\n' where \"volunteers\" would get paid to lend their firepower in attacks.\nThe platform became very successful, recruiting\nthousands of users\nin under a year and launching multiple disruptive attacks on Western entities.\nIn July 2024, the Spanish authorities\narrested three members\nof DDoSIA and seized their devices for further investigation.\nHowever, there was no significant follow-up in the operation, and the leaders of the threat group have not been named or indicted yet, and so the DDoS attacks continue.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nFrance ties Russian APT28 hackers to 12 cyberattacks on French orgs\nCloudflare mitigates record number of DDoS attacks in 2025\nChinese hackers target Russian govt with upgraded RAT malware\nX hit by 'massive cyberattack' amid Dark Storm's DDoS claims\nNew Eleven11bot botnet infects 86,000 devices for DDoS attacks"
    },
    {
        "Title": "Ukrainian extradited to US for Nefilim ransomware attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/ukrainian-extradited-to-us-for-nefilim-ransomware-attacks/",
        "Summary": "A Ukrainian national has been extradited from Spain to the United States to face charges over allegedly conducting Nefilim ransomware attacks against companies. [...]",
        "Date": "2025-05-01",
        "Content": "A Ukrainian national has been extradited from Spain to the United States to face charges over allegedly conducting Nefilim ransomware attacks against companies.\nThe suspect, Artem Aleksandrovych Stryzhak, 35, was arrested in Spain in June 2024 and extradited to the U.S. on April 30, 2025.\nAccording to the U.S. Department of Justice, Stryzhak allegedly participated in ransomware attacks that targeted high-revenue companies, primarily in the United States, Norway, France, Switzerland, Germany, and the Netherlands.\nIn June 2021, Stryzhak allegedly became an affiliate of the Nefilim ransomware operation in exchange for 20% of any ransom payments he generated from attacks.\nStryzhak and his co-conspirators researched potential targets using online platforms to gather information about a company's revenue, size, and contact details. One of the more popular sites used by ransomware gangs to research targets is Zoominfo.\n\"In one exchange with Stryzhak in or about July 2021, a Nefilim administrator encouraged him to target companies in these countries with more than $200 million in annual revenue,\" reads the DOJ's\npress release\n.\nWhen conducting attacks, Nefilim affiliates breach corporate networks, steal data, and then encrypt devices using the ransomware encryptor. The attackers then demand a ransom payment in bitcoin to receive the decryption key and for stolen data not to be leaked. If a victim refuses to pay, the attackers publish the stolen data online on data leak sites.\nThe\nNefilim ransomware launched in 2020\n, sharing much of its code with the Nemty ransomware. The ransomware encrypted files using AES-128 encryption and appended the \".NEFILIM\" file extension to encrypted files.\nRansom notes named \"NEFILIM-DECRYPT.txt\" were created throughout the device's file system, warning that stolen data would be leaked within seven days if negotiations were not started.\nNefilim ransom note\nSource: BleepingComputer\nNefilim is believed to have later rebranded under other names, including Fusion, Milihpen, Gangbang, Nemty, and\nKarma\n.\nSome companies hit by Nefilim attacks include\nToll Group\n,\nOrange\n, and\nWhirlpool\n.\nStryzhak is charged with conspiracy to commit fraud and related activity, including extortion, in connection with computers. The indictment was unsealed in federal court in Brooklyn, where Stryzhak is scheduled for arraignment before U.S. Magistrate Judge Robert M. Levy.\nIf convicted, Stryzhak faces up to five years in prison.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nRansomHub ransomware uses new Betruger ‘multi-function’ backdoor\nSuspected LockBit ransomware dev extradited to United States\nMicrosoft: Octo Tempest is one of the most dangerous financial hacking groups\nHitachi Vantara takes servers offline after Akira ransomware attack\nDragonForce expands ransomware model with white-label branding scheme"
    },
    {
        "Title": "Harrods the next UK retailer targeted in a cyberattack",
        "Link": "https://www.bleepingcomputer.com/news/security/harrods-the-next-uk-retailer-targeted-in-a-cyberattack/",
        "Summary": "London's iconic department store, Harrods, has confirmed it was targeted in a cyberattack, becoming the third major UK retailer to report cyberattacks in a week following incidents at M&amp;S and the Co-op. [...]",
        "Date": "2025-05-01",
        "Content": "London's iconic department store, Harrods, has confirmed it was targeted in a cyberattack, becoming the third major UK retailer to report cyberattacks in a week following incidents at M&S and the Co-op.\nIn a statement shared with BleepingComputer, Harrods says threat actors recently attempted to hack into their systems, causing the company to restrict access to sites.\n\"We recently experienced attempts to gain unauthorised access to some of our systems,\" Harrods told BleepingComputer.\n\"Our seasoned IT security team immediately took proactive steps to keep systems safe and as a result we have restricted internet access at our sites today.\"\n\"Currently all sites including our Knightsbridge store, H beauty stores and airport stores remain open to welcome customers. Customers can also continue to shop via harrods.com.\"\n\"We are not asking our customers to do anything differently at this point and we will continue to provide updates as necessary.\"\nHarrods has not shared any further details in response to BleepingComputer's questions, such as whether systems were breached or if data was stolen.\nHowever, the decision to restrict access to some platforms indicates that they are actively responding to the attack.\nThis incident follows shortly after two other prominent UK retailers, Marks and Spencer and Co-op disclosed cyberattacks.\nM&S and Co-op also hit by cyberattacks\nLast week, Marks and Spencer confirmed it had\nsuffered a cyberattack\nthat led to\ndisruption of its online ordering systems\n, contactless payments, and Click & Collect service.\nBleepingComputer later confirmed the attack was linked to threat actors associated with the \"Scattered Spider\" tactics, who\ndeployed the DragonForce ransomware\non the company's network.\nYesterday, Co-op also disclosed a cyber incident, stating they experienced attempts to hack into their network.\nHowever, an internal email sent by Chief Digital and Information Officer Rob Elsey and\nseen by ITV News\nindicates the breach is larger than initially stated, telling employees that VPN access was disabled and urging staff to be vigilant when using email and Microsoft Teams.\n\"When running a Microsoft Teams call, please ensure all attendees are as expected and that users are on camera,\" reads a portion of the email.\n\"Don't post sensitive information in the Teams chat function such as colleague, client, customer or member related data.\"\nLaw enforcement has not released an official advisory related to these attacks, but as M&S and Co-op are both believed to have started with social engineering attacks, we will likely see a bulletin released shortly.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMarks & Spencer pauses online orders after cyberattack\nMarks & Spencer confirms a cyberattack as customers face delayed orders\nUK retailer Co-op shuts down some IT systems after hack attempt\nHitachi Vantara takes servers offline after Akira ransomware attack\nPhishing detection is broken: Why most attacks feel like a zero day"
    },
    {
        "Title": "Malicious PyPI packages abuse Gmail, websockets to hijack systems",
        "Link": "https://www.bleepingcomputer.com/news/security/malicious-pypi-packages-abuse-gmail-websockets-to-hijack-systems/",
        "Summary": "Seven malicious PyPi packages were found using Gmail's SMTP servers and WebSockets for data exfiltration and remote command execution. [...]",
        "Date": "2025-05-01",
        "Content": "Seven malicious PyPi packages were found using Gmail's SMTP servers and WebSockets for data exfiltration and remote command execution.\nThe packages were discovered by\nSocket's threat research team\n, who reported their findings to the PyPI, resulting in the removal of the packages.\nHowever, some of these packages were on PyPI for over four years, and based on\nthird-party download counters\n, one was downloaded over 18,000 times.\nHere's the complete list shared by Socket:\nCoffin-Codes-Pro (9,000 downloads)\nCoffin-Codes-NET2 (6,200 downloads)\nCoffin-Codes-NET (6,100 downloads)\nCoffin-Codes-2022 (18,100 downloads)\nCoffin2022 (6,500 downloads)\nCoffin-Grave (6,500 downloads)\ncfc-bsb (2,900 downloads)\nThe 'Coffin' packages appear to be impersonating the\nlegitimate Coffin package\nthat serves as a lightweight adapter for integrating Jinja2 templates into Django projects.\nThe malicious functionality Socket discovered in these packages centers on covert remote access and data exfiltration through Gmail.\nThe packages used hardcoded Gmail credentials to log into the service's SMTP server (smpt.gmail.com), sending reconnaissance information to allow the attacker to remotely access the compromised system.\nAs Gmail is a trusted service, firewalls and EDRs are unlikely to flag this activity as suspicious.\nAfter the email signaling stage, the implant connects to a remote server using WebSocket over SSL, receiving tunnel configuration instructions to establish a persistent, encrypted, bidirectional tunnel from the host to the attacker.\nUsing a 'Client' class, the malware forwards traffic from the remote host to the local system through the tunnel, allowing internal admin panel and API access, file transfer, email exfiltration, shell command execution, credentials harvesting, and lateral movement.\nSocket highlights strong indicators of potential cryptocurrency theft intent for these packages, seen in the email addresses used (e.g., blockchain.bitcoins2020@gmail.com) and similar tactics having been used in the past to steal Solana private keys.\nIf you have installed any of those packages in your environment, remove them immediately and rotate keys and credentials as needed.\nA related report published almost simultaneously by\nSonatype\nresearcher and fellow BleepingComputer reporter Ax Sharma focuses on a crypto-stealing package named 'crypto-encrypt-ts,' found in npm.\nThe package masquerades as a TypeScript version of the popular but now unmaintained 'CryptoJS' library while exfiltrating cryptocurrency wallet secrets and environment variables to a threat actor-controlled Better Stack endpoint.\nThe malicious package, which persists on infected systems via cron jobs, only targets wallets with balances that surpass 1,000 units, attempting to snatch their private keys.\nThe package was downloaded nearly 2,000 times before being reported and removed from npm.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nCarding tool abusing WooCommerce API downloaded 34K times on PyPI\nNorth Korean Lazarus hackers infect hundreds via npm packages\nEthereum private key stealer on PyPI downloaded over 1,000 times\nMalicious PyPI packages with over 10,000 downloads taken down\nPyPI packages caught stealing credit card numbers, Discord tokens"
    },
    {
        "Title": "Hackers abuse IPv6 networking feature to hijack software updates",
        "Link": "https://www.bleepingcomputer.com/news/security/hackers-abuse-ipv6-networking-feature-to-hijack-software-updates/",
        "Summary": "A China-aligned APT threat actor named \"TheWizards\" abuses an IPv6 networking feature to launch adversary-in-the-middle (AitM) attacks that hijack software updates to install Windows malware. [...]",
        "Date": "2025-05-01",
        "Content": "A China-aligned APT threat actor named \"TheWizards\" abuses an IPv6 networking feature to launch adversary-in-the-middle (AitM) attacks that hijack software updates to install Windows malware.\nAccording to ESET, the group has been active since at least 2022, targeting entities in the Philippines, Cambodia, the United Arab Emirates, China, and Hong Kong. Victims include individuals, gambling companies, and other organizations.\nThe attacks utilize a custom tool dubbed \"Spellbinder\" by ESET that abuses the IPv6 Stateless Address Autoconfiguration (SLAAC) feature to conduct\nSLACC attacks\n.\nSLAAC is a feature of the IPv6 networking protocol that allows devices to automatically configure their own IP addresses and default gateway without needing a DHCP server. Instead, it utilizes Router Advertisement (RA) messages to receive IP addresses from IPv6-supported routers.\nThe hacker's Spellbinder tool abuses this feature by sending spoofed RA messages over the network, causing nearby systems to automatically receive a new IPv6 IP address, new DNS servers, and a new, preferred IPv6 gateway.\nThis default gateway, though, is the IP address of the Spellbinder tool, which allows it to intercept communications and reroute traffic through attacker-controlled servers.\n\"Spellbinder sends a multicast RA packet every 200 ms to ff02::1 (\"all nodes\"); Windows machines in the network with IPv6 enabled will autoconfigure via\nstateless address autoconfiguration\n(SLAAC) using information provided in the RA message, and begin sending IPv6 traffic to the machine running Spellbinder, where packets will be intercepted, analyzed, and replied to where applicable,\" explains ESET.\nAbusing IPv6 SLAAC using the Spellbinder tool\nSource: ESET\nESET said attacks deploy Spellbinder using an archive named AVGApplicationFrameHostS.zip, which extracts into a directory mimicking legitimate software: \"%PROGRAMFILES%\\AVG Technologies.\"\nWithin this directory are AVGApplicationFrameHost.exe, wsc.dll, log.dat, and a legitimate copy of winpcap.exe. The WinPcap executable is used to side-load the malicious wsc.dll, which loads Spellbinder into memory.\nOnce a device is infected, Spellbinder begins capturing and analyzing network traffic attempting to connect specific domains, such as those related to Chinese software update servers.\nESET says the malware monitors for domains belonging to the following companies: Tencent, Baidu, Xunlei, Youku, iQIYI, Kingsoft, Mango TV, Funshion, Yuodao, Xiaomi, Xiaomi Miui, PPLive, Meitu, Quihoo 360, and Baofeng.\nThe tool then redirects those requests to download and install malicious updates that deploy a backdoor named \"WizardNet.\"\nThe WizardNet backdoor gives attackers persistent access to the infected device and allows them to install additional malware as needed.\nTo protect against these types of attacks, organizations can monitor IPv6 traffic or turn off the protocol if it is not required in their environment.\nIn January, ESET also reported on another hacking group named \"Blackwood\"\nhijacking the WPS Office software update feature\nto install malware.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nChinese hackers target Russian govt with upgraded RAT malware\nIvanti zero-day attacks infected devices with custom malware\nChinese cyberspies backdoor Juniper routers for stealthy access\nWordPress plugin disguised as a security tool injects backdoor\nMalicious PyPI packages with over 10,000 downloads taken down"
    },
    {
        "Title": "SANS Top 5: Cyber Has Busted Out of the SOC",
        "Link": "https://www.darkreading.com/cloud-security/sans-top5-cyber-broken-out-soc",
        "Summary": "This year's top cyber challenges include cloud authorization sprawl, ICS cyberattacks and ransomware, a lack of cloud logging, and regulatory constraints keeping defenders from fully utilizing AI's capabilities.",
        "Date": "2025-05-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/sans-top5-cyber-broken-out-soc"
    },
    {
        "Title": "Experts Debate Real ID Security Ahead of May 7 Deadline",
        "Link": "https://www.darkreading.com/cybersecurity-operations/experts-real-id-security-may-7-deadline",
        "Summary": "Real IDs have been in the works since 2005. Are their security standards still rigorous enough in 2025?",
        "Date": "2025-05-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/experts-real-id-security-may-7-deadline"
    },
    {
        "Title": "Getting Outlook.com Ready for Bulk Email Compliance",
        "Link": "https://www.darkreading.com/cloud-security/getting-outlook-com-ready-bulk-email-compliance",
        "Summary": "Microsoft has set May 5 as the deadline for bulk email compliance. In this Tech Tip, we show how organizations can still make the deadline.",
        "Date": "2025-05-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/getting-outlook-com-ready-bulk-email-compliance"
    },
    {
        "Title": "A Cybersecurity Paradox: Even Resilient Organizations Are Blind to AI Threats",
        "Link": "https://www.darkreading.com/cyber-risk/even-resilient-organizations-bind-ai-threats",
        "Summary": "A LevelBlue report looks at what goes into the security postures of a cyber-resilient organization, and found that AI is still a blind spot.",
        "Date": "2025-05-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/even-resilient-organizations-bind-ai-threats"
    },
    {
        "Title": "When Threat Actors Behave Like Managed Service Providers",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/threat-actors-behave-managed-service-providers",
        "Summary": "How one unreasonable client got lucky during a cyber incident, despite their unreasonable response to the threat.",
        "Date": "2025-05-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/threat-actors-behave-managed-service-providers"
    },
    {
        "Title": "Microsoft Readies Administrator Protection Option for Windows 11",
        "Link": "https://www.darkreading.com/endpoint-security/microsoft-readies-administrator-protection-option-windows-11",
        "Summary": "Microsoft's David Weston describes the new feature as the most significant architectural Windows security change in a generation.",
        "Date": "2025-05-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/microsoft-readies-administrator-protection-option-windows-11"
    },
    {
        "Title": "Putin's Cyberattacks on Ukraine Rise 70%, With Little Effect",
        "Link": "https://www.darkreading.com/threat-intelligence/putin-cyberattacks-ukraine-rise-little-effect",
        "Summary": "Russia's cyberattacks on Ukraine have increased dramatically, targeting the country's government and defense infrastructure.",
        "Date": "2025-05-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/putin-cyberattacks-ukraine-rise-little-effect"
    },
    {
        "Title": "Cisco Boosts XDR Platform, Splunk With Agentic AI",
        "Link": "https://www.darkreading.com/endpoint-security/cisco-boosts-xdr-platform-splunk-agentic-ai",
        "Summary": "Cisco joins the agentic AI wave with the introduction of advanced LLMs to autonomously verify and investigate attacks.",
        "Date": "2025-05-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/cisco-boosts-xdr-platform-splunk-agentic-ai"
    },
    {
        "Title": "Billbug Expands Cyber-Espionage Campaign in Southeast Asia",
        "Link": "https://www.darkreading.com/threat-intelligence/billbug-cyber-espionage-campaign-southeast-asia",
        "Summary": "The China-linked cyber-operations group, better known as Lotus Panda, uses its own custom malware to focus on government agencies and private companies in Hong Kong, the Philippines, Taiwan, and Vietnam.",
        "Date": "2025-05-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/billbug-cyber-espionage-campaign-southeast-asia"
    },
    {
        "Title": "Canadian Electric Utility Hit by Cyberattack",
        "Link": "https://www.securityweek.com/canadian-electric-utility-hit-by-cyberattack/",
        "Summary": "<p>Nova Scotia Power and Emera are responding to a cybersecurity incident that impacted IT systems and networks. </p>\n<p>The post <a href=\"https://www.securityweek.com/canadian-electric-utility-hit-by-cyberattack/\">Canadian Electric Utility Hit by Cyberattack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/canadian-electric-utility-hit-by-cyberattack/"
    },
    {
        "Title": "Year of the Twin Dragons: Developers Must Slay the Complexity and Security Issues of AI Coding Tools",
        "Link": "https://www.securityweek.com/year-of-the-twin-dragons-developers-must-slay-the-complexity-and-security-issues-of-ai-coding-tools/",
        "Summary": "<p>The advantages AI tools deliver in speed and efficiency are impossible for developers to resist. But the complexity and risk created by AI-generated code can’t be ignored.</p>\n<p>The post <a href=\"https://www.securityweek.com/year-of-the-twin-dragons-developers-must-slay-the-complexity-and-security-issues-of-ai-coding-tools/\">Year of the Twin Dragons: Developers Must Slay the Complexity and Security Issues of AI Coding Tools</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/year-of-the-twin-dragons-developers-must-slay-the-complexity-and-security-issues-of-ai-coding-tools/"
    },
    {
        "Title": "Commvault Shares IoCs After Zero-Day Attack Hits Azure Environment",
        "Link": "https://www.securityweek.com/more-details-come-to-light-on-commvault-vulnerability-exploitation/",
        "Summary": "<p>Commvault provides indicators of compromise and mitigation guidance after a zero-day exploit targeting its Azure environment lands in CISA’s KEV catalog.</p>\n<p>The post <a href=\"https://www.securityweek.com/more-details-come-to-light-on-commvault-vulnerability-exploitation/\">Commvault Shares IoCs After Zero-Day Attack Hits Azure Environment</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/more-details-come-to-light-on-commvault-vulnerability-exploitation/"
    },
    {
        "Title": "Chinese APT’s Adversary-in-the-Middle Tool Dissected",
        "Link": "https://www.securityweek.com/chinese-apts-adversary-in-the-middle-tool-dissected/",
        "Summary": "<p>ESET has analyzed Spellbinder, the IPv6 SLAAC spoofing tool Chinese APT TheWizards uses to deploy its WizardNet backdoor.</p>\n<p>The post <a href=\"https://www.securityweek.com/chinese-apts-adversary-in-the-middle-tool-dissected/\">Chinese APT&#8217;s Adversary-in-the-Middle Tool Dissected</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chinese-apts-adversary-in-the-middle-tool-dissected/"
    },
    {
        "Title": "Actions Over Words: Career Lessons for the Security Professional",
        "Link": "https://www.securityweek.com/actions-over-words-career-lessons-for-the-security-professional/",
        "Summary": "<p>In a world full of noise and promises, it’s those who consistently deliver behind the scenes who build the most respected and rewarding careers.</p>\n<p>The post <a href=\"https://www.securityweek.com/actions-over-words-career-lessons-for-the-security-professional/\">Actions Over Words: Career Lessons for the Security Professional</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/actions-over-words-career-lessons-for-the-security-professional/"
    },
    {
        "Title": "SonicWall Flags Two More Vulnerabilities as Exploited",
        "Link": "https://www.securityweek.com/sonicwall-flags-two-vulnerabilities-as-exploited/",
        "Summary": "<p>SonicWall has updated the advisories for two vulnerabilities to warn that they are being exploited in the wild.</p>\n<p>The post <a href=\"https://www.securityweek.com/sonicwall-flags-two-vulnerabilities-as-exploited/\">SonicWall Flags Two More Vulnerabilities as Exploited</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/sonicwall-flags-two-vulnerabilities-as-exploited/"
    },
    {
        "Title": "Ascension Discloses Data Breach Potentially Linked to Cleo Hack",
        "Link": "https://www.securityweek.com/ascension-discloses-data-breach-potentially-linked-to-cleo-hack/",
        "Summary": "<p>Ascension is notifying over 100,000 people that their personal information was stolen in a data breach potentially linked to the Cleo hack.</p>\n<p>The post <a href=\"https://www.securityweek.com/ascension-discloses-data-breach-potentially-linked-to-cleo-hack/\">Ascension Discloses Data Breach Potentially Linked to Cleo Hack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/ascension-discloses-data-breach-potentially-linked-to-cleo-hack/"
    },
    {
        "Title": "SentinelOne Targeted by North Korean IT Workers, Ransomware Groups, Chinese Hackers",
        "Link": "https://www.securityweek.com/sentinelone-targeted-by-north-korean-it-workers-ransomware-groups-chinese-hackers/",
        "Summary": "<p>SentinelOne has shared some information on the types of threat actors that have targeted the security firm recently.</p>\n<p>The post <a href=\"https://www.securityweek.com/sentinelone-targeted-by-north-korean-it-workers-ransomware-groups-chinese-hackers/\">SentinelOne Targeted by North Korean IT Workers, Ransomware Groups, Chinese Hackers</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-01",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/sentinelone-targeted-by-north-korean-it-workers-ransomware-groups-chinese-hackers/"
    }
]