[
    {
        "Title": "Bluetooth 6.1 enhances privacy with randomized RPA timing",
        "Link": "https://www.bleepingcomputer.com/news/security/bluetooth-61-enhances-privacy-with-randomized-rpa-timing/",
        "Summary": "The Bluetooth Special Interest Group (SIG) has announced Bluetooth Core Specification 6.1, bringing important improvements to the popular wireless communication protocol. [...]",
        "Date": "2025-05-11",
        "Content": "The Bluetooth Special Interest Group (SIG) has announced Bluetooth Core Specification 6.1, bringing important improvements to the popular wireless communication protocol.\nOne new feature highlighted in the latest release is the increased device privacy via randomized Resolvable Private Addresses (RPA) updates.\n\"Randomizing the timing of address changes makes it much more difficult for third parties to track or correlate device activity over time,\"\nreads SIG's announcement\n.\nA Resolvable Private Address (RPA) is a Bluetooth address created to look random and is used in place of a device's fixed MAC address to protect user privacy. It allows trusted devices to securely reconnect without revealing their true identity.\nCurrently, RPAs are updated at fixed intervals, usually every 15 minutes, which introduces a level of predictability. This predictability can be exploited in correlation attacks, making long-term tracking possible.\nBluetooth 6.1 improves privacy by randomizing the RPA updates between 8 and 15 minutes (default), while also allowing custom values between the range of 1 second to 1 hour.\nThe Controller picks a random value in the defined range using a NIST-approved random number generator, and updates the RPA. This makes tracking significantly harder, as there is no pattern in the value selection.\nMore details about how the new privacy feature works can be found in the\nspecification document\npublished along with the announcement.\nAnother feature highlighted in the announcement is better power efficiency starting from Bluetooth 6.1, which stems from allowing the chip (Controller) to autonomously handle the randomized RPA updates.\nSpecifically, the Bluetooth chip will choose the randomized timing intervals and generate and update the RPA internally without waking the host device.\nThis saves CPU cycles and memory operations, so much power is saved when conditions are met. For smaller devices like fitness bands, earbuds, and IoT sensors, this could make a big difference in battery life.\nWhile Bluetooth 6.1 has made exciting steps forward, it's important to underline that actual support in hardware and firmware may take years to arrive.\nThe first wave of chips with Bluetooth 6.1 should not be realistically expected before 2026, and even then, early implementations may not immediately expose all the newly available features, as testing and validation may be required.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nBrave's Cookiecrumbler tool taps community to help block cookie notices\nMicrosoft Teams will soon block screen capture during meetings\nGoogle fixes actively exploited FreeType flaw on Android\nMicrosoft ends Authenticator password autofill, moves users to Edge\nTikTok fined €530 million for sending European user data to China"
    },
    {
        "Title": "ChatGPT is finally adding Download as PDF for Deep Research",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-is-finally-adding-download-as-pdf-for-deep-research/",
        "Summary": "ChatGPT's Deep Research, which allows you to conduct multi-step research for complex tasks, is finally getting an option to save the report as a PDF. [...]",
        "Date": "2025-05-11",
        "Content": "ChatGPT's Deep Research, which allows you to conduct multi-step research for complex tasks, is finally getting an option to save the report as a PDF.\nWith ChatGPT's Deep Research, you can allow the AI agent to do the work for you independently.\nChatGPT takes your prompt, scans the internet, and reads hundreds of websites to create a comprehensive report.\nOnce a report has been generated, you have the option to copy it, but the issue with the 'copy' button is that it doesn't retain the formatting.\nIn our tests, BleepingComputer found that copying ChatGPT's deep research report into a Word document distorts the formatting.\nThis could be fixed with a new \"Download as PDF.\"\nAs spotted by\nTibor\non X, ChatGPT's Download as PDF option is finally being tested on the web app.\nIt's unclear when it will begin rolling out to everyone, and we also don't know if the option will appear for regular queries.\nAn option to export the report as a PDF would help keep the original layout, and it might appear next to the copy button after a Deep Research report has been generated.\nIn addition, OpenAI is rolling out a new GitHub connector for ChatGPT deep research for those with the Teams subscription.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nOpenAI document explains when to use each ChatGPT model\nOpenAI tests watermarking for ChatGPT-4o Image Generation model\nGoogle Gemini AI is getting ChatGPT-like Scheduled Actions feature\nChatGPT 4.1 early benchmarks compared against Google Gemini\nOpenAI's GPT-4.1, 4.1 nano, and 4.1 mini models release imminent"
    },
    {
        "Title": "iClicker site hack targeted students with malware via fake CAPTCHA",
        "Link": "https://www.bleepingcomputer.com/news/security/iclicker-hack-targeted-students-with-malware-via-fake-captcha/",
        "Summary": "The website of iClicker, a popular student engagement platform, was compromised in a ClickFix attack that used a fake CAPTCHA prompt to trick students and instructors into installing malware on their devices. [...]",
        "Date": "2025-05-11",
        "Content": "The website of iClicker, a popular student engagement platform, was compromised in a ClickFix attack that used a fake CAPTCHA prompt to trick students and instructors into installing malware on their devices.\niClicker is a subsidiary of Macmillan and is a digital classroom tool that allows instructors to take attendance, ask live questions or surveys, and track student engagement. It is widely used by 5,000 instructors and 7 million students at colleges and universities across the United States, including the University of Michigan, the University of Florida, and universities in California.\nAccording to a security alert from the\nUniversity of Michigan's Safe Computing team\n, the iClicker site was hacked between April 12 and April 16, 2025, to display a fake CAPTCHA that instructed users to press \"I'm not a robot\" to verify themselves.\nHowever, when visitors clicked on the verification prompt, a PowerShell script was silently copied into the Windows clipboard in what is known as a \"ClickFix\" social engineering attack.\nThe CAPTCHA would then instruct users to open the Windows Run dialog (Win + R), paste the PowerShell script (Ctrl + V) into it, and execute it by pressing\nEnter\nto verify themselves.\nExample of a fake CAPTCHA in a ClickFix attack\nSource: SilentPush\nWhile the ClickFix attack is no longer running on iClicker's site, a person\non Reddit\nlaunched the command on\nAny.Run\n, revealing the PowerShell payload that gets executed.\nThe PowerShell command used in the iClicker attack was heavily obfuscated, but when executed, it would connect to a remote server at http://67.217.228[.]14:8080 to retrieve another PowerShell script that would be executed.\nObfuscated PowerShell script used in iClicker ClickFix attack\nSource: BleepingComputer\nUnfortunately, it is not known what malware was ultimately installed, as the retrieved PowerShell script was different depending on the type of visitor.\nFor targeted visitors, it would send a script that downloads malware onto the computer. The University of Michigan says that the malware allowed the threat actor to have full access to the infected device.\nFor those who were not targeted, such as malware analysis sandboxes, the script would instead download and run the legitimate Microsoft Visual C++ Redistributable, as shown below.\niwr https://download.microsoft.com/download/9/3/f/93fcf1e7-e6a4-478b-96e7-d4b285925b00/vc_redist.x64.exe -out \"$env:TMP/vc_redist.x64.exe\"; & \"$env:TMP/vc_redist.x64.exe\"\nClickFix attacks have become widespread social engineering attacks that have been used in numerous malware campaigns, including those pretending to be a\nCloudflare CAPTCHA\n,\nGoogle Meet\n, and\nweb browser errors\n.\nFrom past campaigns, the attack likely distributed an infostealer, which can steal cookies, credentials, passwords, credit cards, and browsing history from Google Chrome, Microsoft Edge, Mozilla Firefox, and other Chromium browsers.\nThis type of malware can also steal cryptocurrency wallets, private keys, and\ntext files likely to contain sensitive information\n, such as those named seed.txt, pass.txt, ledger.txt, trezor.txt, metamask.txt, bitcoin.txt, words, wallet.txt, *.txt, and *.pdf.\nThis data is collected into an archive and sent back to the attacker, where they can use the information in further attacks or sell it on cybercrime marketplaces.\nThe stolen data can also be used to conduct widescale breaches that lead to ransomware attacks. As the attack targeted college students and instructors, the goal could have been to steal credentials to conduct attacks on college networks.\nBleepingComputer contacted MacMillan multiple times with questions regarding this attack this week, but did not respond to our questions.\nHowever, BleepingComputer later found that iClicker published a security bulletin on its website on May 6 but included a\n<meta name='robots' content='noindex, nofollow' />\ntag in the page's HTML, preventing the document from being indexed by search engines and thus making it more difficult to find information on the incident.\niClicker security bulletin published with a noindex tag\nSource: BleepingComputer\n\"We recently resolved an incident affecting the iClicker landing page (iClicker.com). Importantly, no iClicker data, apps, or operations were impacted and the identified vulnerability on the iClicker landing page has been resolved,\" reads\niClicker's security bulletin\n.\n\"What happened: an unrelated third party placed a false Captcha on our iClicker landing page before users logged into iClicker on our website. This third party was hoping to get users to click on the false captcha similar to what we unfortunately experience quite often in phishing emails these days.\"\n\"Out of an abundance of caution, we recommend that any faculty or student who encountered and clicked on the false Captcha from April 12- April 16 on our website run security software to ensure their devices remain protected.\"\nUsers who accessed iClicker.com while the site was hacked and followed the fake CAPTCHA instructions should immediately change their iClicker password, and if the command was executed, change all passwords stored on their computer to a unique one for every site.\nTo help with this, it is suggested that you use a password manager like BitWarden or 1Password.\nIt's important to note that users who accessed iClicker through the mobile app or did not encounter the fake CAPTCHA are not at risk from the attack.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nGoogle links new LostKeys data theft malware to Russian cyberspies\nInterlock ransomware gang pushes fake IT tools in ClickFix attacks\nNew ClickFix attack deploys Havoc C2 via Microsoft Sharepoint\nClickFix attack delivers infostealers, RATs in fake Booking.com emails\nSupply chain attack hits npm package with 45,000 weekly downloads"
    }
]