[
    {
        "Title": "Malicious Go Modules Deliver Disk-Wiping Linux Malware in Advanced Supply Chain Attack",
        "Link": "https://thehackernews.com/2025/05/malicious-go-modules-deliver-disk.html",
        "Summary": "Cybersecurity researchers have discovered three malicious Go modules that include obfuscated code to fetch next-stage payloads that can irrevocably overwrite a Linux system's primary disk and render it unbootable.\nThe names of the packages are listed below -\n\ngithub[.]com/truthfulpharm/prototransform\ngithub[.]com/blankloggia/go-mcp\ngithub[.]com/steelpoor/tlsproxy\n\n\"Despite appearing legitimate,",
        "Date": "2025-05-03",
        "Content": "Cybersecurity researchers have discovered three malicious Go modules that include obfuscated code to fetch next-stage payloads that can irrevocably overwrite a Linux system's primary disk and render it unbootable.\nThe names of the packages are listed below -\ngithub[.]com/truthfulpharm/prototransform\ngithub[.]com/blankloggia/go-mcp\ngithub[.]com/steelpoor/tlsproxy\n\"Despite appearing legitimate, these modules contained highly\nobfuscated code\ndesigned to fetch and execute remote payloads,\" Socket researcher Kush Pandya\nsaid\n.\nThe packages are designed to check if the operating system on which they are being run is Linux, and if so retrieve a next-stage payload from a remote server using wget.\nThe payload is a destructive shell script that overwrites the entire primary disk (\"\n/dev/sda\n\") with zeroes, effectively preventing the machine from booting up.\n\"This destructive method ensures no data recovery tool or forensic process can restore the data, as it directly and irreversibly overwrites it,\" Pandya said.\n\"This malicious script leaves targeted Linux servers or developer environments entirely crippled, highlighting the extreme danger posed by modern supply-chain attacks that can turn seemingly trusted code into devastating threats.\"\nThe disclosure comes as multiple malicious npm packages have been identified in the registry with features to steal mnemonic seed phrases and private cryptocurrency keys and exfiltrate sensitive data. The list of the packages, identified by\nSocket\n,\nSonatype\n, and\nFortinet\nis below -\ncrypto-encrypt-ts\nreact-native-scrollpageviewtest\nbankingbundleserv\nbuttonfactoryserv-paypal\ntommyboytesting\ncompliancereadserv-paypal\noauth2-paypal\npaymentapiplatformservice-paypal\nuserbridge-paypal\nuserrelationship-paypal\nMalware-laced packages targeting cryptocurrency wallets have also been discovered in the Python Package Index (PyPI) repository – web3x and herewalletbot – with capabilities to siphon mnemonic seed phrases. These packages have been collectively downloaded more than 6,800 times since getting published in 2024.\nAnother set of seven PyPI packages have been\nfound\nleveraging Gmail's SMTP servers and WebSockets for data exfiltration and remote command execution in an attempt to evade detection. The packages, which have since been removed, are as follows -\ncfc-bsb (2,913 downloads)\ncoffin2022 (6,571 downloads)\ncoffin-codes-2022 (18,126 downloads)\ncoffin-codes-net (6,144 downloads)\ncoffin-codes-net2 (6,238 downloads)\ncoffin-codes-pro (9,012 downloads)\ncoffin-grave (6,544 downloads)\nThe packages use hard-coded Gmail account credentials to sign-in to the service's SMTP server and send a message to another Gmail address to signal a successful compromise. They subsequently establish a WebSocket connection to establish a bidirectional communication channel with the attacker.\nThe threat actors take advantage of the trust associated with Gmail domains (\"smtp.gmail[.]com\") and the fact that corporate proxies and endpoint protection systems are unlikely to flag it as suspicious, making it both stealthy and reliable.\nThe package that apart from the rest is cfc-bsb, which lacks the Gmail-related functionality, but incorporates the WebSocket logic to facilitate remote access.\nTo mitigate the risk posed by such supply chain threats, developers are advised to verify package authenticity by checking publisher history and GitHub repository links; audit dependencies regularly; and enforce strict access controls on private keys.\n\"Watch for unusual outbound connections, especially SMTP traffic, since attackers can use legitimate services like Gmail to steal sensitive data,\" Socket researcher Olivia Brown said. \"Do not trust a package solely because it has existed for more than a few years without being taken down.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Iranian Hackers Maintain 2-Year Access to Middle East CNI via VPN Flaws and Malware",
        "Link": "https://thehackernews.com/2025/05/iranian-hackers-maintain-2-year-access.html",
        "Summary": "An Iranian state-sponsored threat group has been attributed to a long-term cyber intrusion aimed at a critical national infrastructure (CNI) in the Middle East that lasted nearly two years.\nThe activity, which lasted from at least May 2023 to February 2025, entailed \"extensive espionage operations and suspected network prepositioning – a tactic often used to maintain persistent access for future",
        "Date": "2025-05-03",
        "Content": "An Iranian state-sponsored threat group has been attributed to a long-term cyber intrusion aimed at a critical national infrastructure (CNI) in the Middle East that lasted nearly two years.\nThe activity, which lasted from at least May 2023 to February 2025, entailed \"extensive espionage operations and suspected network prepositioning – a tactic often used to maintain persistent access for future strategic advantage,\" the FortiGuard Incident Response (FGIR) team\nsaid\nin a report.\nThe network security company noted that the attack exhibits tradecraft overlaps with a known Iranian nation-state threat actor called\nLemon Sandstorm\n(formerly Rubidium), which is also tracked as Parisite, Pioneer Kitten, and UNC757.\nIt's been assessed to be active since at least 2017, striking aerospace, oil and gas, water, and electric sectors across the United States, the Middle East, Europe, and Australia. According to industrial cybersecurity company Dragos, the adversary has\nleveraged\nknown virtual private network (VPN) security flaws in Fortinet, Pulse Secure, and Palo Alto Networks to obtain initial access.\nLast year, U.S. cybersecurity and intelligence agencies\npointed fingers\nat Lemon Sandstorm for deploying ransomware against entities in the U.S., Israel, Azerbaijan, and the United Arab Emirates.\nThe attack analyzed by Fortinet against the CNI entity unfolded over four stages starting from May 2023, employing an evolving arsenal of tools as the victim enacted countermeasures -\n15 May, 2023 – 29 April, 2024\n- Establishing a foothold by using stolen login credentials to access the victim's SSL VPN system, drop web shells on public-facing servers, and deploy three backdoors, Havoc, HanifNet, and HXLibrary, for long-term access\n30 April, 2024 – 22 November, 2024\n- Consolidating the foothold by planting more web shells and an additional backdoor called NeoExpressRAT, using tools like plink and Ngrok to burrow deeper into the network, performing targeted exfiltration of the victim's emails, and conducting lateral movement to the virtualization infrastructure\n23 November, 2024 – 13 December, 2024\n- Deploying more web shells and two more backdoors, MeshCentral Agent and SystemBC, in response to initial containment and remediation steps undertaken by the victim\n14 December, 2024 – Present\n- Attempts to infiltrate the network again by exploiting known Biotime vulnerabilities (CVE-2023-38950, CVE-2023-38951, and CVE-2023-38952) and spear-phishing attacks aimed at 11 of the employees to harvest Microsoft 365 credentials after the victim successfully removed adversary's access\nIt's worth noting that both\nHavoc\nand\nMeshCentral\nare open-source tools that function as a command-and-control (C2) framework and remote monitoring and management (RMM) software, respectively. On the other hand,\nSystemBC\nrefers to a commodity malware that often acts as a precursor to ransomware deployment.\nA brief description of the other custom malware families and open-source tools used in the attack is below -\nHanifNet\n- An unsigned .NET executable that can retrieve and execute commands from a C2 server (First deployed in August 2023)\nHXLibrary\n- A malicious IIS module written in .NET that's designed to retrieve three identical text files hosted on Google Docs to fetch the C2 server and send web requests to it (First deployed in October 2023)\nCredInterceptor\n- A DLL-based tool that can harvest credentials from the Windows Local Security Authority Subsystem Service (\nLSASS\n) process memory (First deployed in November 2023)\nRemoteInjector\n- A loader component that's used to execute the next-stage payload like Havoc (First deployed in April 2024)\nRecShell\n- A web shell used for initial reconnaissance (First deployed in April 2024)\nNeoExpressRAT\n- A backdoor that retrieves a configuration from the C2 server and likely uses Discord for follow-on communications (First deployed in August 2024)\nDropShell\n- A web shell with basic file upload capabilities (First deployed in November 2024)\nDarkLoadLibrary\n- An\nopen-source loader\nthat's used to launch SystemBC (First deployed in December 2024)\nThe links to Lemon Sandstorm come from\nC2 infrastructure\n– apps.gist.githubapp[.]net and gupdate[.]net – previously flagged as associated with the threat actor's operations conducted over the same period.\nFortinet said the victim's restricted Operational Technology (OT) network was a key target of the attack based on the threat actor's extensive reconnaissance activity and their breach of a network segment hosting OT-adjacent systems. That said, there is no evidence that the adversary penetrated the OT network.\nA majority of the malicious activity has been assessed to be hands-on keyboard operations carried out by different individuals, given the command errors and the consistent work schedule. Furthermore, a deeper examination of the incident has revealed that the threat actor may have had access to the network as early as 15 May 2021.\n\"Throughout the intrusion, the attacker leveraged chained proxies and custom implants to bypass network segmentation and move laterally within the environment,\" the company said. \"In later stages, they consistently chained four different proxy tools to access internal network segments, demonstrating a sophisticated approach to maintaining persistence and avoiding detection.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "U.S. Charges Yemeni Hacker Behind Black Kingdom Ransomware Targeting 1,500 Systems",
        "Link": "https://thehackernews.com/2025/05/us-charges-yemeni-hacker-behind-black.html",
        "Summary": "The U.S. Department of Justice (DoJ) on Thursday announced charges against a 36-year-old Yemeni national for allegedly deploying the Black Kingdom ransomware against global targets, including businesses, schools, and hospitals in the United States.\nRami Khaled Ahmed of Sana'a, Yemen, has been charged with one count of conspiracy, one count of intentional damage to a protected computer, and one",
        "Date": "2025-05-03",
        "Content": "The U.S. Department of Justice (DoJ) on Thursday announced charges against a 36-year-old Yemeni national for allegedly deploying the Black Kingdom ransomware against global targets, including businesses, schools, and hospitals in the United States.\nRami Khaled Ahmed of Sana'a, Yemen, has been charged with one count of conspiracy, one count of intentional damage to a protected computer, and one count of threatening damage to a protected computer. Ahmed is assessed to be currently living in Yemen.\n\"From March 2021 to June 2023, Ahmed and others infected computer networks of several U.S.-based victims, including a medical billing services company in Encino, a ski resort in Oregon, a school district in Pennsylvania, and a health clinic in Wisconsin,\" the DoJ\nsaid\nin a statement.\nAhmed is accused of developing and deploying the ransomware by exploiting a vulnerability in Microsoft Exchange Server known as ProxyLogon.\nThe ransomware worked by either encrypting data from victims' computer networks or claiming to steal that information from the networks. Post encryption, the ransomware dropped a ransom note on the system and directed the victim to send $10,000 worth of Bitcoin to a cryptocurrency address controlled by a co-conspirator.\nVictims were also allegedly asked to send proof of the payment to a Black Kingdom email address. The ransomware is estimated to have been delivered on about 1,500 computer systems in the U.S. and elsewhere.\nAlso tracked under the name Pydomer, the ransomware family has been previously linked to attacks taking advantage of Pulse Secure VPN vulnerabilities (\nCVE-2019-11510\n), Microsoft\nrevealed\nin late March 2021, noting that it was the first existing ransomware family to capitalize on the ProxyLogon flaws.\nCybersecurity vendor Sophos\ndescribed\nthe Black Kingdom as \"somewhat rudimentary and amateurish in its composition,\" with the attackers leveraging the ProxyLogon vulnerability to deploy web shells, which were then used to issue PowerShell commands to download the ransomware.\nIt also said the activity bears all the hallmarks of a \"motivated script-kiddie.\" Then later that August, a Nigerian threat actor was\nobserved\nattempting to recruit employees by offering them to pay $1 million in Bitcoin to deploy Black Kingdom ransomware on companies' networks as part of an insider threat scheme.\nIf convicted, Ahmed faces a maximum sentence of five years in federal prison for each count. The case is being investigated by the U.S. Federal Bureau of Investigation (FBI) with assistance from the New Zealand Police.\nThe charges come amid a raft of announcements from U.S. government authorities against various criminal activities -\nThe DoJ\nunsealed\nan indictment charging Ukrainian citizen Artem Stryzhak with attacking companies using\nNefilim\nransomware since becoming an affiliate in June 2021. He was arrested in Spain in June 2024 and extradited to the United States on April 30, 2025. If convicted of the charge, Stryzhak faces up to five years' imprisonment.\nTyler Robert Buchanan, a British national suspected of being a member of the notorious Scattered Spider cybercrime group, was\nextradited\nfrom Spain to the United States to face charges related to wire fraud and aggravated identity theft. Buchanan was\narrested\nin Spain in June 2024. Charges against him and other Scattered Spider members were\nannounced\nby the US in November 2024.\nLeonidas Varagiannis (aka War), 21, and Prasan Nepal (aka Trippy), 20, the two alleged leaders of a child extortion group 764 have been\narrested and charged\nwith directing and distributing child sexual abuse material (CSAM). The two men are accused of exploiting at least eight minor victims.\nRichard Anthony Reyna Densmore, another member of 764, was\nsentenced\nto 30 years in the U.S. in November 2024 for sexually exploiting a child. Members of 764 are affiliated with\nThe Com\n, a disparate collection of loosely associated groups that commit financially motivated, sexual, and violent crimes. It also includes Scattered Spider.\nThe U.S. Treasury Department's Financial Crimes Enforcement Network (FinCEN)\ndesignated\nCambodia-based conglomerate\nHuiOne Group\nas an \"institution of primary\nmoney laundering\nconcern\" for Southeast Asian transnational cybercrime gangs by facilitating\nromance baiting scams\nand for serving as a critical node for laundering proceeds of cyber heists carried out by the Democratic People's Republic of Korea (DPRK). HuiOne Pay's banking license was\nrevoked\nin March 2025 by the National Bank of Cambodia.\nRansomware Attacks Surge as Payoffs Dwindle\nThe developments come as\nransomware\ncontinues\nto be an\nenduring threat\n, albeit increasingly fragmented and volatile, as sustained law enforcement actions are causing major shifts in observed tactics. This includes the growing frequency of encryption-less attacks and the trend of cybercriminals moving away from traditional hierarchical groups in favor of a lone-wolf approach.\n\"Ransomware operations are becoming increasingly decentralized, with a growing number of former affiliates choosing to operate independently rather than remain tied to established groups,\" Halcyon\nsaid\n.\n\"This shift is being driven by several factors, including increased law enforcement coordination, successful takedowns of major ransomware infrastructure, and a broader push by actors to avoid attribution through brand rotation or unbranded campaigns.\"\nData compiled by Verizon shows that 44% of all analyzed breaches in 2024 involved the use of a ransomware strain, up from 32% in 2023. But there is good news: More victims than ever are refusing to pay ransoms and fewer organizations are willing to pay the ransom demanded.\n\"For the calendar year 2024, the median ransom paid comes up as $115,000, which is a decrease from $150,000 in the previous year,\" Verizon\nsaid\nin its 2025 Data Breach Investigations Report (DBIR). \"64% of the victim organizations did not pay the ransoms, which was up from 50% two years ago.\"\nAccording to Coveware, the average ransom payment for the first quarter of 2025 was $552,777, a 0.2% decrease from the previous quarter. The media ransom payment, in contrast, climbed 80% by $200,000.\n\"The rate of companies that opted to pay a ransom, either to procure decryption keys or to suppress a threat actor from posting the breached data on their leak site, rose slightly in Q1 2025,\" the company\nsaid\n.\nThe ransomware payment resolution rate for the period has been tallied at 27%, down from 85% in Q1 2019, 73% in Q1 2020, 56% in Q1 2021, 46% in Q1 2022, 45% in Q1 2023, and 28% in Q1 2024.\n\"While attacks are assuredly still occurring and new groups continue to spin up each month, the well-oiled ransomware machine that early RaaS groups built is plagued with complications that seem unlikely to resolve,\" it added.\nDespite these setbacks, ransomware shows no sign of stopping anytime soon, with Q1 2025 witnessing 2,289 reported incidents, a 126% increase compared to Q1 2024, per\nCheck Point\n. Ransomware attacks, however, have\nwitnessed\na 32% drop month-over-month in March 2025, with a total of 600 claimed incidents.\nNorth America and Europe accounted for more than 80% of the cases. Consumer goods and services, business services, industrial manufacturing, healthcare, and construction and engineering were the sectors the most targeted by ransomware.\n\"Ransomware incident volumes are reaching unprecedented levels,\" Dr. Darren Williams, Founder and CEO of BlackFog,\nsaid\n. \"This presents ongoing challenges for organisations dealing with attackers focused on disruption, data theft, and extortion. Different groups will emerge and disband, but they all focus on the same end goal, data exfiltration.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Google NotebookLM is now using Gemini 2.5 Flash",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/google-notebooklm-is-now-using-gemini-25-flash/",
        "Summary": "Google NotebookLM, which is a research and note-taking AI tool, is getting upgraded to Gemini 2.5 Flash. [...]",
        "Date": "2025-05-03",
        "Content": "Google NotebookLM, which is a research and note-taking AI tool, is getting upgraded to Gemini 2.5 Flash.\nNotebookLM has been around for two years now, and it's a great way to take notes online for research.\nNotebookLM is specifically famous for the Audio Overviews feature, which is a podcast-style generative audio feature.\nWhile the Audio Overviews feature isn't getting a big overhaul today, Google has confirmed that the research tool in NotebookLM is now powered by Gemini 2.5 Flash.\nFor those unaware, 2.5 models are thinking models, which means NotebookLM can now generate better responses because it can now think \"deeper.\"\nGemin 2.5 is one of the significant upgrades in the 2.5 reasoning series. It offers better reasoning with improved speed and reduced cost.\nWith Gemini 2.5 Flash support, you can expect more comprehensive answers in NotebookLM, particularly to complex, multi-step reasoning questions.\nHowever, this change will not improve Audio Overviews.\nIn a\npost\non X, Google noted that Gemini 2.5 Flash integration applies only to the text side of NotebookLM.\n\"Great question! This will currently only impact the Q&A but great feedback for our audio overviews team Thank you,\" Google NotebookLM team wrote in a post.\nIn addition, Google confirmed that it's working on a new NotebookLM app for\nAndroid\nand\niOS\nwith a release date scheduled for May 21.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nGoogle takes on Cursor with Firebase Studio, its AI builder for vibe coding\nGoogle Gemini AI is getting ChatGPT-like Scheduled Actions feature\nGoogle Gemini's Astra (screen sharing) rolls out on Android for some users\nWhatsApp unveils 'Private Processing' for cloud-based AI features\nGoogle blocked over 5 billion ads in 2024 amid rise in AI-powered scams"
    },
    {
        "Title": "Microsoft ends Authenticator password autofill, moves users to Edge",
        "Link": "https://www.bleepingcomputer.com/news/security/microsoft-ends-authenticator-password-autofill-moves-users-to-edge/",
        "Summary": "Microsoft has announced that it will discontinue the password storage and autofill feature in the Authenticator app starting in July and will complete the deprecation in August 2025. [...]",
        "Date": "2025-05-03",
        "Content": "Microsoft has announced that it will discontinue the password storage and autofill feature in the Authenticator app starting in July and will complete the deprecation in August 2025.\nThe decision is to streamline autofill support and consolidate credentials management under a single platform, Microsoft Edge.\nThe move requires action from impacted users as they are given until August 1, 2025, to export their information from Authenticator, or risk losing it.\nMicrosoft Authenticator is a free mobile app (\niOS\nand\nAndroid\n) that provides secure sign-in for mobile accounts using multi-factor authentication (MFA) methods like time-based one-time passwords (TOTPs), push notifications, or biometrics-based confirmations.\nThe app supports authentication for Microsoft services like Microsoft accounts, Azure AD, and GitHub, as well as non-Microsoft platforms.\nThe autofill feature was added to mobile Authenticator apps\nin December 2020,\nallowing users to fill their credentials saved in the Authenticator on sign-in forms automatically.\nSupport for this feature is about to end, though, as Microsoft announced the phased deprecation of autofill in three steps:\nJune 2025\n: You can no longer save new passwords in Authenticator.\nJuly 2025\n: Autofill will stop working in Authenticator; stored payment info will be deleted.\nAugust 2025\n: Saved passwords and unsaved generated passwords will no longer be accessible in Authenticator.\nUsers pushed to (the) Edge\nMicrosoft announced that autofill and the password manager are now moving to its browser, Edge.\nUsers who want to continue using the passwords saved in Microsoft Authenticator for autofill will need to install Microsoft Edge on their phone (\niOS\n,\nAndroid\n).\n\"Your saved passwords (but not your generated password history) and addresses are securely synced to your Microsoft account, and you can continue to access them and enjoy seamless autofill functionality with Microsoft Edge,\"\nreads the announcement\n.\nTo complete the migration of the autofill functionality to Microsoft's browser, users need to find 'Autofill/Passwords' in their device settings and choose Edge as the preferred service.\nThen, launch Edge and sign in with your Microsoft account to allow the syncing of passwords to begin.\nIf everything is done correctly, all passwords should be accessible via Settings > Passwords on Edge.\nIf users don't want to use Edge, Microsoft allows exporting passwords so they can be moved to another password manager, but this must be done before August 1, 2025. For payment information, July 2025 is the deadline.\nTo\nexport passwords\nfrom Microsoft Authenticator, select menu > Settings > Autofill > Export Passwords > select an export location and tap 'Save.'\nThe importing process is only applicable to account passwords. Payment info will have to be manually re-inputted for security reasons.\nMicrosoft noted that Passkeys will continue to be supported in Authenticator, so users who actively use them to sign in to their Microsoft Accounts must ensure the app remains enabled as their Passkey Provider.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nCoinbase fixes 2FA log error making people think they were hacked\nRussian army targeted by new Android malware hidden in mapping app\nMicrosoft says Edge browser is now 9% faster after optimizations\nNew Android malware steals your credit cards for NFC relay attacks\n7 Steps to Take After a Credential-Based cyberattack"
    }
]