[
    {
        "Title": "Cybercriminals Target AI Users with Malware-Loaded Installers Posing as Popular Tools",
        "Link": "https://thehackernews.com/2025/05/cybercriminals-target-ai-users-with.html",
        "Summary": "Fake installers for popular artificial intelligence (AI) tools like OpenAI ChatGPT and InVideo AI are being used as lures to propagate various threats, such as the CyberLock and Lucky_Gh0$t ransomware families, and a new malware dubbed Numero.\n\"CyberLock ransomware, developed using PowerShell, primarily focuses on encrypting specific files on the victim's system,\" Cisco Talos researcher Chetan",
        "Date": "2025-05-29",
        "Content": "Fake installers for popular artificial intelligence (AI) tools like OpenAI ChatGPT and InVideo AI are being used as lures to propagate various threats, such as the CyberLock and Lucky_Gh0$t ransomware families, and a new malware dubbed Numero.\n\"CyberLock ransomware, developed using PowerShell, primarily focuses on encrypting specific files on the victim's system,\" Cisco Talos researcher Chetan Raghuprasad\nsaid\nin a report published today. \"Lucky_Gh0$t ransomware is yet another variant of the\nYashma\nransomware, which is the sixth iteration of the Chaos ransomware series, featuring only minor modifications to the ransomware binary.\"\nNumero, on the other hand, is a destructive malware that impacts victims by manipulating the graphical user interface (GUI) components of their Windows operating system, thereby rendering the machines unusable.\nThe cybersecurity company said the legitimate versions of the AI tools are popular in the business-to-business (B2B) sales domain and the marketing sector, suggesting that individuals and organizations in these industries are the primary focus of the threat actors behind the campaign.\nOne such fake AI solution website is \"novaleadsai[.]com,\" which likely impersonates a lead monetization platform called NovaLeads. It's suspected that the website is promoted via search engine optimization (SEO) poisoning techniques to artificially boost its rankings in online search engines.\nUsers are then urged to download the product by claiming to offer free access to the tool for the first year, with a monthly subscription of $95 thereafter. What gets actually downloaded is a ZIP archive containing a .NET executable (\"NovaLeadsAI.exe\") that was compiled on February 2, 2025, the same day the bogus domain was created. The binary, for its part, acts as a loader to deploy the PowerShell-based CyberLock ransomware.\nThe ransomware is equipped to escalate privileges and re-execute itself with administrative permissions, if not already, and encrypts files located in the partitions \"C:\\,\" \"D:\\,\" and \"E:\\\" that match a certain set of extensions. It then drops a ransom note demanding that a $50,000 payment be made in Monero into two wallets within three days.\nIn an interesting twist, the threat actor goes on to claim in the ransom note that the payments will be allocated to support women and children in Palestine, Ukraine, Africa, Asia, and other regions where \"injustices are a daily reality.\"\nFile extensions targeted by CyberLock ransomware\n\"We ask you to consider that this amount is small in comparison to the innocent lives that are being lost, especially children who pay the ultimate price,\" the note states. \"Unfortunately, we have concluded that many are not willing to act voluntarily to help, which makes this the only possible solution.\"\nThe last step involves the threat actor employing the living-off-the-land binary (LoLBin) \"\ncipher.exe\n\" with the\n\"/w\" option\nto remove available unused disk space on the entire volume in order to hinder the forensic recovery of deleted files.\nTalos said it also observed a threat actor distributing the Lucky_Gh0$t ransomware under the guise of a fake installer for a premium version of ChatGPT.\n\"The malicious SFX installer included a folder that contained the Lucky_Gh0$t ransomware executable with the filename 'dwn.exe,' which imitates the legitimate Microsoft executable 'dwm.exe,'\" Raghuprasad said. \"The folder also contained legitimate Microsoft open-source AI tools that are available on their GitHub repository for developers and data scientists working with AI, particularly within the Azure ecosystem.\"\nShould the victim run the malicious SFX installer file, the SFX script executes the ransomware payload. A Yashma ransomware variant, Lucky_Gh0$t targets files that are roughly less than 1.2GB in size for encryption, but not before deleting volume shadow copies and backups.\nThe ransom note dropped at the end of the attack includes a unique personal decryption ID and instructs victims to reach out to them via the Session messaging app for a ransom payment and to obtain a decryptor.\nLast but not least, threat actors are also cashing in on the growing use of AI tools to seed the online landscape with a counterfeit installer for InVideo AI, an AI-powered video creation platform, to deploy a destructive malware codenamed Numero.\nThe fraudulent installer serves as a dropper containing three components: A Windows batch file, a Visual Basic Script, and the Numero executable. When the installer is launched, the batch file is run through the Windows shell in an infinite loop, which, in turn, executes Numero and then temporarily halts it for 60 seconds by running the VB script via cscript.\n\"After resuming the execution, the batch file terminates the Numero malware process and restarts its execution,\" Talos said. \"By implementing the infinite loop in the batch file, the Numero malware is continuously run on the victim machine.\"\nA 32-bit Windows executable written in C++, Numero checks for the presence of malware analysis tools and debuggers among running processes, and proceeds to overwrite the desktop window's title, buttons, and contents with the numeric string \"1234567890.\" It was compiled on January 24, 2025.\nThe disclosure comes as Google-owned Mandiant revealed details of a malvertising campaign that utilizes\nmalicious ads\non Facebook and LinkedIn to redirect users to fake websites impersonating legitimate AI video generator tools like Luma AI, Canva Dream Lab, and Kling AI, among others.\nThe activity, which was also recently exposed by\nMorphisec\nand\nCheck Point\nearlier this month, has been attributed to a threat cluster the tech giant tracks as UNC6032, which is assessed to have a Vietnam nexus. The campaign has been active since at least mid-2024.\nThe attack unfolds in this manner: Unsuspecting users who land on these websites are instructed to provide an input prompt to generate a video. However, as previously observed, the input doesn't matter, as the main responsibility of the website is to initiate the download of a Rust-based dropper payload called STARKVEIL.\n\"[STARKVEIL] drops three different modular malware families, primarily designed for information theft and capable of downloading plugins to extend their functionality,\" Mandiant\nsaid\n. \"The presence of multiple, similar payloads suggests a fail-safe mechanism, allowing the attack to persist even if some payloads are detected or blocked by security defences.\"\nThe three malware families are below -\nGRIMPULL, a downloader that uses a TOR tunnel to fetch additional .NET payloads that are decrypted, decompressed, and loaded into memory as .NET assemblies\nFROSTRIFT, a .NET backdoor that collects system information, details about installed applications, and scans for 48 extensions related to password managers, authenticators, and cryptocurrency wallets on Chromium-based web browsers\nXWorm, a known .NET-based remote access trojan (RAT) with features like keylogging, command execution, screen capture, information gathering, and victim notification via Telegram\nSTARKVEIL also serves as a conduit to launch a Python-based dropper codenamed COILHATCH that's actually tasked with running the aforementioned three payloads via DLL side-loading.\n\"These AI tools no longer target just graphic designers; anyone can be lured in by a seemingly harmless ad,\" Mandiant said. \"The temptation to try the latest AI tool can lead to anyone becoming a victim.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "New Windows RAT Evades Detection for Weeks Using Corrupted DOS and PE Headers",
        "Link": "https://thehackernews.com/2025/05/new-windows-rat-evades-detection-for.html",
        "Summary": "Cybersecurity researchers have taken the wraps off an unusual cyber attack that leveraged malware with corrupted DOS and PE headers, according to new findings from Fortinet.\nThe DOS (Disk Operating System) and PE (Portable Executable) headers are essential parts of a Windows PE file, providing information about the executable.\nWhile the DOS header makes the executable file backward compatible",
        "Date": "2025-05-29",
        "Content": "Cybersecurity researchers have taken the wraps off an unusual cyber attack that leveraged malware with corrupted DOS and PE headers, according to\nnew findings\nfrom Fortinet.\nThe DOS (Disk Operating System) and PE (Portable Executable) headers are\nessential parts\nof a\nWindows PE file\n, providing information about the executable.\nWhile the\nDOS header\nmakes the executable file backward compatible with MS-DOS and allows it to be recognized as a valid executable by the operating system, the PE header contains the metadata and information necessary for Windows to load and execute the program.\n\"We discovered malware that had been running on a compromised machine for several weeks,\" researchers Xiaopeng Zhang and John Simmons from the FortiGuard Incident Response Team said in a report shared with The Hacker News. \"The threat actor had executed a batch of scripts and PowerShell to run the malware in a Windows process.\"\nFortinet said while it was unable to extract the malware itself, it acquired a memory dump of the running malware process and a full memory dump of the compromised machine. It's currently not known how the malware is distributed or how widespread the attacks distributing it are.\nThe malware, running within a dllhost.exe process, is a 64-bit PE file with corrupted DOS and PE headers in a bid to challenge analysis efforts and reconstruct the payload from memory.\nDespite these roadblocks, the cybersecurity company further noted that it was able to take apart the dumped malware within a controlled local setting by replicating the compromised system's environment after \"multiple trials, errors, and repeated fixes.\"\nThe malware, once executed, decrypts command-and-control (C2) domain information stored in memory and then establishes contact with the server (\"rushpapers[.]com\") in a newly created threat.\n\"After launching the thread, the main thread enters a sleep state until the communication thread completes its execution,\" the researchers said. \"The malware communicates with the C2 server over the TLS protocol.\"\nFurther analysis has determined the malware to be a remote access trojan (RAT) with capabilities to capture screenshots; enumerate and manipulate the system services on the compromised host; and even act as a server to await incoming \"client\" connections.\n\"It implements a multi-threaded socket architecture: each time a new client (attacker) connects, the malware spawns a new thread to handle the communication,\" Fortinet said. \"This design enables concurrent sessions and supports more complex interactions.\"\n\"By operating in this mode, the malware effectively turns the compromised system into a remote-access platform, allowing the attacker to launch further attacks or perform various actions on behalf of the victim.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "DragonForce Exploits SimpleHelp Flaws to Deploy Ransomware Across Customer Endpoints",
        "Link": "https://thehackernews.com/2025/05/dragonforce-exploits-simplehelp-flaws.html",
        "Summary": "The threat actors behind the DragonForce ransomware gained access to an unnamed Managed Service Provider's (MSP) SimpleHelp remote monitoring and management (RMM) tool, and then leveraged it to exfiltrate data and drop the locker on multiple endpoints.\nIt's believed that the attackers exploited a trio of security flaws in SimpleHelp (CVE-2024-57727, CVE-2024-57728, and CVE-2024-57726) that were",
        "Date": "2025-05-29",
        "Content": "The threat actors behind the DragonForce ransomware gained access to an unnamed Managed Service Provider's (MSP) SimpleHelp remote monitoring and management (RMM) tool, and then leveraged it to exfiltrate data and drop the locker on multiple endpoints.\nIt's believed that the attackers exploited a\ntrio of security flaws\nin SimpleHelp (CVE-2024-57727, CVE-2024-57728, and CVE-2024-57726) that were disclosed in January 2025 to access the MSP's SimpleHelp deployment, according to an\nanalysis\nfrom Sophos.\nThe cybersecurity company said it was alerted to the incident following a suspicious installation of a SimpleHelp installer file, pushed via a legitimate SimpleHelp RMM instance that's hosted and operated by the MSP for their customers.\nThe threat actors have also been found to leverage their access through the MSP's RMM instance to collect information from different customer environments about device names and configuration, users, and network connections.\nAlthough one of the MSP's clients was able to shut down attackers' access to the network, a number of other downstream customers were impacted by data theft and ransomware, eventually paving the way for double-extortion attacks.\nThe MSP supply chain attack sheds light on the evolving tradecraft of a group that has positioned itself as one of the most lucrative options for affiliate actors in the world of cybercrime by offering a favorable profit share.\nDragonForce, in recent months, has\ngained traction\nfor its\nrevamp\nto a ransomware \"cartel\" and its pivot to a novel affiliate branding model that allows other cybercriminals to spawn their own versions of the locker under different names.\nThe emergence of the cartel coincided with the defacements of leak sites operated by BlackLock and Mamona ransomware groups, and what appears to be a \"hostile takeover\" of RansomHub, a prolific e-crime crew that took off post the demise of LockBit and BlackCat last year.\nA string of attacks targeting\nthe U.K. retail sector\nsince late last month has brought more spotlight on the threat actor. The\nattacks\n, per\nBBC\n, have caused affected companies to\nshut down parts of their IT systems\n.\n\"While DragonForce took credit for the extortion and data leak phase, growing evidence suggests that another group -- Scattered Spider -- may have played a foundational role in enabling those attacks,\" Cyberint\nsaid\n. \"Known for its cloud-first, identity-centric intrusion methods, Scattered Spider is emerging as a likely access broker or collaborator within the DragonForce affiliate model.\"\nScattered Spider\n, which itself is part of a larger loose-knit collective known as The Com, has remained something of a mystery despite arrests of alleged members in 2024, lacking visibility into how youngsters from the U.K. and the U.S. are\nrecruited into the criminal network\n.\nThese findings point to a\nvolatile landscape\nwhere ransomware groups are increasingly fragmenting, decentralizing, and battling low affiliate loyalty. Adding to the concern is the growing use of artificial intelligence (\nAI\n) in malware development and campaign scaling.\n\"DragonForce is not just another ransomware brand – it's a destabilizing force trying to reshape the ransomware landscape,\" Aiden Sinnott, senior threat researcher at Sophos Counter Threat Unit, said.\n\"While in the U.K., the group has dominated recent headlines after high-profile attacks on retailers, behind the scenes of the ransomware ecosystem there seems to be some jostling between it and e-crime groups such as RansomHub. As the ecosystem continues to quickly evolve after the takedown of LockBit, this 'turf war' highlights the efforts of this group, in particular, to claim dominance.\"\nLockBit suffered a major operational setback after its infrastructure was dismantled in early 2024 as part of an international law enforcement action called Operation Cronos.\nAlthough the group managed to rebuild and resume its activities to some extent, it was dealt with another blow earlier this month after its dark web affiliate panels were\ndefaced\nto include a link to a\ndatabase dump\ncontaining thousands of negotiation chats, custom builds, and its work on a lower-tier\nLockBit Lite panel\n.\n\"From chat logs and ransomware build records, to affiliate configurations and ransom demands, the data shows LockBit are both well organized and methodical,\" Ontinue\nsaid\nin an exhaustive writeup of the leak. \"Affiliates play a major role in customizing attacks, demanding payment, and negotiating with victims.\"\nThe development comes as attackers from multiple groups, including 3AM ransomware, are\nusing\na combination of\nemail bombing and vishing\nto breach company networks by posing as tech support to deceive employees and social engineer them into granting remote access to their computers using Microsoft Quick Assist.\nThe initial access is then abused to drop additional payloads, including a network tunneling backdoor called\nQDoor\nthat allows the attackers to establish a foothold on the network without attracting any attention. It's worth noting that the backdoor was previously observed in Blacksuit and Lynx ransomware attacks.\nSophos said while the ransomware attack was ultimately thwarted, the attackers managed to steal data and dwell on the network for nine days before attempting to launch the locker,\n\"The combination of vishing and email bombing continues to be a potent, effective combination for ransomware attackers – and the 3AM ransomware group has now found a way to take advantage of remote encryption to stay out of sight of traditional security software,\" Sean Gallagher, principal threat researcher at Sophos, said.\n\"To stay secure, companies should prioritize employee awareness and strictly limit remote access. This includes using policies to block the execution of virtual machines and remote access software on computers that should not have such software. In addition, companies should block all inbound and outbound network traffic associated with remote control except from the systems designated for remote access.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Chinese APT41 Exploits Google Calendar for Malware Command-and-Control Operations",
        "Link": "https://thehackernews.com/2025/05/chinese-apt41-exploits-google-calendar.html",
        "Summary": "Google on Wednesday disclosed that the Chinese state-sponsored threat actor known as APT41 leveraged a malware called TOUGHPROGRESS that uses Google Calendar for command-and-control (C2).\nThe tech giant, which discovered the activity in late October 2024, said the malware was hosted on a compromised government website and was used to target multiple other government entities.\n\"Misuse of cloud",
        "Date": "2025-05-29",
        "Content": "Google on Wednesday disclosed that the Chinese state-sponsored threat actor known as APT41 leveraged a malware called TOUGHPROGRESS that uses Google Calendar for command-and-control (C2).\nThe tech giant, which discovered the activity in late October 2024, said the malware was hosted on a compromised government website and was used to target multiple other government entities.\n\"Misuse of cloud services for C2 is a technique that many threat actors leverage in order to blend in with legitimate activity,\" Google Threat Intelligence Group (GTIG) researcher Patrick Whitsell\nsaid\n.\nAPT41, also tracked as Axiom, Blackfly, Brass Typhoon (formerly Barium), Bronze Atlas, Earth Baku, HOODOO, RedGolf, Red Kelpie, TA415, Wicked Panda, and Winnti, is the name assigned to a prolific nation-state group known for its targeting of governments and organizations within the global shipping and logistics, media and entertainment, technology, and automotive sectors.\nIn July 2024, Google\nrevealed\nthat several entities operating within these industry verticals in Italy, Spain, Taiwan, Thailand, Turkey, and the U.K. were targeted by a \"sustained campaign\" using a combination of web shells and droppers like ANTSWORD, BLUEBEAM, DUSTPAN, and DUSTTRAP.\nThen earlier this year, a sub-cluster within the APT41 umbrella was\nidentified\nas attacking Japanese companies in the manufacturing, materials, and energy sectors in March 2024 as part of a campaign dubbed RevivalStone.\nThe latest attack chain documented by Google involves sending spear-phishing emails containing a link to a ZIP archive that's hosted on the exploited government website. The ZIP file includes a directory and a Windows shortcut (LNK) that masquerades as a PDF document. The directory features what appear to be seven different images of arthropods (from \"1.jpg\" to \"7.jpg\").\nThe infection begins when the LNK file is launched, causing a decoy PDF to be presented to the recipient stating the species pulled from the directory need to be declared for export. However, it's worth noting that \"6.jpg\" and \"7.jpg\" are fake images.\n\"The first file is actually an encrypted payload and is decrypted by the second file, which is a DLL file launched when the target clicks the LNK,\" Whitsell said, adding the malware implements various stealth and evasion techniques, such as memory-only payloads, encryption, compression, and control flow obfuscation.\nThe malware consists of three distinct components, each of which are deployed in series and are designed to carry out a specific function -\nPLUSDROP, the DLL used to decrypt and execute the next-stage in memory\nPLUSINJECT, which launches and performs\nprocess hollowing\non a legitimate \"svchost.exe\" process to inject the final payload\nTOUGHPROGRESS, the primary malware that uses Google Calendar for C2\nThe malware is designed to read and write events with an attacker-controlled Google Calendar, creating a zero-minute event at a hard-coded date (2023-05-30) in order to store the harvested data in the event description.\nThe operators place encrypted commands in Calendar events on July 30 and 31, 2023, which are then polled by the malware, decrypted, executed on the compromised Windows host, and the results written back to another Calendar event from where they can be extracted by the attackers.\nGoogle said it has taken the step of taking down the malicious Google Calendar and terminated the associated Workspace projects, thereby neutralizing the whole campaign. It also said that affected organizations were notified. The exact scale of the campaign is unclear.\nThis is not the first time APT41 has weaponized Google's services to its advantage. In April 2023, Google\ndisclosed\nthat the threat actor targeted an unnamed Taiwanese media organization to deliver a Go-based open-source red teaming tool known as Google Command and Control (GC2) delivered via password-protected files hosted on Google Drive.\nOnce installed, GC2 acts as a backdoor to read commands from Google Sheets and exfiltrate data using the cloud storage service.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Over 100,000 WordPress Sites at Risk from Critical CVSS 10.0 Vulnerability in Wishlist Plugin",
        "Link": "https://thehackernews.com/2025/05/over-100000-wordpress-sites-at-risk.html",
        "Summary": "Cybersecurity researchers have disclosed a critical unpatched security flaw impacting TI WooCommerce Wishlist plugin for WordPress that could be exploited by unauthenticated attackers to upload arbitrary files.\nTI WooCommerce Wishlist, which has over 100,000 active installations, is a tool to allow e-commerce site customers to save their favorite products for later and share the lists on social",
        "Date": "2025-05-29",
        "Content": "Cybersecurity researchers have disclosed a critical unpatched security flaw impacting TI WooCommerce Wishlist plugin for WordPress that could be exploited by unauthenticated attackers to upload arbitrary files.\nTI WooCommerce Wishlist, which has over\n100,000 active installations\n, is a tool to allow e-commerce site customers to save their favorite products for later and share the lists on social media platforms.\n\"The plugin is vulnerable to an arbitrary file upload vulnerability which allows attackers to upload malicious files to the server without authentication,\" Patchstack researcher John Castro\nsaid\n.\nTracked as CVE-2025-47577, the vulnerability carries a CVSS score of 10.0. It affects all versions of the plugin below and including 2.9.2 released on November 29, 2024. There is currently no patch available.\nThe website security company said the issue lies in a function named \"tinvwl_upload_file_wc_fields_factory,\" which, in turn, uses another native WordPress function \"\nwp_handle_upload\n\" to perform the validation, but sets the override parameters \"test_form\" and \"test_type\" to \"false.\"\nThe \"test_type\" override is used to check whether the Multipurpose Internet Mail Extension (MIME) type of the file is as expected, while \"test_form\" is to check to verify if the $_POST['action'] parameter is as expected.\nIn setting \"test_type\" to false, it allows the file type validation to be effectively bypassed, thereby allowing any file type to be uploaded.\nThat having said, the vulnerable function is accessible via tinvwl_meta_wc_fields_factory or tinvwl_cart_meta_wc_fields_factory, which are only available when the WC Fields Factory plugin is active.\nThis also means that successful exploitation is only possible if the WC Fields Factory plugin is installed and activated on the WordPress site and the integration is enabled on the TI WooCommerce Wishlist plugin.\nIn a hypothetical attack scenario, a threat actor could upload a malicious PHP file and achieve remote code execution (RCE) by directly accessing the uploaded file.\nPlugin developers are recommended to remove or avoid setting 'test_type' => false when using wp_handle_upload(). In the absence of a patch, users of the plugin are urged to deactivate and delete it from their sites.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "ConnectWise breached in cyberattack linked to nation-state hackers",
        "Link": "https://www.bleepingcomputer.com/news/security/connectwise-breached-in-cyberattack-linked-to-nation-state-hackers/",
        "Summary": "IT management software firm ConnectWise says a suspected state-sponsored cyberattack breached its environment and impacted a limited number of ScreenConnect customers. [...]",
        "Date": "2025-05-29",
        "Content": "IT management software firm ConnectWise says a suspected state-sponsored cyberattack breached its environment and impacted a limited number of ScreenConnect customers.\n\"ConnectWise recently learned of suspicious activity within our environment that we believe was tied to a sophisticated nation state actor, which affected a very small number of ScreenConnect customers,\" ConnectWise shared in a\nbrief advisory\n.\n\"We have launched an investigation with one of the leading forensic experts, Mandiant. We have contacted all affected customers and are coordinating with law enforcement.\"\nConnectWise is a Florida-based software company that provides IT management, RMM (remote monitoring and management), cybersecurity, and automation solutions for managed service providers (MSPs) and IT departments.\nOne of its products is ScreenConnect, a remote access and support tool that allows technicians to securely connect to client systems for troubleshooting, patching, and system maintenance.\nAs first reported by\nCRN\n, the company now says it has implemented enhanced monitoring and hardened the security across its network.\nThey also state that they have not seen any further suspicious activity in customer instances.\nConnectWise did not answer BleepingComputer's questions about how many customers were impacted, when the breach occurred, or whether any malicious activity was observed in customers' ScreenConnect instances.\nHowever, a source told BleepingComputer that the breach occurred in August 2024, with ConnectWise discovering the supicious activity in May 2025, and that it only impacted cloud-based ScreenConnect instances. BleepingComputer has not been able to independently confirm the breach dates.\nJason Slagle, President of managed service provider CNWR, told BleepingComputer that only a very small number of customers were impacted, suggesting the threat actor carried out a targeted attack against specific organizations.\nIn a\nReddit thread\n, customers shared further details, stating the incident is linked to a ScreenConnect vulnerability tracked as\nCVE-2025-3935\n, patched on April 24.\nThe CVE-2025-3935 flaw is a high-severity ViewState code injection bug caused by unsafe deserialization of ASP.NET ViewState in ScreenConnect versions 25.2.3 and earlier.\nThreat actors with privileged system-level access can steal the secret machine keys used by a ScreenConnect server and utilize them to craft malicious payloads that trigger remote code execution on the server.\nWhile ConnectWise did not state that this vulnerability was exploited at the time, it was marked as \"High\" priority, indicating it was either actively exploited or carried a significant risk of exploitation.\nThe company also stated that the flaw was patched on its cloud-hosted ScreenConnect platforms at \"screenconnect.com\" and \"hostedrmm.com\" before it was publicly disclosed to customers.\nAs the breach only impacted cloud-hosted ScreenConnect instances, it's possible that threat actors first breached ConnectWise's systems and stole the machine keys.\nUsing those keys, attackers could conduct remote code execution on the company's ScreenConnect servers and potentially access customer environments.\nHowever, it should be noted that ConnectWise has not confirmed whether this was how customer's instances were breached.\nCustomers who spoke to BleepingComputer are frustrated by the lack of indicators of compromise (IOCs) and information shared by ConnectWise, leaving them with little information on what happened.\nLast year, a ScreenConnect flaw tracked as CVE-2024-1709 was\nexploited by ransomware gangs\nand a\nNorth Korean APT hacking group\nto run malware.\nBleepingComputer sent additional questions to ConnectWise but has not heard back at this time.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMarks & Spencer faces $402 million profit hit after cyberattack\nHackers behind UK retail attacks now targeting US companies\nCzechia blames China for Ministry of Foreign Affairs cyberattack\nDragonForce ransomware abuses SimpleHelp in MSP supply chain attack\nPowerSchool hacker pleads guilty to student data extortion scheme"
    },
    {
        "Title": "Threat actors abuse Google Apps Script in evasive phishing attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/threat-actors-abuse-google-apps-script-in-evasive-phishing-attacks/",
        "Summary": "Threat actors are abusing the trusted Google platform 'Google Apps Script' to host phishing pages, making them appear legitimate and eliminating the risk of them getting flagged by security tools. [...]",
        "Date": "2025-05-29",
        "Content": "Threat actors are abusing the ‘Google Apps Script’ development platform to host phishing pages that appear legitimate and steal login credentials.\nThis new trend was spotted by security researchers at Cofense, who warn that the fraudulent login window is \"carefully designed to look like a legitimate login screen.\"\n“The attack uses an email masquerading as an invoice, containing a link to a webpage that uses Google Apps Script, a development platform integrated across Google’s suite of products,”\nCofense explains\n.\n“By hosting the phishing page within Google’s trusted environment, attackers create an illusion of authenticity. This makes it easier to trick recipients into handing over sensitive information.”\nLegitimate service abuse\nGoogle Apps Script is a JavaScript-based cloud scripting platform from Google that allows users to automate tasks and extend the functionality of Google Workspace products like Google Sheets, Docs, Drive, Gmail, and Calendar.\nThese scripts run on a trusted Google domain under “script.google.com,” which is on the allowlist of most security products.\nAttackers write a Google Apps Script that displays a fake login page to capture the credentials victims enter. The data is exfiltrated to the attacker’s server via a hidden request.\nPhishing page hosted on Google infrastructure\nSource: Cofense\nAs the platform allows anyone with an account to publish a script as a public web app, giving it a Google domain, the threat actors can easily share it with the victims via a phishing email that won’t trigger any warnings.\nThe phishing email contains an invoice payment or tax-related call to action for the recipient, linking to the malicious Google-hosted phishing page.\nSample of a phishing email used in the attacks\nSource: Cofense\nAfter the victim enters their username and password, they are redirected to the legitimate service that was spoofed to lower suspicion and give threat actors time to exploit the stolen data.\nGoogle Apps Script appears to be the new focus of phishing actors that look for legitimate platforms to abuse for evasion and operational efficiency.\nIn this case, it also gives the attackers the flexibility to remotely adjust their script without having to resend a new link, switching to a different lure without much effort.\nAn effective defense measure would be to configure email security to scrutinize cloud service links and, if possible, block access to Google Apps Script URLs altogether, or at least flag them as potentially dangerous.\nBleepingComputer has contacted Google to ask if they plan to implement any anti-abuse measures in response to Cofense’s findings, but we have not heard back as of publication.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nPhishers abuse Google OAuth to spoof Google in DKIM replay attack\nHackers behind UK retail attacks now targeting US companies\nAPT41 malware abuses Google Calendar for stealthy C2 communication\nGoogle claims users find ads in AI search 'helpful'\nGoogle fixes Android zero-day exploited by Serbian authorities"
    },
    {
        "Title": "Apple Safari exposes users to fullscreen browser-in-the-middle attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/apple-safari-exposes-users-to-fullscreen-browser-in-the-middle-attacks/",
        "Summary": "A weakness in Apple's Safari web browser allows threat actors to leverage the fullscreen browser-in-the-middle (BitM) technique to steal account credentials from unsuspecting users. [...]",
        "Date": "2025-05-29",
        "Content": "A weakness in Apple's Safari web browser allows threat actors to leverage the fullscreen browser-in-the-middle (BitM) technique to steal account credentials from unsuspecting users.\nBy abusing the Fullscreen API, which instructs any content on a webpage to enter the browser's fullscreen viewing mode, hackers can exploit the shortcoming to make guardrails less visible on Chromium-based browsers and trick victims into typing sensitive data in an attacker-controlled window.\nSquareX researchers observed an increase use of this type of malicious activity and say that such attacks are particularly dangerous for Safari users, as Apple’s browser fails to properly alert users when a browser window enters fullscreen mode.\n“SquareX’s research team has observed multiple instances of the browser’s FullScreen API being exploited to address this flaw by displaying a fullscreen BitM window that covers the parent window’s address bar, as well as a limitation specific to Safari browsers that makes fullscreen BitM attacks especially convincing,”\ndescribes the report\n.\nHow BitM works\nA common\nBitM attack\ninvolves tricking users into interacting with an attacker-controlled remote browser that shows a legitimate login page. This is achieved through tools like noVNC - an open-source VNC browser client, which opens a remote browser on top of the victim's session.\nAttacker-controlled browser opens legitimate Steam login page in BitM attack\nSource: SquareX\nSince the log in process happens in the attacker's browser, the credentials are collected but the victim also successfully accesses their account unaware of the theft.\nThe attack still requires tricking the victim into clicking on a malicious link that redirects them to a fake site impersonating the target service. However, this can be easily achieved through sponsored ads in web browsers, social media posts, or comments.\nPromoting fake Figma site through sponsored ads\nSource: SquareX\nFullscreen deception\nIf users miss the suspicious URL in the browser bar and click on the log in button, the BitM window becomes active. Until triggered, the window stayed hidden from the victim in minimized mode.\nIf users miss the suspicious URL in the browser bar and click on the log in button, which activates the BitM window that was hidden from the victim in minimized mode.\nOnce activated, the attacker-controlled browser window enters fullscreen mode and covers the fake website, showing to the user the legitimate website they wanted to access.\nSecurity solutions like EDRs or SASE/SSE won’t trigger any warnings when this happens, as the attack abuses standard browser APIs.\nThe researchers explain that Firefox and Chromium-based browsers (e.g. Chrome and Edge) show an alert whenever fullscreen is active. Although many users may miss the warning, it is still a guardrail that lowers the risk of a BitM attack.\nWarning message for fullscreen mode on Firefox (left) and Chrome (right)\nSource: SquareX\nHowever, on Safari there is no alert and the only sign of a browser entering fullscreen mode is a “swipe” animation that can be easily missed.\n\"While the attack works on all browsers, fullscreen BiTM attacks are particularly convincing on Safari browsers due to the lack of clear visual cues when going fullscreen,\" SquareX researchers say.\nSquareX contacted Apple with its findings and received a “wontfix” reply, the explanation received being that the animation is present to indicate changes, and that should be enough.\nBleepingComputer has also reached out to Apple for a comment, but we are still waiting for their response.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nChrome 136 fixes 20-year browser history privacy risk"
    },
    {
        "Title": "US sanctions firm linked to cyber scams behind $200 million in losses",
        "Link": "https://www.bleepingcomputer.com/news/security/us-sanctions-company-linked-to-hundreds-of-thousands-of-cyber-scam-sites/",
        "Summary": "The U.S. Treasury Department has sanctioned Funnull Technology, a Philippines-based company that supports hundreds of thousands of malicious websites behind cyber scams linked to over $200 million in losses for Americans. [...]",
        "Date": "2025-05-29",
        "Content": "The U.S. Treasury Department has sanctioned Funnull Technology, a Philippines-based company that supports hundreds of thousands of malicious websites behind cyber scams linked to over $200 million in losses for Americans.\nFunnull facilitated virtual currency investment scams (also known as\nromance baiting\nand\npig butchering\n) by buying IP addresses in bulk from various cloud service providers. The company sold these IP addresses and hosting services to cybercriminals, enabling them to host malicious websites.\nCriminals behind pig butchering scams contact victims through dating sites, social media, and messaging apps, building trust and luring victims into fake investment schemes. However, instead of investing, the fraudsters divert it to accounts they control, stealing their money.\nThe company uses domain generation algorithms (DGAs) to generate numerous unique domain names and also provides cybercriminals with web design templates that impersonate trusted brands. It also helps them quickly switch IP addresses and domains to thwart takedown attempts.\n\"Funnull is linked to the majority of virtual currency investment scam websites reported to the FBI. U.S.-based victims of these scam websites have reported over $200 million in losses, with average losses of over $150,000 per individual,\"\nOFAC said\non Thursday.\nThe Treasury's Office of Foreign Assets Control (OFAC) also imposed sanctions on Liu Lizhi, a Chinese national who acted as Funnull's administrator and managed the company's employees, monitoring their performance and task progress.\nFollowing these sanctions, citizens and organizations in the United States are prohibited from conducting transactions with Funnull and Lizhi. All their U.S. assets will also be frozen, while financial institutions and foreign entities involved in transactions with them may also face penalties.\nFunnull indicators of compromise\nToday, the FBI has also published a\nflash alert\nwith more information, including technical details about IP addresses and domains of part of Funnull's cyber scam infrastructure.\n\"Since January 2025, the FBI has identified 548 unique Funnull Canonical Names (CNAME) linked to over 332,000 unique domains. In April 2025, a sample of eight domains were analyzed to depict a CNAME analysis that resolved to four CNAMEs tied to Funnull infrastructure. Between February 2023 and April 2025, the eight domains showed three different patterns of CNAME activity,\" the FBI said.\n\"Between October 2023 and April 2025, multiple patterns of IP address activity were observed from several domains using Funnull infrastructure. During this time frame, hundreds of domains using Funnull infrastructure simultaneously migrated from one IP address to another either on the same exact day or within the same timeframe.\"\nAs the FBI revealed last month, cybercriminals have\nstolen a record $16,6 billion\nfrom Americans in 2024, with over $6.5 billion lost to investment scams, marking a massive increase in losses of over 33% compared to\nthe previous year\n.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nHackers lurked in Treasury OCC’s systems since June 2023 breach\nSix arrested for AI-powered investment scams that stole $20 million\nHackers behind UK retail attacks now targeting US companies\nChinese hackers breach US local governments using Cityworks zero-day\nEuropean Union sanctions Stark Industries for enabling cyberattacks"
    },
    {
        "Title": "Cybercriminals exploit AI hype to spread ransomware, malware",
        "Link": "https://www.bleepingcomputer.com/news/security/cybercriminals-exploit-ai-hype-to-spread-ransomware-malware/",
        "Summary": "Threat actors linked to lesser-known ransomware and malware projects now use AI tools as lures to infect unsuspecting victims with malicious payloads. [...]",
        "Date": "2025-05-29",
        "Content": "Threat actors linked to lesser-known ransomware and malware projects now use AI tools as lures to infect unsuspecting victims with malicious payloads.\nThis development follows a trend that has been growing since last year, starting with\nadvanced threat actors\nusing deepfake content generators to infect victims with malware.\nThese lures have become\nwidely adopted\nby\ninfo-stealer malware\noperators and ransomware operations attempting to breach corporate networks.\nCisco Talos researchers\nhave discovered\nthat the same technique is now followed by smaller ransomware teams known as CyberLock, Lucky_Gh0$t, and a new malware named Numero.\nThe malicious payloads are promoted via SEO poisoning and malvertising to rank them high in search engine results for specific terms.\nAI tool impersonation\nCyberLock is PowerShell-based ransomware delivered through a fake AI tool website (novaleadsai[.]com) posing as the legitimate novaleads.app.\nMalicious website delivering CyberLock ransomware\nSource: Cisco Talos\nVictims are lured by offers of a free 12-month subscription, leading them to download a .NET loader that deploys the ransomware.\nOnce executed on the victim's machine, CyberLock encrypts files across multiple disk partitions, appending the .cyberlock extension on locked files.\nThe ransom note demands a $50,000 ransom to be paid in the hard-to-trace Monero cryptocurrency, claiming that the funds will support humanitarian causes in Palestine, Ukraine, Africa, and Asia.\nSentinelLabs blog used as wallpaper by CyberLock\nSource: Cisco Talos\nLucky_Gh0$t is a new ransomware strain derived from Yashma, which itself is based on the Chaos ransomware.\nCisco analysts observed it being distributed as a fake ChatGPT installer (\"ChatGPT 4.0 full version - Premium.exe\") packaged in a self-extracting archive.\nThe package includes legitimate Microsoft open-source AI tools alongside the ransomware payload, likely to evade antivirus detection.\nIf executed, it encrypts files smaller than 1.2GB, appending random four-character extensions, while larger files are replaced with a same-size junk file and deleted.\nVictims of Lucky_Gh0$t receive a personal ID and are instructed to contact the attacker through the secure messenger platform Session for ransom negotiations and decryption.\nLucky_Gh0$t ransom note\nSource: Cisco Talos\nFinally, a new malware called Numero masquerades as an InVideo AI installer but is designed to attack Windows systems.\nThe malware is delivered in a dropper containing a batch file, VB script, and an executable named wintitle.exe.\nIt executes in an infinite loop, continuously corrupting the victim's graphical user interface by overwriting window titles, buttons, and content with the numeric string \"1234567890.\"\nWindows dialog following a Numero infection\nSource: Cisco Talos\nAlthough no data is destroyed or encrypted by Numero, the malware renders Windows systems it infects completely unusable. At the same time, the infinite loop it runs ensures the system is \"locked\" in this visually corrupted state.\nAs more cybercriminals attempt to take advantage of people's growing interest in AI tools, caution is advised with files downloaded from dubious websites.\nIt would be more prudent to stick to major AI projects instead of experimenting with new tools and source the installers from the official websites instead of following links from promoted results or social media posts.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nResearchers claim ChatGPT o3 bypassed shutdown in controlled test\nLeak suggests xAI is getting ready to ship Grok 3.5\nWindows 11 Notepad gets AI-powered text writing capabilities\nOpenAI plans to combine multiple models into GPT-5\nFake KeePass password manager leads to ESXi ransomware attack"
    },
    {
        "Title": "Attackers are mapping your attack surface—are you?",
        "Link": "https://www.bleepingcomputer.com/news/security/attackers-are-mapping-your-attack-surface-are-you/",
        "Summary": "Attackers are mapping your infrastructure before you even realize what's exposed. Sprocket ASM flips the script — giving you the same recon capabilities they use, plus change detection and actionable insights to close gaps fast. See your attack surface the way hackers do and beat them to it. [...]",
        "Date": "2025-05-29",
        "Content": "Today’s threat landscape, attack surfaces are expanding faster than most security teams can track. Every new cloud asset, exposed API, forgotten subdomain, or misconfigured service becomes an opportunity for an attacker to exploit.\nModern threat actors are leveraging\nAttack Surface Management\n(ASM) to map out your digital footprint before you even realize what’s exposed. Through automated reconnaissance, asset discovery tools, and open-source intelligence, they’re thinking like red teamers, acting like bug bounty hunters, and exploiting gaps in real-time.\nThe good news is you can beat them at their own game.\nThis article explores how\nSprocket Attack Surface Management Tool\nwas built to understand the attacker playbook and reclaim visibility and control over your expanding attack surface.\nSprocket Security CEO, Casey Cammilleri, shares the difference between Sprocket ASM and other tools out there is “Seeing the hacker's perspective and a heavyweight on change detection. What has changed from yesterday and does it impact my security? That's how we've thought about building [Sprocket] ASM.”\nThe Attacker’s Perspective: Mapping Your Attack Surface\nAn attacker’s point of view of ASM mirrors that of a legitimate security professional, with gathering intelligence or discovery. Thanks to publicly available tools and automation, finding exposed assets, overlooked endpoints, and shadow IT is easier than ever for an attacker. Adversaries can quickly assemble a detailed map of your external-facing infrastructure.\nIn the Sprocket Security Red Teamers’ experience, most organizations unintentionally expose more than they realize. Legacy dev environments, abandoned domains, or forgotten SaaS integrations are all low-hanging fruits that attackers love. They can build their own ASM workflows using a combination of open-source tools, like Amass, and custom scripts to automate these findings at scale.\nIf an attacker has a more up-to-date or accurate map of your infrastructure than your own, that’s where the real danger lies.\nUse Case: Broadcom’s VMware ESXi Vulnerability Exploits (2023-2024)\nThreat actors launched mass exploitation campaigns against thousands of internetexposed VMware ESXi servers using known vulnerabilities.\nThese\nflaws were actively exploited in the wild\n, allowing attackers on a virtual machine with administrative privileges to escape the sandbox and execute code on the host system. Despite patches being available, over 37,000 internet-exposed VMware ESXi servers remained vulnerable, highlighting the risks of unpatched, publicly accessible assets.\n“If it’s exposed to the internet, you better treat it like it’s already under attack. Continuously scan your external attack surface as if you’re the attacker. Flag any highvalue assets and then patch, isolate, or remove them. Don’t wait for the headlines. Act as soon as a vulnerability is disclosed before it’s exploited.” - Michael Belton, Head of Service Delivery at Sprocket Security.\nExplore Your Attack Surface Like an Attacker\nAre you ready to see what a hacker would see if they had free reign over your attack surface?\nTake the next step in becoming more secure by creating an account with Sprocket ASM.\nCreate Free Account\nSprocket ASM: Turning Recon into Prevention\nIf attackers can map your infrastructure, then you must do the same only faster, deeper, and continuously. Sprocket ASM Tool was designed to give you the same reconnaissance capabilities attackers rely on, but with context, validation, and continuous monitoring. Instead of manually going through asset inventories or reacting to alerts after the fact, you can use Sprocket ASM to see what attackers see in real time.\nCammilleri’s insights are “If you have ASM, you can spend less time in discovery phases and move straight into testing and validation phases. You will be more efficient and scalable in your offensive testing.”\nSuccessful ASM isn’t just about visibility though. It’s about actionable insights. Many organizations\nmiss key exposures\nbecause they rely too heavily on internal CMDBs or legacy inventories. By the time those systems catch up, attackers may already be exploiting an overlooked dev instance or forgotten S3 bucket.\nThe key to turning recon into prevention? Operationalizing ASM. Integrating it into daily workflows, connecting it with vulnerability management, and ensuring your team acts on exposures with the urgency that an attacker has already discovered them.\nIf you don’t monitor your digital infrastructure from the outside in, someone else will.\nHow to Get Started: Beat the Bad Guys to Your Blind Spots\nSprocket ASM Tool was created by penetration testers who understand attacker behaviors. Defenders need the same perspective and speed as their adversaries to stay secure. This no-cost tool delivers unparalleled visibility into your attack surface and provides insight into the evolving environment.\nBy revealing what attackers can exploit, our tool enables your team to act proactively and mitigate risks before they escalate.\n“It’s the same engine that our red team and testers use in their continuous pentesting practice. You're going to get notifications on new discoveries and changes,” shares Cammilleri, “But then you can seed the ASM with additional assets you own and manage.\nIf there's something that an attacker would be totally blind to on the Internet, you could still feed in that information into the ASM and start tracking it for changes and security issues.”\nAfter creating your free account, you can:\n✓\nDiscover all your exposed assets\n— domains, IP addresses, services, and much more — automatically.\n✓\nCut through the noise\nand focus on what matters most with clear, actionable risk priorities.\n✓\nGain control\nof your security posture with proactive asset discovery and effective management\nWatch our comprehensive\nASM tool demo\nto uncover even more benefits of utilizing Sprocket ASM.\nTake the Offensive: Close Your Gaps\nAttackers aren’t waiting for permission. They’re already scanning, mapping, and exploiting exposed assets. If you’re not looking at your attack surface the way an attacker would, you’re already at a disadvantage. You cannot secure what you don’t know exists.\nUnknown assets, shadow IT, and misconfigured services are the weak links that attackers love to find, and traditional security tools often miss.\nThat’s why visibility is foundational. Use visibility to harden, not harm, by continuously discovering your external attack surface, prioritizing exposure by real-world risk, and closing gaps before adversaries exploit them.\nWith solutions like Sprocket ASM, you can stop playing catch-up and start seeing your infrastructure the way attackers do and that’s how you can beat them.\nSponsored and written by\nSprocket Security\n."
    },
    {
        "Title": "Victoria’s Secret takes down website after security incident",
        "Link": "https://www.bleepingcomputer.com/news/security/victorias-secret-takes-down-website-after-security-incident/",
        "Summary": "Victoria's Secret, the fashion giant, has taken down its website and some store services because of an ongoing security incident [...]",
        "Date": "2025-05-29",
        "Content": "IMAGE:\nROWANLOVESCARS\n(CC BY-SA 4.0)\nFashion giant Victoria's Secret has taken down its website and some store services because of an ongoing security incident.\nVictoria's Secret manages approximately 1,380 retail stores in nearly 70 countries and reported an annual revenue of $6.23 billion for the fiscal year ending February 1, 2025.\nThe company says in a message replacing the website that its Victoria's Secret and PINK stores remain open while operations are being restored.\n\"Valued customer, we identified and are taking steps to address a security incident. We have taken down our website and some in store services as a precaution,\" it\nsays\n. \"Our team is working around the clock to fully restore operations. We appreciate your patience during this process.\"\nWhen asked for more details, a company spokesperson has also told BleepingComputer that Victoria's Secret has hired external experts to investigate the incident's impact. Victoria's Secret has yet to reveal the nature of the incident.\n\"We immediately enacted our response protocols, third-party experts are engaged, and we took down our website and some in store services as a precaution. We are working to quickly and securely restore operations. We continue to serve customers in our Victoria’s Secret and PINK stores,\" BleepingComputer was told.\nHillary Super, the retailer's chief executive officer, also told employees that \"Recovery is going to take awhile,\" in a note sent to employees and seen by\nBloomberg News\n.\nVictoria’s Secret website (BleepingComputer)\n​Two weeks ago, French luxury fashion brand Dior\ndisclosed another cybersecurity incident\nafter unknown attackers accessed data on some Dior Fashion and Accessories customers.\nGerman sportswear giant Adidas also\nrevealed a data breach\nlast week after threat actors who hacked a customer service provider stole some of its customers' data.\nThese incidents follow a series of other attacks\ntargeting retailers\nacross the United Kingdom over the last several months, including\nHarrods\n,\nCo-op\n, and\nMarks & Spencer\n.\nMarks & Spencer is now bracing for a\npotential profit hit of up to £300 million\n(approximately $402 million) after the breach led to widespread sales and operational disruptions.\nAlthough it's unclear whether these attacks are connected, the DragonForce ransomware operation has\nclaimed responsibility\nfor all three incidents. BleepingComputer\nalso discovered\nthat the attackers had employed social engineering tactics associated with the Scattered Spider threat actors.\nLast week, Google warned that Scattered Spider is now also\ntargeting retailers in the United States\nin ransomware and extortion operations.\nUpdate May 29, 09:07 EDT:\nAdded Victoria's Secret statement.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMarks & Spencer faces $402 million profit hit after cyberattack\nHackers behind UK retail attacks now targeting US companies\nHackers exploit OttoKit WordPress plugin flaw to add admin accounts\nCo-op confirms data theft after DragonForce ransomware claims attack\nWordPress plugin disguised as a security tool injects backdoor"
    },
    {
        "Title": "Microsoft: Windows 11 might fail to start after installing KB5058405",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-11-might-fail-to-start-after-installing-kb5058405/",
        "Summary": "Microsoft has confirmed that some Windows 11 systems might fail to start after installing the KB5058405 security update released during this month's Patch Tuesday. [...]",
        "Date": "2025-05-29",
        "Content": "Microsoft has confirmed that some Windows 11 systems might fail to start after installing the KB5058405 cumulative update released during this month's Patch Tuesday.\nOn affected devices, users see 0xc0000098 recovery errors in ACPI.sys, warning that the device has to be repaired because the operating system couldn't be loaded.\nACPI.sys is the Windows Advanced Configuration and Power Interface (ACPI) driver, a kernel-mode driver critical for power management and device configuration on Windows with an ACPI BIOS.\n\"We are investigating reports of the May 13, 2025 Windows security update (KB5058405) failing to install on some Windows 11, version 22H2 and 23H2 devices,\" the company\nsaid\nin a Wednesday update to the Windows release health dashboard.\n\"Your PC/Device needs to be repaired. The operating system couldn't be loaded because a required file is missing or contains errors,\" the error warns.\nThis known issue impacts Windows 11 22H2/23H2 systems in enterprise environments and mainly affects Azure Virtual Machines, Azure Virtual Desktop, and on-premises virtual machines hosted on Citrix or Hyper-V.\nRecovery screen with 0xc0000098 ACPI.sys error (\nMain-Apartment8743\n)\n​Microsoft added that home users of Windows Home or Pro editions are unlikely to face these problems because the impacted virtual machines are mostly used in IT environments.\nRedmond is investigating this issue and said its engineers will provide more information when it's available.\nEarlier this month, the company fixed another known issue\nblocking Windows 11 24H2 feature updates\nvia Windows Server Update Services (WSUS) after installing the April 2025 security updates.\nPreviously, it shipped emergency out-of-band updates to\nmitigate a Windows 10 bug\nthat forced affected PCs into BitLocker recovery after installing the May 2025 security updates.\nIn April, Microsoft also addressed what it described as a \"latent code issue\"\ncausing some devices to be upgraded to Windows 11\nautomatically despite Intune policies that should block Windows 11 upgrades.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nWindows Server emergency update fixes Hyper-V VM freezes, restart issues\nMicrosoft adds hotpatching support to Windows 11 Enterprise\nMicrosoft fixes Linux boot issues on dual-boot Windows systems\nMicrosoft May 2025 Patch Tuesday fixes 5 exploited zero-days, 72 flaws\nWindows 11 upgrade block lifted after Safe Exam Browser fix"
    },
    {
        "Title": "Data broker LexisNexis discloses data breach affecting 364,000 people",
        "Link": "https://www.bleepingcomputer.com/news/security/data-broker-lexisnexis-discloses-data-breach-affecting-364-000-people/",
        "Summary": "Data broker giant LexisNexis Risk Solutions has revealed that unknown attackers stole the personal information of over 364,000 individuals in a December breach. [...]",
        "Date": "2025-05-29",
        "Content": "Data broker giant LexisNexis Risk Solutions, a Georgia-based American data analytics company, has revealed that attackers stole the personal information of over 364,000 individuals in a December breach.\nAs disclosed in data breach notifications sent to affected people starting May 24th, LexisNexis was informed on April 1st that some of its data had been stolen from GitHub by an unknown threat actor using a compromised company account.\n\"On April 1, 2025, we learned that on December 25, 2024, an unauthorized third party acquired certain LNRS data from a third-party platform used for software development. The issue did not affect LNRS's own networks or systems,\" the notification letters said.\n\"Our Information Security team, in consultation with a forensic firm, immediately began investigating and confirmed that some data which was held in GitHub, a third-party platform used by LNRS for software development purposes was acquired by an unknown third party. Specifically, we have determined that some software artifacts as well as some personal information was accessed,\" a LexisNexis spokesperson told BleepingComputer.\nThe data broker also\ndisclosed\nin a filing with the Maine Attorney General's Office that the resulting data breach impacted 364,333 individuals who had their personally identifiable information exposed.\nHowever, it said the breach only affected their personal information, as the attackers didn't access or steal financial information.\n\"The personal information involved was limited to name, contact information (such as phone number, postal or email address), Social Security number, driver’s license number or date of birth,\" the spokesperson also told BleepingComputer. \"No financial, credit card, or other sensitive personal information was accessed. There was no compromise of our own systems, infrastructure, or products.\"\nThe company warned affected individuals to monitor their account statements and credit reports for fraud and identity theft attempts, and will provide them with two years of free identity protection and credit monitoring services.\nLexisNexis is a subsidiary of RELX, a British multinational data analytics provider, and it has customers in over 180 countries and territories.\nThe data broker also has offices in 40 countries, employs over 11,800 people worldwide, and works with 85% of Fortune 500 companies and 91% of the Fortune 100, including nine of the world's top 10 banks.\nUpdate May 29, 07:39 EDT:\nAdded LexisNexis statement.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nAdidas warns of data breach after customer service provider hack\nAscension says recent data breach affects over 430,000 patients\nBaltimore City Public Schools data breach affects over 31,000 people\nAustralian pension funds hit by wave of credential stuffing attacks\nOracle privately confirms Cloud breach to customers"
    },
    {
        "Title": "Victoria's Secret Goes Offline After 'Incident' Claims",
        "Link": "https://www.darkreading.com/endpoint-security/victoria-secret-website-security-incident",
        "Summary": "The lingerie retailer isn't revealing much about the security incident it's dealing with but has brought in third-party experts to address the issue.",
        "Date": "2025-05-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/victoria-secret-website-security-incident"
    },
    {
        "Title": "New Botnet Plants Persistent Backdoors in ASUS Routers",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/botnet-persistent-backdoors-asus-routers",
        "Summary": "Thousands of ASUS routers have been infected and are believed to be part of a wide-ranging ORB network affecting devices from Linksys, D-Link, QNAP, and Araknis Network.",
        "Date": "2025-05-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/botnet-persistent-backdoors-asus-routers"
    },
    {
        "Title": "SentinelOne Reports Services Are Back Online After Global Outage",
        "Link": "https://www.darkreading.com/endpoint-security/sentinelone-reports-services-back-online-after-global-outage",
        "Summary": "The outage reportedly hit 10 commercial customer consoles for SentinelOne's Singularity platform, including Singularity Endpoint, XDR, Cloud Security, Identity, Data Lake, RemoteOps, and more.",
        "Date": "2025-05-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/sentinelone-reports-services-back-online-after-global-outage"
    },
    {
        "Title": "Zscaler's Buyout of Red Canary Shows Telemetry's Value",
        "Link": "https://www.darkreading.com/cybersecurity-operations/zscaler-buyout-red-canary-telemetrys-value",
        "Summary": "Red Canary's MDR portfolio complements Zscaler's purchase last year of Israeli startup Avalor, which automates collection, curation, and enrichment of security data.",
        "Date": "2025-05-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/zscaler-buyout-red-canary-telemetrys-value"
    },
    {
        "Title": "APT41 Uses Google Calendar Events for C2",
        "Link": "https://www.darkreading.com/threat-intelligence/apt41-uses-google-calendar-events-c2",
        "Summary": "APT41, a Chinese state-sponsored threat actor also known as &quot;Double Dragon,&quot; used Google Calendar as command-and-control infrastructure during a campaign last fall.",
        "Date": "2025-05-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/apt41-uses-google-calendar-events-c2"
    },
    {
        "Title": "PumaBot Targets Linux Devices in Latest Botnet Campaign",
        "Link": "https://www.darkreading.com/threat-intelligence/pumabot-targets-linux-devices-botnet-campaign",
        "Summary": "While the botnet may not be completely automated, it uses certain tactics when targeting devices that indicate that it may, at the very least, be semiautomated.",
        "Date": "2025-05-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/pumabot-targets-linux-devices-botnet-campaign"
    },
    {
        "Title": "LexisNexis Informs 360K+ Customers of Third-Party Data Leak",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/lexisnexis-360k-customers-third-party-data-leak",
        "Summary": "While the leak affected customer data, LexisNexis said in a notification letter that its products and systems were not compromised.",
        "Date": "2025-05-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/lexisnexis-360k-customers-third-party-data-leak"
    },
    {
        "Title": "A Defense-in-Depth Approach for the Modern Era",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/defense-depth-approach-modern-era",
        "Summary": "By integrating intelligent network policies, zero-trust principles, and AI-driven insights, enterprises can create a robust defense against the next generation of cyber threats.",
        "Date": "2025-05-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/defense-depth-approach-modern-era"
    },
    {
        "Title": "'Haozi' Gang Sells Turnkey Phishing Tools to Amateurs",
        "Link": "https://www.darkreading.com/threat-intelligence/haozi-gang-sells-turnkey-phishing-tools-amateurs",
        "Summary": "The phishing operation is using Telegram groups to sell a phishing-as-a-service kit with customer service, a mascot, and infrastructure that requires little technical knowledge to install.",
        "Date": "2025-05-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/haozi-gang-sells-turnkey-phishing-tools-amateurs"
    },
    {
        "Title": "Chinese Hacking Group ‘Earth Lamia’ Targets Multiple Industries",
        "Link": "https://www.securityweek.com/chinese-hacking-group-earth-lamia-targets-multiple-industries/",
        "Summary": "<p>Active since at least 2023, the hacking group has been targeting the financial, government, IT, logistics, retail, and education sectors.</p>\n<p>The post <a href=\"https://www.securityweek.com/chinese-hacking-group-earth-lamia-targets-multiple-industries/\">Chinese Hacking Group &#8216;Earth Lamia&#8217; Targets Multiple Industries</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chinese-hacking-group-earth-lamia-targets-multiple-industries/"
    },
    {
        "Title": "Unbound Raises $4 Million to Secure Gen-AI Adoption",
        "Link": "https://www.securityweek.com/unbound-raises-4-million-to-secure-gen-ai-adoption/",
        "Summary": "<p>Security startup Unbound has raised $4 million in funding to help organizations adopt generative-AI tools securely and responsibly.</p>\n<p>The post <a href=\"https://www.securityweek.com/unbound-raises-4-million-to-secure-gen-ai-adoption/\">Unbound Raises $4 Million to Secure Gen-AI Adoption</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/unbound-raises-4-million-to-secure-gen-ai-adoption/"
    },
    {
        "Title": "GreyNoise Flags 9,000 ASUS Routers Backdoored Via Patched Vulnerability",
        "Link": "https://www.securityweek.com/greynoise-flags-9000-asus-routers-backdoored-via-patched-vulnerability/",
        "Summary": "<p>Professional hackers have built a network of ASUS routers that can survive firmware upgrades, factory reboots and most anti-malware scans.</p>\n<p>The post <a href=\"https://www.securityweek.com/greynoise-flags-9000-asus-routers-backdoored-via-patched-vulnerability/\">GreyNoise Flags 9,000 ASUS Routers Backdoored Via Patched Vulnerability</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/greynoise-flags-9000-asus-routers-backdoored-via-patched-vulnerability/"
    },
    {
        "Title": "Victoria’s Secret Website Taken Offline After Cyberattack",
        "Link": "https://www.securityweek.com/victorias-secret-website-taken-offline-after-cyberattack/",
        "Summary": "<p>Website remains offline following suspected cyber incident, as experts warn of escalating threats targeting major retailers</p>\n<p>The post <a href=\"https://www.securityweek.com/victorias-secret-website-taken-offline-after-cyberattack/\">Victoria’s Secret Website Taken Offline After Cyberattack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/victorias-secret-website-taken-offline-after-cyberattack/"
    },
    {
        "Title": "Adidas Data Breach Linked to Third-Party Vendor",
        "Link": "https://www.securityweek.com/adidas-data-breach-linked-to-third-party-vendor/",
        "Summary": "<p>Adidas said hackers accessed a “third-party customer service provider” and stole  customer information.</p>\n<p>The post <a href=\"https://www.securityweek.com/adidas-data-breach-linked-to-third-party-vendor/\">Adidas Data Breach Linked to Third-Party Vendor</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/adidas-data-breach-linked-to-third-party-vendor/"
    },
    {
        "Title": "Webinar Today: Why Context is a Secret Weapon in Application Security Posture Management",
        "Link": "https://www.securityweek.com/webinar-today-why-context-is-a-secret-weapon-in-application-security-posture-management/",
        "Summary": "<p>Join the live webinar to understand why data in itself is not enough to make informed decisions for prioritization.</p>\n<p>The post <a href=\"https://www.securityweek.com/webinar-today-why-context-is-a-secret-weapon-in-application-security-posture-management/\">Webinar Today: Why Context is a Secret Weapon in Application Security Posture Management</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/webinar-today-why-context-is-a-secret-weapon-in-application-security-posture-management/"
    },
    {
        "Title": "Beyond GenAI: Why Agentic AI Was the Real Conversation at RSA 2025",
        "Link": "https://www.securityweek.com/beyond-genai-why-agentic-ai-was-the-real-conversation-at-rsa-2025/",
        "Summary": "<p>Agentic AI can be a great tool for many of the ‘gray area’ tasks that SOC analysts undertake.</p>\n<p>The post <a href=\"https://www.securityweek.com/beyond-genai-why-agentic-ai-was-the-real-conversation-at-rsa-2025/\">Beyond GenAI: Why Agentic AI Was the Real Conversation at RSA 2025</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-29",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/beyond-genai-why-agentic-ai-was-the-real-conversation-at-rsa-2025/"
    },
    {
        "Title": "Alliance Healthcare Italy Allegedly Targeted by Ransomware Attack",
        "Link": "https://dailydarkweb.net/alliance-healthcare-italy-allegedly-targeted-by-ransomware-attack/",
        "Summary": "Alliance Healthcare Italy, the Italian operations of the major pharmaceutical distributor, has allegedly fallen victim to a ransomware attack by a group known as Datacarry. The breach appears to involve the exfiltration of sensitive company data, potentially impacting these key European operations and data security for the firm and its clients. Alliance Healthcare is a [&#8230;]",
        "Date": "2025-05-29",
        "Content": "Alliance Healthcare Italy, the Italian operations of the major pharmaceutical distributor, has allegedly fallen victim to a ransomware attack by a group known as Datacarry. The breach appears to involve the exfiltration of sensitive company data, potentially impacting these key European operations and data security for the firm and its clients. Alliance Healthcare is a significant entity within the healthcare supply chain, providing critical services to pharmacies and pharmaceutical companies in the region.\nEvidence of the alleged attack includes images displaying a list of compromised files. These files seemingly contain a wide array of sensitive information, suggesting a deep intrusion into the company’s Italian-based systems and access to various internal records. The types of data allegedly compromised include:\nHuman resources documents, such as CVs and identification records\nCritical financial data, including budget spreadsheets and performance scorecards\nCustomer databases\nConfidential PDF documents apparently related to corporate acquisitions and pharmacy operations\nThe potential compromise of financial, personal, and operational data as a result of such an incident poses a significant risk to Alliance Healthcare’s Italian operations and its stakeholders.\nTags:\nalliance\nAlliance Healthcare\ncyber-attack\nCyberSecurity\ndata-breach\nDatacarry\nItaly\nransomware"
    },
    {
        "Title": "Over 200,000 Customers of French Dealership Auto-ici Allegedly Exposed in Data Breach",
        "Link": "https://dailydarkweb.net/over-200000-customers-of-french-dealership-auto-ici-allegedly-exposed-in-data-breach/",
        "Summary": "A significant database, allegedly belonging to the French car agency and dealership Auto-ici, has reportedly surfaced for sale on a dark web forum. The post claims the database contains sensitive information pertaining to 202,864 customers of the French company. Auto-ici operates as a car agency and dealership within France, handling vehicle sales and related customer [&#8230;]",
        "Date": "2025-05-29",
        "Content": "A significant database, allegedly belonging to the French car agency and dealership Auto-ici, has reportedly surfaced for sale on a dark web forum. The post claims the database contains sensitive information pertaining to 202,864 customers of the French company. Auto-ici operates as a car agency and dealership within France, handling vehicle sales and related customer services.\nThe compromised data allegedly includes a wide array of personally identifiable information (PII). Samples provided by the seller indicate the following details are part of the dataset:\nAccount ID\nGender\nFirst name\nMaiden name\nLast name\nPhone numbers\nEmail addresses\nPhysical addresses (including postcode and city)\nThe availability of such comprehensive PII could expose affected Auto-ici customers to various risks, including identity theft, phishing campaigns, and other fraudulent activities. The data is reportedly being offered for sale, with the seller open to offers in cryptocurrency.\nTags:\nalleged data leak\nAuto-ici\nautomotive industry\ncustomer-data\nCyberSecurity\ndata-breach\nFrance\nPII"
    },
    {
        "Title": "Infinox Allegedly Targeted in Ransomware Attack by Arkana Group",
        "Link": "https://dailydarkweb.net/infinox-allegedly-targeted-in-ransomware-attack-by-arkana-group/",
        "Summary": "Global online brokerage firm Infinox has allegedly become the latest victim of a ransomware attack, with the Arkana ransomware group claiming responsibility. Infinox, a significant player in the financial sector with an estimated revenue of $650 million, offers CFD and FX trading to a worldwide clientele and is known for its partnership with the Alpine [&#8230;]",
        "Date": "2025-05-29",
        "Content": "Global online brokerage firm Infinox has allegedly become the latest victim of a ransomware attack, with the Arkana ransomware group claiming responsibility. Infinox, a significant player in the financial sector with an estimated revenue of $650 million, offers CFD and FX trading to a worldwide clientele and is known for its partnership with the Alpine F1 Team. The attackers claim to have exfiltrated a substantial amount of sensitive data.\nThe ransomware group alleges to have accessed and stolen approximately 50GB of data. This reportedly includes Know Your Customer (KYC) information for over 202,000 submissions and details pertaining to more than 163,000 customers. The compromised data allegedly consists of highly sensitive personal identifiable information (PII) such as full names, dates of birth, document numbers, images of IDs, driver’s licenses, and passports, along with metadata and server logs containing IP addresses and user agents.\nThis alleged breach poses a significant threat to Infinox’s clients, potentially exposing them to identity theft and financial fraud. The incident also raises concerns about the security measures in place at the brokerage firm, especially given its prominent position in the financial industry and its recent fine by the UK’s Financial Conduct Authority (FCA) for reporting failures. The Arkana group has started a countdown for the payment of a ransom.\nTags:\nAlleged Attack\nArkana\nCyberSecurity\ndata-breach\nFinancial Services\nInfinox\nPII Leak\nransomware"
    },
    {
        "Title": "9 Million FWD Vietnam Insurance Records Allegedly Exposed",
        "Link": "https://dailydarkweb.net/9-million-fwd-vietnam-insurance-records-allegedly-exposed7518-2/",
        "Summary": "&#160; FWD Group Holdings Limited, a prominent pan-Asian life insurance company, has allegedly become the target of a data breach. A dark web posting claims to possess data from 2025 related to Vietnamese insurance policies, with a sample provided that appears to contain personal information. The alleged breach specifically points to FWD Vietnam, a significant [&#8230;]",
        "Date": "2025-05-29",
        "Content": "FWD Group Holdings Limited, a prominent pan-Asian life insurance company, has allegedly become the target of a data breach. A dark web posting claims to possess data from 2025 related to Vietnamese insurance policies, with a sample provided that appears to contain personal information.\nThe alleged breach specifically points to FWD Vietnam, a significant player in the Vietnamese insurance market. FWD Group, headquartered in Hong Kong, operates across 10 markets in Asia, offering life and medical insurance, general insurance, and employee benefits. The company serves millions of customers and is recognized as a rapidly growing insurer in the region. The listing explicitly states that the data is not sold in smaller pieces.\nThe sample data, as observed, allegedly includes:\nFull Name\nID Number\nDate of Birth\nGender\nPhone Number\nAddress\nCompany/Organization Name\nLocation/Region\nTags:\ncyberattack\nCyberSecurity\ndata-breach\nFWD\nFWD Vietnam\nInsurance\nVietnam"
    },
    {
        "Title": "Alleged Data Breach Affects Estonian Logistics Tracking Website tymap.app",
        "Link": "https://dailydarkweb.net/alleged-data-breach-affects-estonian-logistics-tracking-website-tymap-app/",
        "Summary": "An alleged data breach has reportedly impacted tymap.app, an Estonian logistics tracking website, with sensitive user information appearing online. The exposed data, originating from a platform crucial for efficient supply chain management, includes email addresses, full names, and hashed passwords. This alleged exposure of credentials raises serious concerns for users, particularly if individuals have reused [&#8230;]",
        "Date": "2025-05-29",
        "Content": "An alleged data breach has reportedly impacted tymap.app, an Estonian logistics tracking website, with sensitive user information appearing online. The exposed data, originating from a platform crucial for efficient supply chain management, includes email addresses, full names, and hashed passwords. This alleged exposure of credentials raises serious concerns for users, particularly if individuals have reused their login information across different online services. Estonian authorities and cybersecurity experts are expected to investigate the full scope of this incident. Users of tymap.app are strongly advised to immediately change their passwords and activate two-factor authentication on all their online accounts where available.\nTags:\ncyberattack\ndata-breach\nEstonia\nLogistics\nPersonal Data\ntymap.app"
    },
    {
        "Title": "Indonesia’s National University Admissions Body (SNPMB) Allegedly Suffers Major Data Breach",
        "Link": "https://dailydarkweb.net/indonesias-national-university-admissions-body-snpmb-allegedly-suffers-major-data-breach/",
        "Summary": "Indonesia&#8217;s national body responsible for new student admissions into state universities, the SNPMB (Seleksi Nasional Penerimaan Mahasiswa Baru), has allegedly become the victim of a significant data breach. A post has appeared on a dark web forum claiming to offer the student database from 2024. The SNPMB is a critical institution within Indonesia&#8217;s education sector, [&#8230;]",
        "Date": "2025-05-29",
        "Content": "Indonesia’s national body responsible for new student admissions into state universities, the SNPMB (Seleksi Nasional Penerimaan Mahasiswa Baru), has allegedly become the victim of a significant data breach. A post has appeared on a dark web forum claiming to offer the student database from 2024.\nThe SNPMB is a critical institution within Indonesia’s education sector, handling the centralized selection process for students entering public higher education institutions. It manages a vast amount of sensitive personal information for high school graduates across the nation.\nThe alleged breach was announced via a post on an online forum known for trading illicit data. The individual behind the post claimed to possess a database containing sensitive details of students. Screenshots shared as proof allegedly show samples of the data, including:\nFull names\nNational Student Identification Numbers (NISN)\nNational School Identification Numbers (NPSN)\nNational Identity Numbers (NIK)\nThe sample format also suggests that email addresses might be part of the compromised dataset. The actor accompanied the alleged leak with a message criticizing the Indonesian education system.\nIf confirmed, this breach represents a serious threat to the privacy and security of thousands, potentially hundreds of thousands, of Indonesian students. The inclusion of NIK numbers is particularly alarming, as these can be exploited for a wide range of fraudulent activities, including identity theft, loan applications, and targeted phishing scams.\nTags:\ndata-breach\nEducation\nIndonesia\nPII\nSeleksi Nasional Penerimaan Mahasiswa Baru\nSNPMB\nstudent data"
    }
]