[
    {
        "Title": "Chinese Hackers Exploit Trimble Cityworks Flaw to Infiltrate U.S. Government Networks",
        "Link": "https://thehackernews.com/2025/05/chinese-hackers-exploit-trimble.html",
        "Summary": "A Chinese-speaking threat actor tracked as UAT-6382 has been linked to the exploitation of a now-patched remote-code-execution vulnerability in Trimble Cityworks to deliver Cobalt Strike and VShell.\n\"UAT-6382 successfully exploited CVE-2025-0944, conducted reconnaissance, and rapidly deployed a variety of web shells and custom-made malware to maintain long-term access,\" Cisco Talos researchers",
        "Date": "2025-05-22",
        "Content": "A Chinese-speaking threat actor tracked as\nUAT-6382\nhas been linked to the exploitation of a now-patched remote-code-execution vulnerability in Trimble Cityworks to deliver Cobalt Strike and VShell.\n\"UAT-6382 successfully exploited CVE-2025-0944, conducted reconnaissance, and rapidly deployed a variety of web shells and custom-made malware to maintain long-term access,\" Cisco Talos researchers Asheer Malhotra and Brandon White\nsaid\nin an analysis published today. \"Upon gaining access, UAT-6382 expressed a clear interest in pivoting to systems related to utility management.\"\nThe network security company said it observed the attacks targeting enterprise networks of local governing bodies in the United States starting January 2025.\nCVE-2025-0944 (CVSS score: 8.6)\nrefers\nto the deserialization of untrusted data vulnerability affecting the GIS-centric asset management software that could enable remote code execution. The vulnerability, since patched, was added to the Known Exploited Vulnerabilities (KEV) catalog by the U.S. Cybersecurity and Infrastructure Security Agency (CISA) in February 2025.\nAccording to indicators of compromise (IoCs) released by Trimble, the vulnerability has been exploited to deliver a Rust-based loader that launches Cobalt Strike and a Go-based remote access tool named\nVShell\nin an attempt to maintain long-term access to infected systems.\nCisco Talos, which is tracking the Rust-based loader as TetraLoader, said it's built using MaLoader, a publicly available malware-building framework written in Simplified Chinese.\nSuccessful exploitation of the vulnerable Cityworks application results in the threat actors conducting preliminary reconnaissance to identify and fingerprint the server, and then dropping web shells like\nAntSword\n, chinatso/\nChopper\n, and\nBehinder\nthat are widely put to use by Chinese hacking groups.\n\"UAT-6382 enumerated multiple directories on servers of interest to identify files of interest to them and then staged them in directories where they had deployed web shells for easy exfiltration,\" the researchers said. \"UAT-6382 downloaded and deployed multiple backdoors on compromised systems via PowerShell.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Critical Windows Server 2025 dMSA Vulnerability Enables Active Directory Compromise",
        "Link": "https://thehackernews.com/2025/05/critical-windows-server-2025-dmsa.html",
        "Summary": "A privilege escalation flaw has been demonstrated in Windows Server 2025 that makes it possible for attackers to compromise any user in Active Directory (AD).\n\"The attack exploits the delegated Managed Service Account (dMSA) feature that was introduced in Windows Server 2025, works with the default configuration, and is trivial to implement,\" Akamai security researcher Yuval Gordon said in a",
        "Date": "2025-05-22",
        "Content": "A privilege escalation flaw has been demonstrated in Windows Server 2025 that makes it possible for attackers to compromise any user in Active Directory (AD).\n\"The attack exploits the delegated Managed Service Account (dMSA) feature that was introduced in Windows Server 2025, works with the default configuration, and is trivial to implement,\" Akamai security researcher Yuval Gordon\nsaid\nin a report shared with The Hacker News.\n\"This issue likely affects most organizations that rely on AD. In 91% of the environments we examined, we found users outside the domain admins group that had the required permissions to perform this attack.\"\nWhat makes the attack pathway notable is that it leverages a new feature called Delegated Managed Service Accounts (\ndMSA\n) that allows migration from an existing legacy service account. It was introduced in Windows Server 2025 as a mitigation to\nKerberoasting\nattacks.\nThe attack technique has been codenamed\nBadSuccessor\nby the web infrastructure and security company.\n\"dMSA allows users to create them as a standalone account, or to replace an existing standard service account,\" Microsoft notes in its documentation. \"When a dMSA supersedes an existing account, authentication to that existing account using its password is blocked.\"\n\"The request is redirected to the Local Security Authority (LSA) to authenticate using dMSA, which has access to everything the previous account could access in AD. During migration, dMSA automatically learns the devices on which the service account is to be used which is then used to move from all existing service accounts.\"\nThe problem identified by Akamai is that during the dMSA\nKerberos\nauthentication phase, the Privilege Attribute Certificate (PAC) embedded into a ticket-granting ticket (i.e., credentials used to verify identity) issued by a key distribution center (KDC) includes both the dMSAs security identifier (\nSID\n) as well as the SIDs of the superseded service account and of all its associated groups.\nThis permissions transfer between accounts could open the door to a potential privilege escalation scenario by simulating the dMSA migration process to compromise any user, including domain administrators, and gain similar privileges, effectively breaching the entire domain even if an organization's Windows Server 2025 domain isn't using dMSAs at all.\n\"One interesting fact about this 'simulated migration' technique, is that it doesn't require any permissions over the superseded account,\" Gordon said. \"The only requirement is to write permissions over the attributes of a dMSA. Any dMSA.\"\n\"Once we've marked a dMSA as preceded by a user, the KDC automatically assumes a legitimate migration took place and happily grants our dMSA every single permission that the original user had, as though we are its rightful successor.\"\nAkamai said it reported the findings to Microsoft on April 1, 2025, following which the tech giant classified the issue as moderate in severity and that it does not meet the bar for immediate servicing due to the fact that successful exploitation requires an attacker to have specific permissions on the dMSA object, which suggests an elevation of privileges. However, a patch is currently in the works.\nGiven that there is no immediate fix for the attack, organizations are advised to limit the ability to create dMSAs and harden permissions wherever possible. Akamai has also\nreleased\na PowerShell script that can enumerate all non-default principals who can create dMSAs and list the organizational units (OUs) in which each principal has this permission.\n\"This vulnerability introduces a previously unknown and high-impact abuse path that makes it possible for any user with CreateChild permissions on an OU to compromise any user in the domain and gain similar power to the Replicating Directory Changes privilege used to perform DCSync attacks,\" Gordon said.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Chinese Hackers Exploit Ivanti EPMM Bugs in Global Enterprise Network Attacks",
        "Link": "https://thehackernews.com/2025/05/chinese-hackers-exploit-ivanti-epmm.html",
        "Summary": "A recently patched pair of security flaws affecting Ivanti Endpoint Manager Mobile (EPMM) software has been exploited by a China-nexus threat actor to target a wide range of sectors across Europe, North America, and the Asia-Pacific region.\nThe vulnerabilities, tracked as CVE-2025-4427 (CVSS score: 5.3) and CVE-2025-4428 (CVSS score: 7.2), could be chained to execute arbitrary code on a",
        "Date": "2025-05-22",
        "Content": "A recently patched\npair of security flaws\naffecting Ivanti Endpoint Manager Mobile (EPMM) software has been exploited by a China-nexus threat actor to target a wide range of sectors across Europe, North America, and the Asia-Pacific region.\nThe vulnerabilities, tracked as CVE-2025-4427 (CVSS score: 5.3) and CVE-2025-4428 (CVSS score: 7.2), could be chained to execute arbitrary code on a vulnerable device without requiring any authentication. They were addressed by Ivanti last week.\nNow, according to a report from EclecticIQ, the vulnerability chain has been abused by\nUNC5221\n, a Chinese cyber espionage group\nknown\nfor its targeting of edge network appliances since at least 2023. Most recently, the hacking crew was also\nattributed\nto exploitation efforts targeting SAP NetWeaver instances susceptible to CVE-2025-31324.\nThe Dutch cybersecurity company said the earliest exploitation activity dates back to May 15, 2025, with the attacks targeting healthcare, telecommunications, aviation, municipal government, finance, and defense sectors.\n\"UNC5221 demonstrates a deep understanding of EPMM's internal architecture, repurposing legitimate system components for covert data exfiltration,\" security researcher Arda Büyükkaya\nsaid\n. \"Given EPMM's role in managing and pushing configurations to enterprise mobile devices, a successful exploitation could allow threat actors to remotely access, manipulate, or compromise thousands of managed devices across an organization.\"\nThe attack sequence involves targeting the \"/mifs/rs/api/v2/\" endpoint to obtain an interactive reverse shell and remotely execute arbitrary commands on Ivanti EPMM deployments. This is followed by the deployment of KrustyLoader, a known Rust-based loader attributed to UNC5221 that enables the delivery of additional payloads like Sliver.\nThe threat actors have also been observed targeting the mifs database by making use of hard-coded MySQL database credentials stored in /mi/files/system/.mifpp to obtain unauthorized access to the database and exfiltrating sensitive data that could grant them visibility into managed mobile devices, LDAP users, and Office 365 refresh and access tokens.\nFurthermore, the incidents are characterized by the use of obfuscated shell commands for host reconnaissance before dropping KrustyLoader from an AWS S3 bucket and Fast Reverse Proxy (FRP) to facilitate network reconnaissance and lateral movement. It's worth mentioning here that FRP is an open-source tool widely shared among Chinese hacking groups.\nEclecticIQ said it also identified a command-and-control (C2) server associated with\nAuto-Color\n, a Linux backdoor that was documented by Palo Alto Networks Unit 42 as used in attacks aimed at universities and government organizations in North America and Asia between November and December 2024.\n\"The IP address 146.70.87[.]67:45020, previously associated with Auto-Color command-and-control infrastructure, was seen issuing outbound connectivity tests via curl immediately after exploitation of Ivanti EPMM servers,\" Büyükkaya pointed out. \"This behaviour is consistent with Auto-Color's staging and beaconing patterns. Taken together, these indicators very likely link to China-nexus activity.\"\nThe disclosure comes as threat intelligence firm GreyNoise noted that it had witnessed a significant spike in scanning activity targeting Ivanti Connect Secure and Pulse Secure products prior to the disclosure of CVE-2025-4427 and CVE-2025-4428.\n\"While the scanning we observed was not directly tied to EPMM, the timeline underscores a critical reality: scanning activity often precedes the public emergence of zero-day vulnerabilities,\" the company\nsaid\n. \"It's a leading indicator — a signal that attackers are probing critical systems, potentially in preparation for future exploitation.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Webinar: Learn How to Build a Reasonable and Legally Defensible Cybersecurity Program",
        "Link": "https://thehackernews.com/2025/05/webinar-learn-how-to-build-reasonable.html",
        "Summary": "It’s not enough to be secure. In today’s legal climate, you need to prove it.\nWhether you’re protecting a small company or managing compliance across a global enterprise, one thing is clear: cybersecurity can no longer be left to guesswork, vague frameworks, or best-effort intentions.\nRegulators and courts are now holding organizations accountable for how “reasonable” their security programs are",
        "Date": "2025-05-22",
        "Content": "It's not enough to be secure. In today's legal climate, you need to prove it.\nWhether you're protecting a small company or managing compliance across a global enterprise, one thing is clear: cybersecurity can no longer be left to guesswork, vague frameworks, or best-effort intentions.\nRegulators and courts are now holding organizations accountable for how \"reasonable\" their security programs are—and that's not just a buzzword anymore.\nBut what does \"\nreasonable\"\neven mean in cybersecurity?\nThat's exactly what\nthis free webinar\nwe hosted with the experts from Center for Internet Security (CIS) will help you answer.\nNew privacy laws, ransomware lawsuits, and regulatory investigations are raising the bar for cybersecurity expectations. If your defense program can't show structure, strategy, and measurable maturity, you're not just at risk—you're already falling behind.\nThis isn't about hype. It's about legal risk, operational readiness, and your reputation.\nIn this live session, CIS experts will walk you through a practical, no-fluff approach to building a cybersecurity program that meets legal and industry standards—and makes sense for your size, scope, and resources.\nWhat You'll Learn (That You Can Actually Use)\nThis isn't another generic security talk. You'll walk away with:\nA clear definition of \"reasonable\" cybersecurity and why it matters to courts, regulators, and insurers.\nA step-by-step breakdown of the CIS Critical Security Controls®, used by thousands of organizations to build real-world defenses.\nHow to assess and track your program's maturity using CIS CSAT Pro, a free and powerful self-assessment tool.\nWhy a CIS SecureSuite® Membership could save you time, reduce risk, and help you generate compliance reports in a few clicks.\nYou don't need a massive budget or a 50-person SOC to get started. The CIS model is built for scalability and clarity—and it's already trusted by schools, hospitals, local governments, and major enterprises alike.\nWatch this Webinar\nMost security breaches don't happen because of zero-days. They happen because the basics weren't in place. And the legal fallout usually focuses on what you didn't do—or can't prove you did.\nThis webinar shows you how to build a defense program that's not only smart and scalable but also provably responsible.\n📅\nReserve your spot now\n. It's free, it's practical, and it could save your organization from major headaches later.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Identity Security Has an Automation Problem—And It's Bigger Than You Think",
        "Link": "https://thehackernews.com/2025/05/identity-security-has-automation.html",
        "Summary": "For many organizations, identity security appears to be under control. On paper, everything checks out. But new research from Cerby, based on insights from over 500 IT and security leaders, reveals a different reality: too much still depends on people—not systems—to function. In fact, fewer than 4% of security teams have fully automated their core identity workflows.\nCore workflows, like",
        "Date": "2025-05-22",
        "Content": "For many organizations, identity security appears to be under control. On paper, everything checks out. But new research from Cerby, based on insights from over 500 IT and security leaders, reveals a different reality: too much still depends on people—not systems—to function. In fact,\nfewer than 4% of security teams have fully automated their core identity workflows\n.\nCore workflows, like enrolling in Multi Factor Authentication (MFA), keeping credentials secure and up to date, and revoking access the moment someone leaves—are often manual, inconsistent, and vulnerable to error. And when security execution relies on memory or follow-up, gaps appear fast.\nHuman error remains one of the biggest threats to enterprise security. Verizon's 2025 Data Breach report found that the human element was involved in 60% of breaches. The same manual missteps that led to breaches a decade ago still expose identity systems today. Cerby's\n2025 Identity Automation Gap\nresearch report shows just how widespread the issue is—and how far automation still has to go.\nThe last mile still runs on human error\nThe data reveals a persistent reliance on human action for tasks that should be automated across the identity security lifecycle.\n41% of end users still share or update passwords manually\n, using insecure methods like spreadsheets, emails, or chat tools. They are rarely updated or monitored, increasing the likelihood of credential misuse or compromise.\nNearly 89% of organizations rely on users to manually enable MFA\nin applications, despite MFA being one of the most effective security controls. Without enforcement, protection becomes optional, and attackers know how to exploit that inconsistency.\n59% of IT teams handle\nuser provisioning and deprovisioning manually\n, relying on ticketing systems or informal follow-ups to grant and remove access. These workflows are slow, inconsistent, and easy to overlook—leaving organizations exposed to unauthorized access and compliance failures.\nOrganizations can't afford to wait\nThe consequences are no longer hypothetical.\nAccording to the Ponemon Institute,\n52% of enterprises have experienced a security breach\ncaused by manual identity work in disconnected applications\n. Most of them had four or more. The downstream impact was tangible:\n43% reported customer loss, and 36% lost partners.\nThese failures are predictable and preventable, but only if organizations stop relying on humans to carry out what should be automated. Identity is no longer a background system. It's one of the primary control planes in enterprise security. As attack surfaces expand and threat actors become more sophisticated, the automation gap becomes harder—and riskier—to ignore.\nWhy the automation gap persists\nWhy do these manual gaps still exist if automation is so critical to identity security? They've emerged as a byproduct of rapid growth, application sprawl, and fragmented infrastructure.\nDisconnected applications\nare everywhere,\nand they don't support the common identity standards required for integration into existing providers. A majority of enterprise applications fall into this category, and that number continues to grow. They span every business function and are packed with sensitive data.\nIT & security teams assume tools = coverage.\nEnvironments today stretch across SaaS, mobile, cloud, and on-prem systems. Shadow IT continues to grow faster than anyone can track, as each business unit brings its own stack. Achieving full control across all applications remains highly elusive.\nStopgap solutions don't scale.\nPassword managers, manual scripts, and other vaulting tools are difficult to maintain and often create fragmented infrastructure. When integrations don't exist, they're frequently patched together—but these fixes are costly to build and fragile to sustain. What starts as a workaround quickly becomes an ongoing operational burden.\nClosing the automation gap\nThe good news: closing the automation gap doesn't require rebuilding or replacing your identity stack. It means completing it.\nForward-thinking organizations are bringing automation to every corner of their application ecosystem without waiting for native integrations. Some teams are also exploring AI agents to help close this gap. But trust is still evolving:\n78% of security leaders say they don't trust AI to fully automate core identity tasks\n—yet\n45% support a collaborative human-in-the-loop model\n.\nCerby provides organizations with the flexibility to support both approaches—meeting teams where they are and delivering automation where it's needed most.\nCerby's research report,\nThe 2025 Identity Automation Gap\n, includes findings from 500+ IT and security leaders and practical steps for closing one of the most overlooked risks in enterprise security.\nDownload the full report\nor\nschedule a 15-minute demo\nto see how Cerby brings automation across your entire identity surface.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Unpatched Versa Concerto Flaws Let Attackers Escape Docker and Compromise Host",
        "Link": "https://thehackernews.com/2025/05/unpatched-versa-concerto-flaws-let.html",
        "Summary": "Cybersecurity researchers have uncovered multiple critical security vulnerabilities impacting the Versa Concerto network security and SD-WAN orchestration platform that could be exploited to take control of susceptible instances.\nIt's worth noting that the identified shortcomings remain unpatched despite responsible disclosure on February 13, 2025, prompting a public release of the issues",
        "Date": "2025-05-22",
        "Content": "Cybersecurity researchers have uncovered multiple critical security vulnerabilities impacting the Versa Concerto network security and SD-WAN orchestration platform that could be exploited to take control of susceptible instances.\nIt's worth noting that the identified shortcomings remain unpatched despite responsible disclosure on February 13, 2025, prompting a public release of the issues following the end of the 90-day deadline.\n\"These vulnerabilities, when chained together, could allow an attacker to fully compromise both the application and the underlying host system,\" ProjectDiscovery researchers Harsh Jaiswal, Rahul Maini, and Parth Malhotra\nsaid\nin a report shared with The Hacker News.\nThe security defects are listed below -\nCVE-2025-34025\n(CVSS score: 8.6) - A privilege escalation and Docker container escape vulnerability that's caused by unsafe default mounting of host binary paths and could be exploited to gain code execution on the underlying host machine\nCVE-2025-34026\n(CVSS score: 9.2) - An authentication bypass vulnerability in the Traefik reverse proxy configuration that allows an attacker to access administrative endpoints, which could then be exploited to access heap dumps and trace logs by exploiting an internal Spring Boot Actuator endpoint via\nCVE-2024-45410\nCVE-2025-34027\n(CVSS score: 10.0) - An authentication bypass vulnerability in the Traefik reverse proxy configuration that allows an attacker to access administrative endpoints, which could then be exploited to achieve remote code execution by exploiting an endpoint related to package uploads (\"/portalapi/v1/package/spack/upload\") via arbitrary file writes\nSuccessful exploitation of CVE-2025-34027 could allow an attacker to leverage a race condition and write malicious files to disk, ultimately resulting in remote code execution using LD_PRELOAD and a reverse shell.\n\"Our approach involved overwriting ../../../../../../etc/ld.so.preload with a path pointing to /tmp/hook.so,\" the researchers said. \"Simultaneously, we uploaded /tmp/hook.so, which contained a compiled C binary for a reverse shell. Since our request triggered two file write operations, we leveraged this to ensure that both files were written within the same request.\"\n\"Once these files were successfully written, any command execution on the system while both persisted would result in the execution of /tmp/hook.so, thereby giving us a reverse shell.\"\nIn the absence of an official fix, users are advised to block semicolons in URL paths and drop requests where the Connection header contains the value X-Real-Ip. It's also recommended to monitor network traffic and logs for any suspicious activity.\nThe Hacker News has reached out to Versa Networks for comment, and we will update the story if we hear back.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "FBI and Europol Disrupt Lumma Stealer Malware Network Linked to 10 Million Infections",
        "Link": "https://thehackernews.com/2025/05/fbi-and-europol-disrupt-lumma-stealer.html",
        "Summary": "A sprawling operation undertaken by global law enforcement agencies and a consortium of private sector firms has disrupted the online infrastructure associated with a commodity information stealer known as Lumma (aka LummaC or LummaC2), seizing 2,300 domains that acted as the command-and-control (C2) backbone to commandeer infected Windows systems.\n\"Malware like LummaC2 is deployed to steal",
        "Date": "2025-05-22",
        "Content": "A sprawling operation undertaken by global law enforcement agencies and a consortium of private sector firms has disrupted the online infrastructure associated with a commodity information stealer known as\nLumma\n(aka LummaC or LummaC2), seizing 2,300 domains that acted as the command-and-control (C2) backbone to commandeer infected Windows systems.\n\"Malware like LummaC2 is deployed to steal sensitive information such as user login credentials from millions of victims in order to facilitate a host of crimes, including fraudulent bank transfers and cryptocurrency theft,\" the U.S. Department of Justice (DoJ)\nsaid\nin a statement.\nThe confiscated infrastructure has been used to target millions across the world through affiliates and other cyber criminals. Lumma Stealer, active since late 2022, is estimated to have been used in at least 1.7 million instances to steal information, such as browser data, autofill information, login credentials, and cryptocurrency seed phrases. The U.S. Federal Bureau of Investigation (FBI) has attributed around 10 million infections to Lumma.\nThe seizure impacts five domains that serve as login panels for Lumma Stealer's administrators and paying customers to deploy the malware, thereby preventing them from compromising the computers and stealing victim information.\n\"Between March 16 and May 16, 2025, Microsoft identified over 394,000 Windows computers globally infected by the Lumma malware,\" Europol\nsaid\n, adding the operation cuts off communications between the malicious tool and victims. The agency described Lumma as the \"world's most significant infostealer threat.\"\nMicrosoft's Digital Crimes Unit (DCU), in partnership with other cybersecurity companies ESET, BitSight, Lumen, Cloudflare, CleanDNS, and GMO Registry, said it took down approximately 2,300 malicious domains that formed the backbone of Lumma's infrastructure.\nSpread of Lumma Stealer malware infections across Windows devices\n\"The primary developer of Lumma is based in Russia and goes by the internet alias 'Shamel,'\" Steven Masada, assistant general counsel at DCU,\nsaid\n. \"Shamel markets different tiers of service for Lumma via Telegram and other Russian-language chat forums. Depending on what service a cybercriminal purchases, they can create their own versions of the malware, add tools to conceal and distribute it, and track stolen information through an online portal.\"\nThe stealer, marketed under a malware-as-a-service (MaaS) model, is available on a subscription basis for anywhere between $250 to $1,000. The developer also offers a $20,000 plan that grants customers access to source code and the right to sell it to other criminal actors.\nWeekly counts of new C2 domains\n\"Lower tiers include basic filtering and log download options, while higher tiers offer custom data collection, evasion tools, and early access to new features,\" ESET\nsaid\n. \"The most expensive plan emphasizes stealth and adaptability, offering unique build generation and reduced detection.\"\nOver the years, Lumma has become something of a notorious threat, being delivered via\nvarious distribution vectors\n, including the increasingly popular\nClickFix\nmethod. The Windows maker, which is tracking the threat actor behind the stealer under the name Storm-2477, said its distribution infrastructure is both \"dynamic and resilient,\" leveraging a combination of phishing, malvertising, drive-by download schemes, abuse of trusted platforms, and traffic distribution systems like\nPrometheus\n.\nLumma C2 selection mechanism\nCato Networks, in a report published Wednesday, revealed that suspected Russian threat actors are leveraging Tigris Object Storage, Oracle Cloud Infrastructure (OCI) Object Storage, and Scaleway Object Storage to host fake reCAPTCHA pages that make use of\nClickFix\n-style lures to trick users into downloading\nLumma Stealer\n.\n\"The recent campaign leveraging Tigris Object Storage, OCI Object Storage, and Scaleway Object Storage builds upon earlier methods, introducing new delivery mechanisms aimed at evading detection and targeting technically proficient users,\" researchers Guile Domingo, Guy Waizel, and Tomer Agayev\nsaid\n.\nAttack flow for ClickFix leading to Lumma Stealer using Prometheus TDS\nSome of the notable aspects of the malware are below -\nIt employs a\nmulti-tiered C2 infrastructure\nconsisting of a set of nine frequently changing tier-1 domains hard-coded into the malware's configuration and fallback C2s hosted on Steam profiles and Telegram channels that point to tier-1 C2s\nThe payloads are typically\nspread\nusing pay-per-install (PPI) networks or traffic sellers that deliver installs-as-a-service.\nThe stealer is typically bundled with spoofed software or cracked versions of popular commercial software, targeting users looking to avoid paying for legitimate licenses\nThe operators have created a\nTelegram marketplace\nwith a rating system for affiliates to sell stolen data without intermediaries\nThe core binary is obfuscated with advanced protection such as low-level virtual machine (LLVM core), Control Flow Flattening (CFF), Control Flow Obfuscation, customized stack decryption, huge stack variables, and dead codes, among others to make static analysis difficult\nThere were more than\n21,000 market listings\nselling Lumma Stealer logs on multiple cybercriminal forums from April through June of 2024, a 71.7% increase from April through June of 2023\n\"The Lumma Stealer distribution infrastructure is flexible and adaptable,\" Microsoft\nsaid\n. \"Operators continually refine their techniques, rotating malicious domains, exploiting ad networks, and leveraging legitimate cloud services to evade detection and maintain operational continuity. To further hide the real C2 servers, all the C2 servers are hidden behind the Cloudflare proxy.\"\n\"This dynamic structure enables operators to maximize the success of campaigns while complicating efforts to trace or dismantle their activities. The growth and resilience of Lumma Stealer highlights the broader evolution of cybercrime and underscores the need for layered defenses and industry collaboration to counter threats.\"\nWeb infrastructure company Cloudflare said it placed a new, Turnstile-enabled interstitial warning page in front of the malicious actors' C2 server and marketplace domains, as well as taking action against the accounts that were used to configure the domains.\n\"This disruption worked to fully setback their operations by days, taking down a significant number of domain names, and ultimately blocking their ability to make money by committing cybercrime,\" Blake Darché, head of Cloudforce One, said. \"While this effort threw a sizable wrench into the largest global infostealers infrastructure, like any threat actor, those behind Lumma will shift tactics and reemerge to bring their campaign back online.\"\nIn an interview with security researcher g0njxa in January 2025, the developer behind Lumma\nsaid\nthey intended to cease operations by next fall. \"We have done a lot of work over two years to achieve what we have now,\" they said. \"We are proud of this. It has become a part of our daily life for us, and not just work.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Claude 4 benchmarks show improvements, but context is still 200K",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/claude-4-benchmarks-show-improvements-but-context-is-still-200k/",
        "Summary": "Today, OpenAI rival Anthropic announced Claude 4 models, which are significantly better than Claude 3 in benchmarks, but we're left disappointed with the same 200,000 context window limit. [...]",
        "Date": "2025-05-22",
        "Content": "Today, OpenAI rival Anthropic announced Claude 4 models, which are significantly better than Claude 3 in benchmarks, but we're left disappointed with the same 200,000 context window limit.\nIn a blog post, Anthropic said Claude Opus 4 is the company's most powerful model, and it's also the best model for coding in the industry.\nFor example, in SWE-bench (SWE is short for Software Engineering Benchmark), Claude Opus 4 scored 72.5 percent and 43.2 on Terminal-bench.\n\"It delivers sustained performance on long-running tasks that require focused effort and thousands of steps, with the ability to work continuously for several hours, dramatically outperforming all Sonnet models and significantly expanding what AI agents can accomplish,\" Anthropic\nnoted\n.\nWhile benchmarks put Claude 4 Sonnet and Opus ahead of their predecessors and competitors like Gemini 2.5 Pro in coding, we're still concerned about the model's 200,000 context window limit.\nThis could be one of the reasons why Claude 4 models excel at coding and complex-solving tasks in these benchmarks, because these models are not being tested against a large context.\nFor comparison, Google's Gemini 2.5 Pro ships with a 1 million token context window and support for a 2 million context window is also in the works.\nChatGPT's 4.1 models also offer up to a million context window.\nModel\nDescription\nInput\nPrompt Caching Write\nPrompt Caching Read\nOutput\nContext Window\nBatch Processing Discount\nClaude Opus 4\nMost intelligent model for complex tasks\n$15 / MTok\n$18.75 / MTok\n$1.50 / MTok\n$75 / MTok\n200K\n50% discount with batch processing\nClaude Sonnet 4\nOptimal balance of intelligence, cost, and speed\n$3 / MTok\n$3.75 / MTok\n$0.30 / MTok\n$15 / MTok\n200K\n50% discount with batch processing\nClaude is still lagging behind the competition when it comes to the context window, which is important in large projects.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nAnthropic web config hints at Claude Sonnet 4 and Opus 4\nClaude is testing ChatGPT-like Deep Research feature Compass\nOpenAI hints at a big upgrade for ChatGPT Operator Agent\nOpenAI plans to combine multiple models into GPT-5\nLeak confirms OpenAI's ChatGPT will integrate MCP"
    },
    {
        "Title": "US indicts leader of Qakbot botnet linked to ransomware attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/us-indicts-leader-of-qakbot-botnet-linked-to-ransomware-attacks/",
        "Summary": "The U.S. government has indicted Russian national Rustam Rafailevich Gallyamov, the leader of the Qakbot botnet malware operation that compromised over 700,000 computers and enabled ransomware attacks. [...]",
        "Date": "2025-05-22",
        "Content": "The U.S. government has indicted Russian national Rustam Rafailevich Gallyamov, the leader of the Qakbot botnet malware operation that compromised over 700,000 computers and enabled ransomware attacks.\nAs per court documents, Gallyamov started to develop Qakbot (also known as Qbot and Pinkslipbot) in 2008 and deployed it to create a network of thousands of infected computers.\nOver time, a team of developers was formed around Qakbot but the indictment notes that other malware was also created under Gallyamov’s leadership.\nFor about a decade, Gallyamov used Qakbot as a banking trojan with worm capabilities, malware dropper, or backdoor that could also record keystrokes.\nStarting in 2019, Qakbot became the initial infection vector in many ransomware attacks from infamous gangs such as Conti, ProLock, Egregor, REvil, RansomExx, MegaCortex, Doppelpaymer, Black Basta, and Cactus.\nFor providing initial access, Gallyamov allegedly received a portion of the ransom paid by the victims. The payment varied based on an arrangement with each ransomware group.\nOver $24 million seized in digital assets\nAccording to the\nindictment\n, Qakbot infections led to hundreds of ransomware victims across the globe. The list includes private companies, healthcare providers, and government agencies.\nThe compromises caused hundreds of millions of dollars in damage. In just 18 months, financial damages exceeded $58 million.\nIn 2023, the Qakbot botnet was\ndismantled by the FBI\n, after hacking parts of its infrastructure and taking control of one computer used by a Qakbot administrator.\nDespite this, Gallyamov continued malicious operations and “orchestrated spam bomb attacks against victims in the United States as recently as January 2025.”\nEarlier today, the Justice Department filed a forfeiture complaint against more than $24 million in cryptocurrency seized from Gallyamov during the investigation.\nLast month, the FBI seized more illegal assets - 30 bitcoins and $700,000 in USDT tokens, worth more than $4 million at today’s exchange rate.\nLaw enforcement actions were taken in conjunction with\nOperation Endgame\n, an international effort that led to seizing more than 100 servers used by multiple botnets and malware loaders (e.g. IcedID, Pikabot, Trickbot, Bumblebee, Smokeloader, and SystemBC).\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nUS indicts Black Kingdom ransomware admin for Microsoft Exchange attacks\nPolice arrest Conti and LockBit ransomware crypter specialist\nPolice seize over 100 malware loader servers, arrest four cybercriminals\n3AM ransomware uses spoofed IT calls, email bombing to breach networks\nKettering Health hit by system-wide outage after ransomware attack"
    },
    {
        "Title": "Hackers use fake Ledger apps to steal Mac users’ seed phrases",
        "Link": "https://www.bleepingcomputer.com/news/security/hackers-use-fake-ledger-apps-to-steal-mac-users-seed-phrases/",
        "Summary": "Cybercriminal campaigns are using fake Ledger apps to target macOS users and their digital assets by deploying malware that attempts to steal seed phrases that protect access to digital cryptocurrency wallets. [...]",
        "Date": "2025-05-22",
        "Content": "Cybercriminal campaigns are using fake Ledger apps to target macOS users and their digital assets by deploying malware that attempts to steal seed phrases that protect access to digital cryptocurrency wallets.\nLedger is a popular hardware-based wallet designed to store cryptocurrency offline (cold storage) and in a secure manner.\nA seed or recovery phrase is a set of 12 or 24 random words that allows recovering the digital assets if the wallet is lost or the access password forgotten. Thus, it is meant to be stored offline and private.\nIn such attacks highlighted in a\nMoonlock Lab report\n, the malicious app impersonates the Ledger app in an attempt to trick the user to type their seed phrase on a phishing page.\nMoonlock Lab says that they have been tracking these attacks since last AugustAugust 2024, when the app clones could only \"steal passwords, notes, and wallet details to get a glimpse of the wallet’s assets.\" This info would not be enough to access the funds, though.\nWith the recent update focusing on stealing the seed phrase, cybercriminals can empty victims' wallets.\nEvolution of the Ledger campaigns\nIn March, Moonlock Lab spotted a threat actor using the alias 'Rodrigo' deploying a new macOS stealer named 'Odyssey.'\nThe new malware replaces the legitimate Ledger Live app on the victim's device to make the attack more effective.\nThe malware embedded a phishing page inside a fake Ledger app asking the victim to input their 24-word seed phrase to recover their account after displaying a bogus \"critical error\" message.\nSeed phrase phishing page\nSource: Moonlock Lab\nOdyssey can also steall macOS usernames and exfiltrate all data provided through the phishing fields to Rodrigo's command-and-control (C2) server.\nThe effectiveness of this new piece of malware quickly gained attention across underground forums, prompting copycat attacks by the AMOS stealer that implemented similar features.\nLast month, a new AMOS campaign was identified using a DMG file named 'JandiInstaller.dmg,' which bypassed Gatekeeper to install a trojanized Ledger Live clone app that displayed Rodrigo-style phishing screens.\nAMOS malware installation prompt\nSource: Moonlock Lab\nVictims falling for the trick and typing their 24-word seed phrase into AMOS got a deceptive \"App corrupted\" message to lower suspicion and allow the attackers enough time to pilfer the assets.\nAround the same time, a separate threat actor using the handle '@mentalpositive' began advertising an \"anti-Ledger\" module on dark web forums, though Moonlock couldn't find working versions of it.\nThis month, researchers at Jamf, a company that provides organizations with software for managing Apple devices,\nuncovered\nanother campaign where a PyInstaller-packed binary in a DMG file downloaded a phishing page loaded via iframe in a fake Ledger Live interface to steal users' seed phrases.\nSimilar to the AMOS stealer campaign, the attacks that Jamf discovered follow a hybrid approach, targeting browser data, \"hot\" wallet configurations, and system information along with targeted Ledger phishing.\nCode of the malware app\nSource: Moonlock Lab\nTo keep your Ledger wallets safe, only download the Ledger Live app from the official website, and always check before typing your seed phrase, which should happen only when losing access to the physical wallet.\nYou're only required to use the seed phrase when you're restoring your wallet or setting up a new device. Even then, the phrase is entered on the physical Ledger device, and not on the app or any website.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nNorth Korean hackers adopt ClickFix attacks to target crypto firms\nNew Crocodilus malware steals Android users’ crypto wallet keys\nLumma infostealer malware operation disrupted, 2,300 domains seized\nStealC malware enhanced with stealth upgrades and data theft tools\nEuropol identifies 8 cybercriminals tied to malware loader botnets"
    },
    {
        "Title": "Police arrests 270 dark web vendors, buyers in global crackdown",
        "Link": "https://www.bleepingcomputer.com/news/security/police-arrests-270-dark-web-vendors-buyers-in-global-crackdown/",
        "Summary": "Police arrested 270 suspects following an international law enforcement action codenamed 'Operation RapTor' that targeted dark web vendors and customers from ten countries. [...]",
        "Date": "2025-05-22",
        "Content": "Police arrested 270 suspects following an international law enforcement action codenamed 'Operation RapTor' that targeted dark web vendors and customers from ten countries.\nNational authorities in Europe, South America, Asia, and the United States have also seized over €184 million ($207M) in cash and cryptocurrency, more than 2 tonnes of drugs (including amphetamines, cocaine, ketamine, opioids, and cannabis), and over 180 firearms.\n\"A global law enforcement operation coordinated by Europol has struck a major blow to the criminal underground, with 270 arrests of dark web vendors and buyers across ten countries,\"\nEuropol said\non Thursday.\n\"Known as Operation RapTor, this international sweep has dismantled networks trafficking in drugs, weapons, and counterfeit goods, sending a clear signal to criminals hiding behind the illusion of anonymity.\"\nLaw enforcement identified the suspects (many linked to thousands of sales on illicit platforms) using intelligence collected after the takedowns of multiple dark web marketplaces, including\nNemesis\n, Tor2Door,\nBohemia\n, and\nKingdom Market\n.\nMost of the arrested suspects were apprehended in the United States (130), Germany (42), the United Kingdom (37), France (29), and South Korea (19), while 13 others were detained in the Netherlands, Austria, Brazil, Spain, and Switzerland.\n\"Operation RapTor shows that the dark web is not beyond the reach of law enforcement,\" added Edvardas Šileris, the Head of Europol’s European Cybercrime Centre.\n\"Through close cooperation and intelligence sharing, officers across four continents identified and arrested suspects, sending a clear message to those who think they can hide in the shadows. Europol will continue working with our partners to make the internet safer for everyone.\"\nThe U.S. Department of Justice's Joint Criminal Opioid and Darknet Enforcement (JCODE) team and Europol's European Cybercrime Centre (EC3)\nare still analyzing evidence\ncollected in previous operations to trace and apprehend other suspects linked to dark web crime.\nThis joint action follows\nOperation SpecTor\nin 2023, which led to the arrest of 288 other dark web vendors and buyers and the seizure of €50.8 million ($55.9M) in cash and cryptocurrency.\nIn 2020, another international sting dubbed \"DisrupTor\" targeted dark web vendors and led to 179 arrests, while\nOperation Dark HunTOR\nresulted in busting 150 more high-volume darknet vendors.\nIn April 2022, German police and U.S. authorities\nshut down Hydra\n, the world's largest dark web marketplace dedicated to selling drugs and money laundering, with over 19,000 seller accounts that were serving more than 17 million customers worldwide.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nPolice seize over 100 malware loader servers, arrest four cybercriminals\nPolice shuts down KidFlix child sexual exploitation platform\nPolice arrest Conti and LockBit ransomware crypter specialist\nFBI: US officials targeted in voice deepfake attacks since April\nKosovo extradites BlackDB admin to face US cybercrime charges"
    },
    {
        "Title": "Ivanti EPMM flaw exploited by Chinese hackers to breach govt agencies",
        "Link": "https://www.bleepingcomputer.com/news/security/ivanti-epmm-flaw-exploited-by-chinese-hackers-to-breach-govt-agencies/",
        "Summary": "Chinese hackers have been exploiting a remote code execution flaw in Ivanti Endpoint Manager Mobile (EPMM) to breach high-profile organizations worldwide. [...]",
        "Date": "2025-05-22",
        "Content": "Chinese hackers have been exploiting a remote code execution flaw in Ivanti Endpoint Manager Mobile (EPMM) to breach high-profile organizations worldwide.\nThe flaw is identified as CVE-2025-4428 and received a high-severity score.\nThe issue can be leveraged to execute code remotely on Ivanti EPMM version 12.5.0.0 and earlier via specially crafted API requests.\nIvanti disclosed the flaw together with an authentication bypass (CVE-2025-4427) and patched them both on May 13, 2025, noting that the two issues\nhad been exploited previously\nagainst a “very limited number of customers.”\nYesterday,\nEclecticIQ’s researcher Arda Büyükkaya\nreported seeing CVE-2025-4428 being exploited extensively in the wild since May 15, and attributed them with high confidence to the UNC5221 activity cluster.\nThe particular threat group is considered an Ivanti specialist, regularly exploiting zero-day vulnerabilities in the firm’s products, like Connect Secure\nin January\nand again\nin April 2025\n.\nThe researcher confirmed this to BleepingComputer. He commented on the hackers’ deep knowledge about Ivanti systems saying that they know which files hold the information required for the next step of the attack, such as cleartext MySQL credentials, and targeting those specifically.\nExposed cleartext credentials\nSource: EclecticIQ\nThe entities targeted in the latest UNC5221 exploitation campaign are:\nUK National Health Service institutions\nNational healthcare/pharma provider in North America\nU.S. medical device manufacturer\nMunicipal agencies in Scandinavia and the UK\nGerman Federal Research Institute\nGerman telecommunications giant and IT subsidiaries\nU.S.-based cybersecurity firm\nMajor U.S. foodservice distributor\nIrish aerospace leasing firm\nGerman industrial manufacturer\nJapanese automotive electronics and powertrain supplier\nU.S. firearms manufacturer\nSouth Korean multinational commercial and consumer bank\nThese were confirmed breaches, as evidenced by reverse shells, data exfiltration/database exports, persistent malware injections, and abuse of internal Office 365 tokens and LDAP configurations.\nThe request triggering the CVE-2025-4428 exploit\nSource: EclecticIQ\nBüyükkaya told BleepingComputer that based on the observed post-compromise activity, the threat actor was most likely engaged in espionage, monitoring high-value targets related to strategic interests.\nThe threat actor performed host reconnaissance by running system commands to gather details about the device, users, network, and configuration files, before dropping the KrystyLoader payload from a compromised AWS S3 bucket.\nDropping KrustyLoader on the target\nSource: EclecticIQ\nThe output of those commands was temporarily saved as disguised .JPG files in a web-accessible directory, then immediately deleted to evade detection.\nThis indicates real-time data exfiltration, likely via HTTP GET requests, followed by artifact cleanup.\nThe EclecticIQ report also notes that the latest attacks conducted by UNC5221 feature links to the Linux backdoor ‘\nAuto-Color\n’ first reported by Palo Alto Networks’ Unit 42 in February but without clear attribution at the time.\nThe latest attacks indicate that Chinese espionage groups continue to target network perimeter devices for initial access into target organizations.\nThe exploitation that EclecticIQ observed started two days after the public disclosure, highlighting the criticality of applying security updates as soon as possible.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nIvanti patches Connect Secure zero-day exploited since mid-March\nNewest Ivanti SSRF zero-day now under mass exploitation\nIvanti zero-day attacks infected devices with custom malware\nIvanti Connect Secure zero-days exploited to deploy custom malware\nIvanti fixes EPMM zero-days chained in code execution attacks"
    },
    {
        "Title": "Chinese hackers breach US local governments using Cityworks zero-day",
        "Link": "https://www.bleepingcomputer.com/news/security/chinese-hackers-breach-us-local-governments-using-cityworks-zero-day/",
        "Summary": "Chinese-speaking hackers have exploited a now-patched Trimble Cityworks zero-day to breach multiple local governing bodies across the United States. [...]",
        "Date": "2025-05-22",
        "Content": "Chinese-speaking hackers have exploited a now-patched Trimble Cityworks zero-day to breach multiple local governing bodies across the United States.\nTrimble Cityworks is a Geographic Information System (GIS)-based asset management and work order management software primarily used by local governments, utilities, and public works organizations and designed to help infrastructure agencies and municipalities manage public assets, handle permitting and licensing, and process work orders.\nThe hacking group (UAT-6382) behind this campaign used a Rust-based malware loader to deploy Cobalt Strike beacons and VSHell malware designed to backdoor compromised systems and provide long-term persistent access, as well as web shells and custom malicious tools written in Chinese.\nThese attacks started in January 2025, when Cisco Talos observed the first signs of reconnaissance activity within the breached organizations' networks.\n\"Talos has found intrusions in enterprise networks of local governing bodies in the United States (U.S.), beginning January 2025 when initial exploitation first took place. Upon gaining access, UAT-6382 expressed a clear interest in pivoting to systems related to utilities management,\"\nsaid\nCisco Talos security researchers Asheer Malhotra and Brandon White.\n\"The web shells, including AntSword, chinatso/Chopper and generic file uploaders, contained messaging written in the Chinese language. Furthermore, the custom tooling, TetraLoader, was built using a malware-builder called 'MaLoader' that is also written in Simplified Chinese.\"\nFederal agencies warned to patch immediately\nThe security flaw exploited in these attacks (\nCVE-2025-0994\n) is a high-severity deserialization vulnerability that allows authenticated threat actors to execute code remotely on the targets' Microsoft Internet Information Services (IIS) servers.\nIn early February 2025, when it released security updates to patch this vulnerability, Trimble warned that it was aware of attackers\ntrying to exploit CVE-2025-0994\nto breach some Cityworks deployments.\nThe U.S. Cybersecurity and Infrastructure Security Agency (CISA) also\nadded CVE-2025-0994\nto its catalog of actively exploited vulnerabilities on February 7, ordering federal agencies to patch their systems within three weeks as mandated by the November 2021 Binding Operational Directive (BOD) 22-01.\n\"These types of vulnerabilities are frequent attack vectors for malicious cyber actors and pose significant risks to the federal enterprise,\" the\ncybersecurity agency warned\n.\nDays later, on February 11, CISA\nreleased an advisory\nwarning to organizations in the water and wastewater systems, energy, transportation systems, government services and facilities, and communications sectors to \"install the updated version immediately.\"\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nFBI: US officials targeted in voice deepfake attacks since April\nUnofficial Signal app used by Trump officials investigates hack\nChinese hackers target Russian govt with upgraded RAT malware\nIvanti patches Connect Secure zero-day exploited since mid-March\nCISA emergency directive: Mitigate Ivanti zero-days immediately"
    },
    {
        "Title": "FTC finalizes order requiring GoDaddy to secure hosting services",
        "Link": "https://www.bleepingcomputer.com/news/security/ftc-finalizes-order-requiring-godaddy-to-secure-hosting-services/",
        "Summary": "The Federal Trade Commission (FTC) has finalized an order requiring web hosting giant GoDaddy to secure its services to settle charges of data security failures that led to several data breaches since 2018. [...]",
        "Date": "2025-05-22",
        "Content": "The U.S. Federal Trade Commission (FTC) has finalized an order requiring web hosting giant GoDaddy to secure its services to settle charges of data security failures that led to several data breaches since 2018.\nIn January,\nthe agency also alleged\nthat GoDaddy, a major website hosting company with roughly five million customers, misled users about its security practices. The FTC found that GoDaddy was unaware of vulnerabilities in its hosting environment due to a lack of standard security measures.\nThe\nFTC's order\nprohibits the company from misleading customers about its security protections and mandates GoDaddy to establish a robust information security program, secure APIs using HTTPS or other secure transfer protocols, and set up a software and firmware update management program.\nThe order also requires GoDaddy to hire an independent third-party assessor to conduct biennial reviews of its information security program and report any incident where customer data was exposed, accessed, or stolen within 10 days.\nAmong other requirements, the hosting company has to add at least one mandatory MFA for all customers, employees, and contractors' staff \"to any Hosting Service supporting tool or asset, including connecting to any database\" and \"at least one method that does not require the customer to provide a telephone number, such as by integrating authentication applications or allowing the use of security key.\"\nLax security practices behind multiple breaches\nAccording to the FTC's\ncomplaint\n, GoDaddy had inadequate security practices, lacking multi-factor authentication (MFA), proper software update management, and logging of security events. It also failed to monitor for threats, segment its network, use file integrity monitoring, keep track of and manage its assets, assess risks to its hosting services, or secure service connections to consumer data.\nThe FTC says these security failures led to several major security breaches between 2019 and 2022, resulting in attackers gaining access to customers' data and websites. For instance, in February 2023,\nGoDaddy revealed\nthat unknown threat actors installed malware on compromised servers and stole source code after breaching its cPanel shared hosting environment in a multi-year breach.\nThe company discovered the incident in early December 2022, only after receiving customer complaints that their websites were being abused to redirect to unknown domains. GoDaddy also disclosed at the time that breaches disclosed in March 2020 and November 2021 were linked to the same campaign.\nIn the\nNovember 2021 breach\n, attackers hacked into GoDaddy's hosting environment using a compromised password and stole email addresses, WordPress Admin passwords, sFTP and database credentials, and SSL private keys of 1.2 million Managed WordPress customers. Following the\nMarch 2020 breach\n, GoDaddy notified 28,000 customers that an attacker used their web hosting credentials to connect via SSH in October 2019.\n\"We are constantly improving our security capabilities and have already implemented a number of the requirements in the settlement agreement with the FTC. Notably, the resolution of this matter includes no admission of fault and no monetary penalties,\" GoDaddy told BleepingComputer in January when the FTC\nissued a proposed settlement order\n.\n\"We expect minimal financial impact associated with complying with the terms of the agreement with the FTC. We plan to continue to invest in our defenses to address evolving threats and help keep our customers, their websites and their data safe.\"\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025"
    },
    {
        "Title": "Signal now blocks Microsoft Recall screenshots on Windows 11",
        "Link": "https://www.bleepingcomputer.com/news/security/signal-now-blocks-microsoft-recall-screenshots-on-windows-11/",
        "Summary": "​Signal has updated its Windows app to protect users' privacy by blocking Microsoft's AI-powered Recall feature from taking screenshots of their conversations. [...]",
        "Date": "2025-05-22",
        "Content": "​Signal has updated its Windows app to protect users' privacy by blocking Microsoft's AI-powered Recall feature from taking screenshots of their conversations.\nThis new privacy feature, dubbed \"screen security,\" is now enabled by default on all Windows 11 devices, where Recall continuously takes screenshots of all active windows every few seconds and analyzes them to build a database that can be searched using natural language.\nWhen enabled, screen security will set a Digital Rights Management (DRM) flag on Signal's app windows, blocking their content from being captured by Recall or other Windows apps and features.\nMicrosoft introduced Recall\nin May 2024\nwhen security experts described it as a\nprivacy nightmare\nand a significant security risk because attackers could easily weaponize it to steal user data.\nTo address these concerns, Microsoft made Recall a removable\nopt-in\nfeature that requires users to sign in\nusing Windows Hello\nand upgraded it to\nfilter out sensitive information\n(like credentials and credit card numbers) and to exclude some apps, websites, or private browsing sessions from being captured.\nDavid Weston, Microsoft's VP for Enterprise and OS Security, also said in September that Microsoft added rate-limiting and anti-hammering\nprotection against malware\nattacks to Recall, as well as the ability to adjust storage settings, delete snapshots, and turn off saving snapshots completely.\n\"Although Microsoft made several adjustments over the past twelve months in response to critical feedback, the revamped version of Recall still places any content that's displayed within privacy-preserving apps like Signal at risk,\" Signal developer Joshua Lund\nsaid in a Wednesday blog post\n.\n\"As a result, we are enabling an extra layer of protection by default on Windows 11 in order to help maintain the security of Signal Desktop on that platform even though it introduces some usability trade-offs. Microsoft has simply given us no other option.\"\nSignal's screen security might cause issues with screen readers, so those who want to turn it off can do so from Signal Settings > Privacy > Screen security.\nSignal will also show an alert before turning off screen security, warning that Windows can take screenshots of their Signal chats once the feature is disabled.\nSignal screen security warning (Signal)\n\"Apps like Signal have essentially no control over what content Recall is able to capture, and implementing 'DRM' that works for you (not against you) is the best choice that we had,\" Lund added.\n​\"We hope that the AI teams building systems like Recall will think through these implications more carefully in the future. Apps like Signal shouldn't have to implement 'one weird trick' in order to maintain the privacy and integrity of their services without proper developer tools. People who care about privacy shouldn't be forced to sacrifice accessibility upon the altar of AI aspirations either.\"\nHowever, as Lund added, enabling Signal's screen security on your device will not protect against screenshots or recordings by others using screen readers on macOS or Linux devices.\nIn April, almost one year after its introduction, Microsoft\nstarted rolling out\nWindows Recall to all customers who installed the Windows 11 KB5055627 update on Copilot+ PCs.\nOne month later, the company made it generally available to everyone who installed the May 2025 Patch Tuesday updates.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nWindows 11's Recall AI is now rolling out on Copilot+ PCs\nWindows 11 and Red Hat Linux hacked on first day of Pwn2Own\nWindows 11 upgrade block lifted after Safe Exam Browser fix\nMicrosoft: Windows 11 24H2 now ready to rollout to everyone\nMicrosoft Teams will soon block screen capture during meetings"
    },
    {
        "Title": "Unpatched critical bugs in Versa Concerto lead to auth bypass, RCE",
        "Link": "https://www.bleepingcomputer.com/news/security/unpatched-critical-bugs-in-versa-concerto-lead-to-auth-bypass-rce/",
        "Summary": "Critical vulnerabilities in Versa Concerto that are still unpatched could allow remote attackers to bypass authentication and execute arbitrary code on affected systems. [...]",
        "Date": "2025-05-22",
        "Content": "Critical vulnerabilities in Versa Concerto that are still unpatched could allow remote attackers to bypass authentication and execute arbitrary code on affected systems.\nThree security issues, two of them critical, were publicly disclosed by researchers at the vulnerability management firm ProjectDiscovery after reporting them to the vendor and receiving no confirmation of the bugs being addressed.\nVersa Concerto is the centralized management and orchestration platform for Versa Networks' SD-WAN and SASE (Secure Access Service Edge) solutions.\nIt is used by large enterprises managing complex WAN environments, telecom operators providing managed SD-WAN/SASE services to customers, government agencies that need secure, policy-driven network segmentation, and managed security service providers that handle multi-tenant deployments.\nProjectDiscovery researched the product and\ndiscovered the following flaws\n:\nCVE-2025-34027\n(critical severity score 10/10): a URL decoding inconsistency allows attackers to bypass authentication and access a file upload endpoint. By exploiting a race condition, they can write malicious files to disk and achieve remote code execution using ld.so.preload and a reverse shell\nCVE-2025-34026\n(critical severity score 9.2/10): improper reliance on the X-Real-Ip header lets attackers bypass access controls to sensitive Spring Boot Actuator endpoints. By suppressing the header via a Traefik proxy trick, attackers can extract credentials and session tokens\nCVE-2025-34025\n(high severity score 8.6): a misconfigured Docker setup exposes host binaries to container writes. Attackers can overwrite a binary like 'test' with a reverse shell script, which is then executed by a host cron job, resulting in full host compromise\nThe researchers created a video to demonstrate how CVE-2025-34027 could be exploited in attacks:\nProjectDiscovery reported the vulnerabilities to the vendor on February 13, with a 90-day disclosure period. Versa Networks acknowledge the findings and requested additional details.\nOn March 28, Versa Networks indicated that hotfixes would become available for all affected releases on April 7th.\nFollowing that date, though, Versa no longer responded to the researchers' follow-up communication about the patches.\nWith the 90-day disclosure period expiring on May 13th, ProjectDiscovery decided to publish the full details yesterday to alert Versa Concerto users of the danger.\nIn lack of an official fix, organizations relying on Versa Concerto are recommended to implement temporary mitigations. One suggestion from the researchers is to block semicolons in URLs via reverse proxy or WAF, and to drop requests with 'Connection: X-Real-Ip' to block actuator access abuse.\nBleepingComputer has contacted Versa Networks for a comment on the status of the fixes for the vulnerabilities that ProjectDiscovery disclosed but did not receive and we will update this post once we receive a reply.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nSAP fixes suspected NetWeaver zero-day exploited in attacks\nIvanti fixes EPMM zero-days chained in code execution attacks\nFortinet fixes critical zero-day exploited in FortiVoice attacks\nASUS DriverHub flaw let malicious sites run commands with admin rights\nOutput Messenger flaw exploited as zero-day in espionage attacks"
    },
    {
        "Title": "Picus Launches Exposure Validation to Safely Deprioritize CVEs",
        "Link": "https://www.darkreading.com/application-security/picus-launches-exposure-validation-to-safely-deprioritize-cves",
        "Summary": "No summary available",
        "Date": "2025-05-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/picus-launches-exposure-validation-to-safely-deprioritize-cves"
    },
    {
        "Title": "Following Data Breach, Multiple Stalkerware Apps Go Offline",
        "Link": "https://www.darkreading.com/threat-intelligence/following-data-breach-stalkerware-apps-offline",
        "Summary": "The same easily exploitable vulnerability was found in three of the apps that led to the compromise of victims' data.",
        "Date": "2025-05-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/following-data-breach-stalkerware-apps-offline"
    },
    {
        "Title": "Russian Threat Actor TAG-110 Goes Phishing in Tajikistan",
        "Link": "https://www.darkreading.com/threat-intelligence/russian-threat-actor-tag-110-phishing-tajikistan",
        "Summary": "While Ukraine remains Russia's major target for cyberattacks, TAG-110 is part of a strategy to preserve &quot;a post-Soviet sphere of influence&quot; by embedding itself in other countries' infrastructures.",
        "Date": "2025-05-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/russian-threat-actor-tag-110-phishing-tajikistan"
    },
    {
        "Title": "3am Ransomware Adopts Email Bombing, Vishing Combo Attack",
        "Link": "https://www.darkreading.com/threat-intelligence/3am-ransomware-adopts-email-bombing-vishing",
        "Summary": "The emerging threat group is the latest to adopt the combo attack tactic, which Black Basta and other groups already are using to gain initial access for ransomware deployment.",
        "Date": "2025-05-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/3am-ransomware-adopts-email-bombing-vishing"
    },
    {
        "Title": "UK Retail Cyberattacks May Drive Up US Insurance Premiums",
        "Link": "https://www.darkreading.com/cyber-risk/uk-retail-attacks-drive-cyber-insurance-premiums",
        "Summary": "Insurance experts weigh in how the recent barrage of attacks against UK retailers could affect premium rates and policy requirements, as well as work toward improving risk assessment.",
        "Date": "2025-05-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/uk-retail-attacks-drive-cyber-insurance-premiums"
    },
    {
        "Title": "CISA: Russia's Fancy Bear Targeting Logistics, IT Firms",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/cisa-russia-fancy-bear-targeting-logistics-it-firms",
        "Summary": "The mission is to gather information that could help Russia in its war against Ukraine.",
        "Date": "2025-05-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/cisa-russia-fancy-bear-targeting-logistics-it-firms"
    },
    {
        "Title": "Blurring Lines Between Scattered Spider &amp; Russian Cybercrime",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/blurring-lines-scattered-spider-russian-cybercrime",
        "Summary": "The loosely affiliated hacking group has shifted closer to ransomware gangs, raising questions about Scattered Spider's ties to the Russian cybercrime underground.",
        "Date": "2025-05-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/blurring-lines-scattered-spider-russian-cybercrime"
    },
    {
        "Title": "Security Threats of Open Source AI Exposed by DeepSeek",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/security-threats-open-source-ai-deepseek",
        "Summary": "DeepSeek's risks must be carefully considered, and ultimately mitigated, in order to enjoy the many benefits of generative AI in a manner that is safe and secure for all organizations and users.",
        "Date": "2025-05-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/security-threats-open-source-ai-deepseek"
    },
    {
        "Title": "Keeping LLMs on the Rails Poses Design, Engineering Challenges",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/llms-on-rails-design-engineering-challenges",
        "Summary": "Despite adding alignment training, guardrails, and filters, large language models continue to give up secrets, make unfiltered statements, and provide dangerous information.",
        "Date": "2025-05-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/llms-on-rails-design-engineering-challenges"
    },
    {
        "Title": "GitLab's AI Assistant Opened Devs to Code Theft",
        "Link": "https://www.darkreading.com/application-security/gitlab-ai-assistant-opened-devs-to-code-theft",
        "Summary": "Prompt injection risks in GitLab's AI assistant could have allowed attackers to steal source code, or indirectly deliver developers malware, dirty links, and more.",
        "Date": "2025-05-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/gitlab-ai-assistant-opened-devs-to-code-theft"
    },
    {
        "Title": "SideWinder APT Caught Spying on India's Neighbor Gov'ts",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/sidewinder-apt-spying-indias-neighbor-govts",
        "Summary": "A recent spear-phishing campaign against countries in South Asia aligns with broader political tensions in the region.",
        "Date": "2025-05-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/sidewinder-apt-spying-indias-neighbor-govts"
    },
    {
        "Title": "Oops: DanaBot Malware Devs Infected Their Own PCs",
        "Link": "https://krebsonsecurity.com/2025/05/oops-danabot-malware-devs-infected-their-own-pcs/",
        "Summary": "The U.S. government today unsealed criminal charges against 16 individuals accused of operating and selling DanaBot, a prolific strain of information-stealing malware that has been sold on Russian cybercrime forums since 2018. The FBI says a newer version of DanaBot was used for espionage, and that many of the defendants exposed their real-life identities after accidentally infecting their own systems with the malware.",
        "Date": "2025-05-22",
        "Content": "The U.S. government today unsealed criminal charges against 16 individuals accused of operating and selling DanaBot, a prolific strain of information-stealing malware that has been sold on Russian cybercrime forums since 2018. The FBI says a newer version of DanaBot was used for espionage, and that many of the defendants exposed their real-life identities after accidentally infecting their own systems with the malware.\nDanaBot’s features, as promoted on its support site. Image: welivesecurity.com.\nInitially spotted in May 2018 by researchers at the email security firm Proofpoint, DanaBot is a malware-as-a-service platform that specializes in credential theft and banking fraud.\nToday, the U.S. Department of Justice unsealed a criminal complaint and indictment from 2022, which said the FBI identified at least 40 affiliates who were paying between $3,000 and $4,000 a month for access to the information stealer platform.\nThe government says the malware infected more than 300,000 systems globally, causing estimated losses of more than $50 million. The ringleaders of the DanaBot conspiracy are named as Aleksandr Stepanov, 39, a.k.a. “JimmBee,” and Artem Aleksandrovich Kalinkin, 34, a.k.a. “Onix”, both of Novosibirsk, Russia. Kalinkin is an IT engineer for the Russian state-owned energy giant Gazprom. His Facebook profile name is “Maffiozi.”\nAccording to the FBI, there were at least two major versions of DanaBot; the first was sold between 2018 and June 2020, when the malware stopped being offered on Russian cybercrime forums. The government alleges that the second version of DanaBot — emerging in January 2021 — was provided to co-conspirators for use in targeting military, diplomatic and non-governmental organization computers in several countries, including the United States, Belarus, the United Kingdom, Germany, and Russia.\n“Unindicted co-conspirators would use the Espionage Variant to compromise computers around the world and steal sensitive diplomatic communications, credentials, and other data from these targeted victims,” reads a grand jury indictment dated Sept. 20, 2022. “This stolen data included financial transactions by diplomatic staff, correspondence concerning day-to-day diplomatic activity, as well as summaries of a particular country’s interactions with the United States.”\nThe indictment says the FBI in 2022 seized servers used by the DanaBot authors to control their malware, as well as the servers that stored stolen victim data. The government said the server data also show numerous instances in which the DanaBot defendants infected their own PCs, resulting in their credential data being uploaded to stolen data repositories that were seized by the feds.\n“In some cases, such self-infections appeared to be deliberately done in order to test, analyze, or improve the malware,” the criminal complaint reads. “In other cases, the infections seemed to be inadvertent – one of the hazards of committing cybercrime is that criminals will sometimes infect themselves with their own malware by mistake.”\nImage: welivesecurity.com\nA statement from the DOJ says that as part of today’s operation, agents with the Defense Criminal Investigative Service (DCIS) seized the DanaBot control servers, including dozens of virtual servers hosted in the United States. The government says it is now working with industry partners to notify DanaBot victims and help remediate infections. The statement credits a number of security firms with providing assistance to the government, including ESET, Flashpoint, Google, Intel 471, Lumen, PayPal, Proofpoint, Team CYRMU, and ZScaler.\nIt’s not unheard of for financially-oriented malicious software to be repurposed for espionage. A variant of the ZeuS Trojan, which was used in countless online banking attacks against companies in the United States and Europe between 2007 and at least 2015, was for a time diverted to espionage tasks by its author.\nAs detailed in this 2015 story, the author of the ZeuS trojan created a custom version of the malware to serve purely as a spying machine, which scoured infected systems in Ukraine for specific keywords in emails and documents that would likely only be found in classified documents.\nThe public charging of the 16 DanaBot defendants comes a day after Microsoft joined a slew of tech companies in disrupting the IT infrastructure for another malware-as-a-service offering — Lumma Stealer, which is likewise offered to affiliates under tiered subscription prices ranging from $250 to $1,000 per month. Separately, Microsoft filed a civil lawsuit to seize control over 2,300 domain names used by Lumma Stealer and its affiliates.\nFurther reading:\nDanabot: Analyzing a Fallen Empire\nZScaler blog: DanaBot Launches DDoS Attack Against the Ukrainian Ministry of Defense\nFlashpoint: Operation Endgame DanaBot Malware\nTeam CYRMU: Inside DanaBot’s Infrastructure: In Support of Operation Endgame II\nMarch 2022 criminal complaint v. Artem Aleksandrovich Kalinkin\nSeptember 2022 grand jury indictment naming the 16 defendants\n\r\n         This entry was posted on Thursday 22nd of May 2025 05:53 PM \r\n         \nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "Akamai, Microsoft Disagree on Severity of Unpatched ‘BadSuccessor’ Flaw",
        "Link": "https://www.securityweek.com/akamai-microsoft-disagree-on-severity-of-unpatched-badsuccessor-flaw/",
        "Summary": "<p>Akamai documents a privilege escalation flaw in Windows Server 2025 after Redmond declines to ship an immediate patch.</p>\n<p>The post <a href=\"https://www.securityweek.com/akamai-microsoft-disagree-on-severity-of-unpatched-badsuccessor-flaw/\">Akamai, Microsoft Disagree on Severity of Unpatched ‘BadSuccessor’ Flaw</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/akamai-microsoft-disagree-on-severity-of-unpatched-badsuccessor-flaw/"
    },
    {
        "Title": "Marlboro-Chesterfield Pathology Data Breach Impacts 235,000 People",
        "Link": "https://www.securityweek.com/marlboro-chesterfield-pathology-data-breach-impacts-235000-people/",
        "Summary": "<p>Marlboro-Chesterfield Pathology has been targeted by the SafePay ransomware group, which stole personal information from its systems.</p>\n<p>The post <a href=\"https://www.securityweek.com/marlboro-chesterfield-pathology-data-breach-impacts-235000-people/\">Marlboro-Chesterfield Pathology Data Breach Impacts 235,000 People</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/marlboro-chesterfield-pathology-data-breach-impacts-235000-people/"
    },
    {
        "Title": "Marks & Spencer Expects Ransomware Attack to Cost $400 Million",
        "Link": "https://www.securityweek.com/marks-spencer-expects-ransomware-attack-to-cost-400-million/",
        "Summary": "<p>UK retailer Marks &#038; Spencer expects the disruptions caused by the recent cyberattack to continue through July. </p>\n<p>The post <a href=\"https://www.securityweek.com/marks-spencer-expects-ransomware-attack-to-cost-400-million/\">Marks &#038; Spencer Expects Ransomware Attack to Cost $400 Million</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/marks-spencer-expects-ransomware-attack-to-cost-400-million/"
    },
    {
        "Title": "Taming the Hacker Storm: Why Millions in Cybersecurity Spending Isn’t Enough",
        "Link": "https://www.securityweek.com/taming-the-hacker-storm-why-millions-in-cybersecurity-spending-isnt-enough/",
        "Summary": "<p>Despite massive investment, the explosion of sophisticated malware and deepfake attacks persists because organizations struggle to verify digital identities and establish fundamental trust.</p>\n<p>The post <a href=\"https://www.securityweek.com/taming-the-hacker-storm-why-millions-in-cybersecurity-spending-isnt-enough/\">Taming the Hacker Storm: Why Millions in Cybersecurity Spending Isn&#8217;t Enough</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/taming-the-hacker-storm-why-millions-in-cybersecurity-spending-isnt-enough/"
    },
    {
        "Title": "Security Theater or Real Defense? The KPIs That Tell the Truth",
        "Link": "https://www.securityweek.com/security-theater-or-real-defense-the-kpis-that-tell-the-truth/",
        "Summary": "<p>In the end, cybersecurity isn’t just about collecting data. It’s about proving that your defenses actually work.</p>\n<p>The post <a href=\"https://www.securityweek.com/security-theater-or-real-defense-the-kpis-that-tell-the-truth/\">Security Theater or Real Defense? The KPIs That Tell the Truth</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/security-theater-or-real-defense-the-kpis-that-tell-the-truth/"
    },
    {
        "Title": "Cisco Patches High-Severity DoS, Privilege Escalation Vulnerabilities",
        "Link": "https://www.securityweek.com/cisco-patches-high-severity-dos-privilege-escalation-vulnerabilities/",
        "Summary": "<p>Cisco published 10 security advisories detailing over a dozen vulnerabilities, including two high-severity flaws in its Identity Services Engine (ISE) and Unified Intelligence Center.</p>\n<p>The post <a href=\"https://www.securityweek.com/cisco-patches-high-severity-dos-privilege-escalation-vulnerabilities/\">Cisco Patches High-Severity DoS, Privilege Escalation Vulnerabilities</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cisco-patches-high-severity-dos-privilege-escalation-vulnerabilities/"
    },
    {
        "Title": "GitLab, Atlassian Patch High-Severity Vulnerabilities",
        "Link": "https://www.securityweek.com/gitlab-atlassian-patch-high-severity-vulnerabilities/",
        "Summary": "<p>GitLab and Atlassian have released patches for over a dozen vulnerabilities in their products, including high-severity bugs.</p>\n<p>The post <a href=\"https://www.securityweek.com/gitlab-atlassian-patch-high-severity-vulnerabilities/\">GitLab, Atlassian Patch High-Severity Vulnerabilities</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-22",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/gitlab-atlassian-patch-high-severity-vulnerabilities/"
    },
    {
        "Title": "Alleged Data Breach Impacts Prominent Chinese Q&A Platform Zhihu",
        "Link": "https://dailydarkweb.net/alleged-data-breach-impacts-prominent-chinese-qa-platform-zhihu/",
        "Summary": "<p>Zhihu, a prominent Chinese Q&#38;A website similar to Quora, has allegedly suffered a significant data breach. An individual claims to have exfiltrated IP traffic and a &#8220;full database&#8221; from the platform. The alleged attacker detailed their methodology, stating they captured IP traffic from the website and were able to decrypt certain information. They further assert [&#8230;]</p>\n<p>The post <a href=\"https://dailydarkweb.net/alleged-data-breach-impacts-prominent-chinese-qa-platform-zhihu/\">Alleged Data Breach Impacts Prominent Chinese Q&#038;A Platform Zhihu</a> appeared first on <a href=\"https://dailydarkweb.net\">Daily Dark Web</a>.</p>",
        "Date": "2025-05-22",
        "Content": "Zhihu, a prominent Chinese Q&A website similar to Quora, has allegedly suffered a significant data breach. An individual claims to have exfiltrated IP traffic and a “full database” from the platform.\nThe alleged attacker detailed their methodology, stating they captured IP traffic from the website and were able to decrypt certain information. They further assert that gaining access to project management accounts facilitated the subsequent data extraction.\nEvidence presented by the individual includes links to files allegedly containing captured network traffic, decrypted data, and images described as “proof of access.” The alleged full database is also purportedly available through a provided link.\nFurther details regarding the alleged breach’s target information and how it was breached were also shared through external links.\nTags:\nAlleged Incident\nChina\nCyberSecurity\ndata-breach\ndata-leak\nonline security\nZhihu"
    },
    {
        "Title": "Coca-Cola Europacific Partners Allegedly Suffers Major Salesforce Data Breach",
        "Link": "https://dailydarkweb.net/coca-cola-europacific-partners-allegedly-suffers-major-salesforce-data-breach/",
        "Summary": "<p>Coca-Cola Europacific Partners (CCEP), one of the world&#8217;s largest independent Coca-Cola bottlers, has allegedly experienced a significant data breach impacting its Salesforce dashboard. The breach, which reportedly occurred in early May, is said to have resulted in the exfiltration of a substantial volume of data, including accounts, contacts, products, and cases. The alleged attackers claim [&#8230;]</p>\n<p>The post <a href=\"https://dailydarkweb.net/coca-cola-europacific-partners-allegedly-suffers-major-salesforce-data-breach/\">Coca-Cola Europacific Partners Allegedly Suffers Major Salesforce Data Breach</a> appeared first on <a href=\"https://dailydarkweb.net\">Daily Dark Web</a>.</p>",
        "Date": "2025-05-22",
        "Content": "Coca-Cola Europacific Partners (CCEP), one of the world’s largest independent Coca-Cola bottlers, has allegedly experienced a significant data breach impacting its Salesforce dashboard. The breach, which reportedly occurred in early May, is said to have resulted in the exfiltration of a substantial volume of data, including accounts, contacts, products, and cases.\nThe alleged attackers claim responsibility for recent data breaches affecting other major corporations. The compromised data, spanning from 2016 to 2025, reportedly includes:\nSalesforce Accounts:\n6 GB (7.5 million records)\nSalesforce Cases:\n52 GB (9.5 million records)\nSalesforce Contacts:\n5 GB (6 million+ records)\nSalesforce Products:\n300 MB (400,000+ records)\nSamples of the allegedly stolen data, including account, case, contact, and product details, have been publicly shared as proof of access. The individuals claiming responsibility for the breach are reportedly “open to offers” for the stolen data.\nThis incident, if confirmed, represents a serious cybersecurity concern for CCEP and highlights the ongoing threat posed by data breaches to multinational corporations.\nTags:\nCoca Cola\nCoca-Cola Europacific Partners\nCyberSecurity\ndata exfiltration\ndata-breach\nSalesforce"
    }
]