[
    {
        "Title": "Iranian Hacker Pleads Guilty in $19 Million Robbinhood Ransomware Attack on Baltimore",
        "Link": "https://thehackernews.com/2025/05/iranian-hacker-pleads-guilty-in-19.html",
        "Summary": "An Iranian national has pleaded guilty in the U.S. over his involvement in an international ransomware and extortion scheme involving the Robbinhood ransomware.\nSina Gholinejad (aka Sina Ghaaf), 37, and his co-conspirators are said to have breached the computer networks of various organizations in the United States and encrypted files with Robbinhood ransomware to demand Bitcoin ransom payments.",
        "Date": "2025-05-28",
        "Content": "An Iranian national has pleaded guilty in the U.S. over his involvement in an international ransomware and extortion scheme involving the Robbinhood ransomware.\nSina Gholinejad (aka Sina Ghaaf), 37, and his co-conspirators are said to have breached the computer networks of various organizations in the United States and encrypted files with Robbinhood ransomware to demand Bitcoin ransom payments.\nGholinejad, who was arrested in North Carolina in early January, pleaded guilty to one count of computer fraud and abuse and one count of conspiracy to commit wire fraud. He faces a maximum penalty of 30 years in prison. He is scheduled for sentencing in August 2025.\n\"These cyber attacks caused significant disruptions and tens of millions in losses, including to the City of Greenville, North Carolina, and the City of Baltimore, Maryland,\" the U.S. Department of Justice (DoJ)\nsaid\n.\n\"Baltimore lost more than $19 million from the damage caused to their computer networks and the resulting disruption to several essential city services, including online services for processing property taxes, water bills, parking citations, and other revenue-generating functions, which lasted many months.\"\nAccording to court documents, Gholinejad and others infiltrated and maintained unauthorized access to victim computer networks between January 2019 and March 2024, after which sensitive information was copied to virtual private servers under their control and deployed the ransomware strain.\nThe ill-gotten proceeds were laundered through cryptocurrency mixing services and by moving assets between different types of cryptocurrencies, a technique known as chain-hopping. The threat actors also concealed their identities and activities by using virtual private networks and servers.\nRobbinhood was one of the cybercrime actors to\nlatch onto\nbring your own vulnerable driver (BYOVD) attacks, employing a legitimate but vulnerable Gigabyte driver (gdrv.sys) to escalate privileges and disarm security software.\n\"Cybercrime is not a victimless offense – it is a direct attack on our communities, as seen in this case. Gholinejad and his co-conspirators orchestrated a ransomware scheme that disrupted lives, businesses, and local governments, and resulted in losses of tens of millions of dollars from unsuspecting victims and institutions,\" said acting U. S. Attorney Daniel P. Bubar for the Eastern District of North Carolina.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Czech Republic Blames China-Linked APT31 Hackers for 2022 Cyberattack",
        "Link": "https://thehackernews.com/2025/05/czech-republic-blames-china-linked.html",
        "Summary": "The Czech Republic on Wednesday formally accused a threat actor associated with the People's Republic of China (PRC) of targeting its Ministry of Foreign Affairs.\nIn a public statement, the government said it identified China as the culprit behind a malicious campaign targeting one of the unclassified networks of the Czech Ministry of Foreign Affairs. The extent of the breach is presently not",
        "Date": "2025-05-28",
        "Content": "The Czech Republic on Wednesday formally accused a threat actor associated with the People's Republic of China (PRC) of targeting its Ministry of Foreign Affairs.\nIn a public statement, the government said it identified China as the culprit behind a malicious campaign targeting one of the unclassified networks of the Czech Ministry of Foreign Affairs. The extent of the breach is presently not known.\n\"The malicious activity [...] lasted from 2022 and affected an institution designated as Czech critical infrastructure,\" it\nadded\n.\nThe attack has been attributed to a state-sponsored threat actor tracked as\nAPT31\n, which also overlaps with threat clusters known as Altaire, Bronze Vinewood, Judgement Panda, PerplexedGoblin, RedBravo, Red Keres, and Violet Typhoon (formerly Zirconium).\nThe hacking group, publicly associated with the Ministry of State Security (MSS) and the Hubei State Security Department, is assessed to be active since at least 2010, per the U.S. Department of Justice (DoJ).\nBronze Vinewood is known to employ a variety of tools and techniques to gain access to target environments, while also relying on public code or file-sharing websites for its command and control (C2) domains to complicate network-based detection and intersperse C2 traffic amid legitimate web browsing activity.\nAccording to Sophos-owned Secureworks, the adversarial crew has a\nparticular focus\non organizations operating in government or defense supply chains, or providing services to those organizations.\nIn March 2024, the DoJ\nindicted\nseven hackers associated with APT31, accusing them of engaging in sweeping cyber espionage attacks aimed at U.S. and foreign critics, journalists, businesses, and political officials to advance MSS's foreign intelligence and economic espionage objectives.\nAround the same time, the Police of Finland\ncalled out\nthe threat actor for orchestrating a cyber attack targeting the country's Parliament in 2020.\nAs recently as this month, ESET\nrevealed\nin its latest APT Activity Report that APT31 targeted a Central European government entity in December 2024 to deploy an espionage backdoor referred to as NanoSlate. While Czechia is a Central European nation, it's currently not clear if these attacks are related.\nStrongly condemning\nthe malicious cyber campaign, the Government of the Czech Republic said \"such behavior undermines the credibility of the People's Republic of China and contradicts its public declarations.\"\nThe government further said the activities are in violation of responsible State behavior in cyberspace as endorsed by members of the United Nations. It called on China to adhere to these norms and refrain from staging such attacks in the future.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft OneDrive File Picker Flaw Grants Apps Full Cloud Access — Even When Uploading Just One File",
        "Link": "https://thehackernews.com/2025/05/microsoft-onedrive-file-picker-flaw.html",
        "Summary": "Cybersecurity researchers have discovered a security flaw in Microsoft's OneDrive File Picker that, if successfully exploited, could allow websites to access a user's entire cloud storage content, as opposed to just the files selected for upload via the tool.\n\"This stems from overly broad OAuth scopes and misleading consent screens that fail to clearly explain the extent of access being granted,",
        "Date": "2025-05-28",
        "Content": "Cybersecurity researchers have discovered a security flaw in Microsoft's OneDrive File Picker that, if successfully exploited, could allow websites to access a user's entire cloud storage content, as opposed to just the files selected for upload via the tool.\n\"This stems from overly broad OAuth scopes and misleading consent screens that fail to clearly explain the extent of access being granted,\" the Oasis Research Team\nsaid\nin a report shared with The Hacker News. \"This flaw could have severe consequences, including customer data leakage and violation of compliance regulations.\"\nIt's assessed that several apps are affected, such as ChatGPT, Slack, Trello, and ClickUp, given their integration with Microsoft's cloud service.\nThe problem, Oasis said, is the result of excessive permissions requested by the OneDrive File Picker, which seeks read access to the entire drive, even in cases only a single file is uploaded due to the absence of fine-grained OAuth scopes for OneDrive.\nCompounding matters further, the consent prompt users are presented with prior to a file upload is vague and does not adequately convey the level of access being granted, thereby exposing users to unexpected security risks.\n\"The lack of fine-grained scopes makes it impossible for users to distinguish between malicious apps that target all files and legitimate apps that ask for excessive permissions simply because there is no other secure option,\" Oasis noted.\nThe New York-based security company further pointed out that the OAuth tokens used to authorize access are often stored insecurely, adding they are saved in the browser's session storage in plaintext format.\nAnother potential pitfall is that the authorization workflows may also involve issuing a refresh token, granting the application ongoing access to user data by allowing it to get new access tokens without having to ask the user to log in again when the current token expires.\nFollowing responsible disclosure, Microsoft has acknowledged the problem, although there is no fix as yet. In the interim, it's worth considering temporarily removing the option to upload files using OneDrive through OAuth until a secure alternative is in place. Alternately, it's advised to avoid using refresh tokens and store access tokens in a secure manner and get rid of them when no longer needed.\nThe Hacker News has reached out to Microsoft for further comment, and we will update the story if we hear back.\n\"The lack of fine-grained OAuth scopes combined with Microsoft's vague user prompt is a dangerous combination that puts both personal and enterprise users at risk,\" Oasis said. \"This discovery reinforces the importance of continuous vigilance in OAuth scope management, regular security assessments, and proactive monitoring to protect user data.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "New PumaBot Botnet Targets Linux IoT Devices to Steal SSH Credentials and Mine Crypto",
        "Link": "https://thehackernews.com/2025/05/new-pumabot-botnet-targets-linux-iot.html",
        "Summary": "Embedded Linux-based Internet of Things (IoT) devices have become the target of a new botnet dubbed PumaBot.\nWritten in Go, the botnet is designed to conduct brute-force attacks against SSH instances to expand in size and scale and deliver additional malware to the infected hosts.\n\"Rather than scanning the internet, the malware retrieves a list of targets from a command-and-control (C2) server",
        "Date": "2025-05-28",
        "Content": "Embedded Linux-based Internet of Things (IoT) devices have become the target of a new botnet dubbed\nPumaBot\n.\nWritten in Go, the botnet is designed to conduct\nbrute-force attacks against SSH instances\nto expand in size and scale and deliver additional malware to the infected hosts.\n\"Rather than scanning the internet, the malware retrieves a list of targets from a command-and-control (C2) server and attempts to brute force SSH credentials,\" Darktrace\nsaid\nin an analysis shared with The Hacker News. \"Upon gaining access, it receives remote commands and establishes persistence using system service files.\"\nThe botnet malware is designed to obtain initial access via successfully brute-forcing SSH credentials across a list of harvested IP addresses with open SSH ports. The list of IP addresses to target is retrieved from an external server (\"ssh.ddos-cc[.]org\").\nAs part of its brute-force attempts, the malware also performs various checks to determine if the system is suitable and is not a honeypot. Furthermore, it checks the presence of the string \"Pumatronix,\" a manufacturer of surveillance and traffic camera systems, indicating either an attempt to specifically single them out or exclude them.\nThe malware then proceeds to collect and exfiltrate basic system information to the C2 server, after which it sets up persistence and executes commands received from the server.\n\"The malware writes itself to /lib/redis, attempting to disguise itself as a legitimate Redis system file,\" Darktrace said. \"It then creates a persistent systemd service in /etc/systemd/system, named either redis.service or mysqI.service (note the spelling of mysql with a capital I) depending on what has been hardcoded into the malware.\"\nIn doing so, it allows the malware to give the impression that it's benign and also survive reboots. Two of the commands executed by the botnet are \"xmrig\" and \"networkxm\" indicating that the compromised devices are being used to mine cryptocurrency in an illicit manner.\nHowever, the commands are launched without specifying the full paths, an aspect that signals that the payloads are likely downloaded or unpacked elsewhere on the infected host. Darktrace said its analysis of the campaign uncovered other related binaries that are said to be deployed as part of a broader campaign -\nddaemon, a Go-based backdoor which is retrieve the binary \"networkxm\" into \"/usr/src/bao/networkxm\" and execute the shell script \"installx.sh\"\nnetworkxm, an SSH brute-force tool that functions similar to the botnet's initial stage by fetching a password list from a C2 server and attempts to connect via SSH across a list of target IP addresses\ninstallx.sh, which is used to retrieve another shell script \"jc.sh\" from \"1.lusyn[.]xyz,\" grant it read, write, and execute permissions for all access levels, run the script, and clear bash history\njc.sh, which is configured to download a malicious \"pam_unix.so\" file from an external server and use it to replace the legitimate counterpart installed on the machine, as well as retrieve and run another binary named \"1\" from the same server\npam_unix.so, which acts as a rootkit that steals credentials by intercepting successful logins and writing them to the file \"/usr/bin/con.txt\"\n1, which is used to monitor for the file \"con.txt\" being written or moved to \"/usr/bin/\" and then exfiltrate its contents to the same server\nGiven that the SSH brute-force capabilities of the botnet malware lends it worm-like capabilities, users are required to keep an eye out for anomalous SSH login activity, particularly failed login attempts, audit systemd services regularly, review authorized_keys files for the presence of unknown SSH keys, apply strict firewall rules to limit exposure, and filter HTTP requests with non-standard headers, such as X-API-KEY: jieruidashabi.\n\"The botnet represents a persistent Go-based SSH threat that leverages automation, credential brute-forcing, and native Linux tools to gain and maintain control over compromised systems,\" Darktrace said.\n\"By mimicking legitimate binaries (e.g., Redis), abusing systemd for persistence, and embedding fingerprinting logic to avoid detection in honeypots or restricted environments, it demonstrates an intent to evade defenses.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "From Infection to Access: A 24-Hour Timeline of a Modern Stealer Campaign",
        "Link": "https://thehackernews.com/2025/05/from-infection-to-access-24-hour.html",
        "Summary": "Stealer malware no longer just steals passwords. In 2025, it steals live sessions—and attackers are moving faster and more efficiently than ever.\nWhile many associate account takeovers with personal services, the real threat is unfolding in the enterprise. Flare’s latest research, The Account and Session Takeover Economy, analyzed over 20 million stealer logs and tracked attacker activity across",
        "Date": "2025-05-28",
        "Content": "Stealer malware no longer just steals passwords. In 2025, it steals live sessions—and attackers are moving faster and more efficiently than ever.\nWhile many associate account takeovers with personal services, the real threat is unfolding in the enterprise. Flare's latest research,\nThe Account and Session Takeover Economy\n, analyzed over\n20 million stealer logs\nand tracked attacker activity across Telegram channels and dark web marketplaces. The findings expose how cybercriminals weaponize infected employee endpoints to hijack enterprise sessions—often in less than 24 hours.\nHere's the real timeline of a modern session hijacking attack.\nInfection and Data Theft in Under an Hour\nOnce a victim runs a malicious payload—typically disguised as cracked software, fake updates, or phishing attachments—commodity stealers like Redline (44% of logs), Raccoon (25%), and LummaC2 (18%) take over.\nThese malware kits:\nExtract browser cookies, saved credentials, session tokens, and crypto wallets\nAutomatically exfiltrate data to Telegram bots or command-and-control servers within minutes\nFeed over 16 million logs into just 10 Telegram channels alone, sorted by session type, location, and app\nSession Tokens: The New Currency\nWithin hours, cybercriminals sift through stolen data, focusing on high-value session tokens:\n44% of logs contain Microsoft session data\n20% include Google sessions\nOver 5% expose tokens from AWS, Azure, or GCP cloud services\nUsing Telegram bot commands, attackers filter logs by geography, application, and privilege level. Marketplace listings include browser fingerprint data and ready-made login scripts that bypass MFA.\nPricing for stolen sessions varies widely, with consumer accounts typically selling for $5 to $20, while enterprise-level AWS or Microsoft sessions can fetch $1,200 or more.\nFull Account Access Within Hours\nOnce session tokens are purchased, attackers import them into anti-detect browsers, gaining seamless access to business-critical platforms without triggering MFA or login alerts.\nThis isn't about personal accounts being misused. It's about attackers infiltrating corporate environments, where they quickly:\nAccess business email like Microsoft 365 or Gmail\nEnter internal tools such as Slack, Confluence, or admin dashboards\nExfiltrate sensitive data from cloud platforms\nDeploy ransomware or move laterally across systems\nFlare analyzed a single stealer log that included live, ready-to-use access to Gmail, Slack, Microsoft 365, Dropbox, AWS, and PayPal—all tied to a single infected machine. In the wrong hands, this level of session access can escalate into a serious breach within hours.\nWhy This Matters: The Scale of the Threat\nThis is no outlier. It is a\nmassive, industrialized underground market\nenabling ransomware gangs, fraudsters, and espionage groups:\nMillions of valid sessions are stolen and sold weekly\nTokens remain active for days, allowing persistent access\nSession hijacking bypasses MFA, leaving many organizations blind to breaches\nThese attacks don't result from breaches at Microsoft, Google, AWS, or other service providers. Instead, they stem from individual users getting infected by stealer malware, which silently exfiltrates their credentials and live session tokens. Attackers then exploit this user-level access to impersonate employees, steal data, and escalate privileges.\nAccording to\nVerizon's 2025 DBIR\n, 88% of breaches involved stolen credentials, highlighting just how central identity-based attacks have become.\nIf you're only watching for stolen passwords or failed login attempts, you're missing the biggest attack vector.\nHow to Defend Your Organization\nSession tokens are as critical as passwords and require a new defense mindset:\nRevoke all active sessions immediately after endpoint compromise; password resets alone don't stop attackers\nMonitor network traffic for Telegram domains, a key exfiltration channel\nUse browser fingerprinting and anomaly detection to flag suspicious session use from unknown devices or locations\nAdapting defenses to this new reality is essential for stopping fast-moving threat actors.\nDive Deeper with Flare\nOur full report covers:\nThe most common malware families used in attacks\nDetailed token pricing by access type\nScreenshots of Telegram bots and marketplace listings\nActionable recommendations for detection and response\nExplore our extensive dataset yourself by starting a\nfree trial\n. Search millions of stealer logs, identify exposed sessions, and get ahead of attackers.\nRead the full report\n|\nStart your free trial\nNote:\nThis article is expertly written and contributed by Eric Clay, who has experience in governance, risk and compliance, security data analysis, and security research. He currently serves as the CMO at Flare, a Threat Exposure Management SaaS solution.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Mimo Hackers Exploit CVE-2025-32432 in Craft CMS to Deploy Cryptominer and Proxyware",
        "Link": "https://thehackernews.com/2025/05/mimo-hackers-exploit-cve-2025-32432-in.html",
        "Summary": "A financially motivated threat actor has been observed exploiting a recently disclosed remote code execution flaw affecting the Craft Content Management System (CMS) to deploy multiple payloads, including a cryptocurrency miner, a loader dubbed Mimo Loader, and residential proxyware.\nThe vulnerability in question is CVE-2025-32432, a maximum severity flaw in Craft CMS that was patched in",
        "Date": "2025-05-28",
        "Content": "A financially motivated threat actor has been observed exploiting a recently disclosed remote code execution flaw affecting the Craft Content Management System (CMS) to deploy multiple payloads, including a cryptocurrency miner, a loader dubbed Mimo Loader, and residential proxyware.\nThe vulnerability in question is\nCVE-2025-32432\n, a maximum severity flaw in Craft CMS that was patched in versions 3.9.15, 4.14.15, and 5.6.17. The existence of the security defect was first disclosed in April 2025 by Orange Cyberdefense SensePost after it was observed in attacks earlier this February.\nAccording to a new report published by Sekoia, the threat actors behind the campaign weaponized CVE-2025-32432 to obtain unauthorized access to the target systems and then deploy a web shell to enable persistent remote access.\nThe web shell is then used to download and execute a shell script (\"4l4md4r.sh\") from a remote server using curl, wget, or the Python library urllib2.\n\"Regarding the use of Python, the attacker imports the urllib2 library under the alias fbi. This unusual naming choice may be an intentional reference — possibly a tongue-in-cheek nod to the American federal agency — and stands out as a distinctive coding choice,\" Sekoia researchers Jeremy Scion and Pierre Le Bourhis\nsaid\n.\n\"This naming convention could serve as a useful indicator for detection, especially in threat hunting or retroactive analysis of suspicious Python activity.\"\nThe shell script, for its part, first checks for indicators or prior infection, as well as uninstalls any version of a known cryptocurrency miner. It also terminates all active XMRig processes and other competing cryptomining tools, if any, before delivering next-stage payloads and launching an ELF binary named \"4l4md4r.\"\nThe executable, known as Mimo Loader, modifies \"/etc/ld.so.preload,\" a file read by the dynamic linker, to hide the presence of the malware process (\"alamdar.so\"). The ultimate goal of the loader is to deploy the IPRoyal proxyware and the XMRig miner on the compromised host.\nThis allows the threat actor to not only abuse the system resources for illicit cryptocurrency mining, but also monetize the victim's internet bandwidth for other malicious activities -- techniques commonly referred to as\ncryptojacking and proxyjacking\n, respectively.\nThe threat activity has been attributed to an intrusion set dubbed Mimo (aka Mimo), which is believed to be active since March 2022, previously relying on vulnerabilities in Apache Log4j (CVE-2021-44228), Atlassian Confluence (CVE-2022-26134), PaperCut (CVE-2023–27350), and Apache ActiveMQ (CVE-2023-46604) to deploy the miner.\nThe hacking group, per a report\npublished\nby AhnLab in January 2024, has also been observed staging ransomware attacks in 2023 using a Go-based strain known as Mimus, which is a fork of the open-source MauriCrypt project.\nSekoia said the exploitation efforts originate from a Turkish IP address (\"85.106.113[.]168\") and that it uncovered open-source evidence that points to Mimo being a threat actor who is physically located in the country.\n\"Initially identified in early 2022, the Mimo intrusion set has been characterised by its consistent exploitation of vulnerabilities for the purpose of cryptominer deployment,\" the French cybersecurity company said. \"Ongoing investigation confirms that Mimo remains active and operational, continuing to exploit newly disclosed vulnerabilities.\"\n\"The short timeframe observed between the publication of CVE-2025-32432, the release of a corresponding proof-of-concept (PoC), and its subsequent adoption by the intrusion set, reflects a high level of responsiveness and technical agility.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "How 'Browser-in-the-Middle' Attacks Steal Sessions in Seconds",
        "Link": "https://thehackernews.com/2025/05/how-browser-in-middle-attacks-steal.html",
        "Summary": "Would you expect an end user to log on to a cybercriminal’s computer, open their browser, and type in their usernames and passwords? Hopefully not! But that’s essentially what happens if they fall victim to a Browser-in-the-Middle (BitM) attack.\nLike Man-in-the-Middle (MitM) attacks, BiTM sees criminals look to control the data flow between the victim’s computer and the target service, as",
        "Date": "2025-05-28",
        "Content": "Would you expect an end user to log on to a cybercriminal's computer, open their browser, and type in their usernames and passwords? Hopefully not! But that's essentially what happens if they fall victim to a Browser-in-the-Middle (BitM) attack.\nLike Man-in-the-Middle (MitM) attacks, BiTM sees criminals look to\ncontrol the data flow between the victim's computer and the target service\n, as University of Salento researchers Franco Tommasi, Christian Catalano, and Ivan Taurino have outlined in a paper for the International Journal of Information Security. However, there are several key differences.\nMan-in-the-Middle vs Browser-in-the-Middle\nA MiTM attack utilizes a proxy server that places itself between the victim's browser and the legitimate target service at the application layer. It needs some kind of malware to be placed and run on the victim's computer.\nBut a BiTM attack is different. Instead, the victim thinks they're using their own browser – conducting their normal online banking, for instance – when instead they're actually running a transparent remote browser.\nAs the paper notes, it's as though the user were \"sitting in front of the attacker's computer, using the attacker's keyboard\", meaning the attacker can capture, record, and alter the data exchange between the victim and the service they're accessing.\nAnatomy of a BiTM attack\nSo how does it work? A typical BitM attack occurs in three phases:\nPhishing:\nThe victim is tricked into clicking on a malicious hyperlink that points to the attacker's server and authenticates their web application.\nFake browser:\nThe victim is connected to the attacker's server and to the transparent web browser via the insertion of malicious javascript. The attack will utilize programs such as keyloggers to empower the criminals to intercept and utilize the victim's data.\nTargeting web applications:\nThe victim uses all their usual services online, without realizing that they are utilizing a transparent browser. Their credentials are now exposed to the criminal.\nSession tokens\nThe attack works by\ntargeting session tokens\n. This enables the attackers to subvert even multi-factor authentication (MFA); once the user has finished their MFA, a session token is usually stored in their browser.\nAs researchers from Google subsidiary Mandiant have noted\n, if the token itself can be stolen, then MFA no longer matters:\n\"Stealing this session token is the equivalent of stealing the authenticated session, meaning an adversary would no longer need to perform the MFA challenge.\" This makes the tokens a useful target for both red team operators – who test a system's defenses – and more worryingly, genuine adversaries.\nBy employing a BitM framework in targeting authenticated session tokens, attackers enjoy the benefits of a rapid targeting capability, as they can reach any website in just seconds with little need for configuration, notes Mandiant. When an application is targeted, the legitimate site is served through the attacker-controlled browser, making it extremely difficult for the victim to tell the difference between a real site and its fake counterpart.\nCookies or OAuth tokens are snatched just before encryption, while rapid exfiltration means the stolen tokens can be relayed to attacker servers in seconds.\nMitigation strategies\nThese sophisticated attacks can cause significant damage, but there are ways to avoid or mitigate the consequences. At the widest level, users must always take extreme care over the links they access, perhaps previewing the site before actually clicking on any links. Here are some other options:\nExtension control\n: It could make sense to\nenforce enterprise-wide whitelists/blacklists via browser policies\n, permitting system access only for approved actions or entities. However, it's a blunt tool and can be time-consuming to enforce.\nToken hardening\n: Issue short-lived, rotating tokens with sliding expiration. This provides in-built security in the case of stolen or\nleaked tokens\n.\nContent Security Policy (CSP)\n: A robust CSP tool\nenables developers to lock down applications, reducing vulnerability to content injection\nand other threats.\nBehavioral monitoring\n: Send any browser-level telemetry to\nsecurity information and event management (SIEM) tools\n. Alert on unusual API calls or token refresh patterns.\nBrowser isolation\n: Run risky sites in sandboxed containers or remote browsing services.\nTest your defenses:\nQuarterly red-team drills that address browser-based threats can also help identify any vulnerabilities in your browsers.\nPasswords in a New Era\nThe conclusion is depressingly clear: BiTM attacks can circumvent traditional security approaches, even enabling criminals to intercept usernames and passwords. So does this make passwords irrelevant?\nThe answer is a resounding 'no'. By instituting multi-factor authentication (MFA) – including robust passwords – you still make life harder for cybercriminals,\nparticularly if they fail to capture the session token right away\n.\nEven as attackers become more sophisticated, you need to keep an eye on the basics. Passwords remain a vital component of MFA – in fact, for most organizations, they likely remain the first line of defense. Frustrate cybercriminals by protecting your passwords, no matter how they attack.\nSpecops Password Policy\nensures your Active Directory passwords are up to scratch at all times. You can enforce stronger password policies while also continuously scanning your Active Directory for over 4 billion compromised passwords. Combined with effective MFA such as\nSpecops Secure Access\n, you'll protect your end users at both the password and logon steps. Need assistance with MFA or password security?\nReach out for a chat\n.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "251 Amazon-Hosted IPs Used in Exploit Scan Targeting ColdFusion, Struts, and Elasticsearch",
        "Link": "https://thehackernews.com/2025/05/251-amazon-hosted-ips-used-in-exploit.html",
        "Summary": "Cybersecurity researchers have disclosed details of a coordinated cloud-based scanning activity that targeted 75 distinct \"exposure points\" earlier this month.\nThe activity, observed by GreyNoise on May 8, 2025, involved as many as 251 malicious IP addresses that are all geolocated to Japan and hosted by Amazon.\n\"These IPs triggered 75 distinct behaviors, including CVE exploits,",
        "Date": "2025-05-28",
        "Content": "Cybersecurity researchers have disclosed details of a coordinated cloud-based scanning activity that targeted 75 distinct \"exposure points\" earlier this month.\nThe activity, observed by GreyNoise on May 8, 2025, involved as many as 251 malicious IP addresses that are all geolocated to Japan and hosted by Amazon.\n\"These IPs triggered 75 distinct behaviors, including CVE exploits, misconfiguration probes, and recon activity,\" the threat intelligence firm\nsaid\n. \"All IPs were silent before and after the surge, indicating temporary infrastructure rental for a single operation.\"\nThe scanning efforts have been found to have targeted a wide array of technologies from Adobe ColdFusion, Apache Struts, Apache Tomcat, Drupal, Elasticsearch, and Oracle WebLogic, among others.\nThe opportunistic operation ranged from exploitation attempts for known CVEs to probes for misconfigurations and other weak points in web infrastructure, indicating that the threat actors were looking indiscriminately for any susceptible system\nAdobe ColdFusion — CVE-2018-15961 (Remote code execution)\nApache Struts — CVE-2017-5638 (OGNL injection)\nAtlassian Confluence — CVE-2022-26134 (OGNL Injection)\nBash — CVE-2014-6271 (Shellshock)\nElasticsearch — CVE-2015-1427 (Groovy sandbox bypass and remote code execution)\nCGI script scanning\nEnvironment variable exposure\nGit config crawlers\nShell upload checks, and\nWordPress author checks\nAn interesting aspect is that the broad-spectrum scan was active only on May 8, with no noticeable change in the activity before or after the date.\nGreyNoise said 295 IP addresses were scanned for CVE-2018-15961, 265 IPs for Apache Struts, and 260 IPs for CVE-2015-1427. Out of these, 262 IPs overlapped between ColdFusion and Struts and 251 IPs overlapped across all the three vulnerability scans.\n\"This level of overlap points to a single operator or toolset deployed across many temporary IPs — an increasingly common pattern in opportunistic but orchestral scanning,\" GreyNoise said.\nTo mitigate the activity, organizations are required to block the malicious IP addresses immediately, although it bears noting that follow-up exploitation may emanate from different infrastructures.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Apple Blocks $9 Billion in Fraud Over 5 Years Amid Rising App Store Threats",
        "Link": "https://thehackernews.com/2025/05/apple-blocks-9-billion-in-fraud-over-5.html",
        "Summary": "Apple on Tuesday revealed that it prevented over $9 billion in fraudulent transactions in the last five years, including more than $2 billion in 2024 alone.\nThe company said the App Store is confronted by a wide range of threats that seek to defraud users in various ways, ranging from \"deceptive apps designed to steal personal information to fraudulent payment schemes that attempt to exploit",
        "Date": "2025-05-28",
        "Content": "Apple on Tuesday revealed that it prevented over $9 billion in fraudulent transactions in the last five years, including more than $2 billion in 2024 alone.\nThe company\nsaid\nthe App Store is confronted by a wide range of threats that seek to defraud users in various ways, ranging from \"deceptive apps designed to steal personal information to fraudulent payment schemes that attempt to exploit users.\"\nThe tech giant said it terminated more than 46,000 developer accounts over fraud concerns and rejected an additional 139,000 developer enrollment as part of efforts to prevent bad actors from submitting their apps to the App Store.\nFurthermore, the company said it rejected over 711 million customer account creations and deactivated nearly 129 million customer accounts last year with an aim to block these accounts from conducting nefarious activity, such as spamming or manipulating ratings and reviews, charts, and search results that could compromise the integrity of the App Store.\nSome of the other noteworthy statistics shared by Apple for 2024 are listed below -\nDetected and blocked more than 10,000 illegitimate apps on pirate storefronts, which include malware, pornography apps, gambling apps, and pirated versions of legitimate apps from the App Store\nStopped nearly 4.6 million attempts to install or launch apps distributed illicitly outside the App Store or approved third-party marketplaces\nRejected more than 1.9 million App Store submissions for failing to meet its standards for security, reliability, privacy violations, or fraud concerns\nRemoved more than 37,000 apps for fraudulent activity and rejected over 43,000 app submissions for containing hidden or undocumented features\nRejected over 320,000 submissions that copied other apps, were found to be spam, or otherwise misled users, and another 400,000 app submissions for privacy violations.\nRemoved more than 7,400 potentially fraudulent apps from App Store charts and nearly 9,500 deceptive apps from appearing in App Store search results\nRemoved more than 143 million fraudulent ratings and reviews from the App Store\nIdentified nearly 4.7 million stolen credit cards and banned over 1.6 million accounts from transacting again\nIn comparison, Apple said it prevented\nmore than $1.8 billion\nin potentially fraudulent transactions in 2023 and\nover $2 billion\nin potentially fraudulent transactions in 2022. In 2023, Apple terminated close to 118,000 developer accounts.\nThe disclosure follows a similar report from Google earlier this year that it\nblocked\nover 2.36 million policy-violating Android apps from being published to the Google Play app marketplace in 2024 and banned more than 158,000 bad developer accounts that attempted to publish such harmful apps.\nApple's annual App Store fraud analysis also comes at a time when the company is facing increasing scrutiny over its App Store policies. A recent ruling in the United States ordered the iPhone maker to allow iOS apps to show links or buttons that direct customers to make purchases outside of the ‌App Store.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Windows 10 KB5058481 update brings seconds back to calendar flyout",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb5058481-update-brings-seconds-back-to-calendar-flyout/",
        "Summary": "Microsoft has released the optional KB5058481 preview cumulative update for Windows 10 22H2 with seven changes, including restoring seconds to the time display in the calendar flyout for those who previously lost it. [...]",
        "Date": "2025-05-28",
        "Content": "Microsoft has released the optional KB5058481 preview cumulative update for Windows 10 22H2 with seven changes, including restoring seconds to the time display in the calendar flyout for those who previously lost it.\nThe KB5058481 cumulative update preview is part of Microsoft's \"optional non-security preview updates\" schedule, typically released at the end of every month. This update allows Windows admins to test upcoming fixes and features that will be released in the upcoming June Patch Tuesday.\nUnlike Patch Tuesday cumulative updates, this preview update does not include security updates and is therefore optional.\nWindows users can install this update by going into\nSettings\n, clicking on\nWindows Update,\nand manually performing a\n'Check for Updates\n.'\nAs this is an optional update, unless you have the \"Get the latest updates as soon as they're available\" option enabled in Windows Update, you will be asked whether you wish to install it by clicking the 'Download and install' link.\nWindows 10 KB5058481 cumulative update preview\nSource: BleepingComputer\nAfter installing this update, Windows 10 22H2 will be updated to build\n19045.5917\n.\nWindows 10 users can also manually download and install the KB5058481 preview update from the\nMicrosoft Update Catalog\n.\nWhat's new in Windows 10 KB5058481\nMicrosoft has added some new features in this update, mostly revolving around the calendar flyout that is shown when you click on the time and date in the Windows taskbar.\nLikely, the most wanted change is the restoral of seconds to the time display in the calendar flyout, which was\npreviously removed\nfor some Windows 10 users.\nNow, if you click the time in the taskbar, the calendar flyout will display the whole time, including seconds, which is useful under certain circumstances or tasks.\nThe complete list of changes in the\nKB5058481 update\nare:\n[Calendar flyout]\nBrings back the clock view that displays seconds onto the calendar that was once removed.\nEnhances the Rich Calendar feature by extending the upcoming events period to 30 days.\nAdds description text for the Weather button in the Rich Calendar feature\n[GDI/GDI+]\nFixed: Some GB18030-2022 characters in plane 2 are not rendered.\nFixed: Some GB18030 characters are rendered wider. Additionally, the sample paragraph is not rendered correctly.\n[Mobile Operator Profiles]\nUpdated: Country and Operator Settings Asset (COSA) profiles are updated.\n[WinSaS]\nFixed: An issue affecting the Windows Account Sync Consent system in European Economic Area markets, where secondary accounts were not acknowledged, leading to increased server load.\nMicrosoft says the only known issue is that NOTO fonts appear blurry or unclear when displayed at 96 DPI.\n\"There are reports of blurry or unclear CJK (Chinese, Japanese, Korean) text when displayed at 96 DPI (100% scaling) in Chromium-based browsers such as Microsoft Edge and Google Chrome,\" explains Microsoft.\nAs a workaround, Microsoft says you can set your display scaling to 125% or 150% to improve the appearance of text.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nWindows 10 KB5055612 preview update fixes a GPU bug in WSL2\nWindows 11 KB5058499 update rolls out new Share and Click to Do features\nWindows 11 KB5055627 update released with 30 new changes, fixes\nWindows 10 KB5055518 update fixes random text when printing\nWindows Server emergency update fixes Hyper-V VM freezes, restart issues"
    },
    {
        "Title": "Windows 11 KB5058499 update rolls out new Share and Click to Do features",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5058499-update-rolls-out-new-share-and-click-to-do-features/",
        "Summary": "​​Microsoft has released the KB5058499 preview cumulative update for Windows 11 24H2 with forty-eight new features or changes, with many gradually rolling out, such as the new Windows Share feature and tje Click to Do Preview. [...]",
        "Date": "2025-05-28",
        "Content": "​​Microsoft has released the KB5058499 preview cumulative update for Windows 11 24H2 with forty-eight new features or changes, with many gradually rolling out, such as the new Windows Share feature and tje Click to Do Preview.\nThe\nKB5058499\nupdate is part of the company's optional non-security preview updates schedule, which releases updates at the end of each month to test new fixes and features coming to next month's June Patch Tuesday.\nUnlike regular Patch Tuesday cumulative updates, monthly non-security preview updates do not include security updates and are optional.\nYou can install the KB5058499 update by opening\nSettings\n, clicking on\nWindows Update,\nand then\n''Check for Updates\n.''\nBecause this is an optional update, you will be asked if you want to install it by clicking the ''Download and install'' link unless you have the \"Get the latest updates as soon as they're they're available\" option enabled, which will cause the update to automatically install.\nKB5058499 preview update (BleepingCoputer)\nYou can also manually download and install the KB5058499 preview update from the\nMicrosoft Update Catalog\n.\nWindows 11 KB5058499 highlights\nOnce installed, this optional cumulative release will update Windows 11 24H2 systems to build 26100.4202.\nThe May 2025 preview update has many new features that are gradually rolling out, including the Click to Do Preview and the new Windows Share feature.\n[Click to Do (preview)]\nNew!\n1\nAsk Copilot is a new action within Click to Do. When you highlight text or an image, Click to Do offers the\nAsk Copilot\noption. Selecting it opens\nMicrosoft Copilot\nwith your content in the prompt box. You can send the selected text or image directly to the Copilot app to complete your prompt.\nNew!\n​​​​​​​ Enhance your Click to Do experience with more intelligent text actions on AMD and Intel™-powered Copilot+ PCs. Use the\nWIN key\n+ mouse-click or\nWIN\n+\nQ\nto select a text block, then drag to choose the text you want. Options will appear to\nSummarize\n,\nCreate a bulleted list,\nor to help you\nRewrite\nyour text to sound more casual, more formal, or more polished.\nNew!\n2\nClick to Do (preview) is now available in the European Economic Area (EEA), bringing NPU-powered intelligent text actions for English to more users, along with new support for Spanish and French—enabling actions\nSummarize\n,\nCreate a bulleted list\n, and\nRefine\nin these languages.\nNew!\nIf your PC has pen and inking capabilities, you can configure the shortcut button to open Click to Do with a single-click, double-click, or press and hold through\nSettings\n>\nBluetooth & devices\n>\nPen & Windows Ink\n.\nNew!\nYou can add Click to Do as one of the four apps in the pen menu on your PC. If all slots for the pen menu are full, you might need to replace one app with Click to Do in the menu settings.\nNew!\nClick to Do can now perform intelligent text actions in Spanish and French.\n[Copilot]\nNew!\nYou can open Copilot on Windows with\nWin + C\n. You can personalize your\nCopilot key\nand\nWin + C\nexperience at any time with the existing “Customize Copilot key on keyboard” under\nSettings\n>\nPersonalization\n>\nText input\n.\nNew!\n​​​​​​​ To start\nPress to talk\nwith Copilot on Windows, hold the\nCopilot key\n—or\nWin\n+\nC\nif your keyboard doesn’t have one—for two seconds. Press\nEsc\nor stay silent for a few seconds to end the call. Use\nAlt\n+\nSpacebar\nto talk with Copilot on Windows. You can interact with Copilot using your voice and receive instant responses while continuing your tasks.\n[Cross device resume]\nNew!​​​​​​​\nSeamlessly resume working on OneDrive files from your phone (iOS and Android) on your Windows 11 PC with a single click. With this feature, you’ll get a notification asking if you want to pick up where you left off editing a OneDrive file, like a Word document, that you viewed or edited on your phone within the last 5 minutes before unlocking your PC.\n[Energy Saver]\nNew!\nIT admins can manage Energy saver settings on Windows 11 PCs through group policies and MDM configurations using Microsoft Intune. This feature helps extend battery life by limiting background activity, dimming the screen, and contributing to environmental sustainability. To configure the policy, go to the Local Group Policy under\nComputer Configuration > Administrative Templates > System > Power Management > Energy Saver Settings\nand “Enable Energy Saver to Always Be On.”\n[Graphics]\nN\new!\nManage your PC’s HDR features under\nSettings\n>\nSystem\n>\nDisplay.\nUpdates include: A clearer label for “Use HDR” that better explains which media types are supported. The ability to stream HDR video even when HDR is turned off. On PCs with Dolby Vision, a new switch lets you turn Dolby Vision on or off independently of HDR—giving you more control over your viewing experience.\n[Narrator]\nNew!\n​​​​​​​Enhance digital accessibility with AI-powered image descriptions in Narrator on Copilot+ PCs. This feature provides detailed descriptions of images, charts, and graphs for blind and low-vision users. To turn on Narrator, press\nCtrl\n+\nWindows key\n+\nEnter\nor search for 'Narrator' in Windows search. Use\nNarrator key\n+\nCtrl\n+\nD\nfor image descriptions.\n[Improved Windows Search]\nNew\n!\nDiscover the new feature that makes finding settings easier on Copilot+ PCs. Type the setting you’re looking for in the Windows search box on your taskbar without needing to remember the exact setting name. For example, use your own words to find settings like “change my theme” or “about my PC.” You no longer need to remember the exact setting name.\nNew!\nIn the EEA, you can now find cloud photos using improved Windows Search on the taskbar. Describe the photos, like 'European castles' or 'summer picnics,' in the search box. Photos from the cloud and your Copilot+ PC appear in the search results. Exact keyword matches within your cloud files will also show up. This feature is gradually rolling out to Snapdragon-powered Copilot+ PCs, with support for AMD and Intel-powered PCs coming soon.\n[Search on Taskbar]\nNew!\nImproved support for web search providers in Windows Search for the EEA, including with increased discoverability.\n[Settings]\nNew!\nFind answers to commonly asked questions about your PC and Windows 11 in the new FAQs section under\nSettings\n>\nSystem\n>\nAbout\n. It covers topics like system setup, performance, and compatibility – all in one place.\nNew!\n​​​​​​​The dialog to rename your printer under\nSettings\n>\nBluetooth & devices\n>\nPrinters & scanners\nnow matches the Windows 11 look and feel.\nNew!\nMouse settings are now easier to access under\nSettings > Accessibility > Mouse\nand\nMouse pointer and touch\n, with no need to open Control Panel. You’ll find updated icons for Mouse pointer speed and Enhance mouse pointer precision, plus options for customizing the mouse indicator, pointer trails, and hover activation time.\n[Taskbar]\nNew!\n​​​​​​​ Admins can configure taskbar policies so users can unpin specific apps, ensuring they are not repinned during the next policy refresh. To turn on this feature, use the new\nPinGeneration option\n.\nFixed: When using\nTab\nand\nShift\n+\nTab\nto move keyboard focus around the taskbar, if you go backwards at least once you can get keyboard focus stuck on the taskbar frame, which could lead screen readers to just say “pane.”\nFixed: On login, the keyboard focus might unexpectedly be set to widgets in the taskbar, which can cause widgets to open.\n[Voice Access]\nNew!\nVoice access now includes an in-product experience that highlights new features and improvements. Use the settings menu to open or dismiss it anytime.\nNew!\nYou can find voice access under Accessibility in Quick Settings at the lower-right corner of your screen near the clock. To open Quick Settings, select the network, volume, or battery icon.\nFixed: Voice access might stop responding with error “working on it” when dictating.\n[Voice Typing]\nNew!\nYou control the profanity filter. When you turn it on, it masks profanity with asterisks. When you turn it off, words appear as spoken. To change the setting, open voice typing (\nWin\n+\nH\n), select the settings icon, and turn on the Filter profanity switch.\n[Windows Share]\nNew!\nMake last-minute edits such as cropping, rotating, and adding filters to images shared through the Windows Share window.\nNew!\nWhen you drag a local file from File Explorer or your desktop, a tray appears at the top of your screen. Drop the file into a suggested app or select\nMore\n​​​​​​​  to open the Windows share window.\nNew!\nAdd apps that support sharing directly to the right-click menu for local files in File Explorer or on the desktop.\n[Audio]\nFixed: The startup sound might not play on boot, although it is enabled.\n[Bluetooth]\nFixed: Settings might stop responding when loading information about Bluetooth devices.\n[Camera]\nFixed: Settings might stop working when interacting with content under\nSettings\n>\nBluetooth & Devices\n>\nCameras\n.\n[Display]\nFixed: Unexpected changes to screen size and window position might occur after waking from sleep for some devices.\n[File Explorer]\nFixed: If you have disconnected network drives while conducting a search from Home, it might prevent searches from executing and you remain on Home.\n[Input]\nFixed: Voice typing won't start from the touch keyboard when using the Chinese (Simplified) narrow layout.\nFixed: When using the Symbols section of the touch keyboard, pressing the key to change pages might unexpectedly insert a character into password fields.\nFixed: Typing in some apps might stop working after disconnecting from a remote desktop session.\n[JPG]\nFixed: When using\nCopyPixels\nthe pixels may be unexpectedly inverted in certain cases.\n[Microsoft Management Console (MMC)]\nFixed: Improved the colors used in MMC when items are selected, both generally, and when contrast modes are enabled.\n[Print]\nFixed: Non-admin users can't uninstall printers that they’ve added.\n[UHF Tuning]\nFixed: Tuning scan for UHF channels doesn’t work, and only VHF channels are returned.\n[USB]\nFixed: Certain USB devices might become disconnected after sleep, until you reboot your PC.\n[Windows Hello]\nFixed: When using\nWindows Hello for Business\nfacial recognition, the camera might unexpectedly stop working after your PC wakes from sleep, blocking login using this method.\nThe good news is that some fixes are available immediately with the KB5058502 update, which include:\n[BitLocker]\nFixed: This update addresses an issue where devices with BitLocker on removable drives could encounter a blue screen error after resuming from sleep or hybrid-booting.\n[Boot menu screens] Fixed: This update addresses the issue where early boot screens, such as BitLocker PIN, BitLocker Recovery key, and boot menu screens, render slowly.\n[Graphics kernel]\nFixed: An issue where some game titles become unresponsive after upgrading to 24H2.\n[Memory leak]\nFixed: This update addresses an issue in the Input Service that causes increased memory usage, potentially impacting performance in multi-user, multi-lingual, and remote desktop usage.\n[Multimedia]\nFixed: If you turn on multi-app mode or basic camera mode in advanced camera settings, the Windows Hello Face Enrollment might not work and show a bad camera preview.\n[Network]\n​​​​​​​ Fixed: This update addresses an issue where Windows Server 2025 always shows the network as \"public\" on new domain controllers. It now checks for a domain controller name before using loopback addresses to ensure proper Lightweight Directory Access Protocol (LDAP) binding.​​​​​​​\nMicrosoft says the only known issue is that NOTO fonts appear blurry or unclear when displayed at 96 DPI.\n\"There are reports of blurry or unclear CJK (Chinese, Japanese, Korean) text when displayed at 96 DPI (100% scaling) in Chromium-based browsers such as Microsoft Edge and Google Chrome,\" explains Microsoft.\nMicrosoft says you can set your display scaling to 125% or 150% to improve text clarity as a temporary workaround.\nThe full release notes for KB5058499 can be found in this\nsupport bulletin\n.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nWindows 11 KB5055627 update released with 30 new changes, fixes\nWindows 10 KB5055612 preview update fixes a GPU bug in WSL2\nWindows 11's Recall AI is now rolling out on Copilot+ PCs\nWindows 11 April update unexpectedly creates new 'inetpub' folder\nWindows 11 KB5055523 & KB5055528  cumulative updates released"
    },
    {
        "Title": "APT41 malware abuses Google Calendar for stealthy C2 communication",
        "Link": "https://www.bleepingcomputer.com/news/security/apt41-malware-abuses-google-calendar-for-stealthy-c2-communication/",
        "Summary": "The Chinese APT41 hacking group uses a new malware named 'ToughProgress' that abuses Google Calendar for command-and-control (C2) operations, hiding malicious activity behind a trusted cloud service. [...]",
        "Date": "2025-05-28",
        "Content": "The Chinese APT41 hacking group uses a new malware named 'ToughProgress' that exploits Google Calendar for command-and-control (C2) operations, hiding malicious activity behind a trusted cloud service.\nThe campaign was discovered by\nGoogle's Threat Intelligence Group\n, which identified and dismantled attacker-controlled Google Calendar and Workspace infrastructure and introduced targeted measures to prevent such abuse in the future.\nUsing Google Calendar as a C2 mechanism is not a novel technique, and\nVeracode recently reported\nabout a malicious package in the Node Package Manager (NPM) index following a similar tactic.\nAlso, APT41 is known for abusing Google services before, like using Google Sheets and Google Drive in a\nVoldemort malware campaign\nin April 2023.\nOverview of the attack\nSource: Google\nAPT41 attack flow\nThe attack starts with a malicious email sent to targets, linking to a ZIP archive hosted on a previously compromised government website.\nThe archive contains a Windows LNK file pretending to be a PDF document, a primary payload masqueraded as a JPG image file, and a DLL file used for decrypting and launching the payload, also camouflaged as an image file.\n\"The files \"6.jpg\" and \"7.jpg\" are fake images. The first file is actually an encrypted payload and is decrypted by the second file, which is a DLL file launched when the target clicks the LNK,\" explains Google.\nThe DLL is 'PlusDrop,' a component that decrypts and executes the next stage, 'PlusInject,' entirely in memory.\nNext, PlusInject performs process hollowing on the legitimate Windows process 'svhost.exe' and injects the final stage 'ToughProgress.'\nThe malware connects to a hardcoded Google Calendar endpoint and polls specific event dates for commands APT41 adds in the description field of hidden events.\nOne of APT41's Calendar events\nSource: Google\nAfter executing them, ToughProgress returns the results into new calendar events so the attacker can adjust their next steps accordingly.\nThe encrypted exchange\nSource: Google\nWith payloads never touching the disk and the C2 communication happening over a legitimate cloud service, the chances of getting flagged by security products on the infected host are minimal.\nDisrupting the activity\nGoogle identified attacker-controlled Google Calendar instances and terminated all related Workspace accounts and the offending Calendar events.\nGoogle's Safe Browsing blocklist was also updated accordingly, so users will get a warning when visiting associated sites, and traffic from those sites will be blocked across all of the tech giant's products.\nThe report does not name any specific compromised organizations or victims, but Google says it notified them directly in collaboration with Mandiant. Google also shared ToughProgress samples and traffic logs with victims to help them pinpoint infections in their environments.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nCzechia blames China for Ministry of Foreign Affairs cyberattack\nGoogle claims users find ads in AI search 'helpful'\nGoogle fixes Android zero-day exploited by Serbian authorities\nIvanti EPMM flaw exploited by Chinese hackers to breach govt agencies\nChinese hackers breach US local governments using Cityworks zero-day"
    },
    {
        "Title": "New PumaBot botnet brute forces SSH credentials to breach devices",
        "Link": "https://www.bleepingcomputer.com/news/security/new-pumabot-botnet-brute-forces-ssh-credentials-to-breach-devices/",
        "Summary": "A newly discovered Go-based Linux botnet malware named PumaBot is brute-forcing SSH credentials on embedded IoT devices to deploy malicious payloads. [...]",
        "Date": "2025-05-28",
        "Content": "A newly discovered Go-based Linux botnet malware named PumaBot is brute-forcing SSH credentials on embedded IoT devices to deploy malicious payloads.\nThe targeted nature of PumaBot is also evident by the fact it targets specific IPs based on lists pulled from a command-and-control (C2) server instead of broader scanning of the internet.\nTargeting surveillance cams\nDarktrace documented PumaBot in\na report\nproviding an overview of the botnet's attack flow, indicators of compromise (IoCs), and detection rules.\nThe malware receives a list of target IPs from its C2 (ssh.ddos-cc.org) and attempts to perform brute-force login attempts on port 22 for open SSH access.\nDuring this process, it checks for the presence of a \"Pumatronix\" string, which Darktrace believes could correspond to the targeting of surveillance and traffic camera systems by the vendor.\nOnce the targets have been established, the malware receives credentials to test against them.\nIf successful, it runs 'uname -a' to get environment information and verify the targeted device is not a honeypot.\nNext, it writes its main binary (jierui) to /lib/redis and installs a systemd service (redis.service) to secure persistence across device reboots.\nFinally, it injects its own SSH into the 'authorized_keys' file to maintain access, even in the case of a cleanup that removes the primary infection.\nWhere the infection stays active, PumaBot can receive commands to attempt data exfiltration, introduce new payloads, or steal data useful in lateral movement.\nExample payloads seen by Darktrace include self-updating scripts, PAM rootkits that replace the legitimate 'pam_unix.so', and daemons (binary file \"1\").\nThe malicious PAM module harvests local and remote SSH login details and stores them in a text file (con.txt). The \"watcher\" binary (1) constantly looks for that text file and then exfiltrates it to the C2.\nWriting credentials on a text file\nSource: Darktrace\nAfter the exfiltration, the text file is wiped from the infected host to delete any traces of the malicious activity.\nThe size and success of PumaBot are currently unknown, and Darktrace does not mention how extensive the target IP lists are.\nThis new botnet malware stands out for launching targeted attacks that could open the way to deeper corporate network infiltration instead of using the infected IoTs directly for lower-grade cybercrime, such as distributed denial of service (DoS) attacks or proxying networks.\nTo defend against botnet threats, upgrade IoTs to the latest available firmware version, change default credentials, put them behind firewalls, and keep them in separate networks isolated from valuable systems.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nBotnet hacks 9,000+ ASUS routers to add persistent SSH backdoor\nUS indicts leader of Qakbot botnet linked to ransomware attacks\nPolice seize over 100 malware loader servers, arrest four cybercriminals\nWindows 11 and Red Hat Linux hacked on first day of Pwn2Own\nNew Tor Oniux tool anonymizes any Linux app's network traffic"
    },
    {
        "Title": "Interlock ransomware gang deploys new NodeSnake RAT on universities",
        "Link": "https://www.bleepingcomputer.com/news/security/interlock-ransomware-gang-deploys-new-nodesnake-rat-on-universities/",
        "Summary": "The Interlock ransomware gang is deploying a previously undocumented remote access trojan (RAT) named NodeSnake against educational institutes for persistent access to corporate networks. [...]",
        "Date": "2025-05-28",
        "Content": "The Interlock ransomware gang is deploying a previously undocumented remote access trojan (RAT) named NodeSnake against educational institutes for persistent access to corporate networks.\nQuorumCyber researchers report seeing NodeSnake's deployment in at least two cases targeting universities in the UK in January and March 2025.\nThe two malware samples significantly differ, indicating active development to add new features and capabilities on NodeSnake.\nAs first reported by BleepingComputer, Interlock is a ransomware group\nlaunched in September 2024\n. It has previously targeted the\nTexas Tech University\n, the\nDaVita\nkidney dialysis firm, and the\nKettering Health\nmedical network in Ohio.\nThe threat group has also been seen leveraging\n'ClickFix' attacks\nthat impersonate IT tools to achieve initial infection and network infiltration.\nThe new NodeSnake RAT malware\nInterlock's latest attacks on educational institutions start with phishing emails carrying malicious links or attachments that lead to NodeSnake RAT infections.\nThe JavaScript malware, which is executed with NodeJS, establishes persistence upon infection by using PowerShell or CMD scripts to write a deceptive Registry entry named 'ChromeUpdater' to impersonate Google Chrome's updater.\nFor evasion, the malware runs as a detached background process, filenames and payloads are assigned random names, and command-and-control (C2) addresses are cycled through with randomized delays.\nMoreover, the malware features heavy code obfuscation, XOR encryption with a rolling key and random seeds, and performs console tampering to disrupt normal debug output.\nAlthough the C2 IP address is hardcoded, the connection is routed through Cloudflare-proxied domains for obfuscation.\nOnce active on the infected machine, it collects key metadata about the user, running processes, services, and network configurations and exfiltrates it to the C2.\nGathering system data\nSource: QuorumCyber\nThe malware can kill active processes or load additional EXE, DLL, or JavaScript payloads on the device.\nThe newer NodeSnake variant can also execute CMD commands and use additional modules to change C2 polling behavior dynamically. The command results are bundled in the exfiltrated data packs, allowing real-time shell interaction.\nCMD command execution\nSource: QuorumCyber\nThe existence of NodeSnake and its continuous development is an indication of Interlock's continued evolution and focus on long-term stealthy persistence.\nThe complete list of the indicators of compromise for this threat is available at the bottom of the\nQuorumCyber report\n.\nMonitoring for these could help block ransomware attacks early on before Interlock proceeds to the data exfiltration and encryption phase.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nSupply chain attack hits npm package with 45,000 weekly downloads\nMalicious PyPi package hides RAT malware, targets Discord devs since 2022\nChinese hackers target Russian govt with upgraded RAT malware\nNew ResolverRAT malware targets pharma and healthcare orgs worldwide\nPolice takes down 300 servers in ransomware supply-chain crackdown"
    },
    {
        "Title": "Botnet hacks 9,000+ ASUS routers to add persistent SSH backdoor",
        "Link": "https://www.bleepingcomputer.com/news/security/botnet-hacks-9-000-plus-asus-routers-to-add-persistent-ssh-backdoor/",
        "Summary": "Over 9,000 ASUS routers are compromised by a novel botnet dubbed \"AyySSHush\" that was also observed targeting SOHO routers from Cisco, D-Link, and Linksys. [...]",
        "Date": "2025-05-28",
        "Content": "Over 9,000 ASUS routers are compromised by a novel botnet dubbed \"AyySSHush\" that was also observed targeting SOHO routers from Cisco, D-Link, and Linksys.\nThe campaign was\ndiscovered by GreyNoise\nsecurity researchers in mid-March 2025, who reports that it carries the hallmarks of a nation-state threat actor, though no concrete attributions were made.\nThe threat monitoring firm reports that the attacks combine brute-forcing login credentials, bypassing authentication, and exploiting older vulnerabilities to compromise ASUS routers, including the RT-AC3100, RT-AC3200, and RT-AX55 models.\nObserved brute-forcing attempts\nSource: GreyNoise\nSpecifically, the attackers exploit an old command injection flaw tracked as\nCVE-2023-39780\nto add their own SSH public key and enable the SSH daemon to listen on the non-standard TCP port 53282. This modifications allow the threat actors to retain backdoor access to the device even between reboots and firmware updates.\n\"Because this key is added using the official ASUS features, this config change is persisted across firmware upgrades,\" explains another\nrelated report\nby GreyNoise.\n\"If you've been exploited previously, upgrading your firmware will\nNOT\nremove the SSH backdoor.\"\nThe attack is particularly stealthy, involving no malware, while the attackers also turn off logging and Trend Micro's AiProtection to evade detection.\nCharacteristically, GreyNoise reports logging just 30 malicious requests associated with this campaign over the past three months, though 9,000 ASUS routers have been infected.\nMalicious requests targeting ASUS routers\nSource: GreyNoise\nStill, three of those requests were enough to trigger GreyNoise's AI-powered analysis tool that flagged them for human inspection.\nThe campaign likely overlaps with the activity Sekoia tracks as \"\nVicious Trap\n,\" disclosed last week, though the French cybersecurity firm reported that threat actors leveraged CVE-2021-32030 to breach ASUS routers.\nIn the campaign seen by Sekoia, the threat actors were observed targeting SOHO routers, SSL VPNs, DVRs, and BMC controllers from D-Link, Linksys, QNAP, and Araknis Networks.\nThe exact operational goal of AyySSHush remains unclear, as there are no signs of distributed denial of service (DDoS) or using the devices to proxy malicious traffic through the ASUS routers.\nHowever, in the router breaches observed by Sekoia, a malicious script was downloaded and executed to redirect network traffic from the compromised system to third-party devices controlled by the attacker.\nCurrently, it appears the campaign quietly builds a network of backdoored routers to create the groundwork for a future botnet.\nProtect your ASUS routers\nASUS has released security updates that address CVE-2023-39780 for the impacted routers, though the exact time of availability varies per model.\nUsers are recommended to upgrade their firmware as soon as possible and look for suspicious files and the addition of the attacker's SSH key (\nIoCs here\n) on the 'authorized_keys' file.\nAlso, GreyNoise lists four IP addresses associated with this activity, which should be added to a block list.\n101.99.91[.]151\r\n101.99.94[.]173 \r\n79.141.163[.]179   \r\n111.90.146[.]237\nIf a compromise is suspected, a factory reset is recommended to clean the router beyond doubt and then reconfigure it from scratch using a strong password.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nNew PumaBot botnet brute forces SSH credentials to breach devices\nFBI: End-of-life routers hacked for cybercrime proxy networks\nUS indicts leader of Qakbot botnet linked to ransomware attacks\nPolice seize over 100 malware loader servers, arrest four cybercriminals\nPolice dismantles botnet selling hacked routers as residential proxies"
    },
    {
        "Title": "Dark Partners cybercrime gang fuels large-scale crypto heists",
        "Link": "https://www.bleepingcomputer.com/news/security/dark-partners-cybercrime-gang-fuels-large-scale-crypto-heists/",
        "Summary": "A sprawling network of fake AI, VPN, and crypto software download sites is being used by the \"Dark Partner\" threat actors to conduct a crypto theft attacks worldwide. [...]",
        "Date": "2025-05-28",
        "Content": "A sprawling network of fake AI, VPN, and crypto software download sites is being used by the \"Dark Partner\" threat actors to conduct a crypto theft attacks worldwide.\nMasquerading as popular apps, these cloned sites deliver the Poseiden (macOS) and Lumma (Windows) infostealers and malware loaders like Payday. This malware is used to steal cryptocurrency and sensitive data such as host information, credentials, private keys, or cookies, which are likely sold on the cybercriminal market.\nOn Windows, the threat actor used certificates from multiple companies to digitally sign malware builds, one of them was the PayDay Loader.\nOne infostealer delivered to these machines was Lumma Stealer, a malware operation that\nlaw enforcement disrupted\nearlier this month by seizing thousands of domains and part of its infrastructure.\nOn macOS, the threat actor delivered the Poseidon Stealer, which uses a custom DMG launcher, and targets Firefox and Chromium-based web browsers.\nTargeting wallet folders\nThe threat actors behind this campaign were dubbed \"Dark Partners\" by cybersecurity researcher\ng0njxa\n, who describes the infection steps and analyzes the malware used.\nDark Partners delivers the infostealers through simple websites that impersonate at least 37 apps and tools, some of them using generative AI technology to create illustrations, videos, and artistic images (e.g. Sora, DeepSeek, Haiper, Runway, Leonardo, Creatify).\nThe list also includes seven crypto apps and platforms like TradingView, MetaTrader 5, Ledger, Exodus, Koinly, AAVE, and Unusual Whales.\nThese fake sites also include VPN services like Windscribe, payment processing platform Stripe, 3D modeling app Blender, creator-focused platform TikTok Studio, remote desktop solution UltraViewer, and Mac Clean - a system cleaning tool for macOS.\nAccording to g0njxa, the landing pages provide nothing more than a download button and they all share a custom \"Waiting for the file to download\" frame, making it easy to discover them.\nFake download page for AI-powered video generator\nsource:\ng0njxa\nBefore providing the malware, the website checks for bot downloads and sends user information to an endpoint via a POST request.\nIn the end, the download action is triggered based on the operating system requesting it.\nThe researcher says that the host for the PayDay Loader panel (inspired by the\neponymous game\n) also had a Poseidon Stealer panel in August 2024.\nPayDay loader panel\nsource:\ng0njxa\nNotably, the infamous Poseidon Stealer was put on sale in July 2024 and sold to an unknown source. The malware hasn't seen major payload changes since its sale.\nThe AppleScript code for Poseidon shows that it can collect browser data, which including specific extension data from Chromium-based browsers like Chrome, Brave, Edge, Vivaldi, Opera, and Firefox, and wallets like MetaMask.\nIt also specifically targets wallet folders for desktop applications like Electrum, Coinomi, Exodus, Atomic, Wasabi, Ledger Live, and others.\nThe PayDay Loader is the Windows-specific malicious application, built as an electron-based application to deliver infostealers.\nIt has an anti-sandbox module that checks for common process names related to security analysis tools and terminates itself if any are detected.\ng0njxa analyzed the malware and discovered that it used an obfuscated function to retrieve the command and control (C2) server address from a Google Calendar link.\nEstablishing persistence is a rather complex process that involves running a PowerShell script at every logon, its role being to access a virtual hard disk (VHD) hidden inside an NTFS alternate data stream (setting.json:disk.vhd), mounting it, and executing a file from the newly mounted volume.\n“After a short delay to ensure execution, the script unmounts the VHD, removing traces of the payload” -\ng0njxa\nPayDay Loader includes a NodeJS stealer module that can exfiltrate cryptocurrency wallet data to a C2, the researcher says. In total, it can steal data from 76 wallets and desktop applications.\nAnother highlight in g0njxa’s report is the use of code signing certificates for Windows malware builds. The researcher says that the Dark Partners threat actor likely purchased the certificates.\nAt the moment, none of the discovered certificates are valid, putting a temporary stop to the malicious campaign.\nThe researcher included in their report an extensive list of indicators of compromise for the analyzed samples (PayDay Loader and Poseidon Stealer) and nearly 250 domains for the landing pages.\ng0njxa is well-known among cybercriminal gangs as the researcher is tracking threat actors that drain crytpocurrency wallets. One gang in particular is\nCrazy Evil\n, who is responsible for multiple campaigns that involve complex social engineering over social media platforms to attract victims.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nNorth Korean hackers adopt ClickFix attacks to target crypto firms\nHackers use fake Ledger apps to steal Mac users’ seed phrases\nLumma infostealer malware operation disrupted, 2,300 domains seized\nWindows 11 and Red Hat Linux hacked on first day of Pwn2Own\nAnthropic web config hints at Claude Sonnet 4 and Opus 4"
    },
    {
        "Title": "Czechia blames China for Ministry of Foreign Affairs cyberattack",
        "Link": "https://www.bleepingcomputer.com/news/security/czechia-blames-china-for-ministry-of-foreign-affairs-cyberattack/",
        "Summary": "The Czech Republic says the Chinese-backed APT31 hacking group was behind cyberattacks targeting the country's Ministry of Foreign Affairs and critical infrastructure organizations. [...]",
        "Date": "2025-05-28",
        "Content": "The Czech Republic says the Chinese-backed APT31 hacking group was behind cyberattacks targeting the country's Ministry of Foreign Affairs and critical infrastructure organizations.\n\"The malicious activity, which lasted from 2022 and affected an institution designated as Czech critical infrastructure, was perpetrated by the cyberespionage actor APT31 that is publicly associated with the Ministry of State Security,\" the Czech government\nsaid\n.\n\"The Government of the Czech Republic strongly condemns this malicious cyber campaign against its critical infrastructure. Such behavior undermines the credibility of the People's Republic of China and contradicts its public declarations.\"\nEuropean Union member states and NATO allies\ncondemned the attack\non Wednesday, asking China to adhere to the UN norms and respect international law.\nTwo months ago, the Finnish Police\nconfirmed\nthat APT31 hackers were behind a March 2021 breach of the country's parliament when the attackers compromised multiple email accounts, including some belonging to Finnish MPs.\nIn July 2021, the United States and its allies\nblamed\nthe Chinese MSS-linked APT31 and APT40 threat groups for an extensive hacking campaign that targeted over a quarter of a million Microsoft Exchange servers belonging to tens of thousands of organizations worldwide.\n\"In recent years, malicious cyber activities linked to this country and targeting the EU and its Member States have increased. In 2021, we urged Chinese authorities to take action against malicious cyber activities undertaken from their territory,\" the Council of the EU\nsaid\non Wednesday.\n\"Since then, several Member States have attributed similar activities at their national level. We have repeatedly raised our concerns during bilateral engagements and we will continue to do so in the future.\"\nAPT31 charges and sanctions\nAPT31\n(also tracked as Zirconium and Judgment Panda), previously linked to the Chinese Ministry of State Security (MSS), is known for numerous espionage operations and its involvement in the theft and repurposing of\nthe EpMe NSA exploit\nyears before Shadow Brokers leaked it in April 2017.\nMicrosoft\nobserved APT31 attacks\ntargeting high-profile individuals associated with Joe Biden's presidential campaign four years ago, while Google spotted them around the same time\ntargeting\n\"campaign staffers' personal email\" accounts in phishing attacks.\nThe U.S. Treasury Department's Office of Foreign Assets Control (OFAC)\nsanctioned two APT31 operatives\n(Zhao Guangzong and Ni Gaobin) in March for their work as contractors for Wuhan XRZ, an OFAC-designated front company used by the Chinese MSS attacks against U.S. critical infrastructure.\nThey were also\nsanctioned\nby the United Kingdom for targeting U.K. parliamentarians, breaching the GCHQ intelligence agency, and hacking into\nthe country's Electoral Commission systems\n.\nAdditionally, the U.S. Justice Department\ncharged\nthe two APT31 hackers, along with five other defendants, for their involvement in the operations of Wuhan XRZ over at least 14 years.\nNow, the U.S. State Department is\noffering rewards of up to $10 million\nfor information about Wuhan XRZ and APT31 that could assist in locating and/or arresting any of the seven Chinese hackers.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nTikTok fined €530 million for sending European user data to China\nPowerSchool hacker pleads guilty to student data extortion scheme\nIvanti EPMM flaw exploited by Chinese hackers to breach govt agencies\nChinese hackers breach US local governments using Cityworks zero-day\nKettering Health hit by system-wide outage after ransomware attack"
    },
    {
        "Title": "Microsoft introduces new Windows backup tool for businesses",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-introduces-new-windows-backup-tool-for-businesses/",
        "Summary": "Microsoft has introduced Windows Backup for Organizations, a new backup tool for enterprises that simplifies backups and makes the transition to Windows 11 easier. [...]",
        "Date": "2025-05-28",
        "Content": "Microsoft has introduced Windows Backup for Organizations, a new backup tool for enterprises that simplifies backups and makes the transition to Windows 11 easier.\nFirst announced at Microsoft Ignite\nin November 2024\n, this tool is now in limited public preview and will help back up and restore a user's Windows settings after resetting or reimaging their device.\n\"You can back up your organization's Windows 10 or Windows 11 settings and restore them on a Microsoft Entra joined device. This capability helps reduce migration overhead, minimize user disruption, and strengthen device resilience against incidents,\"\nMicrosoft said\n.\n\"Whether you're planning a large-scale upgrade or simply looking to enhance your organization's device continuity strategy, this capability helps reduce migration overhead, minimize user disruption, and strengthen device resilience against incidents.\"\nWindows Backup for Organizations is available for Microsoft Entra joined Windows 10 or Windows 11 systems.\nOrganizations that sign up for this public preview using\nthis form\nalso need an active Microsoft Intune test tenant and Microsoft Intune service administrator permissions to take full advantage of this feature.\n\"Try out Windows Backup for Organizations during the limited public preview,\" the company\nurged customers\non Tuesday.\n\"This is just the beginning. As we continue to evolve this experience, more enhancements are on the horizon—ensuring your organization is always ready for what's next.\"\nThose who can't upgrade to Windows 11 before Windows 10 reaches the end of service on October 14, 2025, are advised to enroll Windows 10 endpoints in the\nExtended Security Updates (ESU) program\nto continue receiving security updates.\nIn December, Microsoft also announced that Windows 10 home users will also be able to\nget an extra year\nof security updates through the company's ESU program if they're willing\nto pay $30\nto delay the Windows 11 switch.\nThis week, Microsoft also\nannounced a new update orchestration platform\nbuilt on the Windows Update stack that aims to unify the updating system for all apps, drivers, and system components on Windows systems.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft: New Windows updates fix Active Directory policy issues\nMicrosoft adds hotpatching support to Windows 11 Enterprise\nWindows Server emergency update fixes Hyper-V VM freezes, restart issues\nSignal now blocks Microsoft Recall screenshots on Windows 11\nWindows 10 emergency updates fix BitLocker recovery issues"
    },
    {
        "Title": "Microsoft wants Windows to update all software on your PC",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-wants-windows-to-update-all-software-on-your-pc/",
        "Summary": "Microsoft has introduced a new update orchestration platform built on the existing Windows Update infrastructure, which aims to unify the updating system for all apps, drivers, and system components on Windows systems. [...]",
        "Date": "2025-05-28",
        "Content": "Microsoft has introduced a new update orchestration platform built on the existing Windows Update infrastructure, which aims to unify the updating system for all apps, drivers, and system components on Windows systems.\nThe company explained that developers and IT product teams can onboard their updates to this new orchestration platform via Windows Runtime (WinRT) APIs or PowerShell commands after joining the private preview by contacting unifiedorchestrator@service.microsoft.com.\nAfter registering as an update provider, the orchestrator will regularly run an update scan tool supplied during the registration process to discover pending updates. The orchestrator then queues downloads and updates at optimal times to minimize CPU and bandwidth spikes while also considering user activity, power status, and network conditions.\nUnder this new update model, it will also handle restart requirements, notification deadlines, and rescheduling of failed operations without requiring developers to build a custom scheduling or logging solution.\n\"Updates across the Windows ecosystem can feel like a fragmented experience. To solve this, we're building a vision for a unified, intelligent update orchestration platform capable of supporting any update (apps, drivers, etc.) to be orchestrated alongside Windows updates,\"\nMicrosoft said\n.\n\"Built on the Windows Update stack, the orchestration platform aims to provide developers and product teams building apps and management tools with an API for onboarding their update(s) that supports the needs of their installers.\"\nCurrently in private preview\nMicrosoft's new update orchestration platform is now in private preview for developers or anyone who builds apps or management tools for updates, and it supports applications packaged as MSIX, APPX, or traditional Win32 installers.\nOnboarding offers several key benefits, including a consistent notification experience through native Windows Update dialogs and centralized app update history in the Settings app together with official Windows updates.\n\"Built on the Windows Update stack, the orchestration platform aims to provide developers and product teams building apps and management tools with an API for onboarding their update(s) that supports the needs of their installers,\" Microsoft added.\n\"The orchestrator will coordinate across all onboarded products that are updated on Windows 11, in addition to Windows Update, to provide IT admins and users with a consistent management plane and experience, respectively.\"\nThis new initiative adds to Redmond's\nWinget Windows package manager\nand\nMicrosoft Store\n, as well as third-party package managers like Chocolatey and Scoop, which can also be used to install, manage, and update applications on Windows systems.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft May 2025 Patch Tuesday fixes 5 exploited zero-days, 72 flaws\nMicrosoft: Windows 'inetpub' folder created by security fix, don’t delete\nMicrosoft April 2025 Patch Tuesday fixes exploited zero-day, 134 flaws\nWindows 11 KB5055523 & KB5055528  cumulative updates released\nMicrosoft adds hotpatching support to Windows 11 Enterprise"
    },
    {
        "Title": "Apple blocked over $9 billion in App Store fraud in five years",
        "Link": "https://www.bleepingcomputer.com/news/apple/apple-blocked-over-9-billion-in-apap-store-fraud-since-2020/",
        "Summary": "Apple says it blocked over $9 billion in fraudulent App Store transactions over the last five years, with over $2 billion in potentially fraudulent sanctions prevented in 2024 alone. [...]",
        "Date": "2025-05-28",
        "Content": "Apple says it blocked over $9 billion in fraudulent App Store transactions over the last five years, with over $2 billion in potentially fraudulent sanctions prevented in 2024 alone.\nThe company's annual App Store fraud analysis also shows that Apple identified almost 4.7 million stolen credit cards and blocked over 1.6 million accounts from making transactions again.\nThe App Store team also blocked hundreds of thousands of unsafe apps last year that could impact App Store's more than 813 million visitors a week, rejecting almost 1.9 million apps that didn't meet Apple's privacy and security standards out of 7.7 million App Store submissions reviewed.\nAnother 320,000 were rejected for being copycats of already submitted apps and misleading users, while around just over 43,000 were denied entry into the Apple App Store for using undocumented or hidden features.\n\"These bad actors can also attempt to deceive users by disguising potentially risky software as seemingly innocuous apps. Last year, App Review removed over 17,000 apps for bait-and-switch maneuvers such as these, as part of its ongoing efforts to routinely monitor and take action against problematic apps,\"\nApple said\n.\n\"Apps that attempt to access users' personal data without their permission or knowledge are also prohibited from the App Store. In 2024, App Review rejected 400,000 app submissions for privacy violations.\"\nDiscovery and account fraud\nAs a result of discovery fraud probes, the company removed another 143 million fraudulent ratings and reviews from the App Store in 2024 alone, as well as almost 9,500 deceptive apps from appearing in search results and another 7,400 apps from the App Store's charts.\nApple added that the App Store App Review team examines an average of over 150,000 app submissions weekly, helping over 220,000 developers publish their apps on the App Store each year.\nAs part of its ongoing efforts to fend off account fraud, the company also terminated 146,000 developer accounts for potentially fraudulent activity and rejected 139,000 developer enrollments who attempted to submit malicious apps to the App Store.\nIt also blocked 711 million user account creations over fraud concerns and deactivated another 146 million linked to malicious activity.\nAccording to last year's fraud analysis report, Apple\nprevented $1.8 billion\nin suspicious transactions in 2023, slightly less than the\n$2 billion blocked in 2022\n.\nApple advises customers who suspect suspicious activity in an app downloaded from the App Store to report it at\nreportaproblem.apple.com\nimmediately.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nApple 'AirBorne' flaws can lead to zero-click AirPlay RCE attacks\nWordPress ad-fraud plugins generated 1.4 billion ad requests per day\nFBI: Scammers pose as FBI IC3 employees to 'help' recover lost funds\nApple fixes two zero-days exploited in targeted iPhone attacks\nApple fined €150 million over App Tracking Transparency issues"
    },
    {
        "Title": "Hundreds of Web Apps Have Full Access to Microsoft OneDrive Files",
        "Link": "https://www.darkreading.com/application-security/hundreds-web-apps-full-access-onedrive-files",
        "Summary": "Researchers at Oasis Security say the problem has to do with OneDrive File Picker having overly broad permissions.",
        "Date": "2025-05-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/hundreds-web-apps-full-access-onedrive-files"
    },
    {
        "Title": "Implementing Secure by Design Principles for AI",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/secure-design-principles-ai",
        "Summary": "Harnessing AI's full transformative potential safely and securely requires more than an incremental enhancement of existing cybersecurity practices. A Secure by Design approach represents the best path forward.",
        "Date": "2025-05-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/secure-design-principles-ai"
    },
    {
        "Title": "Cellcom Restores Regional Mobile Services After Cyberattack",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/cellcom-restores-regional-mobile-services-cyberattack",
        "Summary": "Customers in parts of Wisconsin and Michigan could not make calls or send text messages for nearly a week after an incident on May 14, and service is still intermittent in some areas.",
        "Date": "2025-05-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/cellcom-restores-regional-mobile-services-cyberattack"
    },
    {
        "Title": "Why Take9 Won't Improve Cybersecurity",
        "Link": "https://www.darkreading.com/cybersecurity-operations/why-take9-will-not-improve-cybersecurity",
        "Summary": "The latest cybersecurity awareness campaign asks users to pause for nine seconds before clicking — but this approach misplaces responsibility and ignores the real problems of system design.",
        "Date": "2025-05-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/why-take9-will-not-improve-cybersecurity"
    },
    {
        "Title": "Have Your Say: Dark Reading Seeks Your Input",
        "Link": "https://www.darkreading.com/threat-intelligence/have-your-say-dark-reading-seeks-your-input",
        "Summary": "Dark Reading is offering its readers the opportunity to tell us how we're doing via a new survey.",
        "Date": "2025-05-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/have-your-say-dark-reading-seeks-your-input"
    },
    {
        "Title": "Zscaler Announces Deal to Acquire Red Canary",
        "Link": "https://www.darkreading.com/threat-intelligence/zscaler-announces-deal-acquire-red-canary",
        "Summary": "The August acquisition will bring together Red Canary's extensive integration ecosystem with Zscaler's cloud transaction data to deliver an AI-powered security operations platform.",
        "Date": "2025-05-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/zscaler-announces-deal-acquire-red-canary"
    },
    {
        "Title": "Indian Police Arrest Cybercrime Gang Copycats of Myanmar Biz Model",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/indian-police-arrest-cybercrime-gang-copycats-myanmar-biz-model",
        "Summary": "The region offers attractive conditions: a large pool of tech workers, economic disparity, and weak enforcement of cybercrime laws — all of which attract businesses legitimate and shady.",
        "Date": "2025-05-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/indian-police-arrest-cybercrime-gang-copycats-myanmar-biz-model"
    },
    {
        "Title": "Pakistan Arrests 21 in ‘Heartsender’ Malware Service",
        "Link": "https://krebsonsecurity.com/2025/05/pakistan-arrests-21-in-heartsender-malware-service/",
        "Summary": "Authorities in Pakistan have arrested 21 individuals accused of operating \"Heartsender,\" a once popular spam and malware dissemination service that operated for more than a decade. The main clientele for HeartSender were organized crime groups that tried to trick victim companies into making payments to a third party, and its alleged proprietors were publicly identified by KrebsOnSecurity in 2021 after they inadvertently infected their computers with malware.",
        "Date": "2025-05-28",
        "Content": "Authorities in Pakistan have arrested 21 individuals accused of operating “Heartsender,” a once popular spam and malware dissemination service that operated for more than a decade. The main clientele for HeartSender were organized crime groups that tried to trick victim companies into making payments to a third party, and its alleged proprietors were publicly identified by KrebsOnSecurity in 2021 after they inadvertently infected their computers with malware.\nSome of the core developers and sellers of Heartsender posing at a work outing in 2021. WeCodeSolutions boss Rameez Shahzad (in sunglasses) is in the center of this group photo, which was posted by employee Burhan Ul Haq, pictured just to the right of Shahzad.\nA report from the Pakistani media outlet Dawn states that authorities there arrested 21 people alleged to have operated Heartsender, a spam delivery service whose homepage openly advertised phishing kits targeting users of various Internet companies, including Microsoft 365, Yahoo, AOL, Intuit, iCloud and ID.me. Pakistan’s National Cyber Crime Investigation Agency (NCCIA) reportedly conducted raids in Lahore’s Bahria Town and Multan on May 15 and 16.\nThe NCCIA told reporters the group’s tools were connected to more than $50m in losses in the United States alone, with European authorities investigating 63 additional cases.\n“This wasn’t just a scam operation – it was essentially a cybercrime university that empowered fraudsters globally,” NCCIA Director Abdul Ghaffar said at a press briefing.\nIn January 2025, the FBI and the Dutch Police seized the technical infrastructure for the cybercrime service, which was marketed under the brands Heartsender, Fudpage and Fudtools (and many other “fud” variations). The “fud” bit stands for “Fully Un-Detectable,” and it refers to cybercrime resources that will evade detection by security tools like antivirus software or anti-spam appliances.\nThe FBI says transnational organized crime groups that purchased these services primarily used them to run business email compromise (BEC) schemes, wherein the cybercrime actors tricked victim companies into making payments to a third party.\nDawn reported that those arrested included Rameez Shahzad, the alleged ringleader of the Heartsender cybercrime business, which most recently operated under the Pakistani front company WeCodeSolutions. Mr. Shahzad was named and pictured in a 2021 KrebsOnSecurity story about a series of remarkable operational security mistakes that exposed their identities and Facebook pages showing employees posing for group photos and socializing at work-related outings.\nPrior to folding their operations behind WeCodeSolutions, Shahzad and others arrested this month operated as a web hosting group calling itself The Manipulaters. KrebsOnSecurity first wrote about The Manipulaters in May 2015, mainly because their ads at the time were blanketing a number of popular cybercrime forums, and because they were fairly open and brazen about what they were doing — even who they were in real life.\nSometime in 2019, The Manipulaters failed to renew their core domain name — manipulaters[.]com — the same one tied to so many of the company’s business operations. That domain was quickly scooped up by Scylla Intel, a cyber intelligence firm that specializes in connecting cybercriminals to their real-life identities. Soon after, Scylla started receiving large amounts of email correspondence intended for the group’s owners.\nIn 2024, DomainTools.com found the web-hosted version of Heartsender leaked an extraordinary amount of user information to unauthenticated users, including customer credentials and email records from Heartsender employees. DomainTools says the malware infections on Manipulaters PCs exposed “vast swaths of account-related data along with an outline of the group’s membership, operations, and position in the broader underground economy.”\nShahzad allegedly used the alias “Saim Raza,” an identity which has contacted KrebsOnSecurity multiple times over the past decade with demands to remove stories published about the group. The Saim Raza identity most recently contacted this author in November 2024, asserting they had quit the cybercrime industry and turned over a new leaf after a brush with the Pakistani police.\nThe arrested suspects include Rameez Shahzad, Muhammad Aslam (Rameez’s father), Atif Hussain, Muhammad Umar Irshad, Yasir Ali, Syed Saim Ali Shah, Muhammad Nowsherwan, Burhanul Haq, Adnan Munawar, Abdul Moiz, Hussnain Haider, Bilal Ahmad, Dilbar Hussain, Muhammad Adeel Akram, Awais Rasool, Usama Farooq, Usama Mehmood and Hamad Nawaz.\n\r\n         This entry was posted on Wednesday 28th of May 2025 01:41 PM \r\n         \nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "MATLAB Maker MathWorks Recovering From Ransomware Attack",
        "Link": "https://www.securityweek.com/matlab-maker-mathworks-recovering-from-ransomware-attack/",
        "Summary": "<p>The incident impacted multiple web and mobile applications, licensing services, downloads and online store, website, wiki, MathWorks accounts, and other services.</p>\n<p>The post <a href=\"https://www.securityweek.com/matlab-maker-mathworks-recovering-from-ransomware-attack/\">MATLAB Maker MathWorks Recovering From Ransomware Attack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/matlab-maker-mathworks-recovering-from-ransomware-attack/"
    },
    {
        "Title": "364,000 Impacted by Data Breach at LexisNexis Risk Solutions",
        "Link": "https://www.securityweek.com/364000-impacted-by-data-breach-at-lexisnexis-risk-solutions/",
        "Summary": "<p>Data broker giant LexisNexis Risk Solutions  says personal information was stolen from 364,000 people in a December 2024 data breach.</p>\n<p>The post <a href=\"https://www.securityweek.com/364000-impacted-by-data-breach-at-lexisnexis-risk-solutions/\">364,000 Impacted by Data Breach at LexisNexis Risk Solutions</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/364000-impacted-by-data-breach-at-lexisnexis-risk-solutions/"
    },
    {
        "Title": "Czech Government Condemns Chinese Hack on Critical Infrastructure",
        "Link": "https://www.securityweek.com/czech-government-condemns-chinese-hack-on-critical-infrastructure/",
        "Summary": "<p>The Czech government issues a blunt warning to China after APT31 hackers linked to intrusion at critical infrastructure network.</p>\n<p>The post <a href=\"https://www.securityweek.com/czech-government-condemns-chinese-hack-on-critical-infrastructure/\">Czech Government Condemns Chinese Hack on Critical Infrastructure</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/czech-government-condemns-chinese-hack-on-critical-infrastructure/"
    },
    {
        "Title": "Cerby Raises $40 Million for Identity Automation Platform",
        "Link": "https://www.securityweek.com/cerby-raises-40-million-for-identity-automation-platform/",
        "Summary": "<p>Identity security automation platform Cerby has raised $40 million in Series B funding to scale operations.</p>\n<p>The post <a href=\"https://www.securityweek.com/cerby-raises-40-million-for-identity-automation-platform/\">Cerby Raises $40 Million for Identity Automation Platform</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cerby-raises-40-million-for-identity-automation-platform/"
    },
    {
        "Title": "Vietnamese Hackers Distribute Malware via Fake AI-Themed Websites",
        "Link": "https://www.securityweek.com/vietnamese-hackers-distribute-malware-via-fake-ai-themed-websites/",
        "Summary": "<p>Mandiant warns that a Vietnamese hacking group tracked as UNC6032 is distributing malware via fake AI video generator websites.</p>\n<p>The post <a href=\"https://www.securityweek.com/vietnamese-hackers-distribute-malware-via-fake-ai-themed-websites/\">Vietnamese Hackers Distribute Malware via Fake AI-Themed Websites</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/vietnamese-hackers-distribute-malware-via-fake-ai-themed-websites/"
    },
    {
        "Title": "OneDrive Gives Web Apps Full Read Access to All Files",
        "Link": "https://www.securityweek.com/onedrive-gives-web-apps-full-read-access-to-all-files/",
        "Summary": "<p>Security researchers warn that OneDrive’s file sharing tool may grant third-party web apps access to all your files—not just the one you choose to upload.</p>\n<p>The post <a href=\"https://www.securityweek.com/onedrive-gives-web-apps-full-read-access-to-all-files/\">OneDrive Gives Web Apps Full Read Access to All Files</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/onedrive-gives-web-apps-full-read-access-to-all-files/"
    },
    {
        "Title": "Chrome 137, Firefox 139 Patch High-Severity Vulnerabilities",
        "Link": "https://www.securityweek.com/chrome-137-firefox-139-patch-high-severity-vulnerabilities/",
        "Summary": "<p>Google and Mozilla released patches for Chrome and FireFox to address a total of 21 vulnerabilities between the two browsers, including three rated high severity.</p>\n<p>The post <a href=\"https://www.securityweek.com/chrome-137-firefox-139-patch-high-severity-vulnerabilities/\">Chrome 137, Firefox 139 Patch High-Severity Vulnerabilities</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chrome-137-firefox-139-patch-high-severity-vulnerabilities/"
    },
    {
        "Title": "Vulnerabilities in CISA KEV Are Not Equally Critical: Report",
        "Link": "https://www.securityweek.com/vulnerabilities-in-cisa-kev-are-not-equally-critical-report/",
        "Summary": "<p>New report says organizations should always consider environmental context when assessing the impact of vulnerabilities in CISA KEV catalog.</p>\n<p>The post <a href=\"https://www.securityweek.com/vulnerabilities-in-cisa-kev-are-not-equally-critical-report/\">Vulnerabilities in CISA KEV Are Not Equally Critical: Report</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/vulnerabilities-in-cisa-kev-are-not-equally-critical-report/"
    },
    {
        "Title": "The Root of AI Hallucinations: Physics Theory Digs Into the ‘Attention’ Flaw",
        "Link": "https://www.securityweek.com/the-root-of-ai-hallucinations-physics-theory-digs-into-the-attention-flaw/",
        "Summary": "<p>Physicist Neil Johnson explores how fundamental laws of nature could explain why AI sometimes fails—and what to do about it.</p>\n<p>The post <a href=\"https://www.securityweek.com/the-root-of-ai-hallucinations-physics-theory-digs-into-the-attention-flaw/\">The Root of AI Hallucinations: Physics Theory Digs Into the &#8216;Attention&#8217; Flaw</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/the-root-of-ai-hallucinations-physics-theory-digs-into-the-attention-flaw/"
    },
    {
        "Title": "$223 Million Stolen in Cetus Protocol Hack",
        "Link": "https://www.securityweek.com/223-million-stolen-in-cetus-protocol-hack/",
        "Summary": "<p>Hackers exploited a vulnerability in Cetus Protocol, a liquidity provider on the SUI blockchain.</p>\n<p>The post <a href=\"https://www.securityweek.com/223-million-stolen-in-cetus-protocol-hack/\">$223 Million Stolen in Cetus Protocol Hack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-28",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/223-million-stolen-in-cetus-protocol-hack/"
    },
    {
        "Title": "Fujipoly Ltd Allegedly Targeted by Spacebears Ransomware",
        "Link": "https://dailydarkweb.net/fujipoly-ltd-allegedly-targeted-by-spacebears-ransomware/",
        "Summary": "Fujipoly Ltd., a prominent global manufacturer specializing in high-performance Thermal Interface Materials, Elastomeric Connectors, and Custom Silicone Extrusions, has allegedly fallen victim to a cyberattack. The notorious ransomware group Spacebears Ransomware has claimed responsibility for the breach, asserting they have accessed a significant cache of sensitive data from the company&#8217;s systems. Fujipoly, established in 1978 [&#8230;]",
        "Date": "2025-05-28",
        "Content": "Fujipoly Ltd., a prominent global manufacturer specializing in high-performance Thermal Interface Materials, Elastomeric Connectors, and Custom Silicone Extrusions, has allegedly fallen victim to a cyberattack. The notorious ransomware group Spacebears Ransomware has claimed responsibility for the breach, asserting they have accessed a significant cache of sensitive data from the company’s systems. Fujipoly, established in 1978 as a joint venture between Dow Corning and Chugai Bussan, operates an extensive network with 9 manufacturing and distribution centers and 14 locations across North America, Europe, and Asia, highlighting its importance in the global supply chain for specialized industrial components.\nThe attackers, Spacebears Ransomware, have allegedly exfiltrated critical information including databases, SQL files, financial documents, and the personal information of both employees and clients. This type of data exposure could have severe repercussions for Fujipoly, ranging from financial losses and operational disruptions to reputational damage and regulatory scrutiny. The group has also initiated a countdown timer for the release of the allegedly stolen files, a common tactic used by ransomware gangs to pressure victims into paying a ransom.\nAs of now, Fujipoly Ltd. has not publicly confirmed the breach or the extent of the data compromise. Cybersecurity experts are likely investigating the incident to verify the claims made by Spacebears Ransomware and to assess the full impact on the company and its stakeholders. Organizations are reminded of the persistent threat posed by ransomware groups and the critical need for robust cybersecurity measures to protect sensitive information.\nTags:\ncyberattack\nCyberSecurity\ndata-breach\nFujipoly\nindustrial\nManufacturing\nransomware\nSpacebears"
    },
    {
        "Title": "Australian Telecom Superloop’s Portal Access Allegedly Offered for Sale",
        "Link": "https://dailydarkweb.net/australian-telecom-superloops-portal-access-allegedly-offered-for-sale/",
        "Summary": "A major Australian telecommunications company, Superloop, has allegedly fallen victim to a significant data breach, with access to its portal containing sensitive information now reportedly being offered for sale online. Superloop, founded in 2014, is a substantial player in the Australian telecommunications landscape, having reported an approximate revenue of $420.5 million in 2024. The company [&#8230;]",
        "Date": "2025-05-28",
        "Content": "A major Australian telecommunications company, Superloop, has allegedly fallen victim to a significant data breach, with access to its portal containing sensitive information now reportedly being offered for sale online.\nSuperloop, founded in 2014, is a substantial player in the Australian telecommunications landscape, having reported an approximate revenue of $420.5 million in 2024. The company provides a range of telecommunications services, making any compromise of its systems a serious concern for both its operations and its customers.\nThe alleged breach, dated May 28, 2025, specifically targets “Superloop Telecommunications Portal Access.” The information being offered for sale allegedly includes “domain administration tools and other sensitive information,” which could potentially allow unauthorized parties to gain control over critical network infrastructure and access confidential data.\nThe price for this alleged access is listed at $750, with “MM / Escrow Accepted” indicating a mechanism for secure payment in illicit transactions. Further details or confirmation from Superloop regarding the alleged incident are currently unavailable.\nTags:\naustralia\ncyberattack\ndata-breach\nPortal Access\nSuperloop\ntelecommunications"
    },
    {
        "Title": "Alleged Access to Over 70 of Dubai Corporations Offered for Sale",
        "Link": "https://dailydarkweb.net/alleged-access-to-over-70-of-dubai-corporations-offered-for-sale/",
        "Summary": "A significant cybersecurity concern has emerged with reports alleging that access to 70-100 corporate entities in Dubai, UAE, is being sold for an asking price of $3000. This alleged compromise stems from access gained through an MSP (Managed Service Provider) Bomgar platform, a widely used remote access solution. The advertisement claims to have compromised approximately [&#8230;]",
        "Date": "2025-05-28",
        "Content": "A significant cybersecurity concern has emerged with reports alleging that access to 70-100 corporate entities in Dubai, UAE, is being sold for an asking price of $3000. This alleged compromise stems from access gained through an MSP (Managed Service Provider) Bomgar platform, a widely used remote access solution. The advertisement claims to have compromised approximately 200 machines, 90% of which are servers, belonging to companies with revenues reportedly ranging from 20 to 40 million, indicating a potential breach of numerous mid-to-large-sized enterprises.\nThe alleged access includes both user-visible screen sharing and covert command line/file manager capabilities, suggesting a deep level of control. This access has reportedly been active for about a month. The persistent nature of this alleged access underscores the critical need for companies, especially those relying on MSPs and remote access tools like Bomgar, to bolster their cybersecurity defenses, including rigorous review of configurations and robust multi-factor authentication.\ndubaiaccesss\nTags:\nBomgar\ncorporate security\ncybercrime\nCyberSecurity\ndata-breach\nDubai\nhacking\nMSP\nRemote Access\nUAE"
    },
    {
        "Title": "Flagship Bank Facing Alleged Ransomware Attack by Akira Group",
        "Link": "https://dailydarkweb.net/flagship-bank-facing-alleged-ransomware-attack-by-akira-group/",
        "Summary": "Flagship Bank, a United States-based financial institution has allegedly become the latest victim of a cyberattack. The Akira ransomware group has claimed responsibility for the breach, threatening to expose a substantial amount of corporate and client data. According to statements allegedly made by the threat actors, they have exfiltrated approximately 40 GB of Flagship Bank&#8217;s [&#8230;]",
        "Date": "2025-05-28",
        "Content": "Flagship Bank, a United States-based financial institution has allegedly become the latest victim of a cyberattack. The Akira ransomware group has claimed responsibility for the breach, threatening to expose a substantial amount of corporate and client data.\nAccording to statements allegedly made by the threat actors, they have exfiltrated approximately 40 GB of Flagship Bank’s corporate data. This information includes highly sensitive client details such as dates of birth, Social Security Numbers (SSNs), passport numbers, addresses, driver’s licenses (DLs), phone numbers, detailed financial data, contracts, agreements, and various certificates. The potential exposure of such extensive personal and financial information poses a significant risk to Flagship Bank’s clients and could lead to widespread fraud and identity theft.\nFlagship Bank is known for its local ownership and operation by bankers with strong ties to the community, suggesting its importance to the local economy and its customer base. The alleged attack by the Akira ransomware group highlights the persistent and evolving threat posed by cybercriminals to organizations of all sizes, even those with deep community connections.\nAt this time, Flagship Bank has not publicly confirmed the breach or commented on the alleged data compromise. Cybersecurity experts are closely monitoring the situation, as the implications of such a data leak could be severe for both the bank and its clientele.\nTags:\nAkira ransomware\ncyberattack\nCyberSecurity\ndata-breach\nfinancial institution\nFlagship Bank\nFlorida\nsensitive-data\nUnited States"
    },
    {
        "Title": "The Salvation Army Allegedly Breached by Threat Actor Chaos",
        "Link": "https://dailydarkweb.net/the-salvation-army-allegedly-breached-by-chaos-hacking-group/",
        "Summary": "The Salvation Army, a globally recognized charitable organization, has allegedly fallen victim to a cyberattack orchestrated by the hacking collective known as Chaos. The group claims to have successfully breached the organization&#8217;s systems, with an announcement of impending data release. The Salvation Army is an incredibly important international movement, active in over 130 countries, providing [&#8230;]",
        "Date": "2025-05-28",
        "Content": "The Salvation Army, a globally recognized charitable organization, has allegedly fallen victim to a cyberattack orchestrated by the hacking collective known as Chaos. The group claims to have successfully breached the organization’s systems, with an announcement of impending data release.\nThe Salvation Army is an incredibly important international movement, active in over 130 countries, providing a vast array of social services, humanitarian aid, and spiritual guidance. Their work includes disaster relief, combating homelessness, operating food banks, and offering rehabilitation programs. A breach of their systems could have significant implications, potentially compromising sensitive data related to beneficiaries, donors, and staff, and disrupting their vital operations.\nTags:\nChaos\ncyberattack\ndata-breach\nNonprofit\nThe Salvation Army"
    },
    {
        "Title": "Amazon Spain Faces Alleged 5.1 Million User Data Leak",
        "Link": "https://dailydarkweb.net/amazon-spain-faces-alleged-5-1-million-user-data-leak/",
        "Summary": "Amazon&#8217;s Spanish operations, Amazon España, has allegedly suffered a significant data breach, with an estimated 5.1 million customer records reportedly exposed online. The leaked information is said to include sensitive personal details such as DNI (Spanish National Identity Document) numbers, phone numbers, street addresses, zip codes, full names, email addresses, and cities of residence. The [&#8230;]",
        "Date": "2025-05-28",
        "Content": "Amazon’s Spanish operations, Amazon España, has allegedly suffered a significant data breach, with an estimated 5.1 million customer records reportedly exposed online. The leaked information is said to include sensitive personal details such as DNI (Spanish National Identity Document) numbers, phone numbers, street addresses, zip codes, full names, email addresses, and cities of residence.\nThe alleged breach impacts a substantial number of Amazon’s customer base in Spain, a crucial market for the global e-commerce giant. Amazon.es is a primary online retail platform for millions of Spanish consumers, handling vast amounts of personal and financial data daily. The exposure of such detailed information could lead to serious privacy concerns and potential risks of phishing attacks, identity theft, and other malicious activities for the affected individuals.\nThe origin of the alleged data leak appears to be a public online forum, where the information was reportedly shared. The breach is attributed to “Amazon España,” indicating a direct compromise of the company’s Spanish database. The timeline for the data breach is stated as “2024/2025,” suggesting a recent or ongoing compromise.\nCustomers in Spain who use Amazon.es are advised to be vigilant about any suspicious communications, particularly emails or messages requesting personal information, and to consider changing their passwords for online accounts.\nTags:\namazon\nAmazon España\nAmazon Spain\nCyberSecurity\ndata-breach\nPersonal Data\nSpain"
    }
]