[
    {
        "Title": "China-Linked APTs Exploit SAP CVE-2025-31324 to Breach 581 Critical Systems Worldwide",
        "Link": "https://thehackernews.com/2025/05/china-linked-apts-exploit-sap-cve-2025.html",
        "Summary": "A recently disclosed critical security flaw impacting SAP NetWeaver is being exploited by multiple China-nexus nation-state actors to target critical infrastructure networks.\n\"Actors leveraged CVE-2025-31324, an unauthenticated file upload vulnerability that enables remote code execution (RCE),\" EclecticIQ researcher Arda Büyükkaya said in an analysis published today.\nTargets of the campaign",
        "Date": "2025-05-13",
        "Content": "A recently disclosed critical security flaw impacting SAP NetWeaver is being exploited by multiple China-nexus nation-state actors to target critical infrastructure networks.\n\"Actors leveraged\nCVE-2025-31324\n, an unauthenticated file upload vulnerability that enables remote code execution (RCE),\" EclecticIQ researcher Arda Büyükkaya\nsaid\nin an analysis published today.\nTargets of the campaign include natural gas distribution networks, water and integrated waste management utilities in the United Kingdom, medical device manufacturing plants oil and gas exploration and production companies in the United States, and government ministries in Saudi Arabia that are responsible for investment strategy and financial regulation.\nThe findings are based on a publicly exposed directory uncovered on attacker-controlled infrastructure (\"15.204.56[.]106\") that contained event logs capturing the activities across multiple compromised systems.\nThe Dutch cybersecurity company has attributed the intrusions to Chinese threat activity clusters tracked as\nUNC5221\n,\nUNC5174\n, and\nCL-STA-0048\n, the last of which was linked to attacks targeting high-value targets in South Asia by exploiting known vulnerabilities in public-facing IIS, Apache Tomcat, and MS-SQL servers to drop web shells, reverse shells, and the PlugX backdoor.\nIt also noted that an uncategorized China-nexus threat actor is conducting a widespread internet scanning and exploitation campaign against SAP NetWeaver systems. The server hosted at the IP address \"15.204.56[.]106\" has been found to contain multiple files, including -\n\"CVE-2025-31324-results.txt,\" which has recorded 581 SAP NetWeaver instances compromised and backdoored with a web shell\n\"服务数据_20250427_212229.txt,\" which lists 800 domains running SAP NetWeaver likely for future targeting\n\"The exposed open-dir infrastructure reveals confirmed breaches and highlights the group's planned targets, offering clear insight into both past and future operations,\" Büyükkaya noted.\nThe exploitation of CVE-2025-31324 is followed by the threat actor deploying two web shells that are designed to maintain persistent remote access to the infected systems and execute arbitrary commands.\nIn addition, three different Chinese hacking groups have been observed exploiting the SAP NetWeaver vulnerability as part of efforts to maintain remote access, conduct reconnaissance, and drop malicious programs -\nCL-STA-0048, which has attempted to establish an interactive reverse shell to \"43.247.135[.]53,\" an IP address previously identified as used by the threat actor\nUNC5221, which has leveraged a web shell to deploy\nKrustyLoader\n, a Rust-based malware that can used to serve second-stage payloads like Sliver, set up persistence, and execute shell commands\nUNC5174, which has leveraged a web shell to download SNOWLIGHT, a loader that initiates a connection with a hard-coded server to fetch a Go-based remote access trojan named VShell and a backdoor known as GOREVERSE\n\"China-linked APTs are highly likely to continue targeting internet-exposed enterprise applications and edge devices to establish long-term strategic and persistence access to critical infrastructure networks globally,\" Büyükkaya said.\n\"Their focus on widely used platforms like SAP NetWeaver is a strategic move, as these systems are deeply integrated into enterprise environments and often host unpatched vulnerabilities.\"\nSAP Patches New NetWeaver Flaw in May 2025 Patch\nThe disclosure comes days after another China-linked unnamed threat actor dubbed Chaya_004 has also been\nattributed\nto the exploitation of CVE-2025-31324 to deploy a Go-based reverse shell called SuperShell.\nSAP security firm Onapsis\nsaid\nit is \"seeing significant activity from attackers who are using public information to trigger exploitation and abuse web shells placed by the original attackers, who have currently gone dark.\"\nFurther analysis of these attacks has led to the discovery of another critical defect in NetWeaver's Visual Composer Metadata Uploader component. Tracked as\nCVE-2025-42999\n(CVSS score: 9.1), it has been described as a deserialization vulnerability that could be exploited by a privileged user to upload untrusted or malicious content.\nIn light of ongoing active exploitation, customers of SAP NetWeaver are recommended to update their instances to the\nlatest version\nas soon as possible.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Malicious PyPI Package Posing as Solana Tool Stole Source Code in 761 Downloads",
        "Link": "https://thehackernews.com/2025/05/malicious-pypi-package-posing-as-solana.html",
        "Summary": "Cybersecurity researchers have discovered a malicious package on the Python Package Index (PyPI) repository that purports to be an application related to the Solana blockchain, but contains malicious functionality to steal source code and developer secrets.\nThe package, named solana-token, is no longer available for download from PyPI, but not before it was downloaded 761 times. It was first",
        "Date": "2025-05-13",
        "Content": "Cybersecurity researchers have discovered a malicious package on the Python Package Index (PyPI) repository that purports to be an application related to the Solana blockchain, but contains malicious functionality to steal source code and developer secrets.\nThe package, named solana-token, is no longer available for download from PyPI, but not before it was\ndownloaded 761 times\n. It was\nfirst published\nto PyPI in early April 2024, albeit with an entirely different version numbering scheme.\n\"When installed, the malicious package attempts to exfiltrate source code and developer secrets from the developer's machine to a hard-coded IP address,\" ReversingLabs researcher Karlo Zanki\nsaid\nin a report shared with The Hacker News.\nIn particular, the package is designed to copy and exfiltrate the source code contained in all the files in the Python execution stack under the guise of a blockchain function named \"register_node().\"\nThis unusual behavior suggests that the attackers are looking to exfiltrate sensitive crypto-related secrets that may be hard-coded in the early stages of writing a program incorporating the malicious function in question.\nIt's believed that developers looking to create their own blockchains were the likely targets of the threat actors behind the package. This assessment is based on the package name and the functions built into it.\nThe exact method by which the package may have been distributed to users is currently not known, although it's likely to have been promoted on developer-focused platforms.\nIf anything, the discovery underscores the fact that cryptocurrency continues to be one of the most popular targets for supply chain threat actors, necessitating that developers take steps to scrutinize every package before using it.\n\"Development teams need to aggressively monitor for suspicious activity or unexplained changes within both open source and commercial, third-party software modules,\" Zanki said. \"By stopping malicious code before it is allowed to penetrate secure development environments, teams can prevent the kind of destructive supply chain attacks.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Deepfake Defense in the Age of AI",
        "Link": "https://thehackernews.com/2025/05/deepfake-defense-in-age-of-ai.html",
        "Summary": "The cybersecurity landscape has been dramatically reshaped by the advent of generative AI. Attackers now leverage large language models (LLMs) to impersonate trusted individuals and automate these social engineering tactics at scale.&nbsp;\nLet’s review the status of these rising attacks, what’s fueling them, and how to actually prevent, not detect, them.&nbsp;\nThe Most Powerful Person on the",
        "Date": "2025-05-13",
        "Content": "The cybersecurity landscape has been dramatically reshaped by the advent of generative AI. Attackers now leverage large language models (LLMs) to impersonate trusted individuals and automate these social engineering tactics at scale.\nLet's review the status of these rising attacks, what's fueling them, and how to actually prevent, not detect, them.\nThe Most Powerful Person on the Call Might Not Be Real\nRecent threat intelligence reports highlight the growing sophistication and prevalence of AI-driven attacks:\nVoice Phishing Surge:\nAccording to\nCrowdStrike's 2025 Global Threat Report\n, there was a 442% increase in voice phishing (vishing) attacks between the first and second halves of 2024, driven by AI-generated phishing and impersonation tactics.\nSocial Engineering Prevalence:\nVerizon's 2025 Data Breach Investigations Report\nindicates that social engineering remains a top pattern in breaches, with phishing and pretexting accounting for a significant portion of incidents\nNorth Korean Deepfake Operations:\nNorth Korean threat actors have been observed using deepfake technology to create synthetic identities for online job interviews, aiming to\nsecure remote work positions and infiltrate organizations\n.\nIn this new era, trust can't be assumed or merely detected. It must be proven deterministically and in real-time.\nWhy the Problem Is Growing\nThree trends are converging to make AI impersonation the next big threat vector:\nAI makes deception cheap and scalable\n: With open-source voice and video tools, threat actors can impersonate anyone with just a few minutes of reference material.\nVirtual collaboration exposes trust gaps\n: Tools like Zoom, Teams, and Slack assume the person behind a screen is who they claim to be. Attackers exploit that assumption.\nDefenses generally rely on probability, not proof\n: Deepfake detection tools use facial markers and analytics to\nguess\nif someone is real. That's not good enough in a high-stakes environment.\nAnd while endpoint tools or user training may help, they're not built to answer a critical question in real-time:\nCan I trust this person I am talking to?\nAI Detection Technologies Are Not Enough\nTraditional defenses focus on detection, such as training users to spot suspicious behavior or using AI to analyze whether someone is fake. But deepfakes are getting too good, too fast. You can't fight AI-generated deception with probability-based tools.\nActual prevention requires a different foundation, one based on provable trust, not assumption. That means:\nIdentity Verification\n: Only verified, authorized users should be able to join sensitive meetings or chats based on cryptographic credentials, not passwords or codes.\nDevice Integrity Checks\n: If a user's device is infected, jailbroken, or non-compliant, it becomes a potential entry point for attackers, even if their identity is verified. Block these devices from meetings until they're remediated.\nVisible Trust Indicators\n: Other participants need to\nsee\nproof that each person in the meeting is who they say they are and is on a secure device. This removes the burden of judgment from end users.\nPrevention means creating conditions where impersonation isn't just hard, it's impossible. That's how you shut down AI deepfake attacks before they join high-risk conversations like board meetings, financial transactions, or vendor collaborations.\nDetection-Based Approach\nPrevention Approach\nFlag anomalies after they occur\nBlock unauthorized users from ever joining\nRely on heuristics & guesswork\nUse cryptographic proof of identity\nRequire user judgment\nProvide visible, verified trust indicators\nEliminate Deepfake Threats From Your Calls\nRealityCheck by Beyond Identity was built to close this trust gap inside collaboration tools. It gives every participant a visible, verified identity badge that's backed by cryptographic device authentication and continuous risk checks.\nCurrently available for Zoom and Microsoft Teams\n(video and chat), RealityCheck:\nConfirms every participant's identity is real and authorized\nValidates device compliance in real time, even on unmanaged devices\nDisplays a visual badge to show others you've been verified\nIf you want to see how it works, Beyond Identity is hosting a webinar where you can see the product in action.\nRegister here!\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "North Korean Konni APT Targets Ukraine with Malware to track Russian Invasion Progress",
        "Link": "https://thehackernews.com/2025/05/north-korean-konni-apt-targets-ukraine.html",
        "Summary": "The North Korea-linked threat actor known as Konni APT has been attributed to a phishing campaign targeting government entities in Ukraine, indicating the threat actor's targeting beyond Russia.\nEnterprise security firm Proofpoint said the end goal of the campaign is to collect intelligence on the \"trajectory of the Russian invasion.\"\n\"The group's interest in Ukraine follows historical targeting",
        "Date": "2025-05-13",
        "Content": "The North Korea-linked threat actor known as Konni APT has been attributed to a phishing campaign targeting government entities in Ukraine, indicating the threat actor's\ntargeting beyond Russia\n.\nEnterprise security firm Proofpoint said the end goal of the campaign is to collect intelligence on the \"trajectory of the Russian invasion.\"\n\"The group's interest in Ukraine follows historical targeting of government entities in Russia for strategic intelligence gathering purposes,\" security researchers Greg Lesnewich, Saher Naumaan, and Mark Kelly\nsaid\nin a report shared with The Hacker News.\nKonni APT\n, also known as Opal Sleet, Osmium, TA406, and\nVedalia\n, is a cyber espionage group that has a history of targeting entities in South Korea, the United States, and Russia. It's operational since at least 2014.\nAttack chains mounted by the threat actor often involve the use of phishing emails to distribute malware called Konni RAT (aka UpDog) and redirect recipients to credential harvesting pages. Proofpoint, in an\nanalysis\nof the threat group published in November 2021, assessed TA406 to be one of several actors that make up the activity publicly tracked as Kimsuky, Thallium, and Konni Group.\nThe latest set of attacks documented by the cybersecurity company entails the use of phishing emails that impersonate a fictitious senior fellow at a think tank called the Royal Institute of Strategic Studies, which is also a non-existent organization.\nThe email messages contain a link to a password-protected RAR archive that's hosted on the MEGA cloud service. Opening the RAR archive using a password mentioned in the message body launches an infection sequence that's engineered to conduct extensive reconnaissance of the compromised machines.\nSpecifically, present within the RAR archive is a CHM file that displays decoy content related to former Ukrainian military leader Valeriy Zaluzhnyi. Should the victim click anywhere on the page, a PowerShell command embedded within the HTML is executed to reach out to an external server and download a next-stage PowerShell payload.\nThe newly launched PowerShell script is capable of executing various commands to gather information about the system, encode it using Base64-encoding, and send it to the same server.\n\"The actor sent multiple phishing emails on consecutive days when the target did not click the link, asking the target if they had received the prior emails and if they would download the files,\" the researchers said.\nProofpoint said it also observed an HTML file being directly distributed as an attachment to the phishing messages. In this variation of the attack, the victim is instructed to click on an embedded link in the HTML file, resulting in the download of a ZIP archive that includes a benign PDF and a Windows shortcut (LNK) file.\nWhen the LNK is run, it executes Base64-encoded PowerShell to drop a Javascript Encoded file called \"Themes.jse\" using a Visual Basic Script. The JSE malware, in turn, contacts an attacker-controlled URL and runs the response from the server via PowerShell. The exact nature of the payload is currently not known.\nFurthermore, TA406 has been spotted attempting to harvest credentials by sending fake Microsoft security alert messages to Ukrainian government entities from ProtonMail accounts, warning them of suspicious sign-in activity from IP addresses located in the United States and urging them to verify the login by visiting a link.\nWhile the credential harvesting page has not been recovered, the\nsame compromised domain\nis said to have been used in the past to collect Naver login information.\n\"These credential harvesting campaigns took place prior to the attempted malware deployments and targeted some of the same users later targeted with the HTML delivery campaign,\" Proofpoint said. \"TA406 is very likely gathering intelligence to help North Korean leadership determine the current risk to its forces already in the theatre, as well as the likelihood that Russia will request more troops or armaments.\"\n\"Unlike Russian groups who have likely been tasked with gathering tactical battlefield information and targeting of Ukrainian forces in situ, TA406 has typically focused on more strategic, political intelligence collection efforts.\"\nKimsuky Attack Chain Targeting South Korea\nThe disclosure comes as the Konni group has been\nlinked\nto a sophisticated multi-stage malware campaign targeting entities in South Korea with ZIP archives containing LNK files, which run PowerShell scripts to extract a CAB archive and ultimately deliver batch script malware capable of collecting sensitive data and exfiltrating it to a remote server.\nThe findings also dovetail with\nspear-phishing\ncampaigns\norchestrated by\nKimsuky\nto target government agencies in South Korea by delivering a stealer malware capable of establishing command-and-control (C2 or C&C) communications and exfiltrating files, web browser data, and cryptocurrency wallet information.\nKimsuky Attack Chain Delivering PEBBLEDASH\nAccording to South Korean cybersecurity company AhnLab, Kimsuky has also been observed propagating\nPEBBLEDASH\nas part of a multi-stage infection sequence initiated via spear-phishing. The trojan was attributed by the U.S. government to the Lazarus Group in May 2020.\n\"While the Kimsuky group uses various types of malware, in the case of PEBBLEDASH, they execute malware based on an LNK file by spear-phishing in the initial access stage to launch their attacks,\" it\nsaid\n.\n\"They then utilize a PowerShell script to create a task scheduler and register it for automatic execution. Through communication with a Dropbox and TCP socket-based C&C server, the group installs multiple malware and tools including PEBBLEDASH.\"\nKonni and Kimsuky are far from the only North Korean threat actors to focus on Seoul. As recently as March 2025, South Korean entities have been found to be at the receiving end of another campaign carried out by\nAPT37\n, which is also referred to as ScarCruft.\nDubbed Operation ToyBox Story, the spear-phishing attacks singled out several activists focused on North Korea, per the Genians Security Center (GSC). The first observed spear phishing attack occurred on March 8, 2025.\n\"The email contained a Dropbox link leading to a compressed archive that included a malicious shortcut (LNK) file,\" the South Korean company\nsaid\n. \"When extracted and executed, the LNK file activated additional malware containing the keyword 'toy.'\"\nAPT37 Operation ToyBox Story Attack Chain\nThe LNK files are configured to launch a decoy HWP file and run PowerShell commands, leading to the execution of files named toy03.bat, toy02.bat, and toy01.bat (in that order), the last of which contains shellcode to launch RoKRAT, a staple malware associated with APT37.\nRokRAT\nis equipped to collect system information, capture screenshots, and use three different cloud services, including pCloud, Yandex, and Dropbox for C2.\n\"The threat actors exploited legitimate cloud services as C2 infrastructure and continued to modify shortcut (LNK) files while focusing on fileless attack techniques to evade detection by antivirus software installed on target endpoints,\" Genians said.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Moldovan Police Arrest Suspect in €4.5M Ransomware Attack on Dutch Research Agency",
        "Link": "https://thehackernews.com/2025/05/moldovan-police-arrest-suspect-in-45m.html",
        "Summary": "Moldovan law enforcement authorities have arrested a 45-year-old foreign man suspected of involvement in a series of ransomware attacks targeting Dutch companies in 2021.\n\"He is wanted internationally for committing several cybercrimes (ransomware attacks, blackmail, and money laundering) against companies based in the Netherlands,\" officials said in a statement Monday.\nIn conjunction with the",
        "Date": "2025-05-13",
        "Content": "Moldovan law enforcement authorities have arrested a 45-year-old foreign man suspected of involvement in a series of ransomware attacks targeting Dutch companies in 2021.\n\"He is wanted internationally for committing several cybercrimes (ransomware attacks, blackmail, and money laundering) against companies based in the Netherlands,\" officials\nsaid\nin a statement Monday.\nIn conjunction with the arrest, police seized over €84,000 ($93,000) in cash, an electronic wallet, two laptops, a mobile phone, a tablet, six bank cards, two data storage devices, and six memory cards.\nThe suspect's name was not disclosed. But he is said to have been detained after a search of his residence in Moldova. In at least one instance, the individual conducted a\nransomware attack\non the Netherlands Organization for Scientific Research (NWO), causing material damage worth approximately €4.5 million.\nThe attack took place in February 2021, resulting in the leak of internal documents after the organization refused to pay up. It was attributed to a ransomware crew known as DoppelPaymer.\n\"The attacker blocked network drives, rendered documents inaccessible, and stole some of our files,\" NWO\ndisclosed\nat the time. \"Following a demand for a ransom, which NWO cannot and will not accept on principle, the organization published some of the stolen files.\"\nDoppelPaymer\n, a ransomware family that first appeared in June 2019, is believed to be based on the BitPaymer ransomware, due to similarities in their source code, ransom notes, and payment portals.\nIn March 2023, law enforcement authorities from Germany and Ukraine\ntargeted\nsuspected core members of a cybercrime group that has been behind large-scale attacks using DoppelPaymer ransomware.\nGermany also issued arrest warrants against three alleged DoppelPaymer operatives – lgor Olegovich Turashev, Igor Garshin (aka Igor Garschin), and Irina Zemlianikina – who are said to be the \"masterminds of the criminal group.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Türkiye Hackers Exploited Output Messenger Zero-Day to Drop Golang Backdoors on Kurdish Servers",
        "Link": "https://thehackernews.com/2025/05/turkiye-hackers-exploited-output.html",
        "Summary": "A Türkiye-affiliated threat actor exploited a zero-day security flaw in an Indian enterprise communication platform called Output Messenger as part of a cyber espionage attack campaign since April 2024.\n\"These exploits have resulted in a collection of related user data from targets in Iraq,\" the Microsoft Threat Intelligence team said. \"The targets of the attack are associated with the Kurdish",
        "Date": "2025-05-13",
        "Content": "A Türkiye-affiliated threat actor exploited a zero-day security flaw in an Indian enterprise communication platform called Output Messenger as part of a cyber espionage attack campaign since April 2024.\n\"These exploits have resulted in a collection of related user data from targets in Iraq,\" the Microsoft Threat Intelligence team\nsaid\n. \"The targets of the attack are associated with the Kurdish military operating in Iraq, consistent with previously observed Marbled Dust targeting priorities.\"\nThe activity has been attributed to a threat group it tracks as\nMarbled Dust\n(formerly Silicon), which is also known as Cosmic Wolf, Sea Turtle, Teal Kurma, and UNC1326. The hacking crew is believed to have been active since at least 2017, although it wasn't until two years later that Cisco Talos documented attacks targeting public and private entities in the Middle East and North Africa.\nEarly last year, it was also identified as targeting telecommunication, media, internet service providers (ISPs), information technology (IT)-service providers, and Kurdish websites in the Netherlands.\nMicrosoft has assessed with moderate confidence that the threat actor has conducted some sort of reconnaissance beforehand to determine if its targets are Output Messenger users and then leverage the zero-day to distribute malicious payloads and exfiltrate data from targets.\nThe vulnerability in question is\nCVE-2025-27920\n, a directory traversal vulnerability affecting version 2.0.62 that allows remote attackers to access or execute arbitrary files. The issue has been\naddressed\nby its developer Srimax as of late December 2024 with version 2.0.63. The company, however, makes no mention of the flaw being exploited in the wild in its advisory.\nThe attack chain starts with the threat actor gaining access to the Output Messenger Server Manager application as an authenticated user. It's believed that Marbled Dust uses techniques like DNS hijacking or typosquatted domains to intercept the credentials required for authentication.\nThe access is then abused to collect the user's Output Messenger credentials and exploit CVE-2025-27920 to drop payloads like \"OM.vbs\" and \"OMServerService.vbs\" to the server startup folder and \"OMServerService.exe\" to the server's \"Users/public/videos\" directory.\nIn the next phase, the threat actor uses \"OMServerService.vbs\" to invoke \"OM.vbs\" and \"OMServerService.exe,\" the latter of which is a Golang backdoor that contacts a hard-coded domain (\"api.wordinfos[.]com\") for data exfiltration.\n\"On the client side, the installer extracts and executes both the legitimate file OutputMessenger.exe and OMClientService.exe, another Golang backdoor that connects to a Marbled Dust command-and-control (C2) domain,\" Microsoft noted.\n\"This backdoor first performs a connectivity check via a GET request to the C2 domain api.wordinfos[.]com. If successful, a second GET request is sent to the same C2 containing hostname information to uniquely identify the victim. The response from the C2 is then directly executed using the command 'cmd /c' which instructs the Windows command prompt to run a specific command and then terminate.\"\nAt one case involved a victim device with Output Messenger client software installed connecting to an IP address previously identified as used by Marbled Dust for likely data exfiltration.\nThe tech giant also noted that it discovered a second flaw, reflected cross-site scripting (XSS) vulnerability in the same version (\nCVE-2025-27921\n), although it said it found no evidence of it being weaponized in real-world attacks.\n\"This new attack signals a notable shift in Marbled Dust's capability while maintaining consistency in their overall approach,\" Microsoft said. \"The successful use of a zero-day exploit suggests an increase in technical sophistication and could also suggest that Marbled Dust's targeting priorities have escalated or that their operational goals have become more urgent.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "SAP patches second zero-day flaw exploited in recent attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/sap-patches-second-zero-day-flaw-exploited-in-recent-attacks/",
        "Summary": "SAP has released patches to address a second vulnerability exploited in recent attacks targeting SAP NetWeaver servers as a zero-day. [...]",
        "Date": "2025-05-13",
        "Content": "SAP has released patches to address a second vulnerability exploited in recent attacks targeting SAP NetWeaver servers as a zero-day.\nThe company issued security updates for this security flaw (\nCVE-2025-42999\n) on Monday, May 12, saying it was discovered while investigating zero-day attacks involving another unauthenticated file upload flaw (tracked as\nCVE-2025-31324\n) in SAP NetWeaver Visual Composer that was fixed in April.\n\"SAP is aware of and has been addressing vulnerabilities in SAP NETWEAVER Visual Composer,\" a SAP spokesperson told BleepingComputer. \"We ask all customers using SAP NETWEAVER to install these patches to protect themselves. The Security Notes can be found here:\n3594142\n&\n3604119\n.\"\nReliaQuest\nfirst detected\nthe attacks exploiting CVE-2025-31324 as a zero-day in April, reporting that threat actors were uploading JSP web shells to public directories and the Brute Ratel red team tool after breaching customers' systems through unauthorized file uploads on SAP NetWeaver. The hacked instances were fully patched, indicating the attackers used a zero-day exploit.\nThis malicious activity was also confirmed by cybersecurity firms watchTowr and\nOnapsis\n, who also observed the attackers uploading web shell backdoors on unpatched instances exposed online. Forescout's Vedere Labs has linked\nsome of these attacks\nto a Chinese threat actor it tracks as Chaya_004.\nOnyphe CTO Patrice Auffret told BleepingComputer in late April that \"Something like 20 Fortune 500/Global 500 companies are vulnerable, and many of them are compromised,\" adding that there were 1,284 vulnerable instances exposed online at the time, 474 already compromised.\nThe Shadowserver Foundation is now\ntracking over 2040 SAP Netweaver servers\nexposed on the Internet and vulnerable to attacks.\nVulnerable SAP NetWeaver servers exposed online (Shadowserver Foundation)\nNew flaw also exploited in zero-day attacks\nWhile SAP did not confirm that CVE-2025-42999 was exploited in the wild, Onapsis CTO Juan Pablo Perez-Etchegoyen told BleepingComputer that the threat actors were chaining both vulnerabilities in attacks since January.\n\"The attacks we observed during March 2025 (that started with basic proves back in January 2025) are actually abusing both, the lack of authentication (CVE-2025-31324) as well as the insecure de-serialization (CVE-2025-42999),\" Perez-Etchegoyen told BleepingComputer.\n\"This combination allowed attackers to execute arbitrary commands remotely and without any type of privileges on the system. This residual risk is basically a de-serialization vulnerability only exploitable by users with VisualComposerUser role on the SAP target system.\"\nSAP admins are advised to immediately patch their NetWeaver instances and consider disabling the Visual Composer service if possible, as well as restrict access to metadata uploader services and monitor for suspicious activity on their servers.\nSince the attacks started, CISA has\nadded\nthe CVE-2025-31324 flaw to its\nKnown Exploited Vulnerabilities Catalog\n, ordering federal agencies to secure their systems by May 20, as mandated by\nBinding Operational Directive (BOD) 22-01\n.\n\"These types of vulnerabilities are frequent attack vectors for malicious cyber actors and pose significant risks to the federal enterprise,\" CISA warned.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nSAP fixes suspected NetWeaver zero-day exploited in attacks\nFortinet fixes critical zero-day exploited in FortiVoice attacks\nChinese hackers behind attacks targeting SAP NetWeaver servers\nOver 1,200 SAP NetWeaver servers vulnerable to actively exploited flaw\nLazarus hackers breach six companies in watering hole attacks"
    },
    {
        "Title": "North Korea ramps up cyberspying in Ukraine to assess war risk",
        "Link": "https://www.bleepingcomputer.com/news/security/north-korea-ramps-up-cyberspying-in-ukraine-to-assess-war-risk/",
        "Summary": "The state-backed North Korean threat group Konni (Opal Sleet, TA406) was observed targeting Ukrainian government entities in intelligence collection operations. [...]",
        "Date": "2025-05-13",
        "Content": "The state-backed North Korean threat group Konni (Opal Sleet, TA406) was observed targeting Ukrainian government entities in intelligence collection operations.\nThe attackers use phishing emails that impersonate think tanks, referencing important political events or military developments to lure their targets.\nProofpoint researchers who discovered the activity in February 2025 suggest that it's likely an effort to support the DPRK's military involvement alongside Russia in Ukraine and evaluate the political status underpinning the conflict.\n\"Proofpoint assesses TA406 is targeting Ukrainian government entities to better understand the appetite to continue fighting against the Russian invasion and assess the medium-term outlook of the conflict,\"\nexplain the researchers\n.\n\"North Korea committed troops to assist Russia in the fall of 2024, and TA406 is very likely gathering intelligence to help North Korean leadership determine the current risk to its forces already in the theatre, as well as the likelihood that Russia will request more troops or armaments.\"\nAttack chain\nThe malicious emails sent to targets impersonate members of fictitious think tanks, dealing with key issues like recent dismissals of military leaders or presidential elections in Ukraine.\nThe attackers use freemail services like Gmail, ProtonMail, and Outlook to repeatedly send messages to their targets, urging them to click on the link.\nPhishing email used in the Konni attacks\nSource: Proofpoint\nDoing so takes the victims to a MEGA-hosted download that drops a password-protected .RAR archive (Analytical Report.rar) on their systems, containing a .CHM file with the same name.\nOpening that triggers embedded PowerShell that downloads the next-stage PowerShell, which captures reconnaissance info from the infected host, and establishes persistence.\nProofpoint has also seen variants that employ HTML attachments dropping ZIP archives containing benign PDFs and malicious LNK files, leading to PowerShell and VBScript execution.\nEncoded PowerShell in the LNK file\nSource: Proofpoint\nProofpoint could not retrieve the final payload in these attacks, which is believed to be some sort of malware/backdoor that facilitates espionage operations.\nThe researchers also noted that Konni executed preparational attacks earlier, targeting the same people and attempting to harvest account credentials they could use to hijack accounts.\nThese attempts involved emails spoofing Microsoft security alerts, claiming \"unusual sign-in activity,\" and asking the recipient to verify their login on a phishing site at \"jetmf[.]com.\"\nFake Microsoft security alert\nSource: Proofpoint\nNorth Korea's targeting of Ukrainian government entities adds a new dimension to the country's already complex cybersecurity battlefield, which has been dominated by relentless Russian state-sponsored attacks since the start of the invasion.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nFrance ties Russian APT28 hackers to 12 cyberattacks on French orgs\nHackers abuse OAuth 2.0 workflows to hijack Microsoft 365 accounts\nIvanti Connect Secure zero-days exploited to deploy custom malware\nRedCurl cyberspies create ransomware to encrypt Hyper-V servers\nChinese Weaver Ant hackers spied on telco network for 4 years"
    },
    {
        "Title": "Twilio denies breach following leak of alleged Steam 2FA codes",
        "Link": "https://www.bleepingcomputer.com/news/security/twilio-denies-breach-following-leak-of-alleged-steam-2fa-codes/",
        "Summary": "Twilio has denied in a statement for BleepingComputer that it was breached after a threat actor claimed to be holding over 89 million Steam user records with one-time access codes. [...]",
        "Date": "2025-05-13",
        "Content": "Twilio has denied in a statement for BleepingComputer that it was breached after a threat actor claimed to be holding over 89 million Steam user records with one-time access codes.\nThe threat actor, using the alias Machine1337 (also known as EnergyWeaponsUser), advertised a trove of data allegedly pulled from Steam, offering to sell it for $5,000.\nWhen examining the leaked files, which contained 3,000 records, BleepingComputer found historic SMS text messages with one-time passcodes for Steam, including the recipient's phone number.\nThreat actor's post on XSS\nSource: BleepingComputer\nOwned by Valve Corporation, Steam is the world's largest digital distribution platform for PC games, with over 120 million monthly active users.\nValve did not respond to our requests for a comment on the threat actor's claims.\nIndependent games journalist MellolwOnline1, who is also the creator of the SteamSentinels community group that monitors abuse and fraud in the Steam ecosystem, suggests that the incident is a supply-chain compromise involving Twilio.\nMellowOnline1 pointed to technical evidence in the leaked data that indicates real-time SMS log entries from Twilio's backend systems, hypothesizing a compromised admin account or abuse of API keys.\nTwilio is a cloud communications company that provides APIs for sending SMS, voice calls, and 2FA messages, widely used by apps like Steam for user authentication.\nWhen asked by BleepingComputer about their possible involvement in the alleged Steam breach, a Twilio spokesperson acknowledged the situation and confirmed they're investigating.\nTwilio takes these threats very seriously and is reviewing the alleged incident. We will provide more information as it becomes available,\" a company spokesperson told BleepingComputer.\nTwilio later followed up with a statement clarifying that the company's systems had not been breached.\n\"There is no evidence to suggest that Twilio was breached. We have reviewed a sampling of the data found online, and see no indication that this data was obtained from Twilio.\" - Twilio spokesperson\nLooking at the data, one possible explanation for its origin is a leak from an SMS provider that intermediates the communication of one-time access codes between Twilio and Steam users.\nSome of the messages delivered are clearly confirmation codes for accessing a Steam account or for associating a phone number with one.\nHowever, BleepingComputer could not determine if the data comes from an SMS provider or who it might be. Additionally, we could not verify the threat actor's claims.\nIt is worth mentioning that some of the data is relatively new, as we found many of the delivery dates were from the beginning of March.\nTwilio provides a two-factor authentication (2FA) product called\nVerify API\nthat customers, game providers among them, can implement with various communication channels (SMS, WhatsApp, voice, email, passkeys, silent device approval, push, or time-based one-time passwords).\nOut of abundance of caution, Steam users are recommended to enable\nSteam Guard Mobile Authenticator\nfor additional security and monitor account activity for unauthorized login attempts.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nSupply chain attack hits npm package with 45,000 weekly downloads\nMagento supply chain attack compromises hundreds of e-stores\nPyPI packages caught stealing credit card numbers, Discord tokens\nAI-hallucinated code dependencies become new supply chain risk\nRecent GitHub supply chain attack traced to leaked SpotBugs token"
    },
    {
        "Title": "Ivanti fixes EPMM zero-days chained in code execution attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/ivanti-fixes-epmm-zero-days-chained-in-code-execution-attacks/",
        "Summary": "Ivanti warned customers today to patch their Ivanti Endpoint Manager Mobile (EPMM) software against two security vulnerabilities chained in attacks to gain remote code execution. [...]",
        "Date": "2025-05-13",
        "Content": "Ivanti warned customers today to patch their Ivanti Endpoint Manager Mobile (EPMM) software against two security vulnerabilities chained in attacks to gain remote code execution.\n\"Ivanti has released updates for Endpoint Manager Mobile (EPMM) which addresses one medium and one high severity vulnerability,\"\nthe company said\n.\n\"When chained together, successful exploitation could lead to unauthenticated remote code execution. We are aware of a very limited number of customers whose solution has been exploited at the time of disclosure.\"\nThe first security flaw (\nCVE-2025-4427\n) is an authentication bypass in EPMM's API component, allowing attackers to access protected resources on vulnerable devices. The second (tracked as\nCVE-2025-4428\n) is a remote code execution vulnerability that allows threat actors to execute arbitrary code on targeted systems via maliciously crafted API requests.\nIvanti says customers can mitigate the two zero-day flaws by installing Ivanti Endpoint Manager Mobile 11.12.0.5, 12.3.0.2, 12.4.0.2, or 12.5.0.1.\nThe company added that, while it's still investigating these attacks and can't provide indicators of compromise, customers should reach out to the support team for further guidance.\nWhile Ivanti said the two vulnerabilities are \"associated\" with two open-source libraries used by EPMM, it didn't share their names in the advisory. A spokesperson directed BleepingComputer to today's advisory for further information.\n\"The issue only affects the on-prem EPMM product. It is not present in Ivanti Neurons for MDM, Ivanti's cloud-based unified endpoint management solution, Ivanti Sentry, or any other Ivanti products,\"\nIvanti added\nin a separate advisory. \"We urge all customers using the on-prem EPMM product to promptly install the patch.\"\nThe Shadowserver threat monitoring platform currently tracks\nhundreds of Ivanti EPMM instances\nexposed online, most in Germany (992) and the United States (418).\nIvanti EPMM instances exposed online (Shadowserver)\n​Today, Ivanti also released security updates to\naddress a critical authentication bypass vulnerability\n(CVE-2025-22462) impacting its Neurons for ITSM IT service management solution that can let unauthenticated attackers gain administrative access.\nIt also urged customers to patch a default credentials flaw (CVE-2025-22460) in its Cloud Services Appliance (CSA) that lets local authenticated attackers escalate privileges on vulnerable systems.\nIn recent years, multiple other security vulnerabilities\nhave been\nexploited\nin zero-day attacks\ntargeting Ivanti's\nVPN appliances\nand\nICS, IPS, and ZTA gateways\n.\nThe FBI and CISA also warned in a joint advisory issued in January that threat actors are still exploiting months-old\nIvanti Cloud Service Appliances (CSA) security vulnerabilities\nto breach vulnerable networks.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nSAP fixes suspected NetWeaver zero-day exploited in attacks\nIvanti patches Connect Secure zero-day exploited since mid-March\nFortinet fixes critical zero-day exploited in FortiVoice attacks\nOver 1,200 SAP NetWeaver servers vulnerable to actively exploited flaw\nIvanti Connect Secure zero-days now under mass exploitation"
    },
    {
        "Title": "Microsoft May 2025 Patch Tuesday fixes 5 exploited zero-days, 72 flaws",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-may-2025-patch-tuesday-fixes-5-exploited-zero-days-72-flaws/",
        "Summary": "Today is Microsoft's May 2025 Patch Tuesday, which includes security updates for 72 flaws, including five actively exploited and two publicly disclosed zero-day vulnerabilities. [...]",
        "Date": "2025-05-13",
        "Content": "Today is Microsoft's May 2025 Patch Tuesday, which includes security updates for 72 flaws, including five actively exploited and two publicly disclosed zero-day vulnerabilities.\nThis Patch Tuesday also fixes six \"Critical\" vulnerabilities, five being remote code execution vulnerabilities and another an information disclosure bug.\nThe number of bugs in each vulnerability category is listed below:\n17 Elevation of Privilege Vulnerabilities\n2 Security Feature Bypass Vulnerabilities\n28 Remote Code Execution Vulnerabilities\n15 Information Disclosure Vulnerabilities\n7 Denial of Service Vulnerabilities\n2 Spoofing Vulnerabilities\nThis count does not include Azure, Dataverse, Mariner, and Microsoft Edge flaws that were fixed earlier this month.\nTo learn more about the non-security updates released today, you can review our dedicated articles on the\nWindows 11 KB5058411 and KB5058405 cumulative updates\nand the\nWindows 10 KB5058379 update\n.\nFive actively exploited zero-days\nThis month's Patch Tuesday fixes one actively exploited zero-day. Microsoft classifies a zero-day flaw as publicly disclosed or actively exploited while no official fix is available.\nThe actively exploited zero-day vulnerability in today's updates is:\nCVE-2025-30400\n- Microsoft DWM Core Library Elevation of Privilege Vulnerability\nMicrosoft fixed an exploited elevation of privileges vulnerability that gives attackers SYSTEM privileges.\n\"Use after free in Windows DWM allows an authorized attacker to elevate privileges locally,\" reads the advisory.\nMicrosoft attributes the discovery of this flaw to the Microsoft Threat Intelligence Center.\nCVE-2025-32701\n- Windows Common Log File System Driver Elevation of Privilege Vulnerability\nMicrosoft fixed an exploited elevation of privileges vulnerability that gives attackers SYSTEM privileges.\n\"Use after free in Windows Common Log File System Driver allows an authorized attacker to elevate privileges locally,\" reads the advisory.\nMicrosoft attributes the discovery of this flaw to the Microsoft Threat Intelligence Center.\nCVE-2025-32706\n- Windows Common Log File System Driver Elevation of Privilege Vulnerability\nMicrosoft fixed an exploited elevation of privileges vulnerability that gives attackers SYSTEM privileges.\n\"Improper input validation in Windows Common Log File System Driver allows an authorized attacker to elevate privileges locally,\" explains the advisory.\nMicrosoft attributes the discovery of this flaw to Benoit Sevens of Google Threat Intelligence Group and the CrowdStrike Advanced Research Team.\nCVE-2025-32709\n- Windows Ancillary Function Driver for WinSock Elevation of Privilege Vulnerability\nMicrosoft fixed an exploited elevation of privileges vulnerability that gives attackers SYSTEM privileges.\n\"Use after free in Windows Ancillary Function Driver for WinSock allows an authorized attacker to elevate privileges locally,\" explains Microsoft's advisory.\nThis flaw was disclosed by an \"Anonymous\" researcher.\nCVE-2025-30397\n- Scripting Engine Memory Corruption Vulnerability\nMicrosoft fixed a remote code execution vulnerability that can be exploited through Microsoft Edge or Internet Explorer.\n\"Access of resource using incompatible type ('type confusion') in Microsoft Scripting Engine allows an unauthorized attacker to execute code over a network,\" explains Microsoft.\nMicrosoft says that threat actors need to trick an authenticated user into clicking on a specially crafted link in Edge or Internet Explorer, allowing an unauthenticated attacker to gain remote code execution.\nMicrosoft attributes the discovery of this flaw to the Microsoft Threat Intelligence Center.\nMicrosoft has not shared any details on how these flaws were exploited in attacks.\nThe publicly disclosed zero-days are:\nCVE-2025-26685\n- Microsoft Defender for Identity Spoofing Vulnerability\nMicrosoft fixes a flaw in Microsoft Defender that allows an unauthenticated attack to spoof another account.\n\"Improper authentication in Microsoft Defender for Identity allows an unauthorized attacker to perform spoofing over an adjacent network,\" explains Microsoft.\nThe flaw can be exploited by an unauthenticated attacker with LAN access.\nMicrosoft attributes the discovery of this flaw to Joshua Murrell with NetSPI.\nCVE-2025-32702\n- Visual Studio Remote Code Execution Vulnerability\nMicrosoft fixed a Visual Studio remote code execution flaw that can be exploited by an unauthenticated attacker.\n\"Improper neutralization of special elements used in a command ('command injection') in Visual Studio allows an unauthorized attacker to execute code locally,\" explains Microsoft.\nMicrosoft has not shared who disclosed this flaw.\nRecent updates from other companies\nOther vendors who released updates or advisories in May 2025 include:\nApple\nreleased security updates\nfor iOS, iPadOS, and macOS.\nCisco\nfixed a maximum severity vulnerability\nin IOS XE Software for Wireless LAN Controllers.\nFortinet\nreleased security updates\nfor numerous products, including an\nactively exploited zero day used in attacks on FortiVoice\n.\nGoogle's\nMay 2025 security updates\nfor Android fixed an actively exploited\nzero-click FreeType 2 code execution vulnerability\n.\nIntel\nreleased CPU microcodes\nfor a flaw named \"\nBranch Privilege Injection\n\" that leaks data from privileged memory.\nSAP\nreleases security updates\nfor multiple products, including a critical RCE flaw.\nSonicWall\nfixes a zero-day vulnerability\nthat was exploited in attacks.\nThe May 2025 Patch Tuesday Security Updates\nBelow is the complete list of resolved vulnerabilities in the May 2025 Patch Tuesday updates.\nTo access the full description of each vulnerability and the systems it affects, you can view the\nfull report here\n.\nTag\nCVE ID\nCVE Title\nSeverity\n.NET, Visual Studio, and Build Tools for Visual Studio\nCVE-2025-26646\n.NET, Visual Studio, and Build Tools for Visual Studio Spoofing Vulnerability\nImportant\nActive Directory Certificate Services (AD CS)\nCVE-2025-29968\nActive Directory Certificate Services (AD CS) Denial of Service Vulnerability\nImportant\nAzure\nCVE-2025-33072\nMicrosoft msagsfeedback.azurewebsites.net Information Disclosure Vulnerability\nCritical\nAzure\nCVE-2025-30387\nDocument Intelligence Studio On-Prem Elevation of Privilege Vulnerability\nImportant\nAzure Automation\nCVE-2025-29827\nAzure Automation Elevation of Privilege Vulnerability\nCritical\nAzure DevOps\nCVE-2025-29813\nAzure DevOps Server Elevation of Privilege Vulnerability\nCritical\nAzure File Sync\nCVE-2025-29973\nMicrosoft Azure File Sync Elevation of Privilege Vulnerability\nImportant\nAzure Storage Resource Provider\nCVE-2025-29972\nAzure Storage Resource Provider Spoofing Vulnerability\nCritical\nMicrosoft Brokering File System\nCVE-2025-29970\nMicrosoft Brokering File System Elevation of Privilege Vulnerability\nImportant\nMicrosoft Dataverse\nCVE-2025-47732\nMicrosoft Dataverse Remote Code Execution Vulnerability\nCritical\nMicrosoft Dataverse\nCVE-2025-29826\nMicrosoft Dataverse Elevation of Privilege Vulnerability\nImportant\nMicrosoft Defender for Endpoint\nCVE-2025-26684\nMicrosoft Defender Elevation of Privilege Vulnerability\nImportant\nMicrosoft Defender for Identity\nCVE-2025-26685\nMicrosoft Defender for Identity Spoofing Vulnerability\nImportant\nMicrosoft Edge (Chromium-based)\nCVE-2025-4050\nChromium: CVE-2025-4050 Out of bounds memory access in DevTools\nUnknown\nMicrosoft Edge (Chromium-based)\nCVE-2025-4096\nChromium: CVE-2025-4096 Heap buffer overflow in HTML\nUnknown\nMicrosoft Edge (Chromium-based)\nCVE-2025-29825\nMicrosoft Edge (Chromium-based) Spoofing Vulnerability\nLow\nMicrosoft Edge (Chromium-based)\nCVE-2025-4052\nChromium: CVE-2025-4052 Inappropriate implementation in DevTools\nUnknown\nMicrosoft Edge (Chromium-based)\nCVE-2025-4051\nChromium: CVE-2025-4051 Insufficient data validation in DevTools\nUnknown\nMicrosoft Edge (Chromium-based)\nCVE-2025-4372\nChromium: CVE-2025-4372 Use after free in WebAudio\nUnknown\nMicrosoft Office\nCVE-2025-30377\nMicrosoft Office Remote Code Execution Vulnerability\nCritical\nMicrosoft Office\nCVE-2025-30386\nMicrosoft Office Remote Code Execution Vulnerability\nCritical\nMicrosoft Office Excel\nCVE-2025-29977\nMicrosoft Excel Remote Code Execution Vulnerability\nImportant\nMicrosoft Office Excel\nCVE-2025-30383\nMicrosoft Excel Remote Code Execution Vulnerability\nImportant\nMicrosoft Office Excel\nCVE-2025-29979\nMicrosoft Excel Remote Code Execution Vulnerability\nImportant\nMicrosoft Office Excel\nCVE-2025-30376\nMicrosoft Excel Remote Code Execution Vulnerability\nImportant\nMicrosoft Office Excel\nCVE-2025-30393\nMicrosoft Excel Remote Code Execution Vulnerability\nImportant\nMicrosoft Office Excel\nCVE-2025-32704\nMicrosoft Excel Remote Code Execution Vulnerability\nImportant\nMicrosoft Office Excel\nCVE-2025-30375\nMicrosoft Excel Remote Code Execution Vulnerability\nImportant\nMicrosoft Office Excel\nCVE-2025-30379\nMicrosoft Excel Remote Code Execution Vulnerability\nImportant\nMicrosoft Office Excel\nCVE-2025-30381\nMicrosoft Excel Remote Code Execution Vulnerability\nImportant\nMicrosoft Office Outlook\nCVE-2025-32705\nMicrosoft Outlook Remote Code Execution Vulnerability\nImportant\nMicrosoft Office PowerPoint\nCVE-2025-29978\nMicrosoft PowerPoint Remote Code Execution Vulnerability\nImportant\nMicrosoft Office SharePoint\nCVE-2025-30378\nMicrosoft SharePoint Server Remote Code Execution Vulnerability\nImportant\nMicrosoft Office SharePoint\nCVE-2025-30382\nMicrosoft SharePoint Server Remote Code Execution Vulnerability\nImportant\nMicrosoft Office SharePoint\nCVE-2025-30384\nMicrosoft SharePoint Server Remote Code Execution Vulnerability\nImportant\nMicrosoft Office SharePoint\nCVE-2025-29976\nMicrosoft SharePoint Server Elevation of Privilege Vulnerability\nImportant\nMicrosoft PC Manager\nCVE-2025-29975\nMicrosoft PC Manager Elevation of Privilege Vulnerability\nImportant\nMicrosoft Power Apps\nCVE-2025-47733\nMicrosoft Power Apps Information Disclosure Vulnerability\nCritical\nMicrosoft Scripting Engine\nCVE-2025-30397\nScripting Engine Memory Corruption Vulnerability\nImportant\nRemote Desktop Gateway Service\nCVE-2025-26677\nWindows Remote Desktop Gateway (RD Gateway) Denial of Service Vulnerability\nImportant\nRemote Desktop Gateway Service\nCVE-2025-29967\nRemote Desktop Client Remote Code Execution Vulnerability\nCritical\nRemote Desktop Gateway Service\nCVE-2025-29831\nWindows Remote Desktop Services Remote Code Execution Vulnerability\nImportant\nRemote Desktop Gateway Service\nCVE-2025-30394\nWindows Remote Desktop Gateway (RD Gateway) Denial of Service Vulnerability\nImportant\nRole: Windows Hyper-V\nCVE-2025-29955\nWindows Hyper-V Denial of Service Vulnerability\nImportant\nUniversal Print Management Service\nCVE-2025-29841\nUniversal Print Management Service Elevation of Privilege Vulnerability\nImportant\nUrlMon\nCVE-2025-29842\nUrlMon Security Feature Bypass Vulnerability\nImportant\nVisual Studio\nCVE-2025-32703\nVisual Studio Information Disclosure Vulnerability\nImportant\nVisual Studio\nCVE-2025-32702\nVisual Studio Remote Code Execution Vulnerability\nImportant\nVisual Studio Code\nCVE-2025-21264\nVisual Studio Code Security Feature Bypass Vulnerability\nImportant\nWeb Threat Defense (WTD.sys)\nCVE-2025-29971\nWeb Threat Defense (WTD.sys) Denial of Service Vulnerability\nImportant\nWindows Ancillary Function Driver for WinSock\nCVE-2025-32709\nWindows Ancillary Function Driver for WinSock Elevation of Privilege Vulnerability\nImportant\nWindows Common Log File System Driver\nCVE-2025-32701\nWindows Common Log File System Driver Elevation of Privilege Vulnerability\nImportant\nWindows Common Log File System Driver\nCVE-2025-30385\nWindows Common Log File System Driver Elevation of Privilege Vulnerability\nImportant\nWindows Common Log File System Driver\nCVE-2025-32706\nWindows Common Log File System Driver Elevation of Privilege Vulnerability\nImportant\nWindows Deployment Services\nCVE-2025-29957\nWindows Deployment Services Denial of Service Vulnerability\nImportant\nWindows Drivers\nCVE-2025-29838\nWindows ExecutionContext Driver Elevation of Privilege Vulnerability\nImportant\nWindows DWM\nCVE-2025-30400\nMicrosoft DWM Core Library Elevation of Privilege Vulnerability\nImportant\nWindows File Server\nCVE-2025-29839\nWindows Multiple UNC Provider Driver Information Disclosure Vulnerability\nImportant\nWindows Fundamentals\nCVE-2025-29969\nMS-EVEN RPC Remote Code Execution Vulnerability\nImportant\nWindows Hardware Lab Kit\nCVE-2025-27488\nMicrosoft Windows Hardware Lab Kit (HLK) Elevation of Privilege Vulnerability\nImportant\nWindows Installer\nCVE-2025-29837\nWindows Installer Information Disclosure Vulnerability\nImportant\nWindows Kernel\nCVE-2025-24063\nKernel Streaming Service Driver Elevation of Privilege Vulnerability\nImportant\nWindows Kernel\nCVE-2025-29974\nWindows Kernel Information Disclosure Vulnerability\nImportant\nWindows LDAP - Lightweight Directory Access Protocol\nCVE-2025-29954\nWindows Lightweight Directory Access Protocol (LDAP) Denial of Service Vulnerability\nImportant\nWindows Media\nCVE-2025-29962\nWindows Media Remote Code Execution Vulnerability\nImportant\nWindows Media\nCVE-2025-29963\nWindows Media Remote Code Execution Vulnerability\nImportant\nWindows Media\nCVE-2025-29964\nWindows Media Remote Code Execution Vulnerability\nImportant\nWindows Media\nCVE-2025-29840\nWindows Media Remote Code Execution Vulnerability\nImportant\nWindows NTFS\nCVE-2025-32707\nNTFS Elevation of Privilege Vulnerability\nImportant\nWindows Remote Desktop\nCVE-2025-29966\nRemote Desktop Client Remote Code Execution Vulnerability\nCritical\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-29836\nWindows Routing and Remote Access Service (RRAS) Information Disclosure Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-29959\nWindows Routing and Remote Access Service (RRAS) Information Disclosure Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-29835\nWindows Remote Access Connection Manager Information Disclosure Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-29960\nWindows Routing and Remote Access Service (RRAS) Information Disclosure Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-29832\nWindows Routing and Remote Access Service (RRAS) Information Disclosure Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-29830\nWindows Routing and Remote Access Service (RRAS) Information Disclosure Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-29961\nWindows Routing and Remote Access Service (RRAS) Information Disclosure Vulnerability\nImportant\nWindows Routing and Remote Access Service (RRAS)\nCVE-2025-29958\nWindows Routing and Remote Access Service (RRAS) Information Disclosure Vulnerability\nImportant\nWindows Secure Kernel Mode\nCVE-2025-27468\nWindows Kernel-Mode Driver Elevation of Privilege Vulnerability\nImportant\nWindows SMB\nCVE-2025-29956\nWindows SMB Information Disclosure Vulnerability\nImportant\nWindows Trusted Runtime Interface Driver\nCVE-2025-29829\nWindows Trusted Runtime Interface Driver Information Disclosure Vulnerability\nImportant\nWindows Virtual Machine Bus\nCVE-2025-29833\nMicrosoft Virtual Machine Bus (VMBus) Remote Code Execution Vulnerability\nCritical\nWindows Win32K - GRFX\nCVE-2025-30388\nWindows Graphics Component Remote Code Execution Vulnerability\nImportant\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft April 2025 Patch Tuesday fixes exploited zero-day, 134 flaws\nWindows 10 KB5055518 update fixes random text when printing\nWindows 10 KB5058379 update fixes SgrmBroker errors in Event Viewer\nMicrosoft: Windows 'inetpub' folder created by security fix, don’t delete\nMicrosoft adds hotpatching support to Windows 11 Enterprise"
    },
    {
        "Title": "Windows 11 KB5058411 and KB5058405 cumulative updates released",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5058411-and-kb5058405-cumulative-updates-released/",
        "Summary": "Microsoft has released Windows 11 KB5058411 and KB5058405 cumulative updates for versions 24H2 and 23H2 to fix security vulnerabilities and issues. [...]",
        "Date": "2025-05-13",
        "Content": "Microsoft has released Windows 11\nKB5058411\nand\nKB5058405\ncumulative updates for versions 24H2 and 23H2 to fix security vulnerabilities and issues, including 134 flaws.\nToday's updates are mandatory as they contain the\nMay 2025 Patch Tuesday\nsecurity patches for vulnerabilities discovered in previous months.\nWindows 11 users can install today's update by going to\nStart\n>\nSettings\n>\nWindows Update\nand clicking on\n'Check for Updates\n.'\nYou can also manually download and install the update from the\nMicrosoft Update Catalog\n.\nWhat's new in the May 2025 Patch Tuesday update\nAfter installing today's security updates, Windows 11 24H2 (\nKB5058411\n) will have its build number changed to Build 26100.4061, and 23H2 (\nKB5058405\n) will be changed to 226x1.5335.\nThis month's Patch Tuesday update has several new features, including AI-powered Recall for Copilot+ PCs:\nRecall (preview)\nYou work across so many apps, sites, and documents it can be hard to remember where you saw something you want to get back to. Recall (preview) saves you time by offering an entirely new way to search for things you’ve seen or done on your PC securely. With the AI capabilities of Copilot+ PCs, it’s now possible to quickly find and get back to any app, website, image, or document just by describing its content. To use Recall, you will need to opt-in to save snapshots, which are images of your activity, and enroll in Windows Hello to confirm your presence so only you can access your snapshots. You are always in control of what snapshots are saved and can pause saving snapshots at any time. As you use your Copilot+ PC throughout the day working on documents or presentations, taking video calls, and context switching across activities, Recall will take regular snapshots and help you find things faster and easier. When you need to find or get back to something you’ve done previously, open Recall and authenticate with Windows Hello.\n[\nClick to Do (preview\n)\nNew!\nClick to Do (preview) makes it easier than ever for you to take immediate action on whatever catches your eye on-screen on your\nCopilot+ PC\n, saving you time by helping complete tasks inline and quickly getting you to the app that can best complete the job. For example, select an image using Click to Do to take actions like erasing objects using the Photos app or remove the background using Paint. To use Click to Do, simply use\nWindows key\n+\nmouse click\nor\nWindows key\n+\nQ.\nYou can also enter through the Snipping Tool menu and print screen or searching “Click to Do” in the search box on the Windows taskbar.\nNew!\nOn Snapdragon-powered Copilot+ PCs, Click to Do includes intelligent text actions. Use\nWindows key\n+\nmouse click\nor\nWindows key\n+\nQ\nto select a text block and then drag to select the text that you want.\nNew!\nEasily open Click to Do when you swipe from the rightmost edge of your display.\nNew!\nThe policies for managing Click to Do in a commercial environment.  IT admins can learn more by viewing\nManage Click to Do\n.\nImproved Windows Search\nNew!\nFinding your documents, photos, and settings across Windows 11 is easier on\nCopilot+ PCs\nwith improved Windows Search, powered by semantic indexing models along with traditional lexical indexing. Whether it’s searching in File Explorer, in Windows Search on your taskbar, or in Settings— just type what’s on your mind to find it on your Copilot+ PC. You no longer need to remember file names, exact words in file content, or settings names. Searching for settings like “change my theme” will work within the Settings app for now. Thanks to the power of the 40+ TOPS NPU onboard Copilot+ PCs, these search improvements work even when you’re not connected to the internet.\nNew!\nLocating your photos stored and saved in the cloud is getting simpler on\nCopilot+ PCs\n. You can use your own words in the search box at the upper-right corner of File Explorer like “summer picnics.” In addition to photos stored locally on your Copilot+ PC, photos from the cloud will show up in the search results together. Exact matches for your keywords within the text of your cloud files will also show in the search results. You can try this experience out today with your personal OneDrive when signed in with your Microsoft account and connected to the internet. Now available on AMD and Intel-powered Copilot+ PCs.\n[Phone Link]\nNew!\nYou can do even more with your Windows PC and your mobile device with direct access to cross-device features from the Start menu. For example, you can make phone calls, send SMS messages, access your photos, or share content between your mobile device and PC.\n[Widgets]\nNew!\nWeb developers can use their existing content to create interactive widgets that can be added to multiple widgets surfaces. For more info, see\nWeb widget providers\n.\nNew!\nThere are some new updates to the new Widgets on Lock experience for devices in the European Economic Area (EEA). In addition to accessibility and craftsmanship improvements, the Lock screen weather widget now supports customization. To configure your weather widget, go to\nSettings\n>\nPersonalization\n>\nLock screen\nand select the “Customize widget” option from the weather widget more options menu. More widgets will be customizable in the future.\n[File Explorer]\nNew!\nPivot-based curated views on File Explorer Home that supports ease of access of Microsoft 365 content on Windows. Be more productive and get highly relevant content at your fingertips on File Explorer Home.\nWindows 11 24H2 issues with Roblox on ARM PCs are still not patched, but we noticed that Microsoft has finally resolved BSODs and other issues with Windows 11.\nTo install the updates, open\nStart\n>\nSettings\n>\nWindows Update\nand click on\n'Check for Updates\n.'\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft: Windows 11 24H2 now ready to rollout to everyone\nWindows 11 upgrade block lifted after Safe Exam Browser fix\nWindows 11 24H2 blocked on PCs with code-obfuscation driver BSODs\nMicrosoft pushes fix for Windows 11 24H2 update failures\nMicrosoft: Windows 11 24H2 updates fail with 0x80240069 errors"
    },
    {
        "Title": "Android 16 expands 'Advanced Protection' with device-level security",
        "Link": "https://www.bleepingcomputer.com/news/security/android-16-expands-advanced-protection-with-device-level-security/",
        "Summary": "Google is announcing improvements for the  Advanced Protection feature in Android 16 that strengthen defenses against sophisticated spyware attacks. [...]",
        "Date": "2025-05-13",
        "Content": "Google is announcing improvements for the  Advanced Protection feature in Android 16 that strengthen defenses against sophisticated spyware attacks.\nThe Android platform has been a constant target for\nspyware\ncampaigns and sophisticated attacks using\ndigital forensics platforms\nthat often rely on zero-day vulnerabilities to infect devices with minimal or no user interaction.\nGoogle already offers the '\nAdvanced Protection Program\n' for high-risk individuals (e.g. journalists, elected official, public figures) but its current focus is on protecting the Google Account.\nWith Android 16, the company expands security hardening to the mobile device itself, beyond certain app-level settings.\nThis device-level security layer bundles Androids' strongest system-level security features and prevents disabling, maliciously or by accident, individual security features part of the Advanced Protection umbrella.\nGoogle's Advanced Protection on Android is similar to\nApple’s Lockdown Mode\nand will become available on the latest version of the mobile operating system showcased today as part of Google's \"The Android Show: I/O Edition.\"\nHow Advanced Protection works\nAdvanced Protection is designed as an easy-to-activate device-level setting that consolidates Android’s strongest security features into a single system.\nAdvanced Protection settings\nSource: Google\nSpecifically, it activates verified boot and runtime integrity checks, strong sandboxing, USB port lockdown, app isolation,\nautomatic device reboots\nwhen idle for 72 hours, and Google Play Protect with enhanced app scanning.\nIt also eliminates the ability to turn off or weaken core security settings and enforces secure settings across Google apps (Chrome, Messages, Phone) as well as third-party apps that opt into the integration.\nFinally, it introduces new protections like intrusion logging and blocking auto-reconnects to insecure networks.\nIntrusion logging is a new system that logs device events in a privacy-preserving, tamper-proof, cloud-stored log, which is useful for investigating compromises. The data will only be accessible by the user and protected by end-to-end encryption.\nAuto-reconnection blocking concerns weak Wi-Fi networks that don’t require passwords or use WEP protection, mitigating the risk of passive surveillance or\ncaptive portal attacks\n.\nAll of the security features controlled through Advanced Protection are listed in the table below. It is important to note that availability for some of them depends on the manufacturer and the type of device and will present later this year.\nOverview of all features encompassed in Advanced Protection\nSource: Google\nMore security features to land with Android 16\nApart from Advanced Protection, Android 16 is set to bring several data security and privacy enhancements through a new set of features poised to protect users from phone scammers and malware apps.\nOne of them is “in-call scam protections” that will block risky actions during calls from unknown numbers, like sideloading APKs, granting accessibility permissions, or disabling Play Protect.\nIn-call scam protection in action\nSource: Google\nAnother feature highlighted by Google today is the Key Verifier mechanism in the Messages app. The improvement is designed to fight tex-based fraud and impersonation by verifying the identity of the other party with public encryption keys associated with contacts.\nThe role of the public-key cryptography in Google Messages is to provide end-to-end encrypted messaging.\n\"By verifying contact keys in your Google Contacts app (through a QR code scanning or number comparison), you can have an extra layer of assurance that the person on the other end is genuine and that your conversation is private with them,\" Google says.\nThe Key Verifier feature can also protect against SIM-swap attacks where attackers pose as someone from the victim’s contacts.\nKey Verifier's QR code prompt\nSource: Google\nAndroid 16 also comes with improvements for\nScam Detection\nfor the Messages and Phone apps by integrating artificial intelligence to identify scams related to various topics, among them toll road, billing fee, crypto, financial impersonation, gift card and prizes, and technical support.\nGoogle also improved\nTheft Protection\nfeatures by turning Find My Device into Find Hub, a feature that also covers lost items and works with Bluetooth tags and with the partnership of multiple airlines.\nThe company announced that later this year Find Hub will integrate satellite connectivity and allow connections with friends and family even in places without a cellular signal.\nThe new features Google announced today for\nAndroid 16 are available here\n.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nGoogle fixes actively exploited FreeType flaw on Android\nGoogle to pay $1.375 billion to settle Texas data privacy violations\nBluetooth 6.1 enhances privacy with randomized RPA timing\nRussian army targeted by new Android malware hidden in mapping app\nNew Android malware steals your credit cards for NFC relay attacks"
    },
    {
        "Title": "Windows 10 KB5058379 update fixes SgrmBroker errors in Event Viewer",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb5058379-update-fixes-sgrmbroker-errors-in-event-viewer/",
        "Summary": "Microsoft has released the KB5058379 cumulative update for Windows 10 22H2 and Windows 10 21H2, with four fixes and changes, including one for an SGRMBroker bug. [...]",
        "Date": "2025-05-13",
        "Content": "Microsoft has released the KB5058379 cumulative update for Windows 10 22H2 and Windows 10 21H2, with four fixes and changes, including one for an SGRMBroker bug.\nThe Windows 10 KB5058379 update is mandatory as it contains\nMicrosoft's May 2025 Patch Tuesday\nsecurity updates, which fix seven zero-day vulnerabilities.\nWindows users can install this update by going into\nSettings\n, clicking on\nWindows Update,\nand manually performing a\n'Check for Updates\n.'\nHowever, as this update is mandatory, it will automatically start installing in Windows once you check for updates. To make this more manageable, you can schedule a time when your computer is restarted to finish the installation.\nAfter installing this update, Windows 10 22H2 will be updated to build 19045.5854 and Windows 10 21H2 will be build 19044.5854.\nWindows 10 users can also manually download and install the KB5058379 update from the\nMicrosoft Update Catalog\n.\nWhat's new in Windows 10 KB5058379\nThe KB5058379 update includes four changes and fixes in Windows 10, including a fix for the long-standing System Guard Runtime Monitor Broker error messages in Event Viewer.\nThe four changes and fixes are listed below:\n[Graphics]\nFix: The check for\nGPU paravirtualization\nwas case-sensitive in\nWindows Subsystem for Linux 2 (WSL2)\n. This issue might potentially cause GPU paravirtualization support to fail.\n[OS Security]\nUpdates to the Windows Kernel Vulnerable Driver Blocklist (DriverSiPolicy.p7b). Additions have been made to blocklist drivers with security vulnerabilities that have been used in Bring Your Own Vulnerable Driver (BYOVD) attacks.\n[System Guard Runtime Monitor Broker service (Known issue)]\nFixed: The Windows Event Viewer might display an error related to SgrmBroker.exe, on devices that have installed Windows updates released January 14, 2025, or later. This error can be found under Windows Logs > System as Event 7023, with text similar to ‘The System Guard Runtime Monitor Broker service terminated with the following error: %%3489660935’.\n21H2 only - [Secure Boot Advanced Targeting (SBAT) and Linux Extensible Firmware Interface (EFI)]\nThis update applies improvements to SBAT for the detection of Linux systems.\nMicrosoft says there is only one known issue, which has been a problem since the January 2025 updates.\nSince then, Windows updates may fail if the Citrix Session Recording Agent (SRA) version 2411 is installed on the device.\n\"As a workaround, stop the Session Recording Monitoring service, install the Microsoft security update, and enable the Session Recording Monitoring service,\" explains a\nCitrix support bulletin\n.\nA complete list of fixes can be found in the\nKB5058379 support bulletin\nand last month's\nKB5055612 preview update bulletin\n.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nWindows 10 KB5055518 update fixes random text when printing\nMicrosoft May 2025 Patch Tuesday fixes 5 exploited zero-days, 72 flaws\nMicrosoft April 2025 Patch Tuesday fixes exploited zero-day, 134 flaws\nMicrosoft will update Office apps on Windows 10 until 2028\nMicrosoft: Windows 'inetpub' folder created by security fix, don’t delete"
    },
    {
        "Title": "Fortinet fixes critical zero-day exploited in FortiVoice attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/fortinet-fixes-critical-zero-day-exploited-in-fortivoice-attacks/",
        "Summary": "Fortinet released security updates to patch a critical remote code execution vulnerability exploited as a zero-day in attacks targeting FortiVoice enterprise phone systems. [...]",
        "Date": "2025-05-13",
        "Content": "Fortinet released security updates to patch a critical remote code execution vulnerability exploited as a zero-day in attacks targeting FortiVoice enterprise phone systems.\nThe security flaw is a stack-based overflow vulnerability tracked as\nCVE-2025-32756\nthat also impacts FortiMail, FortiNDR, FortiRecorder, and FortiCamera.\nAs the company explains in a security advisory issued on Tuesday, successful exploitation can allow remote unauthenticated attackers to execute arbitrary code or commands via maliciously crafted HTTP requests.\nFortinet's Product Security Team discovered CVE-2025-32756 based on attackers' activity, including network scans, system crashlogs deletion to cover their tracks, and 'fcgi debugging' being toggled on to log credentials from the system or SSH login attempts.\nAs detailed in today's security advisory, the threat actors have launched attacks from half a dozen IP addresses, including 198.105.127[.]124, 43.228.217[.]173, 43.228.217[.]82, 156.236.76[.]90, 218.187.69[.]244, and 218.187.69[.]59.\nIndicators of compromise spotted by Fortinet during the attacks' analysis include the 'fcgi debugging' setting (which isn't toggled on by default), enabled on compromised systems.\nTo check if this setting is turned on on your system, you should see \"general to-file ENABLED\" after running the following command:\ndiag debug application fcgi\n.\nWhile investigating these attacks, Fortinet has observed the threat actors deploying malware on hacked devices, adding cron jobs designed to harvest credentials, and dropping scripts to scan the victims' networks.\nThe company also shared mitigation advice for customers who can't immediately install today's security updates, which requires them to disable the HTTP/HTTPS administrative interface on vulnerable devices.\nLast month, the Shadowserver Foundation\ndiscovered over 16,000 internet-exposed Fortinet devices\ncompromised using a new symlink backdoor that provides threat actors with read-only access to sensitive files on now-patched devices hacked in previous attacks.\nIn early April, Fortinet also\nwarned of a critical FortiSwitch vulnerability\nthat can be exploited to change administrator passwords remotely.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nSAP fixes suspected NetWeaver zero-day exploited in attacks\nIvanti fixes EPMM zero-days chained in code execution attacks\nOutput Messenger flaw exploited as zero-day in espionage attacks\nSamsung MagicINFO 9 Server RCE flaw now exploited in attacks\nCritical Langflow RCE flaw exploited to hack AI app servers"
    },
    {
        "Title": "Ivanti warns of critical Neurons for ITSM auth bypass flaw",
        "Link": "https://www.bleepingcomputer.com/news/security/ivanti-warns-of-critical-neurons-for-itsm-auth-bypass-flaw/",
        "Summary": "​Ivanti has released security updates for its Neurons for ITSM IT service management solution that mitigate a critical authentication bypass vulnerability. [...]",
        "Date": "2025-05-13",
        "Content": "​Ivanti has released security updates for its Neurons for ITSM IT service management solution that mitigate a critical authentication bypass vulnerability.\nTracked as CVE-2025-22462, the security flaw can let unauthenticated attackers gain administrative access to unpatched systems in low-complexity attacks, depending on system configuration.\nAs the company highlighted in a security advisory released today, organizations that followed its guidance are less exposed to attacks.\n\"Customers who have followed\nIvanti's guidance\non securing the IIS website and restricted access to a limited number of IP addresses and domain names have a reduced risk to their environment,\"\nIvanti said\n.\n\"Customers who have users log into the solution from outside their company network also have a reduced risk to their environment if they ensure that the solution\nis configured with a DMZ.\n\"\nIvanti added that CVE-2025-22462 only impacts on-premises instances running versions 2023.4, 2024.2, 2024.3, and earlier, and said that it found no evidence that the vulnerability is being exploited to target customers.\nProduct Name\nAffected Version(s)\nResolved Version(s)\nIvanti Neurons for ITSM (on-prem only)\n2023.4, 2024.2, and 2024.3\n2023.4 May 2025 Security Patch\n2024.2 May 2025 Security Patch\n2024.3 May 2025 Security Patch\nThe company also urged customers today to patch a default credentials security flaw (CVE-2025-22460) in its Cloud Services Appliance (CSA) that can let local authenticated attackers escalate privileges on vulnerable systems.\nWhile this vulnerability isn't exploited in the wild either, Ivanti warned that the patch won't be applied correctly after installing today's security updates and asked admins to reinstall from scratch or use\nthese mitigation steps\nto ensure their network is protected from potential attacks.\n\"It has been identified that if a Cloud Services Application installation is upgraded to version 5.0.5, this fix is not automatically applied as intended. This will be addressed in a future release,\" Ivanti said.\nLast month, the company also\npatched a critical Connect Secure zero-day\nexploited by the UNC5221 China-linked espionage group in remote code execution attacks to deploy malware since at least mid-March 2025.\nAs CISA and the FBI warned in January, threat actors are still exploiting\nIvanti Cloud Service Appliances (CSA) security vulnerabilities\npatched since September to breach vulnerable networks.\nOver the last year, multiple other Ivanti security flaws\nhave been\nexploited\nin zero-day attacks\ntargeting the company's\nVPN appliances\nand\nICS, IPS, and ZTA gateways\n.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nIvanti fixes EPMM zero-days chained in code execution attacks\nNewest Ivanti SSRF zero-day now under mass exploitation\nCisco fixes max severity IOS XE flaw letting attackers hijack devices\nHackers exploit OttoKit WordPress plugin flaw to add admin accounts\nSAP fixes suspected NetWeaver zero-day exploited in attacks"
    },
    {
        "Title": "New Intel CPU flaws leak sensitive data from privileged memory",
        "Link": "https://www.bleepingcomputer.com/news/security/new-intel-cpu-flaws-leak-sensitive-data-from-privileged-memory/",
        "Summary": "A new \"Branch Privilege Injection\" flaw in all modern Intel CPUs allows attackers to leak sensitive data from memory regions allocated to privileged software like the operating system kernel. [...]",
        "Date": "2025-05-13",
        "Content": "A new \"Branch Privilege Injection\" flaw in all modern Intel CPUs allows attackers to leak sensitive data from memory regions allocated to privileged software like the operating system kernel.\nTypically, these regions are populated with information like passwords, cryptographic keys, memory of other processes, and kernel data structures, so protecting them from leakage is crucial.\nAccording to\nETH Zurich researchers\nSandro Rüegge, Johannes Wikner, and Kaveh Razavi, Spectre v2 mitigations held for six years, but their latest \"Branch Predictor Race Conditions\" exploit effectively bypasses them.\nThe flaw, which is named 'branch privilege injection' and tracked under\nCVE-2024-45332\n, is a race condition on the subsystem of branch predictors used in Intel CPUs.\nBranch predictors like Branch Target Buffer (BTB) and Indirect Branch Predictor (IBP) are specialized hardware components that try to guess the outcome of a branch instruction before it's resolved to keep the CPU pipeline full for optimal performance.\nThese predictions are speculative, meaning they are undone if they end up being wrong. However, if they are correct, it increases performance.\nThe researchers found that Intel's branch predictor updates are not synchronized with instruction execution, resulting in these updates traversing privilege boundaries.\nIf a privilege switch happens, like from user mode to kernel mode, there is a small window of opportunity during which the update is associated with the wrong privilege level.\nAs a result, isolation between user and kernel is broken, and a non-privileged user can leak data from privileged processes.\nETH Zurich's team developed an exploit that trains the CPU to predict a specific branch target, then makes a system call to move execution into the OS kernel, leading to speculative execution using the attacker-controlled target (\"gadget\").\nThis code accesses secret data loaded into the cache, and using a side-channel method, the contents are leaked to the attacker.\nThe researchers demonstrated their attack on Ubuntu 24.04 with default mitigations enabled to read the contents of the '/etc/shadow/' file containing hashed account passwords. The exploit can achieve peak leak rates of 5.6 KB/sec at 99.8% accuracy.\nImpact and fixes\nCVE-2024-45332 impacts all Intel CPUs from the ninth generation onward, including Coffee Lake, Comet Lake, Rocket Lake, Alder Lake, and Raptor Lake.\n\"All intel processors since the 9th generation (Coffee Lake Refresh) are affected by Branch Privilege Injection,\" explains the researchers.\n\"However, we have observed predictions bypassing the Indirect Branch Prediction Barrier (IBPB) on processors as far back as 7th generation (Kaby Lake).\"\nETH Zurich researchers did not test older generations at this time, but since they do not support Enhanced Indirect Branch Restricted Speculation (eIBRS), they're less relevant to this specific exploit and likely more prone to older Spectre v2-like attacks.\nArm Cortex-X1, Cortex-A76, and AMD Zen 5 and Zen 4 chips were also examined, but they do not exhibit the same asynchronous predictor behavior, so they are not vulnerable to CVE-2024-45332.\nThe evaluated processor families\nSource: ETH Zurich\nAlthough the attack was demonstrated on Linux, the flaw is present on the hardware level, so it's theoretically exploitable on Windows too.\nThe researchers reported their findings to Intel in September 2024, and the tech giant released microcode updates that mitigate CVE-2024-45332 on impacted models.\nThe firmware-level mitigations introduce a 2.7% performance overhead, while software mitigations have a performance impact between 1.6% and 8.3%, depending on the CPU.\nThe risk is low for regular users, and attacks have multiple strong prerequisites to open up realistic exploitation scenarios. That being said, applying the latest BIOS/UEFI and OS updates is recommended.\nETH Zurich will present the full details of their exploit in a technical paper at the upcoming\nUSENIX Security 2025\n.\nUpdate 5/13 -\nIntel published a\nsecurity bulletin about CVE-2024-45332\nand also sent BleepingComputer the below comment:\n“We appreciate the work done by ETH Zurich on this research and collaboration on coordinated public disclosure. Intel is strengthening its Spectre v2 hardware mitigations and recommends customers contact their system manufacturer for the appropriate update. To date, Intel is not aware of any real-world exploits of transient execution vulnerabilities.” - Intel spokesperson\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nHacker 'NullBulge' pleads guilty to stealing Disney's Slack data\nInterlock ransomware claims DaVita attack, leaks stolen data\nInfamous message board 4chan taken down following major hack\nWestern Sydney University discloses security breaches, data leak\nOracle says \"obsolete servers\" hacked, denies cloud breach"
    },
    {
        "Title": "Microsoft will update Office apps on Windows 10 until 2028",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-will-update-office-apps-on-windows-10-until-2028/",
        "Summary": "Microsoft has backtracked on its plan to end support for Office apps on Windows 10 later this year and announced that it will continue providing security updates for three more years, until 2028. [...]",
        "Date": "2025-05-13",
        "Content": "Microsoft has backtracked on its plan to end support for Office apps on Windows 10 later this year and announced that it will continue providing security updates for three more years, until 2028.\nThis announcement comes after the company\nwarned in\nJanuary\nthat\nit would drop support for Microsoft 365 Apps like Word, and they'll have to upgrade their systems to Windows 11 to keep using them after October 14, 2025.\n\"In the interest of maintaining your security while you upgrade to Windows 11, we will continue providing security updates for Microsoft 365 on Windows 10 for a total of three years after Windows 10 end of support, ending on October 10, 2028,\" Redmond\nsays\nin a support document updated last month.\nIn a\nseparate document\nupdated last week, the company added that these updates will be delivered using the standard Office update channels.\n\"Although apps such as Word will continue to work after Windows 10 reaches end of support, using an unsupported operating system can cause performance and reliability issues when running Microsoft 365 Apps. If your organization is using Microsoft 365 Apps on devices running Windows 10, those devices should move to Windows 11,\" Redmond added.\n​​Microsoft\nalso reminded users\nin April that Office 2016 and Office 2019 will reach the end of extended support six months from now, on October 14. The company provides upgrade guidance on migrating from older versions of Office to Microsoft 365 Apps\non its support website\n.\nAlthough Windows 10 will reach the end of support in eight months, over 52% of Windows systems worldwide\nstill run Windows 10\n, while just over 43% run Windows 11, according to Statcounter Global data.\nWindows market share (Statcounter)\n​Even though the company has been pushing customers to upgrade their devices since Windows 11's\nOctober 2021 launch\n, even\nnaming 2025\n\"the year of the Windows 11 PC refresh\" earlier this year, users are reluctant to switch due to\n\"non-negotiable\"\nTPM 2.0 support requirements.\n​While the Windows 10 end of support is rapidly approaching, the company announced in October 2024 that Windows 10\nhome users could delay switching\nto Windows 11 for another year if they're ready to pay $30 for Extended Security Updates (ESU).\nAdditionally, Long-Term Servicing Channel (LTSC) releases like\nWindows 10 IoT Enterprise LTSC 2021\nand Long-Term Servicing Branch (LTSB) releases like\nWindows 10 2016 LTSB\nthat cater to specialized devices, such as medical and industrial systems, will also receive updates way beyond October 2025.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nWindows 10 KB5058379 update fixes SgrmBroker errors in Event Viewer\nMicrosoft announces fix for CPU spikes when typing in Outlook\nMicrosoft Office 2019 Will Work on Windows 10 Exclusively\nMicrosoft blocks ActiveX by default in Microsoft 365, Office 2024\nMicrosoft warns of CPU spikes when typing in classic Outlook"
    },
    {
        "Title": "Increase Red Team Operations 10X with Adversarial Exposure Validation",
        "Link": "https://www.bleepingcomputer.com/news/security/increase-red-team-operations-10x-with-adversarial-exposure-validation/",
        "Summary": "Red teams uncover what others miss — but they can't be everywhere, all the time. Adversarial Exposure Validation combines BAS + Automated Pentesting to extend red team impact, uncover real attack paths, and validate defenses continuously. Learn more from Picus Security on how AEV can help protect your network. [...]",
        "Date": "2025-05-13",
        "Content": "Red teaming is a powerful way to uncover critical security gaps by simulating real-world adversary behaviors. However, in practice, traditional red team engagements are hard to scale.\nUsually relying on highly skilled experts to run, they can take weeks to plan, execute, and then report findings. By the time you get your results back, they may already be outdated, or worse, exploited.\nIn the real world, attackers don't wait for your team to finish its report. And in today's AI-powered threat landscape, waiting weeks for red team results is no longer a viable option.\nCISOs and security leaders need offensive testing that's faster, more consistent, and more scalable, without draining budgets or resources.\nThe answer? Adopt the\nAdversarial Exposure Validation\napproach.\nThe Challenge of Scaling Red Team Activities\nBefore we get to the solution, let's break down why scaling traditional red team operations has been so difficult:\nHuman Expertise Bottleneck:\nRed teaming depends on rare and expensive talent who can think like attackers. And with limited staff and even more limited budgets, red teams have a lot of trouble scaling their operations. Without proper automation, repetitive tasks pile up, blocking your experts' ability to focus on what matters most.\nTime and Resource-Intensive:\nManual red team operations take weeks and usually produce a one-time snapshot of security posture. In fast-changing environments, that snapshot can become irrelevant almost immediately.\nLack of Continuous Coverage:\nMost red team exercises are infrequent and customized. Long gaps between tests leave organizations blind to any and all new exposures that emerge between engagements.\nOrganizations need offensive testing that is automated, continuous, and scalable. The Adversarial Exposure Validation approach meets this demand head-on by combining Breach and Attack Simulation (BAS) and Automated Penetration Testing.\nTry Exposure Validation in Your Own Environment\nExperience how Picus correlates, prioritizes, and validates risk across siloed findings. Identify real threats, deploy vendor-specific fixes, and gain visibility.\nStart your free trial now to see how Picus Platform identifies exploitable vulnerabilities and prioritizes the most critical threats for remediation.\nStart Your Free Trial\nBreach and Attack Simulation: Continuous Security Control Validation\nBreach and Attack Simulation\ncontinuously mimics known cyberattacks and adversary techniques mapped to frameworks like MITRE ATT&CK, simulating actual attacks to your specific environment and defenses to test how well they detect, block, and respond at every stage of the kill chain.\nWhy BAS matters:\nBreadth of Coverage:\nModern BAS solutions simulate thousands of known and emerging threats from ransomware to lateral movement and data exfiltration.\nContinuous and Safe Testing:\nBAS runs non-intrusive simulations safely in live production environments, enabling daily or weekly testing without disruption.\nControl Validation:\nBAS answers a crucial question, \"Would our tools detect or block this attack?\" and identifies gaps in your SIEM, EDR, or firewall stack.\nDrives Purple Teaming:\nBAS outputs can be used to facilitate collaborative exercises between red and blue teams to refine detection and response.\nWith repeatable and on-demand testing, BAS enables faster remediation, continuous benchmarking, and the agility to respond to new threats without waiting for the next audit or assessment.\nAutomated Penetration Testing: Think and Test Like an Attacker\nAutomated Penetration Testing\nemulates attacker workflows to discover real and exploitable attack paths without needing a full red team on standby. While BAS checks whether your controls react to threats, Automated Pentesting asks: \"Can I get in? And if so, how far can I go?\"\nWhat sets Automated Pentesting apart:\nAttack Path Discovery:\nAutomated Pentesting solutions chain together vulnerabilities and misconfigurations to simulate end-to-end attack paths from initial access to domain takeover.\nReal-World Exploitation:\nAutomated Pentesting solutions run safe and controlled exploitation to prove actual risk.\nImpact-Driven Findings:\nAutomated Pentesting reports show which systems or assets were compromised and help prioritize remediation based on real exposure.\nFrequent Deep Dives:\nAutomated Pentesting assessments can run far more often than traditional red team exercises, helping teams catch and fix issues before a real attacker finds them.\nBy revealing exploitable paths and chaining risks that may otherwise seem low-priority, Automated Pentesting offers a realistic picture of what attackers could achieve in your environment.\nHow BAS and Automated Pentesting Complement Each Other\nBAS and Automated Penetration Testing serve distinct but complementary roles in the Adversarial Exposure Validation approach.\nBAS focuses on validating your defenses and testing whether your controls are continuously detecting and blocking known attack techniques. It's ideal for drift detection, control tuning, and validating SOC visibility.\nAutomated Pentesting, on the other hand, focuses on proving what happens when those defenses fail. It uncovers real attack paths, exploits weaknesses, and shows potential impact especially valuable for prioritizing risk and reducing blind spots.\nUsed together, BAS and Automated Pentesting offer:\nOngoing Visibility:\nBAS provides frequent, repeatable testing across environments to maintain continuous visibility.\nDepth and Impact:\nAutomated Pentesting delivers rich, context-driven insights that help teams focus on the threats and fixes that actually matter.\nBalanced Coverage:\nBAS is typically used by blue and purple teams to improve detection, while Automated Pentesting supports red teams with scalable offensive capabilities.\nTogether, they transform offensive testing from a once-a-year project into a continuous and operationalized practice that evolves with the constant changes to both your security environment and the overall threat landscape.\nScaling Red Team Operations with Adversarial Exposure Validation\nHere's how Adversarial Exposure Validation (AEV) helps red teams do more with less:\nForce Multipliers:\nWith AEV, you can run thousands of attack simulations automatically that are impossible to replicate manually at scale.\nCodified Expertise:\nYour red teams can build reusable BAS scenarios, creating a threat library tailored to your organization.\nContinuous Readiness:\nRather than waiting for the next assessment, teams have a constant, nearly-real-time insight into how their security posture is evolving.\nSmarter Prioritization:\nAutomated Pentesting filters out the excess alert noise, helping security teams focus on the exposures that are actually exploitable and high-risk to your organization.\nMost importantly, automation frees human red teamers to do what they do best: uncover complex attack vectors, test advanced threat models, and simulate the unexpected while letting automation and their existing defenses handle the rest.\nWant to Implement Adversarial Exposure Validation?\nAdversarial Exposure Validation isn't just about having the right tools in the right places. It's at least as much about adopting a threat-driven mindset and embedding continuous validation into your security operations.\nIf you're looking to unify your offensive testing efforts,\nPicus Security\noffers an integrated platform that combines\nBreach and Attack Simulation\nand\nAutomated Penetration Testing\nto deliver actionable outcomes. Highlights include:\n30,000+ Real-World TTPs:\nThe\nPicus Threat Library\ncovers a wide range of threats, from ransomware to cloud misconfigurations.\nBuilt-In Remediation:\nGet ready-to-use, vendor-specific remediation suggestions from the\nPicus Mitigation Library\n.\nUnified Validation:\nValidate both your security controls and potential attack paths in the same place.\nWith the Picus, validation is no longer a once-a-year box to check. It's a continuous, always-on process. Stop testing like it's 2010. Start defending like it's 2025.\nDiscover your real security posture.\nRequest a demo.\nSponsored and written by\nPicus Security\n."
    },
    {
        "Title": "M&S says customer data stolen in cyberattack, forces password resets",
        "Link": "https://www.bleepingcomputer.com/news/security/mands-says-customer-data-stolen-in-cyberattack-forces-password-resets/",
        "Summary": "Marks and Spencer (M&amp;S) confirms that customer data was stolen in a cyberattack last month, when ransomware was used to encrypt servers. [...]",
        "Date": "2025-05-13",
        "Content": "Marks and Spencer (M&S) confirms that customer data was stolen in a cyberattack last month, when ransomware was used to encrypt servers.\nThe attack occurred on April 22, 2025, significantly\nimpacting business operations\non the retailer's 1,400 stores, forcing it to\nstop accepting online orders\n.\nBleepingComputer first revealed that the attacks were conducted by DragonForce ransomware affiliates utilizing\nScattered Spider social engineering tactics\nto breach Marks and Spencer's network. During the attack, the threat actors encrypted VMware ESXi virtual machines hosted on the company's servers.\nSince then, M&S has been investigating the attack and confirmed that the intruders stole sensitive personal information belonging to customers.\nThis was announced by M&S CEO, Stuart Machin, who posted a letter on the retailer's official\nFacebook page\n.\n\"As we continue to manage the current cyber incident, we have written to customers today to let them know that unfortunately, some personal customer information has been taken,\" states Machin.\n\"Importantly, there is no evidence that the information has been shared and it does not include usable card or payment details, or account passwords, so there is no need for customers to take any action.\"\nDespite these assurances, all customers with active M&S accounts will be prompted to reset their password the next time they attempt to log in via the website or app.\nAn\nFAQ page\npublished on the M&S website says the following data types have been exposed:\nFull name\nEmail address\nHome address\nPhone number\nDate of birth\nOnline order history\nHousehold information\nSparks Pay reference numbers\n\"Masked\" payment card details\nAn M&S spokesperson told BleepingComputer that the credit cards are obfuscated in line with the PCI guidelines.\n\"You do not need to take any action, but you might receive emails, calls or texts claiming to be from M&S when they are not, so do be cautious,\" warns M&S.\n\"We will never contact you and ask you to provide us with personal account information, like usernames, and we will never ask you to give us your password.\"\nSparks offers will be paused for now, but no specific updates on the status of online order processing or other business disruptions were shared this time.\nM&S said it would notify all impacted customers accordingly and promised to share more details when those become available.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nAscension says recent data breach affects over 430,000 patients\nVC giant Insight Partners confirms investor data stolen in breach\nVeriSource now says February data breach impacts 4 million people\nBaltimore City Public Schools data breach affects over 31,000 people\nInterlock ransomware claims DaVita attack, leaks stolen data"
    },
    {
        "Title": "Building Effective Security Programs Requires Strategy, Patience, and Clear Vision",
        "Link": "https://www.darkreading.com/cyber-risk/building-effective-security-programs-strategy-patience-clear-vision",
        "Summary": "Capital One executives share insights on how organizations should design their security programs, implement passwordless technologies, and reduce their attack surface.",
        "Date": "2025-05-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/building-effective-security-programs-strategy-patience-clear-vision"
    },
    {
        "Title": "Windows Zero-Day Bug Exploited for Browser-Led RCE",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/windows-zero-day-bug-exploited-browser-rce",
        "Summary": "Microsoft's May 2025 Patch Tuesday update also contains four other actively exploited zero-day security vulnerabilities, two publicly known bugs, and 12 critical patches.",
        "Date": "2025-05-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/windows-zero-day-bug-exploited-browser-rce"
    },
    {
        "Title": "Chinese Actor Hit Taiwanese Drone Makers, Supply Chains",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/chinese-actor-taiwanese-drone-makers-supply-chains",
        "Summary": "Tidrone concentrated on military entities and the satellite sector, using their associated service providers and ERP software to infect not just drones but all the entities that are part of their supply chains.",
        "Date": "2025-05-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/chinese-actor-taiwanese-drone-makers-supply-chains"
    },
    {
        "Title": "What Does EU's Bug Database Mean for Vulnerability Tracking?",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/eu-bug-database-vulnerability-tracking",
        "Summary": "The EU cyber agency ENISA has launched its vulnerability database, the EUVD; security experts shared their thoughts regarding what this means for CVEs, as well as the larger conversation around how bugs are tracked.",
        "Date": "2025-05-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/eu-bug-database-vulnerability-tracking"
    },
    {
        "Title": "CISA Warns of TeleMessage Vuln Despite Low CVSS Score",
        "Link": "https://www.darkreading.com/threat-intelligence/cisa-warns-telemessage-vuln-low-cvss-score",
        "Summary": "Though the app claims to use end-to-end encryption, hackers have reportedly accessed archived data on the app's servers via a new vulnerability.",
        "Date": "2025-05-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/cisa-warns-telemessage-vuln-low-cvss-score"
    },
    {
        "Title": "DeepSeek, Deep Research Mean Deep Changes for AI Security",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/deepseek-deep-research-deep-changes-ai-security",
        "Summary": "Why securing the inference chain is now the top priority for AI applications and infrastructure.",
        "Date": "2025-05-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/deepseek-deep-research-deep-changes-ai-security"
    },
    {
        "Title": "North Korea's TA406 Targets Ukraine for Intel",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/north-koreas-ta406-targets-ukraine",
        "Summary": "The threat group's goal is to help Pyongyang assess risk to its troops deployed in Ukraine and to figure out if Moscow might want more.",
        "Date": "2025-05-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/north-koreas-ta406-targets-ukraine"
    },
    {
        "Title": "Adobe Patches Big Batch of Critical-Severity Software Flaws",
        "Link": "https://www.securityweek.com/adobe-patches-big-batch-of-critical-severity-software-flaws/",
        "Summary": "<p>Adobe Patch Tuesday headlined by a major Adobe ColdFusion update patching a wide swatch of code execution and privilege escalation attacks.</p>\n<p>The post <a href=\"https://www.securityweek.com/adobe-patches-big-batch-of-critical-severity-software-flaws/\">Adobe Patches Big Batch of Critical-Severity Software Flaws</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/adobe-patches-big-batch-of-critical-severity-software-flaws/"
    },
    {
        "Title": "Microsoft to Lay Off About 3% of Its Workforce",
        "Link": "https://www.securityweek.com/microsoft-to-lay-off-about-3-of-its-workforce/",
        "Summary": "<p>The tech giant didn’t disclose the total amount of lost jobs but it will amount to about 6,000 people.</p>\n<p>The post <a href=\"https://www.securityweek.com/microsoft-to-lay-off-about-3-of-its-workforce/\">Microsoft to Lay Off About 3% of Its Workforce</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/microsoft-to-lay-off-about-3-of-its-workforce/"
    },
    {
        "Title": "Zero-Day Attacks Highlight Another Busy Microsoft Patch Tuesday",
        "Link": "https://www.securityweek.com/zero-day-attacks-highlight-another-busy-microsoft-patch-tuesday/",
        "Summary": "<p>Patch Tuesday: Microsoft patches at least 70 security bugs and flagged five zero-days in the “exploitation detected” category.</p>\n<p>The post <a href=\"https://www.securityweek.com/zero-day-attacks-highlight-another-busy-microsoft-patch-tuesday/\">Zero-Day Attacks Highlight Another Busy Microsoft Patch Tuesday</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/zero-day-attacks-highlight-another-busy-microsoft-patch-tuesday/"
    },
    {
        "Title": "Sharing Intelligence Beyond CTI Teams, Across Wider Functions and Departments",
        "Link": "https://www.securityweek.com/sharing-intelligence-beyond-cti-teams-across-wider-functions-and-departments/",
        "Summary": "<p>CTI, digital brand protection and other cyber risk initiatives shouldn’t only be utilized by security and cyber teams. </p>\n<p>The post <a href=\"https://www.securityweek.com/sharing-intelligence-beyond-cti-teams-across-wider-functions-and-departments/\">Sharing Intelligence Beyond CTI Teams, Across Wider Functions and Departments</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/sharing-intelligence-beyond-cti-teams-across-wider-functions-and-departments/"
    },
    {
        "Title": "SAP Patches Another Critical NetWeaver Vulnerability",
        "Link": "https://www.securityweek.com/sap-patches-another-critical-netweaver-vulnerability/",
        "Summary": "<p>SAP has released 16 new security notes on its May 2025 Security Patch Day, including a note dealing with another critical NetWeaver vulnerability.</p>\n<p>The post <a href=\"https://www.securityweek.com/sap-patches-another-critical-netweaver-vulnerability/\">SAP Patches Another Critical NetWeaver Vulnerability</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/sap-patches-another-critical-netweaver-vulnerability/"
    },
    {
        "Title": "Radware Says Recently Disclosed WAF Bypasses Were Patched in 2023",
        "Link": "https://www.securityweek.com/radware-says-recently-disclosed-waf-bypasses-were-patched-in-2023/",
        "Summary": "<p>The Radware Cloud WAF product vulnerabilities disclosed by CERT/CC were addressed two years ago.</p>\n<p>The post <a href=\"https://www.securityweek.com/radware-says-recently-disclosed-waf-bypasses-were-patched-in-2023/\">Radware Says Recently Disclosed WAF Bypasses Were Patched in 2023</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/radware-says-recently-disclosed-waf-bypasses-were-patched-in-2023/"
    },
    {
        "Title": "Marks & Spencer Says Data Stolen in Ransomware Attack",
        "Link": "https://www.securityweek.com/marks-spencer-says-data-stolen-in-ransomware-attack/",
        "Summary": "<p>Marks &#038; Spencer has confirmed that personal information was stolen in a recent cyberattack claimed by a ransomware group.</p>\n<p>The post <a href=\"https://www.securityweek.com/marks-spencer-says-data-stolen-in-ransomware-attack/\">Marks &#038; Spencer Says Data Stolen in Ransomware Attack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/marks-spencer-says-data-stolen-in-ransomware-attack/"
    },
    {
        "Title": "Output Messenger Zero-Day Exploited by Turkish Hackers for Iraq Spying",
        "Link": "https://www.securityweek.com/output-messenger-zero-day-exploited-by-turkish-hackers-for-iraq-spying/",
        "Summary": "<p>A Turkey-affiliated espionage group has exploited a zero-day vulnerability in Output Messenger since April 2024.</p>\n<p>The post <a href=\"https://www.securityweek.com/output-messenger-zero-day-exploited-by-turkish-hackers-for-iraq-spying/\">Output Messenger Zero-Day Exploited by Turkish Hackers for Iraq Spying </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/output-messenger-zero-day-exploited-by-turkish-hackers-for-iraq-spying/"
    },
    {
        "Title": "Suspected DoppelPaymer Ransomware Group Member Arrested",
        "Link": "https://www.securityweek.com/suspected-doppelpaymer-ransomware-group-member-arrested/",
        "Summary": "<p>A 45-year-old individual was arrested in Moldova for his suspected involvement in DoppelPaymer ransomware attacks.</p>\n<p>The post <a href=\"https://www.securityweek.com/suspected-doppelpaymer-ransomware-group-member-arrested/\">Suspected DoppelPaymer Ransomware Group Member Arrested</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/suspected-doppelpaymer-ransomware-group-member-arrested/"
    },
    {
        "Title": "Orca Snaps Up Opus in Cloud Security Automation Push",
        "Link": "https://www.securityweek.com/orca-snaps-up-opus-in-cloud-security-automation-push/",
        "Summary": "<p>Orca positioned the deal as an expansion of its capabilities into the realm of AI-based autonomous remediation and prevention. </p>\n<p>The post <a href=\"https://www.securityweek.com/orca-snaps-up-opus-in-cloud-security-automation-push/\">Orca Snaps Up Opus in Cloud Security Automation Push</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-13",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/orca-snaps-up-opus-in-cloud-security-automation-push/"
    },
    {
        "Title": "Alleged Breach of Everest Bank Customer Database",
        "Link": "https://dailydarkweb.net/alleged-breach-of-everest-bank-customer-database/",
        "Summary": "<p>&#160; Reports have surfaced alleging that a database containing the records of 637,835 customers of Everest Bank Limited (EBL) has been exposed. The information purportedly includes a wide range of personal details. According to information shared, the compromised data includes customer names, customer IDs, first names, dates of birth, PAN numbers, middle names, last names, [&#8230;]</p>\n<p>The post <a href=\"https://dailydarkweb.net/alleged-breach-of-everest-bank-customer-database/\">Alleged Breach of Everest Bank Customer Database</a> appeared first on <a href=\"https://dailydarkweb.net\">Daily Dark Web</a>.</p>",
        "Date": "2025-05-13",
        "Content": "Reports have surfaced alleging that a database containing the records of 637,835 customers of Everest Bank Limited (EBL) has been exposed. The information purportedly includes a wide range of personal details.\nAccording to information shared, the compromised data includes customer names, customer IDs, first names, dates of birth, PAN numbers, middle names, last names, age, sex, father’s names, spouse’s names, driving license numbers, passport numbers, UID numbers, voter IDs, category IDs, state descriptions, mobile numbers, phone numbers, email addresses, addresses, address types, cities, zip codes, districts, mailing addresses, and additional address lines.\nEverest Bank Limited, founded in 1994, states it serves over 1.4 million customers across various segments of society. The authenticity of the exposed data and the cause of the alleged breach are currently unclear.\nTags:\nBanking Security\ncustomer-data\nCyberSecurity\ndata exposure\ndata-breach\nEverest Bank\nIndia\nPersonal Information"
    },
    {
        "Title": "Turkish Cyber Espionage Campaign Leverages Zero-Day in Output Messenger",
        "Link": "https://dailydarkweb.net/turkish-cyber-espionage-campaign-leverages-zero-day-in-output-messenger/",
        "Summary": "<p>A Turkish-affiliated threat actor, identified as &#8220;Marbled Dust,&#8221; has been exploiting a zero-day vulnerability in the Output Messenger application to conduct cyber espionage. The attacks, which reportedly began in April 2024, have primarily targeted entities in Europe and the Middle East, with a specific focus on Kurdish military personnel in Iraq and organizations with interests [&#8230;]</p>\n<p>The post <a href=\"https://dailydarkweb.net/turkish-cyber-espionage-campaign-leverages-zero-day-in-output-messenger/\">Turkish Cyber Espionage Campaign Leverages Zero-Day in Output Messenger</a> appeared first on <a href=\"https://dailydarkweb.net\">Daily Dark Web</a>.</p>",
        "Date": "2025-05-13",
        "Content": "A Turkish-affiliated threat actor, identified as “Marbled Dust,” has been exploiting a zero-day vulnerability in the Output Messenger application to conduct cyber espionage. The attacks, which reportedly began in April 2024, have primarily targeted entities in Europe and the Middle East, with a specific focus on Kurdish military personnel in Iraq and organizations with interests conflicting with the Turkish government. This campaign highlights a significant escalation in the group’s technical capabilities and operational urgency.\nThe core of the espionage activity revolves around a directory traversal vulnerability, tracked as CVE-2025-27920, found in Output Messenger, an enterprise communication platform developed by Indian company Srimax. Marbled Dust utilized techniques such as DNS hijacking to gain initial access to the Output Messenger Server Manager application. Subsequently, they exploited the zero-day flaw to upload malicious files, including GoLang-based backdoors, to the server’s startup directory. This allowed the attackers to steal sensitive data, impersonate users, and potentially disrupt operations.\nIn response to the threat, Microsoft Threat Intelligence notified Srimax, the developer of Output Messenger. Srimax has since released a software update (version 2.0.63) to address CVE-2025-27920 and a second cross-site scripting (XSS) vulnerability (CVE-2025-27921), although there is no evidence the latter was exploited. Both Microsoft and Srimax urge all Output Messenger users to upgrade to the latest version immediately to protect against these attacks. Security experts recommend implementing robust security measures, including enabling cloud-delivered protection and utilizing comprehensive vulnerability management systems.\nTags:\nCVE-2025-27920\nCyber Espionage\nCyberSecurity\ndata-breach\nhacking\nKurdish\nMarbled Dust\nMicrosoft Threat Intelligence\nnational security\nOutput Messenger\nSoftware Vulnerability\nSrimax\nTurkish Hackers\nZero-Day Vulnerability"
    }
]