[
    {
        "Title": "Hackers Exploit Samsung MagicINFO, GeoVision IoT Flaws to Deploy Mirai Botnet",
        "Link": "https://thehackernews.com/2025/05/hackers-exploit-samsung-magicinfo.html",
        "Summary": "Threat actors have been observed actively exploiting security flaws in GeoVision end-of-life (EoL) Internet of Things (IoT) devices to corral them into a Mirai botnet for conducting distributed denial-of-service (DDoS) attacks.\nThe activity, first observed by the Akamai Security Intelligence and Response Team (SIRT) in early April 2025, involves the exploitation of two operating system command",
        "Date": "2025-05-06",
        "Content": "Threat actors have been observed actively exploiting security flaws in GeoVision end-of-life (EoL) Internet of Things (IoT) devices to corral them into a\nMirai\nbotnet for conducting distributed denial-of-service (DDoS) attacks.\nThe activity, first observed by the Akamai Security Intelligence and Response Team (SIRT) in early April 2025, involves the exploitation of two operating system command injection flaws (\nCVE-2024-6047\nand\nCVE-2024-11120\n, CVSS scores: 9.8) that could be used to execute arbitrary system commands.\n\"The exploit targets the /DateSetting.cgi endpoint in GeoVision IoT devices, and injects commands into the szSrvIpAddr parameter,\" Akamai researcher Kyle Lefton\nsaid\nin a report shared with The Hacker News.\nIn the attacks detected by the web security and infrastructure company, the botnet has been found injecting commands to download and execute an ARM version of the Mirai malware called\nLZRD\n.\nSome of the vulnerabilities exploited by the botnet include a Hadoop YARN vulnerability, CVE-2018-10561, and a bug impacting DigiEver that was\nhighlighted\nin December 2024.\nThere is some evidence to suggest that the campaign\noverlaps\nwith previously recorded activity under the name InfectedSlurs.\n\"One of the most effective ways for cybercriminals to start assembling a botnet is to target poorly secured and outdated firmware on older devices,\" Lefton said.\n\"There are many hardware manufacturers who do not issue patches for retired devices (in some cases, the manufacturer itself may be defunct).\"\nGiven that the affected GeoVision devices are unlikely to receive new patches, it's recommended that users upgrade to a newer model to safeguard against potential threats.\nSamsung MagicINFO Flaw Exploited in Mirai Attacks\nThe disclosure comes as\nArctic Wolf\nand the\nSANS Technology Institute\nwarned of active exploitation of\nCVE-2024-7399\n(CVSS score: 8.8), a path traversal flaw in Samsung MagicINFO 9 Server that could enable an attacker to write arbitrary files as system authority, to deliver the Mirai botnet.\nWhile the issue was\naddressed\nby Samsung in August 2024, it has since been weaponized by attackers following the\nrelease\nof a proof-of-concept (PoC) on April 30, 2025, to retrieve and execute a shell script responsible for downloading the botnet.\n\"The vulnerability allows for arbitrary file writing by unauthenticated users, and may ultimately lead to remote code execution when the vulnerability is used to write specially crafted JavaServer Pages (JSP) files,\" Arctic Wolf said.\nUsers are recommended to update their instances to version 21.1050 and later to mitigate potential operational impact.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "New Investment Scams Use Facebook Ads, RDGA Domains, and IP Checks to Filter Victims",
        "Link": "https://thehackernews.com/2025/05/new-investment-scams-use-facebook-ads.html",
        "Summary": "Cybersecurity researchers have lifted the lid on two threat actors that orchestrate investment scams through spoofed celebrity endorsements and conceal their activity through traffic distribution systems (TDSes).\nThe activity clusters have been codenamed Reckless Rabbit and Ruthless Rabbit by DNS threat intelligence firm Infoblox.\nThe attacks have been observed to lure victims with bogus",
        "Date": "2025-05-06",
        "Content": "Cybersecurity researchers have lifted the lid on two threat actors that orchestrate investment scams through spoofed celebrity endorsements and conceal their activity through traffic distribution systems (TDSes).\nThe activity clusters have been codenamed Reckless Rabbit and Ruthless Rabbit by DNS threat intelligence firm Infoblox.\nThe attacks have been observed to lure victims with bogus platforms, including cryptocurrency exchanges, which are then advertised on social media platforms. An important aspect of these scams is the use of web forms to collect user data.\n\"Reckless Rabbit creates ads on Facebook that lead to fake news articles featuring a celebrity endorsement for the investment platform,\" security researchers Darby Wise, Piotr Glaska, and Laura da Rocha\nsaid\n. \"The article includes a link to the scam platform which contains an embedded web form persuading the user to enter their personal information to 'register' for the investment opportunity.\"\nSome of these forms, besides requesting users' names, phone numbers, and email addresses, offer the ability to auto-generate a password, a key piece of information that's used to progress to the next phase of the attack -- validation checks.\nThe threat actors perform HTTP GET requests to legitimate IP validation tools, such as ipinfo[.]io, ipgeolocation[.]io, or ipapi[.]co, in order to filter out traffic from countries that they are not interested in. Checks are also carried out to ensure that the provided numbers and email addresses are authentic.\nShould the user be deemed worthy of exploitation, they are subsequently routed through a TDS that either takes them directly to the scam platform where they are coaxed into parting with their funds by promising high returns, or to a different page that instructs them to wait for a call from their representative.\n\"Some campaigns use call centers to provide the victims with instructions on how to set up an account and transfer money into the fake investment platform,\" the researchers explained. \"For users who do not pass the validation step, many campaigns will simply display a 'thank you' landing page.\"\nAn important aspect of the activity is the use of a registered domain generation algorithm (\nRDGA\n) to set up domain names for the sketchy investment platforms, a technique also adopted by other threat actors like Prolific Puma, Revolver Rabbit, and VexTrio Viper.\nUnlike traditional domain generation algorithms (DGAs), RDGAs make use of a secret algorithm to register all the domain names. Reckless Rabbit is said to have been creating domains as far back as April 2024, primarily targeting users in Russia, Romania, and Poland, while excluding traffic from Afghanistan, Somalia, Liberia, Madagascar, and others.\nThe Facebook ads used to direct users to the fake news articles are interspersed with advertising content related to items listed for sale on marketplaces like Amazon in a bid to evade detection and enforcement action.\nWhat's more, the ads contain unrelated images and display a decoy domain (e.g., \"amazon[.]pl\") that's different from the actual domain the user will be redirected to once they click on the link (e.g., \"tyxarai[.]org\").\nRuthless Rabbit, on the other hand, is believed to have been actively running investment scam campaigns since at least November 2022 that are aimed at Eastern European users. What sets this threat actor apart is that they run their own cloaking service (\"mcraftdb[.]tech\") to perform validation checks.\nUsers who get past the verification checks are subsequently routed to an investment platform where they are urged to enter their financial information to complete the registration process.\n\"A TDS enables threat actors to strengthen their infrastructure, making it more resilient by providing the ability to hide malicious content from security researchers and bots,\" Infoblox said.\nThis is not the first time such fraudulent investment scam campaigns have been discovered in the wild. In December 2024, ESET\nexposed\na similar scheme dubbed Nomani that uses a combination of social media malvertising, company-branded posts, and artificial intelligence (AI) powered video testimonials featuring famous personalities.\nThen last month, Spanish authorities\nrevealed\nthey have arrested six individuals aged between 34 and 57 for allegedly running a large-scale cryptocurrency investment scam that used AI tools to generate deepfake ads featuring popular public figures to deceive people.\nRenee Burton, vice president of threat intelligence at Infoblox, told The Hacker News that they \"would have to take a closer look to see if there is any evidence\" to ascertain if there are any connections between these activities and those conducted by Reckless Rabbit and Ruthless Rabbit.\n\"Threat actors like Reckless and Ruthless Rabbits will be relentless in their attempts to trick as many users as possible,\" the researchers said. \"Because these types of scams have proven to be highly profitable for them, they will continue to grow rapidly—both in number and sophistication.\"\nMystery Box Scams Proliferate via Facebook Ads\nThe development comes as Bitdefender is warning of a spike in sophisticated subscription scams that make use of a network of more than 200 convincing fake websites to trick users into paying monthly subscriptions and sharing their credit card data.\n\"Criminals create Facebook pages and take out full ads to promote the already classic 'mystery box' scam and other variants,\" the Romanian company\nsaid\n. \"The 'mystery box' scam has evolved and now includes almost hidden recurring payments, alongside links to websites to various shops. Facebook is used as the main platform for these new and enhanced mystery box scams.\"\nThe rogue sponsored ads advertise clearance sales from brands like Zara or offer a chance to buy a \"mystery box\" containing Apple products and seek to entice users by claiming that they can grab one of them by paying a minimal sum of money, sometimes as low as $2.\nThe cybercriminals deploy various tricks to sidestep detection efforts, including creating multiple versions of the ad, only one of which is malicious, while the others display random product images.\nThese scams, like the ones perpetrated by Reckless Rabbit and Ruthless Rabbit, incorporate a survey component to ensure that the victims are real people and not bots. Additionally, the payment pages rope unsuspecting users into a subscription program that earns the threat actors recurring revenues under the pretext of giving them a discount.\n\"Criminals have been pumping funds in ads promoting impersonated content creators, using the same subscription model that seems to be now the driving revenue stream of these scams,\" Bitdefender researchers Răzvan Gosa and Silviu Stahie said.\n\"Scammers often change the impersonated brands, and they've begun expanding past the existing mystery boxes. They are now trying to sell low-quality products or imitation articles, fake investments, supplements, and much more.\"\nU.S. Treasury Sanctions Junta-Linked Militia in Myanmar Over Scam Compounds\nThe findings also follow a wave of sanctions imposed by the U.S. Department of the Treasury against the Myanmar-linked Karen National Army (KNA) for assisting organized crime syndicates operate\nmulti-billion-dollar scam compounds\n, as well as facilitating human trafficking and cross-border smuggling.\nThe actions also\ntarget\nthe group's leader Saw Chit Thu, and his two sons, Saw Htoo Eh Moo and Saw Chit Chit. Saw Chit Thu was sanctioned by the United Kingdom in 2023 and the European Union in 2024 for becoming a key enabler of scam operations in the region.\n\"Cyber scam operations, such as those run by the KNA, generate billions in revenue for criminal kingpins and their associates, while depriving victims of their hard-earned savings and sense of security,\"\nsaid\nDeputy Secretary Michael Faulkender.\nIn these so-called romance baiting scams, fraudsters -- who are themselves trafficked to the scam sites by luring them with high-paying jobs -- are coerced into targeting strangers online, building rapport with them over time, and then induce them to invest in bogus cryptocurrency and trading platforms controlled by the criminal actors.\n\"The KNA profits from cyber scam schemes on an industrial scale by leasing land it controls to other organized crime groups, and providing support for human trafficking, smuggling, and the sale of utilities used to provide energy to scam operations,\" the Treasury Department said. \"The KNA also provides security at scam compounds in Karen State.\"\nThe United Nations Office on Drugs and Crime (UNODC) last month\ndivulged\nthe scam centers are still expanding despite recent crackdowns, generating annual profits to the tune of about $40 billion.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Third Parties and Machine Credentials: The Silent Drivers Behind 2025's Worst Breaches",
        "Link": "https://thehackernews.com/2025/05/third-parties-and-machine-credentials.html",
        "Summary": "It wasn't ransomware headlines or zero-day exploits that stood out most in this year's Verizon 2025 Data Breach Investigations Report (DBIR) — it was what fueled them. Quietly, yet consistently, two underlying factors played a role in some of the worst breaches: third-party exposure and machine credential abuse.\nAccording to the 2025 DBIR, third-party involvement in breaches doubled",
        "Date": "2025-05-06",
        "Content": "It wasn't ransomware headlines or zero-day exploits that stood out most in this year's Verizon 2025 Data Breach Investigations Report (DBIR) — it was what fueled them. Quietly, yet consistently, two underlying factors played a role in some of the worst breaches:\nthird-party exposure\nand\nmachine credential abuse\n.\nAccording to the 2025 DBIR, third-party involvement in breaches\ndoubled\nyear-over-year, jumping from\n15% to 30%\n. In parallel, attackers increasingly exploited machine credentials and ungoverned machine accounts to gain access, escalate privileges, and exfiltrate sensitive data.\nThe message is clear: it's no longer enough to protect your employee users alone. To truly defend against modern threats, organizations must govern\nall identities\n— human, non-employee, and machine — within a unified security strategy.\nThird-Party Risk: Expanding Faster Than Organizations Can Control\nToday's enterprise is a patchwork of partnerships: contractors, vendors, business partners, managed service providers, affiliates, and more. While these relationships drive efficiency, they also create sprawling identity ecosystems. Without strong governance third-party identities become blind spots ripe for exploitation.\nBreaches tied to third-party access often stem from\npoor lifecycle management\n— for example, a contractor account left active after a project ends, or a business partner login with excessive privileges. The 2025 DBIR notes that this trend is accelerating, and it isn't confined to any one industry: healthcare, finance, manufacturing, and the public sector all reported major incidents stemming from third-party exposure.\nOrganizations must extend identity governance to non-employees with the same rigor applied to internal staff, ensuring visibility, accountability, and timely deactivation across the full range of third-party users.\nMachine Identities: The Hidden Gatekeepers to Critical Systems\nWhile human identities remain vulnerable, machine identities are an even faster-growing risk. Service accounts, bots, RPAs, AI agents, APIs — the digital workforce — are exploding in number, often without clear ownership or oversight. As AI agents multiply, they will push machine identity growth—and complexity—even beyond what organizations are managing today.\nThis year's 2025 DBIR found that credential-based attacks remain a top initial access method, and attackers are increasingly targeting ungoverned machine accounts for entry. Unprotected machine accounts were tied to major breaches and escalating ransomware attacks.\nThe stakes are growing; yet most traditional identity security tools still treat machines like second-class citizens. That's why it's essential to move beyond ad hoc machine management to a model built for scale and automation. For a deeper dive into the problem,\ncheck out the\nwhitepaper\n\"Who's Watching the Machines?\"\n.\nA Unified Approach is No Longer Optional\nFragmented identity governance isn't a weakness anymore. It's a liability. Managing employees in one silo, third-party users in another, and machines — if at all — in a third leaves cracks wide enough for attackers to walk through. They don't need to breach everything. They just need one opening.\nBreaches tied to third-party users and machine accounts are accelerating faster than those tied to internal employees — a clear warning sign that inconsistent governance is fueling new vulnerabilities. The reality is:\nidentity is identity\n. Human, non-employee, or machine, every identity must be properly managed, governed, and secured under a unified strategy.\nThe organizations that survive tomorrow's threats aren't the ones who try to harmonize solutions — they're the ones who recognize that governing every identity together is the only way forward. Consolidating identity security across employees, contractors, partners, service accounts, bots, and AI agents closes critical gaps, boosts visibility, and hardens defenses when it matters most.\nSailPoint helps organizations secure the full spectrum of identities\nwith solutions designed for today's complex enterprise environments — at enterprise scale. Whether you're managing machine identities or securing non-employee access, SailPoint delivers a unified identity security experience—powered by the SailPoint Atlas platform—that turns identity chaos into clarity.\nTo dig deeper into why machine identities, require a new approach — and why traditional human-centric models are no longer enough —\nexplore our\nthree-part article series\ncovering what a machine identity is (and why the definition matters), how machine identities evolved alongside human identities, and why traditional governance methods are failing in a machine-driven world.\nThe gap between human and machine identity security is widening. It's time to close it — before attackers do it for you.\nSource:\nVerizon 2025 Data Breach Investigations Report (DBIR)\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft Warns Default Helm Charts Could Leave Kubernetes Apps Exposed to Data Leaks",
        "Link": "https://thehackernews.com/2025/05/microsoft-warns-default-helm-charts-for.html",
        "Summary": "Microsoft has warned that using pre-made templates, such as out-of-the-box Helm charts, during Kubernetes deployments could open the door to misconfigurations and leak valuable data.\n\"While these 'plug-and-play' options greatly simplify the setup process, they often prioritize ease of use over security,\" Michael Katchinskiy and Yossi Weizman from the Microsoft Defender for Cloud Research team",
        "Date": "2025-05-06",
        "Content": "Microsoft has warned that using pre-made templates, such as out-of-the-box Helm charts, during\nKubernetes\ndeployments could open the door to misconfigurations and leak valuable data.\n\"While these 'plug-and-play' options greatly simplify the setup process, they often prioritize ease of use over security,\" Michael Katchinskiy and Yossi Weizman from the Microsoft Defender for Cloud Research team\nsaid\n.\n\"As a result, a large number of applications end up being deployed in a misconfigured state by default, exposing sensitive data, cloud resources, or even the entire environment to attackers.\"\nHelm is a package manager for Kubernetes that allows developers to package, configure, and deploy applications and services onto Kubernetes clusters. It's part of the Cloud Native Computing Foundation (CNCF).\nKubernetes application packages are structured in the Helm packaging format called\ncharts\n, which are YAML manifests and templates used to describe the Kubernetes resources and configurations necessary to deploy the app.\nMicrosoft pointed out that open-source projects often include default manifests or pre-defined Helm charts that prioritize ease of use over security, particularly leading to two major concerns -\nExposing services externally without proper network restrictions\nLack of adequate built-in authentication or authorization by default\nAs a result, organizations using these projects without reviewing YAML manifests and Helm charts can end up inadvertently exposing their applications to attackers. This can have serious consequences when the deployed application facilitates querying sensitive APIs or permitting administrative actions.\nSome of the identified projects that could put Kubernetes environments at risk of attacks are as follows -\nApache Pinot, which\nexposes\nthe OLAP datastore's main components, pinot-controller and pinot-broker, to the internet via Kubernetes LoadBalancer services without any authentication by default\nMeshery, which\nexposes\nthe app's interface via an external IP address, thereby allowing anyone with access to the IP address to sign up with a new user, gain access to the interface, and deploy new pods, ultimately resulting in arbitrary code execution\nSelenium Grid, which\nexposes\na NodePort service on a specific port across all nodes in a Kubernetes cluster, making external firewall rules the only line of defense\nTo mitigate the risks associated with such misconfigurations, it's advised to review and modify them according to security best practices, periodically scan publicly facing interfaces, and monitor running containers for malicious and suspicious activities.\n\"Many in-the-wild exploitations of containerized applications originate in misconfigured workloads, often when using default settings,\" the researchers said. \"Relying on 'default by convenience' setups pose a significant security risk.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Entra ID Data Protection: Essential or Overkill?",
        "Link": "https://thehackernews.com/2025/05/entra-id-data-protectionessential-or.html",
        "Summary": "Microsoft Entra ID (formerly Azure Active Directory) is the backbone of modern identity management, enabling secure access to the applications, data, and services your business relies on. As hybrid work and cloud adoption accelerate, Entra ID plays an even more central role — managing authentication, enforcing policy, and connecting users across distributed environments.\nThat prominence also",
        "Date": "2025-05-06",
        "Content": "Microsoft Entra ID (formerly Azure Active Directory) is the backbone of modern identity management, enabling secure access to the applications, data, and services your business relies on. As hybrid work and cloud adoption accelerate, Entra ID plays an even more central role — managing authentication, enforcing policy, and connecting users across distributed environments.\nThat prominence also makes it a prime target. Microsoft reports over 600 million attacks on Entra ID every day. These aren't just random attempts, but include coordinated, persistent, and increasingly automated campaigns designed to exploit even small vulnerabilities.\nWhich brings us to the core question:\nAre Entra ID's native protections enough?\nWhere do they fall short — and what steps should you take to close the gaps and ensure you're covered?\nUnderstanding Entra ID\nAt its core, Microsoft Entra ID is your enterprise identity and access management system. It defines how users prove who they are, what resources they can access, and under what conditions. With capabilities like single sign-on (SSO), multifactor authentication (MFA), conditional access policies, and seamless integration with on-premises Active Directory, it's designed to deliver secure, frictionless access across your digital environment.\nBut more than just a login system, Entra ID exists today as a critical control plane for modern IT. It enforces security policies, manages user roles and entitlements, and governs access across cloud and on-premises applications. That means every authentication request, every access decision, and every privilege escalation flows through it.\nAs cloud adoption accelerates and hybrid work becomes the norm, Entra ID's role becomes even more foundational. It's the connective tissue linking users to Microsoft 365, Azure services, third-party SaaS tools, and internal applications.\nThe Threat Landscape\nThe volume and sophistication of attacks on identity systems have reached unprecedented levels. As mentioned, Microsoft reports over 600 million attacks on Entra ID every single day.\nPhishing continues to lead the charge, targeting human behavior to trick users into giving up credentials. Credential stuffing leverages massive databases of previously breached usernames and passwords to gain unauthorized access at scale. Ransomware, meanwhile, is no longer limited to encrypting files. When identity is compromised, attackers can lock out users, escalate privileges, disable safeguards, and hold entire systems hostage — all without touching a single piece of data.\nReal-world breaches underscore just how disruptive these attacks can be. Organizations face downtime, failed audits, regulatory penalties, and lasting reputational harm. And while security tools grow more advanced, threat actors adapt just as fast — exploiting gaps in configuration, user behavior, or zero-day vulnerabilities.\nWhen Entra ID is unavailable, whether due to misconfiguration, outage, or attack, the consequences are immediate: broken access, lost productivity, security gaps, and stalled operations. The take-away is this: Entra ID is a business-critical infrastructure system you depend on more than you might realize (until it stops working).\nThe Case for Backup\nThe case for backing up Microsoft Entra ID is clear.\nIn a landscape of constant cyber threats and operational complexity, relying solely on native protections leaves too much to chance. Here's why a dedicated backup strategy matters:\nSecurity Threats Are Inevitable:\nEven the most advanced security tools can be bypassed. When attacks succeed — whether through ransomware, credential theft, or privilege escalation — a robust backup becomes your safety net, enabling fast, confident recovery.\nHuman Error Happens:\nMisconfigurations, accidental deletions, or improper access changes can disrupt critical identity systems in an instant. Effective backups empower organizations to quickly revert to a previous stable configuration, minimizing downtime and restoring continuity without scrambling for manual fixes.\nCompliance Is Non-Optional:\nRegulations like GDPR, HIPAA, and others require strict control over identity data. Backups help meet these standards by preserving a tamper-proof history of configurations and user access data, ensuring accountability and audit-readiness.\nBusiness Never Stops:\nToday's organizations depend on always-on access. A disruption in identity services can bring operations to a standstill. Effective backup and recovery ensure you stay resilient — maintaining access, continuity, and trust even in the face of major incidents.\nMicrosoft's own\nshared responsibility model\ndraws a clear line: while they secure the infrastructure, the responsibility for protecting and backing up your data — including Entra ID — rests with you. If identity is the front door to your business, backups are the lock you control.\nIs it Overkill?\nIt's a fair question. Microsoft Entra ID comes with built-in protections like conditional access policies, multifactor authentication, intelligent threat detection, and a Recycle Bin for deleted objects. For smaller organizations with straightforward identity needs and minimal regulatory pressure, those capabilities might feel like they're \"good enough.\"\nBut here's the reality: native recovery tools have real limitations. The Recycle Bin retains deleted objects for only a limited time. There's no versioning for configuration changes, and once you go beyond simple object recovery — restoring conditional access policies, application assignments, or role-based permissions — the gaps become clear.\nWhen a misconfiguration snowballs, or when a ransomware attack disables access, or when a disgruntled admin tampers with identity settings, built-in protections often fall short of a full recovery. That's where backups come in.\nBackups acknowledge that even the best defenses can fail. So, when identity is the backbone of business operations, fast, reliable recovery isn't overkill. It's risk management (and peace of mind) in a world where downtime isn't an option.\nBuild a Strategy that Fits You\nStriking the right balance between robust protection and efficient resource use starts with a clear understanding of your risk profile. Some organizations handle massive volumes of sensitive data. Others operate under tight compliance rules. Some run lean IT teams that can't afford prolonged downtime. Whatever your setup, one thing's constant: you need a backup approach that matches your risk, not just your budget.\nStart with a focused risk assessment. How sensitive is your identity data? What systems depend on it? What are your regulatory obligations? From there, shape a strategy that aligns with your business priorities — one that balances scope, frequency, and cost with what's truly at stake. (And don't treat Entra ID in isolation. It's tightly connected to Microsoft 365 and countless daily workflows. Backing them up together ensures faster recovery, fewer surprises, and a more consistent security posture.)\nUltimately, backup isn't about doing everything, but just doing the\nright\nthings. That means aligning frequency, scope, and tooling to your business needs, you protect what matters most without overspending on what doesn't. That's how you build smart resilience: tailored, intentional, and ready for whatever comes next.\nThe Bottom Line\nBacking up Microsoft Entra ID is preparation, not paranoia. When identity drives every login, access request, and workflow, the ability to recover is just as critical as the ability to defend. Native protections offer a solid foundation, but they have limits. With a proactive, risk-aware backup strategy, organizations don't just withstand threats, but recover quickly, adapt confidently, and keep moving forward.\nVeeam Data Cloud\nfor Microsoft Entra ID\nis more than backup. Gain simplified management, rapid recovery, and purpose-built data protection that accounts for the native limitations, so you don't have to.\nCover your SaaS.\nLearn more about Veeam Data Cloud\n.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Update ASAP: Google Fixes Android Flaw (CVE-2025-27363) Exploited by Attackers",
        "Link": "https://thehackernews.com/2025/05/google-fixes-actively-exploited-android.html",
        "Summary": "Google has released its monthly security updates for Android with fixes for 46 security flaws, including one vulnerability that it said has been exploited in the wild.\nThe vulnerability in question is CVE-2025-27363 (CVSS score: 8.1), a high-severity flaw in the System component that could lead to local code execution without requiring any additional execution privileges.\n\"The most severe of",
        "Date": "2025-05-06",
        "Content": "Google has\nreleased\nits monthly security updates for Android with fixes for 46 security flaws, including one vulnerability that it said has been exploited in the wild.\nThe vulnerability in question is CVE-2025-27363 (CVSS score: 8.1), a high-severity flaw in the System component that could lead to local code execution without requiring any additional execution privileges.\n\"The most severe of these issues is a high security vulnerability in the System component that could lead to local code execution with no additional execution privileges needed,\" Google said in a Monday advisory. \"User interaction is not needed for exploitation.\"\nIt's worth noting that CVE-2025-27363 is\nrooted\nin the FreeType open-source font rendering library. It was first disclosed by Facebook in March 2025 as having been exploited in the wild.\nThe shortcoming has been described as an out-of-bounds write flaw that could result in code execution when parsing TrueType GX and variable font files. The issue has been remediated in FreeType versions higher than 2.13.0.\n\"There are indications that CVE-2025-27363 may be under limited, targeted exploitation,\" Google acknowledged in its security bulletin. The exact specifics of the attacks are presently unknown.\nGoogle's May update also resolves eight other flaws in the Android System and 15 flaws in the Framework module that could be abused to facilitate privilege escalation, information disclosure, and denial-of-service.\n\"Exploitation for many issues on Android is made more difficult by enhancements in newer versions of the Android platform,\" the company said. \"We encourage all users to update to the latest version of Android where possible.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Critical Langflow Flaw Added to CISA KEV List Amid Ongoing Exploitation Evidence",
        "Link": "https://thehackernews.com/2025/05/critical-langflow-flaw-added-to-cisa.html",
        "Summary": "A recently disclosed critical security flaw impacting the open-source Langflow platform has been added to the Known Exploited Vulnerabilities (KEV) catalog by the U.S. Cybersecurity and Infrastructure Security Agency (CISA), citing evidence of active exploitation.\nThe vulnerability, tracked as CVE-2025-3248, carries a CVSS score of 9.8 out of a maximum of 10.0.\n\"Langflow contains a missing",
        "Date": "2025-05-06",
        "Content": "A\nrecently disclosed\ncritical security flaw impacting the open-source Langflow platform has been\nadded\nto the Known Exploited Vulnerabilities (\nKEV\n) catalog by the U.S. Cybersecurity and Infrastructure Security Agency (CISA), citing evidence of active exploitation.\nThe vulnerability, tracked as\nCVE-2025-3248\n, carries a CVSS score of 9.8 out of a maximum of 10.0.\n\"Langflow contains a missing authentication vulnerability in the /api/v1/validate/code endpoint that allows a remote, unauthenticated attacker to execute arbitrary code via crafted HTTP requests,\" CISA said.\nSpecifically, the endpoint has been found to improperly invoke Python's built-in exec() function on user-supplied code without adequate authentication or sandboxing, thereby allowing attackers to execute arbitrary commands on the server.\nThe shortcoming, which affects most versions of the popular tool, has been addressed in\nversion 1.3.0\nreleased on March 31, 2025. Horizon3.ai has been credited with discovering and reporting the flaw in February.\nAccording to the company, the vulnerability is \"\neasily exploitable\n\" and allows unauthenticated remote attackers to take control of Langflow servers. A proof-of-concept (PoC) exploit has since been made\npublicly available\nas of April 9, 2025, by other researchers.\nData from attack surface management platform Censys\nshows\nthat there are 466 internet-exposed Langflow instances, with a majority of them concentrated in the United States, Germany, Singapore, India, and China.\nIt's currently not known how the vulnerability is being abused in real-world attacks, by whom, and for what purpose, although the SANS Technology Institute\nsaid\nit recorded exploit attempts targeting the flaw against its honeypots. Federal Civilian Executive Branch (FCEB) agencies have time until May 26, 2025, to apply the fixes.\n\"CVE-2025-3248 highlights the risks of executing dynamic code without secure authentication and sandboxing measures,\" Zscaler\nnoted\nlast month. \"This vulnerability serves as a critical reminder for organizations to approach code-validation features with caution, particularly in applications exposed to the internet.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Apache Parquet exploit tool detect servers vulnerable to critical flaw",
        "Link": "https://www.bleepingcomputer.com/news/security/apache-parquet-exploit-tool-detect-servers-vulnerable-to-critical-flaw/",
        "Summary": "A proof-of-concept exploit tool has been publicly released for a maximum severity Apache Parquet vulnerability, tracked as CVE-2025-30065, making it easy to find vulnerable servers. [...]",
        "Date": "2025-05-06",
        "Content": "A proof-of-concept exploit tool has been publicly released for a maximum severity Apache Parquet vulnerability, tracked as CVE-2025-30065, making it easy to find vulnerable servers.\nThe tool was released by F5 Labs researchers who investigated the vulnerability after finding that multiple existing PoCs were either weak or completely non-functional.\nThe tool serves as proof of CVE-2025-30065's practical exploitability and can also help administrators evaluate their environments and secure servers.\nApache Parquet is an open-source, columnar storage format designed for efficient data processing, widely used by big data platforms and organizations engaged in data engineering and analytics.\nThe flaw was first disclosed on April 1, 2025, following an earlier discovery by Amazon researcher Keyi Li. It was categorized as a remote code execution impacting all versions of Apache Parquet up to and including 1.15.0.\nFrom a technical perspective, CVE-2025-30065 is a deserialization flaw in the parquet-avro module of Apache Parquet Java, where the library fails to restrict which Java classes can be instantiated when reading Avro data embedded in Parquet files.\nOn April 2, 2025,\nEndor Labs\npublished a write-up warning about the risk of exploitation and its potential impact on systems that import Parquet files from external points.\nSubsequent analysis by F5 Labs shows that the flaw is not a full deserialization RCE but can still be misused if a class has side effects during instantiation, like when making a network request from the vulnerable system to an attacker-controlled server.\nHowever, the researchers concluded that practical exploitation is difficult, and CVE-2025-30065 has limited value to attackers.\n\"While Parquet and Avro are used widely, this issue requires a specific set of circumstances that isn't all that likely in general,\"\nreads the F5 Labs report\n.\n\"Even then, this CVE only allows attackers to trigger the instantiation of a Java object which then must have a side effect that is useful for the attacker.\"\nDespite the low likelihood of exploitation, the researchers admit that some organizations process Parquet files from external, often unverified sources, and hence the risk is significant in some environments.\nFor this reason, F5 Labs created a \"canary exploit\" tool (\navailable on GitHub\n) that triggers an HTTP GET request via instantiation of javax.swing.JEditorKit, allowing users to verify exposure.\nBesides using the tool, it is recommended to upgrade to Apache Parquet version 15.1.1 or later, and configure 'org.apache.parquet.avro.SERIALIZABLE_PACKAGES' to restrict which packages are allowed for deserialization.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMax severity RCE flaw discovered in widely used Apache Parquet\nSamsung MagicINFO 9 Server RCE flaw now exploited in attacks\nCritical Langflow RCE flaw exploited to hack AI app servers\nCritical RCE flaw in Apache Tomcat actively exploited in attacks\nCritical Ivanti RCE flaw with public exploit now used in attacks"
    },
    {
        "Title": "Samsung MagicINFO 9 Server RCE flaw now exploited in attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/samsung-magicinfo-9-server-rce-flaw-now-exploited-in-attacks/",
        "Summary": "Hackers are exploiting an unauthenticated remote code execution (RCE) vulnerability in the Samsung MagicINFO 9 Server to hijack devices and deploy malware. [...]",
        "Date": "2025-05-06",
        "Content": "Hackers are exploiting an unauthenticated remote code execution (RCE) vulnerability in the Samsung MagicINFO 9 Server to hijack devices and deploy malware.\nSamsung MagicINFO Server is a centralized content management system (CMS) used to remotely manage and control digital signage displays made by Samsung. It is used by retail stores, airports, hospitals, corporate buildings, and restaurants, where there's a need to schedule, distribute, display, and monitor multimedia content.\nThe server component features a file upload functionality intended for updating display content, but hackers are abusing it to upload malicious code.\nThe flaw, tracked under\nCVE-2024-7399\n, was first publicly\ndisclosed in August 2024\nwhen it was fixed as part of the release of version 21.1050.\nThe vendor described the vulnerability as an \"Improper limitation of a pathname to a restricted directory vulnerability in Samsung MagicINFO 9 Server [that] allows attackers to write arbitrary file as system authority.\"\nOn April 30, 2025, security researchers at SSD-Disclosure published a\ndetailed write-up\nalong with a proof-of-concept (PoC) exploit that achieves RCE on the server without any authentication using a JSP web shell.\nThe attacker uploads a malicious .jsp file via an unauthenticated POST request, exploiting path traversal to place it in a web-accessible location.\nBy visiting the uploaded file with a cmd parameter, they can execute arbitrary OS commands and see the output in the browser.\nArctic Wolf now reports that the CVE-2024-7399 flaw is actively exploited in attacks a few days after the PoC's release, indicating that threat actors adopted the disclosed attack method in real operations.\n\"Given the low barrier to exploitation and the availability of a public PoC, threat actors are likely to continue targeting this vulnerability,\"\nwarned Arctic Wolf\n.\nAnother active exploitation confirmation comes from threat analyst\nJohannes Ullrich\n, who reported seeing a Mirai botnet malware variant leveraging CVE-2024-7399 to take over devices.\nGiven the active exploitation status of the flaw, it is recommended that system administrators take immediate action to patch CVE-2024-7399 by upgrading the Samsung MagicINFO Server to version 21.1050 or later.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nCritical Langflow RCE flaw exploited to hack AI app servers\nNew Mirai botnet behind surge in TVT DVR exploitation\nSAP fixes suspected NetWeaver zero-day exploited in attacks\nActive! Mail RCE flaw exploited in attacks on Japanese orgs\nCritical RCE flaw in Apache Tomcat actively exploited in attacks"
    },
    {
        "Title": "UK Legal Aid Agency investigates cybersecurity incident",
        "Link": "https://www.bleepingcomputer.com/news/security/uk-legal-aid-agency-investigates-cybersecurity-incident/",
        "Summary": "The Legal Aid Agency (LAA), an executive agency of the UK's Ministry of Justice that oversees billions in legal funding, warned law firms of a security incident and said the attackers might have accessed financial information. [...]",
        "Date": "2025-05-06",
        "Content": "The Legal Aid Agency (LAA), an executive agency of the UK's Ministry of Justice that oversees billions in legal funding, warned law firms of a security incident and said the attackers might have accessed financial information.\nApproximately 2,000 providers, including barristers, solicitor firms, and non-profit organizations, deliver civil and criminal legal aid services in England and Wales under contracts with the LAA. The agency employs around 1,250 staff and runs the country's Public Defender Service.\nIn a letter sent to law firms, the agency said it cannot confirm if any data was accessed. Still, it acknowledged the risk that legal aid providers' payment information might have been compromised, as\nSky News first reported\n.\n\"This incident is being investigated in accordance with our data security processes, and action has been taken to mitigate the incident,\" the agency's letter reads. \"The LAA takes the security of the information we hold seriously, and we understand the potential impact any breach can have on you.\"\nThe UK National Crime Agency has told BleepingComputer that it's working closely with the MoJ and the UK's National Cyber Security Centre to probe the incident and support LAA's ongoing investigation.\n\"We are aware of a cyber incident affecting the Legal Aid Agency. NCA officers are working alongside partners in the National Cyber Security Centre and MoJ to better understand the incident and support the department,\" NCA said.\nCyberattacks targeting UK retailers\nThis incident follows high-profile cyberattacks targeting the Co-op, Harrods, and Marks & Spencer (M&S) UK retail chains. The DragonForce ransomware operation ​​​​​\nclaimed all three attacks\n, and BleepingComputer has learned that the threat actors who orchestrated them used the same social engineering attack to breach Co-op and M&S.\nLast week, M&S was hit by a\nDragonForce ransomware attack\nusing Scattered Spider tactics. This attack\ndisrupted online orders\n, contactless payments, and the company's Click & Collect service.\nCo-op also restricted VPN access as a precaution following\nanother cyber incident\nthat hit its systems and\nconfirmed on Friday\nthat attackers stole data belonging to a \"significant number of our current and past members.\"\nOn Friday, May 1st,\nHarrods confirmed\nthat it restricted internet access to sites after threat actors also tried to breach its network, suggesting an active response to a cyberattack, although a breach has yet to be confirmed.\nSince then, the country's National Cyber Security Centre (NCSC) has\npublished guidance\nand advised all UK organizations to follow it to strengthen their cybersecurity defenses. The agency also\ncautioned\nthat these cyberattacks should be seen as a \"wake-up call\" for all UK businesses, as any of them may become the next target in the hackers' crosshairs.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nUK NCSC: Cyberattacks impacting UK retailers are a wake-up call\nHarrods the next UK retailer targeted in a cyberattack\nUK retailer Co-op shuts down some IT systems after hack attempt\nMarks & Spencer pauses online orders after cyberattack\nMarks & Spencer confirms a cyberattack as customers face delayed orders"
    },
    {
        "Title": "Critical Langflow RCE flaw exploited to hack AI app servers",
        "Link": "https://www.bleepingcomputer.com/news/security/critical-langflow-rce-flaw-exploited-to-hack-ai-app-servers/",
        "Summary": "The U.S. Cybersecurity & Infrastructure Security Agency (CISA) has tagged a Langflow remote code execution vulnerability as actively exploited, urging organizations to apply security updates and mitigations as soon as possible. [...]",
        "Date": "2025-05-06",
        "Content": "The U.S. Cybersecurity & Infrastructure Security Agency (CISA) has tagged a Langflow remote code execution vulnerability as actively exploited, urging organizations to apply security updates and mitigations as soon as possible.\nThe vulnerability is tracked as CVE-2025-3248 and is a critical unauthenticated RCE flaw that allows any attacker on the internet to take full control of vulnerable Langflow servers by exploiting an API endpoint flaw.\nLangflow is an open-source visual programming tool for building LLM-powered workflows using LangChain components. It provides a drag-and-drop interface to create, test, and deploy AI agents or pipelines without writing full backend code.\nThe tool, which has nearly 60k stars and 6.3k forks on GitHub, is used by AI developers, researchers, and startups, for prototyping chatbots, data pipelines, agent systems, and AI applications.\nLangflow exposes an endpoint (/api/v1/validate/code) designed to validate user-submitted code. In vulnerable versions, this endpoint does not safely sandbox or sanitize the input, allowing an attacker to send malicious code to that endpoint and have it executed directly on the server.\nCVE-2025-3248 was fixed in\nversion 1.3.0\n, released on April 1, 2025, so it's recommended to upgrade to that version or later to mitigate the risks that arise from the flaw.\nThe patch was\nminimal\n, just adding authentication for the vulnerable endpoint, involving no sandboxing or hardening.\nThe latest Langflow version,\n1.4.0\n, was released earlier today and contains a long list of fixes, so users should upgrade to this release.\nHorizon3 researchers published an\nin-depth technical blog\nabout the flaw on April 9, 2025, including a proof-of-concept exploit.\nThe researchers warned about the high likelihood of exploitation for CVE-2025-3248, identifying at least 500 internet-exposed instances at the time.\nHorizon3's PoC exploit in action\nSource: Horizon3\nThose who cannot upgrade to a safe version immediately are recommended to restrict network access to Langflow by putting it behind a firewall, authenticated reverse proxy, or VPN. Also, direct internet exposure is discouraged.\nCISA has\ngiven federal agencies\nuntil May 26, 2025, to apply the security update or mitigations or stop using the software.\nCISA has not provided any specific details about the observed exploitation activity and has stated that it is currently unknown whether ransomware groups are exploiting the vulnerability.\nFor users of Langflow, it's important to bear in mind Horizon3's remarks about the tool's design, which, according to them, has poor privilege separation, no sandbox, and a history of RCEs \"by design\" stemming from its nature and intended functionality.\nCVE-2025-3248 is the first truly unauthenticated RCE flaw in Langflow, and given its active exploitation status, immediate action is required.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nSamsung MagicINFO 9 Server RCE flaw now exploited in attacks\nSAP fixes suspected NetWeaver zero-day exploited in attacks\nCISA flags Craft CMS code injection flaw as exploited in attacks\nActive! Mail RCE flaw exploited in attacks on Japanese orgs\nCISA tags SonicWall VPN flaw as actively exploited in attacks"
    },
    {
        "Title": "New Microsoft 365 outage impacts Teams and other services",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/new-microsoft-365-outage-impacts-teams-and-other-services/",
        "Summary": "Microsoft is investigating a new Microsoft 365 outage affecting multiple services across North America, including the company's Teams collaboration platform. [...]",
        "Date": "2025-05-06",
        "Content": "Microsoft is investigating a new Microsoft 365 outage affecting multiple services across North America, including the company's Teams collaboration platform.\nSince the incident started over two hours ago, outage monitoring service Downdetector has\nreceived thousands of user reports\n, with most affected users saying they're experiencing server connection and website problems when trying to access Microsoft 365 services and features.\n\"We're investigating an issue impacting multiple Microsoft 365 services and features in the North America region,\" Microsoft confirmed via its official Microsoft 365 Status Twitter account.\nIn a service alert (MO1068615) in the Microsoft 365 admin center, the company says impacted services include but are not limited to Microsoft Teams, adding that the most likely cause could be a faulty routing configuration for its Azure Front Door (AFD) cloud content delivery network.\n\"We're reviewing Azure Front Door (AFD) routing configurations and networking telemetry to isolate the source of the issue,\" Microsoft added.\n\"We've identified a section of AFD infrastructure is performing below acceptable thresholds. We're rerouting traffic to alternate infrastructure to mitigate impact. Meanwhile, we're also taking mitigation actions to expedite recovery of the Microsoft Teams service.\"\nWhile the company has yet to share more information on the outage's root cause and how widespread it is, Microsoft tagged this as a critical service issue in the admin center, which typically involves noticeable user impact.\n​In March, Redmond\nmitigated another outage\nthat affected Teams customers, causing call failures and impacting other services such as Outlook, OneDrive, and Exchange Online, preventing users from checking email messages.\nThe same month, it\naddressed an issue\nthat prevented Outlook on the web users from accessing Exchange Online mailboxes and a\nweek-long Exchange Online outage\nthat caused delays and failures when sending or receiving email messages.\nMore recently, in April, Microsoft\nfixed an issue\nblocking IT admins worldwide from accessing the Exchange Admin Center (EAC).\nUpdate May 06, 11:31 EDT:\nMicrosoft says the outage has been mitigated and that it also affected SharePoint Online and OneDrive for Business customers.\nA final admin center update added that the root cause was higher than normal CPU usage across systems part of Microsoft's AFD infrastructure.\n\"A small section of AFD infrastructure started to perform below acceptable thresholds. We have identified high Central Processing Unit (CPU) utilization as a potential contributing factor that resulted in impact. Further investigations are ongoing and more detail will be provided within the Post-Incident Report,\" it said.\n\"We're isolating the source of the high CPU utilization so that action items can be identified to prevent impact reoccurring.\"\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft: Licensing issue blocks Microsoft 365 Family for some users\nMicrosoft investigates global Exchange Admin Center outage\nMicrosoft Exchange Online outage affects Outlook web users\nWeek-long Exchange Online outage causes email failures, delays\nMicrosoft fixes Outlook paste, blank calendar rendering issues"
    },
    {
        "Title": "Why EASM is vital to modern digital risk protection",
        "Link": "https://www.bleepingcomputer.com/news/security/why-easm-is-vital-to-modern-digital-risk-protection/",
        "Summary": "You can't protect what you can't see. From shadow IT to supplier risk, modern attack surfaces are sprawling fast — and External Attack Surface Management (EASM) is how security teams take back control. Learn from Outpost24 how EASM powers proactive digital risk protection. [...]",
        "Date": "2025-05-06",
        "Content": "Modern organizations face mounting challenges in securing their public-facing assets. From the rise of shadow IT to third-party supplier exposures, the array of risks and pitfalls in today’s digital environments make it nearly impossible to maintain meaningful cyber resilience using traditional defense methods.\nTo stay ahead of emerging threats and maintain a strong security posture, security teams are turning to external attack surface management (EASM) as a key component of their digital risk protection strategy.\nThis article examines the critical role EASM plays in digital risk protection (DRP), and how security teams can effectively use tools like these to enhance ongoing digital resilience efforts and mitigate potential vulnerabilities.\nBridging the gap\nSecurity teams these days are regularly tasked with managing complex, sprawling public-facing digital attack surfaces that are not only difficult to manage, but often hard to fully understand and map. This challenge is amplified in hybrid environments, where blurred lines of ownership and responsibility make effective security oversight even more difficult.\nRecent data highlights\njust how fragmented the modern digital footprint has become. Organizations now rely on a wide range of technologies to support their operations, but this diversity often leads to visibility gaps and an increased risk of exposure. Without clear and continuous visibility into these expanding attack surfaces, vulnerabilities become easier to overlook – and for attackers to exploit.\nUnsurprisingly,\n83% of cyberattacks\noriginate from external actors, many of whom exploit weaknesses at the network perimeter. With Gartner naming EASM as the\ntop cybersecurity trend\nfor the next five to ten years, it’s clear that managing these external entry points has become a critical priority for security teams.\nUnderstanding EASM\nEASM is the ongoing practice of identifying and addressing vulnerabilities and security gaps across an organization’s internet-facing digital footprint. Crucially, this involves the continuous discovery, evaluation, and mitigation of externally accessible attack vectors—many of which are overlooked in traditional security approaches.\nKey components of an effective EASM approach include:\nAsset Discovery\n- Mapping all public-facing digital assets, including websites, applications, cloud services, and exposed infrastructure components.\nVulnerability Assessment\n- Evaluating IT assets to uncover misconfigurations, outdated software, or other weaknesses that could be exploited.\nRegular penetration testing\ncombined with EASM is also crucial for further identifying security gaps that automated tools or high level scans may miss.\nThreat Intelligence\n-\nCollecting and analyzing data\non emerging threats and TTPs of threat actors to better understand potential risks.\nContinuous Monitoring\n- Maintaining real-time visibility to detect changes, new exposures, or signs of malicious activity as they occur.\nTogether, these components enable security teams to maintain a proactive security posture by continuously reducing exposure and staying ahead of potential threats.\nIdentify and prioritize cyber risk – before it is too late!\nGain a consistent and clear view of your ENTIRE organizations digital presence and any cyber threats hiding within.\nOutpost24s innovative combination of Cyber Threat Intelligence and Attack Surface Management offers a full overview of external threats & risks facing your organization. This makes it easier to prioritize threats and fight them proactively.\nGet a Free Assessment\nThe importance of DRP\nWhile EASM is centered on uncovering vulnerabilities in public-facing IT assets to strengthen an organization’s security posture, DRP takes a broader approach by proactively identifying and mitigating external threats that emerge from an organization’s digital footprint—spanning public sources as well as Social Media presence and\ndeep and dark web channels\n.\nDRP improves cyber resilience through four key objectives:\nRisk Identification\n- Detecting potential threats to digital assets across various external environments.\nDetect and monitor Cyber Risk outside of your owned assets.\nRisk Mitigation\n- Taking proactive steps to minimize the likelihood and impact of identified risks.\nCompliance\n- Ensuring ongoing alignment with regulatory and industry-specific requirements.\nReputation Management\n- Safeguarding the organization’s brand and public perception from reputational threats.\nCollectively, these four objectives enable organizations to proactively safeguard their digital assets, minimize external threats, and maintain a resilient security posture that protects both operational integrity and brand reputation.\nHow EASM can help enhance DRP\nBy aligning DRP with EASM, security teams can gain a comprehensive view of their external risk landscape —empowering them to respond swiftly, protect critical assets, and uphold organizational trust in an increasingly complex threat environment.\nKeep track of mentions and pending investigations with Outpost24s EASM Platform\nEASM enhances DRP by providing the following crucial functions:\nComprehensive visibility\nEASM provides organizations with a comprehensive view of their external attack surface, a critical element for effective DRP. With clear visibility into all potential exposures, security teams can better safeguard against cyber risks, laying the foundation for robust cyber resilience.\nProactive threat detection\nUndetected security gaps that elude security teams are likely to be exploited by cyber attackers. By proactively identifying and mitigating threats before they can be leveraged by malicious actors, EASM helps minimize risks that could lead to cyberattacks and data breaches.\nRisk prioritization\nIn an ideal world, organizations would have unlimited resources for cybersecurity. However, the reality is that security teams must focus on protecting what matters most. EASM empowers them to prioritize risks based on their potential impact and likelihood, ensuring resources are allocated where they are needed most.\nIncident response\nTime is critical when responding to security incidents, as swift action is key to limiting the impact of breaches and minimizing data exfiltration. EASM enhances incident response by providing real-time insights and actionable intelligence, enabling teams to act quickly and decisively.\nBest practices for integrating EASM into DRP\nTo successfully integrate EASM into your DRP strategy, consider adopting the following best practices:\nRegular assessments\nConduct regular EASM assessments to stay ahead of emerging threats. Continuous evaluation of your external attack surface helps identify new vulnerabilities and allows for timely mitigation before these risks are exploited.\nCollaboration\nCollaboration is key to effective EASM integration. Encourage regular communication and cooperation between departments like IT, security, and compliance. By working together, different teams within the organization can align their efforts and create a more cohesive approach to managing digital risks.\nContinuous improvement\nCyber threats are constantly evolving, so it’s crucial to emphasize continuous improvement. Ensure your EASM and DRP strategies are adaptable to new threats, incorporating lessons learned from past incidents to strengthen your security posture over time.\nVendor selection\nIn selecting an EASM vendor, you should consider your organization’s specific needs and ensure that candidate solutions provide the scalability, flexibility, and capabilities necessary for comprehensive attack surface management.\nYou should also evaluate its threat intelligence integrations—a broader range of integrations offers a more unified approach to DRP. For instance,\nOutpost24’s EASM solution\ncombines data gathering, enrichment, and AI-driven analysis into a seamless, event-driven platform that provides the most comprehensive and actionable view of your attack surface.\nTo learn more, claim a\nfree attack surface analysis today\n.\nSponsored and written by\nOutpost24\n."
    },
    {
        "Title": "Google fixes actively exploited FreeType flaw on Android",
        "Link": "https://www.bleepingcomputer.com/news/security/google-fixes-actively-exploited-freetype-flaw-on-android/",
        "Summary": "Google has released the May 2025 security updates for Android with fixes for 45 security flaws, including an actively exploited zero-click FreeType 2 code execution vulnerability. [...]",
        "Date": "2025-05-06",
        "Content": "Google has released the May 2025 security updates for Android with fixes for 45 security flaws, including an actively exploited zero-click FreeType 2 code execution vulnerability.\nFreeType is a popular open-source font rendering library that displays and programmatically adds text to images.\nThe flaw, tracked as CVE-2025-27363, is a high-severity arbitrary code execution bug\ndiscovered by Facebook\nsecurity researchers in March 2025.\nIt impacts all FreeType versions up to 2.13, which was released on February 9, 2023, and addresses the vulnerability.\n\"There are indications that CVE-2025-27363 may be under limited, targeted exploitation,\"\nreads the bulletin\n.\nNeither Facebook nor Google disclosed details about how the flaw is used in attacks. However,\nFacebook's disclosure\nin March explains that it can be exploited when FreeType parses a malicious TrueType GX or variable fonts file, leading to code execution.\n\"An out of bounds write exists in FreeType versions 2.13.0 and below (newer versions of FreeType are not vulnerable) when attempting to parse font subglyph structures related to TrueType GX and variable font files,\" reads Facebook's disclosure.\n\"The vulnerable code assigns a signed short value to an unsigned long and then adds a static value causing it to wrap around and allocate too small of a heap buffer. The code then writes up to 6 signed long integers out of bounds relative to this buffer. This may result in arbitrary code execution.\"\nThe rest of the flaws fixed by Google this month concern problems in Framework, System, Google Play, and the Android Kernel, as well as security gaps in proprietary components from MediaTek, Qualcomm, Arm, and Imagination Technologies.\nAll the flaws in core Android components are rated high severity, with most being elevation of privilege problems.\nThe released fixes concern Android versions 13, 14, and 15, though not all vulnerabilities impact all three.\nAndroid 12 reached the end of support on March 31, 2025, so it's no longer receiving security fixes. However, it (and older versions) may be impacted by some of the vulnerabilities listed in the latest bulletin.\nGoogle regularly incorporates critical fixes for those devices via the Google Play system update channel, though specific fixes to actively exploited flaws aren't guaranteed for older devices.\nAndroid users on versions older than 13 are recommended to consider third-party Android distributions that incorporate security fixes for unsupported devices or move to a newer model that is supported by its OEM.\nTo apply the latest Android update, go to\nSettings > Security & privacy > System & updates > Security update > click 'Check for update.'\n(the process may vary per OEM/model).\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nGoogle fixes Android zero-days exploited in attacks, 60 other flaws\nVerizon Call Filter API flaw exposed customers' incoming call history\nFacebook discloses FreeType 2 flaw exploited in attacks\nGoogle fixes Android zero-day exploited by Serbian authorities\nSamsung MagicINFO 9 Server RCE flaw now exploited in attacks"
    },
    {
        "Title": "Microsoft unveils new AI agents that can modify Windows settings",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-unveils-new-ai-agents-that-can-modify-windows-settings/",
        "Summary": "Today, Microsoft announced new Windows experiences for Copilot+ PCs, including AI agents that will make changing settings on your Windows computer easier. [...]",
        "Date": "2025-05-06",
        "Content": "Today, Microsoft announced new Windows experiences for Copilot+ PCs, including AI agents that will make changing settings on your Windows computer easier.\nThe company says users will be able to use these new agents to find settings they want to change using natural language quickly, and even instruct them to do it without any user involvement beyond the prompt.\n\"We set out to solve one of the most common frustrations we hear – finding and changing settings on your PC – using the power of agents. An agent uses on device AI to understand your intent and with your permission, automate and execute tasks,\"\nsaid Navjot Virk\n, CVP of Windows Experiences.\n\"With this update to Settings, you will be able to simply describe what you need help with like, 'how to control my PC by voice' or 'my mouse pointer is too small' and the agent will recommend the right steps you can take to address the issue. With your permission and at your initiation, it can even complete the actions to change your settings on your behalf.\"\nThis experience will only be available for English speakers first and will start rolling out to Windows Insiders on Snapdragon-powered Copilot+ PCs and later to those using AMD- and Intel-powered devices.\nRedmond is also improving Windows search and adding\nmore Click to Do text and image actions\n, such as Schedule a meeting with Teams, Send a message with Teams, Ask M365 Copilot, Convert to table with Excel, and Draft with Copilot in Word. Several new actions, including Ask Copilot, Practice in Reading Coach, and Read with Immersive Reader, are already available to Windows Insiders.\nPhotos, Paint, and the Snipping Tool get multiple new features on Copilot+ PCs designed to simplify editing and creating images.\nThese include Photos Relight for adding dynamic lighting controls to pictures, Paint Sticker Generator for creating digital stickers via text prompts, Paint Object Select to select and instantly edit specific elements on the canvas, and\nSnipping Tool Perfect Screenshot\nfor adjusting the capture area and removing the need for post-capture cropping.\nSnipping Tool is also getting some new capture tools, which will help extract text directly from images and pick color values from any element on the screen.\nOver the next few weeks, Microsoft will start rolling out more Windows 11 experiences for all Windows 11 Insiders, such as a\nphone companion for the Start menu\n, AI actions in File Explorer that will help edit images and summarize content, and a new write function in Notepad that will allow creating text from a prompt.\nIn March, Microsoft\nannounced\nthat it started testing a Snipping Tool \"Draw & Hold\" feature that helps draw perfect shapes and an AI-powered text summarization feature in Notepad.\nMicrosoft also\nadded a text rewriting tool\nto Notepad in November, dubbed \"Rewrite\" and previously known as\nCoWriter\n.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft testing Windows 11 support for third-party passkeys\nMicrosoft starts final Windows Recall testing before rollout\nMicrosoft starts testing Windows 11 taskbar icon scaling\nMicrosoft silently fixes Start menu bug affecting Windows 10 PCs\nMicrosoft: Windows 11 24H2 now ready to rollout to everyone"
    },
    {
        "Title": "Linux wiper malware hidden in malicious Go modules on GitHub",
        "Link": "https://www.bleepingcomputer.com/news/security/linux-wiper-malware-hidden-in-malicious-go-modules-on-github/",
        "Summary": "A supply-chain attack targets Linux servers with disk-wiping malware hidden in Golang modules published on GitHub. [...]",
        "Date": "2025-05-06",
        "Content": "A supply-chain attack targets Linux servers with disk-wiping malware hidden in Golang modules published on GitHub.\nThe campaign was detected last month and relied on three malicious Go modules that included “highly obfuscated code” for retrieving remote payloads and executing them.\nComplete disk destruction\nThe attack appears designed specifically for Linux-based servers and developer environments, as the destructive payload - a Bash script named\ndone.sh\n, runs a ‘dd’ command for the file-wiping activity.\nFurthermore, the payload verifies that it runs in a Linux environment (\nruntime.GOOS == \"linux\"\n) before trying to execute.\nAn analysis from supply-chain security company Socket shows that the command overwrites with zeroes every byte of data, leading to irreversible data loss and system failure.\nThe target is the primary storage volume,\n/dev/sda\n, that holds critical system data, user files, databases, and configurations.\n“By populating the entire disk with zeros, the script completely destroys the file system structure, operating system, and all user data, rendering the system unbootable and unrecoverable” -\nSocket\nThe researchers discovered the attack in April and identified three Go modules on GitHub, that have since been removed from the platform:\ngithub[.]com/truthfulpharm/prototransform\ngithub[.]com/blankloggia/go-mcp\ngithub[.]com/steelpoor/tlsproxy\nAll three modules contained obfuscated code that decodes into commands that use ‘wget’ to download the malicious data-wiping script (/bin/bash or /bin/sh).\nAccording to Socket researchers, the payloads are executed immediately after download, “leaving virtually no time for response or recovery.”\nThe malicious Go modules appear to have impersonated legitimate projects for converting message data to various formats (Prototransform), a Go implementation of the Model Context Protocol (go-mcp), and a TLS proxy tool that provides encryption for TCP and HTTP servers (tlsproxy).\nSocket researchers warn that even minimal exposure to the analyzed destructive modules can significantly impact such as complete data loss.\nBecause of the decentralized nature of the Go ecosystem that lacks proper checks, packages from different developers can have the same or similar names.\nAttackers can leverage this to create module namespaces that appear legitimate and wait for developers to integrate the malicious code into their projects.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nKali Linux warns of update failures after losing repo signing key\nLinux 'io_uring' security blindspot allows stealthy rootkit attacks\nRecent GitHub supply chain attack traced to leaked SpotBugs token\nGitHub expands security tools after 39 million secrets leaked in 2024\nMicrosoft uses AI to find flaws in GRUB2, U-Boot, Barebox bootloaders"
    },
    {
        "Title": "Microsoft pushes fix for Windows 11 24H2 update failures",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-pushes-fix-for-windows-11-update-0x80240069-errors/",
        "Summary": "​Microsoft has fixed a known issue preventing Windows 11 24H2 feature updates from being delivered via Windows Server Update Services (WSUS) after installing the April 2025 security updates. [...]",
        "Date": "2025-05-06",
        "Content": "​Microsoft has fixed a known issue preventing Windows 11 24H2 feature updates from being delivered via Windows Server Update Services (WSUS) after installing the April 2025 security updates.\nWSUS was introduced as Software Update Services (SUS) almost twenty years ago, and it is designed to help IT admins defer, approve, and schedule updates for Microsoft products on large enterprise networks from a single local update server instead of relying on endpoints to update from Microsoft's servers on their own.\nRedmond confirmed the Windows 11 24H2 upgrade problems in late April following widespread reports across online platforms,\nincluding\nReddit\nand its\nown\ncommunity\nwebsite\n.\nAs the company said when it acknowledged this issue, affected users see Windows Update Service (wuauserv\n)\nerrors with 0x80240069 codes when attempting to update systems running Windows 11 23H2 or Windows 11 22H2.\nLuckily, home users are unlikely to experience these update problems since WSUS is designed to be used only in business and enterprise environments.\n\"Devices which have installed the April Windows monthly security update, released April 8, 2025, or later (starting with KB5055528) might be unable to update to Windows 11 24H2 via Windows Server Update Services (WSUS),\"\nMicrosoft said\nlast month in a Windows release health update.\n\"As part of this issue, the download of Windows 11 24H2 does not initiate or complete. Windows updates log can show error code 0x80240069, and further logs might include text similar to 'Service wuauserv has unexpectedly stopped'.\"\nFix available via Known Issue Rollback\nWhile the fix is not yet shipping to all customers through Windows Update, Microsoft is now rolling it out automatically through Known Issue Rollback (KIR) to all enterprise-managed devices.\nTo address it on impacted Windows enterprise-managed devices, Windows admins must install\nthis Known Issue Rollback Group Policy\non impacted endpoints running Windows 11 22H2 and 23H2.\nTo deploy the policy, use the Group Policy Editor to choose the Windows version you want to target in the Local Computer Policy or the Domain policy on the domain controller, and restart the affected device(s) to apply the group policy setting.\nMicrosoft provides additional guidance on deploying and configuring KIR Group Policies on\nits documentation website\n.\nThe company is also working on addressing what it described as a \"latent code issue\" that is\ncausing some PCs to be upgraded to Windows 11\ndespite Intune policies designed to block Windows 11 upgrades.\nThis is not the first instance in recent months where Windows systems have been upgraded without prior notice. Microsoft acknowledged in November that some Windows Server 2019 and Windows Server 2022 devices\nwere upgraded to Windows Server 2025\nwithout user consent.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft: Windows 11 24H2 updates fail with 0x80240069 errors\nMicrosoft: Windows 11 24H2 now ready to rollout to everyone\nMicrosoft fixes auth issues on Windows Server, Windows 11 24H2\nMicrosoft: Some devices offered Windows 11 upgrades despite Intune blocks\nWindows 11 24H2 blocked on PCs with code-obfuscation driver BSODs"
    },
    {
        "Title": "Researcher Says Patched Commvault Bug Still Exploitable",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/researcher-patched-commvault-bug-exploitable",
        "Summary": "CISA added CVE-2025-34028 to its Known Exploited Vulnerabilities catalog, citing active attacks in the wild.",
        "Date": "2025-05-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/researcher-patched-commvault-bug-exploitable"
    },
    {
        "Title": "'Easily Exploitable' Langflow Vulnerability Requires Immediate Patching",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/easily-exploitable-langflow-vulnerability-patching",
        "Summary": "The vulnerability, which has a CVSS score of 9.8, is under attack and allows threat actors to remotely execute arbitrary commands on servers running the agentic AI builder.",
        "Date": "2025-05-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/easily-exploitable-langflow-vulnerability-patching"
    },
    {
        "Title": "CISA Warns 2 SonicWall Vulnerabilities Under Active Exploitation",
        "Link": "https://www.darkreading.com/threat-intelligence/two-sonicwall-vulnerabilities-under-exploitation",
        "Summary": "The vulnerabilities affect SonicWall's SMA devices for secure remote access, which have been heavily targeted by threat actors in the past.",
        "Date": "2025-05-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/two-sonicwall-vulnerabilities-under-exploitation"
    },
    {
        "Title": "Addressing the Top Cyber-Risks in Higher Education",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/addressing-top-cyber-risks-higher-education",
        "Summary": "As attacks accelerate, security leaders must act to gain visibility across their entire institution's network and systems and continuously educate their users on best practices.",
        "Date": "2025-05-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/addressing-top-cyber-risks-higher-education"
    },
    {
        "Title": "Applying the OODA Loop to Solve the Shadow AI Problem",
        "Link": "https://www.securityweek.com/applying-the-ooda-loop-to-solve-the-shadow-ai-problem/",
        "Summary": "<p>By taking immediate actions, organizations can ensure that shadow AI is prevented and used constructively where possible.</p>\n<p>The post <a href=\"https://www.securityweek.com/applying-the-ooda-loop-to-solve-the-shadow-ai-problem/\">Applying the OODA Loop to Solve the Shadow AI Problem</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/applying-the-ooda-loop-to-solve-the-shadow-ai-problem/"
    },
    {
        "Title": "Hacker Conversations: John Kindervag, a Making not Breaking Hacker",
        "Link": "https://www.securityweek.com/hacker-conversations-john-kindervag-a-making-not-breaking-hacker/",
        "Summary": "<p>John Kindervag is best known for developing the Zero Trust Model. He is a hacker, but not within our common definition of a hacker today. </p>\n<p>The post <a href=\"https://www.securityweek.com/hacker-conversations-john-kindervag-a-making-not-breaking-hacker/\">Hacker Conversations: John Kindervag, a Making not Breaking Hacker</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/hacker-conversations-john-kindervag-a-making-not-breaking-hacker/"
    },
    {
        "Title": "Second Wave of Attacks Hitting SAP NetWeaver After Zero-Day Compromise",
        "Link": "https://www.securityweek.com/second-wave-of-attacks-hitting-sap-netweaver-after-zero-day-compromise/",
        "Summary": "<p>Threat actors are revisiting SAP NetWeaver instances to leverage webshells deployed via a recent zero-day vulnerability.</p>\n<p>The post <a href=\"https://www.securityweek.com/second-wave-of-attacks-hitting-sap-netweaver-after-zero-day-compromise/\">Second Wave of Attacks Hitting SAP NetWeaver After Zero-Day Compromise</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/second-wave-of-attacks-hitting-sap-netweaver-after-zero-day-compromise/"
    },
    {
        "Title": "US Charges Yemeni Man for Black Kingdom Ransomware Attacks",
        "Link": "https://www.securityweek.com/us-charges-yemeni-man-for-black-kingdom-ransomware-attacks/",
        "Summary": "<p>Rami Khaled Ahmed, a 36-year-old from Yemen, has been charged for launching ransomware attacks between 2021 and 2023.</p>\n<p>The post <a href=\"https://www.securityweek.com/us-charges-yemeni-man-for-black-kingdom-ransomware-attacks/\">US Charges Yemeni Man for Black Kingdom Ransomware Attacks</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/us-charges-yemeni-man-for-black-kingdom-ransomware-attacks/"
    },
    {
        "Title": "Samsung MagicINFO Vulnerability Exploited Days After PoC Publication",
        "Link": "https://www.securityweek.com/samsung-magicinfo-vulnerability-exploited-days-after-poc-publication/",
        "Summary": "<p>Threat actors started exploiting a vulnerability in Samsung MagicINFO only days after a PoC exploit was published.</p>\n<p>The post <a href=\"https://www.securityweek.com/samsung-magicinfo-vulnerability-exploited-days-after-poc-publication/\">Samsung MagicINFO Vulnerability Exploited Days After PoC Publication</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/samsung-magicinfo-vulnerability-exploited-days-after-poc-publication/"
    },
    {
        "Title": "Critical Vulnerability in AI Builder Langflow Under Attack",
        "Link": "https://www.securityweek.com/critical-vulnerability-in-ai-builder-langflow-under-attack/",
        "Summary": "<p>CISA warns organizations that threat actors are exploiting a critical-severity vulnerability in low-code AI builder Langflow.</p>\n<p>The post <a href=\"https://www.securityweek.com/critical-vulnerability-in-ai-builder-langflow-under-attack/\">Critical Vulnerability in AI Builder Langflow Under Attack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/critical-vulnerability-in-ai-builder-langflow-under-attack/"
    },
    {
        "Title": "Microsoft Warns of Attackers Exploiting Misconfigured Apache Pinot Installations",
        "Link": "https://www.securityweek.com/microsoft-warns-of-attackers-exploiting-misconfigured-apache-pinot-installations/",
        "Summary": "<p>Misconfigured Apache Pinot instances can and have enabled threat actors to gain access to sensitive information. </p>\n<p>The post <a href=\"https://www.securityweek.com/microsoft-warns-of-attackers-exploiting-misconfigured-apache-pinot-installations/\">Microsoft Warns of Attackers Exploiting Misconfigured Apache Pinot Installations</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/microsoft-warns-of-attackers-exploiting-misconfigured-apache-pinot-installations/"
    },
    {
        "Title": "Android Update Patches FreeType Vulnerability Exploited as Zero-Day",
        "Link": "https://www.securityweek.com/android-update-patches-freetype-vulnerability-exploited-as-zero-day/",
        "Summary": "<p>Android’s May 2025 security update includes patches for an exploited vulnerability in the FreeType open source rendering engine.</p>\n<p>The post <a href=\"https://www.securityweek.com/android-update-patches-freetype-vulnerability-exploited-as-zero-day/\">Android Update Patches FreeType Vulnerability Exploited as Zero-Day</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-06",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/android-update-patches-freetype-vulnerability-exploited-as-zero-day/"
    }
]