[
    {
        "Title": "Hazy Hawk Exploits DNS Records to Hijack CDC, Corporate Domains for Malware Delivery",
        "Link": "https://thehackernews.com/2025/05/hazy-hawk-exploits-dns-records-to.html",
        "Summary": "A threat actor known as Hazy Hawk has been observed hijacking abandoned cloud resources of high-profile organizations, including Amazon S3 buckets and Microsoft Azure endpoints, by leveraging misconfigurations in the Domain Name System (DNS) records.\nThe hijacked domains are then used to host URLs that direct users to scams and malware via traffic distribution systems (TDSes), according to",
        "Date": "2025-05-20",
        "Content": "A threat actor known as\nHazy Hawk\nhas been observed hijacking abandoned cloud resources of high-profile organizations, including Amazon S3 buckets and Microsoft Azure endpoints, by leveraging misconfigurations in the Domain Name System (DNS) records.\nThe hijacked domains are then used to host URLs that direct users to scams and malware via traffic distribution systems (TDSes), according to Infoblox. Some of the other resources usurped by the threat actor include those hosted on Akamai, Bunny CDN, Cloudflare CDN, GitHub, and Netlify.\nThe DNS threat intelligence firm said it first discovered the threat actor after it gained control of several sub-domains associated with the U.S. Center for Disease Control (CDC) in February 2025.\nIt has since been determined that other government agencies across the globe, prominent universities, and international corporations such as Deloitte, PricewaterhouseCoopers, and Ernst & Young have been victimized by the same threat actor since at least December 2023.\n\"Perhaps the most remarkable thing about Hazy Hawk is that these hard-to-discover, vulnerable domains with ties to esteemed organizations are not being used for espionage or 'highbrow' cybercrime,\" Infoblox's Jacques Portal and Renée Burton\nsaid\nin a report shared with The Hacker News.\n\"Instead, they feed into the seedy underworld of adtech, whisking victims to a wide range of scams and fake applications, and using browser notifications to trigger processes that will have a lingering impact.\"\nWhat makes Hazy Hawk's operations noteworthy is the hijacking of trusted and reputable domains belonging to legitimate organizations, thus boosting their credibility in search results when they are being used to serve malicious and spammy content. But even more concerningly, the approach enables the threat actors to bypass detection.\nUnderpinning the operation is the ability of the attackers to seize control of abandoned domains with dangling DNS CNAME records, a technique\npreviously exposed\nby Guardio in early 2024 as being exploited by bad actors for spam proliferation and click monetization. All a threat actor needs to do is register the missing resource to hijack the domain.\nHazy Hawk goes a step further by finding abandoned cloud resources and then commandeering them for malicious purposes. In some cases, the threat actor employs URL redirection techniques to conceal which cloud resource was hijacked.\n\"We use the name Hazy Hawk for this actor because of how they find and hijack cloud resources that have dangling DNS CNAME records and then use them in malicious URL distribution,\" Infoblox said. \"It's possible that the domain hijacking component is provided as a service and is used by a group of actors.\"\nThe attack chains often involve cloning the content of legitimate sites for their initial site hosted on the hijacked domains, while luring victims into visiting them with pornographic or pirated content. The site visitors are then funneled via a TDS to determine where they land next.\n\"Hazy Hawk is one of the dozens of threat actors we track within the advertising affiliate world,\" the company said. \"Threat actors who belong to affiliate advertising programs drive users into tailored malicious content and are incentivized to include requests to allow push notifications from 'websites' along the redirection path.\"\nIn doing so, the idea is to\nflood a victim's device with push notifications\nand deliver an endless torrent of malicious content, with each notification leading to different scams, scareware, and fake surveys, and accompanied by requests to allow more push notifications.\nTo prevent and protect against Hazy Hawk activities, domain owners are recommended to remove a DNS CNAME record as soon as a resource is shut down. End users, on the other hand, are advised to deny notification requests from websites they don't know.\n\"While operators like Hazy Hawk are responsible for the initial lure, the user who clicks is led into a labyrinth of sketchy and outright malicious adtech. The fact that Hazy Hawk puts considerable effort into locating vulnerable domains and then using them for scam operations shows that these advertising affiliate programs are successful enough to pay well,\" Infoblox said.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "100+ Fake Chrome Extensions Found Hijacking Sessions, Stealing Credentials, Injecting Ads",
        "Link": "https://thehackernews.com/2025/05/100-fake-chrome-extensions-found.html",
        "Summary": "An unknown threat actor has been attributed to creating several malicious Chrome Browser extensions since February 2024 that masquerade as seemingly benign utilities but incorporate covert functionality to exfiltrate data, receive commands, and execute arbitrary code.\n\"The actor creates websites that masquerade as legitimate services, productivity tools, ad and media creation or analysis",
        "Date": "2025-05-20",
        "Content": "An unknown threat actor has been attributed to creating\nseveral malicious Chrome Browser extensions\nsince February 2024 that masquerade as seemingly benign utilities but incorporate covert functionality to exfiltrate data, receive commands, and execute arbitrary code.\n\"The actor creates websites that masquerade as legitimate services, productivity tools, ad and media creation or analysis assistants, VPN services, crypto, banking and more to direct users to install corresponding malicious extensions on Google's Chrome Web Store (CWS),\" the DomainTools Intelligence (DTI) team\nsaid\nin a report shared with The Hacker News.\nWhile the browser add-ons appear to offer the advertised features, they also enable credential and cookie theft, session hijacking, ad injection, malicious redirects, traffic manipulation, and phishing via DOM manipulation.\nAnother factor that works in the extensions' favor is that they are configured to grant themselves excessive permissions via the manifest.json file, allowing them to interact with every site visited on the browser, execute arbitrary code retrieved from an attacker-controlled domain, perform malicious redirects, and even inject ads.\nThe extensions have also been found to rely on the \"\nonreset\n\" event handler on a temporary document object model (DOM) element to execute code, likely in an attempt to bypass content security policy (CSP).\nSome of the identified lure websites impersonate legitimate products and services like DeepSeek, Manus, DeBank, FortiVPN, and Site Stats to entice users into downloading and installing the extensions. The add-ons then proceed to harvest browser cookies, fetch arbitrary scripts from a remote server, and set up a WebSocket connection to act as a network proxy for traffic routing.\nThere is currently no visibility into how victims are redirected to the bogus sites, but DomainTools told the publication that it could involve usual methods like phishing and social media.\n\"Because they appear in both Chrome Web Store and have adjacent websites, they can return from as results in normal web searches and for searches within the Chrome store,\" the company said. \"Many of the lure websites used Facebook tracking IDs, which strongly suggests they are leveraging Facebook / Meta apps in some way to attract site visitors. Possibly through Facebook pages, groups, and even ads.\"\nAs of writing, it's not known who is behind the campaign, although the threat actors have set up over 100 fake websites and malicious Chrome extensions. Google, for its part, has taken down the extensions.\nTo mitigate risks, users are advised to stick with verified developers before downloading extensions, review requested permissions, scrutinize reviews, and refrain from using lookalike extensions.\nThat said, it's also worth keeping in mind that ratings could be manipulated and artificially inflated by filtering negative user feedback.\nDomainTools, in an analysis published late last month,\nfound\nevidence of extensions impersonating DeepSeek that redirected users providing low ratings (1-3 stars) to a private feedback form on the ai-chat-bot[.]pro domain, while sending those providing high ratings (4-5 stars) to the official Chrome Web Store review page.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "AWS Default IAM Roles Found to Enable Lateral Movement and Cross-Service Exploitation",
        "Link": "https://thehackernews.com/2025/05/aws-default-iam-roles-found-to-enable.html",
        "Summary": "Cybersecurity researchers have discovered risky default identity and access management (IAM) roles impacting Amazon Web Services that could open the door for attackers to escalate privileges, manipulate other AWS services, and, in some cases, even fully compromise AWS accounts.\n\"These roles, often created automatically or recommended during setup, grant overly broad permissions, such as full S3",
        "Date": "2025-05-20",
        "Content": "Cybersecurity researchers have discovered risky default identity and access management (IAM) roles impacting Amazon Web Services that could open the door for attackers to escalate privileges, manipulate other AWS services, and, in some cases, even fully compromise AWS accounts.\n\"These roles, often created automatically or recommended during setup, grant overly broad permissions, such as full S3 access,\" Aqua researchers Yakir Kadkoda and Ofek Itach\nsaid\nin an analysis. \"These default roles silently introduce attack paths that allow privilege escalation, cross-service access, and even potential account compromise.\"\nThe cloud security firm said it identified security issues in default IAM roles created by AWS services like SageMaker, Glue, EMR, and Lightsail. A similar flaw has also been unearthed in a popular open-source framework called Ray, which automatically creates a default IAM role (ray-autoscaler-v1) with the AmazonS3FullAccess policy.\nWhat's concerning about these IAM roles is that while they are intended for something specific, they could be abused to perform administrative actions and break isolation boundaries between services, effectively allowing an attacker who has a foothold in the environment to move laterally across services.\nThese attacks go beyond\nbucket monopoly attacks\n, which\nrevolve around\na scenario where a threat actor could take advantage of predictable S3 bucket naming patterns to set up buckets in unused AWS regions and ultimately gain control over the contents of the bucket when a legitimate customer starts using services like CloudFormation, Glue, EMR, SageMaker, ServiceCatalog, and CodeStar.\n\"In this case, an attacker who gains access to a default service role with AmazonS3FullAccess doesn't even need to guess bucket names remotely,\" the researchers explained.\n\"They can use their existing privileges to search the account for buckets used by other services using the naming patterns,\nmodify assets like CloudFormation templates\n, EMR scripts, and SageMaker resources, and move laterally across services within the same AWS account.\"\nPut differently, an IAM role within an AWS account with AmazonS3FullAccess permissions has read/write access to every S3 bucket and modifies various AWS services, effectively turning the role into a powerful method for lateral movement and privilege escalation.\nSome of the identified services with the permissive policy are listed below -\nAmazon SageMaker AI, which creates a default execution role named AmazonSageMaker-ExecutionRole-<Date&Time> when setting up a SageMaker Domain that comes with a custom policy equivalent to AmazonS3FullAccess\nAWS Glue, which creates a default AWSGlueServiceRole role with the AmazonS3FullAccess policy\nAmazon EMR, which creates a default AmazonEMRStudio_RuntimeRole_<Epoch-time> role that's assigned the AmazonS3FullAccess policy\nIn a hypothetical attack scenario, a threat actor could upload a malicious machine learning model to Hugging Face that, when imported into SageMaker, can result in the execution of arbitrary code, which could then be used to seize control of other AWS services like Glue by injecting a backdoor capable of stealing IAM credentials of the Glue job.\nThe adversary could then escalate their privileges within the account, ultimately breaching the entire AWS environment by looking for buckets used by CloudFormation and injecting a malicious template to escalate privileges further.\nIn response to the disclosure, AWS has addressed the issues by modifying the AmazonS3FullAccess policy for default service roles.\n\"AWS confirmed AWS CDK (Cloud Development Kit), AWS Glue, Amazon EMR (Elastic MapReduce), and Amazon SageMaker are operating as expected,\" Amazon said in a statement shared with The Hacker News. \"This issue was resolved by modifying the policies for the default service roles, particularly the AmazonS3FullAccess policy.\"\n\"Amazon Lightsail has updated the documentation to instruct users to create buckets with a scoped-down policy. AWS CDK has ensured CDK assets are only uploaded to buckets in the user's account.\"\n\"Default service roles must be tightly scoped and strictly limited to the specific resources and actions they require,\" the researchers said. \"Organizations should proactively audit and update existing roles to minimize risk, rather than relying on default configurations.\"\nThe findings come as Varonis detailed a vulnerability in a utility used for mounting Azure Storage that comes preinstalled on Microsoft Azure AI and High-Performance Computing (HPC) workloads and allows an unprivileged user on a Linux machine with this utility installed to escalate their privileges to root.\n\"It involves a classic privilege escalation method involving a SUID binary that is part of the installation of\nAZNFS-mount\n, a utility for mounting Azure Storage Account NFS endpoints,\" security researcher Tal Peleg\nsaid\n.\n\"For example, a user could elevate permissions to root and use those permissions to mount additional Azure Storage containers, install malware or ransomware on the machine, and attempt to move laterally in the network or cloud environments.\"\nThe flaw, which affects all versions of the utility up to 2.0.10, has been addressed in\nversion 2.0.11\nreleased on January 30, 2025.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "The Crowded Battle: Key Insights from the 2025 State of Pentesting Report",
        "Link": "https://thehackernews.com/2025/05/the-crowded-battle-key-insights-from.html",
        "Summary": "In the newly released 2025 State of Pentesting Report, Pentera surveyed 500 CISOs from global enterprises (200 from within the USA) to understand the strategies, tactics, and tools they use to cope with the thousands of security alerts, the persisting breaches and the growing cyber risks they have to handle. The findings reveal a complex picture of progress, challenges, and a shifting mindset",
        "Date": "2025-05-20",
        "Content": "In the newly released\n2025\nState of Pentesting Report\n, Pentera surveyed 500 CISOs from global enterprises (200 from within the USA) to understand the strategies, tactics, and tools they use to cope with the thousands of security alerts, the persisting breaches and the growing cyber risks they have to handle. The findings reveal a complex picture of progress, challenges, and a shifting mindset about how enterprises approach security testing.\nMore Tools, More Data, More Protection… No Guarantees\nOver the past year, 45% of enterprises expanded their security technology stacks, with organizations now managing an average of 75 different security solutions​.\nYet despite these layers of security tools, 67% of U.S. enterprises experienced a breach in the past 24 months​. The growing number of deployed tools has a few effects on the daily operation and the overall cyber posture of the organization.\nAlthough it seems obvious, the findings tell a clear story - more security tools do mean better security posture. However, there is no silver bullet. Among organizations with fewer than 50 security tools, 93% reported a breach. That percentage steadily declines as stack size increases, dropping to 61% among those using more than 100 tools.\nAlert Fatigue Is Real\nThe flip side of larger security stacks is that CISOs and their teams must contend with a much larger influx of information. Enterprises managing over 75 security solutions now face an average of 2,000 alerts per week —\ndouble the volume\ncompared to organizations with smaller stacks, and those with over 100 tools receive over 3000 (3x the alerts).\nThis in turn, puts much more emphasis on effective prioritization, otherwise, critical threats may get buried in a sea of alerts. In this environment, where alert volumes are high and time to triage is short, organizations benefit most when they can frequently test for exploitable gaps, so they know which issues truly matter before threat actors find them first.\nSoftware-Based\nPentesting Gains Ground\nTrust in software-based security testing is growing rapidly. Only 5-10 years ago, many enterprises would never have permitted automated tools to run pentests in their environments for fear of causing outages, but sentiment is changing.\nAs CISOs continue to recognize the advantages of software in scaling adversarial testing and keeping pace with constantly changing IT environments, software-based pentesting is becoming the standard. Over half of enterprises now use these tools to support in-house testing, driven by trust in their reliability and the need for scalable, continuous validation strategies. Today, 50% of CISOs cite software-based pentesting solutions as their primary method for uncovering exploitable gaps​.\nInsurance Providers Become Unexpected Influencers\nBeyond internal management and Boards of Directors, a surprising new force is shaping security strategy: Cyber insurance providers. 59% of CISOs admitted that they have implemented at least one cybersecurity solution that they were not previously considering as a result of their cyber insurers. It's a clear sign that insurers aren't just pricing risk, they're actively prescribing how to reduce it, and reshaping enterprise security priorities in the process.​.\nLow Confidence in Government Support\nWhile governmental agencies like CISA (in the US) and ENISA (in the EU) play an important role in threat visibility and coordination, confidence in government cybersecurity support is surprisingly low.\nOnly 14% of CISOs believe the government is adequately supporting the private sector's cyber challenges​, while 64% feel that government efforts, though acknowledged, are insufficient​. 22% believe that they cannot rely on the government at all for cybersecurity help.\nTo benchmark your organization's pentesting practices, budgets, and priorities against other global enterprises,\nregister for the webinar\non May 27, 2025 where senior security analysts will discuss the key findings. Alternatively,\nget the\nfull 2025 State of Pentesting Report\nand see all the insights for yourself!\nNote:\nThis article was written and contributed by Jay Mar Tang, Field CISO at Pentera.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "South Asian Ministries Hit by SideWinder APT Using Old Office Flaws and Custom Malware",
        "Link": "https://thehackernews.com/2025/05/south-asian-ministries-hit-by.html",
        "Summary": "High-level government institutions in Sri Lanka, Bangladesh, and Pakistan have emerged as the target of a new campaign orchestrated by a threat actor known as SideWinder.\n\"The attackers used spear phishing emails paired with geofenced payloads to ensure that only victims in specific countries received the malicious content,\" Acronis researchers Santiago Pontiroli, Jozsef Gegeny, and Prakas",
        "Date": "2025-05-20",
        "Content": "High-level government institutions in Sri Lanka, Bangladesh, and Pakistan have emerged as the target of a new campaign orchestrated by a threat actor known as SideWinder.\n\"The attackers used spear phishing emails paired with geofenced payloads to ensure that only victims in specific countries received the malicious content,\" Acronis researchers Santiago Pontiroli, Jozsef Gegeny, and Prakas Thevendaran\nsaid\nin a report shared with The Hacker News.\nThe attack chains leverage spear-phishing lures as a starting point to activate the infection process and deploy a known malware referred to as StealerBot. It's worth pointing out that the modus operandi is consistent with recent SideWinder attacks\ndocumented\nby Kaspersky in March 2025.\nSome of the targets of the campaign, per Acronis, include Bangladesh's Telecommunication Regulatory Commission, Ministry of Defence, and Ministry of Finance; Pakistan's Directorate of Indigenous Technical Development; and Sri Lanka's Department of External Resources, Department of Treasury Operations, Ministry of Defence, and Central Bank.\nThe attacks are characterized by the use of years-old remote code execution flaws in Microsoft Office (\nCVE-2017-0199 and CVE-2017-11882\n) as initial vectors to deploy malware capable of maintaining persistent access in government environments across South Asia.\nThe malicious documents, when opened, trigger an exploit for CVE-2017-0199 to deliver next-stage payloads that are responsible for installing StealerBot by means of DLL side-loading techniques.\nOne noteworthy tactic adopted by SideWinder is that the spear-phishing emails are coupled with geofenced payloads to ensure that only victims meeting the targeting criteria are served the malicious content. In the event the victim's IP address does not match, an empty RTF file is sent instead as a decoy.\nThe malicious payload is an RTF file that weaponizes CVE-2017-11882, a memory corruption vulnerability in the Equation Editor, to launch a shellcode-based loader that runs the StealerBot malware.\nStealerBot, according to Kaspersky, is a\n.NET implant\nthat's engineered to drop additional malware, launch a reverse shell, and collect a wide range of data from compromised hosts, including screenshots, keystrokes, passwords, and files.\n\"SideWinder has demonstrated consistent activity over time, maintaining a steady pace of operations without prolonged inactivity — a pattern that reflects organizational continuity and sustained intent,\" the researchers said.\n\"A closer analysis of their tactics, techniques, and procedures (TTPs) reveals a high degree of control and precision, ensuring that malicious payloads are delivered only to carefully selected targets, and often only for a limited time.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Chinese Hackers Deploy MarsSnake Backdoor in Multi-Year Attack on Saudi Organization",
        "Link": "https://thehackernews.com/2025/05/chinese-hackers-deploy-marssnake.html",
        "Summary": "Threat hunters have exposed the tactics of a China-aligned threat actor called UnsolicitedBooker that targeted an unnamed international organization in Saudi Arabia with a previously undocumented backdoor dubbed MarsSnake.\nESET, which first discovered the hacking group's intrusions targeting the entity in March 2023 and again a year later, said the activity leverages spear-phishing emails using",
        "Date": "2025-05-20",
        "Content": "Threat hunters have exposed the tactics of a China-aligned threat actor called\nUnsolicitedBooker\nthat targeted an unnamed international organization in Saudi Arabia with a previously undocumented backdoor dubbed MarsSnake.\nESET, which first discovered the hacking group's intrusions targeting the entity in March 2023 and again a year later, said the activity leverages spear-phishing emails using flight tickets as lures to infiltrate targets of interest.\n\"UnsolicitedBooker sends spear-phishing emails, generally with a flight ticket as the decoy, and its targets include governmental organizations in Asia, Africa, and the Middle East,\" the company\nsaid\nin its latest APT Activity Report for the period ranging from October 2024 to March 2025.\nAttacks mounted by the threat actor are characterized by the use of backdoors like Chinoxy, DeedRAT, Poison Ivy, and BeRAT, which are widely used by Chinese hacking crews.\nUnsolicitedBooker is assessed to share overlaps with a cluster tracked as\nSpace Pirates\nand an unattributed threat activity cluster that was found deploying a backdoor codenamed\nZardoor\nagainst an Islamic non-profit organization in Saudi Arabia.\nThe latest campaign, spotted by the Slovak cybersecurity company in January 2025, involved sending a phishing email claiming to be from Saudia Airlines to the same Saudi Arabian organization about a flight booking.\n\"A Microsoft Word document is attached to the email, and the decoy content [...] is a flight ticket that was modified but is based on a PDF that was available online on the Academia website, a platform for sharing academic research that allows uploading PDF files,\" ESET said.\nThe Word document, once launched, triggers the execution of a VBA macro that decodes and writes to the file system an executable (\"smssdrvhost.exe\") that, in turn, acts as a loader for MarsSnake, a backdoor that establishes communications with a remote server (\"contact.decenttoy[.]top\").\n\"The multiple attempts at compromising this organization in 2023, 2024, and 2025 indicate a strong interest by UnsolicitedBooker in this specific target,\" ESET said.\nThe disclosure comes as another Chinese threat actor tracked as PerplexedGoblin (aka APT31) targeted a Central European government entity in December 2024 to deploy an espionage backdoor referred to as NanoSlate.\nESET said it also identified DigitalRecyclers' continued attacks on European Union governmental entities, making use of the KMA VPN operational relay box (\nORB\n) network to conceal its network traffic and deploying the RClient, HydroRShell, and GiftBox backdoors.\nDigitalRecyclers was first detected by the company in 2021, although it's believed to be active since at least 2018.\n\"Likely linked to Ke3chang and\nBackdoorDiplomacy\n, DigitalRecyclers operates within the APT15 galaxy,\" ESET\nsaid\n. \"They deploy the RClient implant, a variant of the Project KMA stealer. In September 2023, the group introduced a new backdoor, HydroRShell, which uses Google's Protobuf and Mbed TLS for C&C communications.\"\nThe backdoors, according to the company, permit threat actors to execute any command and download additional payloads from the server.\n\"MarsSnake and HydroRShell are full-feature backdoors that, once installed on the victim's machine, enable [attackers] to execute arbitrary commands and read or write any file on disk,\" Matthieu Faou, Senior Malware Researcher at ESET, told The Hacker News.\n\"They both communicate with a remote C&C server, from which commands are received. To the best of our knowledge, MarsSnake seems to be exclusively used by UnsolicitedBooker, and HydroRShell by DigitalRecyclers.\"\nA quite uncommon implementation detail that we found in HydroRShell is that the author chose to use Protobuf for the C&C communications. Protobuf is a language to define structured data. In this case, it is used to serialize data to be sent to the C&C server.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Go-Based Malware Deploys XMRig Miner on Linux Hosts via Redis Configuration Abuse",
        "Link": "https://thehackernews.com/2025/05/go-based-malware-deploys-xmrig-miner-on.html",
        "Summary": "Cybersecurity researchers are calling attention to a new Linux cryptojacking campaign that's targeting publicly accessible Redis servers.\nThe malicious activity has been codenamed RedisRaider by Datadog Security Labs.\n\"RedisRaider aggressively scans randomized portions of the IPv4 space and uses legitimate Redis configuration commands to execute malicious cron jobs on vulnerable systems,\"",
        "Date": "2025-05-20",
        "Content": "Cybersecurity researchers are calling attention to a new Linux cryptojacking campaign that's targeting publicly accessible Redis servers.\nThe malicious activity has been codenamed\nRedisRaider\nby Datadog Security Labs.\n\"RedisRaider aggressively scans randomized portions of the IPv4 space and uses legitimate Redis configuration commands to execute malicious cron jobs on vulnerable systems,\" security researchers Matt Muir and Frederic Baguelin\nsaid\n.\nThe end goal of the campaign is to drop a Go-based primary payload that's responsible for unleashing an XMRig miner on compromised systems.\nThe activity entails using a bespoke scanner to identify publicly accessible Redis servers across the internet and then issuing an INFO command to determine if the instances are running on a Linux host. If it's found to be the case, the scanning algorithm proceeds to abuse Redis's SET command to inject a cron job.\nThe malware then uses the CONFIG command to change the Redis working directory to \"/etc/cron.d\" and write to the location a\ndatabase file\nnamed \"apache\" so that it's periodically picked by the cron scheduler and runs a Base64-encoded shell script, which subsequently downloads the RedisRaider binary from a remote server.\nThe payload essentially serves as a dropper for a bespoke version of XMRig and also propagates the malware to other Redis instances, effectively expanding its reach and scale.\n\"In addition to server-side cryptojacking, RedisRaider's infrastructure also hosted a web-based Monero miner, enabling a multi-pronged revenue generation strategy,\" the researchers said.\n\"The campaign incorporates subtle anti-forensics measures, such as short-key time-to-live (TTL) settings and database configuration changes, to minimize detection and hinder post-incident analysis.\"\nThe disclosure comes as Guardz disclosed details of a targeted campaign exploiting legacy authentication protocols in Microsoft Entra ID to brute-force accounts. The activity, observed between March 18 and April 7, 2025, has been found to leverage\nBAV2ROPC\n(short for \"Basic Authentication Version 2 - Resource Owner Password Credential\") to bypass defenses like multi-factor authentication (MFA) and Conditional Access.\n\"The tracking and investigation revealed systematic exploitation attempts that leveraged BAV2ROPC's inherent design limitations, which predated contemporary security architectures,\" Elli Shlomo, head of security research at Guardz,\nsaid\n. \"The threat actors behind this campaign showed a deep understanding of identity systems.\"\nThe attacks are said to have originated mainly from Eastern Europe and the Asia-Pacific regions, primarily targeting admin accounts using legacy authentication endpoints.\n\"While regular users received the bulk of authentication attempts (50,214), admin accounts and shared mailboxes were targeted at a specific pattern, with admin accounts receiving 9,847 attempts across 432 IPs over 8 hours, suggesting an average of 22.79 attempts per IP and a velocity of 1,230.87 attempts per hour,\" the company said.\n\"This indicates a highly automated and concentrated attack campaign specifically designed to compromise privileged accounts while maintaining a broader attack surface against regular users.\"\nThis is not the first time legacy protocols have been abused for malicious activities. In 2021, Microsoft\ndivulged\na large-scale business email compromise (BEC) campaign that used BAV2ROPC and IMAP/POP3 to circumvent MFA and exfiltrate email data.\nTo mitigate the risks posed by such attacks, it's advised to block legacy authentication via a Conditional Access policy, disable BAV2ROPC, and turn off SMTP AUTH in Exchange Online if not in use.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Malicious PyPI Packages Exploit Instagram and TikTok APIs to Validate User Accounts",
        "Link": "https://thehackernews.com/2025/05/malicious-pypi-packages-exploit.html",
        "Summary": "Cybersecurity researchers have uncovered malicious packages uploaded to the Python Package Index (PyPI) repository that act as checker tools to validate stolen email addresses against TikTok and Instagram APIs.\nAll three packages are no longer available on PyPI. The names of the Python packages are below -\n\nchecker-SaGaF (2,605 downloads)\nsteinlurks (1,049 downloads)\nsinnercore (3,300 downloads)",
        "Date": "2025-05-20",
        "Content": "Cybersecurity researchers have uncovered malicious packages uploaded to the Python Package Index (PyPI) repository that act as checker tools to validate stolen email addresses against TikTok and Instagram APIs.\nAll three packages are no longer available on PyPI. The names of the Python packages are below -\nchecker-SaGaF (2,605 downloads)\nsteinlurks (1,049 downloads)\nsinnercore (3,300 downloads)\n\"True to its name, checker-SaGaF checks if an email is associated with a TikTok account and an Instagram account,\" Socket researcher Olivia Brown\nsaid\nin an analysis published last week.\nSpecifically, the package is designed to send HTTP POST requests to TikTok's password recovery API and Instagram's account login endpoints to determine if an email address passed as input is valid, meaning there exists an account holder corresponding to that email address.\n\"Once threat actors have this information, just from an email address, they can threaten to dox or spam, conduct fake report attacks to get accounts suspended, or solely confirm target accounts before launching a credential stuffing or password spraying exploit,\" Brown said.\n\"Validated user lists are also sold on the dark web for profit. It can seem harmless to construct dictionaries of active emails, but this information enables and accelerates entire attack chains and minimizes detection by only targeting known-valid accounts.\"\nThe second package \"steinlurks,\" in a similar manner, targets Instagram accounts by sending forged HTTP POST requests mimicking the Instagram Android app to evade detection. It achieves this by targeting different API endpoints -\ni.instagram[.]com/api/v1/users/lookup/\ni.instagram[.]com/api/v1/bloks/apps/com.bloks.www.caa.ar.search.async/\ni.instagram[.]com/api/v1/accounts/send_recovery_flow_email/\nwww.instagram[.]com/api/v1/web/accounts/check_email/\n\"Sinnercore,\" on the other hand, aims to trigger the forgot password flow for a given username, targeting the API endpoint \"b.i.instagram[.]com/api/v1/accounts/send_password_reset/\" with fake HTTP requests containing the target's username.\n\"There is also functionality targeting Telegram, namely extracting name, user ID, bio, and premium status, as well as other attributes,\" Brown explained.\n\"Some parts of sinnercore are focused on crypto utilities, like getting real-time Binance price or currency conversions. It even targets PyPI programmers by fetching detailed info on any PyPI package, likely used for fake developer profiles or pretending to be developers.\"\nThe disclosure comes as ReversingLabs detailed another malicious package named \"dbgpkg\" that masquerades as a debugging utility but implants a backdoor on the developer's system to facilitate code execution and data exfiltration. While the package is not accessible anymore, it's estimated to have been downloaded about 350 times.\nInterestingly, the package in question has been found to contain the same payload as the one embedded in \"discordpydebug,\" which was\nflagged\nby Socket earlier this month. ReversingLabs said it also identified a third package called \"requestsdev\" that's believed to be part of the same campaign. It attracted 76 downloads before being taken down.\nFurther analysis has determined that the package's backdoor technique using GSocket resembles that of Phoenix Hyena (aka DumpForums or Silent Crow), a hacktivist group known for targeting Russian entities, including Doctor Web, in the aftermath of the Russo-Ukrainian war in early 2022.\nWhile the attribution is tentative at best, ReversingLabs pointed out that the activity could also be the work of a copycat threat actor. However, the use of identical payloads and the fact that \"discordpydebug\" was first uploaded in March 2022 strengthen the case for a possible connection to Phoenix Hyena.\n\"The malicious techniques used in this campaign, including a specific type of backdoor implant and the use of Python function wrapping, show that the threat actor behind it is sophisticated and very careful to avoid detection,\" security researcher Karlo Zanki\nsaid\n.\n\"The use of function wrapping and tools like the Global Socket Toolkit show that the threat actors behind it were also looking to establish long-term presence on compromised systems without being noticed.\"\nThe findings also coincide with the discovery of a malicious npm package called \"koishi‑plugin‑pinhaofa\" that installs a data‑exfiltration backdoor in chatbots powered by the\nKoishi\nframework. The package is no longer available for download from npm.\n\"Marketed as a spelling‑autocorrect helper, the plugin scans every message for an eight‑character hexadecimal string,\" security researcher Kirill Boychenko\nsaid\n. \"When it finds one, it forwards the full message, potentially including any embedded secrets or credentials, to a hard-coded QQ account.\"\n\"Eight character hex often represent short Git commit hashes, truncated JWT or API tokens, CRC‑32 checksums, GUID lead segments, or device serial numbers, each of which can unlock wider systems or map internal assets. By harvesting the whole message the threat actor also scoops up any surrounding secrets, passwords, URLs, credentials, tokens, or IDs.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "PowerSchool hacker pleads guilty to student data extortion scheme",
        "Link": "https://www.bleepingcomputer.com/news/security/powerschool-hacker-pleads-guilty-to-student-data-extortion-scheme/",
        "Summary": "A 19-year-old college student from Worcester, Massachusetts, has agreed to plead guilty to a massive cyberattack on PowerSchool that extorted millions of dollars in exchange for not leaking the personal data of millions of students and teachers. [...]",
        "Date": "2025-05-20",
        "Content": "A 19-year-old college student from Worcester, Massachusetts, has agreed to plead guilty to a massive cyberattack on PowerSchool that extorted millions of dollars in exchange for not leaking the personal data of millions of students and teachers.\nAccording to the U.S. Department of Justice, Matthew D. Lane pleaded guilty to four federal charges of one count each of cyber extortion conspiracy, cyber extortion, unauthorized access to protected computers, and aggravated identity theft.\nThe\nDOJ\nand\ncourt documents\nstate that Lane and his conspirators breached a US-based telecommunications company in 2022, where they stole confidential customer information. During this breach, they also gained access to PowerSchool credentials belonging to an employee at the telecommunication company that acted as a contractor for PowerSchool.\nAfter attempting to extort the telecom firm, the DOJ says they conducted an attack on an education company that would pay a ransom.\n\"On or about May 14, 2024, LANE messaged CC-1 that if Victim 1 did not pay the ransom, LANE and CC-1 could sell the Stolen Victim 1 Data. LANE further suggested, 'we need to hack another . . . company that[']ll pay',\" reads the\nDOJ complaint\n.\nWhile the complaint does not explicitly mention PowerSchool, sources told BleepingComputer that they are the education company referred to by the DOJ.\nThe complaint says that the threat actor used the credentials stolen from the PowerSchool contractor to breach the company and steal data for millions of students and faculty in December 2024.\nAs previously reported by BleepingComputer,\nthreat actors breached PowerSchool's support platform\n, PowerSource, and used a maintenance tool to download the school's databases. These databases included the personal information of\n62.4 million students and 9.5 million teachers\nfrom 6,505 school districts in the US, Canada, and other countries.\nThis data consisted of different information depending on the district, including students' and faculty's full names, physical addresses, phone numbers, passwords, parent information, contact details, Social Security numbers, medical data, and grades.\nThe DOJ says that PowerSchool received a ransom demand for approximately $2.85 million in Bitcoin on December 28, 2024. The threat warned that if payment was not made, the stolen data would be leaked \"worldwide.\"\nWhile BleepingComputer previously reported that PowerSchool paid a ransom demand to prevent the leak of data, it is still unclear how much was paid.\nHowever, even after PowerSchool paid the ransom, the threat actors attempted to\nindividually extort impacted school districts\ninto paying further ransoms not to leak student data.\nAccording to\nschool notices\nand\nDataBreaches.net\n, these ransom demands claimed to be from\nShiny Hunters\n, a prolific group of threat actors known for a wide range of breaches, including the\nSnowFlake data theft attacks\nand a\n2022 data breach at AT&T\nthat impacted 109 million people.\nWhile many of the threat actors involved in the SnowFlake and AT&T attacks have been arrested over the past year [\n1\n,\n2\n,\n3\n], it's possible that other members carried out the attacks, or that copycats are attempting to plant a false flag\nIn addition to the PowerSchool breach, Lane also faces charges for the attempt to extort the U.S.-based telecommunications company, where they demanded a $200,000 ransom and made threats against company executives if the ransom was not paid.\nLane has agreed to plead guilty to all four counts and faces a mandatory minimum sentence of two years for identity theft and up to five years on each of the other charges.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nCoinbase data breach exposes customer info and government IDs\nPowerSchool hacker now extorting individual school districts\nLuna Moth extortion hackers pose as IT help desks to breach US firms\nHertz confirms customer info, drivers' licenses stolen in data breach\nGovtech giant Conduent confirms client data stolen in January cyberattack"
    },
    {
        "Title": "Mobile carrier Cellcom confirms cyberattack behind extended outages",
        "Link": "https://www.bleepingcomputer.com/news/security/mobile-carrier-cellcom-confirms-cyberattack-behind-extended-outages/",
        "Summary": "Wisconsin wireless provider Cellcom has confirmed that a cyberattack is responsible for the widespread service outage and disruptions that began on the evening of May 14, 2025. [...]",
        "Date": "2025-05-20",
        "Content": "Wisconsin wireless provider Cellcom has confirmed that a cyberattack is responsible for the widespread service outage and disruptions that began on the evening of May 14, 2025.\nThe incident disrupted voice and SMS services for customers across Wisconsin and Upper Michigan, leaving subscribers unable to make phone calls or send text messages.\nToday, after days of just calling it a technical outage, Cellcom CEO Brighid Riordan has confirmed what was already suspected: that the company suffered a cyberattack.\n\"We experienced a cyber incident. While this is unfortunate, it's not something we were unprepared for,\" reads a\nletter from Cellcom CEO Brighid Riordan\n.\n\"We have protocols and plans in place for exactly this kind of situation. From the start, we've followed those plans — including engaging outside cybersecurity experts, notifying the FBI and Wisconsin officials, and working around the clock to bring systems safely back online.\"\n\"The incident was concentrated on an area of our network separate from where we store sensitive information related to you, our Cellcom/ Nsight family. We have no evidence that personal information related to you, your name, your addresses, your financial information, is impacted by this event.\"\nCellcom initially claimed the disruption was caused by a technical issue, stating that data services, iMessage, RCS messaging, and 911 emergency services remained operational.\nHowever, users became increasingly frustrated with the loss of service and the inability to port their numbers to other carriers due to Cellcom's platforms having issues.\nOn May 19, Cellcom began bringing some of its services back online, including SMS text messaging and making and receiving phone calls to other Cellcom subscribers.\nHowever, the company says that while they can't promise when services will be restored, they are trying to restore full service by the end of the week.\n\"While we would like to provide a timeline for full restoration, we are unable to share exact milestones with complete confidence. Our team continues to build on the progress shared yesterday and our best estimate is that full service will be restored by or before the end of this week,\" reads a\nservice updates page\non Cellcom's site.\nFor Cellcom subscribers having issues recovering services, it is recommended that they enable airplane mode for 10 seconds and then disable it again. If that does not work, subscribers should power down their phones and start them up again to attempt to initiate services.\nYesterday, BleepingComputer contacted Cellcom with questions about the disruption caused by a ransomware attack or another cyber incident, but did not receive replies to our questions.\nCellcom CEO Brighid Riordan also shared a video for subscribers to explain the situation and what they are doing to recover from services.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nKettering Health hit by system-wide outage after ransomware attack\nMarks & Spencer faces $402 million profit hit after cyberattack\nPowerSchool hacker pleads guilty to student data extortion scheme\nArla Foods confirms cyberattack disrupts production, causes delays\nHackers behind UK retail attacks now targeting US companies"
    },
    {
        "Title": "Premium WordPress 'Motors' theme vulnerable to admin takeover attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/premium-wordpress-motors-theme-vulnerable-to-admin-takeover-attacks/",
        "Summary": "A critical privilege escalation vulnerability has been discovered in the premium WordPress theme Motors, which allows unauthenticated attackers to hijack administrator accounts and take complete control of websites. [...]",
        "Date": "2025-05-20",
        "Content": "A critical privilege escalation vulnerability has been discovered in the premium WordPress theme Motors, which allows unauthenticated attackers to hijack administrator accounts and take complete control of websites.\nDeveloped by StylemixThemes, Motors is one of the top-selling automotive themes for the WordPress platform. It is very popular among automotive businesses such as car dealerships, rental services, and used vehicle listing platforms.\nIt has over 22,300 sales on the\nEnvato market\n, with hundreds of user reviews and thousands of comments, indicating a highly active community around it.\nThe flaw, tracked as CVE-2025-4322, was publicly disclosed by Wordfence earlier today and added to the National Vulnerability Database (\nNVD\n).\nIt is a privilege escalation problem impacting all versions of the Motors theme up to and including 5.6.67.\n\"This (vulnerability) is due to the theme not properly validating a user's identity prior to updating their password,\"\nexplains Wordfence\n.\n\"This makes it possible for unauthenticated attackers to change arbitrary user passwords, including those of administrators, and leverage that to gain access to their account.\"\nBy gaining admin-level access, attackers could implant malware, exfiltrate database contents and sensitive member details, or redirect visitors to dangerous sites.\nStylemixThemes\nreleased Motors version 5.6.68, which addresses CVE-2025-4322 on May 14, 2025.\nWordPress themes are central to websites and cannot be temporarily disabled or easily replaced, so upgrading to the latest version as soon as possible is critical.\nThe vendor has a detailed\nonline guide\non updating Motors via the WordPress panel, the Envato API, or manually via FTP.\nIt is important to back up your website before updating theme components to prevent potential data loss.\nAlthough the issue doesn't impact a WordPress plugin active in millions of websites, it still constitutes a significant risk.\nGiven the price of $79 for a regular license and $2,000 for an extended license, Motors is more likely to be deployed in active sites or for those running businesses.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nHackers exploit OttoKit WordPress plugin flaw to add admin accounts\nHackers exploit WordPress plugin auth bypass hours after disclosure\nThe 4 WordPress flaws hackers targeted the most in Q1 2025\nMozilla fixes Firefox zero-days exploited at hacking contest\nGoogle fixes high severity Chrome flaw with public exploit"
    },
    {
        "Title": "VanHelsing ransomware builder leaked on hacking forum",
        "Link": "https://www.bleepingcomputer.com/news/security/vanhelsing-ransomware-builder-leaked-on-hacking-forum/",
        "Summary": "The VanHelsing ransomware-as-a-service operation published the source code for its affiliate panel, data leak blog, and Windows encryptor builder after an old developer tried to sell it on the RAMP cybercrime forum. [...]",
        "Date": "2025-05-20",
        "Content": "The VanHelsing ransomware-as-a-service operation published the source code for its affiliate panel, data leak blog, and Windows encryptor builder after an old developer tried to sell it on the RAMP cybercrime forum.\nVanHelsing is a RaaS operation\nlaunched in March 2025,\npromoting the ability to target Windows, Linux, BSD, ARM, and ESXi systems.\nSince then, the operation has shown some success, with\nRansomware.live\nstating that there are eight known victims for the ransomware gang.\nVanHelsing source code leaked on cybercrime forum\nEarly this morning, a person using the alias 'th30c0der' attempted to sell the source code for the VanHelsing affiliate panel and data leak Tor sites, as well as the builders for the Windows and Linux encryptors, for $10,000.\n\"vanhelsing ransomware source code for sell: include TOR keys + web panel for admin + chat + file server + blog include database everything,\" th30c0der posted to the RAMP forum.\nth30c0der attempting to sell the VanHelsing source code\nAs first reported by\nEmanuele De Lucia\n, the VanHelsing operators decided to beat the seller to punch, releasing the source code themselves and stating that the th30c0der is one of their old developers trying to scam people.\n\"Today we are announcing that we are publishing the old sources codes and will soon come back with the new and improved version of the locker(VanHelsing 2.0),\" the VanHelsing operator posted to RAMP.\nVanHelsin RaaS releases the source code on RAMP\n​​​​​\nHowever, this leaked data is incomplete compared to what the 30c0der says they have, as it does not include the Linux builder or any databases, which would be much more helpful for law enforcement and cybersecurity researchers.\nBleepingComputer has obtained the leaked source code and has confirmed that it contains the legitimate builder for the Windows encryptor and the source code for the affiliate panel and data leak site.\nLeaked source code\nSource: BleepingComputer\nThe builder's source code is somewhat of a mess, with the Visual Studio project files found in the \"Release\" folder, which is typically used to hold compiled binaries and build artifacts.\nWhile complete, using the VanHelsing builder will require some work, as it connects back to the affiliate panel, which was running 31.222.238[.]208, to receive data used for the build process.\ncommon.h header file used by the builder\nSource: BleepingComputer\nHowever, the leak also includes the source code for the affiliate panel, which hosts the api.php endpoint, so threat actors could modify the code or run their own version of this panel to get the builder to work.\nThe archive also contains the source code for the Windows encryptor, which can be used to create a standalone build, the decryptor, and a loader.\nVanHelsing encryptor source code\nSource: BleepingComputer\nThe leaked source code also revealed that the threat actors were attempting to build an MBR locker that would replace the master boot record with a custom bootloader that displays a lock message.\nVanHelsing MBRLocker source code\nSource: BleepingComputer\nThis leak is not the first time a ransomware builder or encryptor source code has been leaked online, which allowed new ransomware groups or individual threat actors to quickly conduct attacks.\nIn June 2021, the\nBabuk ransomware builder was leaked\n, allowing anyone to create encryptors and decryptors for Windows and VMware ESXi. The Babuk leak has become one of the\nmost widely used builders\nto conduct attacks on VMware ESXi servers.\nIn March 2022, when the\nConti ransomware operation suffered a data breach\n, its\nsource code was also leaked online\n. Other threat actors quickly used this source code in their own attacks.\nIn September 2022, the\nLockBit ransomware operation suffered a breach\nwhen an allegedly disgruntled developer leaked the gang's builder. This too has become widely used by other threat actors to this day.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nTexas State Bar warns of data breach after INC ransomware claims attack\nNew VanHelsing ransomware targets Windows, ARM, ESXi systems\nKettering Health hit by system-wide outage after ransomware attack\nService desks are under attack: What can you do about it?\nFake KeePass password manager leads to ESXi ransomware attack"
    },
    {
        "Title": "SK Telecom says malware breach lasted 3 years, impacted 27 million numbers",
        "Link": "https://www.bleepingcomputer.com/news/security/sk-telecom-says-malware-breach-lasted-3-years-impacted-27-million-numbers/",
        "Summary": "SK Telecom says that a recently disclosed cybersecurity incident in April, first occurred all the way back in 2022, ultimately exposing the USIM data of 27 million subscribers. [...]",
        "Date": "2025-05-20",
        "Content": "SK Telecom says that a recently disclosed cybersecurity incident in April, first occurred all the way back in 2022, ultimately exposing the USIM data of 27 million subscribers.\nSK Telecom is the largest mobile network operator in South Korea, holding roughly half of the national market.\nOn April 19, 2025, the company\ndetected malware\non its networks and responded by isolating the equipment suspected of being hacked.\nThis breach allowed attackers to steal data that included IMSI, USIM authentication keys, network usage data, and SMS/contacts stored in the SIM.\nThis exposure increased the risk of SIM-swapping attacks, so the company decided to issue\nSIM replacements for all subscribers\nwhile strengthening security measures to prevent unauthorized number porting actions.\nOn May 8, 2025, a government committee investigating the incident declared that the malware infection\ncompromised 25 data types\n.\nAt the time, SK Telecom announced it would stop accepting new subscribers as it struggled to manage the fallout.\nAn update\nSK Telecom published yesterday\ninforms that they will soon notify 26.95 million customers that they are impacted by the malware infection, which exposed their sensitive data.\nThe telecom firm mentions that it identified 25 distinct malware types in 23 compromised servers, so the extent of the breach is far more extensive than initially anticipated.\nSimultaneously, a joint public-private investigation team examining SK Telecom's 30,000 Linux servers\nreleased a report\nthe initial web shell infection was\non June 15, 2022\n.\nThis means that malware went undetected in the company's systems for nearly three years, during which the attackers introduced several payloads across 23 servers.\nThat investigation claims that 15 of the 23 infected servers contained personal customer information, including 291,831 IMEI numbers, though SK Telecom explicitly denied this in its latest press release.\nThe investigation team also noted that SK Telecom started logging activity on the impacted servers on December 3, 2024. Therefore, any data exfiltration that may have occurred from June 2022 until then would not have been detected.\nSK Telecom continues to support its subscribers with SIM card replacements and elevated security measures activated automatically to protect their accounts, reporting that any malicious attempts launched against them are being effectively blocked.\n\"We are technically ensuring that illegal USIM and device changes are completely blocked. However, if any damage does occur despite these efforts, we will take 100% responsibility,\" announced SK Telecom.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nSK Telecom warns customer USIM data exposed in malware attack\nSK Telecom cyberattack: Free SIM replacements for 25 million customers\nFashion giant Dior discloses cyberattack, warns of data breach\nLumma infostealer malware operation disrupted, 2,300 domains seized\nO2 UK patches bug leaking mobile user location from call metadata"
    },
    {
        "Title": "Hazy Hawk gang exploits DNS misconfigs to hijack trusted domains",
        "Link": "https://www.bleepingcomputer.com/news/security/hazy-hawk-gang-exploits-dns-misconfigs-to-hijack-trusted-domains/",
        "Summary": "A threat actor named 'Hazy Hawk' has been using DNS CNAME hijacking to hijack abandoned cloud endpoints of domains belonging to trusted organizations and incorporate them in large-scale scam delivery and traffic distribution systems (TDS). [...]",
        "Date": "2025-05-20",
        "Content": "A threat actor tracked as 'Hazy Hawk' is hijacking forgotten DNS CNAME records pointing to abandoned cloud services, taking over trusted subdomains of governments, universities, and Fortune 500 companies to distribute scams, fake apps, and malicious ads.\nAccording to\nInfoblox researchers\n, Hazy Hawk first scans for domains with CNAME records pointing to abandoned cloud endpoints, which they determine via passive DNS data validation.\nNext, they register a new cloud resource with the same name as the one in the abandoned CNAME, causing the original domain's subdomain to resolve to the threat actor's new cloud-hosted site.\nUsing this technique, the threat actors hijacked multiple domains to cloak malicious activities, host scam content, or use them as redirection hubs for scam operations.\nSome notable examples of the hijacked domains include:\ncdc.gov\n– U.S. Centers for Disease Control and Prevention\nhoneywell.com\n– Multinational conglomerate\nberkeley.edu\n– University of California, Berkeley\nmichelin.co.uk\n– Michelin Tires UK\ney.com, pwc.com, deloitte.com\n– Global \"Big Four\" consulting firms\nted.com\n– Famous nonprofit media organization (TED Talks)\nhealth.gov.au\n– Australian Department of Health\nunicef.org\n– United Nations Children's Fund\nnyu.edu\n– New York University\nunilever.com\n– Global Consumer Goods Company\nca.gov\n– California State Government\nThe complete list of compromised domains can be found in the Infoblox report.\nOnce the threat actor gains control of a subdomain, they generate hundreds of malicious URLs under it, which appear legitimate in search engines due to the parent domain's high trust score.\nVictims clicking on the URLs are redirected through layers of domains and TDS infrastructure that profile them based on their device type, IP address, VPN use, etc., to qualify victims.\nOverview of the Hazy Hawk attack\nSource: Infoblox\nInfoblox's report says the sites are used for tech support scams, bogus antivirus alerts, fake streaming/porn sites, and phishing pages.\nUsers tricked into allowing browser push notifications get persistent alerts even after they leave the scam sites, which can generate significant revenue for Hazy Hawk.\nPush notification examples from the campaign\nSource: Infoblox\nThe same researchers reported previously about another threat actor, '\nSavvy Seahorse\n,' who also abused CNAME records to build an atypical TDS that redirected users to fake investment platforms.\nIt's easy to overlook CNAME records, so they are prone to stealthy abuse, and it appears that an increasing number of threat actors realize this and attempt to take advantage.\nIn the case of Hazy Hawk, the operation's success also relies on organizations failing to delete DNS records after cloud services are decommissioned, which permits attackers to replicate the original resource name without authentication.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nCISA warns of Fast Flux DNS evasion used by cybercrime gangs"
    },
    {
        "Title": "Fake Kling AI Malvertisements Lure Victims With False Promises",
        "Link": "https://www.darkreading.com/threat-intelligence/fake-kling-ai-malvertisements-lure-victims",
        "Summary": "Researchers noted that they found several similar websites, two of which are still operating and require the same kind of behavior on behalf of the victim.",
        "Date": "2025-05-20",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/fake-kling-ai-malvertisements-lure-victims"
    },
    {
        "Title": "Virgin Media 02 Vuln Exposes Call Recipient Location",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/virgin-media-02-call-recipient-location",
        "Summary": "A hacker exploiting the security flaw in the mobile provider's network could have potentially located a call recipient with accuracy of up to 100 square meters.",
        "Date": "2025-05-20",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/virgin-media-02-call-recipient-location"
    },
    {
        "Title": "Tenable Adds Third-Party Connectors to Exposure Management Platform",
        "Link": "https://www.darkreading.com/cyber-risk/tenable-third-party-connectors-exposure-management",
        "Summary": "Tenable One now pulls in data from AWS, Microsoft, and competitors to provide a holistic security view of an organization's attack surface.",
        "Date": "2025-05-20",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/tenable-third-party-connectors-exposure-management"
    },
    {
        "Title": "Regeneron Pledges Privacy Protection in $256M Bid for 23andMe",
        "Link": "https://www.darkreading.com/data-privacy/regeneron-pledge-privacy-23andme-acquisition",
        "Summary": "Regeneron's planned acquisition of 23andMe raises significant privacy concerns as experts warn about the lack of comprehensive federal regulations governing the transfer of genetic information.",
        "Date": "2025-05-20",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/data-privacy/regeneron-pledge-privacy-23andme-acquisition"
    },
    {
        "Title": "Bumblebee Malware Takes Flight via Trojanized VMware Utility",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/bumblebee-malware-trojanized-vmware-utility",
        "Summary": "An employee inadvertently downloaded a malicious version of the legitimate RVTools utility, which launched an investigation into an attempted supply chain attack aimed at delivering the recently revived initial-access loader.",
        "Date": "2025-05-20",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/bumblebee-malware-trojanized-vmware-utility"
    },
    {
        "Title": "Large Retailers Land in Scattered Spider's Ransomware Web",
        "Link": "https://www.darkreading.com/threat-intelligence/large-retailers-scattered-spider-ransomware-web",
        "Summary": "The threat group games IT help desks to gain entry into retailer networks, and signs show it has shifted its attention from the UK to US targets.",
        "Date": "2025-05-20",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/large-retailers-scattered-spider-ransomware-web"
    },
    {
        "Title": "'Hazy Hawk' Cybercrime Gang Swoops In for Cloud Resources",
        "Link": "https://www.darkreading.com/cloud-security/hazy-hawk-cybercrime-gang-cloud-resources",
        "Summary": "Since December 2023, the threat group has preyed on domains belonging to the US Centers for Disease Control and Prevention (CDC) and numerous other reputable organizations worldwide to redirect users to malicious sites.",
        "Date": "2025-05-20",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/hazy-hawk-cybercrime-gang-cloud-resources"
    },
    {
        "Title": "Why Rigid Security Programs Keep Failing",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/rigid-security-programs-fail",
        "Summary": "Organizations that stay ahead of attacks won't be the most compliant ones — they'll be the ones most honest about what actually works.",
        "Date": "2025-05-20",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/rigid-security-programs-fail"
    },
    {
        "Title": "Novel Phishing Attack Combines AES With Poisoned npm Packages",
        "Link": "https://www.darkreading.com/threat-intelligence/novel-phishing-attack-combines-aes-npm-packages",
        "Summary": "Researchers discovered a phishing attack in the wild that takes multiple well-tread technologies like open source packages and AES encryption and combines them.",
        "Date": "2025-05-20",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/novel-phishing-attack-combines-aes-npm-packages"
    },
    {
        "Title": "KrebsOnSecurity Hit With Near-Record 6.3 Tbps DDoS",
        "Link": "https://krebsonsecurity.com/2025/05/krebsonsecurity-hit-with-near-record-6-3-tbps-ddos/",
        "Summary": "KrebsOnSecurity last week was hit by a near record distributed denial-of-service (DDoS) attack that clocked in at more than 6.3 terabits of data per second (a terabit is one trillion bits of data). The brief attack appears to have been a test run for a massive new Internet of Things (IoT) botnet capable of launching crippling digital assaults that few web destinations can withstand. Read on for more about the botnet, the attack, and the apparent creator of this global menace.",
        "Date": "2025-05-20",
        "Content": "KrebsOnSecurity last week was hit by a near record distributed denial-of-service (DDoS) attack that clocked in at more than 6.3 terabits of data per second (a terabit is one trillion bits of data). The brief attack appears to have been a test run for a massive new Internet of Things (IoT) botnet capable of launching crippling digital assaults that few web destinations can withstand. Read on for more about the botnet, the attack, and the apparent creator of this global menace.\n\nFor reference, the 6.3 Tbps attack last week was ten times the size of the assault launched against this site in 2016 by the Mirai IoT botnet, which held KrebsOnSecurity offline for nearly four days. The 2016 assault was so large that Akamai – which was providing pro-bono DDoS protection for KrebsOnSecurity at the time — asked me to leave their service because the attack was causing problems for their paying customers.\nSince the Mirai attack, KrebsOnSecurity.com has been behind the protection of Project Shield, a free DDoS defense service that Google provides to websites offering news, human rights, and election-related content. Google Security Engineer Damian Menscher told KrebsOnSecurity the May 12 attack was the largest Google has ever handled. In terms of sheer size, it is second only to a very similar attack that Cloudflare mitigated and wrote about in April.\nAfter comparing notes with Cloudflare, Menscher said the botnet that launched both attacks bears the fingerprints of Aisuru, a digital siege machine that first surfaced less than a year ago. Menscher said the attack on KrebsOnSecurity lasted less than a minute, hurling large UDP data packets at random ports at a rate of approximately 585 million data packets per second.\n“It was the type of attack normally designed to overwhelm network links,” Menscher said, referring to the throughput connections between and among various Internet service providers (ISPs). “For most companies, this size of attack would kill them.”\nA graph depicting the 6.5 Tbps attack mitigated by Cloudflare in April 2025. Image: Cloudflare.\nThe Aisuru botnet comprises a globally-dispersed collection of hacked IoT devices, including routers, digital video recorders and other systems that are commandeered via default passwords or software vulnerabilities. As documented by researchers at QiAnXin XLab, the botnet was first identified in an August 2024 attack on a large gaming platform.\nAisuru reportedly went quiet after that exposure, only to reappear in November with even more firepower and software exploits. In a January 2025 report, XLab found the new and improved Aisuru (a.k.a. “Airashi“) had incorporated a previously unknown zero-day vulnerability in Cambium Networks cnPilot routers.\nThe people behind the Aisuru botnet have been peddling access to their DDoS machine in public Telegram chat channels that are closely monitored by multiple security firms. In August 2024, the botnet was rented out in subscription tiers ranging from $150 per day to $600 per week, offering attacks of up to two terabits per second.\n“You may not attack any measurement walls, healthcare facilities, schools or government sites,” read a notice posted on Telegram by the Aisuru botnet owners in August 2024.\nInterested parties were told to contact the Telegram handle “@yfork” to purchase a subscription. The account @yfork previously used the nickname “Forky,” an identity that has been posting to public DDoS-focused Telegram channels since 2021.\nAccording to the FBI, Forky’s DDoS-for-hire domains have been seized in multiple law enforcement operations over the years. Last year, Forky said on Telegram he was selling the domain stresser[.]best, which saw its servers seized by the FBI in 2022 as part of an ongoing international law enforcement effort aimed at diminishing the supply of and demand for DDoS-for-hire services.\n“The operator of this service, who calls himself ‘Forky,’ operates a Telegram channel to advertise features and communicate with current and prospective DDoS customers,” reads an FBI seizure warrant (PDF) issued for stresser[.]best. The FBI warrant stated that on the same day the seizures were announced, Forky posted a link to a story on this blog that detailed the domain seizure operation, adding the comment, “We are buying our new domains right now.”\nA screenshot from the FBI’s seizure warrant for Forky’s DDoS-for-hire domains shows Forky announcing the resurrection of their service at new domains.\nApproximately ten hours later, Forky posted again, including a screenshot of the stresser[.]best user dashboard, instructing customers to use their saved passwords for the old website on the new one.\nA review of Forky’s posts to public Telegram channels — as indexed by the cyber intelligence firms Unit 221B and Flashpoint — reveals a 21-year-old individual who claims to reside in Brazil [full disclosure: Flashpoint is currently an advertiser on this blog].\nSince late 2022, Forky’s posts have frequently promoted a DDoS mitigation company and ISP that he operates called botshield[.]io. The Botshield website is connected to a business entity registered in the United Kingdom called Botshield LTD, which lists a 21-year-old woman from Sao Paulo, Brazil as the director. Internet routing records indicate Botshield (AS213613) currently controls several hundred Internet addresses that were allocated to the company earlier this year.\nDomaintools.com reports that botshield[.]io was registered in July 2022 to a Kaike Southier Leite in Sao Paulo. A LinkedIn profile by the same name says this individual is a network specialist from Brazil who works in “the planning and implementation of robust network infrastructures, with a focus on security, DDoS mitigation, colocation and cloud server services.”\nImage: Jaclyn Vernace / Shutterstock.com.\nIn his posts to public Telegram chat channels, Forky has hardly attempted to conceal his whereabouts or identity. In countless chat conversations indexed by Unit 221B, Forky could be seen talking about everyday life in Brazil, often remarking on the extremely low or high prices in Brazil for a range of goods, from computer and networking gear to narcotics and food.\nReached via Telegram, Forky claimed he was “not involved in this type of illegal actions for years now,” and that the project had been taken over by other unspecified developers. Forky initially told KrebsOnSecurity he had been out of the botnet scene for years, only to concede this wasn’t true when presented with public posts on Telegram from late last year that clearly showed otherwise.\nForky denied being involved in the attack on KrebsOnSecurity, but acknowledged that he helped to develop and market the Aisuru botnet. Forky claims he is now merely a staff member for the Aisuru botnet team, and that he stopped running the botnet roughly two months ago after starting a family. Forky also said the woman named as director of Botshield is related to him.\nForky offered equivocal, evasive responses to a number of questions about the Aisuru botnet and his business endeavors. But on one point he was crystal clear:\n“I have zero fear about you, the FBI, or Interpol,” Forky said, asserting that he is now almost entirely focused on their hosting business — Botshield.\nForky declined to discuss the makeup of his ISP’s clientele, or to clarify whether Botshield was more of a hosting provider or a DDoS mitigation firm. However, Forky has posted on Telegram about Botshield successfully mitigating large DDoS attacks launched against other DDoS-for-hire services.\nDomainTools finds the same Sao Paulo street address in the registration records for botshield[.]io was used to register several other domains, including cant-mitigate[.]us. The email address in the WHOIS records for that domain is forkcontato@gmail.com, which DomainTools says was used to register the domain for the now-defunct DDoS-for-hire service stresser[.]us, one of the domains seized in the FBI’s 2023 crackdown.\nOn May 8, 2023, the U.S. Department of Justice announced the seizure of stresser[.]us, along with a dozen other domains offering DDoS services. The DOJ said ten of the 13 domains were reincarnations of services that were seized during a prior sweep in December, which targeted 48 top stresser services (also known as “booters”).\nForky claimed he could find out who attacked my site with Aisuru. But when pressed a day later on the question, Forky said he’d come up empty-handed.\n“I tried to ask around, all the big guys are not retarded enough to attack you,” Forky explained in an interview on Telegram. “I didn’t have anything to do with it. But you are welcome to write the story and try to put the blame on me.”\nThe 6.3 Tbps attack last week caused no visible disruption to this site, in part because it was so brief — lasting approximately 45 seconds. DDoS attacks of such magnitude and brevity typically are produced when botnet operators wish to test or demonstrate their firepower for the benefit of potential buyers. Indeed, Google’s Menscher said it is likely that both the May 12 attack and the slightly larger 6.5 Tbps attack against Cloudflare last month were simply tests of the same botnet’s capabilities.\nIn many ways, the threat posed by the Aisuru/Airashi botnet is reminiscent of Mirai, an innovative IoT malware strain that emerged in the summer of 2016 and successfully out-competed virtually all other IoT malware strains in existence at the time.\nAs first revealed by KrebsOnSecurity in January 2017, the Mirai authors were two U.S. men who co-ran a DDoS mitigation service — even as they were selling far more lucrative DDoS-for-hire services using the most powerful botnet on the planet.\nLess than a week after the Mirai botnet was used in a days-long DDoS against KrebsOnSecurity, the Mirai authors published the source code to their botnet so that they would not be the only ones in possession of it in the event of their arrest by federal investigators.\nIronically, the leaking of the Mirai source is precisely what led to the eventual unmasking and arrest of the Mirai authors, who went on to serve probation sentences that required them to consult with FBI investigators on DDoS investigations. But that leak also rapidly led to the creation of dozens of Mirai botnet clones, many of which were harnessed to fuel their own powerful DDoS-for-hire services.\nMenscher told KrebsOnSecurity that as counterintuitive as it may sound, the Internet as a whole would probably be better off if the source code for Aisuru became public knowledge. After all, he said, the people behind Aisuru are in constant competition with other IoT botnet operators who are all striving to commandeer a finite number of vulnerable IoT devices globally.\nSuch a development would almost certainly cause a proliferation of Aisuru botnet clones, he said, but at least then the overall firepower from each individual botnet would be greatly diminished — or at least within range of the mitigation capabilities of most DDoS protection providers.\nBarring a source code leak, Menscher said, it would be nice if someone published the full list of software exploits being used by the Aisuru operators to grow their botnet so quickly.\n“Part of the reason Mirai was so dangerous was that it effectively took out competing botnets,” he said. “This attack somehow managed to compromise all these boxes that nobody else knows about. Ideally, we’d want to see that fragmented out, so that no [individual botnet operator] controls too much.”\n\r\n         This entry was posted on Tuesday 20th of May 2025 05:30 PM \r\n         \nBrian, you must have pissed off quite a few ruskies there.\nWouldn’t surprise me if Akamai, Forky teamed up with DOGE.\nYou know, the “Diabolical Oligarchy Grifting Efficiently” and had something to do with the attack on Krebs. I mean, given all the articles written recently it would make sense. Also tie in the current “Department of MAGA”. Oh, and the decision maker, Laura Loomer….\nExactly what I was thinking, that Forky is one of or a group of the MUSKrats .  Connect the dots:  Brian is fired from DHS CISA after proving the election had no fraud, becomes an Enemy of the Trump #45,  Jen Easterly quits on Trump #47 Inauguration day, DOGE is formed with Musk and his teen/twenty something gamer rats to hack into all the government databases, Musk cuts out significant CISA and Air Force cyber resources, begins work on the enemies list, leveraging the data stolen from government servers.\nI think all of that can be fact checked with forensics if someone has access, and with minimal oversight on the government servers, a white hat ethical hacker should be able to validate, provided the backpacks full of Muskrat removed US Property Asset laptops can be located.\nIt’s funny that you mention DOGE, because I meant to mention in the story that Forky commented multiple times about how Botshield itself received ddos protection from a company called Path Networks, which has a history of hiring “reformed” hackers. Among their many questionable hires was Mr. Big Balls himself.\nChris Krebs who Trump fired from CISA, is no relation to Brian Krebs here.\nhttps://x.com/briankrebs/status/1328859929214595072\nWe all may be saying Where’d You Go, Bernadette if you’re correct (certainly not right).\nBrian, you must be doing a lot of things right to make the bad guys want to bring down your site.  Keep it up!  We appreciate and look forward to your content.\nI second this.\nCongrats on keeping the site up despite the attack.  Pardon ignorance but what are “measurement walls”?\n“You may not attack any measurement walls, healthcare facilities, schools or government sites,” read a notice posted on Telegram by the Aisuru botnet owners in August 2024.\nI believe he’s referring to sites that try to measure and rank the bigger ddos attacks. Some of the people hanging out in these DDoS channels on Telegram spend a lot of time doing small attacks to get their botnet to the top of the leaderboard. Some I guess try to spoil their fun by attacking the leaderboard itself.\nI’m pretty sure it refers to devices that measure water levels on rivers and other relevant places.\nWe had a DNS attack once that nobody seemed to have notice.  It was about three hours on one Christmas morning years ago and people weren’t streaming their tv shows yet.  The only reason I even noticed was from checking the logs.\nWe weren’t so lucky the next time.  That one lasted for three or four days and everyone noticed.\nWhat’s chilling is that now CISA has been gutted along with much of our experienced intelligence staff.  Hackers must be jumping for joy as the US rolls over belly up.  Reportedly people in the NSA have been told to not give intelligence reports that will upset the President; leadership is either incompetent or malicious; and, people I talk to are too afraid to speak up for fear of loss of their job or even worse.  \nAs far as DOGE involvement, we’ve already seen they are predominately entitled sociopaths with no sense of patriotism or decency.\nWhile the article is another clear example of criminals doing their thing, and Brian doing the right thing; the comments give me the real chill. And I am not a US citizen. I wish you guys luck.\nIt’s irrelevant, I’m sure, but I find it curious that both Aisuru (which means “to love”) and Airashi (which actually should be spelled airashii which means “lovable”) are Japanese, as is Mirai (which means “future”).\nI agree with the comments posted above by William Cochran and martijn. Brian, I’m troubled that you were targeted, yet again, by miscreants. You’re making a big impact by the work you do but wish it hadn’t become another example proving the old adage “No good deed goes unpunished.”  Wishing you well. Please stay safe.\nI imagine you’re well aware this puts you in a twisted situation where they get to both “demonstrate their firepower for the benefit of potential buyers” and use this article as a salespitch going forward. Tough spot.\nCorrect me if I’m wrong.\nI’m sure I’m not the only one who quickly scrolled, saw the Cloudflare graphic, and breathed a little easier 🙂\nKeep poking that bear (from a safe distance).  Continue to shed the light.  It’s very much needed under this administration.\nWAIT, misread — but glad that you are adequatly protected.\nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "Adidas Investigates Customer Data Breaches in Turkey and Korea",
        "Link": "https://dailydarkweb.net/adidas-investigates-customer-data-breaches-in-turkey-and-korea/",
        "Summary": "<p>Global sportswear giant Adidas is currently managing two separate customer data security incidents, impacting its operations in Turkey and Korea. Both breaches reportedly exposed similar sets of personal customer information. Adidas Turkey recently confirmed unauthorized access to its systems, leading to the exposure of customer details. The company has contacted individuals whose data may have [&#8230;]</p>\n<p>The post <a href=\"https://dailydarkweb.net/adidas-investigates-customer-data-breaches-in-turkey-and-korea/\">Adidas Investigates Customer Data Breaches in Turkey and Korea</a> appeared first on <a href=\"https://dailydarkweb.net\">Daily Dark Web</a>.</p>",
        "Date": "2025-05-20",
        "Content": "Global sportswear giant Adidas is currently managing two separate customer data security incidents, impacting its operations in Turkey and Korea. Both breaches reportedly exposed similar sets of personal customer information.\nAdidas Turkey recently confirmed unauthorized access to its systems, leading to the exposure of customer details. The company has contacted individuals whose data may have been compromised. Reports indicate that personal information such as names, email addresses, phone numbers, and dates of birth were affected.\nSimilarly, on May 16th, Adidas Korea announced a security breach that compromised the personal information of customers who had contacted their service centers. The exposed data in Korea included customer names, email addresses, phone numbers, and in some instances, birthdates and physical addresses. This incident in Korea was attributed to unauthorized access gained through a third-party customer service provider.\nIn both the Turkish and Korean cases, Adidas has stated that sensitive financial information, including passwords and payment-related details, was not compromised.\nAdidas Korea has completed notifications to all affected customers in the region and is collaborating with information security specialists to conduct a thorough investigation. The company has also reported the incident to relevant Korean authorities and is implementing additional security measures.\nThese events follow a recent similar data security issue faced by luxury brand Dior in Korea, where customer information, including purchase history, was accessed without authorization.\nCustomers affected by these breaches are advised to be vigilant against potential phishing attempts and monitor their accounts for any unusual activity. Cybersecurity experts warn that stolen personal information can be exploited for identity theft and targeted attacks.\nAdidas is investigating whether the two incidents are linked.\nTags:\nAdidas\ncustomer-data\nCyberSecurity\ndata-breach\nidentity theft\nKorea\nPersonal Information\nphishing\nsecurity incident\nTurkey"
    },
    {
        "Title": "Real Estate Giant Landmark Properties Allegedly Hit by Morpheus Ransomware",
        "Link": "https://dailydarkweb.net/real-estate-giant-landmark-properties-allegedly-hit-by-morpheus-ransomware/",
        "Summary": "<p>Morpheus, a known ransomware group, has allegedly targeted Landmark Properties, a prominent real estate firm with a reported revenue of $1.5 billion. The group claims to have exfiltrated a massive 1.2 terabytes of data from the company&#8217;s systems. Landmark Properties specializes in development, construction, management, investment, and consulting for high-quality residential communities. Morpheus alleges that [&#8230;]</p>\n<p>The post <a href=\"https://dailydarkweb.net/real-estate-giant-landmark-properties-allegedly-hit-by-morpheus-ransomware/\">Real Estate Giant Landmark Properties Allegedly Hit by Morpheus Ransomware</a> appeared first on <a href=\"https://dailydarkweb.net\">Daily Dark Web</a>.</p>",
        "Date": "2025-05-20",
        "Content": "Morpheus, a known ransomware group, has allegedly targeted Landmark Properties, a prominent real estate firm with a reported revenue of $1.5 billion. The group claims to have exfiltrated a massive 1.2 terabytes of data from the company’s systems.\nLandmark Properties specializes in development, construction, management, investment, and consulting for high-quality residential communities. Morpheus alleges that the stolen data includes a wide array of sensitive information, such as:\nFinancial Documents\nAccounting records\nDevelopment plans\nMarketing materials\nProperty details\nConstruction data\nInformation on active deals\nHuman Resources data\nThis alleged breach could have significant implications for Landmark Properties, potentially exposing proprietary business information and sensitive personal data. The ransomware group is reportedly offering the extracted data for sale, with further details available through direct contact with their administrator.\nThis incident serves as a stark reminder of the persistent and evolving threats posed by ransomware groups to organizations across all sectors.\nTags:\ncyberattack\nCyberSecurity\ndata-breach\nLandmark Properties\nMorpheus\nransomware\nreal estate"
    },
    {
        "Title": "Alleged Data Breach Exposes Millions of Social Security Administration Records",
        "Link": "https://dailydarkweb.net/alleged-data-breach-exposes-millions-of-social-security-administration-records/",
        "Summary": "<p>A user on a prominent underground forum has allegedly posted a listing offering a massive dataset purportedly belonging to ssa.gov. The post claims to contain 21 million records in CSV format, with a stated validity period from December 21, 2024, to December 3, 2025. The alleged data includes sensitive personal information, specifically citing fields such [&#8230;]</p>\n<p>The post <a href=\"https://dailydarkweb.net/alleged-data-breach-exposes-millions-of-social-security-administration-records/\">Alleged Data Breach Exposes Millions of Social Security Administration Records</a> appeared first on <a href=\"https://dailydarkweb.net\">Daily Dark Web</a>.</p>",
        "Date": "2025-05-20",
        "Content": "A user on a prominent underground forum has allegedly posted a listing offering a massive dataset purportedly belonging to ssa.gov. The post claims to contain 21 million records in CSV format, with a stated validity period from December 21, 2024, to December 3, 2025.\nThe alleged data includes sensitive personal information, specifically citing fields such as first name, last name, address, city, state, zip code, date of birth, Social Security Number (SSN), driver’s license number, phone number, cell number, bank name, IBN bank details, and bank account information. The authenticity of the data and the claims made in the forum post have not been independently verified.\nTags:\nCSV\nCyberSecurity\ndark web\ndata-breach\nPersonal Data\nSocial Security Administration\nSSA"
    },
    {
        "Title": "Alleged Leak of 62 Million Chinese Apple iOS User Records Surfaces",
        "Link": "https://dailydarkweb.net/alleged-leak-of-62-million-chinese-apple-ios-user-records-surfaces/",
        "Summary": "<p>A substantial database, allegedly containing 62 million records of Chinese Apple iOS users, has reportedly been leaked. The data, said to have been collected from mobile phone applications, was made public in February 2025. The compromised information allegedly includes sensitive details such as Name, ID card number, Gender, Birthday Year, Birthday, Mobile phone number, Operator, [&#8230;]</p>\n<p>The post <a href=\"https://dailydarkweb.net/alleged-leak-of-62-million-chinese-apple-ios-user-records-surfaces/\">Alleged Leak of 62 Million Chinese Apple iOS User Records Surfaces</a> appeared first on <a href=\"https://dailydarkweb.net\">Daily Dark Web</a>.</p>",
        "Date": "2025-05-20",
        "Content": "A substantial database, allegedly containing 62 million records of Chinese Apple iOS users, has reportedly been leaked. The data, said to have been collected from mobile phone applications, was made public in February 2025.\nThe compromised information allegedly includes sensitive details such as Name, ID card number, Gender, Birthday Year, Birthday, Mobile phone number, Operator, Province, and City. Samples provided indicate a wide range of personal identifiers from various regions across China and different mobile operators.\nThis alleged leak poses a significant privacy risk to the affected individuals, potentially exposing them to identity theft, phishing attempts, and other malicious activities. The source of the leak and the veracity of the claims are currently under investigation.\nTags:\nApple iOS\nChina\nCyberSecurity\ndata-breach\ndata-leak\nmobile security\nPrivacy"
    },
    {
        "Title": "Allegations Emerge of a Massive 1.2B Facebook Data Leak on the Dark Web",
        "Link": "https://dailydarkweb.net/alleged-new-facebook-database-breach-surfaces-on-dark-web/",
        "Summary": "<p>Reports have surfaced on a dark web forum concerning an alleged new database containing 1.2 billion Facebook user records. The individual posting the information claims to have acquired this data by &#8220;abusing one of Facebook&#8217;s API.&#8221; To substantiate the claim, a sample of 100,000 records has been made available for review, with the uploader asserting [&#8230;]</p>\n<p>The post <a href=\"https://dailydarkweb.net/alleged-new-facebook-database-breach-surfaces-on-dark-web/\">Allegations Emerge of a Massive 1.2B Facebook Data Leak on the Dark Web</a> appeared first on <a href=\"https://dailydarkweb.net\">Daily Dark Web</a>.</p>",
        "Date": "2025-05-20",
        "Content": "Reports have surfaced on a dark web forum concerning an alleged new database containing 1.2 billion Facebook user records. The individual posting the information claims to have acquired this data by “abusing one of Facebook’s API.”\nTo substantiate the claim, a sample of 100,000 records has been made available for review, with the uploader asserting its novelty and urging comparison with prior data breaches. The full database is reportedly for sale, with instructions provided for prospective buyers. The structure of the disclosed sample data suggests personal information such as uid, name, email, username, mobile_phone, location, birthday, and gender may be compromised.\nWhile these claims are unverified, they highlight persistent digital risks. Users are urged to enhance their online security, employing strong, unique passwords and multi-factor authentication to protect their data.\nTags:\nalleged leak\nAPI abuse\nCyberSecurity\ndark web\ndata security\ndata-breach\nFacebook"
    }
]