[
    {
        "Title": "Google Pays $1.375 Billion to Texas Over Unauthorized Tracking and Biometric Data Collection",
        "Link": "https://thehackernews.com/2025/05/google-pays-1375-billion-to-texas-over.html",
        "Summary": "Google has agreed to pay the U.S. state of Texas nearly $1.4 billion to settle two lawsuits that accused the company of tracking users' personal location and maintaining their facial recognition data without consent.\nThe $1.375 billion payment dwarfs the fines the tech giant has paid to settle similar lawsuits brought by other U.S. states. In November 2022, it paid $391 million to a group of 40",
        "Date": "2025-05-10",
        "Content": "Google has agreed to pay the U.S. state of Texas nearly $1.4 billion to settle two lawsuits that accused the company of tracking users' personal location and maintaining their facial recognition data without consent.\nThe $1.375 billion payment dwarfs the fines the tech giant has paid to settle similar lawsuits brought by other U.S. states. In November 2022, it paid\n$391 million\nto a group of 40 states. In January 2023, it paid\n$29.5 million\nto Indiana and Washington. Later that September, it forked out another\n$93 million\nto settle with California.\nThe case, originally filed in 2022, related to unlawful tracking and collection of user data, regarding\ngeolocation\n,\nincognito searches\n, and\nbiometric data\n, tracking users' whereabouts even when the Location History setting was disabled and collecting the biometric data without informed consent.\n\"For years, Google secretly tracked people's movements, private searches, and even their voiceprints and facial geometry through their products and services,\" Texas Attorney General Ken Paxton\nsaid\nin a statement.\n\"This $1.375 billion settlement is a major win for Texans' privacy and tells companies that they will pay for abusing our trust.\"\nLast year, Google\nannounced\nplans to store Maps Timeline data locally on users' devices instead of their Google accounts. The company has also rolled out other privacy controls that allow users to auto-delete location information when the Location History setting is enabled.\nThe payment also rivals a\n$1.4 billion fine\nthat Meta paid Texas to settle a lawsuit over allegations that it illegally collected the biometric data of millions of users without their permission.\nThe development comes at a time when Google is the\nsubject\nof intense regulatory scrutiny on both sides of the Atlantic, facing calls to break up parts of its business to satisfy antitrust concerns.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Germany Shuts Down eXch Over $1.9B Laundering, Seizes €34M in Crypto and 8TB of Data",
        "Link": "https://thehackernews.com/2025/05/germany-shuts-down-exch-over-19b.html",
        "Summary": "Germany's Federal Criminal Police Office (aka Bundeskriminalamt or BKA) has seized the online infrastructure and shutdown linked to the eXch cryptocurrency exchange over allegations of money laundering and operating a criminal trading platform.\nThe operation was carried out on April 30, 2025, authorities said, adding they also confiscated 8 terabytes worth of data and cryptocurrency assets",
        "Date": "2025-05-10",
        "Content": "Germany's Federal Criminal Police Office (aka Bundeskriminalamt or BKA) has seized the online infrastructure and shutdown linked to the\neXch cryptocurrency exchange\nover allegations of money laundering and operating a criminal trading platform.\nThe operation was carried out on April 30, 2025, authorities said, adding they also confiscated 8 terabytes worth of data and cryptocurrency assets worth €34 million ($38.25 million) in Bitcoin, Ether, Litecoin, and Dash.\nAccording to the BKA, eXch[.]cx, existed since 2014 and offered cryptocurrency swapping services, allowing its users to exchange digital assets. It was available both on the clearnet and the dark web.\neXch \"specifically advertised on platforms of the criminal underground economy (UE) that it did not implement any anti-money laundering measures,\" the BKA\nsaid\nin a statement.\n\"Users were neither required to identify themselves to the service, nor was user data stored there. Crypto swapping via eXch was therefore particularly suitable for concealing financial flows.\"\nCryptocurrency assets worth an estimated $1.9 billion are estimated to have been transferred using the service since its launch. This also includes a portion of the illicit proceeds gained by North Korean threat actors following the\nBybit hack\nearlier this year.\nThe development comes as eXch announced its own plans on April 17 to cease their operations effective this month, prompting the authorities to secure \"numerous pieces of evidence and leads.\"\nIn a message posted on the BitcoinTalk forum, eXch\nsaid\nit was shutting down after it \"received confirmation of information\" that the platform is the \"subject of an active transatlantic operation aimed at forcibly shutting our project down and prosecuting us for 'money laundering and terrorism.'\"\n\"The goals we certainly never had in mind were to enable illicit activities such as money laundering or terrorism, as we are being accused of now,\" it claimed. \"We also have absolutely no motivation to operate a project where we are viewed as criminals. This doesn't make any sense to us.\"\nFollowing the takedown, the Dutch Fiscal Information and Investigation Service (\nFIOD\n) said in a message that it's \"actively investigating individuals involved in money laundering and other illegal activities through this swap service.\"\n\"We want to make one thing clear: this action is not an attack on privacy. We respect the right to privacy and recognize its importance in the digital age. However, when services are heavily abused to commit crime, we will act,\" it\nadded\n.\n\"We urge everyone involved in illicit activity to cease immediately. The legal consequences can be serious. Privacy is not the problem – criminal misuse is.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft Teams will soon block screen capture during meetings",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-teams-will-soon-block-screen-capture-during-meetings/",
        "Summary": "Microsoft is working on adding a new Teams feature that will prevent users from capturing screenshots of sensitive information shared during meetings. [...]",
        "Date": "2025-05-10",
        "Content": "Microsoft is working on adding a new Teams feature that will prevent users from capturing screenshots of sensitive information shared during meetings.\nThose joining from unsupported platforms will be automatically placed in audio-only mode to protect shared content. The company plans to start rolling out this new Teams feature to Android, desktop, iOS, and web users worldwide in July 2025.\n\"To address the issue of unauthorized screen captures during meetings, the Prevent Screen Capture feature ensures that if a user attempts to take a screen capture, the meeting window will turn black, thereby protecting sensitive information,\"\nMicrosoft shared\nin a new Microsoft 365 roadmap entry.\n\"This feature will be available on Teams desktop applications (both Windows and Mac) and Teams mobile applications (both iOS and Android).\"\nHowever, it should be noted that, even if screenshots are blocked, sensitive media and information shared in Teams meetings can still be captured by taking a photo of the conversation.\nLast month, Meta introduced a similar WhatsApp feature named \"\nAdvanced Chat Privacy\n,\" which protects sensitive information exchanged in private chats and group conversations by blocking attempts to save shared media and export chat content.\nRedmond will also roll out a\ntown hall screen privilege management update\nin Teams Rooms on Windows,\ninteractive BizChat/Copilot Studio agents\nin meetings and 1-on-1 calls, and a Copilot feature to help\ngenerate audio overviews\nof transcribed meetings in June.\nAnother Copilot feature to help\ngenerate audio overviews\nof transcribed meetings is also under development and will let users choose the speakers, adjust the tone, and tailor the length.\nIn January, the company\nreminded Microsoft 365 admins\nthat its new Teams Chat brand impersonation protection feature, which alerts users when detecting phishing attacks targeting organizations with external Teams access toggled on, will be made generally available for all customers by mid-February 2025.\nAt last year's Enterprise Connect enterprise communications and collaboration conference, Microsoft\nannounced\nthat the Teams platform had reached over 320 million monthly active users across 181 markets and 44 languages.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nNew Microsoft 365 outage impacts Teams and other services\nWindows 11's Recall AI is now rolling out on Copilot+ PCs\nMicrosoft: Licensing issue blocks Microsoft 365 Family for some users\nMicrosoft: New Windows scheduled task will launch Office apps faster\nMicrosoft: Exchange Online bug mistakenly quarantines user emails"
    },
    {
        "Title": "Fake AI video generators drop new Noodlophile infostealer malware",
        "Link": "https://www.bleepingcomputer.com/news/security/fake-ai-video-generators-drop-new-noodlophile-infostealer-malware/",
        "Summary": "Fake AI-powered video generation tools are being used to distribute a new information-stealing malware family called 'Noodlophile,' under the guise of generated media content. [...]",
        "Date": "2025-05-10",
        "Content": "Fake AI-powered video generation tools are being used to distribute a new information-stealing malware family called 'Noodlophile,' under the guise of generated media content.\nThe websites use enticing names like the \"Dream Machine\" and are advertised on high-visibility groups on Facebook, posing as advanced AI tools that generate videos based on uploaded user files.\nAlthough the use of AI tools to deliver malware\nisn't a new concept\nand has been adopted by\nexperienced cybercriminals\n, the discovery of the latest campaign\nby Morphisec\nintroduces a new infostealer into the mix.\nAccording to Morphisec, Noodlophile is being sold on dark web forums, often bundled with \"Get Cookie + Pass\" services, so it's a new malware-as-a-service operation linked to Vietnamese-speaking operators.\nFacebook ad taking users to malicious websites\nSource: Morphisec\nMulti-stage infection chain\nOnce the victim visits the malicious website and uploads their files, they receive a ZIP archive that is supposed to contain an AI-generated video.\nInstead, the ZIP contains a deceptively named executable (Video Dream MachineAI.mp4.exe), and a hidden folder with various files needed for the subsequent stages. If a Windows user has file extensions disabled (\nnever do that\n), that at a quick glance, would look like an MP4 video file.\n\"The file Video Dream MachineAI.mp4.exe is a 32-bit C++ application signed using a certificate created via Winauth,\" explains Morphisec.\n\"Despite its misleading name (suggesting an .mp4 video), this binary is actually a repurposed version of CapCut, a legitimate video editing tool (version 445.0). This deceptive naming and certificate help it evade user suspicion and some security solutions.\"\nA DreamMachine site dropping the payload\nSource: Morphisec\nDouble-clicking on the fake MP4 will execute a series of executables that eventually launch a batch script (Document.docx/install.bat).\nThe script uses the legitimate Windows tool 'certutil.exe' to decode and extract a base64-encoded password-protected RAR archive posing as a PDF document. At the same time, it also adds a new Registry key for persistence.\nNext, the script executes 'srchost.exe,' which runs an obfuscated Python script (randomuser2025.txt) fetched from a hardcoded remote server address, eventually executing the Noodlophile Stealer in memory.\nIf Avast is detected on the compromised system, PE hollowing is used to inject the payload into RegAsm.exe. Otherwise, shellcode injection is used for in-memory execution.\nComplete execution chain\nSource: Morphisec\nNoodlophile is a new information stealer malware that targets data stored on web browsers like account credentials, session cookies, tokens, and cryptocurrency wallet files.\n\"Noodlophile Stealer represents a new addition to the malware ecosystem. Previously undocumented in public malware trackers or reports, this stealer combines browser credential theft, wallet exfiltration, and optional remote access deployment,\" explains the Morphisec researchers.\nStolen data is exfiltrated via a Telegram bot, which serves as a covert command and control (C2) server, giving attackers real-time access to stolen information.\nIn some cases, Noodlophile is bundled with XWorm, a remote access trojan, giving the attackers elevated data theft capabilities that go well beyond the passive stealing facilitated by the info-stealer.\nThe best way to protect from malware is to avoid downloading and executing files from unknown websites.\nAlways verify file extensions before opening, and scan all downloaded files on an up-to-date AV tool before executing.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nSteam pulls game demo infecting Windows with info-stealing malware\nGoogle Chrome to use on-device AI to detect tech support scams\nOpenAI document explains when to use each ChatGPT model\nGoogle NotebookLM is now using Gemini 2.5 Flash\nStealC malware enhanced with stealth upgrades and data theft tools"
    }
]