[
    {
        "Title": "RVTools Official Site Hacked to Deliver Bumblebee Malware via Trojanized Installer",
        "Link": "https://thehackernews.com/2025/05/rvtools-official-site-hacked-to-deliver.html",
        "Summary": "The official site for RVTools has been hacked to serve a compromised installer for the popular VMware environment reporting utility.\n\"Robware.net and RVTools.com are currently offline. We are working expeditiously to restore service and appreciate your patience,\" the company said in a statement posted on its website.\n\"Robware.net and RVTools.com are the only authorized and supported websites for",
        "Date": "2025-05-19",
        "Content": "The official site for RVTools has been hacked to serve a compromised installer for the popular VMware environment reporting utility.\n\"Robware.net and RVTools.com are currently offline. We are working expeditiously to restore service and appreciate your patience,\" the company\nsaid\nin a statement posted on its website.\n\"Robware.net and RVTools.com are the only authorized and supported websites for RVTools software. Do not search for or download purported RVTools software from any other websites or sources.\"\nThe development comes after security researcher Aidan Leon\nrevealed\nthat an infected version of the installer downloaded from the website was being used to sideload a\nmalicious DLL\nthat turned out to be a known malware loader called\nBumblebee\n.\nIt's currently not known how long the trojanized version of RVTools had been available for download and how many had installed it before the site was taken offline.\nIn the interim, users are recommended to verify the installer's hash and review any execution of version.dll from user directories.\nThe disclosure comes as it has come to light that the official software supplied with Procolored printers included a Delphi-based backdoor called XRed and a clipper malware dubbed SnipVex that's capable of substituting wallet addresses in the clipboard with that of a hard-coded address.\nDetails of the malicious activity were\nfirst discovered\nby Cameron Coward, who is behind the YouTube channel Serial Hobbyism.\nXRed\n, believed to be active since at least 2019, comes with features to collect system information, log keystrokes, propagate via connected USB drives, and execute commands sent from an attacker-controlled server to capture screenshots, enumerate file systems and directories, download files, and delete files from the system.\n\"[SnipVex] searches the clipboard for content that resembles a BTC address and replaces it with the attacker's address, such that cryptocurrency transactions will be diverted to the attacker,\" G DATA researcher Karsten Hahn, who further investigated the incident,\nsaid\n.\nBut in an interesting twist, the malware infects .EXE files with the clipper functionality and makes use of an infection marker sequence – 0x0A 0x0B 0x0C – at the end to avoid re-infecting the files a second time. The\nwallet address\nin question has received 9.30857859 BTC (about $974,000) to date.\nProcolored has since acknowledged that the software packages were uploaded to the Mega file hosting service in October 2024 via USB drives and that the malware may have been introduced during this process. Software downloads are currently only available for F13 Pro, VF13 Pro, and V11 Pro products.\n\"The malware's command-and-control server has been offline since February 2024,\" Hahn noted. \"So it is not possible that XRed established a successful remote connection after that date. The accompanying clipbanker virus SnipVex is still a serious threat. Although transactions to the BTC address stopped on March 3, 2024, the file infection itself damages systems.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Ransomware Gangs Use Skitnet Malware for Stealthy Data Theft and Remote Access",
        "Link": "https://thehackernews.com/2025/05/ransomware-gangs-use-skitnet-malware.html",
        "Summary": "Several ransomware actors are using a malware called Skitnet as part of their post-exploitation efforts to steal sensitive data and establish remote control over compromised hosts.\n\"Skitnet has been sold on underground forums like RAMP since April 2024,\" Swiss cybersecurity company PRODAFT told The Hacker News. \"However, since early 2025, we have observed multiple ransomware operators using it",
        "Date": "2025-05-19",
        "Content": "Several ransomware actors are using a malware called\nSkitnet\nas part of their post-exploitation efforts to steal sensitive data and establish remote control over compromised hosts.\n\"Skitnet has been sold on underground forums like RAMP since April 2024,\" Swiss cybersecurity company PRODAFT told The Hacker News. \"However, since early 2025, we have observed multiple ransomware operators using it in real-world attacks.\"\n\"For example, in April 2025, Black Basta leveraged Skitnet in Teams-themed phishing campaigns targeting enterprise environments. With its stealth features and flexible architecture, Skitnet appears to be gaining traction rapidly within the ransomware ecosystem.\"\nSkitnet\n, also called\nBossnet\n, is a multi-stage malware developed by a threat actor tracked by the company under the name LARVA-306. A notable aspect of the malicious tool is that it uses programming languages like Rust and Nim to launch a reverse shell over DNS and evade detection.\nIt also incorporates persistence mechanisms, remote access tools, commands for data exfiltration, and even download a .NET loader binary that can be used to serve additional payloads, making it a versatile threat.\nFirst advertised on April 19, 2024, Skitnet is offered to potential customers as a \"compact package\" comprising a server component and malware. The initial executable is a Rust binary that decrypts and runs an embedded payload that's compiled in Nim.\n\"The primary function of this Nim binary is to establish a reverse shell connection with the C2 [command-and-control] server via DNS resolution,\" PRODAFT\nsaid\n. \"To evade detection, it employs the GetProcAddress function to dynamically resolve API function addresses rather than using traditional import tables.\"\nThe Nim-based binary further starts multiple threads to send DNS requests every 10 seconds, read DNS responses and extract commands to be executed on the host, and transmit the results of the execution of the command back to the server. The commands are issued via a C2 panel that's used to manage the infected hosts.\nSome of the supported PowerShell commands are listed below -\nStartup, which ensures persistence by creating shortcuts in the Startup directory of the victim's device\nScreen, which captures a screenshot of the victim's desktop\nAnydesk/Rutserv, which deploys a legitimate remote desktop software like AnyDesk or Remote Utilities (\"rutserv.exe\")\nShell, to run PowerShell scripts hosted on a remote server and send the results back to the C2 server\nAV, which gathers a list of installed security products\n\"Skitnet is a multi-stage malware that leverages multiple programming languages, and encryption techniques,\" PRODAFT said. \"By using Rust for payload decryption and manual mapping, followed by a Nim-based reverse shell communicating over DNS, the malware tries to evade traditional security measures.\"\nThe disclosure comes as Zscaler ThreatLabz detailed another malware loader dubbed TransferLoader that's being used to deliver a ransomware strain called Morpheus targeting an American law firm.\nActive since at least February 2025, TransferLoader incorporates three components, a downloader, a backdoor, and a specialized loader for the backdoor, enabling the threat actors to execute arbitrary commands on the compromised system.\nWhile the downloader is designed to fetch and execute a payload from a C2 server and simultaneously run a PDF decoy file, the backdoor is responsible for running commands issued by the server, as well as updating its own configuration.\n\"The backdoor utilizes the decentralized InterPlanetary File System (\nIPFS\n) peer-to-peer platform as a fallback channel for updating the command-and-control (C2) server,\" the cybersecurity company\nsaid\n. \"The developers of TransferLoader use obfuscation methods to make the reverse engineering process more tedious.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Why CTEM is the Winning Bet for CISOs in 2025",
        "Link": "https://thehackernews.com/2025/05/why-ctem-is-winning-bet-for-cisos-in.html",
        "Summary": "Continuous Threat Exposure Management (CTEM) has moved from concept to cornerstone, solidifying its role as a strategic enabler for CISOs. No longer a theoretical framework, CTEM now anchors today’s cybersecurity programs by continuously aligning security efforts with real-world risk.\nAt the heart of CTEM is the integration of Adversarial Exposure Validation (AEV), an advanced, offensive",
        "Date": "2025-05-19",
        "Content": "Continuous Threat Exposure Management (CTEM) has moved from concept to cornerstone, solidifying its role as a strategic enabler for CISOs. No longer a theoretical framework, CTEM now anchors today's cybersecurity programs by continuously aligning security efforts with real-world risk.\nAt the heart of CTEM is the integration of Adversarial Exposure Validation (AEV), an advanced, offensive methodology powered by proactive security tools including External\nAttack Surface Management\n(ASM), autonomous penetration testing and red teaming, and Breach and Attack Simulation (BAS). Together, these AEV tools transform how enterprises proactively identify, validate, and reduce risks, turning threat exposure into a manageable business metric.\nCTEM reflects a broader evolution in how security leaders measure effectiveness and allocate resources. As board expectations grow and cyber risk becomes inseparable from business risk, CISOs are leveraging CTEM to drive measurable, outcome-based security initiatives. Early adopters report improved risk visibility, faster validation and remediation cycles, and tighter alignment between security investments and business priorities.\n1\nWith tools like ASM and autonomous pentesting delivering real-time insights into exposure, CTEM empowers CISOs to adopt a continuous, adaptive model that keeps pace with attacker techniques and the evolving threat landscape.\nCTEM's Moment Has Arrived\nCTEM introduces a continuous, iterative process encompassing three pillars:\nAdversarial Exposure Validation\n(AEV), Exposure Assessment Platforms (EAP), and Exposure Management (EM). These methodologies ensure enterprises can dynamically assess and respond to threats, aligning security efforts with business objectives.\n1\nGartner underscores the significance of CTEM, predicting that by 2026, organizations prioritizing security investments based on a CTEM program will be three times less likely to suffer a breach.\n2\nAdversarial Exposure Validation (AEV): Simulating Real-World Threats\nAEV strengthens CTEM by continuously validating the effectiveness of security controls through the simulated exploitation of assets using real-world attacker behaviors. This often involves the use of automation, AI, and machine learning to replicate tactics, techniques, and procedures (TTPs) used by adversaries, helping enterprises to proactively identify exploitable exposures before they can be leveraged in an actual attack. This proactive approach is crucial in understanding weaknesses and refining defenses more effectively.\nAttack Surface Management (ASM): Expanding Visibility\nASM complements CTEM by providing comprehensive visibility into an enterprise's digital footprint. By continuously discovering, prioritizing, and monitoring assets,\nASM\nenables security teams to identify potential vulnerabilities and exposures promptly. This expanded visibility is essential for effective threat exposure management, ensuring that no asset remains unmonitored. AEV transforms ASM from a map into a mission plan, and enterprises need it urgently.\nAutonomous Penetration Testing and Red Teaming: Improving Scalability\nThe integration of autonomous penetrating testing and red teaming into CTEM frameworks marks a significant advancement in cybersecurity practices. Autonomous pentesting, for example, delivers real-time, scalable, and actionable insights unlike periodic assessments. This shift enhances operational efficiency while proactively identifying and mitigating vulnerabilities in real-time. While regulatory compliance remains important, it is no longer the sole driver – modern mandates increasingly emphasize continuous, proactive security testing.\nBreach and Attack Simulation (BAS): Continuous Security Validation\nBAS tools also play a role in CTEM by automating the simulation of known attack techniques across the kill chain – ranging from phishing and lateral movement to data exfiltration. Unlike autonomous pentesting, which actively exploits vulnerabilities, BAS focuses on continuously validating the effectiveness of security controls without causing disruption. These simulated attacks help uncover blind spots, misconfigurations, and detection and response gaps across endpoints, networks, and cloud environments. By aligning results with threat intelligence and frameworks like MITRE ATT&CK, BAS enables security teams to prioritize remediation based on real exposure and risk, helping CISOs ensure their defenses are not only in place, but operationally effective.\nThe Impetus Behind CTEM's Rise\nThe rapid adoption of CTEM in 2025 is no coincidence. As cyber risks grow more complex and dynamic, enterprises are embracing CTEM not just as a framework, but as an effective cyber strategy that yields measurable results. Several converging trends, ranging from evolving threat tactics to regulatory pressure and expanding digital footprints, are driving security leaders to prioritize continuous validation, real-time visibility, and operational efficiency across the attack surface. Several factors contribute to the widespread adoption of CTEM:\nScalability:\nThe rapid shift to cloud-native architectures, growing supply chain, and interconnected systems has expanded the attack surface. CTEM delivers the visibility and control needed to manage this complexity at scale.\nOperational Efficiency:\nBy integrating tools and automating threat validation, CTEM reduces redundancy, streamlines workflows, and accelerates response times.\nMeasurable Outcomes:\nCTEM enables CISOs to shift from abstract risk discussions to data-driven decisions by providing clear metrics on exposure, control effectiveness, and remediation progress, supporting better alignment with business objectives and board-level reporting.\nRegulatory Compliance:\nWith rising enforcement of cybersecurity regulations like NIS2, DORA, and SEC reporting mandates, CTEM's continuous validation and visibility help enterprises stay compliant and audit ready.\nConclusion\nCybersecurity cannot evolve by standing still, and neither can security leaders and their organizations. The shift toward a proactive, measurable, and continuous approach to threat exposure is not only necessary but achievable. In fact, it's the only viable path forward.\nCTEM\nisn't just another framework, it's a blueprint for transforming security into a business-aligned, data-driven discipline. By embracing real-time validation, prioritizing exposures that matter, and proving effectiveness with metrics that resonate beyond the SOC, CISOs are moving the industry beyond checkboxes toward true resilience. Today, the enterprises that lead in cybersecurity will be the ones that\nmeasure it and manage it, continuously.\nAbout BreachLock:\nBreachLock is a leader in offensive security, delivering scalable and continuous security testing. Trusted by global enterprises, BreachLock provides human-led and AI-assisted attack surface management,\npenetration testing services\n, red teaming, and Adversarial Exposure Validation (AEV) services that help security teams stay ahead of adversaries. With a mission to make proactive security the new standard, BreachLock is shaping the future of cybersecurity through automation, data-driven intelligence, and expert-driven execution.\nReferences:\nHacking Reviews. (n.d.).\nHow attack surface management supports continuous threat exposure management.\nRetrieved 30, April 2025, from https://www.hacking.reviews/2023/05/how-attack-surface-management-supports.html\nGartner. (n.d.).\nHow to Manage Cybersecurity Threats, Not Episodes.\nRetrieved 30, April 2025, from https://www.gartner.com/en/articles/how-to-manage-cybersecurity-threats-not-episodes\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Firefox Patches 2 Zero-Days Exploited at Pwn2Own Berlin with $100K in Rewards",
        "Link": "https://thehackernews.com/2025/05/firefox-patches-2-zero-days-exploited.html",
        "Summary": "Mozilla has released security updates to address two critical security flaws in its Firefox browser that could be potentially exploited to access sensitive data or achieve code execution.\nThe vulnerabilities, both of which were exploited as a zero-day at Pwn2Own Berlin, are listed below -\n\nCVE-2025-4918 - An out-of-bounds access vulnerability when resolving Promise objects that could allow an",
        "Date": "2025-05-19",
        "Content": "Mozilla has released security updates to address two critical security flaws in its Firefox browser that could be potentially exploited to access sensitive data or achieve code execution.\nThe vulnerabilities, both of which were exploited as a zero-day at Pwn2Own Berlin, are listed below -\nCVE-2025-4918 - An out-of-bounds access vulnerability when resolving Promise objects that could allow an attacker to perform read or write on a JavaScript Promise object\nCVE-2025-4919 - An out-of-bounds access vulnerability when optimizing linear sums that could allow an attacker to perform read or write on a JavaScript object by confusing array index sizes\nIn other words, successful exploitation of either of the flaws could permit an adversary to achieve\nout-of-bounds read\nor\nwrite\n, which could then be abused to access otherwise sensitive information or result in memory corruption that could pave the way for code execution.\nThe vulnerabilities affect the following versions of the Firefox browser -\nAll versions of\nFirefox before 138.0.4\n(including Firefox for Android)\nAll versions of\nFirefox Extended Support Release (ESR) before 128.10.1\nAll versions of\nFirefox ESR before 115.23.1\nEdouard Bochin and Tao Yan from Palo Alto Networks have been credited with finding and reporting CVE-2025-4918. The discovery of CVE-2025-4919 has been credited to Manfred Paul.\nIt's worth noting that both shortcomings were\ndemonstrated\nat the\nPwn2Own Berlin\nhacking contest last week for which they were awarded $50,000 each.\nWith web browsers continuing to be an attractive vector for malware delivery, users are advised to update their instances to the latest version to safeguard against potential threats.\n\"Neither of the attacks managed to break out of our sandbox, which is required to gain control over the user's system,\" Mozilla\nsaid\nin a statement. \"Despite the limited impact of these attacks, all users and administrators are advised to update Firefox as soon as possible.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "⚡ Weekly Recap: Zero-Day Exploits, Insider Threats, APT Targeting, Botnets and More",
        "Link": "https://thehackernews.com/2025/05/weekly-recap-zero-day-exploits-insider.html",
        "Summary": "Cybersecurity leaders aren’t just dealing with attacks—they’re also protecting trust, keeping systems running, and maintaining their organization’s reputation. This week’s developments highlight a bigger issue: as we rely more on digital tools, hidden weaknesses can quietly grow.&nbsp;\nJust fixing problems isn’t enough anymore—resilience needs to be built into everything from the ground up.",
        "Date": "2025-05-19",
        "Content": "Cybersecurity leaders aren't just dealing with attacks—they're also protecting trust, keeping systems running, and maintaining their organization's reputation. This week's developments highlight a bigger issue: as we rely more on digital tools, hidden weaknesses can quietly grow.\nJust fixing problems isn't enough anymore—resilience needs to be built into everything from the ground up. That means better systems, stronger teams, and clearer visibility across the entire organization. What's showing up now isn't just risk—it's a clear signal that acting fast and making smart decisions matters more than being perfect.\nHere's what surfaced—and what security teams can't afford to overlook.\n⚡ Threat of the Week\nMicrosoft Fixes 5 Actively Exploited 0-Days\n— Microsoft\naddressed\na total of 78 security flaws in its Patch Tuesday update for May 2025 last week, out of which five of them have come under active exploitation in the wild. The vulnerabilities include CVE-2025-30397, CVE-2025-30400, CVE-2025-32701, CVE-2025-32706, and CVE-2025-32709. It's currently not known in what context these defects have been exploited, who is behind them, and who was targeted in these attacks.\n2025 State of Code Security: Key Trends and Threats\nIn cloud-native environments, the security of your code repositories and development pipelines is critical. Do you know the most pressing risks facing your organization today? By analyzing hundreds of thousands of repositories, the Wiz Threat Research team uncovered key vulnerabilities and attacker strategies in the new\n2025 State of Code Security Report\n.\nKey stats include:\n35% of GitHub repositories are public, providing malicious actors with easy access to exploits if developers make critical mistakes\n61% of organizations have cloud secrets, like API keys and access tokens, exposed in public repositories\nDownload the report to explore all the findings in detail and learn actionable strategies to protect your organization.\nDownload the Report ➝\n🔔 Top News\nMarbled Dust Exploits Output Messenger 0-Day\n— Microsoft\nrevealed\nthat a Türkiye-affiliated threat actor codenamed Marbled Dust exploited as zero-day a security flaw in an Indian enterprise communication platform called Output Messenger as part of a cyber espionage attack campaign since April 2024. The attacks, the company said, are associated with the Kurdish military operating in Iraq. The attacks exploited CVE-2025-27920, a directory traversal vulnerability affecting version 2.0.62 that allows remote attackers to access or execute arbitrary files. It was addressed in December 2024.\nKonni APT Focuses on Ukraine in New Phishing Campaign\n— The North Korea-linked threat actor known as Konni APT has been\nattributed\nto a phishing campaign targeting government entities in Ukraine, indicating the threat actor's targeting beyond Russia amidst the ongoing Russo-Ukrainian war. Proofpoint, which disclosed details of the activity, said the objective of the attacks is to collect intelligence on the \"trajectory of the Russian invasion.\" The attack chains entail the use of phishing emails that impersonate a fictitious senior fellow at a non-existent think tank, tricking recipients into visiting credential harvesting pages or downloading malware that can conduct extensive reconnaissance of the compromised machines.\nCoinbase Discloses Data Breach\n— Cryptocurrency giant Coinbase\ndisclosed\nthat unknown cyber actors broke into its systems and stole account data for a small subset of its customers. The activity bribed its customer support agents based in India to obtain a list of customers, who were then approached as part of a social engineering attack to transfer their digital assets to a wallet under the threat actor's control. The attackers also unsuccessfully attempted to extort the company for $20 million on May 11, 2025, by claiming to have information about certain customer accounts as well as internal documents. The compromised agents have since been terminated. While no passwords, private keys, or funds were exposed, the attackers made away with some amount of personal information, including names, addresses, phone numbers, email addresses, government ID images, and account balances. Coinbase did not disclose how many of its customers fell for the scam. Besides voluntarily reimbursing retail customers who were duped into sending cryptocurrency to scammers, Coinbase is offering a $20 million reward to anyone who can help identify and bring down the perpetrators of the cyber attack.\nAPT28 Behind Attacks Targeting Webmail Services\n— APT28, a hacking group linked to Russia's Main Intelligence Directorate (GRU), has been\ntargeting\nwebmail servers such as Roundcube, Horde, MDaemon, and Zimbra via cross-site scripting (XSS) vulnerabilities. The attacks, ongoing since at least 2023, targeted governmental entities and defense companies in Eastern Europe, although governments in Africa, Europe, and South America were also singled out. The victims in 2024 alone included officials from regional national governments in Ukraine, Greece, Cameroon and Serbia, military officials in Ukraine and Ecuador, and employees of defense contracting firms in Ukraine, Romania and Bulgaria. The group's spear-phishing campaign used fake headlines mimicking prominent Ukrainian news outlets like the Kyiv Post about the Russia-Ukraine war, seemingly in an attempt to entice targets into opening the messages using the affected webmail clients. Those who opened the email messages using the affected webmail clients were served, via the XSS flaws, a custom JavaScript payload capable of exfiltrating contacts and email data from their mailboxes. One of the payloads could steal passwords and two-factor authentication codes, allowing the attackers to bypass account protections. The malware is also designed to harvest the email credentials, either by tricking the browser or password manager into pasting those credentials into a hidden form or getting the user to log out, whereupon they were served a bogus login page.\nEarth Ammit Breaches Drone Supply Chains to Target Taiwan and South Korea\n— The threat actor known as Earth Ammit\ntargeted\na broader range of organizations than just Taiwanese drone manufacturers, as initially supposed. While the set of attacks was believed to be confined to drone manufacturers in Taiwan, a subsequent analysis has uncovered that the campaign is more broader and sustained in scope than previously thought, hitting the heavy industry, media, technology, software services, healthcare, satellite, and military-adjacent supply chains, and payment service providers in both South Korea and Taiwan. The attacks targeted software vendors and service providers as a way to reach their desired victims, who were the vendors' downstream customers. \"Earth Ammit's strategy centered around infiltrating the upstream segment of the drone supply chain. By compromising trusted vendors, the group positioned itself to target downstream customers – demonstrating how supply chain attacks can ripple out and cause broad, global consequences,\" Trend Micro noted. \"Earth Ammit's long-term goal is to compromise trusted networks via supply chain attacks, allowing them to target high-value entities downstream and amplify their reach.\"\n‎️‍🔥 Trending CVEs\nAttackers love software vulnerabilities—they're easy doors into your systems. Every week brings fresh flaws, and waiting too long to patch can turn a minor oversight into a major breach. Below are this week's critical vulnerabilities you need to know about. Take a look, update your software promptly, and keep attackers locked out.\nThis week's list includes —\nCVE-2025-30397, CVE-2025-30400, CVE-2025-32701, CVE-2025-32706, CVE-2025-32709\n(Microsoft Windows),\nCVE-2025-42999\n(SAP NetWeaver),\nCVE-2024-11182\n(MDaemon),\nCVE-2025-4664\n(Google Chrome),\nCVE-2025-4632\n(Samsung MagicINFO 9 Server),\nCVE-2025-32756\n(Fortinet FortiVoice, FortiMail, FortiNDR, FortiRecorder, and FortiCamera),\nCVE-2025-4427, CVE-2025-4428\n(Ivanti Endpoint Manager Mobile),\nCVE-2025-3462, CVE-2025-3463\n(ASUS DriverHub),\nCVE-2025-47729\n(\nTeleMessage TM SGNL\n),\nCVE-2025-31644\n(F5 BIG-IP),\nCVE-2025-22249\n(VMware Aria Automation),\nCVE-2025-27696\n(Apache Superset),\nCVE-2025-4317\n(TheGem WordPress theme),\nCVE-2025-23166\n(Node.js),\nCVE-2025-47884\n(Jenkins OpenID Connect Provider Plugin),\nCVE-2025-47889\n(Jenkins WSO2 Oauth Plugin),\nCVE-2025-4802\n(Linux glibc), and\nCVE-2025-47539\n(Eventin plugin).\n📰 Around the Cyber World\nAttackers Leverage PyInstaller to Drop Infostealers on Macs\n— Attackers are using PyInstaller to deploy information stealers on macOS systems. These ad-hoc signed samples bundle Python code into Mach-O executables using PyInstaller, allowing them to be run without requiring Python to be installed or meet version compatibility requirements. \"As infostealers continue to become more prevalent in the macOS threat landscape, threat actors will continue the search for new ways to distribute them,\" Jamf\nsaid\n. \"While the use of PyInstaller to package malware\nis not uncommon\n, this marks the first time we've observed it being used to deploy an infostealer on macOS.\"\nKosovo National Extradited to the U.S. for Running BlackDB.cc\n— A 33-year-old Kosovo national named Liridon Masurica has been extradited to the United States to face charges of running an online cybercrime marketplace active since 2018. He has been charged with five counts of fraudulent use of unauthorized access devices and one count of conspiracy to commit access device fraud. If convicted on all counts, Masurica faces a maximum penalty of 55 years in federal prison. He was taken into custody by authorities in Kosovo on December 12, 2024. Masurica is alleged to be the lead administrator of BlackDB.cc from 2018 to the present. \"BlackDB.cc illegally offered for sale compromised account and server credentials, credit card information, and other personally identifiable information of individuals primarily located in the United States,\" the Justice Department\nsaid\n. \"Once purchased, cybercriminals used the items purchased on BlackDB.cc to facilitate a wide range of illegal activity, including tax fraud, credit card fraud, and identity theft.\"\nFormer BreachForums Admin to Pay $700k in Healthcare Breach\n— Conor Brian Fitzpatrick, aka Pompompurin, a former administrator of the BreachForums cybercrime forum, will\nforfeit roughly $700,000\nin a civil lawsuit settlement related to Nonstop Health, a health insurance company whose customer data was posted for sale on the forum in 2023. Fitzpatrick was\nsentenced\nto time served last year, but he went on to violate the terms of his release. He is set to be resentenced next month.\nTor Announces Oniux for Kernel-Level Tor Isolation\n— The Tor project has announced a new command-line utility called oniux that provides Tor network isolation for third-party applications using Linux namespaces. This effectively creates a fully isolated network environment for each application, preventing data leaks even if the app is malicious or misconfigured. \"Built on Arti, and onionmasq, oniux drop-ships any Linux program into its own network namespace to route it through Tor and strips away the potential for data leaks,\" the Tor project\nsaid\n. \"If your work, activism, or research demands rock-solid traffic isolation, oniux delivers it.\"\nDoJ Charges 12 More in RICO Conspiracy\n— The U.S. Department of Justice\nannounced\ncharges against 12 more people for their alleged\ninvolvement\nin a\ncyber-enabled racketeering conspiracy\nthroughout the United States and abroad that netted them more than $263 million. Several of these individuals are said to have been arrested in the U.S., with two others living in Dubai. They face charges related to RICO conspiracy, conspiracy to commit wire fraud, money laundering, and obstruction of justice. The defendants are also accused of stealing over $230 million in cryptocurrency from a victim in Washington D.C. \"The enterprise began no later than October 2023 and continued through March 2025,\" the Justice Department said. \"It grew from friendships developed on online gaming platforms. Members of the enterprise held different responsibilities. The various roles included database hackers, organizers, target identifiers, callers, money launderers, and residential burglars targeting hardware virtual currency wallets.\" The attacks involved database hackers breaking into websites and servers to obtain cryptocurrency-related databases or acquiring databases on the dark web. The miscreants then determined the most valuable targets and cold-called them, using social engineering to convince them their accounts were the subject of cyber attacks and that they were helping them take steps to secure their accounts. The end goal of these attacks was to siphon the cryptocurrency assets, which were then laundered and converted into fiat U.S. currency in the form of bulk cash or wire transfers. The money was then used to fund a lavish lifestyle for the defendants. \"Following his arrest in September 2024 and continuing while in pretrial detention, Lam is alleged to have continued working with members of the enterprise to pass and receive directions, collect stolen cryptocurrency, and have enterprise members buy luxury Hermes Birkin bags and hand-deliver them to his girlfriend in Miami, Florida,\" the agency said.\nENISA Launches EUVD Vulnerability Database\n— The European Union launched a new vulnerability database called the European Vulnerability Database (\nEUVD\n) to provide aggregated information regarding security issues affecting various products and services. \"The database provides aggregated, reliable, and actionable information such as mitigation measures and exploitation status on cybersecurity vulnerabilities affecting Information and Communication Technology (ICT) products and services,\" the European Union Agency for Cybersecurity (ENISA)\nsaid\n. The development comes in the wake of\nuncertainty\nover MITRE's CVE program in the U.S., after which the U.S. Cybersecurity and Infrastructure Security Agency (CISA) stepped in at the last minute to extend their contract with MITRE for another 11 months to keep the initiative running.\n3 Information Stealers Detected in the Wild\n— Cybersecurity researchers have exposed the workings of three different information stealer malware families, codenamed\nDarkCloud Stealer\n,\nChihuahua Stealer\n, and\nPentagon Stealer\n, that are capable of extracting sensitive data from compromised hosts. While DarkCloud has been\nadvertised\nin hacking forums as early as January 2023, attacks distributing the malware have primarily focused on government organizations since late January 2025. DarkCloud is distributed as AutoIt payloads via phishing emails using PDF purchase order lures that display a message claiming their Adobe Flash Player is out of date. Chihuahua Stealer, on the other hand, is a .NET-based malware that employs an obfuscated PowerShell script shared through a malicious Google Drive document. First discovered in March 2025, Pentagon Stealer makes use of Golang to realize its goals. However, a Python variant of the same stealer was detected at least a year prior when it was propagated via\nfake Python packages\nuploaded to the PyPI repository.\nKaspersky Outlines Malware Trends for Industrial Systems in Q1 2025\n— Kaspersky revealed that the percentage of ICS computers on which malicious objects were blocked in Q1 2025 remained unchanged from Q4 2024 at 21.9%. \"Regionally, the percentage of ICS computers on which malicious objects were blocked ranged from 10.7% in Northern Europe to 29.6% in Africa,\" the Russian security company\nsaid\n. \"The biometrics sector led the ranking of the industries and OT infrastructures surveyed in this report in terms of the percentage of ICS computers on which malicious objects were blocked.\" The primary categories of detected malicious objects included malicious scripts and phishing pages, denylisted internet resources, and backdoors, and keyloggers.\nLinux Flaws Surge by 967% in 2024\n— The number of newly discovered Linux and macOS vulnerabilities increased dramatically in 2024, rising by 967% and 95% in 2024. The year was also marked by a 96% jump in exploited vulnerabilities from 101 in 2023 to 198 in 2024, and an unprecedented 37% rise in critical flaws across key enterprise applications. \"The total number of software vulnerabilities grew by 61% YoY in 2024, with critical vulnerabilities rising by 37.1% – a significant expansion of the global attack surface and exposure of critical weaknesses across diverse software categories,\" Action1\nsaid\n. \"Exploits spiked 657% in browsers and 433% in Microsoft Office, with Chrome leading all products in known attacks.\" But in a bit of good news, there was a decrease in remote code execution vulnerabilities for Linux (-85% YoY) and macOS (-44% YoY).\nEuropol Announces Takedown of Fake Trading Platform\n— Law enforcement authorities have disrupted an organized crime group that's assessed to be responsible for defrauding more than 100 victims of over €3 million ($3.4 million) through a fake online investment platform. The effort, a joint exercise conducted by Germany, Albania, Cyprus, and Israel, has also led to the arrest of a suspect in Cyprus. \"The criminal network lured victims with the promise of high returns on investments through a fraudulent online trading platform,\" Europol\nsaid\n. \"After the victims made initial smaller deposits, they were pressured to invest larger amounts of money, manipulated by fake charts showing fabricated profits. Criminals posing as brokers used psychological tactics to convince the victims to transfer substantial funds, which were never invested but directly pocketed by the group.\" Two other suspects were previously arrested from Latvia in September 2022 as part of the multi-year probe into the criminal network.\nNew \"defendnot\" Tool Can Disable Windows Defender\n— A security researcher who goes by the online alias es3n1n has\nreleased\na tool called \"\ndefendnot\n\" that can disable Windows Defender by means of a little-known API. \"There's a WSC (Windows Security Center) service in Windows which is used by antiviruses to let Windows know that there's some other antivirus in the hood and it should disable Windows Defender,\" the researcher explained. \"This WSC API is undocumented and furthermore requires people to sign an NDA with Microsoft to get its documentation.\"\nRogue Communication Devices Found in Some Chinese Solar Power Inverters\n— Reuters\nreported\nthat U.S. energy officials are reassessing the risk posed by Chinese-made solar power inverters after unexplained communication equipment was found inside some of them. The rogue components are designed to provide additional, undocumented communication channels that could allow firewalls to be circumvented remotely, according to two people familiar with the matter. This could then be used to switch off inverters remotely or change their settings, enabling bad actors to destabilize power grids, damage energy infrastructure, and trigger widespread blackouts. Undocumented communication devices, including cellular radios, have also been found in some batteries from multiple Chinese suppliers, the report added.\nIsrael Arrest Suspect Behind 2022 Nomad Bridge Crypto Hack\n— Israeli authorities have arrested and approved the extradition of a Russian-Israeli dual national Alexander Gurevich over his alleged involvement in the\nNomad Bridge hack\nin August 2022 that allowed hackers to steal $190 million. Gurevich is said to have conspired with others to execute an exploit for the bridge's Replica smart contract and launder the resulting proceeds through a sophisticated, multi-layered operation involving privacy coins, mixers, and offshore financial entities. \"Gurevich played a central role in laundering a portion of the stolen funds. Blockchain analysis shows that wallets linked to Gurevich received stolen assets within hours of the bridge breach and began fragmenting the funds across multiple blockchains,\" TRM Labs\nsaid\n. \"He then employed a classic mixer stack: moving assets through Tornado Cash on Ethereum, then converting ETH to privacy coins such as Monero (XMR) and Dash.\"\nUsing V8 Browser Exploits to Bypass WDAC\n— Researchers have uncovered a sophisticated technique that leverages vulnerable versions of the V8 JavaScript engine to bypass Windows Defender Application Control (\nWDAC\n). \"The attack scenario is a familiar one: bring along a vulnerable but trusted binary, and abuse the fact that it is trusted to gain a foothold on the system,\" IBM X-Force\nsaid\n. \"In this case, we use a trusted Electron application with a vulnerable version of V8, replacing main.js with a V8 exploit that executes stage 2 as the payload, and voila, we have native shellcode execution. If the exploited application is whitelisted/signed by a trusted entity (such as Microsoft) and would normally be allowed to run under the employed WDAC policy, it can be used as a vessel for the malicious payload.\" The technique builds upon previous findings that make it possible to\nsidestep\nWDAC policies by backdooring trusted Electron applications. Last month, CerberSec\ndetailed\nanother method that employs WinDbg Preview to get around WDAC policies.\n🎥 Cybersecurity Webinars\nDevSecOps Is Broken — This Fix Connects Code to Cloud to SOC\nModern applications don't live in one place—they span code, cloud, and runtime. Yet security is still siloed. This webinar shows why securing just the code isn't enough. You'll learn how unifying AppSec, cloud, and SOC teams can close critical gaps, reduce response times, and stop attacks before they spread. If you're still treating dev, infra, and operations as separate problems, it's time to rethink.\n🔧 Cybersecurity Tools\nQtap\n→\nIt is a lightweight eBPF tool for Linux that shows what data is being sent and received—before or after encryption—without changing your apps or adding proxies. It runs with minimal overhead and captures full context like process, user, and container info. Useful for auditing, debugging, or analyzing app behavior when source code isn't available.\nCheckov\n→\nIt is a fast, open-source tool that scans infrastructure-as-code and container packages for misconfigurations, exposed secrets, and known vulnerabilities. It supports Terraform, Kubernetes, Docker, and more—using built-in security policies and Sigma-style rules to catch issues early in the development process.\nTrailAlerts\n→\nIt is a lightweight, serverless AWS-native tool that gives you full control over CloudTrail detections using Sigma rules—without needing a SIEM. It's ideal for teams who want to write, version, and manage their own alert logic as code, but find CloudWatch rules too limited or complex. Built entirely on AWS services like Lambda, S3, and DynamoDB, TrailAlerts lets you detect suspicious activity, correlate events, and send alerts through SNS or SES—without managing infrastructure or paying for unused capacity.\n🔒 Tip of the Week\nCatch Hidden Threats in Files Users Trust Too Much →\nHackers are using a quiet but dangerous trick: hiding malicious code inside files that look safe — like desktop shortcuts, installer files, or web links. These aren't classic malware files. Instead, they run trusted apps like PowerShell or curl in the background, using basic user actions (like opening a file) to silently infect systems. These attacks often go undetected because the files seem harmless, and no exploits are used — just misuse of normal features.\nTo detect this, focus on behavior. For example, .desktop files in Linux that run hidden shell commands, .lnk files in Windows launching PowerShell or remote scripts, or macOS .app files silently calling terminal tools. These aren't rare anymore — attackers know defenders often ignore these paths. They're especially dangerous because they don't need admin rights and are easy to hide in shared folders or phishing links.\nYou can\nspot these threats\nusing free tools and simple rules. On Windows, use Sysmon and Sigma rules to alert on .lnk files starting PowerShell or suspicious child processes from explorer.exe. On Linux or macOS, use grep or find to scan .desktop and .plist files for odd execution patterns. To test your defenses, simulate these attack paths using MITRE CALDERA — it's free and lets you safely model real-world attacker behavior. Focusing on these overlooked execution paths can close a major gap attackers rely on every day.\nConclusion\nThe headlines may be over, but the work isn't. Whether it's rechecking assumptions, prioritizing patches, or updating your response playbooks, the right next step is rarely dramatic—but always decisive. Choose one, and move with intent.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "OpenAI plans to combine multiple models into GPT-5",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-plans-to-combine-multiple-models-into-gpt-5/",
        "Summary": "OpenAI is planning to combine multiple products (features or models) into its next foundational model, which is called GPT-5. [...]",
        "Date": "2025-05-19",
        "Content": "OpenAI is planning to combine multiple products (features or models) into its next foundational model, which is called GPT-5.\nChatGPT currently has too many capable models for different tasks. While the models are powerful, it can be confusing because all models have identical names.\nIn a Reddit AMA thread, Jerry Tworek, who is a VP at OpenAI, suggested that there are plans to bring some current models and their capabilities together with the next foundational model.\nGPT-5 will also make the existing models significantly better at everything.\n\"GPT-5 is our next foundational model that is meant to just make everything our models can currently do better and with less model switching,\" Jerry Tworek, who is a VP at OpenAI,\nwrote\nin a Reddit post.\nIt makes sense for OpenAI to reduce the number of models it has and bring some of them together under the multimodal GPT-5, which might also support reasoning.\nAt the moment, OpenAI is focusing on building the best coding model called\nCodex\n, which is an AI agent that helps software engineers achieve their tasks.\nCodex-1 in ChatGPT\nThe Codex-1 model is built on top of the o3 reasoning model, and OpenAI has plans to ship further updates to turn it into the best coding model.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nChatGPT will soon record, transcribe, and summarize your meetings\nChatGPT is finally adding Download as PDF for Deep Research\nOpenAI document explains when to use each ChatGPT model\nOpenAI's $20 ChatGPT Plus is now free for students until the end of May\nChatGPT is down worldwide with something went wrong error"
    },
    {
        "Title": "Fake KeePass password manager leads to ESXi ransomware attack",
        "Link": "https://www.bleepingcomputer.com/news/security/fake-keepass-password-manager-leads-to-esxi-ransomware-attack/",
        "Summary": "Threat actors have been distributing trojanized versions of the KeePass password manager for at least eight months to install Cobalt Strike beacons, steal credentials, and ultimately, deploy ransomware on the breached network. [...]",
        "Date": "2025-05-19",
        "Content": "Threat actors have been distributing trojanized versions of the KeePass password manager for at least eight months to install Cobalt Strike beacons, steal credentials, and ultimately, deploy ransomware on the breached network.\nWithSecure's Threat Intelligence team discovered the campaign after they were brought in to investigate a ransomware attack. The researchers found that the attack started with a malicious KeePass installer promoted through Bing advertisements that promoted fake software sites.\nAs KeePass is open source, the threat actors altered the source code to build a trojanized version, dubbed KeeLoader, that contains all the normal password management functionality. However, it includes modifications that install a Cobalt Strike beacon and export the KeePass password database as cleartext, which is then stolen through the beacon.\nWithSecure says that the Cobalt Strike watermarks used in this campaign are linked to an initial access broker (IAB) that is believed to be associated with Black Basta ransomware attacks in the past.\nA Cobalt Strike watermark is a unique identifier embedded into a beacon that is tied to the license used to generate the payload.\n\"This watermark is commonly noted in the context of beacons and domains related to Black Basta ransomware. It is likely used by threat actors operating as Initial Access Brokers working closely with Black Basta,\" explains\nWithSecure\n.\n\"We are not aware of any other incidents (ransomware or otherwise) using this Cobalt Strike beacon watermark – this does not mean it has not occurred.\"\nThe researchers have found multiple variants of KeeLoader have been discovered, signed with legitimate certificates, and spread through typo-squatting domains like keeppaswrd[.]com, keegass[.]com, and KeePass[.]me.\nBleepingComputer has confirmed that the keeppaswrd[.]com website is still active and continues to distribute the trojanized KeePass installer [\nVirusTotal\n].\nFake KeePass site pushing trojanized installer\nSource: BleepingComputer\nIn addition to dropping Cobalt Strike beacons, the trojanized KeePass program included password-stealing functionality that allowed the threat actors to steal any credentials that were inputted into the program.\n\"KeeLoader was not just modified to the extent it could act as a malware loader. Its functionality was extended to facilitate the exfiltration of KeePass database data,\" reads the WithSecure report.\n\"When KeePass database data was opened; account, login name, password, website, and comments information is also exported in CSV format under %localappdata% as .kp. This random integer value is between 100-999.\"\nDumping KeePass credentials\nSource: WithSecure\nUltimately, the attack investigated by WithSecure led to the company's VMware ESXi servers being encrypted with ransomware.\nFurther investigation into the campaign found an extensive infrastructure created to distribute malicious programs disguised as legitimate tools and phishing pages designed to steal credentials.\nThe aenys[.]com domain was used to host additional subdomains that impersonated well-known companies and services, such as WinSCP, PumpFun, Phantom Wallet, Sallie Mae, Woodforest Bank, and DEX Screener.\nEach of these was used to distribute different malware variants or steal credentials.\nWithSecure attributes this activity with moderate confidence to UNC4696, a threat actor group previously linked to\nNitrogen Loader campaigns\n. Previous Nitrogen campaigns were linked to the BlackCat/ALPHV ransomware.\nUsers are always advised to download software, especially highly sensitive ones like password managers, from legitimate sites and avoid any sites linked in advertisements.\nEven if an advertisement displays the correct URL for a software service, it should still be avoided, as\nthreat actors have repeatedly proven\nthat they can\ncircumvent ad policies\nto\ndisplay the legitimate URL\nwhile linking to imposter sites.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nRansomware gangs increasingly use Skitnet post-exploitation malware\nRansomware gangs join ongoing SAP NetWeaver attacks\nM&S says customer data stolen in cyberattack, forces password resets\nMoldova arrests suspect linked to DoppelPaymer ransomware attacks\nKickidler employee monitoring software abused in ransomware attacks"
    },
    {
        "Title": "O2 UK patches bug leaking mobile user location from call metadata",
        "Link": "https://www.bleepingcomputer.com/news/security/o2-uk-patches-bug-leaking-mobile-user-location-from-call-metadata/",
        "Summary": "A flaw in O2 UK's implementation of VoLTE and WiFi Calling technologies could allow anyone to expose the general location of a person and other identifiers by calling the target. [...]",
        "Date": "2025-05-19",
        "Content": "A flaw in O2 UK's implementation of VoLTE and WiFi Calling technologies could allow anyone to expose the general location of a person and other identifiers by calling the target.\nThe problem was discovered by security researcher Daniel Williams, who says the flaw existed on O2 UK's network since March 27, 2017, and was resolved yesterday.\nO2 UK is a British telecommunications service provider owned by Virgin Media O2. As of March 2025, the company reported having nearly 23 million mobile customers and 5.8 million broadband clients across the UK, positioning it as one of the major providers in the country.\nIn March 2017, the firm launched its IP Multimedia Subsystem (IMS) service, branded as \"4G Calling,\" for better audio quality and line reliability during calls.\nHowever, as Williams discovered while analyzing the traffic during such a call, the signalling messages (SIP Headers) exchanged between the communicating parties are far too verbose and revealing, including IMSI, IMEI, and cell location data.\n\"The responses I got from the network were extremely detailed and long, and were unlike anything I had seen before on other networks,\"\nexplains Williams\n.\n\"The messages contained information such as the IMS/SIP server used by O2 (Mavenir UAG) along with version numbers, occasional error messages raised by the C++ services processing the call information when something went wrong, and other debugging information.\"\nInformation exposed in the SIP Headers\nSource: mastdatabase.co.uk\nLocating users by call\nUsing the Network Signal Guru (NSG) app on a rooted Google Pixel 8, Williams intercepted raw IMS signalling messages exchanged during a call and decoded the cell ID to find the last cell tower the call recipient connected to.\nThen, he used public tools that provide cell tower maps to find the geographic coordinates of the tower.\nLocating the cell tower\nSource: mastdatabase.co.uk\nFor urban areas where tower coverage is dense, the accuracy would reach 100 m2 (1076 ft2). In rural areas, geo-locating would get less precise, but could still be revealing for the target.\nWilliams found the trick also worked when the target was abroad, as he located a test subject in Copenhagen, Denmark.\nTracking a person in Denmark\nSource: mastdatabase.co.uk\nO2 UK confirms fix\nWilliams says that he contacted O2 UK multiple times on March 26 and 27, 2025, to report his findings, receiving no answers.\nFinally, he got direct confirmation from O2 UK earlier today that the issue has been fixed, and he confirmed this through testing.\nIn a statement to BleepingComputer, a Virgin Media spokesperson confirmed that a fix has been implemented, noting that customers do not have to take any action to protect themselves.\n\"Our engineering teams have been working on and testing a fix for a number of weeks – we can confirm this is now fully implemented, and tests suggest the fix has worked, and our customers do not need to take any action,\" Virgin Media O2 told BleepingComputer.\nBleepingComputer asked O2 whether this flaw was known to be exploited and if they plan to inform customers accordingly, but we did not receive answer.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nBluetooth 6.1 enhances privacy with randomized RPA timing\nBrave's Cookiecrumbler tool taps community to help block cookie notices\nUK Legal Aid Agency confirms applicant data stolen in data breach\nAndroid 16 expands 'Advanced Protection' with device-level security\nGoogle to pay $1.375 billion to settle Texas data privacy violations"
    },
    {
        "Title": "Windows 10 emergency updates fix BitLocker recovery issues",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-emergency-updates-fix-bitlocker-recovery-issues/",
        "Summary": "Microsoft has released out-of-band updates to fix a known issue causing Windows 10 systems to boot into BitLocker recovery after installing the May 2025 security updates. [...]",
        "Date": "2025-05-19",
        "Content": "Microsoft has released out-of-band updates to fix a known issue causing Windows 10 systems to boot into BitLocker recovery after installing the May 2025 security updates.\nTo fix systems stuck at a BitLocker recovery prompt, install today's KB5061768 emergency update, available exclusively through the\nMicrosoft Update Catalog\n. This is also a cumulative update, meaning you won't have to install any previous updates before deploying the fix for the BitLocker recovery issue affecting your device.\nMicrosoft says that this known issue affects systems running Windows 10 22H2, Windows 10 Enterprise LTSC 2021, and Windows 10 IoT Enterprise LTSC 2021 with Intel vPro processors (10th gen or later) with Intel Trusted Execution Technology (TXT) enabled.\nConsumer devices running Home and Pro editions of Windows 10 are also unlikely to be impacted because home users don't typically use Intel vPro processors.\n\"On these systems, installing the May 13, 2025, Windows security update (KB5058379) might cause the Local Security Authority Subsystem Service (LSASS) process to terminate unexpectedly, triggering an Automatic Repair prompting for the BitLocker recovery key to continue,\" the company\nsaid\nin an advisory issued today.\nIf you can't immediately install the KB5061768 update to revive impacted devices, you can also try disabling the Intel Trusted Execution Technology (TXT) from the BIOS.\nBitLocker recovery screen (Microsoft)\n​The company\nacknowledged\nthe issue after a\nwave of reports\nfrom Windows users and admins seeing devices unexpectedly displaying a BitLocker recovery screen after entering the Windows Recovery Environment (WinRE) and after installing the\nKB5058379 cumulative update\nreleased as part of the\nMay 2025 Patch Tuesday\n.\nAccording to Redmond, impacted users who check the Windows Event Viewer can see LSASS errors and installation failure events with 0x800F0845 errors in the System event log.\n\"On affected devices, upon installing the update, Windows might fail to start enough times to trigger an Automatic Repair,\"\nthe company said\nin a Windows release health update. \"On devices with BitLocker enabled, BitLocker requires the input of your BitLocker recovery key to initiate an Automatic Repair.\"\nIn August 2022, Windows devices were hit by a similar issue, which caused devices to\nboot into the BitLocker recovery screen\nafter installing the KB5012170 security update.\nLast year, in August, Microsoft\nfixed another known issue\ntriggering BitLocker recovery prompts on Windows 10, Windows 11, and Windows Server systems after\ninstalling the July 2024 Windows security updates\n.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft confirms May Windows 10 updates trigger BitLocker recovery\nWindows 10 KB5058379 update triggers BitLocker recovery on some devices\nMicrosoft silently fixes Start menu bug affecting Windows 10 PCs\nMicrosoft fixes bug causing incorrect Windows Recovery errors\nMicrosoft: New Windows updates fix Active Directory policy issues"
    },
    {
        "Title": "Arla Foods confirms cyberattack disrupts production, causes delays",
        "Link": "https://www.bleepingcomputer.com/news/security/arla-foods-confirms-cyberattack-disrupts-production-causes-delays/",
        "Summary": "Arla Foods has confirmed to BleepingComputer that it was targeted by a cyberattack that has disrupted its production operations. [...]",
        "Date": "2025-05-19",
        "Content": "Arla Foods has confirmed to BleepingComputer that it was targeted by a cyberattack that has disrupted its production operations.\nThe Danish food giant clarified that the attack only affected its production unit in Upahl, Germany, though it expects this will result in product delivery delays or even cancellations.\n\"We can confirm that we have identified suspicious activity at our dairy site in Upahl that impacted the local IT network,\" stated an Arla spokesperson.\n\"Due to the safety measures initiated as a result of the incident, production was temporarily affected.\"\nArla Foods is an international dairy producer and a farmer-owned cooperative with 7,600 members. It employs 23,000 people in 39 countries.\nThe firm has an annual revenue of\n€13.8 billion\n($15.5 billion), and its products, including the brands Arla, Lurpak, Puck, Castello, and\nStarbucks\n, are sold in 140 countries worldwide.\nThe company told BleepingComputer that it is currently working to resume operations at the impacted facility, which should bring results before the end of the week.\n\"Since then, we've been working diligently to restore full operations. We expect to return to normal operations at the site in the next few days. Production at other Arla sites is not affected.\"\nConsidering that the first reports about a disruption at Arla's production operations\nsurfaced on Friday\n, it is bound to cause shortages in some cases.\n\"We have informed our affected customers about possible delivery delays and cancellations,\" explained Arla's spokesperson.\nBleepingComputer has asked the firm if the attack involved data theft or encryption, both staples of a ransomware attack, but Arla declined to share any additional information at this time.\nMeanwhile, there have been no announcements about Arla on ransomware extortion portals, so the type of attack and the perpetrators remain unknown.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nSteel giant Nucor Corporation facing disruptions after cyberattack\nMedical device maker Masimo warns of cyberattack, manufacturing delays\nHackers behind UK retail attacks now targeting US companies\nEducation giant Pearson hit by cyberattack exposing customer data\nVC giant Insight Partners confirms investor data stolen in breach"
    },
    {
        "Title": "Microsoft unveils Windows AI Foundry for AI-powered PC apps",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-unveils-windows-ai-foundry-for-ai-powered-pc-apps/",
        "Summary": "Microsoft is replacing 'Copilot Runtime' with Windows AI Foundry to help developers build, experiment, and reach users with AI experiences in their apps. [...]",
        "Date": "2025-05-19",
        "Content": "Microsoft is replacing 'Copilot Runtime' with Windows AI Foundry to help developers build, experiment, and reach users with AI experiences in their apps.\nWindows AI Foundry will not only include Microsoft's model but other open-source models as well, including those from Nvidia, such as NVIDIA NIM.\nWith these models, developers can integrate new AI experiences and models in their applications.\n\"In addition, Windows AI Foundry offers ready-to-use AI APIs that are powered by Windows inbox models on Copilot+ PCs for key language and vision tasks, like text intelligence, image description, text recognition, custom prompt and object erase,\" Microsoft announced in a\nblog post\n.\n\"We are announcing new capabilities like LoRA (low-rank-adaption) for finetuning our inbox SLM, Phi Silica, with custom data. We are also announcing new APIs for semantic search and knowledge retrieval so developers can build natural language search and RAG (retrieval-augmented generation) scenarios in their apps with their custom data.\"\nAI Foundry helps dev build new AI models for their PCs\nAI Foundry in Windows also makes it easier for developers to use powerful AI models on their PCs without needing a lot of setup or optimization. It checks what kind of hardware your computer has and then shows which AI models will work best.\nFor example, AI Foundry automatically matches models to your device's hardware, so if you're a developer, you don't have to figure it out.\nHere is the complete list of features:\nReady-to-use models:\nIt gives developers access to pre-trained open-source AI models (like those from Ollama, NVIDIA, and others) that are already optimized to run smoothly on different computer hardware, whether that's a CPU, GPU, or NPU (Neural Processing Unit).\nFoundry Local: T\nhis helps find and use the right models for your PC. You can install it using a simple command (winget install Microsoft.FoundryLocal).\nDeveloper tools:\nDevelopers also get a command-line tool (CLI) and an SDK (software kit) to easily test and add these models to their apps.\nAll of these features will soon be built directly into Windows 11 and the Windows App SDK.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nWindows 11 KB5055627 update released with 30 new changes, fixes\nWindows 11's Recall AI is now rolling out on Copilot+ PCs\nMicrosoft: Some devices offered Windows 11 upgrades despite Intune blocks\nMicrosoft: New Windows updates fix Active Directory policy issues\nWindows 11 tests sharing apps screen and files with Copilot AI"
    },
    {
        "Title": "Microsoft confirms new \"Advanced\" Settings for Windows 11",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-confirms-new-advanced-settings-for-windows-11/",
        "Summary": "At the Build 2025 developer conference, Microsoft announced a new 'Advanced Settings' feature to help users and developers personalize the OS experience. [...]",
        "Date": "2025-05-19",
        "Content": "At the Build 2025 developer conference, Microsoft announced a new 'Advanced Settings' feature to help users and developers personalize the OS experience.\nWith 'Advanced' settings, you can customize several features of Windows 11, such as File Explorer and Virtual Machines.\nThe new 'Advanced' Settings page can be accessed from Settings > System > Advanced. It replaces the 'For developers' tab in the Settings and retains all of the features.\nUnlike the old For Developers page, it gives users more control over how files and folders are shown and how version control works. At the top, you can see options like:\nShow file extensions: When turned on, you can see file types like .txt, .jpg, etc. after the file name.\nShow hidden and system files: This shows files that are normally hidden by Windows, like system files.\nShow full path in title bar: This displays the full folder path at the top of File Explorer.\nShow option to run as different user in Start: If turned on, you can choose to run apps as another user.\nShow empty drives: This shows USB or other drives even when they have nothing in them.\nAt the bottom, there’s a new section called File Explorer + version control. It lets you link folders that are Git repositories. For example, the user has connected folders like:\nD:\\GitHub\\WSL\nD:\\GitHub\\terminal\nD:\\GitHub\\PowerToys\nThis is useful for developers who use Git, as it helps manage code versions directly from File Explorer. There's also a \"Choose folder\" button to add more Git folders.\nMicrosoft says the Advanced Settings page has been open-sourced on GitHub, and it will be maintained via the Windows Store.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft unveils Windows AI Foundry for AI-powered PC apps\nHackers earn $1,078,750 for 28 zero-days at Pwn2Own Berlin\nWindows 11 and Red Hat Linux hacked on first day of Pwn2Own\nWindows 11 KB5058411 and KB5058405 cumulative updates released\nWindows 11 upgrade block lifted after Safe Exam Browser fix"
    },
    {
        "Title": "Microsoft open-sources Windows Subsystem for Linux at Build 2025",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-open-sources-windows-subsystem-for-linux-at-build-2025/",
        "Summary": "Microsoft has open-sourced the Windows Subsystem for Linux (WSL), making its source code available on GitHub, except for a few components that are part of Windows. [...]",
        "Date": "2025-05-19",
        "Content": "Microsoft has open-sourced the Windows Subsystem for Linux (WSL), making its source code available on GitHub, except for a few components that are part of Windows.\nThis marks a milestone for a project that started as an experiment almost a decade ago but has grown to become a very popular tool in Windows.\nWSL was first introduced at Microsoft BUILD 2016 and was ultimately shipped in the Windows 10 Anniversary Update, allowing you to run Linux distributions directly in Windows.\nIts first release, WSL 1, utilized a compatibility layer that translated Linux system calls so they could communicate and work with the Windows NT kernel using a custom driver named lxcore.sys.\nIn 2019,\nMicrosoft released WSL 2\n, which included a\nreal Linux kernel\nrunning in a virtual machine that offered significant improvements, such as performance enhancements, GPU and systemd support, and the ability to run graphical applications.\nWindows Subsystem for Linux architecture\nSource: Microsoft\nNow, at Microsoft Build 2025, the company has made\nWSL open source\n, including its command-line tools (\nwsl.exe\nand\nwslg.exe\n), background services (\nwslservice.exe\n), and Linux-side daemons used to start networking, launch other daemons, and set up port forwarding.\n\"WSL could never have been what it is today without its community. Even without access to WSL's source code, people have been able to make major contributions that lead to what WSL is now,\" Microsoft's Pierre Boulay shared in an announcement.\n\"This is why we're incredibly excited to open-source WSL today. We've seen how much the community has contributed to WSL without access to the source code, and we can't wait to see how WSL will evolve now that the community can make direct code contributions to the project.\"\nThe only components that are not open-sourced, as they are part of Windows, are Lxcore.sys, the kernel driver for WSL 1, and P9rdr.sys and p9np.dll, which are used for the \"\\\\wsl.localhost\" filesystem redirection.\nThe release of this source allows developers to inspect the code, build it themselves, submit improvements, and understand how WSL works under the hood.\nBy going open source, Microsoft also hopes the developer community will become more involved and submit new features, enhancements, and bug fixes.\nFor more information about the Windows Subsystem for Linux architecture and components, you can visit\nhttps://wsl.dev\n.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft unveils Windows AI Foundry for AI-powered PC apps\nNew 'Defendnot' tool tricks Windows into disabling Microsoft Defender\nGoogle Chrome to block admin-level browser launches for better security\nMicrosoft May 2025 Patch Tuesday fixes 5 exploited zero-days, 72 flaws\nMicrosoft Teams will soon block screen capture during meetings"
    },
    {
        "Title": "UK Legal Aid Agency confirms applicant data stolen in data breach",
        "Link": "https://www.bleepingcomputer.com/news/security/uk-legal-aid-agency-confirms-applicant-data-stolen-in-data-breach/",
        "Summary": "The United Kingdom's Legal Aid Agency (LAA) has confirmed that a recent cyberattack is more serious than first believed, with hackers stealing a large trove of sensitive applicant data in a data breach. [...]",
        "Date": "2025-05-19",
        "Content": "The United Kingdom's Legal Aid Agency (LAA) has confirmed that a recent cyberattack is more serious than first believed, with hackers stealing a large trove of sensitive applicant data in a data breach.\nThis confirmation of the data breach incident comes from the UK government, which was closely involved in the investigations that followed the initial disclosure.\nLAA is an executive agency of the UK Ministry of Justice responsible for administering legal aid in the form of advice, representation, and justice to those who can't afford to pay for it themselves.\nEligibility for legal aid depends on the recipient's income and assets as well as the merits of the case, related to family law, housing, debt, immigration, mental health, and criminal law.\nEarlier this month, the agency disclosed it\nsuffered a security incident\nwhere limited financial information may have been exposed.\nAn update published in a UK government portal paints a more dire picture of the situation, informing that large amounts of data, dating from 2010 and onward, may have been compromised.\n\"On Friday 16 May, we discovered the attack was more extensive than originally understood and that the group behind it had accessed a large amount of information relating to legal aid applicants,\"\nreads the announcement\n.\n\"We believe the group has accessed and downloaded a significant amount of personal data from those who applied for legal aid through our digital service since 2010.\"\nThe data that may have been exposed includes applicants\nContact details\nDates of birth\nNational ID numbers\nCriminal history\nEmployment status\nContribution amounts, debts, and payments\nThe UK government advises all applicants to stay vigilant for potential scam attempts targeting them. It recommends verifying all communications before any sensitive information is shared with the other party.\nJane Harbottle, Chief Executive Officer of the Legal Aid Agency, apologized for the situation, stating that she is \"extremely sorry this has happened,\" and promising to provide more updates soon.\nMeanwhile, all LAA systems have been secured with the help of the National Cyber Security Centre (NCSC), and the online application service has been taken offline temporarily.\nThe incident came at a time when UK retailers like the Co-op, Harrods, and Marks & Spencer (M&S), dealt with catastrophic attacks believed to have been carried out by threat actors associated with Scattered Spider, who attempted to deploy DragonForce ransomware on compromised networks.\nIt is unclear if the LAA incident is linked to those attacks, which, according to Google security researchers, have now moved to\ntargeting the U.S\n.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nNova Scotia Power confirms hackers stole customer data in cyberattack\nAustralian Human Rights Commission leaks docs to search engines\nFashion giant Dior discloses cyberattack, warns of data breach\nM&S says customer data stolen in cyberattack, forces password resets\nVC giant Insight Partners confirms investor data stolen in breach"
    },
    {
        "Title": "Mozilla fixes Firefox zero-days exploited at hacking contest",
        "Link": "https://www.bleepingcomputer.com/news/security/mozilla-fixes-firefox-zero-days-exploited-at-hacking-contest/",
        "Summary": "Mozilla released emergency security updates to address two Firefox zero-day vulnerabilities demonstrated in the recent Pwn2Own Berlin 2025 hacking competition. [...]",
        "Date": "2025-05-19",
        "Content": "Mozilla released emergency security updates to address two Firefox zero-day vulnerabilities demonstrated in the recent Pwn2Own Berlin 2025 hacking competition.\nThe fixes, which include the Firefox on Desktop and Android and two Extended Support Releases (ESR), came mere hours after the conclusion of Pwn2Own, on Saturday, where the second vulnerability was demonstrated.\nThe first flaw, tracked under\nCVE-2025-4918\n, is an out-of-bounds read/write issue in the JavaScript engine when resolving Promise objects.\nThe flaw was demonstrated during\nDay 2 of the competition\nby Palo Alto Networks security researchers Edouard Bochin and Tao Yan, who earned $50,000 for their discovery.\nThe second flaw,\nCVE-2025-4919\n, allows attackers to perform out-of-bounds reads/writes on a JavaScript object by confusing array index sizes.\nIt was discovered by security researcher Manfred Paul, who gained unauthorized access within the program's renderer, winning $50,000 in the process.\nAlthough the flaws constitute significant risks for Firefox, with Mozilla rating them \"critical\" in its bulletins, the software vendor underlined that neither researchers could perform a sandbox escape, citing targeted strengthening on that front.\n\"Unlike prior years, neither participating group was able to escape our sandbox this year,\"\nexplained Firefox in the announcement\n.\n\"We have verbal confirmation that this is attributed to the recent architectural improvements to our Firefox sandbox which have neutered a wide range of such attacks.\"\nAlthough there are no indications that the two flaws have been exploited outside of Pwn2Own, their public demonstration could fuel real attacks soon.\nTo mitigate this risk, Mozilla engaged a diverse \"task force\" from across the globe that worked feverishly to develop fixes for the demonstrated exploits, test them, and push out security updates as soon as possible.\nFirefox users are recommended to upgrade to\nversion 138.0.4\n,\nESR 128.10.1\n, or\nESR 115.23.1\n.\nPwn2Own Berlin 2025\nconcluded on Saturday\nwith over a million USD in payouts and the STAR Labs SG team winning the 'Master or Pwn' title.\nTwo Firefox zero-days were also\ndemonstrated last year at Pwn2Own Vancouver 2024\n, with Mozilla fixing them the next day.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nHackers exploit VMware ESXi, Microsoft SharePoint zero-days at Pwn2Own\nMozilla warns Windows users of critical Firefox sandbox escape flaw\nHackers earn $1,078,750 for 28 zero-days at Pwn2Own Berlin\nMicrosoft Teams, Virtualbox, Tesla zero-days exploited at Pwn2Own\nWindows 11 and Red Hat Linux hacked on first day of Pwn2Own"
    },
    {
        "Title": "Hackers earn $1,078,750 for 28 zero-days at Pwn2Own Berlin",
        "Link": "https://www.bleepingcomputer.com/news/security/hackers-earn-1-078-750-for-28-zero-days-at-pwn2own-berlin/",
        "Summary": "The Pwn2Own Berlin 2025 hacking competition has concluded, with security researchers earning $1,078,750 after exploiting 29 zero-day vulnerabilities and encountering some bug collisions. [...]",
        "Date": "2025-05-19",
        "Content": "The Pwn2Own Berlin 2025 hacking competition has concluded, with security researchers earning $1,078,750 after exploiting 29 zero-day vulnerabilities and encountering some bug collisions.\nThroughout the contest, they targeted enterprise technologies in the AI, web browser, virtualization, local privilege escalation, servers, enterprise applications, cloud-native/container, and automotive categories.\nAccording to\nPwn2Own's rules\n, all targeted devices had all security updates installed and ran the latest operating system versions.\nWhile Tesla also provided two 2025 Tesla Model Y and 2024 Tesla Model 3 bench-top units, security researchers who joined the contest haven't registered any attempts in this category before Pwn2Own started.\nCompetitors collected $260,000 in cash awards after\nthe first day\nand another $435,000 on\nthe second day\nafter exploiting 20 zero-day vulnerabilities. On\nthe third day\nof Pwn2Own, they collected another $383,750 for eight more zero-days.\nAfter these vulnerabilities are demoed during Pwn2Own events, vendors have 90 days to release security updates before TrendMicro's Zero Day Initiative publicly discloses them.\nPwn2Own Berlin 2025 final rankings (ZDI)\n​The STAR Labs SG team won this year's edition of Pwn2Own Berlin with 35 Master of Pwn points and $320,000 earned throughout the three-day contest after hacking Red Hat Enterprise Linux, Docker Desktop, Windows 11, VMware ESXi, and Oracle VirtualBox.\nSTAR Labs' Nguyen Hoang Thach won the competition's highest reward of $150,000 after using an integer overflow exploit to hack the VMware ESXi hypervisor software.\nTeam Viettel Cyber Security took second place after demonstrating zero-day flaws that could let attackers escape to the host system from Oracle VirtualBox guests and hack Microsoft SharePoint using an exploit chain combining an auth bypass and an insecure deserialization.\nOn the third day, team Reverse Tactics again hacked VMware's hypervisor software using an exploit chain abusing an integer overflow and an uninitialized variable bug to earn $112,500 and take third place in the rankings.\nMozilla\nhas already patched\nthe two Firefox zero-day bugs (\nCVE-2025-4918\nand\nCVE-2025-4919\n) demoed during the competition after releasing Firefox 138.0.4, Firefox ESR 128.10.1, Firefox ESR 115.23.1, and a new Firefox for Android version over the weekend to address them.\nIn March 2024, Mozilla\nfixed two other zero-day vulnerabilities\nin the Firefox web browser (\nCVE-2024-29943\nand\nCVE-2024-29944\n) after security researcher Manfred Paul exploited and reported them at Pwn2Own Vancouver 2024.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nHackers exploit VMware ESXi, Microsoft SharePoint zero-days at Pwn2Own\nWindows 11 and Red Hat Linux hacked on first day of Pwn2Own\nMicrosoft Teams, Virtualbox, Tesla zero-days exploited at Pwn2Own\nMozilla fixes Firefox zero-days exploited at hacking contest\nMicrosoft unveils Windows AI Foundry for AI-powered PC apps"
    },
    {
        "Title": "'Operation RoundPress' Targets Ukraine in XSS Webmail Attacks",
        "Link": "https://www.darkreading.com/threat-intelligence/operation-roundpress-ukraine-xss-webmail-attacks",
        "Summary": "A cyber-espionage campaign is targeting Ukrainian government entities with a series of sophisticated spear-phishing attacks that exploit XSS vulnerabilities.",
        "Date": "2025-05-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/operation-roundpress-ukraine-xss-webmail-attacks"
    },
    {
        "Title": "S. Dakota CIO Gottumukkala Signs on as CISA Deputy Director",
        "Link": "https://www.darkreading.com/threat-intelligence/gottumukkala-cisa-deputy-director",
        "Summary": "The addition is an important hire for the No. 2 position at the cyber agency. The main director role remains unfilled post-Easterly, with Bridget Bean taking over acting duties for now.",
        "Date": "2025-05-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/gottumukkala-cisa-deputy-director"
    },
    {
        "Title": "Legal Aid Agency Warns Lawyers, Defendants on Data Breach",
        "Link": "https://www.darkreading.com/remote-workforce/legal-aid-agency-data-breach",
        "Summary": "The online service has since been shut down as the agency grapples with the cyberattack, though it assures the public that those most in need of legal assistance will still be able to access help.",
        "Date": "2025-05-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/remote-workforce/legal-aid-agency-data-breach"
    },
    {
        "Title": "CVE Disruption Threatens Foundations of Defensive Security",
        "Link": "https://www.darkreading.com/threat-intelligence/cve-disruption-threatens-foundations-defensive-security",
        "Summary": "If the Common Vulnerabilities and Exposures system continues to face uncertainty, the repercussions will build slowly, and eventually the cracks will become harder to contain.",
        "Date": "2025-05-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/cve-disruption-threatens-foundations-defensive-security"
    },
    {
        "Title": "BreachRx Lands $15 Million as Investors Bet on Breach-Workflow Software",
        "Link": "https://www.securityweek.com/breachrx-lands-15-million-as-investors-bet-on-breach-workflow-software/",
        "Summary": "<p>San Francisco incident response coordination startup banks $15 million in a Series A funding round led by Ballistic Ventures.</p>\n<p>The post <a href=\"https://www.securityweek.com/breachrx-lands-15-million-as-investors-bet-on-breach-workflow-software/\">BreachRx Lands $15 Million as Investors Bet on Breach-Workflow Software</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/breachrx-lands-15-million-as-investors-bet-on-breach-workflow-software/"
    },
    {
        "Title": "Printer Company Procolored Served Infected Software for Months",
        "Link": "https://www.securityweek.com/printer-company-procolored-served-infected-software-for-months/",
        "Summary": "<p>Procolored’s public website served dozens of software downloads containing information stealer malware and a backdoor.</p>\n<p>The post <a href=\"https://www.securityweek.com/printer-company-procolored-served-infected-software-for-months/\">Printer Company Procolored Served Infected Software for Months</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/printer-company-procolored-served-infected-software-for-months/"
    },
    {
        "Title": "UK Legal Aid Agency Finds Data Breach Following Cyberattack",
        "Link": "https://www.securityweek.com/uk-legal-aid-agency-finds-data-breach-following-cyberattack/",
        "Summary": "<p>The UK’s Legal Aid Agency was targeted in a cyberattack in April and it recently determined that hackers have stolen sensitive data.</p>\n<p>The post <a href=\"https://www.securityweek.com/uk-legal-aid-agency-finds-data-breach-following-cyberattack/\">UK Legal Aid Agency Finds Data Breach Following Cyberattack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/uk-legal-aid-agency-finds-data-breach-following-cyberattack/"
    },
    {
        "Title": "480,000 Catholic Health Patients Impacted by Serviceaide Data Leak",
        "Link": "https://www.securityweek.com/480000-catholic-health-patients-impacted-by-serviceaide-data-leak/",
        "Summary": "<p>Serviceaide exposed a database containing personal and medical information belonging to Catholic Health patients.</p>\n<p>The post <a href=\"https://www.securityweek.com/480000-catholic-health-patients-impacted-by-serviceaide-data-leak/\">480,000 Catholic Health Patients Impacted by Serviceaide Data Leak</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/480000-catholic-health-patients-impacted-by-serviceaide-data-leak/"
    },
    {
        "Title": "Spiking Neural Networks: Brain-Inspired Chips That Could Keep Your Data Safe",
        "Link": "https://www.securityweek.com/spiking-neural-networks-brain-inspired-chips-that-could-keep-your-data-safe/",
        "Summary": "<p>Neuromorphic computing is moving from theory to reality, with brain-inspired processors offering real-time intelligence, low power consumption, and built-in privacy—ushering in a new era for edge devices and cybersecurity.</p>\n<p>The post <a href=\"https://www.securityweek.com/spiking-neural-networks-brain-inspired-chips-that-could-keep-your-data-safe/\">Spiking Neural Networks: Brain-Inspired Chips That Could Keep Your Data Safe</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/spiking-neural-networks-brain-inspired-chips-that-could-keep-your-data-safe/"
    },
    {
        "Title": "200,000 Harbin Clinic Patients Impacted by NRS Data Breach",
        "Link": "https://www.securityweek.com/200000-harbin-clinic-patients-impacted-by-nrs-data-breach/",
        "Summary": "<p>Harbin Clinic says the information of over 200,000 patients was stolen in a July 2024 data breach at Nationwide Recovery Services.</p>\n<p>The post <a href=\"https://www.securityweek.com/200000-harbin-clinic-patients-impacted-by-nrs-data-breach/\">200,000 Harbin Clinic Patients Impacted by NRS Data Breach</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/200000-harbin-clinic-patients-impacted-by-nrs-data-breach/"
    },
    {
        "Title": "Prison Sentence for Man Involved in SEC X Account Hack",
        "Link": "https://www.securityweek.com/prison-sentence-for-man-involved-in-sec-x-account-hack/",
        "Summary": "<p>Eric Council Jr. was sentenced to prison for hacking SEC’s official X account and publishing fraudulent posts increasing Bitcoin value.</p>\n<p>The post <a href=\"https://www.securityweek.com/prison-sentence-for-man-involved-in-sec-x-account-hack/\">Prison Sentence for Man Involved in SEC X Account Hack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/prison-sentence-for-man-involved-in-sec-x-account-hack/"
    },
    {
        "Title": "Hackers Earn Over $1 Million at Pwn2Own Berlin 2025",
        "Link": "https://www.securityweek.com/hackers-earn-over-1-million-at-pwn2own-berlin-2025/",
        "Summary": "<p>Pwn2Own participants demonstrated exploits against VMs, AI, browsers, servers, containers, and operating systems.</p>\n<p>The post <a href=\"https://www.securityweek.com/hackers-earn-over-1-million-at-pwn2own-berlin-2025/\">Hackers Earn Over $1 Million at Pwn2Own Berlin 2025</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-19",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/hackers-earn-over-1-million-at-pwn2own-berlin-2025/"
    }
]