[
    {
        "Title": "Meta to Train AI on E.U. User Data From May 27 Without Consent; Noyb Threatens Lawsuit",
        "Link": "https://thehackernews.com/2025/05/meta-to-train-ai-on-eu-user-data-from.html",
        "Summary": "Austrian privacy non-profit noyb (none of your business) has sent Meta's Irish headquarters a cease-and-desist letter, threatening the company with a class action lawsuit if it proceeds with its plans to train users' data for training its artificial intelligence (AI) models without an explicit opt-in.\nThe move comes weeks after the social media behemoth announced its plans to train its AI models",
        "Date": "2025-05-15",
        "Content": "Austrian privacy non-profit noyb (none of your business) has sent Meta's Irish headquarters a cease-and-desist letter, threatening the company with a class action lawsuit if it proceeds with its plans to train users' data for training its artificial intelligence (AI) models without an explicit opt-in.\nThe move comes weeks after the social media behemoth\nannounced\nits plans to train its AI models using public data shared by adults across Facebook and Instagram in the European Union (E.U.) starting May 27, 2025, after it paused the efforts in June 2024 following concerns raised by Irish data protection authorities.\n\"Instead of asking consumers for opt-in consent, Meta relies on an alleged 'legitimate interest' to just suck up all user data,\" noyb\nsaid\nin a statement. \"Meta may face massive legal risks – just because it relies on an 'opt-out' instead of an 'opt-in' system for AI training.\"\nThe advocacy group further noted that Meta AI is not compliant with the General Data Protection Regulation (GDPR) in the region, and that, besides claiming that it has a \"\nlegitimate interest\n\" in taking user data for AI training, the company is also limiting the right to opt-out before the training has started.\nNoyb also pointed out that even if 10% of Meta's users expressly agree to hand over the data for this purpose, it would amount to enough data points for the company to learn E.U. languages.\nIt's worth pointing out that Meta previously\nclaimed\nthat it needed to collect this information to capture the diverse languages, geography, and cultural references of the region.\n\"Meta starts a huge fight just to have an opt-out system instead of an opt-in system,\" noyb's Max Schrems said. \"Instead, they rely on an alleged 'legitimate interest' to just take the data and run with it. This is neither legal nor necessary.\"\n\"Meta's absurd claims that stealing everyone's personal data is necessary for AI training is laughable. Other AI providers do not use social network data – and generate even better models than Meta.\"\nThe privacy group also accused the company of moving ahead with its plans by putting the onus on users and pointed out that national data protection authorities have largely stayed silent on the legality of AI training without consent.\n\"It therefore seems that Meta simply moved ahead anyways – taking another huge legal risk in the E.U. and trampling over users' rights,\" noyb added.\nIn a statement shared with Reuters, Meta has\nrejected\nnoyb's arguments, stating they are wrong on the facts and the law, and that it has provided E.U. users with a \"clear\" option to object to their data being processed for AI training.\nThis is not the first time Meta's reliance on GDPR's \"legitimate interest\" to collect data without explicit opt-in consent has come under scrutiny. In August 2023, the company\nagreed\nto change the legal basis from \"legitimate interest\" to a consent-based approach to process user data for serving targeted ads for people in the region.\nThe disclosure comes as the Belgian Court of Appeal\nruled\nthe\nTransparency and Consent Framework\n, used by Google, Microsoft, Amazon, and other companies to obtain consent for data processing for personalized advertising purposes, is\nillegal\nacross Europe, citing violation of several principles of GDPR laws.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Coinbase Agents Bribed, Data of ~1% Users Leaked; $20M Extortion Attempt Fails",
        "Link": "https://thehackernews.com/2025/05/coinbase-agents-bribed-data-of-1-users.html",
        "Summary": "Cryptocurrency exchange Coinbase has disclosed that unknown cyber actors broke into its systems and stole account data for a small subset of its customers.\n\"Criminals targeted our customer support agents overseas,\" the company said in a statement. \"They used cash offers to convince a small group of insiders to copy data in our customer support tools for less than 1% of Coinbase monthly",
        "Date": "2025-05-15",
        "Content": "Cryptocurrency exchange Coinbase has disclosed that unknown cyber actors broke into its systems and stole account data for a small subset of its customers.\n\"Criminals targeted our customer support agents overseas,\" the company\nsaid\nin a statement. \"They used cash offers to convince a small group of insiders to copy data in our customer support tools for less than 1% of Coinbase monthly transacting users.\"\nThe end goal of the campaign was to put together a list of customers who they contact by masquerading as Coinbase and deceiving them into handing over their cryptocurrency assets.\nCoinbase said the threat actors then unsuccessfully\nattempted\nto extort the company for $20 million on May 11, 2025, by claiming to have information about certain customer accounts as well as internal documents. In a\nstatement\nshared with Fortune, Coinbase said the compromised customer agents worked in India and have all been fired.\n\"No passwords, private keys, or funds were exposed and Coinbase Prime accounts are untouched,\" Coinbase noted. What the attackers got away with are listed below -\nName, address, phone, and email\nMasked Social Security (last 4 digits only)\nMasked bank‑account numbers and some bank account identifiers\nGovernment ID images (e.g., driver's license, passport)\nAccount data (balance snapshots and transaction history)\nLimited corporate data, including documents, training material, and communications available to support agents\nThe crypto giant said it's taking the step of reimbursing customers who were tricked into transferring funds to the attacker due to social engineering attacks. It's exactly not clear how many customers fell for the scam, but the company\ntold\nTechCrunch that less than 1% of its 9.7 million monthly customers were affected.\nThe company is also enforcing added ID checks for certain flagged accounts when carrying out large withdrawals, and that it's hardening its defenses to counter such insider threats. Lastly, Coinbase has established a $20 million reward fund for information leading to the arrest and conviction of the attackers.\nAs mitigations, users are advised to turn on\nwithdrawal allow‑listing\nto permit transfers only to addresses in their address books, enable two-factor authentication (2FA), and be cautious about imposters who try to move funds to a safe wallet.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Pen Testing for Compliance Only? It's Time to Change Your Approach",
        "Link": "https://thehackernews.com/2025/05/pen-testing-for-compliance-only-its.html",
        "Summary": "Imagine this: Your organization completed its annual penetration test in January, earning high marks for security compliance. In February, your development team deployed a routine software update. By April, attackers had already exploited a vulnerability introduced in that February update, gaining access to customer data weeks before being finally detected.\nThis situation isn't theoretical: it",
        "Date": "2025-05-15",
        "Content": "Imagine this: Your organization completed its annual penetration test in January, earning high marks for security compliance. In February, your development team deployed a routine software update. By April, attackers had already exploited a vulnerability introduced in that February update, gaining access to customer data weeks before being finally detected.\nThis situation isn't theoretical: it plays out repeatedly as organizations realize that point-in-time compliance testing can't protect against vulnerabilities introduced after the assessment. According to\nVerizons 2025 Data Breach Investigation Report\n, the exploitation of vulnerabilities rose 34% year-over-year. While compliance frameworks provide important security guidelines, companies need continuous security validation to identify and remediate new vulnerabilities before attackers can exploit them.\nHere's what you need to know about pen testing to meet compliance standards — and why you should adopt continuous penetration testing, if your penetration testing goals go beyond minimum standards.\nThe current state of pen testing\nCompliance-driven pen testing\nIf your organization is like many, you might conduct penetration tests primarily to satisfy regulatory frameworks like PCI DSS, HIPAA, SOC 2, or ISO 27001. But if your pen testing focuses on simply checking off compliance boxes — instead of developing comprehensive security postures — you're creating a dangerous disconnect between security theater and actual threat protection.\nLimitations\nCompliance-focused pen testing has several limitations that leave organizations vulnerable.\nSurface-level security:\nCompliance-focused penetration testing typically addresses only compliance-relevant vulnerabilities. If your organization focuses its pen testing exclusively on meeting compliance requirements, you're just scratching the surface — and missing the chance to identify vulnerabilities that fall outside the scope of regulatory frameworks. These undetected weaknesses can give attackers an attack vector into your systems, potentially leading to devastating data breaches and operational disruptions.\nStatic nature:\nCyber attackers and the digital landscape move fast. Compliance standards? Not so much. During the months (or years) it takes for regulatory frameworks to catch up with new threats – and the gaps between compliance-focused penetration tests – malicious actors are actively developing exploits for emerging vulnerabilities. By the time these weaknesses appear on compliance checklists, attackers may have already compromised countless systems.\nFalse sense of security:\nOrganizations often mistake compliance for security, believing a passing audit score means they're sufficiently protected. But the reality is that compliance certifications represent minimum standards that sophisticated attackers can easily bypass. Companies with successful audits may lower their guard when they should be working on strengthening their defenses beyond basic requirements.\nThe importance of continuous pen testing\nEmbracing\ncontinuous security testing\noffers organizations numerous benefits.\nBeyond compliance:\nProactive and continuous penetration testing can reveal vulnerabilities that scheduled compliance checks might miss. Skilled human testers can uncover complex security flaws in business logic, authentication systems, and data flows, while automated scans keep an eye on any changes that might happen over the development cycle. By implementing regular, comprehensive testing, your organization can stay ahead of attackers rather than merely satisfying auditors. You'll be doing much more than passing the next compliance review — you'll be developing a resilient security posture capable of withstanding more sophisticated threats.\nContinuous improvement:\nSecurity threats constantly change, forcing organizations to adopt ongoing testing instead of point-in-time assessments. And regular penetration tests can expose vulnerabilities before attackers can exploit them. For example,\nPen Testing as a Service (PTaaS)\nhelps organizations achieve continuous security validation without overwhelming internal teams. With PTaaS, your organization can detect new threats in time and quickly take steps to remediate them. Instead of reacting to breaches after they occur, PTaaS lets you stay a step ahead of attackers by using real-world testing to continuously strengthen your security.\nKey components of a pen testing strategy with security in mind\nTo implement penetration testing that truly helps safeguard your systems, focus on these key strategic components:\nRegular or continuous testing\nTo effectively address vulnerabilities in real time, your organization should regularly conduct penetration tests — including after significant system changes and before major deployments. Ultimately, your ideal pen testing frequency and depth\nwill depend on your assets\n— their complexity, criticality to your business operations and external exposure.\nFor example, if you have an online store that holds critical customer data and payment information — and is regularly updated with changes and plugins — you may want to employ continuous testing. On the other end of the spectrum, your marketing department's fall-campaign microsite may only need quarterly or annual assessments.\nIntegration with other security measures\nWant to maximize your organization's security effectiveness?\nCombine\npenetration testing with External Attack Surface Management (EASM). By identifying your digital footprint and testing critical applications based on the latest threat data, your team can prioritize high-risk vulnerabilities while ensuring no internet-facing assets remain unmonitored, unprotected or untested.\nCustomization and threat-led penetration tests\nYour organization faces unique security challenges based on your industry, technology stack, and business operations. By tailoring penetration testing, you can focus on your business's specific threat profile — testing the areas where breaches are most likely to occur based on the most active threat actors and those that would cause the most damage — rather than wasting time and resources on cookie-cutter assessments.\nOvercoming challenges\nDespite the clear benefits, many organizations struggle with common penetration testing implementation challenges related to resources and culture.\nResource allocation\nResource issues — including budget constraints and shortage of qualified security personnel — prevent many organizations from implementing adequate penetration testing programs. But PTaaS and combined discovery and testing services like\nOutpost24s CyberFlex service\nsolve these challenges by providing access to certified testers through a predictable subscription model, eliminating budget spikes and the expense of maintaining specialized in-house expertise.\nCultural shift\nTo move beyond compliance-driven security, your organization's leadership must champion a cultural shift prioritizing continuous testing and proactive risk management. When security becomes embedded in your organizational culture, pen testing transforms from a periodic checklist item into an ongoing process of discovering and addressing vulnerabilities before attackers can exploit them.\nTaking action with integrated solutions\nFor the greatest level of security, your organization must know every application in your environment and test each one thoroughly. And a combined solution like\nOutpost24's CyberFlex\ncan help. Integrating EASM and PTaaS on a platform level, allows cybersecurity experts to identify all internet-facing applications, use detailed categorizations to prioritize risks, and test business-critical applications with flexible, human-led assessments. By shifting to proactive penetration testing, your organization can prevent attacks before they happen — and satisfy compliance requirements.\nReady to go beyond compliance and elevate your application security?\nRequest your CyberFlex live demo today.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "New Chrome Vulnerability Enables Cross-Origin Data Leak via Loader Referrer Policy",
        "Link": "https://thehackernews.com/2025/05/new-chrome-vulnerability-enables-cross.html",
        "Summary": "Google on Wednesday released updates to address four security issues in its Chrome web browser, including one for which it said there exists an exploit in the wild.\nThe high-severity vulnerability, tracked as CVE-2025-4664 (CVSS score: 4.3), has been characterized as a case of insufficient policy enforcement in a component called Loader.\n\"Insufficient policy enforcement in Loader in Google",
        "Date": "2025-05-15",
        "Content": "Google on Wednesday\nreleased\nupdates to address four security issues in its Chrome web browser, including one for which it said there exists an exploit in the wild.\nThe high-severity vulnerability, tracked as\nCVE-2025-4664\n(CVSS score: 4.3), has been characterized as a case of insufficient policy enforcement in a component called Loader.\n\"Insufficient policy enforcement in Loader in Google Chrome prior to 136.0.7103.113 allowed a remote attacker to leak cross-origin data via a crafted HTML page,\" according to a\ndescription\nof the flaw.\nThe tech giant credited security researcher Vsevolod Kokorin (@slonser_) with detailing the flaw in X on May 5, 2025, adding it's aware \"an exploit for CVE-2025-4664 exists in the wild.\"\n\"Unlike other browsers, Chrome resolves the Link header on sub-resource requests,\" Kokorin\nsaid\nin a series of posts on X earlier this month. \"The issue is that the Link header can set a referrer-policy. We can specify unsafe-url and capture the full query parameters.\"\nThe researcher went on to add that query parameters can contain sensitive data that can lead to a full account takeover and that the query parameter information can be stolen via an image from a third-party resource.\nIt's not clear if the vulnerability was exploited in a malicious context outside of this proof-of-concept (PoC) demonstration. CVE-2025-4664 is the second vulnerability after\nCVE-2025-2783\nto have come under \"active exploitation\" in the wild.\nTo safeguard against potential threats, it's advised to update their Chrome browser to versions 136.0.7103.113/.114 for Windows and Mac, and 136.0.7103.113 for Linux. Users of other Chromium-based browsers such as Microsoft Edge, Brave, Opera, and Vivaldi are also advised to apply the fixes as and when they become available.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "5 BCDR Essentials for Effective Ransomware Defense",
        "Link": "https://thehackernews.com/2025/05/top-5-bcdr-capabilities-for-ransomware-defense.html",
        "Summary": "Ransomware has evolved into a deceptive, highly coordinated and dangerously sophisticated threat capable of crippling organizations of any size. Cybercriminals now exploit even legitimate IT tools to infiltrate networks and launch ransomware attacks. In a chilling example, Microsoft recently disclosed how threat actors misused its Quick Assist remote assistance tool to deploy the destructive",
        "Date": "2025-05-15",
        "Content": "Ransomware has evolved into a deceptive, highly coordinated and dangerously sophisticated threat capable of crippling organizations of any size. Cybercriminals now exploit even legitimate IT tools to infiltrate networks and launch ransomware attacks. In a chilling example,\nMicrosoft recently disclosed how threat actors misused its Quick Assist remote assistance tool\nto deploy the destructive Black Basta ransomware strain. And what’s worse? Innovations like Ransomware-as-a-Service (RaaS) are lowering the bar for entry, making ransomware attacks more frequent and far-reaching than ever before.\nAccording to Cybersecurity Ventures\n, by 2031, a new ransomware attack is expected every 2 seconds, with projected damages hitting an astronomical $275 billion annually.\nNo organization is immune to ransomware, and building a strong recovery strategy is equally, if not even more, important than attempting to prevent all attacks in the first place. A solid business continuity and disaster recovery (BCDR) strategy can be your last and most critical line of defense when ransomware breaks through, allowing you to bounce back quickly from the attack, resume operations and avoid paying ransom. Notably, the cost of investing in BCDR is negligible compared to the devastation that prolonged downtime or data loss can cause.\nIn this article, we’ll break down the five essential BCDR capabilities you should have in place to effectively recover from ransomware. These strategies can mean the difference between swift recovery and business failure after an attack. Let’s explore what every organization must do before it’s too late.\nFollow the 3-2-1 (and then some!) backup rule\nThe 3-2-1 backup rule has long been the gold standard: keep three copies of your data, store them on two different media and keep one copy off-site. But in the age of ransomware, that’s no longer enough.\nExperts now recommend the 3-2-1-1-0 strategy. The extra 1 stands for one immutable copy — a backup that can’t be changed or deleted. The 0 represents zero doubt in your ability to recover, with verified, tested recovery points.\nWhy the upgrade? Ransomware doesn’t just target production systems anymore. It actively seeks and encrypts backups as well. That’s why isolation, immutability and verification are key. Cloud-based and air-gapped backup storage provide essential layers of protection, keeping backups out of reach from threats that even use stolen admin credentials.\nHaving such immutable backups ensures recovery points remain untampered, no matter what. They’re your safety net when everything else is compromised. Plus, this level of data protection helps meet rising cyber insurance standards and compliance obligations.\nBonus tip:\nLook for solutions offering a hardened Linux architecture to camouflage and isolate backups outside of the common Windows attack surface.\nAutomate and monitor backups continuously\nAutomation is powerful, but without active monitoring, it can become your biggest blind spot. While scheduling backups and automating verification saves time, it’s just as important to ensure that those backups are actually happening and that they’re usable.\nUse built-in tools or custom scripting to monitor backup jobs, trigger alerts on failures and verify the integrity of your recovery points. It’s simple: either monitor continuously or risk finding out too late that your backups never had your back. Regularly testing and validating the recovery points is the only way to trust your recovery plan.\nBonus tip:\nChoose solutions that integrate with professional services automation (PSA) ticketing systems to automatically raise alerts and tickets for any backup hiccups.\nProtect your backup infrastructure from ransomware and internal threats\nYour backup infrastructure must be isolated, hardened and tightly controlled to prevent unauthorized access or tampering. You must:\nLock down your backup network environment.\nHost your backup server in a secure local area network (LAN) segment with no inbound internet access.\nAllow outbound communication from the backup server only to approved vendor networks. Block all unapproved outbound traffic using strict firewall rules.\nPermit communication only between protected systems and the backup server.\nUse firewalls and port-based access control lists (ACLs) on network switches to enforce granular access control.\nApply agent-level encryption so data is protected at rest, using keys generated from a secure passphrase only you control.\nEnforce strict access controls and authentication.\nImplement role-based access control (RBAC) with least-privilege roles for Tier 1 techs.\nEnsure multifactor authentication (MFA) for all access to the backup management console.\nMonitor audit logs continuously for privilege escalations or unauthorized role changes.\nEnsure audit logs are immutable.\nReview regularly for:\nSecurity-related events like failed logins, privilege escalations, deletion of backups and device removal.\nAdministrative actions such as changes to backup schedules, changes to retention settings, new user creation and changes to user roles.\nBackup and backup copy (replication) success/failure rates and backup verification success/failure rates.\nStay alert to serious risks.\nConfigure automatic alerts for policy violations and high-severity security events, such as an unauthorized change to backup retention policies.\nTest restores regularly and include them in your DR plan\nBackups mean nothing if you can’t restore from them quickly and completely, and that’s why regular testing is essential. Recovery drills must be scheduled and integrated into your disaster recovery (DR) plan. The goal is to build muscle memory, reveal weaknesses and confirm that your recovery plan actually works under pressure.\nStart by defining the recovery time objective (RTO) and the recovery point objective (RPO) for every system. These determine how fast and how recent your recoverable data needs to be. Testing against those targets helps ensure your strategy aligns with business expectations.\nImportantly, don’t limit testing to one type of restore. Simulate file-level recoveries, full bare-metal restores and full-scale cloud failovers. Each scenario uncovers different vulnerabilities, such as time delays, compatibility issues or infrastructure gaps.\nAlso, recovery is more than a technical task. Involve stakeholders across departments to test communication protocols, role responsibilities and customer-facing impacts. Who talks to clients? Who triggers the internal chain of command? Everyone should know their role when every second counts.\nDetect threats early with backup-level visibility\nWhen it comes to ransomware, speed of detection is everything. While endpoint and network tools often get the spotlight, your backup layer is also a powerful, often overlooked line of defense. Monitoring backup data for anomalies can reveal early signs of ransomware activity, giving you a critical head start before widespread damage occurs.\nBackup-level visibility allows you to detect telltale signs like sudden encryption, mass deletions or abnormal file modifications. For example, if a process begins overwriting file contents with random data while leaving all modified timestamps intact, that’s a major red flag. No legitimate program behaves that way. With smart detection at the backup layer, you can catch these behaviors and get alerted immediately.\nThis capability doesn’t replace your endpoint detection and response (EDR) or antivirus (AV) solutions; it supercharges them. It speeds up triage, helps isolate compromised systems faster and reduces an attack’s overall blast radius.\nFor maximum impact, choose backup solutions that offer real-time anomaly detection and support integration with your security information and event management (SIEM) or centralized logging systems. The faster you see the threat, the faster you can act — and that can be the difference between a minor disruption and a major disaster.\nBonus tip: Train end users to recognize and report suspicious activity early\nIf BCDR is your last line of defense, your end users are the first. Cybercriminals are increasingly targeting end users today.\nAccording to Microsoft Digital Defense Report 2024\n, threat actors are trying to access user credentials through various methods, such as phishing, malware and brute-force/password spray attacks. Over the last year, around 7,000 password attacks were blocked per second in Entra ID alone.\nIn fact, ransomware attacks often begin with a single click, usually via phishing emails or compromised credentials. Regular security training — especially simulated phishing exercises — helps build awareness of red flags and risky behaviors. Equip your team with the knowledge to spot ransomware warning signs, recognize unsafe data practices and respond appropriately.\nEncourage immediate reporting of anything that seems off. Foster a culture of enablement, not blame. When people feel safe to speak up, they’re more likely to take action. You can even take it further by launching internal programs that reward vigilance, such as a Cybersecurity Hero initiative to recognize and celebrate early reporters of potential threats.\nFinal thoughts\nRansomware doesn’t have to be feared; it has to be planned for. The five BCDR capabilities we discussed above will equip you to withstand even the most advanced ransomware threats and ensure your organization can recover quickly, completely and confidently.\nTo seamlessly implement these strategies, consider Datto BCDR, a unified platform that integrates all these capabilities. It’s built to help you stay resilient, no matter what happens. Don’t wait for a ransom note to discover that your backups weren’t enough.\nExplore how Datto can strengthen your ransomware resilience. Get custom Datto BCDR pricing today.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Russia-Linked APT28 Exploited MDaemon Zero-Day to Hack Government Webmail Servers",
        "Link": "https://thehackernews.com/2025/05/russia-linked-apt28-exploited-mdaemon.html",
        "Summary": "A Russia-linked threat actor has been attributed to a cyber espionage operation targeting webmail servers such as Roundcube, Horde, MDaemon, and Zimbra via cross-site scripting (XSS) vulnerabilities, including a then-zero-day in MDaemon, according to new findings from ESET.\nThe activity, which commenced in 2023, has been codenamed Operation RoundPress by the Slovak cybersecurity company. It has",
        "Date": "2025-05-15",
        "Content": "A Russia-linked threat actor has been attributed to a cyber espionage operation targeting webmail servers such as Roundcube, Horde, MDaemon, and Zimbra via cross-site scripting (XSS) vulnerabilities, including a then-zero-day in MDaemon, according to new findings from ESET.\nThe activity, which commenced in 2023, has been codenamed\nOperation RoundPress\nby the Slovak cybersecurity company. It has been attributed with medium confidence to the Russian state-sponsored hacking group tracked as APT28, which is also referred to as BlueDelta, Fancy Bear, Fighting Ursa, Forest Blizzard, FROZENLAKE, Iron Twilight, ITG05, Pawn Storm, Sednit, Sofacy, and TA422.\n\"The ultimate goal of this operation is to steal confidential data from specific email accounts,\" ESET researcher Matthieu Faou\nsaid\nin a report shared with The Hacker News. \"Most victims are governmental entities and defense companies in Eastern Europe, although we have observed governments in Africa, Europe, and South America being targeted as well.\"\nThis is not the first time APT28 has been tied to attacks exploiting flaws in webmail software. In June 2023, Recorded Future\ndetailed\nthe threat actor's abuse of multiple flaws in Roundcube (CVE-2020-12641, CVE-2020-35730, and CVE-2021-44026) to conduct reconnaissance and data gathering.\nSince then, other threat actors like\nWinter Vivern\nand\nUNC3707\n(aka GreenCube) have also targeted email solutions, including Roundcube in various campaigns over the years. Operation RoundPress' ties to APT28 stem from overlaps in the email address used to send the spear-phishing emails and\nsimilarities\nin the way certain servers were configured.\nA majority of the targets of the campaign in 2024 have been found to be Ukrainian governmental entities or defense companies in Bulgaria and Romania, some of which are producing Soviet-era weapons to be sent to Ukraine. Other targets include government, military, and academic organizations in Greece, Cameroon, Ecuador, Serbia, and Cyprus.\nThe attacks entail the exploitation of XSS vulnerabilities in Horde, MDaemon, and Zimbra to execute arbitrary JavaScript code in the context of the webmail window. It's worth noting that CVE-2023-43770 was\nadded\nby the U.S. Cybersecurity and Infrastructure Security Agency (CISA) to its Known Exploited Vulnerabilities (KEV) catalog in February 2024.\nWhile the attacks targeting Horde (an unspecified old flaw fixed in Horde Webmail 1.0 released in 2007), Roundcube (CVE-2023-43770), and Zimbra (\nCVE-2024-27443\n) leveraged security defects already known and patched, the MDaemon XSS vulnerability is assessed to have been used by the threat actor as a zero-day. Assigned the CVE identifier\nCVE-2024-11182\n(CVSS score: 5.3), it was patched in\nversion 24.5.1\nlast November.\n\"Sednit sends these XSS exploits by email,\" Faou said. \"The exploits lead to the execution of malicious JavaScript code in the context of the webmail client web page running in a browser window. Therefore, only data accessible from the victim's account can be read and exfiltrated.\"\nHowever, for the exploit to be successful, the target must be convinced to open the email message in the vulnerable webmail portal, assuming it's able to bypass the software's spam filters and land on the user's inbox. The contents of the email themselves are innocuous, as the malicious code that triggers the XSS flaw resides within the HTML code of the email message's body and, therefore, is not visible to the user.\nSuccessful exploitation leads to the execution of an obfuscated JavaScript payload named SpyPress that comes with the ability to steal webmail credentials and harvest email messages and contact information from the victim's mailbox. The malware, despite lacking a persistence mechanism, gets reloaded every time the booby-trapped email message is opened.\n\"In addition, we detected a few SpyPress.ROUNDCUBE payloads that have the ability to create Sieve rules,\" ESET said. \"SpyPress.ROUNDCUBE creates a rule that will send a copy of every incoming email to an attacker-controlled email address. Sieve rules are a feature of Roundcube and therefore the rule will be executed even if the malicious script is no longer running.\"\nThe gathered information is subsequently exfiltrated via an HTTP POST request to a hard-coded command-and-control (C2) server. Select variants of the malware have also been found to capture login history, two-factor authentication (2FA) codes, and even create an\napplication password\nfor MDAEMON to retain access to the mailbox even if the password or the 2FA code gets changed.\n\"Over the past two years, webmail servers such as Roundcube and Zimbra have been a major target for several espionage groups such as Sednit, GreenCube, and Winter Vivern,\" Faou said. \"Because many organizations don't keep their webmail servers up to date and because the vulnerabilities can be triggered remotely by sending an email message, it is very convenient for attackers to target such servers for email theft.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Malicious npm Package Leverages Unicode Steganography, Google Calendar as C2 Dropper",
        "Link": "https://thehackernews.com/2025/05/malicious-npm-package-leverages-unicode.html",
        "Summary": "Cybersecurity researchers have discovered a malicious package named \"os-info-checker-es6\" that disguises itself as an operating system information utility to stealthily drop a next-stage payload onto compromised systems.\n\"This campaign employs clever Unicode-based steganography to hide its initial malicious code and utilizes a Google Calendar event short link as a dynamic dropper for its final",
        "Date": "2025-05-15",
        "Content": "Cybersecurity researchers have discovered a malicious package named \"os-info-checker-es6\" that disguises itself as an operating system information utility to stealthily drop a next-stage payload onto compromised systems.\n\"This campaign employs clever Unicode-based steganography to hide its initial malicious code and utilizes a Google Calendar event short link as a dynamic dropper for its final payload,\" Veracode said in a r\neport\nshared with The Hacker News.\n\"Os-info-checker-es6\" was\nfirst published\nin the npm registry on March 19, 2025, by a user named \"kim9123.\" It has been downloaded\n2,001 times\nas of writing. The same user has also\nuploaded\nanother npm package called \"skip-tot\" that lists \"os-info-checker-es6\" as a dependency. The package has been downloaded\n94 times\n.\nWhile the initial five versions exhibited no signs of data exfiltration or malicious behavior, a subsequent iteration uploaded on May 7, 2025, has been found to include obfuscated code in the \"preinstall.js\" file to parse Unicode \"Private Use Access\" characters and extract a next-stage payload.\nThe malicious code, for its part, is designed to contact a Google Calendar event short link (\"calendar.app[.]google/<string>\") with a Base64-encoded string as the title, which decodes to a remote server with the IP address \"140.82.54[.]223.\" In other words, Google Calendar is a\ndead drop resolver\nto obfuscate the attacker-controlled infrastructure.\nHowever, no additional payloads are distributed at this point. This either indicates that the campaign is either still a work in progress, or currently dormant. Another possibility is that it has already concluded, or that the command-and-control (C2) server is designed to respond only to specific machines that meet certain criteria.\n\"This use of a legitimate, widely trusted service like Google Calendar as an intermediary to host the next C2 link is a clever tactic to evade detection and make blocking the initial stages of the attack more difficult,\" Veracode said.\nThe application security company and Aikido, which also\ndetailed\nthe activity, further noted that three other packages have listed \"os-info-checker-es6\" as a dependency, although it's suspected that the dependent packages are part of the same campaign -\nvue-dev-serverr\nvue-dummyy\nvue-bit\n\"The os-info-checker-es6 package represents a sophisticated and evolving threat within the npm ecosystem,\" Veracode said. \"The attacker demonstrated a progression from apparent testing to deploying a multi-stage malware.\"\nThe disclosure comes as software supply chain security company Socket highlighted typoquatting, Go repository caching abuse, obfuscation, multi-stage execution, slopsquatting, and abuse of legitimate services and developer tools as the six main adversarial techniques adopted by threat actors in the first half of 2025.\n\"To counter this, defenders must focus on behavioral signals, such as unexpected postinstall scripts, file overwrites, and unauthorized outbound traffic, while validating third-party packages before use,\" security researchers Kirill Boychenko and Philipp Burckhardt\nsaid\n.\n\"Static and dynamic analysis, version pinning, and close inspection of CI/CD logs are essential to detecting malicious dependencies before they reach production.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "ChatGPT will soon record, transcribe, and summarize your meetings",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-will-soon-record-transcribe-and-summarize-your-meetings/",
        "Summary": "OpenAI may be planning to challenge Microsoft Teams Copilot integration with a new \"Record\" feature in ChatGPT. [...]",
        "Date": "2025-05-15",
        "Content": "OpenAI may be planning to challenge Microsoft Teams Copilot integration with a new \"Record\" feature in ChatGPT.\nWhile ChatGPT supports third-party services, it's not yet possible to use it to summarize live meetings or generate an AI-powered transcript.\nAs\nspotted\nby X user M1Astra, ChatGPT mobile app code clearly mentions a “Record” feature for live meetings that supports pausing, resuming, and turning audio into text.\nReferences to new Record feature in ChatGPT mobile app\nWhen turned on, you'll be able to “drag to talk,” get detailed reports, and quickly generate summaries of your meetings.\nChatGPT also asks for mic and system audio access and reminds users to get consent before recording.\nThis clearly confirms OpenAI is planning to take on Microsoft Teams' Copilot integration.\nHowever, it likely works as an overlay inside ChatGPT that records your screen or mic, not as a direct integration with apps like Teams or Zoom.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nChatGPT is finally adding Download as PDF for Deep Research\nOpenAI document explains when to use each ChatGPT model\nGoogle takes on Cursor with Firebase Studio, its AI builder for vibe coding\nOpenAI's $20 ChatGPT Plus is now free for students until the end of May\nChatGPT is down worldwide with something went wrong error"
    },
    {
        "Title": "Windows 10 KB5058379 update triggers BitLocker recovery on some devices",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb5058379-update-triggering-bitlocker-recovery-after-install/",
        "Summary": "The Windows 10 KB5058379 cumulative update is triggering unexpected BitLocker recovery prompts on some devices afters it's installed and the computer restarted. [...]",
        "Date": "2025-05-15",
        "Content": "The Windows 10 KB5058379 cumulative update is triggering unexpected BitLocker recovery prompts on some devices afters it's installed and the computer restarted.\nOn May 13, Microsoft released the\nWindows 10 KB5058379 cumulative update\nas part of their\nMay 2025 Patch Tuesday\nupdates. This is a mandatory update as it contains security updates for vulnerabilities fixed by Microsoft, which included five actively exploited zero-day flaws.\nAs first spotted by\nWindows Latest\n, since the release of this update, some Windows users and admins have been reporting that after installing the update and restarting the device, the computer would automatically boot into the WinRE BitLocker recovery screen.\nWhile this is not impacting all Windows devices, there have been enough reports to indicate a problem with the update on some devices.\n\"We have about a half dozen laptops that experienced various intermittent issues after receiving the same KB - some require bitlocker keys to start up, others refusing to start at all,\" a Windows admin posted to\nReddit\n.\n\"The latest KB5058379 released May 13 quality update failed in Windows 10 devices. Some devices it caused triggering bitlocker key window after restart,\" another person posted to the\nMicrosoft forums\n.\nSoon after, numerous people responded to the posts stating that devices in their organizations were booting into WinRE and then shown the BitLocker recovery screen.\nThe Windows BitLocker recovery screen\nSource: Microsoft\nThere are reports of devices from Lenovo, Dell, and HP being impacted by this issue, so it's unclear what particular hardware or setting conflict is occurring.\nSome users reported on Reddit that they could boot into Windows again by disabling Intel Trusted Execution Technology (TXT) in the BIOS.\nTrusted Execution Technology (TXT) is a hardware-based security feature that verifies the integrity of system components before allowing sensitive operations to run.\nWhile Microsoft has not publicly acknowledged the issue, Microsoft Support allegedly told a user that they are aware of the issues.\n\"I would like to inform you that we are currently experiencing a known issue with the May Month Patch\nKB5058379\n, titled\n\"BitLocker Recovery Triggered on Windows 10 devices after installing KB5058379\"\non Windows 10 machines,\" an impacted user posted to\nReddit\n.\n\"A support ticket has already been raised with the Microsoft Product Group (PG) team, and they are actively working on a resolution.\"\nMicrosoft then shared the following steps for users to get back into Windows.\n1. Disable Secure Boot\nAccess the system’s BIOS/Firmware settings.\nLocate the\nSecure Boot\noption and set it to\nDisabled\n.\nSave the changes and reboot the device.\n2. Disable Virtualization Technologies (if issue persists)\nRe-enter BIOS/Firmware settings.\nDisable all virtualization options, including:\nIntel VT-d (VTD)\nIntel VT-x (VTX)\nNote: This action may prompt for the BitLocker recovery key, so please ensure the key is available.\n3. Check Microsoft Defender System Guard Firmware Protection Status\nYou can verify this in one of two ways:\nRegistry Method\nOpen Registry Editor (regedit).\nNavigate to: HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\DeviceGuard\\Scenarios\\SystemGuard\nCheck the Enabled DWORD value:\n1 → Firmware protection is enabled\n0 or missing → Firmware protection is disabled or not configured\nGUI Method (if available)\nOpen\nWindows Security > Device Security\n, and look under\nCore Isolation\nor\nFirmware Protection\n.\n4. Disable Firmware Protection via Group Policy (if restricted by policy)\nIf firmware protection settings are hidden due to Group Policy, follow these steps:\nUsing Group Policy Editor\nOpen gpedit.msc.\nNavigate to: Computer Configuration > Administrative Templates > System > Device Guard > Turn On Virtualization Based Security\nUnder\nSecure Launch Configuration\n, set the option to\nDisabled\n.\nOr via Registry Editor\n[HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\DeviceGuard\\Scenarios\\SystemGuard]\n\"Enabled\"=dword:00000000\nImportant:\nA system restart is required for this change to take effect.\nIt is strongly encouraged to test disabling TXT in the BIOS before disabling Secure Boot or virtualization features, as disabling them could have a significant impact on the device's security,  performance, and usability of virtualization software.\nBleepingComputer did not test these workarounds, so test them first before rolling out fixes to multiple devices.\nBleepingComputer contacted Microsoft to learn more about this issue and will update the story if we receive a response.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nWindows 10 KB5058379 update fixes SgrmBroker errors in Event Viewer\nWindows 10 KB5055612 preview update fixes a GPU bug in WSL2\nWindows 10 KB5055518 update fixes random text when printing\nMicrosoft: March Windows updates mistakenly uninstall Copilot\nWindows 11 KB5058411 and KB5058405 cumulative updates released"
    },
    {
        "Title": "Government webmail hacked via XSS bugs in global spy campaign",
        "Link": "https://www.bleepingcomputer.com/news/security/government-webmail-hacked-via-xss-bugs-in-global-spy-campaign/",
        "Summary": "Hackers are running a worldwide cyberespionage campaign dubbed 'RoundPress,' leveraging zero-day and n-day flaws in webmail servers to steal email from high-value government organizations. [...]",
        "Date": "2025-05-15",
        "Content": "Hackers are running a worldwide cyberespionage campaign dubbed 'RoundPress,' leveraging zero-day and n-day flaws in webmail servers to steal email from high-value government organizations.\nESET researchers who\nuncovered the operation\nattribute it with medium confidence to the Russian state-sponsored hackers\nAPT28\n(aka \"Fancy Bear\" or \"Sednit\").\nThe campaign started in 2023 and continued with the adoption of new exploits in 2024, targeting Roundcube, Horde, MDaemon, and Zimbra.\nNotable targets include governments in Greece, Ukraine, Serbia, and Cameroon, military units in Ukraine and Ecuador, defense companies in Ukraine, Bulgaria, and Romania, and critical infrastructure in Ukraine and Bulgaria.\nRoundPress targets\nSource: ESET\nOpen email, have data stolen\nThe attack starts with a spear-phishing email referencing current news or political events, often including excerpts from news articles to add legitimacy.\nA malicious JavaScript payload embedded in the HTML body of the email triggers the exploitation of a cross-site scripting (XSS) vulnerability in the webmail browser page used by the recipient.\nAll that is needed from the victim is to open the email to view it, as no other interaction/clicks, redirections, or data input is required for the malicious JavaScript script to execute.\nAttack chain overview\nSource: ESET\nThe payload has no persistence mechanisms, so it only executes when the malicious email is opened.\nThe script creates invisible input fields to trick browsers or password managers into autofilling stored credentials for the victim's email accounts.\nCredential stealer function\nSource: ESET\nAdditionally, it reads the DOM or sends HTTP requests to collect email message content, contacts, webmail settings, login history, two-factor authentication, and passwords.\nThe data is then exfiltrated to hardcoded command-and-control (C2) addresses using HTTP POST requests.\nEach script has a slightly different set of capabilities, adjusted for the product it's targeting.\nVulnerabilities targeted\nOperation RoundPress targeted multiple XSS flaws in various webmail products that important organizations commonly use to inject their malicious JS scripts.\nThe exploitation ESET associated with this campaign involves the following flaws:\nRoundcube –\nCVE-2020-35730\n: A stored XSS flaw the hackers used in 2023, by embedding JavaScript directly into the body of an email. When victims opened the email in a browser-based webmail session, the script executed in their context, enabling credential and data theft.\nRoundcube –\nCVE-2023-43770\n: An XSS vulnerability in how Roundcube handled hyperlink text leveraged in early 2024. Improper sanitization allowed attackers to inject <script> tags into the email content, which would be executed when viewed.\nMDaemon – CVE-2024-11182\n: A zero-day XSS flaw in the MDaemon Email Server's HTML parser, exploited by the hackers in late 2024. By crafting a malformed title attribute with a noembed tag, attackers could render a hidden <img onerror> payload, executing JavaScript. This enabled credential theft, 2FA bypass, and persistent access via App Passwords.\nHorde – Unknown XSS\n: APT28 attempted to exploit an old XSS vulnerability in Horde by placing a script in an <img onerror> handler. However, the attempt failed, likely due to built-in filtering in modern Horde versions. The exact flaw is unconfirmed but appears to have been patched in the meantime.\nZimbra – CVE-2024-27443\n: An XSS vulnerability in Zimbra's calendar invite handling, which hasn't been tagged as actively exploited before. Unsanitized input from the X-Zimbra-Calendar-Intended-For header allowed JavaScript injection into the calendar UI. APT28 embedded a hidden script that decoded and executed base64 JavaScript when the invite was viewed.\nAlthough ESET does not report any RoundPress activity for 2025, the hackers' methods could be easily applied to this year too, as there's a\nconstant supply\nof new XSS flaws in popular webmail products.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nFrance ties Russian APT28 hackers to 12 cyberattacks on French orgs\nNorth Korea ramps up cyberspying in Ukraine to assess war risk\nPro-Russia hacktivists bombard Dutch public orgs with DDoS attacks\nHackers abuse OAuth 2.0 workflows to hijack Microsoft 365 accounts\nState-sponsored hackers embrace ClickFix social engineering tactic"
    },
    {
        "Title": "FBI: US officials targeted in voice deepfake attacks since April",
        "Link": "https://www.bleepingcomputer.com/news/security/fbi-us-officials-targeted-in-voice-deepfake-attacks-since-april/",
        "Summary": "The FBI warned that cybercriminals using AI-generated audio deepfakes to target U.S. officials in voice phishing attacks that started in April. [...]",
        "Date": "2025-05-15",
        "Content": "The FBI warned that cybercriminals using AI-generated audio deepfakes to target U.S. officials in voice phishing attacks that started in April.\nThis warning is part of a public service announcement issued on Thursday that also provides mitigation measures to help the public spot and block attacks using audio deepfakes (also known as voice deepfakes).\n\"Since April 2025, malicious actors have impersonated senior US officials to target individuals, many of whom are current or former senior US federal or state government officials and their contacts. If you receive a message claiming to be from a senior US official, do not assume it is authentic,\" the FBI warned.\n\"The malicious actors have sent text messages and AI-generated voice messages — techniques known as smishing and vishing, respectively — that claim to come from a senior US official in an effort to establish rapport before gaining access to personal accounts.\"\nThe attackers can gain access to the accounts of U.S. officials by sending malicious links disguised as links designed to move the discussion to another messaging platform.\nBy compromising their accounts, the threat actors can gain access to other government officials' contact information. Next, they can use social engineering to impersonate the compromised U.S. officials to steal further sensitive information and trick targeted contacts into transferring funds.\nToday's PSA follows a March 2021 FBI Private Industry Notification (PIN) [\nPDF\n] warning that deepfakes (including AI-generated or manipulated audio, text, images, or video) would likely be widely employed in \"cyber and foreign influence operations\" after becoming increasingly sophisticated.\nOne year later, Europol\ncautioned\nthat deepfakes could soon become a tool that cybercriminal groups may routinely use in CEO fraud, non-consensual pornography creation, and evidence tampering.\nThe\nU.S. Department of Health and Human Services (HHS)\nalso warned in April 2024 that cybercriminals were targeting IT help desks in social engineering attacks using AI voice cloning to deceive targets.\nLater that month, LastPass revealed that unknown attackers\nused deepfake audio to impersonate Karim Toubba\n, the company's Chief Executive Officer, in a voice phishing attack targeting one of its employees.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nFake AI video generators drop new Noodlophile infostealer malware\nUnofficial Signal app used by Trump officials investigates hack\nFBI seeks help to unmask Salt Typhoon hackers behind telecom breaches\nFBI: US lost record $16.6 billion to cybercrime in 2024\nWindows 11 and Red Hat Linux hacked on first day of Pwn2Own"
    },
    {
        "Title": "Nova Scotia Power confirms hackers stole customer data in cyberattack",
        "Link": "https://www.bleepingcomputer.com/news/security/nova-scotia-power-confirms-hackers-stole-customer-data-in-cyberattack/",
        "Summary": "Nova Scotia Power confirms it suffered a data breach after threat actors stole sensitive customer data in a cybersecurity incident discovered last month. [...]",
        "Date": "2025-05-15",
        "Content": "Nova Scotia Power confirms it suffered a data breach after threat actors stole sensitive customer data in a cybersecurity incident discovered last month.\nNova Scotia Power, a subsidiary of Emera Inc., is a significant utility in Canada. It serves over 500,000 residential, commercial, and industrial customers in Nova Scotia, holding 95% of the market share.\nIt generates over 10,000 GWh of energy annually, distributed through an extensive network of power lines extending for 32,000 kilometers (20,000 miles).\nOn April 28, 2025, the company announced that it had discovered unauthorized access into certain parts of its network and servers supporting its business.\nAlthough there was no impact on the company's electricity production and distribution, the incident response efforts disrupted internal operations.\nFurther investigations revealed on May 1, 2025, that customer information might have been stolen. An update published yesterday confirmed this previous finding, specifying the following data was exposed:\nFull name\nPhone number\nEmail address\nMailing and service addresses\nNova Scotia Power program participation information\nDate of birth\nCustomer account history (power consumption, service requests, customer payment, billing, credit history, and customer correspondence)\nDriver's license number\nSocial Insurance Number\nBank account numbers (for some customers)\nAlso, the company found that the actual breach occurred earlier than initially anticipated, on March 19, 2025, which means that nearly two months had passed by the time affected customers were informed via notices mailed to their addresses.\nNova Scotia Power says there are no signs the stolen data has been misused, but it will provide two years of credit monitoring service coverage to letter recipients to mitigate the risks.\n\"Notifications are in the process of being mailed to impacted account holders, which includes detailed information about resources and support,\"\nreads the incident status update\n.\n\"While we have no evidence of misuse of your personal information, as a precaution, arrangements have been made with the consumer reporting agency, TransUnion, to provide impacted individuals with a two-year subscription to a comprehensive credit monitoring service at no cost.\"\nCustomers of Nova Scotia Power are advised to remain vigilant for phishing attempts, including cases of threat actors impersonating the utility to trick people into giving away sensitive data.\nAt the time of writing, no ransomware gangs have assumed responsibility for the attack at Nova Scotia Power.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nFashion giant Dior discloses cyberattack, warns of data breach\nM&S says customer data stolen in cyberattack, forces password resets\nVC giant Insight Partners confirms investor data stolen in breach\nVeriSource now says February data breach impacts 4 million people\nInterlock ransomware claims DaVita attack, leaks stolen data"
    },
    {
        "Title": "Windows 11 and Red Hat Linux hacked on first day of Pwn2Own",
        "Link": "https://www.bleepingcomputer.com/news/security/windows-11-and-red-hat-linux-virtualbox-hacked-on-first-day-of-pwn2own/",
        "Summary": "On the first day of Pwn2Own Berlin 2025, security researchers were awarded $260,000 after successfully demonstrating zero-day exploits for Windows 11, Red Hat Linux, Docker Desktop, and Oracle VirtualBox. [...]",
        "Date": "2025-05-15",
        "Content": "On the first day of Pwn2Own Berlin 2025, security researchers were awarded $260,000 after successfully demonstrating zero-day exploits for Windows 11, Red Hat Linux, and Oracle VirtualBox.\nRed Hat Enterprise Linux for Workstations was the first to fall in the local privilege escalation category after DEVCORE Research Team's Pumpkin exploited an integer overflow vulnerability to earn $20,000.\nHyunwoo Kim and Wongi Lee also got root on a Red Hat Linux device by chaining a use-after-free and an information leak, but one of the exploited flaws was an N-day, which\nled to a bug collision\n.\nNext, Chen Le Qi of STARLabs SG was awarded $30,000 for an exploit chain combining a use-after-free and an integer overflow to escalate privileges to SYSTEM on a Windows 11 system.\nWindows 11 was hacked twice more to gain SYSTEM privileges by Marcin Wiązowski, who exploited an out-of-bounds write vulnerability, and Hyeonjin Choi, who demoed a type confusion zero-day.\nTeam Prison Break earned $40,000 after demoing an exploit chain that used an integer overflow to escape Oracle VirtualBox and execute code on the underlying operating system.\nSummoning Team's Sina Kheirkhah was awarded another $35,000 for a Chroma zero-day and an already known vulnerability in Nvidia's Triton Inference Server, while STARLabs SG's Billy and Ramdhan earned $60,000 for escaping Docker Desktop and executing code on the underlying OS using a use-after-free zero-day.\nPwn2Own Berlin 2025 1st day leaderboard (\nTrend Zero Day Initiative\n)\n​​The\nPwn2Own Berlin 2025\nhacking competition, which focuses on enterprise technologies and introduces an AI category, takes place in Berlin between May 15 and May 17, during the\nOffensiveCon\nconference.\nOn the second day\n, security researchers will try to exploit zero-days in Microsoft SharePoint, VMware ESXi, Mozilla Firefox, Red Hat Enterprise Linux for Workstations, and Oracle VirtualBox.\nAfter the zero-day vulnerabilities are demoed and disclosed during Pwn2Own, vendors have 90 days to release security fixes for their software and hardware products.\nPwn2Own contestants will target fully patched products in the AI, web browser, virtualization, local privilege escalation, servers, enterprise applications, cloud-native/container, and automotive categories, and will be able to earn over $1,000,000 in cash and prizes.\nHowever, while the 2024 Tesla Model 3 and the 2025 Tesla Model Y bench-top units were also available as targets, no attempts have been registered before the competition started.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nWindows 11 upgrade block lifted after Safe Exam Browser fix\nMicrosoft: Windows 11 24H2 now ready to rollout to everyone\nPlay ransomware exploited Windows logging flaw in zero-day attacks\nMicrosoft testing Windows 11 support for third-party passkeys\nMicrosoft warns of blue screen crashes caused by April updates"
    },
    {
        "Title": "New Tor Oniux tool anonymizes any Linux app's network traffic",
        "Link": "https://www.bleepingcomputer.com/news/security/new-tor-oniux-tool-anonymizes-any-linux-apps-network-traffic/",
        "Summary": "Tor has announced Oniux, a new command-line tool for routing any Linux application securely through the Tor network for anonymized network connections. [...]",
        "Date": "2025-05-15",
        "Content": "Tor has announced Oniux, a new command-line tool for routing any Linux application securely through the Tor network for anonymized network connections.\nUnlike classic methods like torsocks, which rely on user-space tricks, Oniux uses Linux namespaces to create a fully isolated network environment for each application, preventing data leaks even if the app is malicious or misconfigured.\nLinux namespaces are a kernel feature that allows processes to run in isolated environments, each with its own view of specific system resources like networking, processes, or file mounts.\nOniux uses Linux namespaces to isolate apps at the kernel level, so all their traffic is forced through Tor.\n\"We are excited to introduce\noniux\n: a small command-line utility providing Tor network isolation for third-party applications using Linux namespaces,\" reads a\nTor blog post\n.\n\"Built on Arti, and onionmasq, oniux drop-ships any Linux program into its own network namespace to route it through Tor and strips away the potential for data leaks.\"\nIt achieves this by placing each app in its own network namespace with no access to the host's interfaces, and instead attaching a virtual interface (onion0) that routes through Tor using onionmasq.\nIt also uses mount namespaces to inject a custom /etc/resolv.conf for Tor-safe DNS, and user/PID namespaces to safely set up the environment with minimal privileges.\nThis setup ensures leak-proof, kernel-enforced Tor isolation for any Linux app.\nOn the other hand, Torsocks works by using an 'LD_PRELOAD' hack to intercept network-related function calls in dynamically linked Linux applications and redirect them through a Tor SOCKS proxy.\nThe problem with this approach is that raw system calls aren't caught by Torsocks, and malicious apps can avoid using libc functions to cause leaks.\nMoreover, Torsocks doesn't work with static binaries at all, and doesn't offer true isolation, as apps still access the host's real network interfaces.\nThe Tor project published a comparison table highlighting the qualitative differences between the two solutions.\noniux\ntorsocks\nStandalone application\nRequires running Tor daemon\nUses Linux namespaces\nUses an ld.so preload hack\nWorks on all applications\nOnly works on applications making system calls through libc\nMalicious application cannot leak\nMalicious application can leak by making a system call through raw assembly\nLinux only\nCross-platform\nNew and experimental\nBattle-proven for over 15 years\nUses Arti as its engine\nUses CTor as its engine\nWritten in Rust\nWritten in C\nDespite the obvious advantages of Oniux, Tor highlights that the project is still experimental and hasn't been tested extensively under multiple conditions and scenarios.\nThat said, the tool may not work as expected, so its use in critical operations is discouraged.\nInstead, Tor calls for enthusiasts who can test Oniux and report any problems they encounter so the tool can reach maturity quickly and become ready for broader deployment.\nThe Tor Project has published the\nsource code\n, and those interested in testing Oniux must first ensure they have Rust installed on their Linux distribution, and then install the tool using the command:\ncargo install --git https://gitlab.torproject.org/tpo/core/oniux oniux@0.4.0\nTor gives some usage examples like accessing an .onion site (oniux curl http://example.onion), \"torifying\" the shell session (oniux bash), or running a GUI app over Tor in the desktop environment (oniux hexchat).\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nWindows 11 and Red Hat Linux hacked on first day of Pwn2Own\nMicrosoft fixes Linux boot issues on dual-boot Windows systems\nHackers now testing ClickFix attacks against Linux targets\nLinux wiper malware hidden in malicious Go modules on GitHub\nKali Linux warns of update failures after losing repo signing key"
    },
    {
        "Title": "Malicious NPM package uses Unicode steganography to evade detection",
        "Link": "https://www.bleepingcomputer.com/news/security/malicious-npm-package-uses-unicode-steganography-to-evade-detection/",
        "Summary": "A malicious package in the Node Package Manager index uses invisible Unicode characters to hide malicious code and Google Calendar links to host the URL for the command-and-control location. [...]",
        "Date": "2025-05-15",
        "Content": "A malicious package in the Node Package Manager index uses invisible Unicode characters to hide malicious code and Google Calendar links to host the URL for the command-and-control location.\nThe package, named\nos-info-checker-es6\n, appears as an information utility and has been downloaded more than 1,000 times since the beginning of the month.\nResearchers at\nVeracode\n, a code security assessment company, found that the first version of the package was added to the Node Package Manager (NPM) index on March 19 and was benign, as it only collected operating system information from the host.\nThe author added modifications a few days later to include platform-specific binaries and obfuscated install scripts.\nOn May 7, a new version of the package was published, which featured code for \"a sophisticated C2 (command-and-control) mechanism\" that delivers the final payload.\nThe latest version of '\nos-info-checker-es6\n' available on npm at the time of writing is v1.0.8 and it is malicious, Veracode warns.\nFurthermore, the package is listed as a dependency for four other NPM packages:\nskip-tot\n,\nvue-dev-serverr\n,\nvue-dummyy\n, and '\nvue-bit\n- all pose as accessibility and developer platform engineering tools.\nIt is unclear if or how these packages are promoted by the threat actor.\nUnicode steganography\nIn the malicious version, the attacker embedded data in what appeared to be a '|' string. However, the vertical bar is followed by a long sequence of invisible Unicode characters from the Variation Selectors Supplement range (U+E0100 to U+E01EF).\nThese Unicode characters are normally modifiers, typically used \"to provide specific glyph variations in complex scripts.\" In this case, their role is to facilitate text-based steganography - hiding information in other data.\nVeracode decoded and deobfuscated the string to find a payload for a sophisticated C2 mechanism that relied on a Google Calendar short link to reach the location hosting the final payload.\nThe researcher explain that after fetching the Google Calendar link, a set of redirects are checked until it receives a HTTP 200 OK response for the request.\nIt then scrapes a\ndata-base-title\nattribute from the event's HTML page, which holds a base64-encoded URL pointing to the final payload.\nUsing a function called\nymmogvj,\nthe URL is decoded to get a malware payload. The researchers say that the request expects a base- encoded stage-2 malware payload in the response body, and likely an initialization vector and a secret key in the HTTP headers - an indication of possible encryption of the final payload.\nVeracode also found that the payload is also executed using\neval().\nThe script includes a simple persistence mechanism in the system's temporary directory, which prevents multiple instances running at the same time.\nAt the time of analysis, the researchers could not retrieve the final payload, suggesting that the campaign could be on hold or still in an early stage.\nDespite Veracode reporting its findings to NPM, the suspicious packages are still present on the platform.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMalicious PyPI packages abuse Gmail, websockets to hijack systems\nInfostealer campaign compromises 10 npm packages, targets devs\nNew npm attack poisons local packages with backdoors\nSupply chain attack hits npm package with 45,000 weekly downloads\nRipple's recommended XRP library xrpl.js hacked to steal wallets"
    },
    {
        "Title": "Coinbase data breach exposes customer info and government IDs",
        "Link": "https://www.bleepingcomputer.com/news/security/coinbase-discloses-breach-faces-up-to-400-million-in-losses/",
        "Summary": "Coinbase, a cryptocurrency exchange with over 100 million customers, has disclosed that cybercriminals working with rogue support agents stole customer data and demanded a $20 million ransom not to publish the stolen information. [...]",
        "Date": "2025-05-15",
        "Content": "Coinbase, a cryptocurrency exchange with over 100 million customers, has disclosed that cybercriminals working with rogue support agents stole customer data and demanded a $20 million ransom not to publish the stolen information.\nThe company said it would not pay the ransom but would establish a $20 million reward fund for any leads that could help find the attackers who coordinated this attack.\nThe disclosure comes after the criminals behind the breach emailed Coinbase on May 11, demanding a $20 million ransom to prevent public disclosure of stolen information about certain customer accounts and internal documentation.\nAccording to Coinbase, the attackers obtained this customer data with the help of contractors or support staff outside the U.S. who were paid to access internal systems. Coinbase fired the insiders after they were detected while accessing systems without authorization, but not before they exfiltrated information from those devices.\nWhile the threat actors managed to steal a combination of personally identifiable information of up to 1% of Coinbase's customer base (around 1 million individuals), they couldn't steal customers' private keys or passwords, and couldn't access Coinbase Prime accounts and hot or cold wallets (belonging to affected customers or the crypto exchange).\nIn a filing with the U.S. Securities and Exchange Commission (SEC),\nthe company says\nthe data stolen in this incident includes:\nName, address, phone, and email;\nMasked Social Security (last four digits only);\nMasked bank-account numbers and some bank account identifiers;\nGovernment‑ID images (e.g., driver's license, passport);\nAccount data (balance snapshots and transaction history); and\nLimited corporate data (including documents, training material, and communications available to support agents).\n\"Cyber criminals bribed and recruited a group of rogue overseas support agents to steal Coinbase customer data to facilitate social engineering attacks. These insiders abused their access to customer support systems to steal the account data for a small subset of customers,\"\nCoinbase said\nin a Thursday blog post.\n\"No passwords, private keys, or funds were exposed and Coinbase Prime accounts are untouched. We will reimburse customers who were tricked into sending funds to the attacker.\"\nhttps://t.co/evpIBMFvRW\npic.twitter.com/f6UPdkL5R0\n— Brian Armstrong (@brian_armstrong)\nMay 15, 2025\nExpected losses to reach up to $400 million\nWhile the financial impact is still being assessed and Coinbase didn't reveal how many customers were deceived into sending funds to the attackers in follow-up social engineering attacks, the company estimates that the resulting expenses will be \"within the range of approximately $180 million to $400 million\" for remediation and customer reimbursements.\nCoinbase added that it will open a new support hub in the U.S., reimburse affected customers tricked into sending funds to the attackers following social engineering attacks, and increase investments in insider‑threat detection, security threat simulation, and automated response to prevent future breach attempts.\nThe company also advised customers to be suspicious of scammers impersonating Coinbase employees and attempting to trick them into transferring funds or asking them for sensitive information such as passwords or 2FA codes.\nIf this happens, the crypto exchange recommends hanging up because it never asks for account information over the phone or pressures customers into transferring assets to other wallets. To defend against similar attacks, you should enable two-factor authentication and turn on withdrawal allow‑listing, which ensures secure transfers.\n\"To the customers affected, we're sorry for the worry and inconvenience this incident caused. We'll keep owning issues when they arise and investing in world‑class defenses—because that's how we protect our customers and keep the crypto economy safe for everyone,\" Coinbase added.\n\"Coinbase will voluntarily reimburse retail customers who mistakenly sent funds to the scammer as a direct result of this incident prior to the date of this post, following a review to confirm the facts.\"\nCoinbase's stock soared 24% after the crypto exchange\njoined the S&P 500\n, a stock market index that includes 500 leading companies listed on U.S. stock exchanges.\nA Coinbase spokesperson was not immediately available for comment when contacted by BleepingComputer earlier today.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nLuna Moth extortion hackers pose as IT help desks to breach US firms\nMicrosoft: Octo Tempest is one of the most dangerous financial hacking groups\nHertz confirms customer info, drivers' licenses stolen in data breach\nHunters International shifts from ransomware to pure data extortion\nRedCurl cyberspies create ransomware to encrypt Hyper-V servers"
    },
    {
        "Title": "Google fixes high severity Chrome flaw with public exploit",
        "Link": "https://www.bleepingcomputer.com/news/security/google-fixes-high-severity-chrome-flaw-with-public-exploit/",
        "Summary": "Google has released emergency security updates to patch a high-severity Chrome vulnerability that has a public exploit and can let attackers hijack accounts. [...]",
        "Date": "2025-05-15",
        "Content": "Google has released emergency security updates to patch a high-severity vulnerability in the Chrome web browser that could lead to full account takeover following successful exploitation.\nWhile it's unclear if this security flaw has been used in attacks, the company warned that it has a public exploit, which is how it usually hints at active exploitation.\n\"Google is aware of reports that an exploit for CVE-2025-4664 exists in the wild,\"\nGoogle said\nin a Wednesday security advisory.\nThe vulnerability was discovered by Solidlab security researcher Vsevolod Kokorin and is\ndescribed\nas an insufficient policy enforcement in Google Chrome's Loader component that lets remote attackers leak cross-origin data via maliciously crafted HTML pages.\n\"You probably know that unlike other browsers, Chrome resolves the Link header on subresource requests. But what's the problem? The issue is that the Link header can set a referrer-policy. We can specify unsafe-url and capture the full query parameters,\"\nKokorin explained\n.\n\"Query parameters can contain sensitive data - for example, in OAuth flows, this might lead to an Account Takeover. Developers rarely consider the possibility of stealing query parameters via an image from a 3rd-party resource.\"\nLeaked OAuth access token (Vsevolod Kokorin)\n​Google fixed the flaw for users in the Stable Desktop channel, with patched versions (136.0.7103.113 for Windows/Linux and 136.0.7103.114 for macOS) rolling out to users worldwide.\nAlthough the company says the security updates will roll out over the coming days and weeks, they were immediately available when BleepingComputer checked for updates.\nUsers who don't want to update Chrome manually can also let the browser automatically check for new updates and install them after the next launch.\nIn March, ​Google also\nfixed a high-severity Chrome zero-day\nbug (CVE-2025-2783) that was abused to deploy malware in espionage attacks targeting Russian government organizations, media outlets, and educational institutions.\nKaspersky researchers who discovered the actively exploited zero-day said that the attackers use CVE-2025-2783 exploits to bypass Chrome sandbox protections and infect targets with malware.\nLast year,\nGoogle patched 10 zero-days\ndisclosed during the Pwn2Own hacking competition or exploited in attacks.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nCritical Erlang/OTP SSH pre-auth RCE is 'Surprisingly Easy' to exploit, patch now\nGoogle fixes Chrome zero-day exploited in espionage campaign\nGoogle Chrome to block admin-level browser launches for better security\nFortinet fixes critical zero-day exploited in FortiVoice attacks\nASUS DriverHub flaw let malicious sites run commands with admin rights"
    },
    {
        "Title": "Big Steelmaker Halts Operations After Cyber Incident",
        "Link": "https://www.darkreading.com/threat-intelligence/steel-manufacturer-stalls-operations-cyber-incident",
        "Summary": "Nucor made it clear its investigation is still in the early stages and didn't specify the nature or scope of the breach, nor who the threat actor might be.",
        "Date": "2025-05-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/steel-manufacturer-stalls-operations-cyber-incident"
    },
    {
        "Title": "International Crime Rings Defraud US Gov't Out of Billions",
        "Link": "https://www.darkreading.com/threat-intelligence/international-crime-rings-defraud-us-govt-billions",
        "Summary": "Fraudsters worldwide apply for money from the US government using stolen and forged identities, making off with hundreds of billions of dollars annually.",
        "Date": "2025-05-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/international-crime-rings-defraud-us-govt-billions"
    },
    {
        "Title": "Attackers Target Samsung MagicINFO Server Bug, Patch Now",
        "Link": "https://www.darkreading.com/endpoint-security/attackers-target-samsung-magicinfo-server-bug",
        "Summary": "CVE-2025-4632, a patch bypass for a Samsung MagicInfo 9 Server vulnerability disclosed last year, has been exploited by threat actors in the wild.",
        "Date": "2025-05-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/attackers-target-samsung-magicinfo-server-bug"
    },
    {
        "Title": "Critical SAP NetWeaver Vuln Faces Barrage of Cyberattacks",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/critical-sap-netweaver-vuln-cyberattacks",
        "Summary": "As threat actors continue to hop on the train of exploiting CVE-2025-31324, researchers are recommending that SAP administrators patch as soon as possible so that they don't fall victim next.",
        "Date": "2025-05-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/critical-sap-netweaver-vuln-cyberattacks"
    },
    {
        "Title": "RSAC 2025: AI Everywhere, Trust Nowhere",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/rsac-2025-ai-everywhere-trust-nowhere",
        "Summary": "We're at an inflection point. AI is changing the game, but the rules haven't caught up.",
        "Date": "2025-05-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/rsac-2025-ai-everywhere-trust-nowhere"
    },
    {
        "Title": "RealDefense Partner Program Surpasses $100M in Annual Revenue",
        "Link": "https://www.darkreading.com/endpoint-security/realdefense-partner-program-surpasses-100m-in-annual-revenue",
        "Summary": "No summary available",
        "Date": "2025-05-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/realdefense-partner-program-surpasses-100m-in-annual-revenue"
    },
    {
        "Title": "Critical Infrastructure Under Siege: OT Security Still Lags",
        "Link": "https://www.darkreading.com/ics-ot-security/critical-infrastructure-ot-security-still-lags",
        "Summary": "With critical infrastructure facing constant cyber threats from the Typhoons and other corners, federal agencies and others are warning security for the OT network, a core technology in many critical sectors, is not powered up enough.",
        "Date": "2025-05-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/ics-ot-security/critical-infrastructure-ot-security-still-lags"
    },
    {
        "Title": "Breachforums Boss to Pay $700k in Healthcare Breach",
        "Link": "https://krebsonsecurity.com/2025/05/breachforums-boss-to-pay-700k-in-healthcare-breach/",
        "Summary": "In what experts are calling a novel legal outcome, the 22-year-old former administrator of the cybercrime community Breachforums will forfeit nearly $700,000 to settle a civil lawsuit from a health insurance company whose customer data was posted for sale on the forum in 2023. Conor Brian Fitzpatrick, a.k.a. \"Pompompurin,\" is slated for resentencing next month after pleading guilty to access device fraud and possession of child sexual abuse material (CSAM).",
        "Date": "2025-05-15",
        "Content": "In what experts are calling a novel legal outcome, the 22-year-old former administrator of the cybercrime community Breachforums will forfeit nearly $700,000 to settle a civil lawsuit from a health insurance company whose customer data was posted for sale on the forum in 2023. Conor Brian Fitzpatrick, a.k.a. “Pompompurin,” is slated for resentencing next month after pleading guilty to access device fraud and possession of child sexual abuse material (CSAM).\nA redacted screenshot of the Breachforums sales thread. Image: Ke-la.com.\nOn January 18, 2023, denizens of Breachforums posted for sale tens of thousands of records — including Social Security numbers, dates of birth, addresses, and phone numbers  — stolen from Nonstop Health, an insurance provider based in Concord, Calif.\nClass-action attorneys sued Nonstop Health, which added Fitzpatrick as a third-party defendant to the civil litigation in November 2023, several months after he was arrested by the FBI and criminally charged with access device fraud and CSAM possession. In January 2025, Nonstop agreed to pay $1.5 million to settle the class action.\nJill Fertel is a former prosecutor who runs the cyber litigation practice at Cipriani & Werner, the law firm that represented Nonstop Health. Fertel told KrebsOnSecurity this is the first and only case where a cybercriminal or anyone related to the security incident was actually named in civil litigation.\n“Civil plaintiffs are not at all likely to see money seized from threat actors involved in the incident to be made available to people impacted by the breach,” Fertel said. “The best we could do was make this money available to the class, but it’s still incumbent on the members of the class who are impacted to make that claim.”\nMark Rasch is a former federal prosecutor who now represents Unit 221B, a cybersecurity firm based in New York City. Rasch said he doesn’t doubt that the civil settlement involving Fitzpatrick’s criminal activity is a novel legal development.\n“It is rare in these civil cases that you know the threat actor involved in the breach, and it’s also rare that you catch them with sufficient resources to be able to pay a claim,” Rasch said.\nDespite admitting to possessing more than 600 CSAM images and personally operating Breachforums, Fitzpatrick was sentenced in January 2024 to time served and 20 years of supervised release. Federal prosecutors objected, arguing that his punishment failed to adequately reflect the seriousness of his crimes or serve as a deterrent.\nAn excerpt from a pre-sentencing report for Fitzpatrick indicates he had more than 600 CSAM images on his devices.\nIndeed, the same month he was sentenced Fitzpatrick was rearrested (PDF) for violating the terms of his release, which forbade him from using a computer that didn’t have court-required monitoring software installed.\nFederal prosecutors said Fitzpatrick went on Discord following his guilty plea and professed innocence to the very crimes to which he’d pleaded guilty, stating that his plea deal was “so BS” and that he had “wanted to fight it.” The feds said Fitzpatrick also joked with his friends about selling data to foreign governments, exhorting one user to “become a foreign asset to china or russia,” and to “sell government secrets.”\nIn January 2025, a federal appeals court agreed with the government’s assessment, vacating Fitzpatrick’s sentence and ordering him to be resentenced on June 3, 2025.\nFitzpatrick launched BreachForums in March 2022 to replace RaidForums, a similarly popular crime forum that was infiltrated and shut down by the FBI the previous month. As administrator, his alter ego Pompompurin served as the middleman, personally reviewing all databases for sale on the forum and offering an escrow service to those interested in buying stolen data.\nA yearbook photo of Fitzpatrick unearthed by the Yonkers Times.\nThe new site quickly attracted more than 300,000 users, and facilitated the sale of databases stolen from hundreds of hacking victims, including some of the largest consumer data breaches in recent history. In May 2024, a reincarnation of Breachforums was seized by the FBI and international partners. Still more relaunches of the forum occurred after that, with the most recent disruption last month.\nAs KrebsOnSecurity reported last year in The Dark Nexus Between Harm Groups and The Com, it is increasingly common for federal investigators to find CSAM material when searching devices seized from cybercriminal suspects. While the mere possession of CSAM is a serious federal crime, not all of those caught with CSAM are necessarily creators or distributors of it. Fertel said some cybercriminal communities have been known to require new entrants to share CSAM material as a way of proving that they are not a federal investigator.\n“If you’re going to the darkest corners of Internet, that’s how you prove you’re not law enforcement,” Fertel said. “Law enforcement would never share that material. It would be criminal for me as a prosecutor, if I obtained and possessed those types of images.”\nFurther reading: The settlement between Fitzpatrick and Nonstop (PDF).\n\r\n         This entry was posted on Thursday 15th of May 2025 03:56 PM \r\n         \nGlad to hear that this little prick is being resentenced. He may be big boy topside in the breach world and on Telegram, but on the inside he’s currency. He’ll be walking wrong after one night in GenPop and every night thereafter.\n>Fertel said some cybercriminal communities have been known to require new entrants to share CSAM material as a way of proving that they are not a federal investigator.\nThe opposite of testing suspected North Korean workers by badmouthing Kim Jong Un\nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "Andrei Tarasov: Inside the Journey of a Russian Hacker on the FBI’s Most Wanted List",
        "Link": "https://www.securityweek.com/andrei-tarasov-inside-the-journey-of-a-russian-hacker-on-the-fbis-most-wanted-list/",
        "Summary": "<p>Once a key figure in the Angler exploit kit underworld, Tarasov’s life has unraveled into detention, paranoia, and an unwanted return to the Russia he publicly despised.</p>\n<p>The post <a href=\"https://www.securityweek.com/andrei-tarasov-inside-the-journey-of-a-russian-hacker-on-the-fbis-most-wanted-list/\">Andrei Tarasov: Inside the Journey of a Russian Hacker on the FBI’s Most Wanted List</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/andrei-tarasov-inside-the-journey-of-a-russian-hacker-on-the-fbis-most-wanted-list/"
    },
    {
        "Title": "Coinbase Rejects $20M Ransom After Rogue Contractors Bribed to Leak Customer Data",
        "Link": "https://www.securityweek.com/coinbase-rejects-20m-ransom-after-rogue-contractors-bribed-to-leak-customer-data/",
        "Summary": "<p>Coinbase said a group of rogue contractors were bribed to pull customer data from internal systems, leading to a $20 million ransom demand.</p>\n<p>The post <a href=\"https://www.securityweek.com/coinbase-rejects-20m-ransom-after-rogue-contractors-bribed-to-leak-customer-data/\">Coinbase Rejects $20M Ransom After Rogue Contractors Bribed to Leak Customer Data</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/coinbase-rejects-20m-ransom-after-rogue-contractors-bribed-to-leak-customer-data/"
    },
    {
        "Title": "Production at Steelmaker Nucor Disrupted by Cyberattack",
        "Link": "https://www.securityweek.com/production-at-steelmaker-nucor-disrupted-by-cyberattack/",
        "Summary": "<p>American steel giant Nucor on Wednesday disclosed a cybersecurity incident that bears the hallmarks of a ransomware attack. </p>\n<p>The post <a href=\"https://www.securityweek.com/production-at-steelmaker-nucor-disrupted-by-cyberattack/\">Production at Steelmaker Nucor Disrupted by Cyberattack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/production-at-steelmaker-nucor-disrupted-by-cyberattack/"
    },
    {
        "Title": "Proofpoint to Acquire Hornetsecurity in Reported $1 Billion Deal",
        "Link": "https://www.securityweek.com/proofpoint-to-acquire-hornetsecurity-in-reported-1-billion-deal/",
        "Summary": "<p>Enterprise cybersecurity giant Proofpoint is buying Germany-based Microsoft 365 security solutions provider Hornetsecurity.</p>\n<p>The post <a href=\"https://www.securityweek.com/proofpoint-to-acquire-hornetsecurity-in-reported-1-billion-deal/\">Proofpoint to Acquire Hornetsecurity in Reported $1 Billion Deal</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/proofpoint-to-acquire-hornetsecurity-in-reported-1-billion-deal/"
    },
    {
        "Title": "Chinese Hackers Hit Drone Sector in Supply Chain Attacks",
        "Link": "https://www.securityweek.com/chinese-hackers-hit-drone-sector-in-supply-chain-attacks/",
        "Summary": "<p>The China-linked hacking group Earth Ammit has launched multi-wave attacks in Taiwan and South Korea to disrupt the drone sector.</p>\n<p>The post <a href=\"https://www.securityweek.com/chinese-hackers-hit-drone-sector-in-supply-chain-attacks/\">Chinese Hackers Hit Drone Sector in Supply Chain Attacks</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chinese-hackers-hit-drone-sector-in-supply-chain-attacks/"
    },
    {
        "Title": "Ransomware Groups, Chinese APTs Exploit Recent SAP NetWeaver Flaws",
        "Link": "https://www.securityweek.com/ransomware-groups-chinese-apts-exploit-recent-sap-netweaver-flaws/",
        "Summary": "<p>Two ransomware groups and several Chinese APTs have been exploiting two recent SAP NetWeaver vulnerabilities.</p>\n<p>The post <a href=\"https://www.securityweek.com/ransomware-groups-chinese-apts-exploit-recent-sap-netweaver-flaws/\">Ransomware Groups, Chinese APTs Exploit Recent SAP NetWeaver Flaws</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/ransomware-groups-chinese-apts-exploit-recent-sap-netweaver-flaws/"
    },
    {
        "Title": "Canadian Electric Utility Lists Customer Information Stolen by Hackers",
        "Link": "https://www.securityweek.com/canadian-electric-utility-lists-customer-information-stolen-by-hackers/",
        "Summary": "<p>Nova Scotia Power says a wide range of personal and financial information was stolen in the recent cyberattack.</p>\n<p>The post <a href=\"https://www.securityweek.com/canadian-electric-utility-lists-customer-information-stolen-by-hackers/\">Canadian Electric Utility Lists Customer Information Stolen by Hackers</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/canadian-electric-utility-lists-customer-information-stolen-by-hackers/"
    },
    {
        "Title": "Australian Human Rights Commission Discloses Data Breach",
        "Link": "https://www.securityweek.com/australian-human-rights-commission-discloses-data-breach/",
        "Summary": "<p>The Australian Human Rights Commission says data submitted through the complaint form on its website was inadvertently exposed.</p>\n<p>The post <a href=\"https://www.securityweek.com/australian-human-rights-commission-discloses-data-breach/\">Australian Human Rights Commission Discloses Data Breach</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/australian-human-rights-commission-discloses-data-breach/"
    },
    {
        "Title": "Chrome 136 Update Patches Vulnerability With ‘Exploit in the Wild’",
        "Link": "https://www.securityweek.com/chrome-136-update-patches-vulnerability-with-exploit-in-the-wild/",
        "Summary": "<p>Google has rolled out a Chrome 136 update that resolves a high-severity vulnerability for which a public exploit exists.</p>\n<p>The post <a href=\"https://www.securityweek.com/chrome-136-update-patches-vulnerability-with-exploit-in-the-wild/\">Chrome 136 Update Patches Vulnerability With &#8216;Exploit in the Wild&#8217;</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-15",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chrome-136-update-patches-vulnerability-with-exploit-in-the-wild/"
    },
    {
        "Title": "Alleged Breach Exposes Data of 88 Million Indian Car Owners",
        "Link": "https://dailydarkweb.net/alleged-breach-exposes-data-of-88-million-indian-car-owners/",
        "Summary": "<p>A significant database, allegedly containing records for 88 million car owners across India, is reportedly being circulated and offered for sale online. The dataset is described as a comprehensive collection, provided in CSV format and totaling approximately 3.5 GB in size. This alleged breach purportedly includes a range of information related to vehicle ownership, potentially [&#8230;]</p>\n<p>The post <a href=\"https://dailydarkweb.net/alleged-breach-exposes-data-of-88-million-indian-car-owners/\">Alleged Breach Exposes Data of 88 Million Indian Car Owners</a> appeared first on <a href=\"https://dailydarkweb.net\">Daily Dark Web</a>.</p>",
        "Date": "2025-05-15",
        "Content": "A significant database, allegedly containing records for 88 million car owners across India, is reportedly being circulated and offered for sale online. The dataset is described as a comprehensive collection, provided in CSV format and totaling approximately 3.5 GB in size. This alleged breach purportedly includes a range of information related to vehicle ownership, potentially exposing sensitive details of a vast number of individuals.\nThe potential implications of such a large-scale data exposure are considerable. Authorities and affected individuals are urged to remain vigilant following reports of this alleged data breach.\nTags:\ncar owners\nCyberSecurity\ndata-breach\ndata-leak\nIndia"
    },
    {
        "Title": "Alleged Data Exposure Hits Indonesian Supreme Court",
        "Link": "https://dailydarkweb.net/alleged-data-exposure-hits-indonesian-supreme-court/",
        "Summary": "<p>Reports circulating online suggest that a database purportedly belonging to the Supreme Court of the Republic of Indonesia (mahkamahagung.go.id) has been exposed. The alleged breach reportedly involves a dataset containing detailed information related to various courts across the country and the individuals associated with them. Analysis of sample data circulating in connection with the alleged [&#8230;]</p>\n<p>The post <a href=\"https://dailydarkweb.net/alleged-data-exposure-hits-indonesian-supreme-court/\">Alleged Data Exposure Hits Indonesian Supreme Court</a> appeared first on <a href=\"https://dailydarkweb.net\">Daily Dark Web</a>.</p>",
        "Date": "2025-05-15",
        "Content": "Reports circulating online suggest that a database purportedly belonging to the Supreme Court of the Republic of Indonesia (mahkamahagung.go.id) has been exposed. The alleged breach reportedly involves a dataset containing detailed information related to various courts across the country and the individuals associated with them.\nAnalysis of sample data circulating in connection with the alleged exposure indicates the presence of structured records. This data appears to encompass not only personal and professional contact information but also various identifiers and timestamps.\nThe allegedly exposed information includes:\nRecord Identifiers\nInstitution Codes/Identifiers\nInstitution Type\nSpecific Institution Name\nNames\nPositions/Titles\nEmail Addresses\nPhone Numbers\nTimestamps\nStatus Flags\nThe potential exposure of such a database could have significant implications, raising concerns about the privacy and security of individuals whose information is contained within the dataset and the overall integrity of government data systems.\nTags:\nCyberSecurity\ndata exposure\ndata-breach\ngovernment data\nIndonesia\nMAHKAMAHAGUNG\nMAHKAMAHAGUNG.GO.ID\nSupreme Court"
    }
]