[
    {
        "Title": "BREAKING: 7,000-Device Proxy Botnet Using IoT, EoL Systems Dismantled in U.S. - Dutch Operation",
        "Link": "https://thehackernews.com/2025/05/breaking-7000-device-proxy-botnet-using.html",
        "Summary": "A joint law enforcement operation undertaken by Dutch and U.S. authorities has dismantled a criminal proxy network that's powered by thousands of infected Internet of Things (IoT) and end-of-life (EoL) devices, enlisting them into a botnet for providing anonymity to malicious actors.\nIn conjunction with the domain seizure, Russian nationals, Alexey Viktorovich Chertkov, 37, Kirill Vladimirovich",
        "Date": "2025-05-09",
        "Content": "A joint law enforcement operation undertaken by Dutch and U.S. authorities has dismantled a criminal proxy network that's powered by thousands of infected Internet of Things (IoT) and end-of-life (EoL) devices, enlisting them into a botnet for providing anonymity to malicious actors.\nIn conjunction with the domain seizure, Russian nationals, Alexey Viktorovich Chertkov, 37, Kirill Vladimirovich Morozov, 41, Aleksandr Aleksandrovich Shishkin, 36, and Dmitriy Rubtsov, 38, a Kazakhstani national, have been\ncharged\nby the U.S. Department of Justice (DoJ) for operating, maintaining, and profiting from the proxy services.\nThe DoJ noted that users paid a monthly subscription fee, ranging from $9.95 to $110 per month, netting the threat actors more than $46 million by selling access to the infected routers. The service is believed to have been available since 2004.\nIt also said the U.S. Federal Bureau of Investigation (FBI) found business and residential routers in Oklahoma that had been hacked to install malware without the users' knowledge.\n\"A weekly average of 1,000 unique bots in contact with the command-and-control (C2) infrastructure, located in Turkey,\" Lumen Technologies Black Lotus Labs said in a\nreport\nshared with The Hacker News. \"Over half of these victims are in the United States, with Canada and Ecuador showing the next two highest totals.\"\nThe services in question –\nanyproxy.net\nand\n5socks.net\n– have been disrupted as part of an effort codenamed Operation Moonlander. Lumen told The Hacker News that both the platforms point to the \"same botnet, selling under two different named services.\"\nSnapshots\ncaptured\non the Internet Archive show that 5socks.net advertised \"more than 7,000 online proxies daily\" spanning various countries and states of the U.S., enabling threat actors to anonymously carry out a wide range of illicit activity in exchange for a cryptocurrency payment.\nLumen said the compromised devices were infected with a malware called\nTheMoon\n, which has also fueled another criminal proxy service referred to as\nFaceless\n. The company has also taken the step of disrupting the infrastructure by null routing all traffic to and from their known control points.\n\"The two services were essentially the same pool of proxies and C2s, and besides that malware, they were using a variety of exploits that were useful against EoL devices,\" Lumen told The Hacker News. \"However the proxy services themselves are unrelated [to Faceless].\"\nIt is suspected that the operators of the botnet relied on known exploits to breach EoL devices and rope them into the proxy botnet. Newly added bots have been found to contact a Turkey-based C2 infrastructure consisting of five servers, out of which four are designed to communicate with the infected victims on port 80.\n\"One of these 5 servers uses UDP on port 1443 to receive victim traffic, while not sending any in return,\" the cybersecurity company said. \"We suspect this server is used to store information from their victims.\"\nIn an advisory issued by the FBI Thursday, the agency\nsaid\nthe threat actors behind the botnets have exploited known security vulnerabilities in internet-exposed routers to install malware that grants persistent remote access.\nThe FBI also pointed out that the EoL routers have been compromised with a variant of TheMoon malware, permitting the threat actors to install proxy software on the devices and help conduct cyber crimes anonymously. TheMoon was\nfirst documented\nby the SANS Technology Institute in 2014 in attacks targeting Linksys routers.\n\"TheMoon does not require a password to infect routers; it scans for open ports and sends a command to a vulnerable script,\" the FBI\nsaid\n. \"The malware contacts the command-and-control (C2) server and the C2 server responds with instructions, which may include instructing the infected machine to scan for other vulnerable routers to spread the infection and expand the network.\"\nWhen users purchase a proxy, they receive an IP and port combination for connection. Just like in the case of\nNSOCKS\n, the service lacks any additional authentication once activated, making it ripe for abuse. It has been found that 5socks.net has been used to conduct ad fraud, DDoS and brute-force attacks, and exploit victim's data.\nTo mitigate the risks posed by such proxy botnets, users are advised to regularly reboot routers, install security updates, change default passwords, and upgrade to newer models once they reach EoL status.\n\"Proxy services have and will continue to present a direct threat to internet security as they allow malicious actors to hide behind unsuspecting residential IPs, complicating detection by network monitoring tools,\" Lumen said.\n\"As a vast number of end-of-life devices remain in circulation, and the world continues to adopt devices in the 'Internet of Things,' there will continue to be a massive pool of targets for malicious actors.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "OtterCookie v4 Adds VM Detection and Chrome, MetaMask Credential Theft Capabilities",
        "Link": "https://thehackernews.com/2025/05/ottercookie-v4-adds-vm-detection-and.html",
        "Summary": "The North Korean threat actors behind the Contagious Interview campaign have been observed using updated versions of a cross-platform malware called OtterCookie with capabilities to steal credentials from web browsers and other files.\nNTT Security Holdings, which detailed the new findings, said the attackers have \"actively and continuously\" updated the malware, introducing versions v3 and v4 in",
        "Date": "2025-05-09",
        "Content": "The North Korean threat actors behind the\nContagious Interview\ncampaign have been observed using updated versions of a cross-platform malware called OtterCookie with capabilities to steal credentials from web browsers and other files.\nNTT Security Holdings, which\ndetailed\nthe new findings, said the attackers have \"actively and continuously\" updated the malware, introducing versions v3 and v4 in February and April 2025, respectively.\nThe Japanese cybersecurity company is tracking the cluster under the name\nWaterPlum\n, which is also known as CL-STA-0240, DeceptiveDevelopment, DEV#POPPER, Famous Chollima, PurpleBravo, and Tenacious Pungsan.\nOtterCookie was\nfirst documented\nby NTT last year after having observed it in attacks since September 2024. Delivered by means of a JavaScript payload via a malicious npm package, trojanized GitHub or Bitbucket repository, or a bogus videoconferencing app, it's designed to contact an external server to execute commands on compromised hosts.\nOtterCookie v3 has been found to incorporate a new upload module to send files matching a predefined set of extensions to the external server. This consists of environment variables, images, documents, spreadsheets, text files, and files containing mnemonic and recovery phrases associated with cryptocurrency wallets.\nIt's worth pointing out that this module was previously executed in OtterCookie v2 as a shell command received from the server.\nThe fourth iteration of the malware expands on its predecessor by adding two more modules to steal credentials from Google Chrome, as well as extract data from the MetaMask extension for Google Chrome, Brave browser, and iCloud Keychain.\nAnother new feature addition to OtterCookie v4 is the ability to detect if it's being executed in virtual machine (VM) environments pertaining to Broadcom VMware, Oracle VirtualBox, Microsoft, and QEMU.\nInterestingly, it has been found that the first stealer module responsible for gathering Google Chrome credentials does so after decrypting them, whereas the second module harvests encrypted login data from browsers like Chrome and Brave.\n\"This difference in data processing or coding style implies that these modules were developed by different developers,\" researchers Masaya Motoda and Rintaro Koike said.\nThe disclosure comes as multiple malicious payloads related to the Contagious Interview campaign have been unearthed in recent months, indicating that the threat actors are refining their modus operandi.\nThis includes a Go-based information stealer that's delivered under the guise of a Realtek driver update (\"WebCam.zip\") that, when opened, runs a shell script responsible for downloading the stealer and launching a deceptive macOS application (\"DriverMinUpdate.app\") engineered to harvest the victim's macOS system password.\nIt's believed that the malware was distributed as part of an updated version of the activity codenamed\nClickFake Interview\nby Sekoia last month owing to the use of ClickFix-style lures to fix non-existent audio and video issues during an online assessment for a job interview process.\n\"The stealer's primary role is to establish a persistent C2 channel, profile the infected system, and exfiltrate sensitive data,\" MacPaw's cybersecurity division, Moonlock,\nsaid\n. \"It achieves this through a combination of system reconnaissance, credential theft, and remote command execution.\"\nIt's assessed that the application DriverMinUpdate is part of a\nlarger\nset\nof\nsimilar\nmalicious apps\nthat have been uncovered by dmpdump, SentinelOne, ENKI, and Kandji such as ChromeUpdateAlert, ChromeUpdate, CameraAccess, and DriverEasy.\nA second new malware family connected to the campaign is Tsunami-Framework, which is delivered as a follow-up payload to a known Python backdoor referred to as\nInvisibleFerret\n. A .NET-based modular malware, it's equipped to steal a wide range of data from web browsers and cryptocurrency wallets.\nIt also incorporates features to log keystrokes, collect files, and even a botnet component that appears to be under early development, German security company HiSolutions\nsaid\nin a report published late last month.\nContagious Interview, per\nESET\n, is believed to be a new activity cluster that's part of the\nLazarus Group\n, a notorious hacking group from North Korea that has a storied history of orchestrating both espionage- and financially-motivated attacks as a way to advance the nation's strategic goals and sidestep international sanctions.\nEarlier this year, the adversarial collective was attributed to the record-breaking\nbillion-dollar heist\nfrom cryptocurrency platform Bybit.\nThe North Korean IT Worker Threat Endures\nThe findings come as cybersecurity company Sophos revealed that the threat actors behind the\nfraudulent IT worker scheme\nfrom North Korea -- also known as Famous Chollima, Nickel Tapestry, and Wagemole -- have begun to increasingly target organizations in Europe and Asia, and industries beyond the technology sector to secure jobs and funnel the proceeds back to Pyongyang.\n\"Throughout the pre-employment phase, the threat actors often digitally manipulate photos for their falsified resumes and LinkedIn profiles, and to accompany prior work history or group project claims,\" the company's SecureWorks Counter Threat Unit (CTU)\nsaid\n.\n\"They commonly use stock photos overlaid with real images of themselves. The threat actors have also increased usage of generative AI, including writing tools, image-editing tools, and resume builders.\"\nThe fraudulent workers, upon landing a job, have also been found using\nmouse jiggler utilities\n, VPN software like Astrill VPN, and KVM over IP for remote access, in some cases even resorting to eight-hour-long Zoom calls for screen sharing.\nLast week, cryptocurrency exchange platform Kraken disclosed how a routine job interview for an engineering position turned into an intelligence-gathering operation after it spotted a North Korean hacker attempting to infiltrate the company using the name\nSteven Smith\n.\n\"The candidate used remote colocated Mac desktops but interacted with other components through a VPN, a setup commonly deployed to hide location and network activity,\" the company\nsaid\n. \"Their resume was linked to a GitHub profile containing an email address exposed in a past data breach.\"\n\"The candidate's primary form of ID appeared to be altered, likely using details stolen in an identity theft case two years prior.\"\nBut instead of rejecting the candidate's application outright, Kraken said its security and recruitment teams \"strategically\" advanced them through its interview process as way a to trap them by asking them to confirm their location, hold up a government-issued ID, and recommend some local restaurants in the city they claimed to be in.\n\"Flustered and caught off guard, they struggled with the basic verification tests, and couldn't convincingly answer real-time questions about their city of residence or country of citizenship,\" Kraken said. \"By the end of the interview, the truth was clear: this was not a legitimate applicant, but an imposter attempting to infiltrate our systems.\"\nIn another case documented by the U.S. Department of Justice (DoJ) last month, a 40-year-old Maryland man,\nMinh Phuong Ngoc Vong\n,\npleaded guilty\nto fraud after securing a job with a government contractor and then outsourcing the work to a North Korean national residing in Shenyang, China – underscoring the severity of the illicit fundraising activity.\nNorth Korea's ability to stealthily slip thousands of its workers into major companies, often with the help of\nfacilitators\nwho run what's called a laptop farm, has led to repeated warnings from Japanese, South Korean, U.K., and U.S. governments.\nThese workers have been found to\nspend up to 14 months\ninside an organization, with the threat actors also engaging in data theft and extortion threats following termination.\n\"Organizations [should] establish enhanced identity verification procedures as part of their interview process,\" Sophos said. \"Human resources staff and recruiters should be regularly updated on tactics used in these campaigns to help them identify potential fraudulent North Korean IT workers.\"\n\"Additionally, organizations should monitor for traditional insider threat activity, suspicious usage of legitimate tools, and impossible travel alerts to detect activity often associated with fraudulent workers.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Initial Access Brokers Target Brazil Execs via NF-e Spam and Legit RMM Trials",
        "Link": "https://thehackernews.com/2025/05/initial-access-brokers-target-brazil.html",
        "Summary": "Cybersecurity researchers are warning of a new campaign that's targeting Portuguese-speaking users in Brazil with trial versions of commercial remote monitoring and management (RMM) software since January 2025.\n\"The spam message uses the Brazilian electronic invoice system, NF-e, as a lure to entice users into clicking hyperlinks and accessing malicious content hosted in Dropbox,\" Cisco Talos",
        "Date": "2025-05-09",
        "Content": "Cybersecurity researchers are warning of a new campaign that's targeting Portuguese-speaking users in Brazil with trial versions of commercial remote monitoring and management (RMM) software since January 2025.\n\"The spam message uses the Brazilian electronic invoice system, NF-e, as a lure to entice users into clicking hyperlinks and accessing malicious content hosted in Dropbox,\" Cisco Talos researcher Guilherme Venere\nsaid\nin a Thursday report.\nThe attack chains begin with specially crafted spam emails that claim to originate from financial institutions or cell phone carriers, warning of overdue bills or outstanding payments in order to trick users into clicking on bogus Dropbox links that point to a binary installer for the RMM tool.\nTwo notable RMM tools observed are\nN-able RMM Remote Access\nand\nPDQ Connect\n, granting attackers the ability to read and write files to the remote file system.\nIn some cases, the threat actors then use the remote capabilities of these agents to download and install an additional RMM software such as ScreenConnect after the initial compromise.\nBased on the common recipients observed, the campaign has been found to mainly target C-level executives and financial and human resources account across several industries, including some educational and government institutions.\nIt has also been assessed with high confidence that the activity is the work of an initial access broker (IAB) that's abusing the free trial periods associated with various RMM programs to gain unauthorized access. N-able has since taken steps to disable the affected trial accounts.\n\"Adversaries' abuse of commercial RMM tools has steadily increased in recent years,\" Venere said. \"These tools are of interest to threat actors because they are usually digitally signed by recognized entities and are a fully featured backdoor.\"\n\"They also have little to no cost in software or infrastructure, as all of this is generally provided by the trial version application.\"\nThe development comes amid the emergence of various phishing campaigns that are engineered to sidestep modern defenses and propagate a wide range of malware families, or collect victims' credentials -\nA campaign conducted by a South American cybercrime group called\nHive0148\nto distribute the\nGrandoreiro\nbanking trojan to users in users in Mexico and Costa Rica.\nA campaign that employs a legitimate file-sharing service named\nGetShared\nto bypass security protections and direct users to links hosting malware\nA campaign that uses\nsales order-themed lures\nto deliver the\nFormbook\nmalware by means of a Microsoft Word document that's susceptible to a years-old flaw in Equation Editor (\nCVE-2017-11882\n)\nA campaign that has targeted organizations in Spain, Italy, and Portugal using invoice-related themes to deploy a Java-based remote access trojan named\nRatty RAT\nthat can execute remote commands, log keystrokes, capture screenshots, and steal sensitive data\nA campaign that\nuses\na legitimate note-taking application known as Milanote and an adversary-in-the-middle (AitM) phishing kit dubbed\nTycoon 2FA\nto capture users' credentials under the guise of viewing a \"new agreement\"\nCampaigns that\nutilize\nencoded JavaScript within SVG files, booby-trapped links in PDF attachments, dynamic phishing URLs that are rendered at runtime inside OneDrive-hosted files, and archived MHT payloads within OpenXML structures to direct users to credential harvesting or phishing pages\nCampaigns that abuse Cloudflare's\nTryCloudflare tunneling feature\nto deploy malware like\nAsyncRAT\n\"Attackers continuously evolve tactics to bypass modern email and endpoint security solutions, making detecting and mitigating phishing attempts increasingly difficult,\" Intezer researcher Yuval Guri noted last month. \"And despite advancements in cybersecurity tools, many phishing campaigns still successfully reach users' inboxes.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Deploying AI Agents? Learn to Secure Them Before Hackers Strike Your Business",
        "Link": "https://thehackernews.com/2025/05/deploying-ai-agents-learn-to-secure.html",
        "Summary": "AI agents are changing the way businesses work. They can answer questions, automate tasks, and create better user experiences. But with this power comes new risks — like data leaks, identity theft, and malicious misuse.\nIf your company is exploring or already using AI agents, you need to ask:&nbsp;Are they secure?\nAI agents work with sensitive data and make real-time decisions. If they’re not",
        "Date": "2025-05-09",
        "Content": "AI agents are changing the way businesses work. They can answer questions, automate tasks, and create better user experiences. But with this power comes new risks — like data leaks, identity theft, and malicious misuse.\nIf your company is exploring or already using AI agents, you need to ask:\nAre they secure?\nAI agents work with sensitive data and make real-time decisions. If they're not protected, attackers can exploit them to steal information, spread misinformation, or take control of systems.\nJoin Michelle Agroskin, Product Marketing Manager at\nAuth0\n, for a free, expert-led webinar —\nBuilding AI Agents Securely\n— that breaks down the most important AI security issues and what you can do about them.\nWhat You'll Learn:\nWhat AI Agents Are:\nUnderstand how AI agents work and why they're different from chatbots or traditional apps.\nWhat Can Go Wrong:\nLearn about real risks — like adversarial attacks, data leakage, and identity misuse.\nHow to Secure Them:\nDiscover proven methods and tools to protect your AI agents and earn user trust.\nWatch this Webinar\nThis is not a sales pitch. It's a practical, no-fluff session with real strategies you can use today. Whether you're already building with AI or just getting started, this webinar will help you stay ahead of threats.\nSecure your free registration\n➜\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Beyond Vulnerability Management – Can You CVE What I CVE?",
        "Link": "https://thehackernews.com/2025/05/beyond-vulnerability-management-cves.html",
        "Summary": "The Vulnerability Treadmill\nThe reactive nature of vulnerability management, combined with delays from policy and process, strains security teams. Capacity is limited and patching everything immediately is a struggle. Our Vulnerability Operation Center (VOC) dataset analysis identified 1,337,797 unique findings (security issues) across 68,500 unique customer assets. 32,585 of them were distinct",
        "Date": "2025-05-09",
        "Content": "The Vulnerability Treadmill\nThe reactive nature of vulnerability management, combined with delays from policy and process, strains security teams. Capacity is limited and patching everything immediately is a struggle. Our Vulnerability Operation Center (VOC) dataset analysis identified 1,337,797 unique findings (security issues) across 68,500 unique customer assets. 32,585 of them were distinct CVEs, with 10,014 having a CVSS score of 8 or higher. Among these, external assets have 11,605 distinct CVEs, while internal assets have 31,966. With this volume of CVEs, it's no surprise that some go unpatched and lead to compromises.\nWhy are we stuck in this situation, what can be done, and is there a better approach out there?\nWe'll explore the state of vulnerability reporting, how to prioritize vulnerabilities by threat and exploitation, examine statistical probabilities, and briefly discuss risk. Lastly, we'll consider solutions to minimize vulnerability impact while giving management teams flexibility in crisis response. This should give a good impression, but if you want the full story you can find it in our annual report, the\nSecurity Navigator\n.\nCan You CVE What I CVE?\nWestern nations and organizations use the Common Vulnerability Enumeration (CVE) and Common Vulnerability Scoring System (CVSS) to track and rate vulnerabilities, overseen by US government-funded programs like MITRE and NIST. By September 2024, the CVE program, active for 25 years, had published over 264,000 CVEs, and by 15 April 2025, the number of total CVEs increased to approximately 290,000 CVEs including \"Rejected\" or \"Deferred\".\nNIST's National Vulnerability Database (NVD) relies on CVE Numbering Authorities (CNAs) to record CVEs with initial CVSS assessments, which helps scale the process but also introduces biases. The disclosure of serious vulnerabilities is complicated by disagreements between researchers and vendors over impact, relevance, and accuracy, affecting the wider community\n[1, 2]\n.\nBy April 2025, a backlog of more than 24,000 unenriched CVEs accumulated at the NVD\n[3, 4]\ndue to bureaucratic delays that occurred in March 2024. Temporarily halting CVE enrichment despite ongoing vulnerability reports, and dramatically illustrating the fragility of this system. The temporary pause resulted in this backlog that is yet to be cleared.\nOn 15 April 2025, MITRE announced that the US Department of Homeland Security will not be renewing its contract with MITRE, impacting the CVE program directly\n[15]\n. This created a lot of uncertainty about the future of CVEs and how it will impact cybersecurity practitioners. Fortunately, funding for the CVE program was extended due to the strong community and industry response\n[16]\n.\nCVE and the NVD are not the sole sources of vulnerability intelligence. Many organizations, including ours, develop independent products that track far more vulnerabilities than the MITRE's CVE program and NIST NVD.\nSince 2009, China has operated its own vulnerability database, CNNVD\n[5]\n, which could be a valuable technical resource\n[6, 7]\n, though political barriers make collaboration unlikely. Moreover, not all vulnerabilities are disclosed immediately, creating blind spots, while some are exploited without detection—so-called 0-days.\nIn 2023, Google's Threat Analysis Group (TAG) and Mandiant identified 97 zero-day exploits, primarily affecting mobile devices, operating systems, browsers, and other applications. Meanwhile, only about 6% of vulnerabilities in the CVE dictionary have ever been exploited\n[8]\n, and studies from 2022 show that half of organizations patch just 15.5% or fewer vulnerabilities monthly\n[9]\n.\nWhile CVE is crucial for security managers, it's an imperfect, voluntary system, neither globally regulated nor universally adopted.\nThis blog also aims to explore how we might reduce reliance on it in our daily operations.\nThreat Informed\nDespite its shortcomings, the CVE system still provides valuable intelligence on vulnerabilities that could impact security. However, with so many CVEs to address, we must prioritize those most likely to be exploited by threat actors.\nThe Exploit Prediction Scoring System (EPSS), developed by the Forum of Incident Response and Security Teams (FIRST) SIG\n[10]\n, helps predict the likelihood of a vulnerability being exploited in the wild. With EPSS intelligence, security managers can either prioritize patching as many CVEs as possible for broad coverage or focus on critical vulnerabilities to maximize efficiency and prevent exploitation. Both approaches have pros and cons.\nTo demonstrate the tradeoff between coverage and efficiency, we need two datasets: one representing potential patches (VOC dataset) and another representing actively exploited vulnerabilities, which includes CISA KEV\n[10]\n, ethical hacking findings, and data from our CERT Vulnerability Intelligence Watch service\n[12]\n.\nSecurity Navigator 2025 is Here - Download Now\nThe newly released\nSecurity Navigator 2025\noffers critical insights into current digital threats, documenting 135,225 incidents and 20,706 confirmed breaches. More than just a report, it serves as a guide to navigating a safer digital landscape.\nWhat's Inside?\n#\n📈 In-Depth Analysis: Statistics from CyberSOC, Vulnerabilitiy scanning, Pentesting, CERT, Cy-X and Ransomware observations from Dark Net surveillance.\n🔮 Future-Ready: Equip yourself with security predictions and stories from the field.\n👁️ Security deep-dives: Get briefed on emerging trends related to hacktivist activities and LLMs/Generative AI.\nStay one step ahead in cybersecurity. Your essential guide awaits!\n🔗 Get Your Copy Now\nThe EPSS threshold is used to select a set of CVEs to patch, based on how likely they are to be exploited in the wild. The overlap between the remediation set and the exploited vulnerability set can be used to calculate the Efficiency, Coverage, and Effort of a selected strategy.\nEPSS predicts the likelihood of a vulnerability being exploited somewhere in the wild, not on any specific system. However, probabilities can \"scale.\" For example, flipping one coin gives a 50% chance of heads, but flipping 10 coins raises the chance of at least one head to 99.9%. This scaling is calculated using the complement rule\n[13]\n, which finds the probability of the desired outcome by subtracting the chance of failure from 1.\nAs FIRST explains, \"EPSS predicts the probability of a specific vulnerability being exploited and can be scaled to estimate threats across servers, subnets, or entire enterprises by calculating the probability of at least one event occurring.\"\n[14, 15]\nWith EPSS, we can similarly calculate the likelihood of at least one vulnerability being exploited from a list by using the complement rule.\nTo demonstrate, we analyzed 397 vulnerabilities from the VOC scan data of a Public Administration sector client. As the chart below illustrates, most vulnerabilities had low EPSS scores until a sharp rise at position 276. Also shown on the chart is the scaled probability of exploitation using the complement rule, which effectively reaches 100% when only the first 264 vulnerabilities are considered.\nAs the scaled EPSS curve (left) on the chart indicates, as more CVEs are considered, the scaled probability that one of them will be exploited in the wild increases very rapidly. By the time there are 265 distinct CVEs under consideration, the probability that one of them will be exploited in the wild is more than 99%. This level is reached before any individual vulnerabilities with high EPSS come into consideration. When the scaled EPSS value crosses 99% (Position 260) the maximum EPSS is still under 11% (0.11).\nThis example, based on actual client data on vulnerabilities exposed to the Internet, shows how difficult prioritizing vulnerabilities becomes as the number of systems increases.\nEPSS gives a probability that a vulnerability will be exploited in the wild, which is helpful for defenders, but we've shown how quickly this probability scales when multiple vulnerabilities are involved. With enough vulnerabilities, there is a real probability that one will get exploited, even when the individual EPSS scores are low.\nLike a weather forecast predicting a \"chance of rain,\" the larger the area, the greater the likelihood of rain somewhere. Likewise, it is likely impossible to reduce the probability of exploitation even closer down to zero.\nAttacker Odds\nWe've identified three critical truths that must be integrated into our examination of the vulnerability management process:\nAttackers aren't focused on specific vulnerabilities; they aim to compromise systems.\nExploiting vulnerabilities isn't the only path to compromise.\nAttackers' skill and persistence levels vary.\nThese factors allow us to extend our analysis of EPSS and probabilities to consider the likelihood of an attacker compromising some arbitrary system, then scaling that to determine the probability of compromising some system within a network that grants access to the rest.\nWe can assume each hacker has a certain \"probability\" of compromising a system, with this probability increasing based on their skill, experience, tools, and time. We can then continue applying probability scaling to assess attacker success against a broader computer environment.\nGiven a patient, undetected hacker, how many attempts are statistically required to breach a system granting access to the graph? Answering this requires applying a reworked binomial distribution in the form of this equation\n[16, 17]\n:\nUsing this equation, we can estimate how many attempts an attacker of a certain skill level would need. For instance, if attacker A1 has a 5% success rate (1 in 20) per system, they would need to target up to 180 systems to be 99.99% sure of success.\nAnother attacker, A2, with a 10% success rate (1 in 10), would need about 88 targets to ensure at least one success, while a more skilled attacker, A3, with a 20% success rate (1 in 5), would only need around 42 targets for the same probability.\nThese are probabilities—an attacker might succeed on the first try or require multiple attempts to reach the expected success rate. To assess real-world impact, we surveyed senior penetration testers in our business, who estimated their success rate against arbitrary internet-connected targets to be around 30%.\nAssuming a skilled attacker has a 5% to 40% chance of compromising a single machine, we can now estimate how many targets would be needed to nearly guarantee one successful compromise.\nThe implications are striking: with just 100 potential targets, even a moderately skilled attacker is almost certain to succeed at least once. In a typical enterprise, this single compromise often provides access to the wider network, and enterprises typically have thousands of computers to consider.\nReimagining Vulnerability Management\nFor the future, we need to conceive an environment and architecture that is immune to compromise from an individual system. In the short term, we argue that our approach to vulnerability management needs to change.\nThe current approach to vulnerability management is rooted in its name: focusing on \"vulnerabilities\" (as defined by CVE, CVSS, EPSS, misconfiguration, errors, etc) and their \"management.\" However, we have no control over the volume, speed, or significance of CVEs, leading us to constantly react to chaotic new intelligence.\nEPSS helps us prioritize vulnerabilities likely to be exploited in the wild, representing real threats, which forces us into a reactive mode. While mitigation addresses vulnerabilities, our response is truly about countering threats—hence, this process should be called Threat Mitigation.\nAs discussed earlier, it's statistically impossible to effectively counter threats in large enterprises by merely reacting to vulnerability intelligence. Risk Reduction is about the best we can do. Cyber risk results from a threat targeting a system's assets, leveraging vulnerabilities, and the potential impact of such an attack. By addressing risk, we open up more areas under our control to manage and mitigate.\nThreat Mitigation\nThreat Mitigation is a dynamic, ongoing process that involves identifying threats, assessing their relevance, and taking action to mitigate them. This response can include patching, reconfiguring, filtering, adding compensating controls, or even removing vulnerable systems. EPSS is a valuable tool that complements other sources of threat and vulnerability intelligence.\nHowever, the scaling nature of probabilities makes EPSS less useful in large internal environments. Since EPSS focuses on vulnerabilities likely to be exploited \"in the wild,\" it is most applicable to systems directly exposed to the internet. Therefore, Threat Mitigation efforts should primarily target those externally exposed systems.\nRisk Reduction\nCyber risk is a product of Threat, Vulnerability, and Impact. While the \"Threat\" is largely beyond our control, patching specific vulnerabilities in large environments doesn't significantly lower the risk of compromise. Therefore, risk reduction should focus on three key efforts:\nReducing the attack surface:\nAs the probability of compromise increases with scale, it can be reduced by shrinking the attack surface. A key priority is identifying and removing unmanaged or unnecessary internet-facing systems.\nLimiting the impact:\nLambert's law advises limiting attackers' ability to access and traverse the \"graph.\" This is achieved through segmentation at all levels—network, permissions, applications, and data. The Zero Trust architecture provides a practical reference model for this goal.\nImproving the baseline:\nInstead of focusing on specific vulnerabilities as they're reported or discovered, systematically reducing the overall number and severity of vulnerabilities lowers the risk of compromise. This approach prioritizes efficiency and Return on Investment, ignoring current acute threats in favor of long-term risk reduction.\nBy separating Threat Mitigation from Risk Reduction, we can break free from the constant cycle of reacting to specific threats and focus on more efficient, strategic approaches, freeing up resources for other priorities.\nAn Efficient Approach\nThis approach can be pursued systematically to optimize resources. The focus shifts from \"managing vulnerabilities\" to designing, implementing, and validating resilient architectures and baseline configurations. Once these baselines are set by security, IT can take over their implementation and maintenance.\nThe key here is that the \"trigger\" for patching internal systems is a predefined plan, agreed with system owners, to upgrade to a new, approved baseline. This approach is certain to be much less disruptive and more efficient than constantly chasing the latest vulnerabilities.\nVulnerability Scanning remains important for creating an accurate asset inventory and identifying non-compliant systems. It can support existing standardized processes, instead of triggering them.\nShaping the Future\nThe overwhelming barrage of randomly discovered and reported vulnerabilities as represented by CVE, CVSS and EPSS are stressing our people, processes and technology. We've effectively been approaching vulnerability management the same way for over two decades, with moderate success.\nIt's time to reimagine how we design, build, and maintain systems.\nA Template for a New Strategy\nKey factors to consider for security strategies toward 2030 and beyond:\nStarting at the source\nHuman Factor\nLeverage human strengths and anticipate their weaknesses.\nGain support from senior management and executives.\nBe an enabler, not a blocker.\nThreat-Informed Decision Making\nLearn from incidents and focus on what's being exploited.\nUse strategies to enhance remediation based on your capabilities.\nThreat Modeling and Simulation\nUse threat models to understand potential attack paths.\nConduct Ethical Hacking to test your environment against real threats.\nSystem Architecture and Design\nApply threat models and simulations to validate assumptions in new systems.\nReduce the attack surface systematically.\nStrengthen defense in depth by reviewing existing systems.\nTreat SASE and Zero-Trust as strategies, not just technology.\nSecure by Demand / Default\nImplement formal policies to embed security into corporate culture.\nEnsure vendors and suppliers have active security improvement programs.\nThere is more to this. This is just an excerpt of our coverage of vulnerabilities in the Security Navigator 2025. To find out more on how we can take back control, how different industries compare in our vulnerability screening operations and how factors like Generative AI impact cyber security I warmly recommend heading over to the\ndownload page\nand getting the full report!\n[1]\nPhoronix – Linux CVSS 9.9\n[2]\nBleeping\n[3]\nThe Record – NIST Backlog\n[4]\nCyberScoop – Vulnerability DB Plan\n[5]\nCNNVD – Official Site\n[6]\nSentinelOne – CNVD vs CVE\n[7]\nAtlantic Council – China & Vulnerabilities\n[8]\nGoogle – Zero Day Review (PDF)\n[9]\nKenna Security – Prioritization to Prediction Vol. 8\n[10]\nFIRST – CVSS\n[11]\nCISA – KEV Catalog\n[12]\nOrange Cyberdefense – Vulnerability Intelligence\n[13]\nThoughtCo – Complement Rule\n[14]\nFIRST – EPSS User Guide\n[15]\nEPSS – Scaling Predictions\n[16]\nMath StackExchange – Probability Formula\n[17]\nMath Is Fun – Binomial Distribution\nNote:\nThis article was expertly written and contributed by Wicus Ross, Senior Security Researcher at Orange Cyberdefense.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Malicious npm Packages Infect 3,200+ Cursor Users With Backdoor, Steal Credentials",
        "Link": "https://thehackernews.com/2025/05/malicious-npm-packages-infect-3200.html",
        "Summary": "Cybersecurity researchers have flagged three malicious npm packages that are designed to target the Apple macOS version of Cursor, a popular artificial intelligence (AI)-powered source code editor.\n\"Disguised as developer tools offering 'the cheapest Cursor API,' these packages steal user credentials, fetch an encrypted payload from threat actor-controlled infrastructure, overwrite Cursor's",
        "Date": "2025-05-09",
        "Content": "Cybersecurity researchers have flagged three malicious npm packages that are designed to target the Apple macOS version of Cursor, a popular artificial intelligence (AI)-powered source code editor.\n\"Disguised as developer tools offering 'the cheapest Cursor API,' these packages steal user credentials, fetch an encrypted payload from threat actor-controlled infrastructure, overwrite Cursor's main.js file, and disable auto-updates to maintain persistence,\" Socket researcher Kirill Boychenko\nsaid\n.\nThe packages in question are listed below -\nsw-cur\n(2,771 downloads)\nsw-cur1\n(307 downloads), and\naiide-cur\n(163 downloads)\nAll three packages continue to be available for download from the npm registry. \"Aiide-cur\" was first published on February 14, 2025. It was uploaded by a user named \"aiide.\" The npm library is described as a \"command-line tool for configuring the macOS version of the Cursor editor.\"\nThe other two packages, per the software supply chain security firm, were published a day earlier by a threat actor under the alias \"gtr2018.\" In total, the three packages have been downloaded over 3,200 times to date.\nThe libraries, once installed, are designed to harvest user-supplied Cursor credentials and fetch a next-stage payload from a remote server (\"t.sw2031[.]com\" or \"api.aiide[.]xyz\"), which is then used to replace a legitimate Cursor-specific code with malicious logic.\n\"Sw-cur\" also takes the step of disabling Cursor's auto-update mechanism and terminating all Cursor processes. The npm packages then proceed to restart the application so that the patched code takes effect, granting the threat actor to execute arbitrary code within the context of the platform.\nThe findings point to an emerging trend where threat actors are using malicious packages as a way to introduce malicious modifications to other legitimate libraries or software already installed on developer systems.\nThis is significant not least because it adds a new layer of sophistication by allowing the malware to persist even after the nefarious libraries have been removed, requiring developers to perform a clean install of the altered software again.\n\"Patch‑based compromise is a new and a powerful addition to the threat actor arsenal targeting open-source supply chains: Instead (or in addition) of slipping malware into a package manager, attackers publish a seemingly harmless npm package that rewrites code already trusted on the victim's machine,\" Socket told The Hacker News.\n\"By operating inside a legitimate parent process -- an IDE or shared library -- the malicious logic inherits the application's trust, maintains persistence even after the offending package is removed, and automatically gains whatever privileges that software holds, from API tokens and signing keys to outbound network access.\"\n\"This campaign highlights a growing supply chain threat, with threat actors increasingly using\nmalicious patches\nto compromise trusted local software,\" Boychenko said.\nThe selling point here is that the attackers are attempting to exploit developers' interest in AI as well as those who are looking for cheaper usage fees for access to AI models.\n\"The threat actor's use of the tagline 'the cheapest Cursor API' likely targets this group, luring users with the promise of discounted access while quietly deploying a backdoor,\" the researcher added.\nTo counter such novel supply chain threats, defenders are required to flag packages that run postinstall scripts, modify files outside node_modules, or initiate unexpected network calls, and combining those indicators with rigorous version pinning, real‑time dependency scanning, and file‑integrity monitoring on critical dependencies.\nThe disclosure comes as Socket uncovered two other npm packages – pumptoolforvolumeandcomment and debugdogs – to deliver an obfuscated payload that siphons cryptocurrency keys, wallet files, and trading data related to a cryptocurrency platform named BullX on and macOS systems. The captured data is exfiltrated to a Telegram bot.\nWhile \"pumptoolforvolumeandcomment\" has been downloaded 625 times, \"debugdogs\" have received a total of 119 downloads since they were both published to npm in September 2024 by a user named \"olumideyo.\"\n\"Debugdogs simply invokes pumptoolforvolumeandcomment, making it a convenient secondary infection payload,\" security researcher Kush Pandya\nsaid\n. \"This 'wrapper' pattern doubles down on the main attack, making it easier to spread under multiple names without changing the core malicious code.\"\n\"This highly targeted attack can empty wallets and expose sensitive credentials and trading data in seconds.\"\nNpm Package \"rand-user-agent\" Compromised in Supply Chain Attack\nThe discovery also follows a\nreport\nfrom Aikido about a supply chain attack that has compromised a legitimate npm package called \"\nrand-user-agent\n\" to inject code that conceals a remote access trojan (RAT). Versions 2.0.83, 2.0.84, and 1.0.110 have been found to be malicious.\nThe newly released versions, per security researcher Charlie Eriksen, are designed to establish communications with an external server to receive commands that allow it to change the current working directory, upload files, and execute shell commands. The compromise was detected on May 5, 2025.\nAt the time of writing, the npm package has been marked deprecated and the associated\nGitHub repository\nis also no longer accessible, redirecting users to a 404 page.\nIt's currently not clear how the npm package was breached to make the unauthorized modifications. Users who have upgraded to 2.0.83, 2.0.84, or 1.0.110 are advised to downgrade it back to the last safe version released seven months ago (2.0.82). However, doing so does not remove the malware from the system.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Google Rolls Out On-Device AI Protections to Detect Scams in Chrome and Android",
        "Link": "https://thehackernews.com/2025/05/google-rolls-out-on-device-ai.html",
        "Summary": "Google on Thursday announced it's rolling out new artificial intelligence (AI)-powered countermeasures to combat scams across Chrome, Search, and Android.\nThe tech giant said it will begin using Gemini Nano, its on-device large language model (LLM), to improve Safe Browsing in Chrome 137 on desktops.\n\"The on-device approach provides instant insight on risky websites and allows us to offer",
        "Date": "2025-05-09",
        "Content": "Google on Thursday announced it's rolling out new artificial intelligence (AI)-powered countermeasures to combat scams across Chrome, Search, and Android.\nThe tech giant said it will begin using\nGemini Nano\n, its on-device large language model (LLM), to improve\nSafe Browsing\nin Chrome 137 on desktops.\n\"The on-device approach provides instant insight on risky websites and allows us to offer protection, even against scams that haven't been seen before. Gemini Nano's LLM is perfect for this use because of its ability to distill the varied, complex nature of websites, helping us adapt to new scam tactics more quickly,\" the company\nsaid\n.\nGoogle noted that it's already using this AI-driven approach to tackle remote tech support scams, which often seek to trick users into parting with their personal or financial information under the pretext of a non-existent computer problem.\nThis works by evaluating the web pages using the LLM for potential signals that are emblematic of tech support scams, such as the use of the\nkeyboard lock API\n. The security signals are then extracted and passed to Safe Browsing to determine if the page is likely a scam.\n\"In addition to ensuring that the LLM is only triggered sparingly and run locally on the device, we carefully manage resource consumption by considering the number of tokens used, running the process asynchronously to avoid interrupting browser activity, and implementing throttling and quota enforcement mechanisms to limit GPU usage,\" Jasika Bawa, Andy Lim, and Xinghui Lu of the Google Chrome Security team\nsaid\n.\nOverview of how on-device LLM assistance in mitigating scams works\nGoogle said it intends to expand this feature to detect other kinds of scams, including those related to package tracking and unpaid tolls. The feature is also expected to be rolled out to Chrome on Android later this year.\nAs part of the announcement, Google also revealed that it has enhanced its AI-powered scam detection systems to ensnare 20 times more deceptive pages and block such pages from search results, reducing schemes that impersonate airline customer service providers by over 80% and those that mimic official resources like visas and government services by over 70% in 2024.\nLastly, Google said it's launching a new warnings feature for Chrome on Android that uses an on-device machine learning model to alert users of unwanted notifications sent by malicious sites that aim to trick them into downloading suspicious software or providing sensitive data.\n\"This new feature uses on-device machine learning to detect and warn you about potentially deceptive or spammy notifications, giving you an extra level of control over the information displayed on your device,\" Chrome Security's Hannah Buonomo and Sarah Krakowiak Criel\nsaid\n.\n\"When a notification is flagged by Chrome, you'll see the name of the site sending the notification, a message warning that the contents of the notification are potentially deceptive or spammy, and the option to either unsubscribe from the site or see the flagged content.\"\nThe features come a little over two months after Google\nrolled out\nAI-powered scam detection features in the Messages app for Android. Last year, the company\nunveiled\nsimilar ways to flag scam calls.\nThe updates also arrive as Google appears to be readying an\nAdvanced Protection feature\nin Android 16 that, in some ways,\nmirrors Apple's approach\nby turning off JavaScript, disabling 2G connections, and activating a number of security features by default, such as Theft Detection Lock, Offline Device Lock, Android Safe Browsing, and spam protection in Messages.\nGoogle has also been spotted working on a feature to detect scams that coax victims into opening their banking apps during phone calls, Android Authority\nreported\nearlier this week.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Chinese Hackers Exploit SAP RCE Flaw CVE-2025-31324, Deploy Golang-Based SuperShell",
        "Link": "https://thehackernews.com/2025/05/chinese-hackers-exploit-sap-rce-flaw.html",
        "Summary": "A China-linked unnamed threat actor dubbed Chaya_004 has been observed exploiting a recently disclosed security flaw in SAP NetWeaver.\nForescout Vedere Labs, in a report published Thursday, said it uncovered a malicious infrastructure likely associated with the hacking group weaponizing CVE-2025-31324 (CVSS score: 10.0) since April 29, 2025.\nCVE-2025-31324 refers to a critical SAP NetWeaver flaw",
        "Date": "2025-05-09",
        "Content": "A China-linked unnamed threat actor dubbed\nChaya_004\nhas been observed exploiting a recently disclosed security flaw in SAP NetWeaver.\nForescout Vedere Labs, in a\nreport\npublished Thursday, said it uncovered a malicious infrastructure likely associated with the hacking group weaponizing CVE-2025-31324 (CVSS score: 10.0) since April 29, 2025.\nCVE-2025-31324 refers to a critical SAP NetWeaver flaw that allows attackers to achieve remote code execution (RCE) by uploading web shells through a susceptible \"/developmentserver/metadatauploader\" endpoint.\nThe vulnerability was\nfirst flagged\nby ReliaQuest late last month when it found the shortcoming being abused in real-world attacks by unknown threat actors to drop web shells and the Brute Ratel C4 post-exploitation framework.\nAccording to Onapsis, hundreds of SAP systems globally have fallen victim to attacks spanning industries and geographies, including energy and utilities, manufacturing, media and entertainment, oil and gas, pharmaceuticals, retail, and government organizations.\nThe SAP security firm\nsaid\nit observed reconnaissance activity that involved \"testing with specific payloads against this vulnerability\" against its honeypots as far back as January 20, 2025. Successful compromises in deploying web shells were observed between March 14 and March 31.\nGoogle-owned Mandiant, which is also engaged in incident response efforts related to these attacks, has evidence of first known exploitation occurring on March 12, 2025.\nIn recent days, multiple threat actors are said to have jumped aboard the exploitation bandwagon to opportunistically target vulnerable systems to deploy web shells and even mine cryptocurrency.\nThis, per Forescout, also includes Chaya_004, which has hosted a web-based reverse shell written in Golang called\nSuperShell\non the IP address 47.97.42[.]177. The operational technology (OT) security company said it extracted the IP address from an ELF binary named config that was put to use in the attack.\n\"On the same IP address hosting Supershell (47.97.42[.]177), we also identified several other open ports, including 3232/HTTP using an anomalous self-signed certificate impersonating Cloudflare with the following properties: Subject DN: C=US, O=Cloudflare, Inc, CN=:3232,\" Forescout researchers Sai Molige and Luca Barba said.\nFurther analysis has uncovered the threat actor has to be hosting various tools across infrastructure:\nNPS\n,\nSoftEther VPN\n, Cobalt Strike, Asset Reconnaissance Lighthouse (\nARL\n),\nPocassit\n,\nGOSINT\n, and\nGO Simple Tunnel\n.\n\"The use of Chinese cloud providers and several Chinese-language tools points to a threat actor likely based in China,\" the researchers added.\nTo defend against attacks, it's essential that users apply the patches as soon as possible, if not already, restrict access to the metadata uploader endpoint, disable the Visual Composer service if not in use, and monitor for suspicious activity.\nOnapsis CTO Juan Pablo JP Perez-Etchegoyen told The Hacker News that the activity highlighted by Forescout is post-patch, and that it \"will further expand the threat of leveraging deployed web shells not only to opportunistic (and potentially less sophisticated) threat actors, but also more advanced ones seem to have been rapidly reacting to this issue to leverage the existing compromises and further expand.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Ascension says recent data breach affects over 430,000 patients",
        "Link": "https://www.bleepingcomputer.com/news/security/ascension-says-recent-data-breach-affects-over-430-000-patients/",
        "Summary": "Ascension, one of the largest private healthcare systems in the United States, has revealed that the personal and healthcare information of over 430,000 patients was exposed in a data breach disclosed last month. [...]",
        "Date": "2025-05-09",
        "Content": "Ascension, one of the largest private healthcare systems in the United States, has revealed that the personal and healthcare information of over 430,000 patients was exposed in a data breach disclosed last month.\nAs Ascension\nrevealed in breach notification letters\nsent to affected individuals in April, their information was stolen in a data theft attack that impacted a former business partner in December.\nDepending on the impacted patient, the attackers could access personal health information related to inpatient visits, including the physician's name, admission and discharge dates, diagnosis and billing codes, medical record number, and insurance company name. They could also gain access to personal information, including name, address, phone number(s), email address, date of birth, race, gender, and Social Security numbers (SSNs).\n\"On December 5, 2024, we learned that Ascension patient information may have been involved in a potential security incident. We immediately initiated an investigation to determine whether and how a security incident occurred,\"\nAscension said\n.\n\"Our investigation determined on January 21, 2025, that Ascension inadvertently disclosed information to a former business partner, and some of this information was likely stolen from them due to a vulnerability in third-party software used by the former business partner.\"\nWhile Ascension didn't reveal the total number of affected individuals at the time,\nan April 29 filing\nsaid that the incident impacted 114,692 individuals in Texas, and the company also told Massachusetts' Office of the Attorney General that 96 residents had their medical records and SSNs exposed in the incident.\nHowever, the healthcare giant also disclosed\nin an April 28 filing\nwith the U.S. Department of Health & Human Services (HHS) that wasn't published until today that the data breach affected 437,329 individuals.\nBreach details shared with the HHS (BleepingComputer)\n​Ascension offers two years of free identity monitoring services to those impacted by this incident, including credit monitoring, fraud consultation, and identity theft restoration.\nAlthough Ascension didn't share any details regarding the breach affecting its former business partner, the timeline of the breach implies that the attack was part of\nwidespread Clop ransomware data theft attacks\nthat exploited a zero-day flaw in Cleo secure file transfer software.\nLast year, Ascension\nnotified almost 5.6 million patients and employees\nthat their personal, financial, insurance, and health information had been stolen in a\nMay 2024 Black Basta ransomware attack\n.\nAfter the incident, the healthcare organization revealed that the ransomware breach resulted from an\nemployee downloading a malicious file\nonto a company device.\nFollowing the May 2024 attack, employees were forced to keep track of procedures and medications on paper, as patients' electronic records couldn't be accessed. Ascension also had to pause some non-emergent elective procedures, tests, and appointments and\nredirect emergency medical services\nto unaffected healthcare units to prevent triage delays.\nAscension has over 142,000 employees, operates 142 hospitals and 40 senior care facilities acoss North America, and reported revenues of $28.3 billion in 2023.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nAscension discloses new data breach after third-party hacking incident\nBaltimore City Public Schools data breach affects over 31,000 people\nFrederick Health data breach impacts nearly 1 million patients\nYale New Haven Health data breach affects 5.5 million patients\nBlue Shield of California leaked health data of 4.7 million members to Google"
    },
    {
        "Title": "Google Chrome to use on-device AI to detect tech support scams",
        "Link": "https://www.bleepingcomputer.com/news/security/google-chrome-to-use-on-device-ai-to-detect-tech-support-scams/",
        "Summary": "Google is implementing a new Chrome security feature that uses the built-in 'Gemini Nano' large-language model (LLM) to detect and block tech support scams while browsing the web. [...]",
        "Date": "2025-05-09",
        "Content": "Google is implementing a new Chrome security feature that uses the built-in 'Gemini Nano' large-language model (LLM) to detect and block tech support scams while browsing the web.\nTech support scams are malicious websites that trick users into thinking their computer has a virus infection or other problem. These alerts are shown as full-screen browser windows or will display additional pop-ups, making them difficult to close.\nThe goal is to convince the victim to call a listed number for help to either sell unnecessary remote support subscriptions or gain remote access to devices, which can lead to\nfinancial losses\nor data theft.\nExample tech support scam\nSource: BleepingComputer\nGoogle Chrome 126 to power AI features directly within the browser for faster, privacy-focused assistance.\nChrome's new anti-scam system, which is integrated into the browser's 'Enhanced Protection,' analyzes web pages in real time to detect scam signals like fake virus alerts or full-screen lockouts, which are hallmarks of tech support scams.\nThis analysis takes place offline, locally on the user's device using Gemini Nano. When there's a positive match, the data (LLM output + site metadata) is sent to 'Google Safe Browsing' for a more thorough evaluation.\nIf malicious intent is confirmed, Chrome will display a warning message informing the user of the risk.\nOverview of how the new system works\nSource: Google\nGoogle says the feature respects users' privacy and has only a minimal performance impact, though not many details were given in the announcement.\n\"This is all done in a way that preserves performance and privacy,\"\nannounced Google\n.\n\"In addition to ensuring that the LLM is only triggered sparingly and run locally on the device, we carefully manage resource consumption by considering the number of tokens used, running the process asynchronously to avoid interrupting browser activity, and implementing throttling and quota enforcement mechanisms to limit GPU usage.\"\nThe AI-powered protection feature will be implemented on Chrome 137, scheduled for release next week, and it will be enabled by default on all users who upgrade to the latest version and opt into 'Enhanced Protection' within the browser's Safe Browsing settings.\nOpen\nChrome Settings > Privacy and Security > Security > Enhanced Protection\nto enable it.\nSource: BleepingComputer\nGoogle stated it plans to expand the system in future releases and make it capable of detecting other scam types, such as fake package delivery or toll notices. Also, Chrome for Android will get this feature sometime in 2025.\nGoogle's new anti-scam feature is similar to what Microsoft\nintroduced for Edge\nearlier this year, which uses a specially trained machine learning model to detect and block scams targeting the user.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nGoogle NotebookLM is now using Gemini 2.5 Flash\nGoogle Gemini AI is getting ChatGPT-like Scheduled Actions feature\nGoogle Gemini's Astra (screen sharing) rolls out on Android for some users\nGoogle takes on Cursor with Firebase Studio, its AI builder for vibe coding\nGoogle blocked over 5 billion ads in 2024 amid rise in AI-powered scams"
    },
    {
        "Title": "Police dismantles botnet selling hacked routers as residential proxies",
        "Link": "https://www.bleepingcomputer.com/news/security/police-dismantles-botnet-selling-hacked-routers-as-residential-proxies/",
        "Summary": "Law enforcement authorities have dismantled a botnet that infected thousands of routers over the last 20 years to build two networks of residential proxies known as Anyproxy and 5socks. [...]",
        "Date": "2025-05-09",
        "Content": "Law enforcement authorities have dismantled a botnet that infected thousands of routers over the last 20 years to build two networks of residential proxies known as Anyproxy and 5socks.\nThe U.S. Justice Department also indicted three Russian nationals (Alexey Viktorovich Chertkov, Kirill Vladimirovich Morozov, and Aleksandr Aleksandrovich Shishkin) and a Kazakhstani (Dmitriy Rubtsov) for their involvement in operating, maintaining, and profiting from these two illegal services.\nDuring this joint action dubbed 'Operation Moonlander,' U.S. authorities worked with prosecutors and investigators from the Dutch National Police, the Netherlands Public Prosecution Service (Openbaar Ministerie), and the Royal Thai Police, as well as analysts with Lumen Technologies' Black Lotus Labs.\nCourt documents\nshow that the now-dismantled botnet infected older wireless internet routers worldwide with malware since at least 2004, allowing unauthorized access to compromised devices to be sold as proxy servers on Anyproxy.net and 5socks.net. The two domains were managed by a Virginia-based company and hosted on servers globally.\n\"The botnet controllers require cryptocurrency for payment. Users are allowed to connect directly with proxies using no authentication, which, as documented in previous cases, can lead to a broad spectrum of malicious actors gaining free access,\"\nBlack Lotus Labs said\n.\n\"Given the source range, only around 10% are detected as malicious in popular tools such as VirusTotal, meaning they consistently avoid network monitoring tools with a high degree of success. Proxies such as this are designed to help conceal a range of illicit pursuits including ad fraud, DDoS attacks, brute forcing, or exploiting victim's data.\"\nMap of compromised routers (Black Lotus Labs)\nTheir users paid a monthly subscription ranging from $9.95 to $110 per month, depending on the requested services. \"The website's slogan, 'Working since 2004!,' indicates that the service has been available for more than 20 years,\" the Justice Department\nsaid today\n.\nThe four defendants advertised the two services (promoting over 7,000 proxies) as residential proxy services on various websites, including ones used by cybercriminals, and they allegedly collected over $46 million from selling subscriptions providing access to the infected routers part of the Anyproxy botnet.\nThey operated the Anyproxy.net and 5socks.net websites using servers registered and hosted at JCS Fedora Communications, a Russian internet hosting provider. They also used servers in the Netherlands, Türkiye, and other locations to manage the Anyproxy botnet and the two websites.\nThey were all charged with conspiracy and damage to protected computers, while Chertkov and Rubtsov were also accused of falsely registering a domain name.\n5Socks.net seizure banner (BleepingComputer)\nTargeting end-of-life (EoL) routers\nOn Wednesday, the FBI also issued a flash advisory and a public service announcement warning that this botnet was\ntargeting patch end-of-life (EoL) routers\nwith a variant of the TheMoon malware.\nThe FBI warned that the attackers are installing proxies later used to evade detection during cybercrime-for-hire activities, cryptocurrency theft attacks, and other illegal operations.\nThe list of devices commonly targeted by the botnet includes Linksys and Cisco router models, including:\nLinksys E1200, E2500, E1000, E4200, E1500, E300, E3200, E1550\nLinksys WRT320N, WRT310N, WRT610N\nCisco M10 and Cradlepoint E100\n\"Recently, some routers at end of life, with remote administration turned on, were identified as compromised by a new variant of TheMoon malware. This malware allows cyber actors to install proxies on unsuspecting victim routers and conduct cyber crimes anonymously,\" the FBI said.\n\"Such residential proxy services are particularly useful to criminal hackers to provide anonymity when committing cybercrimes; residential-as opposed to commercial—IP addresses are generally assumed by internet security services as much more likely to be legitimate traffic,\" today's indictment added. \"In this way, conspirators obtained a private financial gain from the sale of access to the compromised routers.\"\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nFBI: End-of-life routers hacked for cybercrime proxy networks\nSamsung MagicINFO 9 Server RCE flaw now exploited in attacks\nPolice detains Smokeloader malware customers, seizes servers\nNew Mirai botnet behind surge in TVT DVR exploitation\nU.S. seized $8.2 million in crypto linked to 'Romance Baiting' scams"
    },
    {
        "Title": "Chinese hackers behind attacks targeting SAP NetWeaver servers",
        "Link": "https://www.bleepingcomputer.com/news/security/chinese-hackers-behind-attacks-targeting-sap-netweaver-servers/",
        "Summary": "Forescout Vedere Labs security researchers have linked ongoing attacks targeting a maximum severity vulnerability impacting SAP NetWeaver instances to a Chinese threat actor. [...]",
        "Date": "2025-05-09",
        "Content": "Forescout Vedere Labs security researchers have linked ongoing attacks targeting a maximum severity vulnerability impacting SAP NetWeaver instances to a Chinese threat actor.\nSAP\nreleased an out-of-band emergency patch\non April 24 to address this unauthenticated file upload security flaw (tracked as\nCVE-2025-31324\n) in SAP NetWeaver Visual Composer, days after cybersecurity company\nReliaQuest\nfirst detected the vulnerability being targeted in attacks.\nSuccessful exploitation enables unauthenticated attackers to upload malicious files without logging in, allowing them to gain remote code execution and potentially leading to complete system compromise.\nReliaQuest reported that multiple customers' systems were breached through unauthorized file uploads on SAP NetWeaver, with the threat actors uploading JSP web shells to public directories, as well as the Brute Ratel red team tool in the post-exploitation phase of their attacks. The compromised SAP NetWeaver servers were fully patched, indicating that the attackers used a zero-day exploit.\nThis exploitation activity was also confirmed by other cybersecurity firms, including watchTowr and\nOnapsis\n, who also confirmed the attackers were uploading web shell backdoors on unpatched instances exposed online.\nMandiant\nalso observed\nCVE-2025-31324 zero-day attacks dating back to at least mid-March 2025, while Onapsis updated its original report to say its honeypot first captured reconnaissance activity and payload testing since January 20, with exploitation attempts starting on February 10.\nThe Shadowserver Foundation is now\ntracking 204 SAP Netweaver servers\nexposed online and vulnerable to CVE-2025-31324 attacks.\nOnyphe CTO Patrice Auffret also told BleepingComputer in late April that \"Something like 20 Fortune 500/Global 500 companies are vulnerable, and many of them are compromised,\" adding that at the time, there were 1,284 vulnerable instances exposed online, 474 of which were already compromised.\nVulnerable SAP NetWeaver instances exposed online (Shadowserver Foundation)\n​Attacks linked to Chinese hackers\nMore recent attacks on April 29 have been linked to a Chinese threat actor tracked by\nForescout's Vedere Labs\nas Chaya_004.\nThese attacks were launched from IP addresses using anomalous self-signed certificates impersonating Cloudflare, many of them belonging to Chinese cloud providers (e.g., Alibaba, Shenzhen Tencent, Huawei Cloud Service, and China Unicom).\nThe attacker also deployed Chinese-language tools during the breaches, including a web-based reverse shell (SuperShell) developed by a Chinese-speaking developer.\n\"As part of our investigation into active exploitation of this vulnerability, we uncovered malicious infrastructure likely belonging to a Chinese threat actor, which we are currently tracking as Chaya_004 – following our convention for unnamed threat actors,\" Forescout said.\n\"The infrastructure includes a network of servers hosting Supershell backdoors, often deployed on Chinese cloud providers, and various pen testing tools, many of Chinese origin.\"\nSAP admins are advised to immediately patch their NetWeaver instances, restrict access to metadata uploader services, monitor for suspicious activity on their servers, and consider disabling the Visual Composer service if possible.\nCISA has also\nadded\nthe CVE-2025-31324 security flaw to its\nKnown Exploited Vulnerabilities Catalog\none week ago, ordering U.S. federal agencies to secure their systems against these attacks by May 20, as required by\nBinding Operational Directive (BOD) 22-01\n.\n\"These types of vulnerabilities are frequent attack vectors for malicious cyber actors and pose significant risks to the federal enterprise,\" CISA warned.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nOver 1,200 SAP NetWeaver servers vulnerable to actively exploited flaw\nSAP fixes suspected NetWeaver zero-day exploited in attacks\nIvanti patches Connect Secure zero-day exploited since mid-March\nSamsung MagicINFO 9 Server RCE flaw now exploited in attacks\nCritical Langflow RCE flaw exploited to hack AI app servers"
    },
    {
        "Title": "Germany takes down eXch cryptocurrency exchange, seizes servers",
        "Link": "https://www.bleepingcomputer.com/news/security/germany-takes-down-exch-cryptocurrency-exchange-seizes-servers/",
        "Summary": "The Federal police in Germany (BKA) seized the server infrastructure and shut down the 'eXch' cryptocurrency exchange platform for alleged money laundering cybercrime proceeds. [...]",
        "Date": "2025-05-09",
        "Content": "The Federal police in Germany (BKA) seized the server infrastructure and shut down the 'eXch' cryptocurrency exchange platform for alleged money laundering cybercrime proceeds.\nDuring the law enforcement operation, the authorities also seized eight terabytes of data and cryptocurrency (Bitcoin, Ether, Litecoin, and Dash) worth approximately $38,000,000, making this the third largest seizure of digital assets in BKA's history.\nThe BKA says the platform did not comply with 'know-your-customer' regulations, allowing money laundering by cybercrime and other illegal rings to bloom.\n\"Since its inception, an estimated 1.9 billion US dollars worth of cryptocurrencies have been transferred through the service,\"\nreads the announcement\n.\n\"There is a suspicion that eXch especially accepted Bitcoin of criminal origin. Among other things, part of the stolen 1.5 billion US dollars from the crypto exchange Bybit, which was hacked on February 21, 2025, is believed to have been laundered through eXch.\"\nThe record-breaking Bybit crypto-heist was conducted by the notorious North Korean hacking group 'Lazarus,' according to multiple blockchain experts.\nBanner displayed on the seized domains\nSource: BKA\neXch was\nimmediately implicated\nin Lazarus' money laundering efforts, which it vehemently denied at the time, dismissing some suspicious fund flows through them as isolated cases.\nEventually, the service's operators succumbed to the pressure and increased scrutiny,\nannouncing\nthey would shut down all operations on May 1, 2025.\nStill, BKA's seizure of eXch infrastructure, even if no longer active, could help trace stolen amounts and identify cybercriminals who used the service.\nThe operators of the platform aren't off the hook, as the German police announced they are under suspicion of commercial money laundering and operating a criminal online trading platform.\nThe BKA says that, despite the limited time they had since eXch announced the shutdown of its service, they managed to secure numerous pieces of evidence that led to today's law enforcement operation.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nGrinex exchange suspected rebrand of sanctioned Garantex crypto firm\nOKX suspends DEX aggregator after Lazarus hackers try to launder funds\nDDoS site Dstat.cc seized and two suspects arrested in Germany\nUS indicts Black Kingdom ransomware admin for Microsoft Exchange attacks\nNorth Korean hackers adopt ClickFix attacks to target crypto firms"
    },
    {
        "Title": "Rapid7 Launches Managed Detection &amp; Response (MDR) for Enterprise",
        "Link": "https://www.darkreading.com/cybersecurity-operations/rapid7-launches-managed-detection-response-mdr-for-enterprise",
        "Summary": "No summary available",
        "Date": "2025-05-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/rapid7-launches-managed-detection-response-mdr-for-enterprise"
    },
    {
        "Title": "After Pahalgam Attack, Hacktivists Unite Under #OpIndia",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/pahalgam-attack-hacktivists-unite-opindia",
        "Summary": "Cybercriminals are flocking to take part in the newly inflamed fight between India and Pakistan.",
        "Date": "2025-05-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/pahalgam-attack-hacktivists-unite-opindia"
    },
    {
        "Title": "LockBit Ransomware Gang Hacked, Operations Data Leaked",
        "Link": "https://www.darkreading.com/threat-intelligence/lockbit-ransomware-gang-hacked-data-leaked",
        "Summary": "Exposed data from LockBit's affiliate panel includes Bitcoin addresses, private chats with victim organizations, and user information such as credentials.",
        "Date": "2025-05-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/lockbit-ransomware-gang-hacked-data-leaked"
    },
    {
        "Title": "Cyber Then &amp; Now: Inside a 2-Decade Industry Evolution",
        "Link": "https://www.darkreading.com/cloud-security/cyber-then-now-2-decade-industry-evolution",
        "Summary": "On Dark Reading's 19-year anniversary, Editor-in-Chief Kelly Jackson Higgins stops by Informa TechTarget's RSAC 2025 Broadcast Alley studio to discuss how things have changed since the early days of breaking Windows and browsers, lingering challenges, and what's next beyond AI.",
        "Date": "2025-05-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/cyber-then-now-2-decade-industry-evolution"
    },
    {
        "Title": "Commvault: Vulnerability Patch Works as Intended",
        "Link": "https://www.darkreading.com/application-security/commvault-patch-works-as-intended",
        "Summary": "The security researcher who questioned the effectiveness of a patch for recently disclosed bug in Commvault Command Center did not test patched version, the company says.",
        "Date": "2025-05-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/application-security/commvault-patch-works-as-intended"
    },
    {
        "Title": "Insight Partners Data Breach: Bigger Impact Than Anticipated",
        "Link": "https://www.darkreading.com/threat-intelligence/insight-partners-data-breach-bigger-impact",
        "Summary": "The investigation is ongoing, but the VC giant intends to inform affected customers on a rolling basis as more of the breach details come to light.",
        "Date": "2025-05-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/insight-partners-data-breach-bigger-impact"
    },
    {
        "Title": "How Security Has Changed the Hacker Marketplace",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/how-security-changed-hacker-marketplace",
        "Summary": "Your ultimate goal shouldn't be security perfection — it should be making exploitation of your organization unprofitable.",
        "Date": "2025-05-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/how-security-changed-hacker-marketplace"
    },
    {
        "Title": "In Other News: India-Pakistan Cyberattacks, Radware Vulnerabilities, xAI Leak",
        "Link": "https://www.securityweek.com/in-other-news-india-pakistan-cyberattacks-radware-vulnerabilities-xai-leak/",
        "Summary": "<p>Noteworthy stories that might have slipped under the radar: surge in cyberattacks between India and Pakistan, Radware cloud WAF vulnerabilities, xAI key leak.</p>\n<p>The post <a href=\"https://www.securityweek.com/in-other-news-india-pakistan-cyberattacks-radware-vulnerabilities-xai-leak/\">In Other News: India-Pakistan Cyberattacks, Radware Vulnerabilities, xAI Leak</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/in-other-news-india-pakistan-cyberattacks-radware-vulnerabilities-xai-leak/"
    },
    {
        "Title": "Popular Scraping Tool’s NPM Package Compromised in Supply Chain Attack",
        "Link": "https://www.securityweek.com/popular-scraping-tools-npm-package-compromised-in-supply-chain-attack/",
        "Summary": "<p>Supply chain attack compromises the popular rand-user-agent NPM package to deploy and activate a backdoor.</p>\n<p>The post <a href=\"https://www.securityweek.com/popular-scraping-tools-npm-package-compromised-in-supply-chain-attack/\">Popular Scraping Tool&#8217;s NPM Package Compromised in Supply Chain Attack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/popular-scraping-tools-npm-package-compromised-in-supply-chain-attack/"
    },
    {
        "Title": "160,000 Impacted by Valsoft Data Breach",
        "Link": "https://www.securityweek.com/160000-impacted-by-valsoft-data-breach/",
        "Summary": "<p>VMS firm Valsoft Corporation says the personal information of over 160,000 people was compromised in a February 2025 data breach.</p>\n<p>The post <a href=\"https://www.securityweek.com/160000-impacted-by-valsoft-data-breach/\">160,000 Impacted by Valsoft Data Breach</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/160000-impacted-by-valsoft-data-breach/"
    },
    {
        "Title": "Malicious NPM Packages Target Cursor AI’s macOS Users",
        "Link": "https://www.securityweek.com/malicious-npm-packages-target-cursor-ais-macos-users/",
        "Summary": "<p>Three NPM packages posing as developer tools for Cursor AI code editor’s macOS version contain a backdoor.</p>\n<p>The post <a href=\"https://www.securityweek.com/malicious-npm-packages-target-cursor-ais-macos-users/\">Malicious NPM Packages Target Cursor AI&#8217;s macOS Users</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/malicious-npm-packages-target-cursor-ais-macos-users/"
    },
    {
        "Title": "Rising Tides: Kelley Misata on Bringing Cybersecurity to Nonprofits",
        "Link": "https://www.securityweek.com/rising-tides-kelley-misata-on-bringing-cybersecurity-to-nonprofits/",
        "Summary": "<p>Sightline Security’s founder explains why nonprofits need cybersecurity solutions tailored to their unique missions — and why vendors need to listen.</p>\n<p>The post <a href=\"https://www.securityweek.com/rising-tides-kelley-misata-on-bringing-cybersecurity-to-nonprofits/\">Rising Tides: Kelley Misata on Bringing Cybersecurity to Nonprofits</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/rising-tides-kelley-misata-on-bringing-cybersecurity-to-nonprofits/"
    },
    {
        "Title": "SAP Zero-Day Targeted Since January, Many Sectors Impacted",
        "Link": "https://www.securityweek.com/sap-zero-day-targeted-since-january-many-sectors-impacted/",
        "Summary": "<p>Hundreds of SAP NetWeaver instances hacked via a zero-day that allows remote code execution, not only arbitrary file uploads, as initially believed.</p>\n<p>The post <a href=\"https://www.securityweek.com/sap-zero-day-targeted-since-january-many-sectors-impacted/\">SAP Zero-Day Targeted Since January, Many Sectors Impacted </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/sap-zero-day-targeted-since-january-many-sectors-impacted/"
    },
    {
        "Title": "Company and Personal Data Compromised in Recent Insight Partners Hack",
        "Link": "https://www.securityweek.com/company-and-personal-data-compromised-in-recent-insight-partners-hack/",
        "Summary": "<p>VC firm Insight Partners is informing partners and employees that their information was exposed in the January 2025 cyberattack.</p>\n<p>The post <a href=\"https://www.securityweek.com/company-and-personal-data-compromised-in-recent-insight-partners-hack/\">Company and Personal Data Compromised in Recent Insight Partners Hack </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/company-and-personal-data-compromised-in-recent-insight-partners-hack/"
    },
    {
        "Title": "LockBit Ransomware Admin Panel Hacked, Leaks Reveal Inside Details",
        "Link": "https://www.securityweek.com/valuable-information-leaked-in-lockbit-ransomware-hack/",
        "Summary": "<p>Private messages, Bitcoin addresses, victim data, and attacker information were leaked after someone hacked a LockBit admin panel.</p>\n<p>The post <a href=\"https://www.securityweek.com/valuable-information-leaked-in-lockbit-ransomware-hack/\">LockBit Ransomware Admin Panel Hacked, Leaks Reveal Inside Details</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-09",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/valuable-information-leaked-in-lockbit-ransomware-hack/"
    }
]