[
    {
        "Title": "Samsung Patches CVE-2025-4632 Used to Deploy Mirai Botnet via MagicINFO 9 Exploit",
        "Link": "https://thehackernews.com/2025/05/samsung-patches-cve-2025-4632-used-to.html",
        "Summary": "Samsung has released software updates to address a critical security flaw in MagicINFO 9 Server that has been actively exploited in the wild.\nThe vulnerability, tracked as CVE-2025-4632 (CVSS score: 9.8), has been described as a path traversal flaw.\n\"Improper limitation of a pathname to a restricted directory vulnerability in Samsung MagicINFO 9 Server version before 21.1052 allows attackers to",
        "Date": "2025-05-14",
        "Content": "Samsung has released software updates to address a critical security flaw in MagicINFO 9 Server that has been actively exploited in the wild.\nThe vulnerability, tracked as\nCVE-2025-4632\n(CVSS score: 9.8), has been described as a path traversal flaw.\n\"Improper limitation of a pathname to a restricted directory vulnerability in Samsung MagicINFO 9 Server version before 21.1052 allows attackers to write arbitrary files as system authority,\" according to an\nadvisory\nfor the flaw.\nIt's worth noting that CVE-2025-4632 is a patch bypass for CVE-2024-7399, another path traversal flaw in the same product that was patched by Samsung in August 2024.\nCVE-2025-4632 has since been\nexploited\nin the wild shortly after the release of a proof-of-concept (PoC) by SSD Disclosure on April 30, 2025, in some instances to even deploy the Mirai botnet.\nWhile it was initially assumed that the attacks were targeting CVE-2024-7399, cybersecurity company Huntress first revealed the existence of an unpatched vulnerability last week after finding signs of exploitation even on MagicINFO 9 Server instances running the latest version (21.1050).\nIn a follow-up report published on May 9, Huntress\nrevealed\nthat three separate incidents that involved the exploitation of CVE-2025-4632, with unidentified actors running an identical set of commands to download additional payloads like \"srvany.exe\" and \"services.exe\" on two hosts and executing reconnaissance commands on the third.\nUsers of the Samsung MagicINFO 9 Server are recommended to apply the latest fixes as soon as possible to safeguard against potential threats.\n\"We have verified that\nMagicINFO 9 21.1052.0\ndoes mitigate the original issue raised in CVE-2025-4632,\" Jamie Levy, director of adversary tactics at Huntress, told The Hacker News.\n\"Any machine that has versions v8 - v9 21.1050.0 will still be affected by this vulnerability. We've also discovered that upgrading from MagicINFO v8 to v9 21.1052.0 is not as straightforward since you have to first upgrade to 21.1050.0 before applying the final patch.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "BianLian and RansomExx Exploit SAP NetWeaver Flaw to Deploy PipeMagic Trojan",
        "Link": "https://thehackernews.com/2025/05/bianlian-and-ransomexx-exploit-sap.html",
        "Summary": "At least two different cybercrime groups BianLian and RansomExx are said to have exploited a recently disclosed security flaw in SAP NetWeaver, indicating that multiple threat actors are taking advantage of the bug.\nCybersecurity firm ReliaQuest, in a new update published today, said it uncovered evidence suggesting involvement from the BianLian data extortion crew and the RansomExx ransomware",
        "Date": "2025-05-14",
        "Content": "At least two different cybercrime groups BianLian and RansomExx are said to have exploited a recently disclosed security flaw in SAP NetWeaver, indicating that\nmultiple threat actors\nare taking advantage of the bug.\nCybersecurity firm ReliaQuest, in a\nnew update\npublished today, said it uncovered evidence suggesting involvement from the BianLian data extortion crew and the RansomExx ransomware family, which is traced by Microsoft under the moniker Storm-2460.\nBianLian\nis assessed to be involved in at least one incident based on infrastructure links to IP addresses previously identified as attributed to the e-crime group.\n\"We identified a server at 184[.]174[.]96[.]74 hosting reverse proxy services initiated by the rs64.exe executable,\" the company said. \"This server is related to another IP, 184[.]174[.]96[.]70, operated by the same hosting provider. The second IP had previously been flagged as a command-and-control (C2) server associated with BianLian, sharing identical certificates and ports.\"\nReliaQuest said it also observed the deployment of a plugin-based trojan dubbed\nPipeMagic\n, which was most recently used in connection with the zero-day exploitation of a privilege escalation bug (CVE-2025-29824) in the Windows Common Log File System (CLFS) in limited attacks targeting entities in the U.S., Venezuela, Spain, and Saudi Arabia.\nThe attacks involved the delivery of PipeMagic by means of web shells dropped following the exploitation of the SAP NetWeaver flaw.\n\"Although the initial attempt failed, a subsequent attack involved the deployment of the Brute Ratel C2 framework using inline MSBuild task execution,\" ReliaQuest said. \"During this activity, a dllhost.exe process was spawned, signaling exploitation of the CLFS vulnerability (CVE-2025-29824), which the group had previously exploited, with this being a new attempt to exploit it via inline assembly.\"\nThe findings come a day after EclecticIQ\ndisclosed\nthat multiple Chinese hacking groups tracked as UNC5221, UNC5174, and CL-STA-0048 are actively exploiting CVE-2025-31324 to drop various malicious payloads.\nSAP security company Onapsis\nrevealed\nthat threat actors have also been exploiting CVE-2025-31324 alongside a deserialization flaw in the same component (CVE-2025-42999) since March 2025, adding the new patch fixes the root cause of CVE-2025-31324.\n\"There is little practical difference between CVE-2025-31324 and CVE-2025-42999 as long as CVE-2025-31324 is available for exploitation,\" ReliaQuest said in a statement shared with The Hacker News.\n\"CVE-2025-42999 indicates higher privileges would be required, however, CVE-2025-31324 affords full system access regardless. A threat actor could exploit both vulnerabilities in an authenticated and unauthenticated user in the same way. Therefore, the remediation advice is the same for both CVEs.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Xinbi Telegram Market Tied to $8.4B in Crypto Crime, Romance Scams, North Korea Laundering",
        "Link": "https://thehackernews.com/2025/05/xinbi-telegram-market-tied-to-84b-in.html",
        "Summary": "A Chinese-language, Telegram-based marketplace called Xinbi Guarantee has facilitated no less than $8.4 billion in transactions since 2022, making it the second major black market to be exposed after HuiOne Guarantee.\nAccording to a report published by blockchain analytics firm Elliptic, merchants on the marketplace have been found to peddle technology, personal data, and money laundering",
        "Date": "2025-05-14",
        "Content": "A Chinese-language, Telegram-based marketplace called\nXinbi Guarantee\nhas facilitated no less than $8.4 billion in transactions since 2022, making it the second major black market to be exposed after\nHuiOne Guarantee\n.\nAccording to a report published by blockchain analytics firm Elliptic, merchants on the marketplace have been found to peddle technology, personal data, and money laundering services.\n\"The USDT stablecoin is the primary payment method, with the market having received $8.4 billion in transactions to date,\" the company\nsaid\n. \"Some transactions can be linked to funds stolen by North Korea.\"\nXinbi, like HuiOne, has offered its services to scammers in Southeast Asia, including those responsible for so-called\nromance baiting schemes\n(formerly referred to as \"pig butchering\"), which has become one of the most lucrative forms of cybercrime in recent years.\nWhat's notable about these criminal bazaars is that they are entirely run on Telegram, becoming a one-stop shop to avail a wide range of services, ranging from technical tools to money laundering services to pull off online fraud at an industrial scale.\nXinbi Guarantee, per Elliptic, has 233,000 users, with merchants broken down to broad categories related to money laundering, Starlink satellite internet equipment, fake IDs, and databases of stolen personal information used to target potential victims.\nOther vendors go a step further by offering to stalk and intimidate any chosen target within China, provide women to act as egg donors or surrogates, or even engage in sex trafficking, indicating that the illicit services go beyond cyber scams.\n\"The marketplace is seeing strong growth - with Q4 2024 the first quarter to see inflows of more than $1 billion,\" Elliptic said. \"Transaction volumes on Chinese-language Guarantee marketplaces such as Huione and Xinbi Guarantee dwarf those of the first generation of Tor-based darknet marketplaces.\"\nBut perhaps the most interesting aspect of Xinbi is that it\nclaims\nto be an \"investment and capital-guarantee group company\" registered in the U.S. state of Colorado by someone named Mohd Shahrulnizam Bin Abd Manap. According to the\nstate corporate register\n, the company was incorporated in August 2022. It has since been marked as \"Delinquent\" for failing to file its periodic reports.\nBoth Xinbi and HuiOne Guarantee have also been used to launder cryptocurrency assets stolen by North Korea following the hack of the Indian cryptocurrency exchange\nWazirX\nlast July, with $220,000 in USDT sent to the wallet addresses controlled by the former on November 12, 2024.\nIn response to the findings, Elliptic said Telegram has shut down thousands of channels belonging to the two services, effectively disrupting the two largest marketplaces that have engaged in over $35 billion in USDT transactions.\nThe development comes weeks after the U.S. Department of the Treasury's Financial Crimes Enforcement Network (FinCEN)\ndesignated\nCambodia-based HuiOne Group as a \"primary money laundering concern\" in a bid to limit its access to the U.S. financial system.\n\"These platforms also provide a window onto a China-based underground banking system, based around stablecoins and other digital payments, which is being leveraged for money laundering on a significant scale,\" Elliptic said.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "CTM360 Identifies Surge in Phishing Attacks Targeting Meta Business Users",
        "Link": "https://thehackernews.com/2025/05/ctm360-identifies-surge-in-phishing.html",
        "Summary": "A new global phishing threat called \"Meta Mirage\" has been uncovered, targeting businesses using Meta's Business Suite. This campaign specifically aims at hijacking high-value accounts, including those managing advertising and official brand pages.\nCybersecurity researchers at CTM360 revealed that attackers behind Meta Mirage impersonate official Meta communications, tricking users into handing",
        "Date": "2025-05-14",
        "Content": "A new global phishing threat called \"\nMeta Mirage\n\" has been uncovered, targeting businesses using Meta's Business Suite. This campaign specifically aims at hijacking high-value accounts, including those managing advertising and official brand pages.\nCybersecurity researchers at\nCTM360\nrevealed that attackers behind Meta Mirage impersonate official Meta communications, tricking users into handing over sensitive details like passwords and security codes (OTP).\nThe scale of this operation is alarming. Researchers have already identified over\n14,000 malicious URLs\n, a concerning majority of which\n—nearly 78%—\nwere not blocked by browsers at the time the report was published.\nCybercriminals cleverly hosted fake pages leveraging trusted cloud platforms like GitHub, Firebase, and Vercel, making it harder to spot the scams. This method aligns closely with recent findings from Microsoft, which highlighted similar abuse of cloud hosting services to compromise Kubernetes applications, emphasizing how attackers frequently leverage trusted platforms to evade detection.\nThe attackers deploy fake alerts about policy violations, account suspensions, or urgent verification notices. These messages, sent via email and direct messages, look convincing because they mimic official communications from Meta, often appearing urgent and authoritative. This tactic mirrors techniques observed in the recent Google Sites phishing campaign, which used authentic-looking Google-hosted pages to deceive users.\nTwo main methods are being used:\nCredential Theft:\nVictims enter passwords and OTPs into realistic-looking fake websites. The attackers deliberately trigger fake error messages, causing users to re-enter their details, ensuring accurate and usable stolen information.\nCookie Theft:\nScammers also steal browser cookies, allowing them continued access to compromised accounts even without passwords.\nThese compromised accounts don't just affect individual businesses—they're often exploited to run malicious advertising campaigns, further amplifying damage, similar to tactics observed in the\nPlayPraetor malware campaign\nthat hijacked social media accounts for fraudulent ad distribution.\nCTM360's report also outlines a structured and calculated approach used by the attackers to maximize effectiveness. Victims are initially contacted with mild, non-alarming notifications that progressively escalate in urgency and severity. Initial notices might mention generic policy violations, while subsequent messages warn of immediate suspensions or permanent deletion of accounts. This incremental escalation induces anxiety and urgency, driving users to act quickly without thoroughly verifying the authenticity of these messages.\nTo protect against this threat,\nCTM360 recommends\n:\nOnly use official devices to manage business social media accounts.\nUse separate business-only email addresses.\nEnable Two-Factor Authentication (2FA).\nRegularly review account security settings and active sessions.\nTrain staff to recognize and report suspicious messages.\nThis widespread phishing campaign underscores the importance of vigilance and proactive security measures to protect valuable online assets.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Earth Ammit Breached Drone Supply Chains via ERP in VENOM, TIDRONE Campaigns",
        "Link": "https://thehackernews.com/2025/05/earth-ammit-breached-drone-supply.html",
        "Summary": "A cyber espionage group known as Earth Ammit has been linked to two related but distinct campaigns from 2023 to 2024 targeting various entities in Taiwan and South Korea, including military, satellite, heavy industry, media, technology, software services, and healthcare sectors.\nCybersecurity firm Trend Micro said the first wave, codenamed VENOM, mainly targeted software service providers, while",
        "Date": "2025-05-14",
        "Content": "A cyber espionage group known as Earth Ammit has been linked to two related but distinct campaigns from 2023 to 2024 targeting various entities in Taiwan and South Korea, including military, satellite, heavy industry, media, technology, software services, and healthcare sectors.\nCybersecurity firm Trend Micro said the first wave, codenamed VENOM, mainly targeted software service providers, while the second wave, referred to as TIDRONE, singled out the military industry. Earth Ammit is assessed to be connected to Chinese-speaking nation-state groups.\n\"In its VENOM campaign, Earth Ammit's approach involved penetrating the upstream segment of the drone supply chain,\" security researchers Pierre Lee, Vickie Su, and Philip Chen\nsaid\n. \"Earth Ammit's long-term goal is to compromise trusted networks via supply chain attacks, allowing them to target high-value entities downstream and amplify their reach.\"\nThe TIDRONE campaign was\nfirst exposed\nby Trend Micro last year, detailing the cluster's attacks on drone manufacturers in Taiwan to deliver custom malware such as CXCLNT and CLNTEND. A subsequent report from AhnLab in December 2024\ndetailed\nthe use of CLNTEND against South Korean companies.\nThe attacks are noteworthy for targeting the drone supply chain, leveraging enterprise resource planning (ERP) software to breach the military and satellite industries. Select incidents have also involved the use of trusted communication channels – such as remote monitoring or IT management tools – to distribute the malicious payloads.\nThe VENOM campaign, per Trend Micro, is characterized by the exploitation of web server vulnerabilities to drop web shells, and then weaponize the access to install remote access tools (RAT) for persistent access to the compromised hosts. The use of open-source tools like REVSOCK and Sliver in the attacks is seen as a deliberate attempt to cloud attribution efforts.\nThe only bespoke malware observed in the VENOM campaign is VENFRPC, a customized version of\nFRPC\n, which, in itself, is a modified version of the open-source fast reverse proxy (FRP) tool.\nThe end goal of the campaign is to harvest credentials from the breached environments and use the stolen information as a stepping stone to inform the next phase, TIDRONE, aimed at downstream customers. The TIDRONE campaign is spread over three stages -\nInitial access, which mirrors the VENOM campaign by targeting service providers to inject malicious code and distribute malware to downstream customers\nCommand-and-control, which makes use of a DLL loader to drop CXCLNT and CLNTEND backdoors\nPost-exploitation, which involves setting up persistence, escalating privileges, disabling antivirus software using\nTrueSightKiller\n, and installing a screenshot-capturing tool dubbed SCREENCAP using CLNTEND\n\"CXCLNT's core functionality is dependent on a modular plugin system. Upon execution, it retrieves additional plugins from its C&C server to extend its capabilities dynamically,\" Trend Micro said. \"This architecture not only obscures the backdoor's true purpose during static analysis but also enables flexible, on-demand operations based on the attacker's objectives.\"\nCXCLNT is said to have been put to use in attacks since at least 2022. CLNTEND, first detected in 2024, is its successor and comes with an expanded set of features to sidestep detection.\nThe connection between VENOM and TIDRONE stems from shared victims and service providers and overlapping command-and-control infrastructure, indicating that a common threat actor is behind both campaigns. Trend Micro said the hacking crew's tactics, techniques, and procedures (TTPs) resemble those used by another Chinese nation-state hacking group tracked as\nDalbit\n(aka m00nlight), suggestive of a shared toolkit.\n\"This progression underscores a deliberate strategy: start broad with low-cost, low-risk tools to establish access, then pivot to tailored capabilities for more targeted and impactful intrusions,\" the researchers said. \"Understanding this operational pattern will be critical in predicting and defending against future threats from this actor.\"\nJapan and Taiwan Targeted by Swan Vector\nThe disclosure comes as Seqrite Labs disclosed details of a cyber espionage campaign dubbed Swan Vector that has targeted educational institutes and the mechanical engineering industry in Taiwan and Japan with fake resume lures distributed via spear-phishing emails to deliver a DLL implant called Pterois, which is then used to download the Cobalt Strike shellcode.\nPterois is also engineered to download from Google Drive another malware referred to as Isurus that's then responsible for executing the Cobalt Strike post-exploitation framework. The campaign has been attributed to an East Asian threat actor with medium confidence.\n\"The threat actor is based out of East Asia and has been active since December 2024 targeting multiple hiring-based entities across Taiwan and Japan,\" security researcher Subhajeet Singha\nsaid\n.\n\"The threat actor relies on custom development of implants comprising of downloader, shellcode-loaders, and Cobalt Strike as their key tools with heavily relying on multiple evasion techniques like API hashing, direct-syscalls, function callback, DLL side-loading, and self-deletion to avoid leaving any sort of traces on the target machine.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Learning How to Hack: Why Offensive Security Training Benefits Your Entire Security Team",
        "Link": "https://thehackernews.com/2025/05/learning-how-to-hack-why-offensive.html",
        "Summary": "Organizations across industries are experiencing significant escalations in cyberattacks, particularly targeting critical infrastructure providers and cloud-based enterprises. Verizon’s recently released 2025 Data Breach Investigations Report found an 18% YoY increase in confirmed breaches, with the exploitation of vulnerabilities as an initial access step growing by 34%.&nbsp;\nAs attacks rise",
        "Date": "2025-05-14",
        "Content": "Organizations across industries are experiencing significant escalations in cyberattacks, particularly targeting critical infrastructure providers and cloud-based enterprises. Verizon's recently released\n2025 Data Breach Investigations Report\nfound an 18% YoY increase in confirmed breaches, with the exploitation of vulnerabilities as an initial access step growing by 34%.\nAs attacks rise in volume and impact, many organizations turn to security tools and compliance standards as their first line of defense. While both are important and necessary components to mitigating cyber risk, they alone are not a silver bullet solution. Effective security requires people, process,\nand\ntechnology, but people must serve as the primary drivers. Your tools and checklists are only as strong as the practitioners implementing them at scale.\nThis heightens the importance of investing in offensive operations training across every role in the security function. Too often, offensive operations are considered the singular domain of red teams and penetration testers. That narrow view limits its value. Ethical hacking, penetration testing, and other offensive skills provide critical insights that benefit numerous roles on a security team. It equips practitioners with a deeper understanding of how threat actors think and operate—foundational knowledge that directly strengthens an organization's collective security posture.\nCISOs that prioritize investments in this form of immersive, high-impact training can upskill their workforce and create more agile teams prepared to adapt in the face of evolving threats. For an inside look, here's how learning how to hack benefits four non-offensive security roles.\nNew Practitioners: Grasping the Threat Landscape\nThe cybersecurity workforce is evolving, unlike any industry. Efforts to offset global staffing shortages have ushered millions of new practitioners into the field in recent years. While this has helped to increase headcount, skill development is still lagging. Our\nSANS GIAC 2025 Cyber Workforce Research Report\nfound that 52% of security leaders indicate their primary challenge is not the number of available professionals, but the lack of individuals with the right skills.\nNew practitioners, especially those from conventional IT roles and non-security backgrounds, benefit immensely from exposure to offensive training. Reading about attacker tactics, techniques, and procedures (TTPs) in reports or courseware is valuable, but it doesn't compare to executing them in a scenario-based simulation. By actively replicating common attack paths like exploiting a misconfigured web server or bypassing access controls, practitioners begin to understand how threat actors capitalize on control gaps. This experience cultivates a more intuitive grasp of risk, teaching newcomers to approach security problems from a tactical perspective.\nUnderstanding attacker methodology also encourages better prioritization. It becomes easier to identify which vulnerabilities are most likely to be exploited and which alerts truly indicate malicious activity. Exposure to attacker tooling, from open-source frameworks to commercial payloads, gives practitioners a more grounded view of what the real-world threat landscape looks like. This knowledge accelerates their readiness to contribute meaningfully to detection engineering, triage, remediation, and various other efforts.\nIncident Handlers: Staying Two Steps Ahead\nThe integration of generative AI into TTPs has made the common threat actor increasingly capable of causing irremediable harm with a single breach. This means incident response demands speed, clarity, and precision now more than ever—the margin for error is razor thin. While tools and automation assist in detection, practitioners must be positioned to maximize operational efficiency in complex security environments. In turn, incident handlers who understand how adversaries operate are better equipped to move beyond simple playbooks and respond with intent. Offensive training sharpens this instinct. Practicing privilege escalation, persistence techniques, or lateral movement in simulated environments equips handlers to recognize attacker objectives and anticipate next steps, even before alerts are triggered.\nAttackers often follow repeatable workflows. Once you've performed these techniques yourself—such as abusing misconfigured Active Directory permissions or exploiting token impersonation—you become more attuned to subtle indicators of compromise that detection tools may overlook. Moreover, a deeper knowledge of adversary behavior supports faster root cause analysis and containment. Knowing the constraints and habits of threat actors allows response teams to hunt proactively, isolate affected systems more accurately, and recommend remediations that address root weaknesses.\nForensic Analysts: Contextualizing Digital Artifacts\nDigital forensics depends on the ability to reconstruct events using logs, memory dumps, file systems, and other artifacts. While forensic tools provide visibility, their outputs often lack clear meaning without practical context. Analysts who have studied and executed offensive techniques are more likely to recognize the operational patterns behind technical data. That insight could mean the difference between a basic report and one that truly reflects attacker activity.\nWhen an analyst have created malicious payloads or evaded logging mechanisms in a training environment, they can better decipher the nuances of what a tool is flagging. This aids in recognizing forged timestamps, tampered registry keys, or anomalous process execution sequences. Analysts are then able to formulate stronger hypotheses and trace lateral movement with greater precision.\nSecurity Managers: Validating Strategy with Adversary Insight\nSecurity managers are often tasked with aligning cyber defenses to organizational priorities and evolving business risks. While they may not be writing detection rules or responding to incidents directly, their decisions have a lasting impact on risk posture and program maturity. Managers who have participated in the right ethical hacking programs gain strategic clarity that is difficult to acquire otherwise. They know what high-quality penetration testing looks like, how real adversaries exploit systemic weaknesses, and where their teams may have blind spots.\nThat perspective helps managers avoid overreliance on toolsets or compliance frameworks that provide a false sense of assurance. When you understand how adversaries chain together low-severity vulnerabilities, bypass weak configurations, or exploit human behavior, you are better positioned to ask the right questions of vendors and internal teams. It also allows you to define more meaningful red team objectives, assess ROI from testing efforts, and ensure remediation efforts focus on exploitable gaps, not just policy violations.\nReady to sharpen your edge? Join me at two upcoming live training events, SANS San Antonio and SANS Offensive Operations East, for our\nSEC560: Enterprise Penetration Testing\ncourse and turn attacker insights into strategic advantage. Elevate your team's capability where it counts—on the front lines.\nRegister for SANS Operations East (Jun 8-14, 2025) here\n.\nRegister for SANS San Antonio (Aug 4-9, 2025) here.\nNote:\nThis article was expertly written and contributed by Jon Gorenflo, SANS Principal Instructor.\nLearn more about this background and courses here\n.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Horabot Malware Targets 6 Latin American Nations Using Invoice-Themed Phishing Emails",
        "Link": "https://thehackernews.com/2025/05/horabot-malware-targets-6-latin.html",
        "Summary": "Cybersecurity researchers have discovered a new phishing campaign that's being used to distribute malware called Horabot targeting Windows users in Latin American countries like Mexico, Guatemala, Colombia, Peru, Chile, and Argentina.\nThe campaign is \"using crafted emails that impersonate invoices or financial documents to trick victims into opening malicious attachments and can steal email",
        "Date": "2025-05-14",
        "Content": "Cybersecurity researchers have discovered a new phishing campaign that's being used to distribute malware called\nHorabot\ntargeting Windows users in Latin American countries like Mexico, Guatemala, Colombia, Peru, Chile, and Argentina.\nThe campaign is \"using crafted emails that impersonate invoices or financial documents to trick victims into opening malicious attachments and can steal email credentials, harvest contact lists, and install banking trojans,\" Fortinet FortiGuard Labs researcher Cara Lin\nsaid\n.\nThe activity, observed by the network security company in April 2025, has primarily singled out Spanish-speaking users. The attacks have also been found to send phishing messages from victims' mailboxes using Outlook COM automation, effectively propagating the malware laterally within corporate or personal networks.\nIn addition, the threat actors behind the campaign execute various VBScript, AutoIt, and PowerShell scripts to conduct system reconnaissance, steal credentials, and drop additional payloads.\nHorabot was\nfirst documented\nby Cisco Talos in June 2023 as targeting Spanish-speaking users in Latin America since at least November 2020. It's assessed that the attacks are the work of a threat actor from Brazil.\nThen last year, Trustwave SpiderLabs\nrevealed\ndetails of another phishing campaign targeting the same region with malicious payloads which it said exhibits similarities with that of Horabot malware.\nThe latest set of attacks starts with a phishing email that employs invoice-themed lures to entice users into opening a ZIP archive containing a PDF document. However, in reality, the attached ZIP file contains a malicious HTML file with Base64-encoded HTML data that's designed to reach out to a remote server and download the next-stage payload.\nThe payload is another ZIP archive that contains an HTML Application (HTA) file, which is responsible for loading a script hosted on a remote server. The script then injects an external Visual Basic Script (VBScript) that performs a series of checks that cause it to terminate if Avast antivirus is installed or it's running in a virtual environment.\nThe VBScript proceeds to collect basic system information, exfiltrate it to a remote server, and retrieves additional payloads, including an AutoIt script that unleashes the banking trojan by means of a malicious DLL and a PowerShell script that's tasked with spreading the phishing emails after building a list of target email addresses by scanning contact data within Outlook.\n\"The malware then proceeds to steal browser-related data from a range of targeted web browsers, including Brave, Yandex, Epic Privacy Browser, Comodo Dragon, Cent Browser, Opera, Microsoft Edge, and Google Chrome,\" Lin said. \"In addition to data theft, Horabot monitors the victim's behavior and injects fake pop-up windows designed to capture sensitive user login credentials.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft Fixes 78 Flaws, 5 Zero-Days Exploited; CVSS 10 Bug Impacts Azure DevOps Server",
        "Link": "https://thehackernews.com/2025/05/microsoft-fixes-78-flaws-5-zero-days.html",
        "Summary": "Microsoft on Tuesday shipped fixes to address a total of 78 security flaws across its software lineup, including a set of five zero-days that have come under active exploitation in the wild.\nOf the 78 flaws resolved by the tech giant, 11 are rated Critical, 66 are rated Important, and one is rated Low in severity. Twenty-eight of these vulnerabilities lead to remote code execution, 21 of them",
        "Date": "2025-05-14",
        "Content": "Microsoft on Tuesday shipped fixes to address a total of\n78 security flaws\nacross its software lineup, including a set of five zero-days that have come under active exploitation in the wild.\nOf the 78 flaws resolved by the tech giant, 11 are rated Critical, 66 are rated Important, and one is rated Low in severity. Twenty-eight of these vulnerabilities lead to remote code execution, 21 of them are privilege escalation bugs, and 16 others are classified as information disclosure flaws.\nThe updates are in addition to\neight more security defects\npatched by the company in its Chromium-based Edge browser since the release of last month's\nPatch Tuesday update\n.\nThe five vulnerabilities that have come under active exploitation in the wild are listed below -\nCVE-2025-30397\n(CVSS score: 7.5) - Scripting Engine Memory Corruption Vulnerability\nCVE-2025-30400\n(CVSS score: 7.8) - Microsoft Desktop Window Manager (DWM) Core Library Elevation of Privilege Vulnerability\nCVE-2025-32701\n(CVSS score: 7.8) - Windows Common Log File System (CLFS) Driver Elevation of Privilege Vulnerability\nCVE-2025-32706\n(CVSS score: 7.8) - Windows Common Log File System Driver Elevation of Privilege Vulnerability\nCVE-2025-32709\n(CVSS score: 7.8) - Windows Ancillary Function Driver for WinSock Elevation of Privilege Vulnerability\nWhile the first three flaws have been credited to Microsoft's own threat intelligence team, Benoit Sevens of Google Threat Intelligence Group and the CrowdStrike Advanced Research Team have been acknowledged for the discovery of CVE-2025-32706. An anonymous researcher has been credited with reporting CVE-2025-32709.\n\"Another zero-day vulnerability has been identified in the Microsoft Scripting Engine, a key component used by Internet Explorer and Internet Explorer mode in Microsoft Edge,\" Alex Vovk, CEO and co-founder of Action1,\nsaid\nabout CVE-2025-30397.\n\"Attackers can exploit the flaw via a malicious web page or script that causes the scripting engine to misinterpret object types, resulting in memory corruption and arbitrary code execution in the context of the current user. If the user has administrative privileges, attackers could gain full system control – enabling data theft, malware installation, and lateral movement across networks.\"\nCVE-2025-30400 is the third privilege escalation flaw in DWM Core Library to be weaponized in the wild since 2023. In May 2024, Microsoft issued patches for CVE-2024-30051, which Kaspersky\nsaid\nwas used in attacks distributing QakBot (aka Qwaking Mantis) malware.\n\"Since 2022, Patch Tuesday has addressed 26 elevation of privilege vulnerabilities in DWM,\" Satnam Narang, senior staff research engineer at Tenable, said in a statement shared with The Hacker News.\n\"In fact, the April 2025 release included fixes for five DWM Core Library elevation of privilege vulnerabilities. Prior to CVE-2025-30400, only two DWM elevation of privilege bugs were exploited as zero days – CVE-2024-30051 in 2024 and\nCVE-2023-36033\nin 2023.\"\nCVE-2025-32701 and CVE-2025-32706 are the seventh and eighth privilege escalation flaws to be discovered in the CLFS component and have been exploited in real-world attacks since 2022. Last month, Microsoft\nrevealed\nthat CVE-2025-29824 was exploited in limited attacks to target companies in the U.S., Venezuela, Spain, and Saudi Arabia.\nCVE-2025-29824 is also said to have been\nexploited\nas a zero-day by threat actors linked to the Play ransomware family as part of an attack targeting an unnamed organization in the U.S., Broadcom-owned Symantec revealed earlier this month.\nCVE-2025-32709, likewise, is the third privilege escalation flaw in the Ancillary Function Driver for WinSock component to have come under abuse within a span of a year, after\nCVE-2024-38193\nand\nCVE-2025-21418\n. It's worth noting that the exploitation of CVE-2024-38193 has been attributed to the North Korea-linked Lazarus Group.\nThe development has prompted the U.S. Cybersecurity and Infrastructure Security Agency (CISA) to add all five vulnerabilities to its Known Exploited Vulnerabilities (\nKEV\n) catalog, requiring federal agencies to apply the fixes by June 3, 2025.\nMicrosoft's Patch Tuesday update also addresses a privilege escalation bug in Microsoft Defender for Endpoint for Linux (\nCVE-2025-26684\n, CVSS score: 6.7) that could permit an authorized attacker to elevate privileges locally.\nStratascale researcher Rich Mirch, who is one of the two researchers, acknowledged for reporting the vulnerability, said the issue is rooted in a Python helper script that includes a function (\"grab_java_version()\") to determine the Java Runtime Environment (JRE) version.\n\"The function determines the location of the Java binary on disk by checking the /proc/<PID>/exe symbolic link and then executes the java -version command,\" Mirch\nexplained\n. \"The problem is the Java binary could be running from an untrusted location. A malicious local unprivileged user can create a process with the name java or javaw, which will eventually be executed with root privileges to determine the version of the JRE.\"\nAnother notable flaw is a spoofing vulnerability affecting Microsoft Defender for Identity (\nCVE-2025-26685\n, CVSS score: 6.5) that allows an attacker with LAN access to perform spoofing over an adjacent network.\n\"The\nlateral movement path detection feature\ncan itself potentially be exploited by an adversary to obtain an NTLM hash,\" Adam Barnett, lead software engineer at Rapid7, said in a statement. \"The compromised credentials in this case would be those of the Directory Services account, and exploitation relies on achieving fallback from Kerberos to NTLM.\"\nThe vulnerability with the maximum-severity is\nCVE-2025-29813\n(CVSS score: 10.0), a privilege escalation flaw in Azure DevOps Server that allows an unauthorized attacker to elevate privileges over a network. Microsoft said the shortcoming has been already deployed in the cloud and there is no action required on the part of customers.\nSoftware Patches from Other Vendors\nIn addition to Microsoft, security updates have also been released by other vendors over the past few weeks to rectify several vulnerabilities, including —\nAdobe\nAmazon Web Services\nAMD\nApple\nArm\nASUS\nBosch\nBroadcom\n(including VMware)\nCanon\nCisco\nCitrix\nCODESYS\nDell\nDrupal\nF5\nFortinet\nFortra\nGitLab\nGoogle\nAndroid\nand\nPixel\nGoogle Chrome\nGoogle Cloud\nGoogle Wear OS\nHitachi Energy\nHP\nHP Enterprise\n(including Aruba Networking)\nIBM\nIntel\nIvanti\nJuniper Networks\nLenovo\nLinux distributions\nAmazon Linux\n,\nDebian\n,\nOracle Linux\n,\nRed Hat\n,\nRocky Linux\n,\nSUSE\n, and\nUbuntu\nMediaTek\nMitel\nMitsubishi Electric\nMoxa\nMozilla\nFirefox, Firefox ESR, and Thunderbird\nNVIDIA\nPalo Alto Networks\nQualcomm\nSamsung\nSAP\nSchneider Electric\nSiemens\nSonicWall\nSplunk\nSpring Framework\nTP-Link\nTrend Micro\nVeritas\nZoom\n, and\nZyxel\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Fortinet Patches CVE-2025-32756 Zero-Day RCE Flaw Exploited in FortiVoice Systems",
        "Link": "https://thehackernews.com/2025/05/fortinet-patches-cve-2025-32756-zero.html",
        "Summary": "Fortinet has patched a critical security flaw that it said has been exploited as a zero-day in attacks targeting FortiVoice enterprise phone systems.\nThe vulnerability, tracked as CVE-2025-32756, carries a CVSS score of 9.6 out of 10.0.\n\"A stack-based overflow vulnerability [CWE-121] in FortiVoice, FortiMail, FortiNDR, FortiRecorder, and FortiCamera may allow a remote unauthenticated attacker to",
        "Date": "2025-05-14",
        "Content": "Fortinet has patched a critical security flaw that it said has been exploited as a zero-day in attacks targeting FortiVoice enterprise phone systems.\nThe vulnerability, tracked as CVE-2025-32756, carries a CVSS score of 9.6 out of 10.0.\n\"A stack-based overflow vulnerability [CWE-121] in FortiVoice, FortiMail, FortiNDR, FortiRecorder, and FortiCamera may allow a remote unauthenticated attacker to execute arbitrary code or commands via crafted HTTP requests,\" the company\nsaid\nin an advisory.\nThe company said it observed the flaw being exploited in the wild on FortiVoice systems, but did not disclose the scale of the attacks and the identity of the threat actors behind them.\nIt further noted that the threat actor performed device network scans, erased system crash logs, and enabled fcgi debugging to log credentials from the system or SSH login attempts.\nThe issue affects the following products and versions -\nFortiCamera 1.1, 2.0 (Migrate to a fixed release)\nFortiCamera 2.1.x (Upgrade to 2.1.4 or above)\nFortiMail 7.0.x (Upgrade to 7.0.9 or above)\nFortiMail 7.2.x (Upgrade to 7.2.8 or above)\nFortiMail 7.4.x (Upgrade to 7.4.5 or above)\nFortiMail 7.6.x (Upgrade to 7.6.3 or above)\nFortiNDR 1.1, 1.2, 1.3, 1.4, 1.5, 7.1 (Migrate to a fixed release)\nFortiNDR 7.0.x (Upgrade to 7.0.7 or above)\nFortiNDR 7.2.x (Upgrade to 7.2.5 or above)\nFortiNDR 7.4.x (Upgrade to 7.4.8 or above)\nFortiNDR 7.6.x (Upgrade to 7.6.1 or above)\nFortiRecorder 6.4.x (Upgrade to 6.4.6 or above)\nFortiRecorder 7.0.x (Upgrade to 7.0.6 or above)\nFortiRecorder 7.2.x (Upgrade to 7.2.4 or above)\nFortiVoice 6.4.x (Upgrade to 6.4.11 or above)\nFortiVoice 7.0.x (Upgrade to 7.0.7 or above)\nFortiVoice 7.2.x (Upgrade to 7.2.1 or above)\nFortinet said the vulnerability was discovered by its product security team based on the threat actor activity that originated from the below IP addresses -\n198.105.127.124\n43.228.217.173\n43.228.217.82\n156.236.76.90\n218.187.69.244\n218.187.69.59\nUsers of FortiVoice, FortiMail, FortiNDR, FortiRecorder and FortiCamera are recommended to apply the necessary fixes to secure their devices from active exploitation attempts. If immediate patching is not an option, it's advised to disable the HTTP/HTTPS administrative interface as a temporary workaround.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Ivanti Patches EPMM Vulnerabilities Exploited for Remote Code Execution in Limited Attacks",
        "Link": "https://thehackernews.com/2025/05/ivanti-patches-epmm-vulnerabilities.html",
        "Summary": "Ivanti has released security updates to address two security flaws in Endpoint Manager Mobile (EPMM) software that have been chained in attacks to gain remote code execution.\nThe vulnerabilities in question are listed below -\n\nCVE-2025-4427 (CVSS score: 5.3) - An authentication bypass in Ivanti Endpoint Manager Mobile allowing attackers to access protected resources without proper credentials",
        "Date": "2025-05-14",
        "Content": "Ivanti has\nreleased\nsecurity updates to address two security flaws in Endpoint Manager Mobile (EPMM) software that have been chained in attacks to gain remote code execution.\nThe vulnerabilities in question are listed below -\nCVE-2025-4427\n(CVSS score: 5.3) - An authentication bypass in Ivanti Endpoint Manager Mobile allowing attackers to access protected resources without proper credentials\nCVE-2025-4428\n(CVSS score: 7.2) - A remote code execution vulnerability in Ivanti Endpoint Manager Mobile allowing attackers to execute arbitrary code on the target system\nThe flaws impact the following versions of the product -\n11.12.0.4 and prior (Fixed in 11.12.0.5)\n12.3.0.1 and prior (Fixed in 12.3.0.2)\n12.4.0.1 and prior (Fixed in 12.4.0.2)\n12.5.0.0 and prior (Fixed in 12.5.0.1)\nIvanti, which credited CERT-EU for reporting the issues,\nsaid\nit's \"aware of a very limited number of customers who have been exploited at the time of disclosure\" and that the vulnerabilities are \"associated with two open-source libraries integrated into EPMM.\"\nThe company, however, did not disclose the names of the impacted libraries. It's also not known what other software applications relying on the two libraries could be affected. Furthermore, the company said it's still investigating the cases, and that it does not have reliable indicators of compromise associated with the malicious activity.\n\"The risk to customers is significantly reduced if they already filter access to the API using either the built-in Portal ACLs functionality or an external web application firewall,\" Ivanti noted.\n\"The issue only affects the on-prem EPMM product. It is not present in Ivanti Neurons for MDM, Ivanti's cloud-based unified endpoint management solution, Ivanti Sentry, or any other Ivanti products.\"\nSeparately, Ivanti has also\nshipped patches\nto contain an authentication bypass flaw in on-premise versions of Neurons for ITSM (CVE-2025-22462, CVSS score: 9.8) that could allow a remote unauthenticated attacker to gain administrative access to the system. There is no evidence that the security defect has been exploited in the wild.\nWith zero-days in Ivanti appliances becoming a\nlightning rod for threat actors\nin recent years, it's imperative that users move quickly to update their instances to the latest versions for optimal protection.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Google Chrome to block admin-level browser launches for better security",
        "Link": "https://www.bleepingcomputer.com/news/google/google-chrome-to-block-admin-level-browser-launches-for-better-security/",
        "Summary": "Google is rolling out a change to Chromium that \"de-elevates\" Google Chrome so it does not run as an administrator to increase security in Windows. [...]",
        "Date": "2025-05-14",
        "Content": "Google is rolling out a change to Chromium that \"de-elevates\" Google Chrome so it does not run as an administrator to increase security in Windows.\nMicrosoft\npreviously introduced\na similar feature in 2019 to the Edge Browser. When users launched Edge with elevated permissions, a warning would appear, recommending that they relaunch the browser without administrative rights.\nLater, Microsoft modified the feature to automatically prevent the Edge browser from launching with elevated permissions.\nMicrosoft is now bringing the same improvements to Chromium, with developers submitting a commit to the Chromium source code.\nAs\nspotted\nby Leo on X, Microsoft has confirmed that Chrome will now automatically de-elevate when users try to launch it with elevated permissions.\n\"Automatically de-elevate users launching chrome elevated. This CL is based on changes we've had in Edge, circa 2019, which attempts to automatically de-elevate the browser when it's run with the elevated part of a split / linked token,\" Stefan Smolen, who works with the Microsoft Edge team, wrote in a\nChromium commit\n.\n\"This automatically attempts a relaunch once, and then if it still fails it falls back to the current behaviour (which tries to launch admin).\"\nMicrosoft has also added a command-line switch, \"-do-not-de-elevate,\"  to prevent the de-elevation after an auto-relaunch to prevent infinite loops.\n\" Do not de-elevate the browser on launch. Used after de-elevating to prevent infinite loops,\" reads a comment in the source code.\nThis feature does not work for Chrome processes launched with elevated rights when in automation mode, so as not to interfere with tools that may need to run automatically.\nHowever, in general, Microsoft warns that launching the browser in admin mode is not a good idea.\nWhen Chrome runs as an Administrator, it inherits elevated permissions, which means anything you download and open through the browser will also launch with Administrator rights, which can pose a serious security risk.\nIf you accidentally download and run a malicious file, it could execute with full system access, potentially compromising your entire operating system without any warning.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nGoogle Chrome to use on-device AI to detect tech support scams\nGoogle fixes Chrome zero-day exploited in espionage campaign\nStop Googling how to use Teams or Docs — Get this course deal instead\nHackers behind UK retail attacks now targeting US companies\nAndroid 16 expands 'Advanced Protection' with device-level security"
    },
    {
        "Title": "Hackers behind UK retail attacks now targeting US companies",
        "Link": "https://www.bleepingcomputer.com/news/security/google-scattered-spider-switches-targets-to-us-retail-chains/",
        "Summary": "Google warned today that hackers using Scattered Spider tactics against retail chains in the United Kingdom have also started targeting retailers in the United States. [...]",
        "Date": "2025-05-14",
        "Content": "Google warned today that hackers using Scattered Spider tactics against retail chains in the United Kingdom have also started targeting retailers in the United States.\n\"The US retail sector is currently being targeted in ransomware and extortion operations that we suspect are linked to UNC3944, also known as Scattered Spider,\" John Hultquist, Chief Analyst at Google Threat Intelligence Group, told BleepingComputer.\n\"The actor, which has reportedly targeted retail in the UK following a long hiatus, has a history of focusing their efforts on a single sector at a time, and we anticipate they will continue to target the sector in the near term. US retailers should take note.\"\nAs\nfirst reported by BleepingComputer,\nBritish retail giant Marks & Spencer (M&S) was first breached in a ransomware attack where threat actors encrypted virtual machines on VMware ESXi hosts with a DragonForce encryptor. This attack was attributed to Octo Tempest, Microsoft's name for Scattered Spider.\nCo-op also experienced\nanother cyber incident\n,\nconfirming\nthat attackers stole data from many current and former members.\nHarrods also disclosed\non May 1st that it was forced to restrict internet access to sites after attackers tried to infiltrate its network, suggesting an active response to a cyberattack even though a breach has yet to be confirmed.\nThe DragonForce ransomware operation ​​​​​has\nclaimed all three attacks\n, and BleepingComputer has learned that the attackers who orchestrated them have used the same social engineering tactics linked to Scattered Spider threat actors. DragonForce surfaced in December 2023 and has\nrecently begun advertising a new service\ndesigned to allow other cybercrime groups to white-label their services.\nSince Scattered Spider started targeting UK retailers in April, the UK National Cyber Security Centre (NCSC) has\npublished guidance\nto help UK organizations strengthen their cybersecurity defenses and has also\ncautioned\nthat these cyberattacks should be seen as a \"wake-up call\", as any of them could become the next target.\nThe UK NCSC has yet to attribute these incidents to a specific hacking group or threat actor and said it's still working with victims to determine that.\n\"Whilst we have insights, we are not yet in a position to say if these attacks are linked, if this is a concerted campaign by a single actor, or whether there is no link between them at all,\"\nstated\nthe NCSC. \"We are working with the victims and law enforcement colleagues to ascertain that.\"\nThe Scattered Spider threat actors\nScattered Spider (also tracked as\n0ktapus\n,\nUNC3944\n,\nScatter Swine\n, Starfraud, and\nMuddled Libra\n) is a term used to describe a fluid collective of threat actors known for breaching many high-profile organizations worldwide in sophisticated social engineering attacks that also involve phishing, SIM swapping, multi-factor authentication (MFA) bombing (also known as targeted MFA fatigue).\nTheir attacks escalated in September 2023 when they\nbreached MGM Resorts,\nusing the BlackCat ransomware to\nencrypt over 100 VMware ESXi hypervisors\nafter breaching the network by impersonating an employee when calling the IT help desk.\nSince then, they've also acted as affiliates for various other ransomware operations, including\nRansomHub\n,\nQilin\n, and, now, DragonForce. Other attacks linked to Scattered Spider include those on\nTwilio\n,\nCoinbase\n,\nDoorDash\n,\nCaesars\n,\nMailChimp\n,\nRiot Games\n, and\nReddit\n.\nSome Scattered Spider threat actors are also believed to be part of the \"Com,\" a loosely connected community involved in cyberattacks and violent acts that have often attracted\nmedia attention\n.\nThese cybercriminals are as young as 16, and most are English speakers who frequent the same Telegram channels, Discord servers, and hacker forums where they plan and conduct their attacks in real time.\nAlthough news outlets and security researchers frequently use \"Scattered Spider\" to describe this collective as a cohesive gang, it refers to a loosely-knit group of threat actors who use specific tactics during their attacks, making it challenging to track their activities.\n\"These actors are aggressive, creative, and particularly effective at circumventing mature security programs. They have had a lot of success with social engineering and leveraging third parties to gain entry to their targets,\" Hultquist told BleepingComputer today.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nAndroid 16 expands 'Advanced Protection' with device-level security\nSteel giant Nucor Corporation facing disruptions after cyberattack\nKosovo extradites BlackDB admin to face US cybercrime charges\nGoogle to pay $1.375 billion to settle Texas data privacy violations\nGoogle Chrome to use on-device AI to detect tech support scams"
    },
    {
        "Title": "Ransomware gangs join ongoing SAP NetWeaver attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/ransomware-gangs-join-ongoing-sap-netweaver-attacks/",
        "Summary": "Ransomware gangs have joined ongoing SAP NetWeaver attacks, exploiting a maximum-severity vulnerability that allows threat actors to gain remote code execution on vulnerable servers. [...]",
        "Date": "2025-05-14",
        "Content": "Ransomware gangs have joined ongoing SAP NetWeaver attacks, exploiting a maximum-severity vulnerability that allows threat actors to gain remote code execution on vulnerable servers.\nSAP\nreleased emergency patches\non April 24 to address this NetWeaver Visual Composer unauthenticated file upload security flaw (\nCVE-2025-31324\n), days after it was first tagged by cybersecurity company ReliaQuest as targeted in the wild.\nSuccessful exploitation lets threat actors upload malicious files without requiring login credentials, potentially leading to complete system compromise.\nToday, in an update to their original advisory,\nReliaQuest\nrevealed\nthat\nthe RansomEXX and BianLian ransomware operations have also joined these attacks, although no ransomware payloads were successfully deployed.\n\"Continued analysis has uncovered evidence suggesting involvement from the Russian ransomware group 'BianLian' and the operators of the 'RansomEXX' ransomware family (tracked by Microsoft as 'Storm-2460'),\" the cybersecurity firm said. \"These findings reveal widespread interest in exploiting this vulnerability across multiple threat groups.\"\nReliaQuest linked BianLian to at least one incident with \"moderate confidence\" based on an IP address used by the ransomware gang's operators in the past to host one of their command-and-control (C2) servers.\nIn the RansomEXX attacks, the threat actors deployed the gang's PipeMagic modular backdoor and exploited the CVE-2025-29824 Windows CLFS vulnerability\nabused in previous incidents\nlinked to this ransomware operation.\n\"The malware was deployed just hours after global exploitation involving the helper.jsp and cache.jsp webshells. Although the initial attempt failed, a subsequent attack involved the deployment of the Brute Ratel C2 framework using inline MSBuild task execution,\" ReliaQuest added.\nAlso exploited by Chinese hacking groups\nForescout Vedere Labs security researchers have also\nlinked these ongoing attacks\nto a Chinese threat actor they track as Chaya_004, while EclecticIQ\nreported on Tuesday\nthat three other Chinese APTs (i.e., UNC5221, UNC5174, and CL-STA-0048) are also targeting NetWeaver instances unpatched against CVE-2025-31324.\nBased on exposed files found in an openly accessible directory on one of these attackers' unsecured servers, Forescout says they've backdoored at least 581 SAP NetWeaver instances (including critical infrastructure in the United Kingdom, the United States, and Saudi Arabia) and are planning to target another 1,800 domains.\n\"Persistence backdoor access to these systems provides a foothold for China-aligned APTs, potentially enabling strategic objectives of the People’s Republic of China (PRC), including military, intelligence, or economic advantage,\" Forescout said.\n\"The compromised SAP systems are also highly connected to internal network of the industrial control system (ICS) which is poses lateral movement risks, that potentially cause service disruption to long-term espionage.\"\nOn Monday, SAP has also patched a second NetWeaver vulnerability (\nCVE-2025-42999\n) chained in these attacks as a zero-day as early as March to execute arbitrary commands remotely.\nTo block breach attempts, SAP admins should immediately patch their NetWeaver servers or consider disabling the Visual Composer service if an upgrade isn't possible. Restricting access to metadata uploader services and monitoring for suspicious activity on their servers are also highly advisable.\nCISA\nadded\nthe CVE-2025-31324 flaw to its\nKnown Exploited Vulnerabilities Catalog\ntwo weeks ago, mandating federal agencies to secure their servers by May 20, as required by\nBinding Operational Directive (BOD) 22-01\n.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nSAP patches second zero-day flaw exploited in recent attacks\nChinese hackers behind attacks targeting SAP NetWeaver servers\nOver 1,200 SAP NetWeaver servers vulnerable to actively exploited flaw\nSAP fixes suspected NetWeaver zero-day exploited in attacks\nMicrosoft: Windows CLFS zero-day exploited by ransomware gang"
    },
    {
        "Title": "Australian Human Rights Commission leaks docs to search engines",
        "Link": "https://www.bleepingcomputer.com/news/security/australian-human-rights-commission-leaks-docs-to-search-engines/",
        "Summary": "The Australian Human Rights Commission (AHRC) disclosed a data breach incident where private documents leaked online and were indexed by major search engines. [...]",
        "Date": "2025-05-14",
        "Content": "The Australian Human Rights Commission (AHRC) disclosed a data breach incident where private documents leaked online and were indexed by major search engines.\nMany of the hundreds of documents exposed online contained private, sensitive information, like names, contact information, health details, schooling, religion, employment info, and photographs.\nAHRC is an independent statutory body established by the Australian Government, with the primary role of promoting and protecting human rights in the country.\nIt receives and investigates discrimination complaints, monitors compliance with international human rights obligations, conducts inquiries and research, and oversees related projects and initiatives.\nAlthough the organization does not have court powers, it receives complaints from the public and tries to resolve them through conciliation, while it refers unresolved cases to federal courts.\nAccording to\nan announcement\npublished on the AHRC website, the breach impacts submissions between the following dates:\ncomplaint webform between March 24, 2025, and April 10, 2025\n‘Speaking from Experience’ project between March 2024 and September 2024\nsubmissions to the National Anti-Racism Framework concept paper between October 2021 and February 2022\nA total of 670 documents have been exposed online and accessed between April 3 and May 5, 2025.\nWhile some documents already public personal information, others expose sensitive data that may be damaging for the individuals submitting it in the context of the topics AHRC deals with.\nThe organization\nsaid\nthe incident was not a result of malicious external attack, but more details will become available in a future update.\nMeanwhile, AHRC has requested the immediate removal of the indexed files from search engines and disabled all web forms to prevent a subsequent exposure due to underlying misconfigurations.\nA dedicated taskforce and investigation are underway, while the Office of the Australian Information Commissioner (OAIC) has also been notified.\nThose who are determined to have been impacted by this incident will be notified personally, and a helpline has been set up to offer support.\nApart from the standard “watch out for scams or suspicious activity” advice, AHRC also lists links to mental health support platforms, indicative of the distress that such a data exposure may cause to affected individuals.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nWestern Sydney University discloses security breaches, data leak\nInterlock ransomware claims DaVita attack, leaks stolen data\nTexas State Bar warns of data breach after INC ransomware claims attack\nAustralian pension funds hit by wave of credential stuffing attacks\nOracle privately confirms Cloud breach to customers"
    },
    {
        "Title": "Microsoft fixes Linux boot issues on dual-boot Windows systems",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-linux-boot-issues-on-dual-boot-windows-systems/",
        "Summary": "​Microsoft has fixed a known issue preventing Linux from booting on dual-boot systems with Secure Boot enabled after installing the August 2024 Windows security updates. [...]",
        "Date": "2025-05-14",
        "Content": "Microsoft has fixed a known issue preventing Linux from booting on dual-boot systems with Secure Boot enabled after installing the August 2024 Windows security updates.\nThe list of affected systems includes those running client (Windows 10 and Windows 11) and server (Windows Server 2012 and later) OS versions.\nThis issue is triggered by a Secure Boot Advanced Targeting (SBAT) update that blocks\nUEFI shim bootloaders\nvulnerable to exploits targeting the\nCVE-2022-2601\nGRUB2 Secure Boot bypass.\nWhile Microsoft said in the CVE-2022-2601 advisory that this SBAT update would not be delivered to devices where dual booting is detected, it also acknowledged that the dual-boot detection failed to detect some customized methods of dual-booting and applied the update anyway.\nAs revealed by\nmany\nLinux\nusers\n(running a wide range of distros, including but not limited to Ubuntu, Zorin OS, Linux Mint, and Puppy Linux),\ntheir\nsystems\nstopped\nbooting\nafter installing the August 2024 Windows updates, and the SBAT update was incorrectly applied.\nMicrosoft\nconfirmed the known issue\nfollowing widespread reports, saying that affected users saw \"Something has gone seriously wrong: SBAT self-check failed: Security Policy Violation\" errors on systems rendered unbootable.\nLinux boot broken after Windows security update (\nOk_Work_5257\n)\nFixed after nine months\nThis week, nine months after confirming the issue, Microsoft announced that the May 2025 Patch Tuesday security updates should fix the boot problems for all affected users.\n\"This issue was resolved by Windows updates released May 13, 2025 [..], and later,\"\nRedmond noted\nin a Windows release health update. \"We recommend you install the latest update for your device as it contains important improvements and issue resolutions, including this one.\"\nThe fix comes after the company\nshared a temporary workaround\nin late August, weeks after the first user reports surfaced, to help revive impacted dual-boot systems, requiring them to delete the SBAT update and ensuring that future SBAT updates would no longer be installed.\nOn September 19, it also\nstopped applying the problematic SBAT update\nto the firmware automatically, advising those who want to prevent future SBAT updates in Windows to run the following command:\nreg add HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\SecureBoot\\SBAT /v OptOut /d 1 /t REG_DWORD\n\"This known issue only occurs with the installation of the August 2024 security and preview updates. The September 2024 security update and later updates do not contain the settings that caused this issue,\" Microsoft added.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nWindows 10 KB5058379 update fixes SgrmBroker errors in Event Viewer\nMicrosoft May 2025 Patch Tuesday fixes 5 exploited zero-days, 72 flaws\nMicrosoft will update Office apps on Windows 10 until 2028\nWindows 11 upgrade block lifted after Safe Exam Browser fix\nWindows 11 24H2 blocked on PCs with code-obfuscation driver BSODs"
    },
    {
        "Title": "Steel giant Nucor Corporation facing disruptions after cyberattack",
        "Link": "https://www.bleepingcomputer.com/news/security/steel-giant-nucor-corporation-facing-disruptions-after-cyberattack/",
        "Summary": "A cybersecurity incident on Nucor Corporation's systems forced the company to take offline parts of its networks and implement containment measures. [...]",
        "Date": "2025-05-14",
        "Content": "A cybersecurity incident on Nucor Corporation's systems, the largest steel producer in the U.S., forced the company to take offline parts of its networks and implement containment measures.\nThe incident caused the company to temporarily suspend production at multiple locations, although the full impact on Nucor’s business remains unclear.\nNucor is a major steel producer in the U.S. and scrap recycler in the North America. It is a primary supplier of reinforcing bar that is used extensively in the country’s buildings, bridges, roads, and infrastructure.\nThe company employs more than 32,000 people across numerous mills across the U.S., Mexico, and Canada, and reported a\n$7.83 billion\nrevenue in the first quarter of the year.\nThe cybersecurity incident was disclosed via an 8-K filing the firm submitted earlier today to the U.S. Securities and Exchange Commission (SEC).\n“Nucor Corporation recently identified a cybersecurity incident involving unauthorized third party access to certain information technology systems used by the Company,”\nreads the SEC filing\n.\n“Upon detecting the incident, the Company began promptly taking steps to contain and respond to the incident, including activating its incident response plan, proactively taking potentially affected systems offline and implementing other containment, remediation, or recovery measures.”\nNucor also stated that it has notified law enforcement authorities and engaged with external cybersecurity experts to assist with the investigation.\nMeanwhile, certain production operations at various locations were halted, though Nucor notes it is in the process of gradually restarting them.\nNo details about the date or type of the attack were provided, so it’s unknown if the incident involved data theft or encryption.\nAt the time of writing, no ransomware groups have assumed responsibility for the attack at Nucor, so the perpetrators are unknown.\nBleepingComputer has contacted the company to ask more information about the incident, but we are still waiting for a response.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMedical device maker Masimo warns of cyberattack, manufacturing delays\nWestern Sydney University discloses security breaches, data leak\nHackers behind UK retail attacks now targeting US companies\nEducation giant Pearson hit by cyberattack exposing customer data\nVC giant Insight Partners confirms investor data stolen in breach"
    },
    {
        "Title": "Focused Phishing: Attack Targets Victims With Trusted Sites and Live Validation",
        "Link": "https://www.bleepingcomputer.com/news/security/focused-phishing-attack-targets-victims-with-trusted-sites-and-live-validation/",
        "Summary": "New phishing tactics are abusing trusted domains, real CAPTCHAs, and server-side email validation to selectively target victims with customized fake login pages. Keep Aware's latest research breaks down the full attack chain and how these zero-day phish operate. [...]",
        "Date": "2025-05-14",
        "Content": "The Keep Aware threat research team recently observed a phishing incident that involved leveraging legitimate infrastructure, precision email validation, and evasive delivery techniques.\nThis attack illustrates the abuse of trusted domains, the practice of server-side phishing email validation, and the critical need for browser-based, zero-day phishing protection.\nWhat Happened?\nIn a live environment, the\nKeep Aware’s browser security solution\nwas configured in silent mode to capture all user behavior and threat indicators without interrupting the session.\nThis gave the security team full visibility into every stage of the phishing attempt as it unfolded, enabling a clear assessment of attack vectors, user actions, and detection fidelity.\nIdentifying Credential Theft\nDuring a review of managed detections, the research team observed authentication-related phishing signals triggering in silent mode. This indicated that an employee had entered credentials on a suspicious webpage.\nBecause the browser was configured for visibility-only operation, the security team was able to observe the full detailed sequence of the attempted credential theft seeing these unique attacker tactics.\nUsing the investigation generated by Keep Aware’s browser security extension, the team was able to evaluate the chained phishing attack quickly, confirm the credential input, and immediately follow remediation steps, including resetting the user’s password and reviewing any anomalous account or login activity.\nScreenshot of the chain of redirects in the Keep Aware platform before a threat flagged the suspicious credential input attempt.\nBy enabling Keep Aware default protections, this type of interaction is blocked entirely. And while the phishing email itself wasn’t directly observed, the telemetry revealed a key insight: there was no browser activity immediately preceding the visit to the phishing pages.\nThis indicates the user clicked on a link from outside the browser environment, likely from an email application, such as Outlook.\nThis is a common encounter: even when phishing begins in the inbox or a messaging platform, the attack itself almost always plays out in the browser. Today, the browser is where trust is easily abused, evasive scripts are readily executed, and credentials are ultimately harvested.\nIn this case, the employee had clicked on a link to a legitimate website hosting a malicious page.\nBrowser Phishing Protection With Keep Aware\nKeep Aware stops phishing attacks in real-time where they start: inside the browser. By analyzing user behavior, form submissions, and site context, not just URLs,\nKeep Aware shuts down threats before credentials ever leave the page. Equip your security team with precise visibility, policy enforcement, and immediate threat response all from within the existing web browsers across the organization.\nRequest a Demo\nCampaign/Attack Overview\n1) Hosting on a Legitimate Domain\nThe targeted employee visited a legitimate, 9-year-old domain with a clean reputation and a strong internet presence for selling tents. However, this “trusted\" domain had been compromised to host a malicious form page on the file path /memo/home.html.\nUpon visiting the link, the user was presented with a message claiming a “Confidential Document” had been shared with them, urging them to input their email in order to download the payment PDF.\nThese are social engineering prompts we see frequently—phrases designed to get the user to click links and provide credentials in order to gain access to a supposed business document.\nScreenshot of a malicious page hosted on a legitimate domain used for email validation\nBasic Evasion: Anti-Analysis JavaScript\nThis malicious page included basic anti-analysis protections. It disables right-click context menus and blocks common keyboard shortcuts that security analysts or curious internet users might use to inspect or save the page.\nSnippet of JavaScript from the malicious page with basic anti-analysis measures\nThese simple techniques are widely used to obstruct analysis efforts from viewing the page’s code or background behaviors.\nForm Handling Code\nIn addition to anti-analysis mechanisms, this phishing infrastructure includes logic to dynamically handle email input depending on how the victim arrives at the page.\nPre-Populates with the Victim’s Email\nIf the phishing link contains the victim’s email address in the anchor portion of the URL (after the “#” sign), then the JavaScript code will automatically extract and insert that email into the form. This reduces a step for the victim, removes friction from the process, and can increase believability and the success rate.\nSnippet of JavaScript that will extract the target’s email address from the URL’s anchor portion, if present.\nThis pre-population technique implies the phishing emails include target-specific links, such as: compromised.domain.com/file/path?#victim_email@example.com\nSimilar techniques have been seen before, like in a\nrecent write-up\n, where a malicious SVG attached in a phishing email used JavaScript to append the victim’s email to a malicious URL and redirect the browser.\nTarget-specific links that pre-populate fake login forms serve two purposes:\nTo track which users click on phishing links;\nTo streamline the phishing process.\nEmail Submission Logic\nIf an email address is not present in the URL’s anchor, then the form waits for the victim to manually input their email and submit.\nUpon form submission, two things happen:\nRedirection to malicious site:\nThe page redirects the user’s tab to another URL, a malicious .workers.dev subdomain with the email in the query parameter (?ref=<email>).\nSnippet of JavaScript showing that sends the victim's email to a .workers.dev subdomain\nEmail submitted to API endpoint:\nSimultaneously, the user’s email and timestamp were sent to an API endpoint.\nSnippet of JavaScript that sends a POST request with victim information to an API endpoint\nThis submission mechanism signals a more advanced phishing infrastructure, one capable of validating victims in real-time and tailoring what they saw next.\n2) “One more step before you proceed”: CAPTCHA Use\nAfter submitting an email and before proceeding to the final phishing page, the user was directed to another malicious site and challenged with a Cloudflare CAPTCHA.\nScreenshot of the CAPTCHA on the malicious site\nThis tactic isn’t unusual. Real CAPTCHAs (not just fake ones) are heavily used by phishing actors to:\nPrevent bots and automated scanners from analyzing the final phishing page\nAvoid detection by traditional URL scanning engines\nLend credibility to the process\nCAPTCHAs can help attackers evade tools and keep the deception going for longer.\n3) Customized Phishing Page, Validated by Email\nAfter passing the CAPTCHA, the phishing page sometimes transitioned into a fake Microsoft login form. But not always.\nWhat triggers the phishing payload depends on what email a user entered.\nPersonal email (e.g., @gmail.com):\nThe page returns a blank screen.\nPhishing site loads as a blank page when a personal email has been provided.\nCorporate email (valid business email, but likely not on the attacker’s list):\nThe page returns a basic Microsoft login page, with no customization.\nPhishing site that loads as a basic Microsoft login page when a non-personal email address has been provided.\nTargeted email address (valid business email and on the attacker’s list):\nThe phishing page revealed a fake Microsoft login page customized with the victim’s company logo, a branded background, and a reference to the organization’s helpdesk initials.\nPhishing site that loads as a customized Microsoft login page when an email address on the attacker’s list has been provided.\nThis behavior suggests that the attacker’s backend performs server-side email validation. Based on whether the email is included in a targeted list or is deemed a personal email, the phishing infrastructure selectively delivers a payload.\nPrecision-Validated Phishing, Server-Side\nThis technique, in which an attacker validates an email address in real-time to ensure only the intended targets or targets of higher value receive the final phishing page, is referred to as “Precision-Validated Phishing”.\nThe email validation technique is executed through either client-side code or API calls. In this case, the email validation appears to happen server-side, not client-side via JavaScript.\nThe provided email is sent to a backend API, which determines what happens next, making the phishing logic even harder to detect through static or client-side inspection alone.\nBeating Precision Phishing with Real-Time, Zero-Day Detection\nDespite the sophistication and server-side logic, the endgame remains simple: to steal credentials. Regardless of how the email validation occurs, the target user will always end up on a malicious page designed to steal credentials.\nIf your security stack can block phishing pages, whether zero day or not, precision validated or not, and before a user enters their password, the attacker walks away empty handed.\nTo defend against this type of advanced, targeted phishing:\nEnsure your security stack can detect and block phishing pages even on trusted domains\nInvest in tools that recognize the impersonation of legitimate business platforms your organization uses (e.g., Microsoft 365, Okta, Google Workspace)\nEnsure your employees have real-time, browser-level protection, not just email filtering\nKeeping Up With Ever-Evolving Attacks\nPhishing continues to evolve—leveraging legitimate infrastructure, precision email validation, and evasive delivery techniques. But while techniques seem to grow more sophisticated, the solution remains clear: real-time, in-browser protection is critical.\nPreventing users from ever interacting with deceptive login pages is the surest way to stop phishing in its tracks, regardless of any fancy validation logic.\nTo learn more about how Keep Aware can help prevent phishing attacks in the browser,\nrequest a personalized demo\nwith a team member.\nSponsored and written by\nKeep Aware\n."
    },
    {
        "Title": "Fashion giant Dior discloses cyberattack, warns of data breach",
        "Link": "https://www.bleepingcomputer.com/news/security/fashion-giant-dior-discloses-cyberattack-warns-of-data-breach/",
        "Summary": "House of Dior, the French luxury fashion brand commonly referred to as Dior, has disclosed a cybersecurity incident that has exposed customer information. [...]",
        "Date": "2025-05-14",
        "Content": "House of Dior, the French luxury fashion brand commonly referred to as Dior, has disclosed a cybersecurity incident that has exposed customer information.\nA spokesperson for the firm told BleepingComputer that the incident impacts Dior Fashion and Accessories customers. Currently, cybersecurity experts are investigating the incident to determine its scope.\n“The House of Dior recently discovered that an unauthorized external party accessed some of the data we hold for our Dior Fashion and Accessories customers,” stated the spokesperson.\n“We immediately took steps to contain this incident. The teams at Dior, supported by leading cybersecurity experts, continue to investigate and respond to the incident.”\nDior clarified to BleepingComputer that the incident did not expose account passwords or payment card information, as these were stored in a different database that remained unaffected.\n“No passwords or payment information, including bank account or payment card information, were in the database affected in the incident.”\n“We are working to notify relevant regulators and customers in line with applicable law.”\n“The confidentiality and security of our customers’ data is an absolute priority for the House of Dior. We sincerely regret any concern or inconvenience this matter may cause our customers.”\nKorea and China confirmed impacted\nAlthough Dior did not specify the number of customers and the regions impacted, there is a notification confirming its South Korean website being affected. There also some reports about Chinese customers receiving data breach notifications from the fashion house.\nAccording to screenshots of the notices\nshared online\n, the incident was discovered on May 7, involving unauthorized personnel access, and exposed the following information:\nFull name\nGender\nPhone number\nEmail address\nPostal address\nPurchase history\nNotice sent to China customers\nSource: marketing-interactive.com\nThe notice posted on Dior’s Korean shop also sets the breach date to May 7, 2025, suggesting a common cybersecurity incident that had an international impact.\nHowever, in that case, only contact information, purchase data, and preferences customers shared with the brand are flagged as potentially exposed.\nNotice published on Dior Korea site\nSource: dior.com/ko_kr/fashion\nMeanwhile, Korean media report that Dior\nfaces legal scrutiny\nfor failing to notify all the applicable authorities in the country about the data breach.\nDior recommends that customers remain vigilant for phishing attempts that request their personal information, and contact them immediately to report cases of brand impersonation.\nAt the moment, details about the number of customers and the countries affected have not been disclosed publicly.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nVeriSource now says February data breach impacts 4 million people\nSK Telecom warns customer USIM data exposed in malware attack\nM&S says customer data stolen in cyberattack, forces password resets\nVC giant Insight Partners confirms investor data stolen in breach\nSK Telecom cyberattack: Free SIM replacements for 25 million customers"
    },
    {
        "Title": "Kosovo extradites BlackDB admin to face US cybercrime charges",
        "Link": "https://www.bleepingcomputer.com/news/security/kosovo-extradites-blackdb-admin-to-face-us-cybercrime-charges/",
        "Summary": "A Kosovo national has been extradited to the United States to face charges of running an online cybercrime marketplace active since 2018. [...]",
        "Date": "2025-05-14",
        "Content": "A Kosovo national has been extradited to the United States to face charges of running an online cybercrime marketplace active since 2018.\nKosovar authorities arrested the 33-year-old Liridon Masurica (also known as @blackdb) on December 14th, 2024, and he was extradited to the United States earlier this month, on May 9th.\nMasurica was detained following his court appearance in Tampa on May 12th, where he was brought before United States Magistrate Judge Lindsay Saxe Griffin.\nDuring this hearing, he was charged with five counts of fraudulent use of unauthorized access devices and one count of conspiracy to commit access device fraud.\nAccording to court documents, Masurica was the lead administrator of the online criminal marketplace BlackDB.cc, which has been active for the past seven years, starting in 2018.\nThe Justice Department\nsaid\nthe marketplace illegally offered for sale compromised accounts and server credentials, stolen credit card information, and personally identifiable information (PII) of individuals, most from the United States.\nCybercriminals who purchased these items on the BlackDB marketplace used them in various illegal activities, including credit card fraud, tax fraud, and identity theft.\nThe FBI conducted this investigation in partnership with the Kosovo Police's Cybercrime Investigation Directorate, with support from the FBI's Legal Attaché Office in Sofia and the Department of Justice's Office of International Affairs, which assisted in Masurica's arrest and extradition.\nIf convicted on all charges, the BlackDB marketplace admin could face a maximum sentence of 55 years in federal prison.\nIn December, a joint law enforcement operation also\nled to the seizure of the Rydox cybercrime marketplace\nand the arrest of three Rydox administrators, Kosovo nationals Ardit Kutleshi, Jetmir Kutleshi, and Shpend Sokoli.\nDays earlier, German authorities also arrested key suspects after shutting down\nthe Manson market\nand\nCrimenetwork\n, the country's largest online cybercrime marketplace.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nFBI: US lost record $16.6 billion to cybercrime in 2024\nCISA warns of hackers targeting critical oil infrastructure\nUnofficial Signal app used by Trump officials investigates hack\nFBI seeks help to unmask Salt Typhoon hackers behind telecom breaches\nMITRE warns that funding for critical CVE program expires today"
    },
    {
        "Title": "Infosec Layoffs Aren't the Bargain That Boards May Think",
        "Link": "https://www.darkreading.com/cyber-risk/infosec-layoffs-arent-bargain-boards-may-think",
        "Summary": "Salary savings come with hidden costs, including insider threats and depleted cybersecurity defenses, conveying advantages to skilled adversaries, experts argue.",
        "Date": "2025-05-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/infosec-layoffs-arent-bargain-boards-may-think"
    },
    {
        "Title": "AI Agents May Have a Memory Problem",
        "Link": "https://www.darkreading.com/cyber-risk/ai-agents-memory-problem",
        "Summary": "A new study by researchers at Princeton University and Sentient shows it's surprisingly easy to trigger malicious behavior from AI agents by implanting fake &quot;memories&quot; into the data they rely on for making decisions.",
        "Date": "2025-05-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/ai-agents-memory-problem"
    },
    {
        "Title": "Ivanti EPMM Zero-Day Flaws Exploited in Chained Attack",
        "Link": "https://www.darkreading.com/endpoint-security/ivanti-epmm-zero-day-flaws-exploited",
        "Summary": "The security software maker said the vulnerabilities in Endpoint Manager Mobile have been exploited in the wild against &quot;a very limited number of customers&quot; — for now — and stem from open source libraries.",
        "Date": "2025-05-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/ivanti-epmm-zero-day-flaws-exploited"
    },
    {
        "Title": "Marks &amp; Spencer Confirms Customer Data Stolen in Cyberattack",
        "Link": "https://www.darkreading.com/threat-intelligence/marks-spencer-confirms-customer-data-stolen",
        "Summary": "The British retailer said no account passwords were compromised in last month's cyberattack, but the company will require customers to reset passwords &quot;for extra peace of mind.&quot;",
        "Date": "2025-05-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/marks-spencer-confirms-customer-data-stolen"
    },
    {
        "Title": "Congress Should Tackle Cyber Threats, Not Competition",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/congress-cyber-threats-competition",
        "Summary": "Some members of Congress seem more intent on grabbing headlines than actually working to make America more cyber secure.",
        "Date": "2025-05-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/congress-cyber-threats-competition"
    },
    {
        "Title": "Orca Security Gets AI-Powered Remediation From Opus Deal",
        "Link": "https://www.darkreading.com/cloud-security/orca-security-ai-powered-remediation-opus",
        "Summary": "The acquisition will enhance Orca's CNAPP offering with autonomous vulnerability remediation and prevention technologies from Opus.",
        "Date": "2025-05-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/orca-security-ai-powered-remediation-opus"
    },
    {
        "Title": "Hacktivists Make Little Impact During India-Pakistan Conflict",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/hacktivists-little-impact-during-india-pakistan-conflict",
        "Summary": "While hacktivists claimed more than 100 successful attacks against Indian government, education, and military targets, the attacks were overblown in most cases and often did not even happen.",
        "Date": "2025-05-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/hacktivists-little-impact-during-india-pakistan-conflict"
    },
    {
        "Title": "Patch Tuesday, May 2025 Edition",
        "Link": "https://krebsonsecurity.com/2025/05/patch-tuesday-may-2025-edition/",
        "Summary": "Microsoft on Tuesday released software updates to fix at least 70 vulnerabilities in Windows and related products, including five zero-day flaws that are already seeing active exploitation. Adding to the sense of urgency with this month's patch batch from Redmond are fixes for two other weaknesses that now have public proof-of-concept exploits available.",
        "Date": "2025-05-14",
        "Content": "Microsoft on Tuesday released software updates to fix at least 70 vulnerabilities in Windows and related products, including five zero-day flaws that are already seeing active exploitation. Adding to the sense of urgency with this month’s patch batch from Redmond are fixes for two other weaknesses that now have public proof-of-concept exploits available.\n\nMicrosoft and several security firms have disclosed that attackers are exploiting a pair of bugs in the Windows Common Log File System (CLFS) driver that allow attackers to elevate their privileges on a vulnerable device. The Windows CLFS is a critical Windows component responsible for logging services, and is widely used by Windows system services and third-party applications for logging. Tracked as CVE-2025-32701 & CVE-2025-32706, these flaws are present in all supported versions of Windows 10 and 11, as well as their server versions.\nKev Breen, senior director of threat research at Immersive Labs, said privilege escalation bugs assume an attacker already has initial access to a compromised host, typically through a phishing attack or by using stolen credentials. But if that access already exists, Breen said, attackers can gain access to the much more powerful Windows SYSTEM account, which can disable security tooling or even gain domain administration level permissions using credential harvesting tools.\n“The patch notes don’t provide technical details on how this is being exploited, and no Indicators of Compromise (IOCs) are shared, meaning the only mitigation security teams have is to apply these patches immediately,” he said. “The average time from public disclosure to exploitation at scale is less than five days, with threat actors, ransomware groups, and affiliates quick to leverage these vulnerabilities.”\nTwo other zero-days patched by Microsoft today also were elevation of privilege flaws: CVE-2025-32709, which concerns afd.sys, the Windows Ancillary Function Driver that enables Windows applications to connect to the Internet; and CVE-2025-30400, a weakness in the Desktop Window Manager (DWM) library for Windows. As Adam Barnett at Rapid7 notes, tomorrow marks the one-year anniversary of CVE-2024-30051, a previous zero-day elevation of privilege vulnerability in this same DWM component.\nThe fifth zero-day patched today is CVE-2025-30397, a flaw in the Microsoft Scripting Engine, a key component used by Internet Explorer and Internet Explorer mode in Microsoft Edge.\nChris Goettl at Ivanti points out that the Windows 11 and Server 2025 updates include some new AI features that carry a lot of baggage and weigh in at around 4 gigabytes. Said baggage includes new artificial intelligence (AI) capabilities, including the controversial Recall feature, which constantly takes screenshots of what users are doing on Windows CoPilot-enabled computers.\nMicrosoft went back to the drawing board on Recall after a fountain of negative feedback from security experts, who warned it would present an attractive target and a potential gold mine for attackers. Microsoft appears to have made some efforts to prevent Recall from scooping up sensitive financial information, but privacy and security concerns still linger. Former Microsoftie Kevin Beaumont has a good teardown on Microsoft’s updates to Recall.\nIn any case, windowslatest.com reports that Windows 11 version 24H2 shows up ready for downloads, even if you don’t want it.\n“It will now show up for ‘download and install’ automatically if you go to Settings > Windows Update and click Check for updates, but only when your device does not have a compatibility hold,” the publication reported. “Even if you don’t check for updates, Windows 11 24H2 will automatically download at some point.”\nApple users likely have their own patching to do. On May 12 Apple released security updates to fix at least 30 vulnerabilities in iOS and iPadOS (the updated version is 18.5). TechCrunch writes that iOS 18.5 also expands emergency satellite capabilities to iPhone 13 owners for the first time (previously it was only available on iPhone 14 or later).\nApple also released updates for macOS Sequoia, macOS Sonoma, macOS Ventura, WatchOS, tvOS and visionOS. Apple said there is no indication of active exploitation for any of the vulnerabilities fixed this month.\nAs always, please back up your device and/or important data before attempting any updates. And please feel free to sound off in the comments if you run into any problems applying any of these fixes.\n\r\n         This entry was posted on Wednesday 14th of May 2025 07:57 AM \r\n         \nMS has made it clear, privacy is a huge no no.\nSince other than games I only use the browser on my PC, I downloaded Ubuntu last night and started the change.\nIt may take getting used to, but the abusive relationship with MS is ending for me.\nSo who asked MS for the recall program? CIA, NSA, Mossad??\nSurely not users\nI contend it is just a spy tool and servers no legitimate purpose\nOne issue with Windows 11 version 24H2 is that it deletes WordPad. However, there is a method to restore it.\nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "Google Ships Android ‘Advanced Protection’ Mode to Thwart Surveillance Spyware",
        "Link": "https://www.securityweek.com/google-ships-android-advanced-protection-mode-to-thwart-surveillance-spyware/",
        "Summary": "<p>Google bundles multiple safeguards under a single Android toggle to protect high-risk users from advanced mobile malware implants.</p>\n<p>The post <a href=\"https://www.securityweek.com/google-ships-android-advanced-protection-mode-to-thwart-surveillance-spyware/\">Google Ships Android ‘Advanced Protection’ Mode to Thwart Surveillance Spyware</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/google-ships-android-advanced-protection-mode-to-thwart-surveillance-spyware/"
    },
    {
        "Title": "Is AI Use in the Workplace Out of Control?",
        "Link": "https://www.securityweek.com/is-ai-use-in-the-workplace-out-of-control/",
        "Summary": "<p>Trying to block AI tools outright is a losing strategy. SaaS and AI are increasingly inseparable, and AI isn’t limited to tools like ChatGPT or Copilot anymore.</p>\n<p>The post <a href=\"https://www.securityweek.com/is-ai-use-in-the-workplace-out-of-control/\">Is AI Use in the Workplace Out of Control?</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/is-ai-use-in-the-workplace-out-of-control/"
    },
    {
        "Title": "Chipmaker Patch Tuesday: Intel, AMD, Arm Respond to New CPU Attacks",
        "Link": "https://www.securityweek.com/chipmaker-patch-tuesday-intel-amd-arm-respond-to-new-cpu-attacks/",
        "Summary": "<p>Intel, AMD and Arm each published security advisories on Patch Tuesday, including for newly disclosed CPU attacks.</p>\n<p>The post <a href=\"https://www.securityweek.com/chipmaker-patch-tuesday-intel-amd-arm-respond-to-new-cpu-attacks/\">Chipmaker Patch Tuesday: Intel, AMD, Arm Respond to New CPU Attacks</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/chipmaker-patch-tuesday-intel-amd-arm-respond-to-new-cpu-attacks/"
    },
    {
        "Title": "Kosovar Administrator of Cybercrime Marketplace Extradited to US",
        "Link": "https://www.securityweek.com/kosovar-administrator-of-cybercrime-marketplace-extradited-to-us/",
        "Summary": "<p>Kosovo citizen Liridon Masurica has appeared in a US court, facing charges for his role in operating the cybercrime marketplace BlackDB.cc.</p>\n<p>The post <a href=\"https://www.securityweek.com/kosovar-administrator-of-cybercrime-marketplace-extradited-to-us/\">Kosovar Administrator of Cybercrime Marketplace Extradited to US</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/kosovar-administrator-of-cybercrime-marketplace-extradited-to-us/"
    },
    {
        "Title": "EU Cybersecurity Agency ENISA Launches European Vulnerability Database",
        "Link": "https://www.securityweek.com/eu-cybersecurity-agency-enisa-launches-european-vulnerability-database/",
        "Summary": "<p>Experts say the European Vulnerability Database, or EUVD, should be a good resource, but only if ENISA manages to maintain it properly.</p>\n<p>The post <a href=\"https://www.securityweek.com/eu-cybersecurity-agency-enisa-launches-european-vulnerability-database/\">EU Cybersecurity Agency ENISA Launches European Vulnerability Database</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/eu-cybersecurity-agency-enisa-launches-european-vulnerability-database/"
    },
    {
        "Title": "Vulnerabilities Patched by Juniper, VMware and Zoom",
        "Link": "https://www.securityweek.com/vulnerabilities-patched-by-juniper-vmware-and-zoom/",
        "Summary": "<p>Juniper Networks, VMware, and Zoom have announced patches for dozens of vulnerabilities across their products.</p>\n<p>The post <a href=\"https://www.securityweek.com/vulnerabilities-patched-by-juniper-vmware-and-zoom/\">Vulnerabilities Patched by Juniper, VMware and Zoom </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/vulnerabilities-patched-by-juniper-vmware-and-zoom/"
    },
    {
        "Title": "Fortinet Patches Zero-Day Exploited Against FortiVoice Appliances",
        "Link": "https://www.securityweek.com/fortinet-patches-zero-day-exploited-against-fortivoice-appliances/",
        "Summary": "<p>Fortinet has patched a dozen vulnerabilities, including a critical flaw exploited in the wild against FortiVoice instances.</p>\n<p>The post <a href=\"https://www.securityweek.com/fortinet-patches-zero-day-exploited-against-fortivoice-appliances/\">Fortinet Patches Zero-Day Exploited Against FortiVoice Appliances</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/fortinet-patches-zero-day-exploited-against-fortivoice-appliances/"
    },
    {
        "Title": "Ivanti Patches Two EPMM Zero-Days Exploited to Hack Customers",
        "Link": "https://www.securityweek.com/ivanti-patches-two-epmm-zero-days-exploited-to-hack-customers/",
        "Summary": "<p>Ivanti has released patches for two EPMM vulnerabilities that have been chained in the wild for remote code execution.</p>\n<p>The post <a href=\"https://www.securityweek.com/ivanti-patches-two-epmm-zero-days-exploited-to-hack-customers/\">Ivanti Patches Two EPMM Zero-Days Exploited to Hack Customers</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/ivanti-patches-two-epmm-zero-days-exploited-to-hack-customers/"
    },
    {
        "Title": "ICS Patch Tuesday: Vulnerabilities Addressed by Siemens, Schneider, Phoenix Contact",
        "Link": "https://www.securityweek.com/ics-patch-tuesday-vulnerabilities-addressed-by-siemens-schneider-phoenix-contact/",
        "Summary": "<p>Industrial giants Siemens, Schneider Electric and Phoenix Contact have released ICS security advisories on the May 2025 Patch Tuesday.</p>\n<p>The post <a href=\"https://www.securityweek.com/ics-patch-tuesday-vulnerabilities-addressed-by-siemens-schneider-phoenix-contact/\">ICS Patch Tuesday: Vulnerabilities Addressed by Siemens, Schneider, Phoenix Contact </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-14",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/ics-patch-tuesday-vulnerabilities-addressed-by-siemens-schneider-phoenix-contact/"
    },
    {
        "Title": "China Census Database Allegedly Leaked with 92 Million Records",
        "Link": "https://dailydarkweb.net/china-census-database-allegedly-leaked-with-92-million-records/",
        "Summary": "<p>&#160; A substantial database, purportedly linked to China&#8217;s official census website (stats.gov.cn), is reportedly being circulated. The data breach is alleged to have occurred in February 2025, with claims of the database containing a staggering 92 million records. The information contained within the database is said to be highly sensitive personal data, including: Mobile phone [&#8230;]</p>\n<p>The post <a href=\"https://dailydarkweb.net/china-census-database-allegedly-leaked-with-92-million-records/\">China Census Database Allegedly Leaked with 92 Million Records</a> appeared first on <a href=\"https://dailydarkweb.net\">Daily Dark Web</a>.</p>",
        "Date": "2025-05-14",
        "Content": "A substantial database, purportedly linked to China’s official census website (stats.gov.cn), is reportedly being circulated. The data breach is alleged to have occurred in February 2025, with claims of the database containing a staggering 92 million records.\nThe information contained within the database is said to be highly sensitive personal data, including:\nMobile phone number\nName\nID number\nAddress\nMobile phone number location\nGender\nBirthday\nSamples of the data circulating appear to corroborate the inclusion of these personal identifiers.\nWhile the authenticity and source of the data are yet to be definitively confirmed, a leak of this magnitude involving such detailed personal information raises significant concerns regarding privacy and potential misuse for the individuals affected. Details surrounding the circumstances of the alleged breach and any responsible parties remain unclear at this time.\nTags:\nalleged breach\ncensus\nChina\ndata loss\ndata-breach\ndata-leak\ndatabase\npersonal data security"
    }
]