[
    {
        "Title": "ASUS Patches DriverHub RCE Flaws Exploitable via HTTP and Crafted .ini Files",
        "Link": "https://thehackernews.com/2025/05/asus-patches-driverhub-rce-flaws.html",
        "Summary": "ASUS has released updates to address two security flaws impacting ASUS DriverHub that, if successfully exploited, could enable an attacker to leverage the software in order to achieve remote code execution.\nDriverHub is a tool that's designed to automatically detect the motherboard model of a computer and display necessary driver updates for subsequent installation by communicating with a",
        "Date": "2025-05-12",
        "Content": "ASUS has released updates to address two security flaws impacting ASUS DriverHub that, if successfully exploited, could enable an attacker to leverage the software in order to achieve remote code execution.\nDriverHub\nis a tool that's designed to automatically detect the motherboard model of a computer and display necessary driver updates for subsequent installation by communicating with a\ndedicated site\nhosted at \"driverhub.asus[.]com.\"\nThe flaws identified in the software are listed below -\nCVE-2025-3462\n(CVSS score: 8.4) - An origin validation error vulnerability that may allow unauthorized sources to interact with the software's features via crafted HTTP requests\nCVE-2025-3463\n(CVSS score: 9.4) - An improper certificate validation vulnerability that may allow untrusted sources to affect system behavior via crafted HTTP requests\nSecurity researcher MrBruh, who is credited with discovering and reporting the two vulnerabilities, said they could be exploited to achieve remote code execution as part of a one-click attack.\nThe attack chain essentially involves tricking an unsuspecting user into visiting a sub-domain of driverhub.asus[.]com (e.g., driverhub.asus.com.<random string>.com) and then leveraging the DriverHub's UpdateApp endpoint to execute a legitimate version of the \"AsusSetup.exe\" binary with an option set to run any file hosted on the fake domain.\n\"When executing AsusSetup.exe it first reads from AsusSetup.ini, which contains metadata about the driver,\" the researcher\nexplained\nin a technical report.\n\"If you run AsusSetup.exe with the -s flag (DriverHub calls it using this to do a silent install), it will execute whatever is specified in SilentInstallRun. In this case, the ini file specifies a cmd script that performs an automated headless install of the driver, but it could run anything.\"\nAll an attacker needs to successfully pull off the exploit is to create a domain, and host three files, the malicious payload to be run, an altered version of AsusSetup.ini that has the \"SilentInstallRun\" property set to the malicious binary, and AsusSetup.exe, which then make use of the property to run the payload.\nFollowing responsible disclosure on April 8, 2025, the issues were fixed by ASUS on May 9. There is no evidence that the vulnerabilities have been exploited in the wild.\n\"This update includes important security updates and ASUS strongly recommends that users update their ASUS DriverHub installation to the latest version,\" the company\nsaid\nin a bulletin. \"The latest Software Update can be accessed by opening ASUS DriverHub, then clicking the 'Update Now' button.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "⚡ Weekly Recap: Zero-Day Exploits, Developer Malware, IoT Botnets, and AI-Powered Scams",
        "Link": "https://thehackernews.com/2025/05/weekly-recap-zero-day-exploits.html",
        "Summary": "What do a source code editor, a smart billboard, and a web server have in common? They’ve all become launchpads for attacks—because cybercriminals are rethinking what counts as “infrastructure.” Instead of chasing high-value targets directly, threat actors are now quietly taking over the overlooked: outdated software, unpatched IoT devices, and open-source packages. It's not just clever—it’s",
        "Date": "2025-05-12",
        "Content": "What do a source code editor, a smart billboard, and a web server have in common? They've all become launchpads for attacks—because cybercriminals are rethinking what counts as \"infrastructure.\" Instead of chasing high-value targets directly, threat actors are now quietly taking over the overlooked: outdated software, unpatched IoT devices, and open-source packages. It's not just clever—it's reshaping how intrusion, persistence, and evasion happen at scale.\n⚡ Threat of the Week\n5Socks Proxy Using IoT, EoL Systems Dismantled in Law Enforcement Operation\n— A joint law enforcement operation undertaken by Dutch and U.S. authorities\ndismantled\na criminal proxy network, known as anyproxy[.]net and 5socks[.]net, that was powered by thousands of infected Internet of Things (IoT) and end-of-life (EoL) devices, enlisting them into a botnet for providing anonymity to malicious actors. The illicit platform, active since 2004, advertised more than 7,000 online proxies daily, with infected devices mainly located in the U.S., Canada and Ecuador. The attacks targeted IoT devices susceptible to known security flaws to deploy a malware called TheMoon. The development comes as two other law enforcement operations have felled the\neXch\ncryptocurrency exchange for facilitating money laundering and\nsix DDoS-for-hire services\nthat were used to launch thousands of cyber-attacks across the world.\nPAM's Strategic Role in 2025: A Leadership Guide by Jonathan Care\nDiscover why Privileged Access Management is a top leadership priority in 2025. In this white paper, Jonathan Care outlines a framework for aligning PAM with business goals, tackling privileged threats, and preparing for future cybersecurity trends. Download your copy now.\nDownload ➝\n🔔 Top News\nCOLDRIVER Uses ClickFix to Distribute LOSTKEYS Malware\n— The Russia-linked threat actor known as COLDRIVER has been observed distributing a new malware called\nLOSTKEYS\nas part of an espionage-focused campaign using ClickFix-like social engineering lures. The attacks, detected in January, March, and April 2025, targeted current and former advisors to Western governments and militaries, as well as journalists, think tanks, and NGOs, as well as individuals connected to Ukraine. LOSTKEYS is designed to steal files from a hard-coded list of extensions and directories, along with sending system information and running processes to the attacker.\nPlay Ransomware Attack Exploited CVE-2025-29824 as a 0-Day\n— Threat actors with links to the Play ransomware family\nexploited\na recently patched security flaw in Microsoft Windows as a zero-day as part of an attack targeting an unnamed organization in the United States. The attack leveraged CVE-2025-29824, a privilege escalation flaw in the Common Log File System (CLFS) driver that was patched by Microsoft last month. That said, no ransomware was actually deployed in the attack. However, Grixba, a custom information stealer known to be used by the Play ransomware operation, was put to use.\nNSO Group Ordered to Pay $168 Million in Damages to WhatsApp\n— Israeli company NSO Group was\nordered\nby a federal jury in the U.S. to pay Meta-owned WhatsApp WhatsApp approximately $168 million in monetary damages, more than four months after a federal judge ruled that the Israeli company violated U.S. laws by exploiting WhatsApp servers to deploy Pegasus spyware targeting more than 1,400 individuals globally. In addition, the jury determined that NSO Group must pay WhatsApp $444,719 in compensatory damages for the significant efforts WhatsApp engineers made to block the attack vectors. WhatsApp originally filed the lawsuit against NSO Group in 2019, accusing NSO Group of exploiting WhatsApp using a then-zero-day vulnerability in the messaging app to target journalists, human rights activists, and political dissidents. NSO Group said it will appeal the ruling.\n3 Malicious npm Packages Target Cursor Users\n— Three malicious npm packages named sw-cur, sw-cur1, and aiide-cur have been\nflagged\nin the npm registry as designed to target the Apple macOS version of Cursor, a popular artificial intelligence (AI)-powered source code editor. The packages claim to be offering \"the cheapest Cursor API,\" but contain functionality to modify legitimate files associated with the software to execute arbitrary code in the compromised system. The packages continue to be available for download from npm, and have been downloaded over 3,200 times to date. The discovery heralds a new trend where threat actors are using rogue npm packages as a way to introduce malicious modifications to other legitimate libraries or software already installed on developer systems.\nSysAid Patches 4 Flaws That Enable Pre-Auth RCE\n— Multiple security flaws in the on-premise version of SysAid IT support software could be\nchained\nto achieve pre-authenticated remote code execution with elevated privileges. The flaws, tracked as CVE-2025-2775, CVE-2025-2776, CVE-2025-2777 (CVSS scores: 9.3), and CVE-2025-2778, have been addressed in version 24.4.60 b16 of the software.\nHackers Exploit Samsung MagicINFO, GeoVision IoT Flaws in Mirai Attacks\n— Threat actors are\nexploiting\nsecurity flaws in GeoVision end-of-life (EoL) Internet of Things (IoT) devices and an unpatched vulnerability affecting Samsung MagicINFO 9 Server to co-opt them into a Mirai botnet variant for conducting DDoS attacks. Users are advised to upgrade their GeoVision devices to a supported model and disconnect Samsung MagicINFO 9 Server instances from the public internet.\nDoJ Charges Yemeni National for Deploying Black Kingdom Ransomware\n— The U.S. Department of Justice (DoJ)\nannounced\ncharges against a 36-year-old Yemeni national named Rami Khaled Ahmed for allegedly deploying the Black Kingdom ransomware against global targets, including businesses, schools, and hospitals in the United States, between March 2021 to June 2023. Ahmed is accused of developing and deploying the ransomware by exploiting a vulnerability in Microsoft Exchange Server known as ProxyLogon. A report published by Kaspersky in June 2021\ndescribed\nthe ransomware as \"amateurish\" and lacking in complexity and sophistication associated with major ransomware schemes.\nGolden Chickens Return with TerraStealerV2 and TerraLogger Malware\n— Cybercriminal group Golden Chickens is back in the spotlight, this time with a\nfresh set of tools\nto steal credentials, cryptocurrency wallet data, browser extension information, and keystrokes. The findings represent the latest evidence of the threat actor's ongoing efforts to evolve their malware-as-a-service (MaaS) offerings. Golden Chickens, also called Venom Spider, has long been tied to the More_eggs malware. Unlike its data-sucking counterpart TerraStealerV2, TerraLogger takes a simpler but no less dangerous approach by capturing keystrokes entered by the victim on their machine. The fact that it lacks a data exfiltration mechanism suggests that it's likely being used as a module as part of their broader toolset.\n‎️‍🔥 Trending CVEs\nAttackers love software vulnerabilities—they're easy doors into your systems. Every week brings fresh flaws, and waiting too long to patch can turn a minor oversight into a major breach. Below are this week's critical vulnerabilities you need to know about. Take a look, update your software promptly, and keep attackers locked out.\nThis week's list includes —\nCVE-2025-32819, CVE-2025-32820, CVE-2025-32821\n(SonicWall),\nCVE-2025-20188\n(Cisco IOS XE Wireless Controller),\nCVE-2025-27007\n(OttoKit),\nCVE-2025-24977\n(OpenCTI),\nCVE-2025-4372\n(Google Chrome),\nCVE-2025-25014\n(Elastic Kibana),\nCVE-2025-4318\n(AWS Amplify Studio),\nCVE-2024-56523, CVE-2024-56524\n(Radware Cloud Web Application Firewall),\nCVE-2025-27533\n(Apache ActiveMQ),\nCVE-2025-26168, CVE-2025-26169\n(IXON VPN),\nCVE-2025-23123\n(Ubiquiti UniFi Protect Cameras),\nCVE-2024-8176\n(libexpat), and\nCVE-2025-47188\n(Mitel 6800 Series, 6900 Series, and 6900w Series SIP Phones).\n📰 Around the Cyber World\nBluetooth SIG Releases Bluetooth 6.1\n— The Bluetooth Special Interest Group has\nannounced\nthe release of Bluetooth 6.1 with improved device privacy via Resolvable Private Addresses (RPA). The feature enables \"randomizing the timing of address changes [and] makes it much more difficult for third-parties to track or correlate device activity over time,\" the SIG said.\nAI Slop Leads to Rise in Fake Bug Reports\n— Software supply chain security firm Socket is warning of a rise in artificial intelligence (AI)-generated\nfake vulnerability reports\nimpacting bug bounty programs that cite non-existent functions, include unverified patch suggestions, and highlight flaws that could not be reproduced. A consequence of this deliberate misuse is that it could cause bug bounty initiatives to operate in an effective manner. \"They divert limited attention from real vulnerabilities, add friction between maintainers and researchers, and chip away at the trust these programs depend on,\" the company\nsaid\n. Curl project founder Daniel Stenberg, in a\npost\non LinkedIn, said \"I'm putting my foot down on this craziness,\" and that every reporter who submits reports deemed AI slop will be instantly banned. \"A threshold has been reached,\" Stenberg said. \"We are effectively being DDoSed. If we could, we would charge them for this waste of our time. We still have not seen a single valid security report done with AI help.\"\nAgeoStealer Stealer Disguises as a Video Game\n— A new information stealer called AgeoStealer has been observed using a website hosted on the Blogger platform, masquerading as a video game named Lomina to trick users into installing it. \"By targeting browsers, authentication tokens, and system files, it enables cybercriminals to perform identity theft, corporate espionage, and unauthorized financial transactions,\" Flashpoint\nsaid\n. \"Additionally, the use of PowerShell process termination, combined with sandbox evasion tactics, makes it particularly difficult to detect through traditional antivirus solutions.\"\nSouth Korea says DeepSeek Transferred User Data to China and the U.S. Without Consent\n— South Korea's data protection authority, the Personal Information Protection Commission (PIPC), has\naccused\nChinese AI service DeepSeek of transferring the personal data of its users to companies located in China and the United States without obtaining their consent. This included device, network, app information, and prompts to a Chinese cloud service platform named Volcano Engine. Although the PIPC identified Volcano Engine as an affiliate of ByteDance, the watchdog said it is a \"separate legal entity.\" The findings are the result of an investigation the PIPC\nlaunched\nin February 2025.\nIranian Cyber Actors Impersonate a German Model Agency\n— Iranian threat actors have been linked to covert infrastructure (\"megamodelstudio[.]com\") impersonating a German model agency. The site is designed to trigger the execution of malicious JavaScript that, unbeknownst to the visitors, gathers their browser languages, screen resolutions, IP addresses, and browser fingerprints likely in an attempt to facilitate further selective targeting. The activity has been\nattributed\nwith low confidence to Agent Serpens (aka Charming Kitten), a threat actor\nknown\nfor its elaborate social engineering campaigns. The findings come as an Iran state-backed threat group dubbed Lemon Sandstorm\ntargeted\na critical national infrastructure (CNI) provider in a rival Middle Eastern nation and spread malicious software into its network over the past two years. The hacking group, per Fortinet, demonstrated operational security by taking pains to establish stealthy persistence for long periods and repeatedly trying various methods to infiltrate the network again after they were caught and eradicated.\nMozilla Streamlines Data Consent Experience for Firefox Add-ons\n— Browser maker Mozilla\nsaid\nit's making available a new feature in Firefox Nightly version 139 that introduces a new data consent experience for extensions in order to \"allow users to consent to share data with extensions directly in the Firefox add-on installation flow itself — rather than during a separate post-install experience and asking developers to build their own custom consent experiences.\" As part of the changes, Mozilla has created broad categories based on data types used by extensions, such as personal data and technical and user interaction data. Extension developers can specify what data they wish to collect or transmit in their extension's manifest.json file. During installation, the manifest information will be parsed by the browser and shown to the user. Users can then choose to accept or reject the data collection.\nChoiceJacking Attack Bypass Existing Juice Jacking Defenses to Steal Data\n—\nJuice jacking attacks\nhappen when hackers infect a charger with hidden malware that can steal sensitive data from phones connected to it. While mobile operating systems have since introduced new confirmation prompts for data connections from a USB host to a mobile device, a newly devised platform-agnostic attack technique from the Graz University of Technology has been found to sidestep existing mitigations that allows a malicious charger to autonomously spoof user input to enable its own data connection. \"Despite vendor customizations in USB stacks, ChoiceJacking attacks gain access to sensitive user files (pictures, documents, app data) on all tested devices from 8 vendors including the top 6 by market share,\" researchers Florian Draschbacher, Lukas Maar, Mathias Oberhuber, and Stefan Mangard\nsaid\n. \"For two vendors, our attacks allow file extraction from locked devices.\" Apple, Google, Samsung, and Xiaomi have all acknowledged the attacks and have released fixes with iOS 18.4 (\nCVE-2025-24193\n) and Android 15 (\nCVE-2024-43085\n). The issue is being tracked for Samsung and Xiaomi under the CVE identifiers CVE-2024-20900 and CVE-2024-54096, respectively.\nThreat Actors Target IIS Servers with Gh0st RAT\n— Suspected Chinese-speaking threat actors have been observed targeting poorly secured IIS web servers in South Korea with a malicious IIS module. \"When the malicious IIS native module is loaded into the w3wp.exe process, it intercepts all HTTP requests being sent to the web server,\" AhnLab\nsaid\n. \"It then manipulates the response values to redirect to a specific page or perform a web shell function. Through the malicious native module, threat actors can intercept all traffic coming into the web server and modify it as needed.\" The attack is notable for the use of a .NET-based web shell and\nGh0st RAT\n, a remote access trojan widely used by Chinese hacking groups. \"By installing their malicious modules on the web server, the threat actor was able to insert their affiliate links into the response values to the HTTP traffic requested from the web server,\" the company said. \"This allowed them to generate revenue by displaying their advertisements and banners on their partner websites. Additionally, the threat actor used the malware to install phishing pages and redirect users to them, thereby leaking sensitive information.\"\nMicrosoft Begins Enforcing New Outlook Rules for Bulk Emails\n— Microsoft has begun enacting stricter rules that domains sending more than 5,000 emails per day are required to follow. This includes mandatory SPF, DKIM, DMARC settings, functional unsubscribe links, transparent mailing practices, and email bounce management. \"These measures will help reduce spoofing, phishing, and spam activity, empowering legitimate senders with stronger brand protection and better deliverability,\" the company\nsaid\n.\nJapan Warns of Threat Actors Using Hijacked Financial Accounts to Conduct Trades\n— Weeks after Japan's Financial Services Agency (FSA)\nalerted\nusers of unauthorized transactions on internet stock trading services using stolen credentials harvested from phishing websites, the agency\nrevealed\nthat the hackers have conducted more than $1 billion in sales and purchases of about $902 billion since the start of the year. A total of 18 companies are impacted, with 3,505 transactions reported to date.\nNew Scam Exploits X Advertising Loophole\n— Threat actors are taking advantage of a loophole in X's ads policy to conduct a financial scam that employs ads with the display URL spoofing \"cnn[.]com\" but, when clicked, redirects visitors to a crypto scam website impersonating Apple's brand (\"ipresale[.]world\"). \"The scam encourages visitors to create an account and buy a token positioned as coming from Apple; the website also includes a fake testimonial from Apple CEO Tim Cook,\" Silent Push\nsaid\n. The findings coincide with the discovery of a recruitment scam that singles out job seekers with offers of flexible opportunities that entice them into depositing their own funds in order to complete a series of tasks and earn a cryptocurrency payment. \"After enticing victims to their phishing website with the promise of substantial remuneration, the threat actor then coerces them into making up-front payments to engage in the tasks that supposedly release that remuneration,\" Netcraft\nsaid\n. A similar campaign was\ndocumented\nby Proofpoint in October 2024.\nCrypto Heist Uncovers New Malware\n— An investigation into a large-scale cryptocurrency theft with losses exceeding $1 million has led to the discovery of two new malware families named PRELUDE and DELPHYS. PRELUDE is a .NET backdoor that can launch a reverse shell and take screenshots. DELPHYS, on the other hand, is a 64-bit Delphi loader distributed in EXE form, and is used to execute the\nHavoc\ncommand-and-control (C2) framework. The campaign, per\nKroll\n, was initiated via social engineering over a direct message on X, after which the victim was directed to a Discord server to download the malware. The activity, tracked as KTA440, is assessed to be a highly targeted campaign aimed at individuals of high net worth in the cryptocurrency space.\nIndia-Pakistan Military Conflict Sparks Cyber Attacks\n— The recent military conflict between India and Pakistan has led to a surge in attacks targeting both countries. Cybersecurity company NSFOCUS said it\nobserved\na 500% rise in cyberattacks targeting India and a 700% rise against targets in Pakistan towards the end of April 2025. There has also been an\nincrease\nin\nhacktivist activity\ntargeting India in the form of DDoS attacks, led by RipperSec, AnonSec, Keymous+, Sylhet Gang, and Mr Hamza. However, according to CloudSEK, a\nmajority\nof the claims of hacktivist campaigns targeting Indian digital infrastructure are \"significantly overblown.\" That's not all. The rising military tensions have been capitalized by the Pakistan-linked Transparent Tribe (aka APT36) threat actor, which has employed\nspear-phishing\nand\nClickFix-style lures\nto deliver\nCrimson RAT\nand a .NET-based loader, respectively.\nCISA Releases Guidance to Mitigate OT Threats from Unsophisticated Cyber Actors\n— The Cybersecurity and Infrastructure Security Agency (CISA), Federal Bureau of Investigation (FBI), Environmental Protection Agency (EPA), and Department of Energy (DOE) are\nurging\ncritical infrastructure entities to review and take steps to bolster their security posture amid \"cyber incidents affecting the operational technology (OT) and industrial control systems (ICS) of critical infrastructure entities in the United States.\" This includes removing OT connections to the public internet, changing default passwords, securing remote access to OT networks, and segmenting IT and OT networks. \"Although these activities often include basic and elementary intrusion techniques, the presence of poor cyber hygiene and exposed assets can escalate these threats, leading to significant consequences such as defacement, configuration changes, operational disruptions and, in severe cases, physical damage,\" the agencies said.\nLockBit Ransomware Admin Panel Hacked\n— In a further blow to LockBit's operations, the ransomware scheme's dark web affiliate panels were\nhacked and defaced\nwith the message \"Don't do crime CRIME IS BAD xoxo from Prague.\" The panel has also been made available to download in SQL database format, revealing custom ransomware builds, a list of 75 admins and affiliates who had access to the affiliate panel, 59,975 unique bitcoin addresses, and more than 4,400 victim negotiation messages from December 2024 to the end of April 2025. \"The leaked chats reveal a fascinating twist – attackers offer up to 20% discounts to victims who choose to pay in Monero instead of Bitcoin,\" Qualys\nsaid\n. \"This isn't just a random perk; it signals a deliberate preference for Monero, likely due to its privacy-centric design.\" LockBitSupp, LockBit's main administrator, has since\nconfirmed\nthe hack. While LockBit has continued to operate despite\nlaw enforcement action\n, the latest leak may sound the death knell for what was once the most prolific ransomware group.\nUnofficial Signal App Used by Trump Government Officials Probes Hack\n— TeleMessage, an Israeli company that sells an unofficial Signal message archiving tool used by\nsome U.S. government officials\n, has\nsuspended\nall services after reportedly being hacked. Details of the hack emerged in the wake of a\n404 Media report\nrevealed an anonymous hacker had breached TeleMessage and gained access to direct messages and group chats archived using TM SGNL, TeleMessage's unofficial Signal clone, alongside WhatsApp, Telegram, and WeChat.\n🎥 Cybersecurity Webinars\nLearn How Uniting Code, Cloud, and SOC Security Can Eliminate Hidden Gaps\n→\nModern application security can't afford to live in silos. With 80% of security gaps emerging in the cloud—and attackers exploiting them within hours—organizations must act faster and smarter. This webinar reveals how uniting code, cloud, and SOC security not only closes critical gaps but enables faster, more resilient defense across the entire application lifecycle. Join us to discover a unified approach that breaks barriers, reduces response time, and strengthens your security posture.\nExpert Guide to Building a Legally Defensible Cyber Defense Program\n→\nLearn how to build a cyber defense program that meets legal standards and regulatory expectations. This step-by-step guide walks you through using the CIS Controls, SecureSuite tools, and CSAT Pro to create a practical, defensible, and cost-effective security strategy tailored to your organization's needs.\n🔧 Cybersecurity Tools\nChainsaw\n→ It is a fast, lightweight forensic triage tool designed for rapid threat hunting and incident response on Windows systems. Built for speed and simplicity, it allows investigators to quickly search through Windows Event Logs, MFT files, Shimcache, SRUM, and registry hives using keyword matching, regex, and Sigma detection rules. With support for both Sigma and custom Chainsaw rules, it enables efficient detection of malicious activity—even in environments without pre-existing EDR coverage.\nHAWK Eye\n→\nIt is a powerful command-line security scanner designed to detect PII and secrets across your entire infrastructure—fast. With support for cloud services (S3, GCS, Firebase), databases (MySQL, PostgreSQL, MongoDB, Redis), messaging apps (Slack), and local file systems, it uses advanced OCR and pattern-matching to uncover sensitive data hidden in documents, images, archives, and even videos. It integrates easily into CI/CD pipelines or custom Python workflows, helping security teams proactively detect risks and prevent data leaks before they happen.\nAranya\n→ It is a developer tool by SpiderOak for building zero-trust, decentralized apps with built-in access control and end-to-end encryption. It simplifies security by embedding micro-segmentation, authentication, and policy enforcement directly into your software—no external tools needed. Lightweight and portable, Aranya supports Rust and C integrations, making it easy to create secure-by-design systems that work safely across any network.\n🔒 Tip of the Week\nCybersecurity Tip of the Week: Block AI Bots from Scraping Your Website →\nAI companies are quietly crawling websites to collect content for training their models. If you run a company blog, research portal, or any site with original content, it's likely being indexed—often without your consent.\nYou can reduce this risk by adding a simple robots.txt rule that tells known AI crawlers to stay out. It doesn't block rogue scrapers, but it does stop most major bots like GPTBot (OpenAI), AnthropicBot, and CCBot (Common Crawl), which power many commercial AI systems.\nAdd this to your site's robots.txt file:\nUser-agent: GPTBot\nDisallow: /\nUser-agent: AnthropicBot\nDisallow: /\nUser-agent: CCBot\nDisallow: /\nThis file must live at yourdomain[.]com/robots.txt. For extra visibility, monitor your server logs for unexpected crawlers. In an era where data is currency, limiting unauthorized use of your content is a simple, proactive security move.\nConclusion\nThis week underscored a fundamental reality: cyber risk is no longer just a technical problem—it's a business, legal, and reputational one. From criminal indictments tied to ransomware operations, to flawed software policies that enable phishing through official ad platforms, the consequences are moving upstream.\nSecurity decisions are leadership decisions now, and the organizations that act accordingly will be the ones that endure when the next breach hits close.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "The Persistence Problem: Why Exposed Credentials Remain Unfixed—and How to Change That",
        "Link": "https://thehackernews.com/2025/05/the-persistence-problem-why-exposed.html",
        "Summary": "Detecting leaked credentials is only half the battle. The real challenge—and often the neglected half of the equation—is what happens after detection. New research from GitGuardian's State of Secrets Sprawl 2025 report reveals a disturbing trend: the vast majority of exposed company secrets discovered in public repositories remain valid for years after detection, creating an expanding attack",
        "Date": "2025-05-12",
        "Content": "Detecting leaked credentials is only half the battle. The real challenge—and often the neglected half of the equation—is what happens after detection. New research from GitGuardian's State of Secrets Sprawl 2025 report reveals a disturbing trend: the vast majority of exposed\ncompany\nsecrets discovered in public repositories remain valid for years after detection, creating an expanding attack surface that many organizations are failing to address.\nAccording to GitGuardian's analysis of exposed secrets across public GitHub repositories, an alarming percentage of credentials detected as far back as 2022 remain valid today:\n\"Detecting a leaked secret is just the first step,\" says GitGuardian's research team. \"The true challenge lies in swift remediation.\"\nWhy Exposed Secrets Remain Valid\nThis persistent validity suggests two troubling possibilities: either\norganizations are unaware their credentials have been exposed\n(a security visibility problem), or they lack the resources, processes, or urgency to properly\nremediate them\n(a security operations problem).\nIn both cases, a concerning observation is that those secrets are not even routinely revoked, neither automatically from default expiration, nor manually as part of regular rotation procedures.\nOrganizations either remain unaware of exposed credentials or lack the resources to address them effectively. Hardcoded secrets proliferate across codebases, making comprehensive remediation challenging. Secret rotation requires coordinated updates across services and systems, often with production impact.\nResource constraints force prioritization of only the highest-risk exposures, while legacy systems create technical barriers by not supporting modern approaches like ephemeral credentials.\nThis combination of limited visibility, operational complexity, and technical limitations explains why hardcoded secrets often remain valid long after exposure. Moving to\nmodern secrets security solutions with centralized, automated systems\nand short-lived credentials is now an operational necessity, not just a security best practice.\nWhich Services Are Most At Risk? The trends\nBehind the raw statistics lies an alarming reality: critical production systems remain vulnerable due to exposed credentials that persist for years in public repositories.\nAnalysis of exposed secrets from 2022-2024 reveals that database credentials, cloud keys, and API tokens for essential services continue to remain valid long after their initial exposure. These are\nnot test or development credentials but authentic keys to production environments\n, representing direct pathways for attackers to access sensitive customer data, infrastructure, and business-critical systems.\nSensitive Services Still Exposed (2022–2024):\nMongoDB: Attackers can use these to exfiltrate or corrupt data. These are highly sensitive, offering potential attackers access to\npersonally identifiable information\nor technical insight that can be used for privilege escalation or lateral movement.\nGoogle Cloud, AWS, Tencent Cloud: these cloud keys grant potential attackers access to infrastructure, code, and customer data.\nMySQL/PostgreSQL: these database credentials persist in public code each year as well.\nThese are not test credentials, but keys to live services.\nOver the past three years, the landscape of exposed secrets in public repositories has shifted in ways that reveal both progress and new risks, especially for cloud and database credentials. Once again, these trends reflect only the ones that have been found and are still valid—meaning\nthey have not been remediated or revoked despite being publicly exposed.\nFor cloud credentials, the data shows a marked upward trend. In 2023, valid cloud credentials accounted for just under 10% of all still-active exposed secrets.\nBy 2024, that share had surged to almost 16%.\nThis increase likely reflects the growing adoption of cloud infrastructure and SaaS in enterprise environments, but it also underscores the ongoing struggle many organizations face in managing cloud access securely—especially as developer velocity and complexity increase.\nIn contrast, database credential exposures moved in the opposite direction. In 2023,\nvalid database credentials made up over 13% of the unremediated secrets detected, but by 2024, that figure dropped to less than 7%\n. This decline could indicate that awareness and remediation efforts around database credentials—particularly following high-profile breaches and increased use of managed database services—are starting to pay off.\nThe overall takeaway is nuanced: while organizations may be getting better at protecting traditional database secrets, the rapid rise in valid, unremediated cloud credential exposures suggests that new types of secrets are taking their place as the most prevalent and risky. As cloud-native architectures become the norm, the need for automated secrets management, short-lived credentials, and rapid remediation is more urgent than ever.\nPractical Remediation Strategies for High-Risk Credentials\nTo reduce the risk posed by exposed\nMongoDB credentials\n, organizations should act quickly to rotate any that may have leaked and set up IP allowlisting to strictly limit who can access the database. Enabling audit logging is also key for detecting suspicious activity in real time and helping with investigations after a breach. For longer-term security, move away from hardcoded passwords by leveraging dynamic secrets. If you use MongoDB Atlas, programmatic access to the password rotation is possible through the API so that you can make your CI/CD pipelines routinely rotate secrets, even if you haven't detected an exposure.\nGoogle Cloud Keys\nIf a\nGoogle Cloud key\nis ever found exposed, the safest move is immediate revocation. To prevent future risk, transition from static service account keys to modern, short-lived authentication methods: use Workload Identity Federation for external workloads, attach service accounts directly to Google Cloud resources, or implement service account impersonation when user access is required. Enforce regular key rotation and apply least privilege principles to all service accounts to minimize the potential impact of any exposure.\nAWS IAM Credentials\nFor\nAWS IAM credentials\n, immediate rotation is essential if exposure is suspected. The best long-term defense is to eliminate long-lived user access keys entirely, opting for IAM Roles and AWS STS to provide temporary credentials for workloads. For systems outside AWS, leverage IAM Roles Anywhere. Routinely audit your access policies with AWS IAM Access Analyzer and enable AWS CloudTrail for comprehensive logging, so you can quickly spot and respond to any suspicious credential usage.\nBy adopting these modern secrets management practices—focusing on short-lived, dynamic credentials and automation—organizations can significantly reduce the risks posed by exposed secrets and make remediation a routine, manageable process rather than a fire drill.\nSecret Managers integrations\ncan also help to solve this task automatically.\nConclusion\nThe persistent validity of exposed secrets represents a significant and often overlooked security risk. While detection is essential, organizations must prioritize rapid remediation and shift toward architectures that minimize the impact of credential exposure.\nAs our data shows, the problem is getting worse, not better—with more secrets remaining valid longer after exposure. By implementing proper secret management practices and moving away from long-lived credentials, organizations can significantly reduce their attack surface and mitigate the impact of inevitable exposures.\nGitGuardian's State of Secrets Sprawl 2025 report provides a comprehensive analysis of secrets exposure trends and remediation strategies. The full report is available at\nwww.gitguardian.com/files/the-state-of-secrets-sprawl-report-2025\n.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Fake AI Tools Used to Spread Noodlophile Malware, Targeting 62,000+ via Facebook Lures",
        "Link": "https://thehackernews.com/2025/05/fake-ai-tools-used-to-spread.html",
        "Summary": "Threat actors have been observed leveraging fake artificial intelligence (AI)-powered tools as a lure to entice users into downloading an information stealer malware dubbed Noodlophile.\n\"Instead of relying on traditional phishing or cracked software sites, they build convincing AI-themed platforms – often advertised via legitimate-looking Facebook groups and viral social media campaigns,\"",
        "Date": "2025-05-12",
        "Content": "Threat actors have been observed leveraging fake artificial intelligence (AI)-powered tools as a lure to entice users into downloading an information stealer malware dubbed\nNoodlophile\n.\n\"Instead of relying on traditional phishing or cracked software sites, they build convincing AI-themed platforms – often advertised via legitimate-looking Facebook groups and viral social media campaigns,\" Morphisec researcher Shmuel Uzan\nsaid\nin a report published last week.\nPosts shared on these pages have been found to attract over 62,000 views on a single post, indicating that users looking for AI tools for video and image editing are the target of this campaign. Some of the fake social media pages identified include Luma Dreammachine Al, Luma Dreammachine, and gratistuslibros.\nUsers who land on the social media posts are urged to click on links that advertise AI-powered content creation services, including videos, logos, images, and even websites. One of the bogus websites masquerades as CapCut AI, offering users an \"all-in-one video editor with new AI features.\"\nOnce unsuspecting users upload their image or video prompts on these sites, they are then asked to download the supposed AI-generated content, at which point a malicious ZIP archive (\"VideoDreamAI.zip\") is downloaded instead.\nPresent within the file is a deceptive file named \"Video Dream MachineAI.mp4.exe\" that kick-starts the infection chain by launching a legitimate binary associated with ByteDance's video editor (\"CapCut.exe\"). This C++-based executable is used to run a .NET-based loader named CapCutLoader that, in turn, ultimately loads a Python payload (\"srchost.exe\") from a remote server.\nThe Python binary paves the way for the deployment of Noodlophile Stealer, which comes with capabilities to harvest browser credentials, cryptocurrency wallet information, and other sensitive data. Select instances have also bundled the stealer with a remote access trojan like\nXWorm\nfor entrenched access to the infected hosts.\nThe developer of Noodlophile is assessed to be of Vietnamese origin, who, on their GitHub profile,\nclaims\nto be a \"passionate Malware Developer from Vietnam.\" The account was created on March 16, 2025. It's worth pointing out that the Southeast Asian nation is home to a\nthriving cybercrime ecosystem\nthat has a history of distributing various stealer malware families targeting Facebook.\nBad actors weaponizing public interest in AI technologies to their advantage is not a new phenomenon. In 2023, Meta said it\ntook down\nmore than 1,000 malicious URLs from being shared across its services that were found to leverage OpenAI's ChatGPT as a lure to propagate about 10 malware families since March 2023.\nThe disclosure comes as CYFIRMA detailed another new .NET-based stealer malware family codenamed PupkinStealer that can steal a wide range of data from compromised Windows systems and exfiltrate it to an attacker-controlled Telegram bot.\n\"With no specific anti-analysis defenses or persistence mechanisms, PupkinStealer depends on straightforward execution and low-profile behavior to avoid detection during its operation,\" the cybersecurity company\nsaid\n. \"PupkinStealer exemplifies a simple yet effective form of data-stealing malware that leverages common system behaviors and widely used platforms to exfiltrate sensitive information.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "ASUS DriverHub flaw let malicious sites run commands with admin rights",
        "Link": "https://www.bleepingcomputer.com/news/security/asus-driverhub-flaw-let-malicious-sites-run-commands-with-admin-rights/",
        "Summary": "The ASUS DriverHub driver management utility was vulnerable to a critical remote code execution flaw that allowed malicious sites to execute commands on devices with the software installed. [...]",
        "Date": "2025-05-12",
        "Content": "The ASUS DriverHub driver management utility was vulnerable to a critical remote code execution flaw that allowed malicious sites to execute commands on devices with the software installed.\nThe flaw was discovered by an independent cybersecurity researcher from New Zealand named Paul (aka \"\nMrBruh\n\"), who found that the software had poor validation of commands sent to the DriverHub background service.\nThis allowed the researcher to create an exploit chain utilizing flaws tracked as\nCVE-2025-3462\nand\nCVE-2025-3463\nthat, when combined, achieve origin bypass and trigger remote code execution on the target.\nThe DriverHub problem\nDriverHub is ASUS's official driver management tool that is automatically installed on the first system boot when utilizing certain ASUS motherboards.\nThis software runs in the background, automatically detecting and fetching the latest driver versions for the detected motherboard model and its chipset.\nOnce installed, the tool remains active and running in the background via a local service on port 53000, continually checking for important driver updates.\nMeanwhile, most users don't even know such a service is constantly running on their system.\nThat service checks the Origin Header of incoming HTTP requests to reject anything that doesn't come from 'driverhub.asus.com.'\nHowever, this check is poorly implemented, as any site that includes that string is accepted even if it's not an exact match to ASUS's official portal.\nThe second issue lies in the UpdateApp endpoint, which allows DriverHub to download and run .exe files from \".asus.com\" URLs without user confirmation.\nThe BIOS setting concerning DriverHub (Enabled by default)\nSource: MrBruh\nStealthy attack flow\nAn attacker can target any user with ASUS DriverHub running on their system to trick them into visiting a malicious website on their browser. This website then sends \"UpdateApp requests\" to the local service at 'http://127.0.0.1:53000.'\nBy spoofing the Origin Header to something like 'driverhub.asus.com.mrbruh.com,' the weak validation check is bypassed, so DriverHub accepts the commands.\nIn the researcher's demonstration, the commands order the software to download a legitimate ASUS-signed 'AsusSetup.exe' installer from the vendor's download portal, along with a malicious .ini file and .exe payload.\nThe ASUS-signed installer is silently run as admin and uses the configuration information in the .ini file. This ini file directs the legitimate ASUS driver installer to launch the malicious executable file.\nThe attack is also made possible by the tool failing to delete files that fail signature checks, like the .ini and payload, which are kept on the host after their download.\nASUS' response and user action\nASUS received the researcher's reports on April 8, 2025, and implemented a fix on April 18, after validating it with MrBruh the day before. The hardware giant did not offer the researcher any bounty for his disclosure.\nThe CVE descriptions, which the Taiwanese vendor submitted, somewhat downplays the issue with the following statement:\n\"This issue is limited to motherboards and does not affect laptops, desktop computers, or other endpoints,\" reads the CVE description.\nThis is confusing, as the mentioned CVEs impact laptops and desktop computers with DriverHub installed.\nHowever, ASUS is clearer in its security bulletin, advising users to quickly apply the latest update.\n\"This update includes important security updates and ASUS strongly recommends that users update their ASUS DriverHub installation to the latest version,\"\nreads the bulletin\n.\n\"The latest Software Update can be accessed by opening ASUS DriverHub, then clicking the \"Update Now\" button.\"\nMrBruh says he monitored certificate transparency updates and found no other TLS certificates containing the \"driverhub.asus.com\" string, indicating it was not exploited in the wild.\nIf you're uncomfortable with a background service automatically fetching potentially dangerous files upon visiting websites, you may disable DriverHub from your BIOS settings.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nOutput Messenger flaw exploited as zero-day in espionage attacks\nSamsung MagicINFO 9 Server RCE flaw now exploited in attacks\nCritical Langflow RCE flaw exploited to hack AI app servers\nSAP fixes suspected NetWeaver zero-day exploited in attacks\nASUS releases fix for AMI bug that lets hackers brick servers"
    },
    {
        "Title": "Windows 11 upgrade block lifted after Safe Exam Browser fix",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-upgrade-block-lifted-after-safe-exam-browser-fix/",
        "Summary": "Microsoft has removed an upgrade block that prevented some Safe Exam Browser users from installing the Windows 11 2024 Update due to incompatibility issues. [...]",
        "Date": "2025-05-12",
        "Content": "Microsoft has removed an upgrade block that prevented some Safe Exam Browser users from installing the Windows 11 2024 Update due to incompatibility issues.\nSafe Exam Browser is an open-source software used by schools, professional certification bodies, and enterprises to transform computers into secure workstations during online exams, preventing cheating by restricting access to unauthorized resources, apps, and websites.\nThe compatibility hold was added in September to prevent issues affecting Windows 11, version 24H2 users when opening Safe Exam Browser version 3.7 or lower.\nMicrosoft says the developers have solved this known issue and advises customers to install the latest Safe Exam Browser version (3.8 or later). Affected users should update the Safe Exam Browser app before upgrading their systems to Windows 11 24H2.\n\"If your device still encounters this safeguard hold 48 hours after updating to the latest version of the application, you will need to contact Safe Exam Browser Support for more information on the resolution,\" Microsoft\nsaid\nin a Windows release health update.\n\"If you are trying to install Windows 11, version 24H2 through the media creation tool, you will be able to proceed with the installation after you follow the instructions in the UI that pops up during the installation.\"\nWindows 11 24H2 rolling out to everyone, still blocked on some PCs\nLast week, ​Microsoft announced that the Windows 11 24H2 feature update is\nready to roll out to all compatible PCs\n, excluding those with safeguard holds, and fixed a known issue\nblocking it\nfrom being delivered via Windows Server Update Services (WSUS) after installing the April 2025 security updates.\nThe company also mitigated a \"latent code issue\"\ncausing some PCs to be upgraded to Windows 11\ndespite Intune policies that should've blocked Windows 11 upgrades.\nIn recent months, Microsoft has lifted other compatibility holds, blocking Windows 11 24H2 upgrades\non ASUS devices\nwith very specific hardware components​​​​​​ and for\nsome AutoCAD users\nand\nAsphalt 8: Airborne players\n.\nOther\nupgrade blocks\nprompted by incompatible hardware and software that still stand have also been applied to computers with\nintegrated cameras\n,\nDirac audio improvement software\n, or the\nEasy Anti-Cheat\napplication.\nWindows 11 24H2\nstarted rolling out in May 2024\nfor enterprise testing to enterprise customers enrolled in the Windows Insider Release Preview Channel and was released to eligible devices running Windows 11 22H2/23H2\nin October\n.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft lifts Windows 11 upgrade block after Asphalt 8 crash fix\nMicrosoft lifts Windows 11 update block for some AutoCAD users\nWindows 11 24H2 blocked on PCs with code-obfuscation driver BSODs\nMicrosoft fixes Remote Desktop issues caused by Windows updates\nWindows 11 update breaks Veeam recovery, causes connection errors"
    },
    {
        "Title": "Hackers now testing ClickFix attacks against Linux targets",
        "Link": "https://www.bleepingcomputer.com/news/security/hackers-now-testing-clickfix-attacks-against-linux-targets/",
        "Summary": "A new campaign employing ClickFix attacks has been spotted targeting both Windows and Linux systems using instructions that make infections on either operating system possible. [...]",
        "Date": "2025-05-12",
        "Content": "A new campaign employing ClickFix attacks has been spotted targeting both Windows and Linux systems using instructions that make infections on either operating system possible.\nClickFix is a\nsocial engineering tactic\nwhere fake verification systems or application errors are used to trick website visitors into running console commands that install malware.\nThese attacks have traditionally targeted Windows systems, prompting targets to execute PowerShell scripts from the Windows Run command, resulting in\ninfo-stealer malware\ninfections and\neven ransomware\n.\nHowever, a 2024 campaign using bogus Google Meet errors also\ntargeted macOS users\n.\nClickFix targeting Linux users\nA more recent campaign spotted by\nHunt.io researchers\nlast week is among the first to adapt this social engineering technique for Linux systems.\nThe attack, which is attributed to the Pakistan-linked threat group APT36 (aka \"Transparent Tribe\"), utilizes a website that impersonates India's Ministry of Defence with a link to an allegedly official press release.\nMalicious website mimicking India's Ministry of Defence\nSource: Hunt.io\nWhen visitors click on this website link, they are profiled by the platform to determine their operating system, and then redirected to the correct attack flow.\nOn Windows, victims are served a full-screen page warning them of limited content usage rights. Clicking on 'Continue' triggers JavaScript that copies a malicious MSHTA command to the victim's clipboard, who is instructed to paste and execute it on the Windows terminal.\nThis launches a .NET-based loader which connects to the attacker's address, while the user sees a decoy PDF file to make everything appear legitimate and as expected.\nOn Linux, victims are redirected to a CAPTCHA page that copies a shell command to their clipboard when clicking the \"I'm not a robot button.\"\nThe victim is then guided to press ALT+F2 to open a Linux run dialog, paste the command into it, and then press\nEnter\nto execute it.\nInstructions for Linux users\nSource: Hunt.io\nThe command drops the 'mapeal.sh' payload on the target's system, which, according to Hunt.io, does not perform any malicious actions in its current version, limited to fetching a JPEG image from the attacker's server.\nLinux ClickFix script\nSource: BleepingComputer\n\"The script downloads a JPEG image from the same trade4wealth[.]in directory and opens it in the background,\" explains Hunt.io.\n\"No additional activity, such as persistence mechanisms, lateral movement, or outbound communication, was observed during execution.\"\nHowever, it is possible that APT36 is currently experimenting to determine the effectiveness of the Linux infection chain, as they would just need to swap out the image for a shell script to install malware or perform other malicious activity.\nThe adaptation of ClickFix to carry out attacks on Linux is another testament to its effectiveness, as the attack type has now been used against all three major desktop OS platforms.\nAs a general policy, users should not copy and paste any commands into Run dialogs without knowing exactly what the command does. Doing so only increases the risk of a malware infection and theft of sensitive data.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\niClicker site hack targeted students with malware via fake CAPTCHA\nGoogle links new LostKeys data theft malware to Russian cyberspies\nLuna Moth extortion hackers pose as IT help desks to breach US firms\nLinux wiper malware hidden in malicious Go modules on GitHub\nMicrosoft: Octo Tempest is one of the most dangerous financial hacking groups"
    },
    {
        "Title": "Output Messenger flaw exploited as zero-day in espionage attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/output-messenger-flaw-exploited-as-zero-day-in-espionage-attacks/",
        "Summary": "A Türkiye-backed cyberespionage group exploited a zero-day vulnerability to attack Output Messenger users linked to the Kurdish military in Iraq. [...]",
        "Date": "2025-05-12",
        "Content": "A Türkiye-backed cyberespionage group exploited a zero-day vulnerability to attack Output Messenger users linked to the Kurdish military in Iraq.\nMicrosoft Threat Intelligence analysts who spotted these attacks also discovered the security flaw (\nCVE-2025-27920\n) in the LAN messaging application, a directory traversal vulnerability that can let authenticated attackers access sensitive files outside the intended directory or deploy malicious payloads on the server's startup folder.\n\"Attackers could access files such as configuration files, sensitive user data, or even source code, and depending on the file contents, this could lead to further exploitation, including remote code execution,\" Srimax, the app's developer,\nexplains\nin a security advisory issued in December when the bug was patched with the release of Output Messenger V2.0.63.\nMicrosoft revealed on Monday that the hacking group (also tracked as Sea Turtle, SILICON, and UNC1326) targeted users who hadn't updated their systems to infect them with malware after gaining access to the Output Messenger Server Manager application.\nAfter compromising the server, Marbled Dust hackers could steal sensitive data, access all user communications, impersonate users, gain access to internal systems, and cause operational disruptions.\n\"While we currently do not have visibility into how Marbled Dust gained authentication in each instance, we assess that the threat actor leverages DNS hijacking or typo-squatted domains to intercept, log, and reuse credentials, as these are techniques leveraged by Marbled Dust in previously observed malicious activity,\"\nMicrosoft said\n.\nNext, the attackers deployed a backdoor (\nOMServerService.exe)\nonto the victims' devices, which checked connectivity against an attacker-controlled command-and-control domain (\napi.wordinfos[.]com\n) and then provided the threat actors with additional information to identify each victim.\nAttack chain (Microsoft)\n​In one instance, the Output Messenger client on a victim's device connected to an IP address linked to the Marbled Dust threat group, likely for data exfiltration, shortly after the attacker instructed the malware to collect files and archive them as a RAR archive.\nMarbled Dust is known for targeting Europe and the Middle East, focusing on telecommunications and IT companies, as well as government institutions and organizations opposing the Turkish government.\nTo breach the networks of infrastructure providers, they're scanning for vulnerabilities in internet-facing devices. They're also exploiting their access to compromised DNS registries to change government organizations' DNS server configurations, which allows them to intercept traffic and steal credentials in man-in-the-middle attacks.\n\"This new attack signals a notable shift in Marbled Dust's capability while maintaining consistency in their overall approach,\" Microsoft added. \"The successful use of a zero-day exploit suggests an increase in technical sophistication and could also suggest that Marbled Dust's targeting priorities have escalated or that their operational goals have become more urgent.\"\nLast year, Marbled Dust was also\nlinked to multiple espionage campaigns\ntargeting organizations in the Netherlands, mainly targeting telecommunications companies, internet service providers (ISPs), and Kurdish websites between 2021 and 2023.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nSAP fixes suspected NetWeaver zero-day exploited in attacks\nASUS DriverHub flaw let malicious sites run commands with admin rights\nSamsung MagicINFO 9 Server RCE flaw now exploited in attacks\nCritical Langflow RCE flaw exploited to hack AI app servers\nActive! Mail RCE flaw exploited in attacks on Japanese orgs"
    },
    {
        "Title": "Moldova arrests suspect linked to DoppelPaymer ransomware attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/moldova-arrests-suspect-linked-to-doppelpaymer-ransomware-attacks/",
        "Summary": "Moldovan authorities have detained a 45-year-old suspect linked to DoppelPaymer ransomware attacks targeting Dutch organizations in 2021. [...]",
        "Date": "2025-05-12",
        "Content": "Moldovan authorities have detained a 45-year-old suspect linked to DoppelPaymer ransomware attacks targeting Dutch organizations in 2021.\nPolice officers searched the suspect's home and car on May 6, seizing an electronic wallet, €84,800, two laptops, a mobile phone, a tablet, six bank cards, and multiple data storage devices.\nThe suspect remains in custody, while Moldovan prosecutors have initiated legal procedures to extradite him to the Netherlands.\nThe arrest resulted from a joint action involving Moldovan prosecutors, the country's Center for Combating Cybercrimes, and law enforcement in the Kingdom of the Netherlands.\nA\nMonday press release\nadded that the suspect, described as a \"foreign citizen,\" had allegedly orchestrated a 2021 ransomware attack against the NWO (Dutch Research Council) that led to roughly €4.5 million in damages.\nThe NWO\ndisclosed the incident\non February 14, 2021, saying the attack forced it to shut down its grant application system. Ten days later, the attackers published documents stolen from the council's network on DoppelPaymer's dark web leak site after the NWO refused to pay a ransom demand.\nDoppelPaymer ransomware\nThe DoppelPaymer ransomware operation\nemerged in June 2019\nafter the Evil Corp cybercrime gang split, with some members creating a new ransomware gang that shared much of the same code as Evil Corp's BitPaymer.\nBesides using stolen files as leverage to force victims into paying ransoms as they did in NWO's case, DoppelPaymer ransomware operators threatened to\nwipe decryption keys\nif victims contracted professional negotiators to obtain a better price for recovering the encrypted data.\nAs the FBI warned in a\n2020 private industry alert\n, \"Prior to infecting systems with ransomware, the actors' exfiltrate data to use in extortion schemes and have made follow-on telephone calls to victims to further pressure them to make ransom payments.\"\nDoppelPaymer continued to attack large companies and critical infrastructure organizations through 2022, rebranding twice as\nGrief (a.k.a. Pay or Grief)\nand\nEntropy ransomware\n.\nLaw enforcement\nhas targeted two other individuals\nbelieved to be core members of the DoppelPaymer ransomware group in March 2023 and issued arrest warrants for three other core members.\nThe gang's victims list includes high-profile companies and organizations worldwide, such as electronics giant\nFoxconn\n,\nKia Motors America\n,\nDelaware County in Pennsylvania\n, laptop maker\nCompal\n, and\nNewcastle University\n.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nKickidler employee monitoring software abused in ransomware attacks\nPlay ransomware exploited Windows logging flaw in zero-day attacks\nDDoS site Dstat.cc seized and two suspects arrested in Germany\nNew \"Bring Your Own Installer\" EDR bypass used in ransomware attack\nUK shares security tips after major retail cyberattacks"
    },
    {
        "Title": "Google to pay $1.375 billion to settle Texas data privacy violations",
        "Link": "https://www.bleepingcomputer.com/news/legal/google-to-pay-1375-billion-to-settle-texas-data-privacy-violations/",
        "Summary": "Google has agreed to a $1.375 billion settlement with the state of Texas over a 2022 lawsuit that alleged it had been collecting and using biometric data of millions of Texans without properly acquiring their consent. [...]",
        "Date": "2025-05-12",
        "Content": "Google has agreed to a $1.375 billion settlement with the state of Texas over a 2022 lawsuit that alleged it had been collecting and using biometric data of millions of Texans without properly acquiring their consent.\nThe office of Texas Attorney General Ken Paxton announced the settlement agreement, which called it a 'historic win' for the state, noting that it's the highest recovery nationwide against Google.\n\"To date, no state has attained a settlement against Google for similar data-privacy violations greater than $93 million,\"\ncommented Paxton's office in the announcement\n.\n\"Even a multistate coalition that included forty states secured just $391 million—almost a billion dollars less than Texas's recovery.\"\nGoogle was\naccused\nof violating the state's biometric privacy act, which dictates that companies must clearly inform users and get their consent before collecting biometric identifiers such as fingerprints, voice, hand scans, and retina/iris scans.\nAccording to the lawsuit, since at least 2015, Google has unlawfully (without consent) collected Texans' face and voice scans to empower its targeted advertising business.\nAdditionally, Google was accused of persistently tracking Texans who used its products and services, constantly logging their location and searches made while in Chrome's incognito mode.\nPaxton underlined that nobody is above the law, and Big Tech will not be left unchecked.\nA Google spokesperson told BleepingComputer that this settlement covers two cases and three claims, all of which have already resulted in product/procedure changes in the tech giant's products and services, so no further action is required.\n\"This settles a raft of old claims, many of which have already been resolved elsewhere, concerning product policies we have long since changed,\" said Google spokesperson José Castañeda.\n\"We are pleased to put them behind us, and we will continue to build robust privacy controls into our services.\"\nGoogle also noted that the settlement is not an admission of wrongdoing or liability.\nUnder AG Paxton, Texas has had successful motions against tech giants in recent years.\nA highlighted example is a $1.4 billion July 2024 settlement with Meta for unlawfully collecting and using facial recognition data.\nIn January 2025, Paxton filed a lawsuit targeting\ncar insurer Allstate\nand its subsidiary Arity for unlawfully collecting, using, and re-selling driving data from over 45 million Americans, violating TDPSA, the Data Broker Law, and the Texas Insurance Code.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft Teams will soon block screen capture during meetings\nBluetooth 6.1 enhances privacy with randomized RPA timing\nGoogle Chrome to use on-device AI to detect tech support scams\nGoogle fixes actively exploited FreeType flaw on Android\nGoogle NotebookLM is now using Gemini 2.5 Flash"
    },
    {
        "Title": "Majority of Browser Extensions Pose Critical Security Risk, A New Report Reveals",
        "Link": "https://www.bleepingcomputer.com/news/security/majority-of-browser-extensions-pose-critical-security-risk-a-new-report-reveals/",
        "Summary": "99% of enterprise users have browser extensions but over half carry high-risk permissions. LayerX's 2025 report reveals how everyday extensions expose sensitive data, and what security teams must do now. [...]",
        "Date": "2025-05-12",
        "Content": "Browser extensions have become deeply embedded in employees' daily workflows, aiding tasks from grammar checking to discount hunting. Yet, their extensive permissions create significant security risks, largely unnoticed by IT and security teams.\nA new\n2025 Enterprise Browser Extension Security Report\n, uniquely combining data from public extension marketplaces and real-world enterprise usage telemetry to spotlight this underestimated threat vector.\nLayerX is hosting a webinar to discuss key findings from the Enterprise Browser Extension Security Report 2025. Gain actionable insights to mitigate browser extension risks.\nRegister here\nKey Findings from the Report\n1. Extensions are Ubiquitous but Dangerous:\n99% of enterprise users have browser extensions installed, with 52% running more than ten extensions, significantly broadening the threat surface.\nSecurity analysis:\nNearly every employee could potentially compromise organizational security.\n2. Extensive Permissions to Sensitive Data:\n53% of extensions installed in enterprise environments have 'high' or 'critical' risk permissions, allowing access to sensitive data like cookies, passwords, browsing history, and webpage contents.\nSecurity analysis:\nOne compromised extension can put the entire organization at risk.\n3. GenAI Extensions:\nThe Hidden Threat Over 20% of enterprise employees use GenAI extensions, with 58% of these holding 'high' or 'critical' permissions, creating significant risk.\nSecurity analysis:\nEnterprises must implement strict policies on GenAI extension usage and data handling.\n4. Untrusted Extension Publishers:\n54% of extensions are published anonymously via Gmail accounts, with 79% from publishers who have released only one extension, making trust assessment extremely challenging.\nSecurity analysis:\nTrust verification for extensions is highly difficult, increasing the likelihood of malicious activity.\n5. Abandoned and Outdated Extensions:\n51% of extensions haven't received updates in over a year, while 26% of enterprise extensions are sideloaded, bypassing security vetting.\nSecurity analysis:\nOutdated or unmanaged extensions significantly raise security risks due to potential vulnerabilities.\nRecommendations for Security and IT Teams:\nAudit all browser extensions across the enterprise environment.\nCategorize extensions to understand their risk profiles.\nEnumerate and analyze extension permissions meticulously.\nPerform comprehensive risk assessments of each extension.\nEnforce adaptive, risk-based security policies to manage extension threats effectively.\nDownload the full report\nto understand the complete security implications and strategies for managing browser extensions securely.\nSponsored and written by\nLayerX\n."
    },
    {
        "Title": "NSO Group's Legal Loss May Do Little to Curtail Spyware",
        "Link": "https://www.darkreading.com/endpoint-security/nso-groups-legal-loss-curtail-spyware",
        "Summary": "The $168 million judgment against NSO Group underscores how citizens put little store in the spyware industry's justifications for circumventing security — but will it matter?",
        "Date": "2025-05-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/nso-groups-legal-loss-curtail-spyware"
    },
    {
        "Title": "Attackers Lace Fake Generative AI Tools With 'Noodlophile' Malware",
        "Link": "https://www.darkreading.com/endpoint-security/attackers-fake-generative-ai-tools-malware",
        "Summary": "Threat actors are scamming users by advertising legitimate-looking generative AI websites that, when visited, install credential-stealing malware onto the victim's computer.",
        "Date": "2025-05-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/attackers-fake-generative-ai-tools-malware"
    },
    {
        "Title": "4 Hackers Arrested After Millions Made in Global Botnet Business",
        "Link": "https://www.darkreading.com/endpoint-security/4-hackers-arrested-global-botnet-business",
        "Summary": "The cybercriminals infected older wireless Internet routers with Anyproxy and 5socks malware in order to reconfigure  them — all without the users' knowledge.",
        "Date": "2025-05-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/4-hackers-arrested-global-botnet-business"
    },
    {
        "Title": "Can Cybersecurity Keep Up In the AI Arms Race?",
        "Link": "https://www.darkreading.com/cyber-risk/can-cybersecurity-keep-up-ai-arms-race",
        "Summary": "New research shows China is quickly catching up with the US in AI innovation. Experts weigh in on what it means for cyber defenders.",
        "Date": "2025-05-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/can-cybersecurity-keep-up-ai-arms-race"
    },
    {
        "Title": "Vulnerability Detection Tops Agentic AI at RSAC's Startup Competition",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/vulnerability-detection-agentic-ai-rsac-startup-competition",
        "Summary": "Agentic-native startups threaten to reduce the zero-day problem to just a zero-hour issue. Of course, AI agents will accelerate offensive attacks as well.",
        "Date": "2025-05-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/vulnerability-detection-agentic-ai-rsac-startup-competition"
    },
    {
        "Title": "Apple Patches Major Security Flaws in iOS, macOS Platforms",
        "Link": "https://www.securityweek.com/apple-patches-major-security-flaws-in-ios-macos-platforms/",
        "Summary": "<p>Apple rolls out iOS and macOS platform updates to fix serious security bugs that could be triggered simply by opening an image or video file.</p>\n<p>The post <a href=\"https://www.securityweek.com/apple-patches-major-security-flaws-in-ios-macos-platforms/\">Apple Patches Major Security Flaws in iOS, macOS Platforms</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/apple-patches-major-security-flaws-in-ios-macos-platforms/"
    },
    {
        "Title": "Security Firm Andy Frain Says 100,000 People Impacted by Ransomware Attack",
        "Link": "https://www.securityweek.com/security-firm-andy-frain-says-100000-people-impacted-by-ransomware-attack/",
        "Summary": "<p>Andy Frain was targeted by the Black Basta ransomware group in 2024 and the hackers have stolen a wide range of information.</p>\n<p>The post <a href=\"https://www.securityweek.com/security-firm-andy-frain-says-100000-people-impacted-by-ransomware-attack/\">Security Firm Andy Frain Says 100,000 People Impacted by Ransomware Attack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/security-firm-andy-frain-says-100000-people-impacted-by-ransomware-attack/"
    },
    {
        "Title": "Google Agrees to $1.3 Billion Settlement in Texas Privacy Lawsuits",
        "Link": "https://www.securityweek.com/google-agrees-to-1-3-billion-settlement-in-texas-privacy-lawsuits/",
        "Summary": "<p>Google has agreed to a $1.375 billion settlement with Texas in lawsuits over location and private browsing tracking, and biometric data collection.</p>\n<p>The post <a href=\"https://www.securityweek.com/google-agrees-to-1-3-billion-settlement-in-texas-privacy-lawsuits/\">Google Agrees to $1.3 Billion Settlement in Texas Privacy Lawsuits</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/google-agrees-to-1-3-billion-settlement-in-texas-privacy-lawsuits/"
    },
    {
        "Title": "437,000 Impacted by Ascension Health Data Breach",
        "Link": "https://www.securityweek.com/437000-impacted-by-ascension-health-data-breach/",
        "Summary": "<p>Ascension Health has notified the HHS that more than 437,000 people were affected by a recently disclosed data breach.</p>\n<p>The post <a href=\"https://www.securityweek.com/437000-impacted-by-ascension-health-data-breach/\">437,000 Impacted by Ascension Health Data Breach</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/437000-impacted-by-ascension-health-data-breach/"
    },
    {
        "Title": "Asus DriverHub Vulnerabilities Expose Users to Remote Code Execution Attacks",
        "Link": "https://www.securityweek.com/asus-driverhub-vulnerabilities-expose-users-to-remote-code-execution-attacks/",
        "Summary": "<p>Two vulnerabilities in ASUS’s pre-installed software DriverHub can be exploited for remote code execution.</p>\n<p>The post <a href=\"https://www.securityweek.com/asus-driverhub-vulnerabilities-expose-users-to-remote-code-execution-attacks/\">Asus DriverHub Vulnerabilities Expose Users to Remote Code Execution Attacks</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/asus-driverhub-vulnerabilities-expose-users-to-remote-code-execution-attacks/"
    },
    {
        "Title": "US Deportation Airline GlobalX Confirms Hack",
        "Link": "https://www.securityweek.com/us-deportation-airline-globalx-confirms-hack/",
        "Summary": "<p>Global Crossing Airlines is investigating a cybersecurity incident after Anonymous hackers targeted its systems.</p>\n<p>The post <a href=\"https://www.securityweek.com/us-deportation-airline-globalx-confirms-hack/\">US Deportation Airline GlobalX Confirms Hack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/us-deportation-airline-globalx-confirms-hack/"
    },
    {
        "Title": "German Authorities Take Down Crypto Swapping Service eXch",
        "Link": "https://www.securityweek.com/german-authorities-take-down-crypto-swapping-service-exch/",
        "Summary": "<p>German authorities seized the servers of crypto-swapping service eXch for laundering approximately $1.9 billion in fraudulent assets.</p>\n<p>The post <a href=\"https://www.securityweek.com/german-authorities-take-down-crypto-swapping-service-exch/\">German Authorities Take Down Crypto Swapping Service eXch</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/german-authorities-take-down-crypto-swapping-service-exch/"
    },
    {
        "Title": "US Announces Botnet Takedown, Charges Against Russian Administrators",
        "Link": "https://www.securityweek.com/us-announces-botnet-takedown-charges-against-russian-administrators/",
        "Summary": "<p>Anyproxy and 5socks, websites offering proxy services through devices ensnared by a botnet, have been disrupted in a law enforcement operation.</p>\n<p>The post <a href=\"https://www.securityweek.com/us-announces-botnet-takedown-charges-against-russian-administrators/\">US Announces Botnet Takedown, Charges Against Russian Administrators</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-12",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/us-announces-botnet-takedown-charges-against-russian-administrators/"
    },
    {
        "Title": "Allegedly Stolen Data from Brazilian Nuclear Company Nuclep Offered for Sale",
        "Link": "https://dailydarkweb.net/allegedly-stolen-data-from-brazilian-nuclear-company-nuclep-offered-for-sale/",
        "Summary": "<p>Sensitive data purportedly belonging to NUCLEP, a Brazilian state-owned company specializing in nuclear engineering and heavy equipment for the nuclear, defense, oil, and gas industries, is allegedly being offered for sale online. The dataset is claimed to contain highly sensitive information, including: Defense manufacturing details Nuclear manufacturing and mining information Military nuclear data Submarines-related files [&#8230;]</p>\n<p>The post <a href=\"https://dailydarkweb.net/allegedly-stolen-data-from-brazilian-nuclear-company-nuclep-offered-for-sale/\">Allegedly Stolen Data from Brazilian Nuclear Company Nuclep Offered for Sale</a> appeared first on <a href=\"https://dailydarkweb.net\">Daily Dark Web</a>.</p>",
        "Date": "2025-05-12",
        "Content": "Sensitive data purportedly belonging to NUCLEP, a Brazilian state-owned company specializing in nuclear engineering and heavy equipment for the nuclear, defense, oil, and gas industries, is allegedly being offered for sale online.\nThe dataset is claimed to contain highly sensitive information, including:\nDefense manufacturing details\nNuclear manufacturing and mining information\nMilitary nuclear data\nSubmarines-related files\nAutoCAD schematics (3D, dwg, etc.)\nVideos and images related to uranium mining\nOil and gas industry information\nCoordinates\nEmployee details (email, password, name, etc.)\nThe price for this alleged data is listed as $1500. The claims and the authenticity of the data are yet to be independently verified.\nTags:\nBrazil\ncybercrime\ndata-breach\nDefense Industry\nNuclear Industry\nNuclep\nOil and Gas\nsensitive-data"
    }
]