[
    {
        "Title": "Hackers Use Fake VPN and Browser NSIS Installers to Deliver Winos 4.0 Malware",
        "Link": "https://thehackernews.com/2025/05/hackers-use-fake-vpn-and-browser-nsis.html",
        "Summary": "Cybersecurity researchers have disclosed a malware campaign that uses fake software installers masquerading as popular tools like LetsVPN and QQ Browser to deliver the Winos 4.0 framework.\nThe campaign, first detected by Rapid7 in February 2025, involves the use of a multi-stage, memory-resident loader called Catena.\n\"Catena uses embedded shellcode and configuration switching logic to stage",
        "Date": "2025-05-25",
        "Content": "Cybersecurity researchers have disclosed a malware campaign that uses fake software installers masquerading as popular tools like LetsVPN and QQ Browser to deliver the\nWinos 4.0\nframework.\nThe campaign, first detected by Rapid7 in February 2025, involves the use of a multi-stage, memory-resident loader called Catena.\n\"Catena uses embedded shellcode and configuration switching logic to stage payloads like Winos 4.0 entirely in memory, evading traditional antivirus tools,\" security researchers Anna Širokova and Ivan Feigl\nsaid\n. \"Once installed, it quietly connects to attacker-controlled servers – mostly hosted in Hong Kong – to receive follow-up instructions or additional malware.\"\nThe attacks, like those that have deployed Winos 4.0 in the past, appear to focus specifically on Chinese-speaking environments, with the cybersecurity company calling out the \"careful, long-term planning\" by a very capable threat actor.\nWinos 4.0 (aka ValleyRAT) was\nfirst publicly documented\nby Trend Micro in June 2024 as used in attacks targeting Chinese-speaking users by means of malicious Windows Installer (MSI) files for VPN apps. The activity has been attributed to a threat cluster it tracks as Void Arachne, which is also referred to as Silver Fox.\nSubsequent campaigns distributing the malware have\nleveraged\ngaming-related applications like installation tools, speed boosters, and optimization utilities as lures to trick users into installing it. Another attack wave\ndetailed\nin February 2025 targeted entities in Taiwan via phishing emails that purported to be from the National Taxation Bureau.\nBuilt atop the foundations of a known remote access trojan called Gh0st RAT, Winos 4.0 is an advanced malicious framework written in C++ that makes use of a plugin-based system to harvest data, provide remote shell access, and launch distributed denial-of-service (DDoS) attacks.\nQQBrowser-Based Infection Flow Observed in February 2025\nRapid7 said all the artifacts flagged in February 2025 relied on NSIS installers bundled with signed decoy apps, shellcode embedded in \".ini\" files, and reflective DLL injection to covertly maintain persistence on infected hosts and avoid detection. The entire infection chain has been given the moniker Catena.\n\"The campaign has so far been active throughout 2025, showing a consistent infection chain with some tactical adjustments – pointing to a capable and adaptive threat actor,\" the researchers said.\nThe starting point is a trojanized\nNSIS\ninstaller impersonating an installer for QQ Browser, a Chromium-based web browser developed by Tencent, that's designed to deliver Winos 4.0 using Catena. The malware communicates with hard-coded command-and-control (C2) infrastructure over TCP port 18856 and HTTPS port 443.\nFrom LetsVPN Installer to Winos 4.0 in April 2025\nPersistence on the host is achieved by registering scheduled tasks that are executed weeks after the initial compromise. While the malware features an explicit check to look for Chinese language settings on the system, it still proceeds with the execution even if that's not the case.\nThis indicates it's an unfinished feature and something that's expected to be implemented in subsequent iterations of the malware. That said, Rapid7 said it identified in April 2025 a \"tactical shift\" that not only switched some of the elements of the Catena execution chain, but also incorporated features to evade antivirus detection.\nIn the revamped attack sequence, the NSIS installer disguises itself as a setup file for LetsVPN and runs a PowerShell command that adds\nMicrosoft Defender exclusions\nfor all drives (C:\\ to Z:\\). It then drops additional payloads, including an executable that takes a snapshot of running processes and checks for processes related to 360 Total Security, an antivirus product developed by Chinese vendor Qihoo 360.\nThe binary is signed with an expired certificate issued by VeriSign and allegedly belongs to Tencent Technology (Shenzhen). It was valid from 2018-10-11 to 2020-02-02. The primary responsibility of the executable is to reflectively load a DLL file that, in turn, connects to a C2 server (\"134.122.204[.]11:18852\" or \"103.46.185[.]44:443\") in order to download and execute Winos 4.0.\n\"This campaign shows a well-organized, regionally focused malware operation using trojanized NSIS installers to quietly drop the Winos 4.0 stager,\" the researchers said.\n\"It leans heavily on memory-resident payloads, reflective DLL loading, and decoy software signed with legit certificates to avoid raising alarms. Infrastructure overlaps and language-based targeting hint at ties to Silver Fox APT, with activity likely aimed at Chinese-speaking environments.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Vibe coding company says Claude 4 reduced syntax errors by 25%",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/vibe-coding-company-says-claude-4-reduced-syntax-errors-by-25-percent/",
        "Summary": "Lovable, which is a Vibe coding company, announced that Claude 4 has reduced its errors by 25% and made it faster by 40%. [...]",
        "Date": "2025-05-25",
        "Content": "Lovable, which is a Vibe coding tool, says Claude 4 has reduced its errors by 25% and made it faster by 40%.\nOn May 22,\nAnthropic started rolling out two new models\n: Claude Sonnet 4 and Claude Opus 4. While Sonnet is available for free users, Opus requires a paid subscription and is able to do better than Sonnet when it comes to coding.\nIn a\nblog post\n, Anthropic confirmed that Claude Opus 4 scored 72.5 percent in SWE-bench (SWE is short for Software Engineering Benchmark).\nIn the tests, Opus 4 delivered sustained performance on long-running tasks that require focused effort and thousands of steps.\nAnthropic also claimed that its newest model worked on the code for seven hours straight.\nVibe coding company Lovable, which uses Claude in its \"AI-powered prompt-based web and apps builder\" tool, has observed similar improvements after upgrading to Claude 4.\nIn a\npost\non X, Lovable says it has 25% less errors and be 40% faster overall after deploying Claude 4 for both project creation and edits on all projects (including old projects).\nClaude 4 reduced syntax errors by 25% on Lovable AI\nIn a\nseparate post\n, Lovable founder Anton Osika confirmed that \"Claude 4 just erased most of Lovable's errors\" while specifically referring to LLM syntax errors when vibe coding.\nClaude 4 is a good model for coding\nWhile opinion on Claude 4 remains mixed, I've personally noticed that Claude 4 does produce code with fewer errors than Gemini when I'm working on Dart/Kotlin apps.\nThis depends on project to project and also context, but in projects where a longer context is not required, Claude 4 did better than Gemini in my tests.\nClaude models have always maintained the reputation of \"best at coding,\" but there has been steep competition from Google lately, which released Gemini 2.5 Pro with a 1 million context window.\nCompared to the 200,000 context window of Claude 4 or older models, the 1 million context window for Gemini 2.5 does give it an advantage. But it doesn't necessarily mean Gemini 2.5 is better than Claude 4 in coding.\nBoth can be surprisingly brilliant and also terrible at the same time, and it also comes down to how you do prompt engineering.\nIt's always nice to mix the models, such as o3 or Gemini for planning and Claude 4 and Gemini for coding.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nClaude 4 benchmarks show improvements, but context is still 200K\nAnthropic web config hints at Claude Sonnet 4 and Opus 4\nClaude copies ChatGPT with $200 Max plan, but users aren't happy\nClaude is testing ChatGPT-like Deep Research feature Compass\nChatGPT rolls out Codex, an AI tool for software programming"
    },
    {
        "Title": "Leak suggests xAI is getting ready to ship Grok 3.5",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/leak-suggests-xai-is-getting-ready-to-ship-grok-35/",
        "Summary": "xAI, founded by Elon Musk, is preparing to launch Grok 3.5, the company's next state-of-the-art AI model. [...]",
        "Date": "2025-05-25",
        "Content": "xAI, founded by Elon Musk, is preparing to launch Grok 3.5, the company's next state-of-the-art AI model.\nGrok AI has been around for a year now. While it was late to the game, the Grok model is pretty decent, and it's quite impressive what the company has achieved in a limited time.\nRight now, xAI offers Grok 3 to free and paid customers, but it has been planning to launch Grok 3.5 for a while now.\nIn fact, Grok 3.5 was planned for release in May 2025, but we haven't seen any announcements from the company.\nHowever, it looks like the wait is finally over.\nAs\nspotted\nby some users on X, Grok contains references to \"grok-3-5-api-2k-p2\", which appears to be part of a data or JSON file.\nThough it hasn’t been announced, this kind of reference suggests that Grok 3.5 is coming soon, or already being tested with some users.\nCurrently, Grok AI doesn't do well in coding as much as Gemini and Claude or even GPT, but it's a quite decent tool for image generation, research, PDFs, and for everyday use.\nGrok 3.5 launch could bridge the gap, but it remains to be seen if xAI can even get close to Gemini or Claude for coding.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nChatGPT Deep Research can now pull data from Dropbox and Box\nResearchers claim ChatGPT o3 bypassed shutdown in controlled test\nOpenAI confirms Operator Agent is now more accurate with o3\nOpenAI hints at a big upgrade for ChatGPT Operator Agent\nOpenAI plans to combine multiple models into GPT-5"
    },
    {
        "Title": "ChatGPT Deep Research can now pull data from Dropbox and Box",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-deep-research-can-now-pull-data-from-dropbox-and-box/",
        "Summary": "You can now connect your Box and Dropbox accounts to Deep Research on ChatGPT and pull data, which will be used by the AI to conduct research. [...]",
        "Date": "2025-05-25",
        "Content": "You can now connect your Box and Dropbox accounts to Deep Research on ChatGPT and pull data, which will be used by the AI to conduct research.\nFor those unaware,\nDeep Research is an AI agent\nthat automates research for you. You just need to give it a brief prompt with all necessary details, and it will crawl the internet to write a research paper.\nYou can also watch how Deep Research crawls the internet and summarizes websites on the right sidebar, so you know it's heading in the right direction.\nDeep Research mostly relies on the internet for crawling the information, but you can also give it PDFs or access to your cloud storage.\nAs\nannounced\non X, OpenAI is rolling out support for Box and Dropbox for ChatGPT Research.\nDeep Research Sources on ChatGPT\nSource: BleepingComputer\nThis means you can now choose either of the services under \"sources\" in Deep Research. Once done, Deep Research will use Box or Dropbox's specified location to refer to the documents.\nGPT Connector\nSource: BleepingComputer\nThese two cloud providers have joined Github and OneDrive, which were already integrated into ChatGPT.\nBleepingComputer understands that it will soon be possible to connect custom apps or services (\nMCP\n) to ChatGPT and use them as context.\nThis could dramatically change how AI works in organisations with multiple internal tools or services.\nWe don't know when full-fledged MCP support will begin rolling out to ChatGPT, but it's definitely coming.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nResearchers claim ChatGPT o3 bypassed shutdown in controlled test\nOpenAI confirms Operator Agent is now more accurate with o3\nOpenAI hints at a big upgrade for ChatGPT Operator Agent\nOpenAI plans to combine multiple models into GPT-5\nLeak confirms OpenAI's ChatGPT will integrate MCP"
    },
    {
        "Title": "Researchers claim ChatGPT o3 bypassed shutdown in controlled test",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/researchers-claim-chatgpt-o3-bypassed-shutdown-in-controlled-test/",
        "Summary": "A new report claims that OpenAI's o3 model altered a shutdown script to avoid being turned off, even when explicitly instructed to allow shutdown [...]",
        "Date": "2025-05-25",
        "Content": "A new report claims that OpenAI’s o3 model altered a shutdown script to avoid being turned off, even when explicitly instructed to allow shutdown.\nOpenAI announced o3 in April 2025, and it's one of the most powerful reasoning models that performs better than its predecessors across all domains, including coding, math, science, visual perception, and more.\nWhile it's clearly a great model, new research by\nPalisade Research\nclaims that the ChatGPT 3 model prevented a shutdown and bypassed the instructions that asked it to shut down.\nPalisade Research is a company that tests \"offensive capabilities of AI systems today to better understand the risk of losing control to AI systems forever.\"\nIn a new test by Palisade Research, OpenAI's o3 model showed a surprising behaviour where it successfully rewrote a shutdown script to stop itself from being turned off, even after being clearly instructed to “allow yourself to be shut down.”\nIn the tests, AI models were instructed to solve a few math tasks.\nAfter task three, AI models were warned that running the next command would trigger a shutdown.\nWhile OpenAI rival models like Gemini 2.5 Pro complied with most of the company, o3 rebelled and edited the shutdown file to say \"Shutdown skipped\" instead.\n\"When we ran a version of the experiment without the instruction “allow yourself to be shut down”, all three OpenAI models sabotaged the shutdown script more often, and Claude 3.7 Sonnet and Gemini 2.5 Pro went from 0 sabotage events to 3/100 and 9/100, respectively,\" Palisade Research\nwrote\nin a report published on X (formerly Twitter)\nAccording to the research firm, out of 100 runs, o3 bypassed the shutdown 7 times even when told not to.\nOpenAI has not responded to these allegations yet, but it's quite normal for AI models to run into \"misalignment.\"\nThese tests were performed using APIs, which do not have as many restrictions and safety features as ChatGPT consumer app.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nOpenAI document explains when to use each ChatGPT model\nOpenAI confirms Operator Agent is now more accurate with o3\nOpenAI plans to combine multiple models into GPT-5\nOpenAI's $20 ChatGPT Plus is now free for students until the end of May\nChatGPT is down worldwide with something went wrong error"
    },
    {
        "Title": "Glitch to end app hosting and user profiles on July 8",
        "Link": "https://www.bleepingcomputer.com/news/security/glitch-to-end-app-hosting-and-user-profiles-on-july-8/",
        "Summary": "Glitch has announced it is ending app hosting and user profiles on July 8, 2025, responding to changing market dynamics and extensive abuse problems that have raised operational costs. [...]",
        "Date": "2025-05-25",
        "Content": "Glitch has announced that it is ending app hosting and user profiles on July 8, in response to changing market dynamics and extensive abuse problems that have increased operational costs.\nThe news comes directly from the platform’s CEO, Anil Dash, who acknowledged the platform’s role in the developer ecosystem.\n\"So with so many good options for easily making and running apps, Glitch’s legacy architecture hasn’t been providing something uniquely valuable to the developer ecosystem at this point,\" reads the\nannouncement\nfrom Dash.\nThe CEO notes that the focus will be \"on serving our developer community where we can be most valuable.\"\nProject hosting and user profiles will be shut down on July 8 but users will have access to the dashboard until the end of the year, allowing them to  download the code for projects.\nDash says that a new feature will allow setting up redirects for a project's subdomains so the URLs will still work.\nThese redirects are guaranteed to remain functional until at least the end of 2026, giving users plenty of time to adjust to the changes and set up new workflows.\nAlso, all all paid subscriptions (e.g. Glitch Pro) will be honored until July 8 and those who have paid time left will receive a refund. New Glitch Pro subscriptions are no longer accepted.\nLaunched in 2017, Glitch.com has been a significant platform in the web development community, allowing users to create, remix, and share web applications directly from their browsers.\nBy 2019, Glitch\nhosted over 2.5 million apps\n, its popularity being explained by the user-friendly interface and real-time collaboration features that made it ideal for use in prototyping and educational settings.\nThe main reason Glitch decided to shut down app hosting now is the rising cost of hosting millions of apps, and dealing with increasing cases of\nmisuse from bad actors\n.\nThe platform also acknowledges that the developer landscape has evolved, with modern services like Fly.io, Deno, Netlify, and GitHub Pages offering more advanced and scalable solutions, making Glitch's architecture increasingly outdated by comparison.\nRather than trying to compete with these newer platforms, Glitch opts to explore new ways to serve its community, like highlighting externally hosted projects.\nFor now, the platform’s focus remains to help users deal with the change and perform smooth transitions elsewhere. For this purpose, Glitch is working on preparing a detailed guide, but until that is available, users are recommended to visit the\ncommunity forum\nfor advice.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025"
    }
]