[
    {
        "Title": "38,000+ FreeDrain Subdomains Found Exploiting SEO to Steal Crypto Wallet Seed Phrases",
        "Link": "https://thehackernews.com/2025/05/38000-freedrain-subdomains-found.html",
        "Summary": "Cybersecurity researchers have exposed what they say is an \"industrial-scale, global cryptocurrency phishing operation\" engineered to steal digital assets from cryptocurrency wallets for several years.\nThe campaign has been codenamed FreeDrain by threat intelligence firms SentinelOne and Validin.\n\"FreeDrain uses SEO manipulation, free-tier web services (like gitbook.io, webflow.io, and github.io",
        "Date": "2025-05-08",
        "Content": "Cybersecurity researchers have exposed what they say is an \"industrial-scale, global cryptocurrency phishing operation\" engineered to steal digital assets from cryptocurrency wallets for several years.\nThe campaign has been codenamed\nFreeDrain\nby threat intelligence firms\nSentinelOne\nand\nValidin\n.\n\"FreeDrain uses SEO manipulation, free-tier web services (like gitbook.io, webflow.io, and github.io), and layered redirection techniques to target cryptocurrency wallets,\" security researchers Kenneth Kinion, Sreekar Madabushi, and Tom Hegel said in a technical report shared with The Hacker News.\n\"Victims search for wallet-related queries, click on high-ranking malicious results, land on lure pages, and are redirected to phishing pages that steal their seed phrases.\"\nThe scale of the\ncampaign\nis reflected in the fact that over 38,000 distinct FreeDrain sub-domains hosting lure pages have been identified. These pages are hosted on cloud infrastructure like Amazon S3 and Azure Web Apps, and mimic legitimate cryptocurrency wallet interfaces.\nThe activity has been attributed with high confidence to individuals based in the Indian Standard Time (IST) time zone, working standard weekday hours, citing patterns of GitHub commits associated with the lure pages.\nThe attacks have been found to target users searching for wallet-related queries like \"Trezor wallet balance\" on search engines like Google, Bing, and DuckDuckGo, redirecting them to bogus landing pages hosted on gitbook.io, webflow.io, and github.io.\nUnsuspecting users who land on these pages are served a static screenshot of the legitimate wallet interface, clicking which, one of the below three behaviors happen -\nRedirect the user to legitimate websites\nRedirect the user to other intermediary sites\nDirect the user to a lookalike phishing page that prompts them to enter their seed phrase, effectively draining their wallets\n\"The entire flow is frictionless by design, blending SEO manipulation, familiar visual elements, and platform trust to lull victims into a false sense of legitimacy,\" the researchers said. \"And once a seed phrase is submitted, the attacker's automated infrastructure will drain funds within minutes.\"\nIt is believed that the textual content used in these decoy pages is generated using large language models like OpenAI GPT-4o, indicative of how threat actors are abusing generative artificial intelligence (GenAI) tools to produce content at scale.\nFreeDrain has also been observed resorting to flooding poorly-maintained websites with thousands of spammy comments to boost the visibility of their lure pages via search engine indexing, a technique called\nspamdexing\nthat's often used to game SEO.\nIt's worth pointing out that\nsome\naspects\nof the campaign have been documented by Netskope Threat Labs since August 2022 and as\nrecently\nas October 2024, when the threat actors were found utilizing Webflow to spin up phishing sites masquerading as Coinbase, MetaMask, Phantom, Trezor, and Bitbuy.\n\"FreeDrain's reliance on free-tier platforms is not unique, and without better safeguards, these services will continue to be weaponized at scale,\" the researchers noted.\n\"The FreeDrain network represents a modern blueprint for scalable phishing operations, one that thrives on free-tier platforms, evades traditional abuse detection methods, and adapts rapidly to infrastructure takedowns. By abusing dozens of legitimate services to host content, distribute lure pages, and route victims, FreeDrain has built a resilient ecosystem that's difficult to disrupt and easy to rebuild.\"\nThe disclosure comes as Check Point Research said it uncovered a sophisticated phishing campaign that abuses Discord and singles out cryptocurrency users in order to steal their funds using a Drainer-as-a-Service (DaaS) tool called\nInferno Drainer\n.\nThe attacks entice victims into joining a malicious Discord server by hijacking expired vanity invite links, while also taking advantage of Discord OAuth2 authentication flow to evade automated detection of their malicious websites.\nBreakdown of total domains into suspected and confirmed URLs by quantity.\nBetween September 2024 and March 2025, more than 30,000 unique wallets are estimated to have been victimized by Inferno Drainer, leading to at least $9 million in losses.\nInferno Drainer\nclaimed\nto have shut down its operations in November 2023. But the latest findings reveal that the crypto drainer remains active, employing single-use smart contracts and on-chain encrypted configurations to make detection more challenging.\n\"Attackers redirect users from a legitimate Web3 website to a fake\nCollab.Land bot\nand then to a phishing site, tricking them into signing malicious transactions,\" the company\nsaid\n. \"The drainer script deployed on that site was directly linked to Inferno Drainer.\"\n\"Inferno Drainer employs advanced anti-detection tactics — including single-use and short-lived smart contracts, on-chain encrypted configurations, and proxy-based communication — successfully bypassing wallet security mechanisms and anti-phishing blacklists.\"\nThe findings also follow the discovery of a malvertising campaign that leverages Facebook ads that impersonate trusted cryptocurrency exchanges and trading platforms like Binance, Bybit, and TradingView to lead users to sketchy websites instructing them to download a desktop client.\n\"Query parameters related to Facebook Ads are used to detect legitimate victims, while suspicious or automated analysis environments receive benign content,\" Bitdefender\nsaid\nin a report shared with the publication.\n\"If the site detects suspicious conditions (e.g., missing ad-tracking parameters or an environment typical of automated security analysis), it displays harmless, unrelated content instead.\"\nThe installer, once launched, displays the login page of the impersonated entity through msedge_proxy.exe to keep up the ruse, while additional payloads are silently executed in the background to harvest system information, or execute a sleep command for \"hundreds of hours on end\" if the exfiltrated data indicates a sandboxing environment.\nThe Romanian cybersecurity company said hundreds of Facebook accounts have advertised these malware-delivering pages mainly targeting men over 18 years in Bulgaria and Slovakia.\n\"This campaign showcases a hybrid approach, merging front-end deception and a localhost-based malware service,\" it added. \"By dynamically adjusting to the victim's environment and continuously updating payloads, the threat actors maintain a resilient, highly evasive operation.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Security Tools Alone Don't Protect You — Control Effectiveness Does",
        "Link": "https://thehackernews.com/2025/05/security-tools-alone-dont-protect-you.html",
        "Summary": "61% of security leaders reported suffering a breach due to failed or misconfigured controls over the past 12 months. This is despite having an average of 43 cybersecurity tools in place.\nThis massive rate of security failure is clearly not a security investment problem. It is a configuration problem. Organizations are beginning to understand that a security control installed or deployed is not",
        "Date": "2025-05-08",
        "Content": "61% of security leaders reported suffering a breach due to failed or misconfigured controls over the past 12 months. This is despite having an average of 43 cybersecurity tools in place.\nThis massive rate of security failure is clearly not a security investment problem. It is a configuration problem. Organizations are beginning to understand that a security control installed or deployed is not necessarily a security control configured to defend against real-world threats.\nThe recent\nGartner® Report\n,\nReduce Threat Exposure With Security Controls Optimization, addresses the gap between intention and outcome. We feel it discusses a hard truth: without continuous validation and tuning, security tools deliver a false sense of, well, security.\nIn this article, we'll take a deep dive into why control effectiveness should be the new benchmark for cybersecurity success, and how organizations can make this shift.\nThe Myth of Tool Coverage\nBuying more tools has long been considered the key to cybersecurity performance. Yet the facts tell a different story. According to the Gartner report, \"misconfiguration of technical security controls is a leading cause for the continued success of attacks.\"\nMany organizations have impressive inventories of firewalls, endpoint solutions, identity tools, SIEMs, and other controls. Yet breaches continue because these tools are often misconfigured, poorly integrated, or disconnected from actual business risks.\nFor example, in the\n2024 breach at Blue Shield of California\n, a website misconfiguration led to personal data from 4.7 million members leaking via Google Ads. This failure revealed how even everyday tools, if incorrectly deployed or configured, can undermine organizational security and compliance.\nYet closing the gap between the presence of security tools and their efficacy requires a fundamental shift in thinking, and an even more fundamental shift in practice.\nMaking the Organizational Shift to Control Effectiveness\nMoving toward true control effectiveness takes more than just a few technical tweaks. It requires a real shift - in mindset, in day-to-day practice, and in how teams across the organization work together. Success depends on stronger partnerships between security teams, asset owners, IT operations, and business leaders. Asset owners, in particular, bring critical knowledge to the table - how their systems are built, where the sensitive data lives, and which processes are too important to fail.\nSupporting this collaboration also means rethinking how we train teams. Security professionals need more than technical skills - they need a deeper understanding of the assets they're protecting, the business goals those assets support, and the real-world threats that could impact them.\nAnd it's not just about better teamwork or better training. Organizations also need better ways to measure whether their controls are actually doing the job. That's where outcome-driven metrics (ODMs) and protection-level agreements (PLAs) come in. ODMs show how quickly misconfigurations are fixed and how reliably true threats are detected. PLAs set clear expectations for how defenses should perform against specific risks.\nTogether, these measurements move security from a matter of trust to a matter of proof. They help organizations build resilience that they can measure, manage, and improve over time.\nContinuous Optimization Is the New Normal\nMeasuring security effectiveness is a critical first step — but maintaining it is where the real challenge begins. Security controls aren't static. They need regular tuning to stay effective as threats evolve and businesses change. As Gartner states, \"optimal configuration of technical security controls is a moving target, not a set-and-forget or a default setting.\"\nTeams that treat configuration as a one-off project are setting themselves up to fall behind. New vulnerabilities emerge, attackers shift their tactics, and cloud environments evolve faster than any annual audit can keep up with. In this environment, patching systems once a quarter or reviewing settings once a year simply isn't enough.\nContinuous optimization\nhas to become part of the day-to-day.\nThat means making it a habit to step back and ask the tough questions: Are our controls still protecting what matters most? Are our detection rules tuned to the threats we're facing today? Are our compensating measures still closing the right gaps — or have they drifted out of sync?\nKeeping defenses sharp isn't just about applying technical updates. It's about integrating real-world threat intelligence, reassessing risk priorities, and making sure operational processes are strengthening security - not introducing new weaknesses. Security effectiveness isn't a box you check once. It's something you build, test, and refine - over and over again.\nBuilding for Effectiveness: What Needs to Change\nMaking security controls truly effective demands a broader shift in how organizations think and work. Security optimization must be embedded into how systems are designed, operated, and maintained - not treated as a separate function.\nGartner notes that \"no security team can be fully effective in isolation.\" In XM Cyber's view, this means security needs to become a team sport. Organizations need to build cross-functional teams that bring together security engineers, IT operations, asset owners, and business stakeholders. Effective optimization depends on understanding not just how controls work, but what they are protecting, how those systems behave, and where the real business risks lie.\nAligning security control efforts with a broader Continuous Exposure Management program also helps build a repeatable, structured way to improve over time. Instead of reacting to gaps after a breach, organizations can proactively identify weaknesses, fine-tune controls, and measure progress against real risk reduction - not just theoretical coverage. (Want to learn more about how to build a Continuous Exposure Management platform? Read our guide\nhere\n!)\nThe Bottom Line\nSecurity has never been about simply having the right tools. It is about understanding whether those tools are ready for the threats that matter most. Closing the gap between control presence and control effectiveness demands more than technical fixes. It requires a change in how organizations think, work, and measure success.\nIn our opinion, this new research from Gartner makes the message clear: static defenses will not keep pace with dynamic risks. Organizations that embrace continuous optimization - tuning controls, validating performance, and aligning security with real business priorities - will be the ones that stay resilient.\nStanding still is falling behind, at least where cybersecurity is concerned. The future belongs to organizations that treat security as a living system - measured, tuned, and proven every day.\nNote:\nThis article was expertly written and contributed by Dale Fairbrother, Director of Product Marketing at XM Cyber.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "SonicWall Patches 3 Flaws in SMA 100 Devices Allowing Attackers to Run Code as Root",
        "Link": "https://thehackernews.com/2025/05/sonicwall-patches-3-flaws-in-sma-100.html",
        "Summary": "SonicWall has released patches to address three security flaws affecting SMA 100 Secure Mobile Access (SMA) appliances that could be fashioned to result in remote code execution.\nThe vulnerabilities are listed below -\n\nCVE-2025-32819 (CVSS score: 8.8) - A vulnerability in SMA100 allows a remote authenticated attacker with SSL-VPN user privileges to bypass the path traversal checks and delete an",
        "Date": "2025-05-08",
        "Content": "SonicWall has\nreleased\npatches to address three security flaws affecting SMA 100 Secure Mobile Access (SMA) appliances that could be fashioned to result in remote code execution.\nThe vulnerabilities are listed below -\nCVE-2025-32819\n(CVSS score: 8.8) - A vulnerability in SMA100 allows a remote authenticated attacker with SSL-VPN user privileges to bypass the path traversal checks and delete an arbitrary file potentially resulting in a reboot to factory default settings.\nCVE-2025-32820\n(CVSS score: 8.3) - A vulnerability in SMA100 allows a remote authenticated attacker with SSL-VPN user privileges can inject a path traversal sequence to make any directory on the SMA appliance writable\nCVE-2025-32821\n(CVSS score: 6.7) - A vulnerability in SMA100 allows a remote authenticated attacker with SSL-VPN admin privileges can with admin privileges can inject shell command arguments to upload a file on the appliance\n\"An attacker with access to an SMA SSL-VPN user account can chain these vulnerabilities to make a sensitive system directory writable, elevate their privileges to SMA administrator, and write an executable file to a system directory,\" Rapid7\nsaid\nin a report. \"This chain results in root-level remote code execution.\"\nCVE-2025-32819 is assessed to be a patch bypass for a\npreviously identified flaw\nreported by NCC Group in\nDecember 2021\n.\nThe cybersecurity company noted that CVE-2025-32819 may have been exploited in the wild as a zero-day based on known indicators of compromise (IoCs) and incident response investigations. However, it's worth noting that SonicWall makes no mention of the flaw being weaponized in real-world attacks.\nThe shortcomings, that impact SMA 100 Series including SMA 200, 210, 400, 410, 500v, have been addressed in version 10.2.1.15-81sv.\nThe development comes as\nmultiple security flaws\nin SMA 100 Series devices have come under active exploitation in recent weeks, including CVE-2021-20035, CVE-2023-44221, and CVE-2024-38475. Users are advised to update their instances to the latest version for optimal protection.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Qilin Ransomware Ranked Highest in April 2025 with Over 45 Data Leak Disclosures",
        "Link": "https://thehackernews.com/2025/05/qilin-leads-april-2025-ransomware-spike.html",
        "Summary": "Threat actors with ties to the Qilin ransomware family have leveraged malware known as SmokeLoader along with a previously undocumented .NET compiled loader codenamed NETXLOADER as part of a campaign observed in November 2024.\n\"NETXLOADER is a new .NET-based loader that plays a critical role in cyber attacks,\" Trend Micro researchers Jacob Santos, Raymart Yambot, John Rainier Navato, Sarah Pearl",
        "Date": "2025-05-08",
        "Content": "Threat actors with ties to the\nQilin\nransomware\nfamily have leveraged malware known as\nSmokeLoader\nalong with a previously undocumented .NET compiled loader codenamed NETXLOADER as part of a campaign observed in November 2024.\n\"NETXLOADER is a new .NET-based loader that plays a critical role in cyber attacks,\" Trend Micro researchers Jacob Santos, Raymart Yambot, John Rainier Navato, Sarah Pearl Camiling, and Neljorn Nathaniel Aguas\nsaid\nin a Wednesday analysis.\n\"While hidden, it stealthily deploys additional malicious payloads, such as Agenda ransomware and SmokeLoader. Protected by .NET Reactor 6, NETXLOADER is difficult to analyze.\"\nQilin\n, also called Agenda, has been an\nactive ransomware threat\nsince it surfaced in the threat landscape in July 2022. Last year, cybersecurity company Halcyon discovered an improved version of the ransomware that it named Qilin.B.\nRecent data shared by Group-IB shows that disclosures on Qilin's data leak site have more than doubled since February 2025, making it the\ntop ransomware group\nfor April, surpassing other players like Akira, Play, and Lynx.\n\"From July 2024 to January 2025, Qilin's affiliates did not disclose more than 23 companies per month,\" the Singaporean cybersecurity company\nsaid\nlate last month. \"However, [...] since February 2025 the amount of disclosures have significantly increased, with 48 in February, 44 in March and 45 in the first weeks of April.\"\nQilin is also said to have benefited from an influx of affiliates following RansomHub's abrupt shutdown at the start of last month. According to Flashpoint, RansomHub was the\nsecond-most active ransomware group\nin 2024, claiming\n38 victims\nin the financial sector between April 2024 and April 2025.\n\"Agenda ransomware activity was primarily observed in healthcare, technology, financial services, and telecommunications sectors across the U.S., the Netherlands, Brazil, India, and the Philippines,\" according to Trend Micro's data from the first quarter of 2025.\nNETXLOADER, the cybersecurity company said, is a highly obfuscated loader that's designed to launch next-stage payloads retrieved from external servers (e.g., \"bloglake7[.]cfd\"), which are then used to drop SmokeLoader and Agenda ransomware.\nProtected by .NET Reactor version 6, it also incorporates a bevy of tricks to bypass traditional detection mechanisms and resist analysis efforts, such as the use of just-in-time (JIT) hooking techniques, and seemingly meaningless method names, and control flow obfuscation.\n\"The operators' use of NETXLOADER is a major leap forward in how malware is delivered,\" Trend Micro said. \"It uses a heavily obfuscated loader that hides the actual payload, meaning you can't know what it truly is without executing the code and analyzing it in memory. Even string-based analysis won't help because the obfuscation scrambles the clues that would normally reveal the payload's identity.\"\nAttack chains have been found to leverage valid accounts and phishing as initial access vectors to drop NETXLOADER, which then deploys SmokeLoader on the host. The SmokeLoader malware proceeds to perform a series of steps to perform virtualization and sandbox evasion, while simultaneously terminating a hard-coded list of running processes.\nIn the final stage, SmokeLoader establishes contact with a command-and-control (C2) server to fetch NETXLOADER, which launches the Agenda ransomware using a\ntechnique\nknown as\nreflective DLL loading\n.\n\"The Agenda ransomware group is continually evolving by adding new features designed to cause disruption,\" the researchers said. \"Its diverse targets include domain networks, mounted devices, storage systems, and VCenter ESXi.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "MirrorFace Targets Japan and Taiwan with ROAMINGMOUSE and Upgraded ANEL Malware",
        "Link": "https://thehackernews.com/2025/05/mirrorface-targets-japan-and-taiwan.html",
        "Summary": "The nation-state threat actor known as MirrorFace has been observed deploying malware dubbed ROAMINGMOUSE as part of a cyber espionage campaign directed against government agencies and public institutions in Japan and Taiwan.\nThe activity, detected by Trend Micro in March 2025, involved the use of spear-phishing lures to deliver an updated version of a backdoor called ANEL.\n\"The ANEL file from",
        "Date": "2025-05-08",
        "Content": "The nation-state threat actor known as\nMirrorFace\nhas been observed deploying malware dubbed ROAMINGMOUSE as part of a cyber espionage campaign directed against government agencies and public institutions in Japan and Taiwan.\nThe activity, detected by Trend Micro in March 2025, involved the use of spear-phishing lures to deliver an updated version of a backdoor called ANEL.\n\"The ANEL file from the 2025 campaign discussed in this blog implemented a new command to support an execution of BOF (Beacon Object File) in memory,\" security researcher Hara Hiroaki\nsaid\n. \"This campaign also potentially leveraged\nSharpHide\nto launch the second stage backdoor NOOPDOOR.\"\nThe China-aligned threat actor, also known as Earth Kasha, is assessed to be a sub-cluster within APT10. In March 2025, ESET\nshed light\non a campaign referred to as Operation AkaiRyū that targeted a diplomatic organization in the European Union in August 2024 with ANEL (aka UPPERCUT).\nThe targeting of various Japanese and Taiwanese entities points to a continued expansion of their footprint, as the hacking crew seeks to conduct information theft to\nadvance their strategic objectives\n.\nThe attack starts with a spear-phishing email -- some of which are sent from legitimate-but-compromised accounts -- that contains an embedded Microsoft OneDrive URL, which, in turn, downloads a ZIP file.\nThe ZIP archive includes a malware-laced Excel document, and a macro-enabled dropper codenamed\nROAMINGMOUSE\nthat serves as a conduit to deliver components related to ANEL. It's worth noting that ROAMINGMOUSE has been put to use by MirrorFace since last year.\n\"ROAMINGMOUSE then decodes the embedded ZIP file by using Base64, drops the ZIP on a disk, and expands its components,\" Hiroaki said. This includes -\nJSLNTOOL.exe, JSTIEE.exe, or JSVWMNG.exe (a legitimate binary)\nJSFC.dll (ANELLDR)\nAn encrypted ANEL payload\nMSVCR100.dll (a legitimate DLL dependency of the executable)\nThe end goal of the attack chain is to launch the legitimate executable using explorer.exe and then use it to sideload the malicious DLL, in this case, ANELLDR, which is responsible for decrypting and launching the ANEL backdoor.\nWhat's notable about the ANEL artifact used in the 2025 campaign is the addition of a new command to support in-memory execution of\nbeacon object files\n(\nBOFs\n), which are compiled C programs designed to extend the Cobalt Strike agent with new post-exploitation features.\n\"After installing the ANEL file, actors behind Earth Kasha obtained screenshots using a backdoor command and examined the victim's environment,\" Trend Micro explained. \"The adversary appears to investigate the victim by looking through screenshots, running process lists, and domain information.\"\nSelect instances have also leveraged an open-source tool named SharpHide to launch a new version of NOOPDOOR (aka HiddenFace), another backdoor previously identified as used by the hacking group. The implant, for its part, supports DNS-over-HTTPS (\nDoH\n) to conceal its IP address lookups during command-and-control (C2) operations.\n\"Earth Kasha continues to be an active advanced persistent threat and is now targeting government agencies and public institutions in Taiwan and Japan in its latest campaign which we detected in March 2025,\" Hiroaki said.\n\"Enterprises and organizations, especially those with high-value assets like sensitive data relating to governance, as well as intellectual property, infrastructure data, and access credentials should continue to be vigilant and implement proactive security measures to prevent falling victim to cyber attacks.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Russian Hackers Using ClickFix Fake CAPTCHA to Deploy New LOSTKEYS Malware",
        "Link": "https://thehackernews.com/2025/05/russian-hackers-using-clickfix-fake.html",
        "Summary": "The Russia-linked threat actor known as COLDRIVER has been observed distributing a new malware called LOSTKEYS as part of an espionage-focused campaign using ClickFix-like social engineering lures.\n\"LOSTKEYS is capable of stealing files from a hard-coded list of extensions and directories, along with sending system information and running processes to the attacker,\" the Google Threat",
        "Date": "2025-05-08",
        "Content": "The Russia-linked threat actor known as\nCOLDRIVER\nhas been observed distributing a new malware called\nLOSTKEYS\nas part of an espionage-focused campaign using ClickFix-like social engineering lures.\n\"LOSTKEYS is capable of stealing files from a hard-coded list of extensions and directories, along with sending system information and running processes to the attacker,\" the Google Threat Intelligence Group (GTIG)\nsaid\n.\nThe malware, the company said, was observed in January, March, and April 2025 in attacks on current and former advisors to Western governments and militaries, as well as journalists, think tanks, and NGOs. In addition, individuals connected to Ukraine have also been singled out.\nLOSTKEYS is the second custom malware attributed to COLDRIVER after\nSPICA\n, marking a continued departure from the\ncredential phishing campaigns\nthe threat actor has been known for. The hacking group is also tracked under the names Callisto, Star Blizzard, and UNC4057.\n\"They are known for stealing credentials and after gaining access to a target's account they exfiltrate emails and steal contact lists from the compromised account,\" security researcher Wesley Shields said. \"In select cases, COLDRIVER also delivers malware to target devices and may attempt to access files on the system.\"\nThe latest set of attacks commences with a decoy website containing a fake CAPTCHA verification prompt, where victims are instructed to open the Windows Run dialog and paste a PowerShell command copied to the clipboard, a widely popular social engineering technique dubbed\nClickFix\n.\nThe PowerShell command is designed to download and execute the next payload from a remote server (\"165.227.148[.]68\"), which acts as a downloader for a third-stage but not before performing checks in a likely effort to evade execution in virtual machines.\nA Base64-encoded blob, the third-stage payload is decoded into a PowerShell script that's responsible for executing LOSTKEYS on the compromised host, allowing the threat actor to harvest system information, running processes, and files from a hard-coded list of extensions and directories.\nLike in the case of SPICA, it's been assessed that the malware is only deployed selectively, indicative of the highly-targeted nature of these attacks.\nGoogle also said it uncovered additional LOSTKEYS artifacts going back to December 2023 that masqueraded as binaries related to the Maltego open-source investigation platform. It's not known if these samples have any ties to COLDRIVER, or if the malware was repurposed by the threat actors starting January 2025.\nClickFix Adoption Continues to Grow\nThe development comes as ClickFix continues to be steadily adopted by multiple threat actors to distribute a wide range of malware families, including a banking trojan called\nLampion\nand\nAtomic Stealer\n.\nAttacks propagating Lampion, per Palo Alto Networks Unit 42, use phishing emails bearing ZIP file attachments as lures. Present within the ZIP archive is an HTML file that redirects the message recipient to a fake landing page with ClickFix instructions to launch the multi-stage infection process.\n\"Another interesting aspect of Lampion's infection chain is that it is divided into several non-consecutive stages, executed as separate processes,\" Unit 42\nsaid\n. \"This dispersed execution complicates detection, as the attack flow does not form a readily identifiable process tree. Instead, it comprises a complex chain of individual events, some of which could appear benign in isolation.\"\nThe malicious campaign targeted Portuguese-speaking individuals and organizations in various sectors, including government, finance, and transportation, the company added.\nIn recent months, the ClickFix strategy has also been combined with another sneaky tactic called\nEtherHiding\n, which involves using Binance's Smart Chain (BSC) contracts to conceal the next-stage payload, ultimately leading to the delivery of a macOS information stealer called Atomic Stealer.\n\"Clicking 'I'm not a robot' triggers a Binance Smart Contract, using an EtherHiding technique, to deliver a Base64-encoded command to the clipboard, which users are prompted to run in Terminal via macOS-specific shortcuts (⌘ + Space, ⌘ + V),\" an independent researcher who goes by the alias Badbyte\nsaid\n. \"This command downloads a script that retrieves and executes a signed Mach-O binary, confirmed as Atomic Stealer.\"\nFurther investigation has found that the campaign has likely compromised about 2,800 legitimate websites to serve fake CAPTCHA prompts. The large-scale watering hole attack has been codenamed MacReaper by the researcher.\n\"The attack leverages obfuscated JavaScript, three full-screen iframes, and blockchain-based command infrastructure to maximize infections,\" the researcher added.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Cisco Patches CVE-2025-20188 (10.0 CVSS) in IOS XE That Enables Root Exploits via JWT",
        "Link": "https://thehackernews.com/2025/05/cisco-patches-cve-2025-20188-100-cvss.html",
        "Summary": "Cisco has released software fixes to address a maximum-severity security flaw in its IOS XE Wireless Controller that could enable an unauthenticated, remote attacker to upload arbitrary files to a susceptible system.\nThe vulnerability, tracked as CVE-2025-20188, has been rated 10.0 on the CVSS scoring system.\n\"This vulnerability is due to the presence of a hard-coded JSON Web Token (JWT) on an",
        "Date": "2025-05-08",
        "Content": "Cisco has released software fixes to address a maximum-severity security flaw in its IOS XE Wireless Controller that could enable an unauthenticated, remote attacker to upload arbitrary files to a susceptible system.\nThe vulnerability, tracked as\nCVE-2025-20188\n, has been rated 10.0 on the CVSS scoring system.\n\"This vulnerability is due to the presence of a hard-coded JSON Web Token (JWT) on an affected system,\" the company\nsaid\nin a Wednesday advisory.\n\"An attacker could exploit this vulnerability by sending crafted HTTPS requests to the AP image download interface. A successful exploit could allow the attacker to upload files, perform path traversal, and execute arbitrary commands with root privileges.\"\nThat said, in order for the exploitation to be successful, the Out-of-Band AP Image Download feature must be enabled on the device. It's disabled by default.\nThe following products are affected, if they have a vulnerable release running and have the Out-of-Band AP Image Download feature turned on -\nCatalyst 9800-CL Wireless Controllers for Cloud\nCatalyst 9800 Embedded Wireless Controller for Catalyst 9300, 9400, and 9500 Series Switches\nCatalyst 9800 Series Wireless Controllers\nEmbedded Wireless Controller on Catalyst APs\nWhile updating to the latest version is the best course of action, as temporary mitigations, users can disable the feature until an upgrade can be performed.\n\"With this feature disabled, AP image download will use the CAPWAP method for the AP image update feature, and this does not impact the AP client state,\" Cisco added.\nThe networking equipment major credited X.B. of the Cisco Advanced Security Initiatives Group (ASIG) for discovering the reporting the bug during internal security testing. There is no evidence that the vulnerability has been maliciously exploited in the wild.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "FBI: End-of-life routers hacked for cybercrime proxy networks",
        "Link": "https://www.bleepingcomputer.com/news/security/fbi-end-of-life-routers-hacked-for-cybercrime-proxy-networks/",
        "Summary": "The FBI warns that threat actors are deploying malware on end-of-life (EoL) routers to convert them into proxies sold on the 5Socks and Anyproxy networks. [...]",
        "Date": "2025-05-08",
        "Content": "The FBI warns that threat actors are deploying malware on end-of-life (EoL) routers to convert them into proxies sold on the 5Socks and Anyproxy networks.\nThese devices, which were released many years back and no longer receive security updates from their vendors, are vulnerable to external attacks leveraging publicly available exploits to inject persistent malware.\nOnce compromised, they are added to residential proxy botnets that route malicious traffic. In many cases, these proxies are used by cybercriminals to conduct malicious activities or cyberattacks.\n\"With the 5Socks and Anyproxy network, criminals are selling access to compromised routers as proxies for customers to purchase and use,\"\nexplains the FBI Flash advisory\n.\n\"The proxies can be used by threat actors to obfuscate their identity or location.\"\nThe advisory lists the following EoL Linksys and Cisco models as common targets:\nLinksys E1200, E2500, E1000, E4200, E1500, E300, E3200, E1550\nLinksys WRT320N, WRT310N, WRT610N\nCradlepoint E100\nCisco M10\nThe FBI warns that Chinese state-sponsored actors have exploited known (n-day) vulnerabilities in these routers to\nconduct covert espionage campaign\ns, including operations targeting critical U.S. infrastructure.\nIn a\nrelated bulletin\n, the agency confirms that many of these routers are infected with a variant of the \"TheMoon\" malware, which enables threat actors to configure them as proxies.\n\"End of life routers were breached by cyber actors using variants of TheMoon malware botnet,\" reads the FBI bulletin.\n\"Recently, some routers at end of life, with remote administration turned on, were identified as compromised by a new variant of TheMoon malware. This malware allows cyber actors to install proxies on unsuspecting victim routers and conduct cyber crimes anonymously.\"\nOnce compromised, the routers connect to command and control (C2) servers to receive commands to execute, such as scanning for and compromising vulnerable devices on the Internet.\nThe FBI says that the proxies are then used to evade detection during cryptocurrency theft, cybercrime-for-hire activities, and other illegal operations.\nCommon signs of compromise by a botnet include network connectivity disruptions, overheating, performance degradation, configuration changes, the appearance of rogue admin users, and unusual network traffic.\nThe best way to mitigate the risk of botnet infections is to replace end-of-life routers with newer, actively supported models.\nIf that is impossible, apply the latest firmware update for your model, sourced from the vendor's official download portal, change the default admin account credentials, and turn off remote administration panels.\nThe FBI has shared indicators of compromise associated with the malware installed on EoL devices.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nChinese cyberspies backdoor Juniper routers for stealthy access\nSamsung MagicINFO 9 Server RCE flaw now exploited in attacks\nFBI: Ransomware gangs hack casinos via 3rd party gaming vendors\nFBI shares massive list of 42,000 LabHost phishing domains\nFBI seeks help to unmask Salt Typhoon hackers behind telecom breaches"
    },
    {
        "Title": "Cisco fixes max severity IOS XE flaw letting attackers hijack devices",
        "Link": "https://www.bleepingcomputer.com/news/security/cisco-fixes-max-severity-ios-xe-flaw-letting-attackers-hijack-devices/",
        "Summary": "Cisco has fixed a maximum severity flaw in IOS XE Software for Wireless LAN Controllers by a hard-coded JSON Web Token (JWT) that allows an unauthenticated remote attacker to take over devices. [...]",
        "Date": "2025-05-08",
        "Content": "Cisco has fixed a maximum severity flaw in IOS XE Software for Wireless LAN Controllers by a hard-coded JSON Web Token (JWT) that allows an unauthenticated remote attacker to take over devices.\nThis token is meant to authenticate requests to a feature called 'Out-of-Band AP Image Download.' Since it's hard-coded, anyone can impersonate an authorized user without credentials.\nThe vulnerability is tracked as CVE-2025-20188 and has a maximum 10.0 CVSS score, allowing threat actors to fully compromise devices according to the vendor.\n\"An attacker could exploit this vulnerability by sending crafted HTTPS requests to the AP image download interface,\"\nreads Cisco's bulletin\n.\n\"A successful exploit could allow the attacker to upload files, perform path traversal, and execute arbitrary commands with root privileges.\"\nIt is noted that CVE-2025-20188 is only exploitable when the 'Out-of-Band AP Image Download' feature is enabled on the device, which isn't enabled by default.\nThe 'Out-of-Band AP Image Download' feature allows access points (APs) to download OS images via HTTPS rather than over the CAPWAP protocol, allowing a more flexible and direct way to get firmware onto APs.\nThat said, although it's disabled by default, some large-scale or automated enterprise deployments may enable it for faster provisioning or recovery of APs.\nThe following devices are vulnerable to attacks if the exploitation requirements are met:\nCatalyst 9800-CL Wireless Controllers for Cloud\nCatalyst 9800 Embedded Wireless Controller for Catalyst 9300, 9400, and 9500 Series Switches\nCatalyst 9800 Series Wireless Controllers\nEmbedded Wireless Controller on Catalyst APs\nOn the other hand, products confirmed not to be impacted by the hard-coded JWT issue are: Cisco IOS (non-XE), Cisco IOS XR, Cisco Meraki products, Cisco NX-OS, and Cisco AireOS-based WLCs.\nCisco has released security updates to address the critical vulnerability, so system administrators are advised to apply them as soon as possible.\nUsers can determine the exact version that fixes the flaw for their device using the Cisco Software Checker for their specific device model.\nAlthough there are no mitigations or workarounds for CVE-2025-20188, disabling the 'Out-of-Band AP Image Download' feature is a solid defense.\nAt this time, Cisco is unaware of any cases of active exploitation for CVE-2025-20188. However, given the severity of the issue, threat actors are likely to start scanning for exposed vulnerable endpoints immediately.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nHackers exploit OttoKit WordPress plugin flaw to add admin accounts\nSAP fixes suspected NetWeaver zero-day exploited in attacks\nASUS warns of critical auth bypass flaw in routers using AiCloud\nHackers exploit WordPress plugin auth bypass hours after disclosure\nCentreStack RCE exploited as zero-day to breach file sharing servers"
    },
    {
        "Title": "Education giant Pearson hit by cyberattack exposing customer data",
        "Link": "https://www.bleepingcomputer.com/news/security/education-giant-pearson-hit-by-cyberattack-exposing-customer-data/",
        "Summary": "Education giant Pearson suffered a cyberattack, allowing threat actors to steal corporate data and customer information, BleepingComputer has learned. [...]",
        "Date": "2025-05-08",
        "Content": "Education giant Pearson suffered a cyberattack, allowing threat actors to steal corporate data and customer information, BleepingComputer has learned.\nPearson is a UK-based education company and one of the world’s largest providers of academic publishing, digital learning tools, and standardized assessments. The company works with schools, universities, and individuals in over 70 countries through its print and online services.\nIn a statement to BleepingComputer, Pearson confirmed they suffered a cyberattack and that data was stolen, but stated it was mostly \"legacy data.\"\n\"We recently discovered that an unauthorized actor gained access to a portion of our systems,\" a Pearson representative confirmed to BleepingComputer.\n\"Once we identified the activity, we took steps to stop it and investigate what happened and what data was affected with forensics experts. We also supported law enforcement's investigation. We have taken steps to deploy additional safeguards onto our systems, including enhancing security monitoring and authentication.\"\n\"We are continuing to investigate, but at this time we believe the actor downloaded largely legacy data. We will be sharing additional information directly with customers and partners as appropriate.\"\nPearson also confirmed that the stolen data did not include employee information.\nDo you have information about this or another cyberattack? If you want to share the information, you can contact us securely and confidentially on Signal at LawrenceA.11, via email at lawrence.abrams@bleepingcomputer.com, or by using our\ntips form\n.\nAn exposed GitLab token\nThis statement comes after sources told BleepingComputer that threat actors compromised Pearson's developer environment in January 2025 through an exposed GitLab Personal Access Token (PAT) found in a public .git/config file.\nA .git/config file is a local configuration file used by Git projects to store configuration settings, such as a project name, email address, and other information. If this file is mistakenly exposed and contains access tokens embedded in remote URLs, it can give attackers unauthorized access to internal repositories.\nIn the attack on Pearson, the exposed token allowed the threat actors to access the company's source code, which contained further hard-coded credentials and authentication tokens for cloud platforms.\nOver the following months, the threat actor reportedly used these credentials to steal terabytes of data from the company's internal network and cloud infrastructure, including AWS, Google Cloud, and various cloud-based database services such as Snowflake and Salesforce CRM.\nThis stolen data allegedly contains customer information, financials, support tickets, and source code, with millions of people impacted.\nHowever, when BleepingComputer asked Pearson about whether they paid a ransom, what they meant by \"legacy data,\" how many customers were impacted, and if customers would be notified, the company responded that they would not be commenting on these questions.\nPearson\npreviously disclosed\nin January that they were investigating a breach of one of their subsidiaries, PDRI, which is believed to be related to this attack.\nScanning for Git configuration files and exposed credentials has become a common method for threat actors to breach cloud services.\nLast year,\nInternet Archive was breached\nafter threat actors discovered an\nexposed Git configuration file\ncontaining an authentication token for the company's GitLab repositories.\nFor this reason, it is critical to secure \".git/config\" files by preventing public access and to avoid embedding credentials in remote URLs.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nWestern Sydney University discloses security breaches, data leak\nVC giant Insight Partners confirms investor data stolen in breach\nMedical device maker Masimo warns of cyberattack, manufacturing delays\nUK Legal Aid Agency investigates cybersecurity incident\nUK NCSC: Cyberattacks impacting UK retailers are a wake-up call"
    },
    {
        "Title": "Supply chain attack hits npm package with 45,000 weekly downloads",
        "Link": "https://www.bleepingcomputer.com/news/security/supply-chain-attack-hits-npm-package-with-45-000-weekly-downloads/",
        "Summary": "An npm package named 'rand-user-agent' has been compromised in a supply chain attack to inject obfuscated code that activates a remote access trojan (RAT) on the user's system. [...]",
        "Date": "2025-05-08",
        "Content": "An npm package named 'rand-user-agent' has been compromised in a supply chain attack to inject obfuscated code that activates a remote access trojan (RAT) on the user's system.\nThe '\nrand-user-agent\n' package is a tool that generates randomized user-agent strings, which is helpful in web scraping, automated testing, and security research.\nAlthough the package has been deprecated, it remains fairly popular, averaging 45,000 downloads weekly.\nHowever, according to researchers at\nAikido\n, threat actors took advantage of its semi-abandoned yet popular status to inject malicious code in unauthorized subsequent releases that are likely to have been downloaded by a significant number of downstream projects.\nAikido detected the compromise on May 5, 2025, when its malware analysis system flagged a new version of rand-user-agent, number 1.0.110.\nUpon deeper examination, the researchers found obfuscated code hidden in the 'dist/index.js' file that was only visible if the user scrolled horizontally in the source view on the npm site.\nObfuscated code hidden out of view\nSource: Aikido\nInvestigation showed that the last legitimate version of 'rand-user-agent' was 2.0.82, released 7 months ago.\nVersions 2.0.83, 2.0.84, and also 1.0.110, which were published afterward, were all malicious and didn't have corresponding releases on the project's GitHub repository.\nThe malicious code embedded in the newest versions creates a hidden directory under the user's home folder (~/.node_modules) and extends the 'module.paths' so that this custom path can be used for loading dependencies, namely 'axios' and 'socket.io-client.'\nNext, it opens a persistent socket connection to the attacker's command and control (C2) at http://85.239.62[.]36:3306, and sends machine ID info including hostname, username, OS type, and a generated UUID.\nOnce the RAT is active, it listens for one of the below commands:\ncd <path>\n- Changes current working directory\nss_dir\n– Resets working dir to script path\nss_fcd:<path>\n- Forcefully changes to the given directory\nss_upf:f,d\n– Uploads a single file f to destination d\nss_upd:d,dest\n– Uploads all files in directory d to dest\nss_stop\n– Interrupts any ongoing file upload\n(any other)\n– Executes it as a shell command using child_process.exec()\nAt the time of writing, the malicious versions have been removed from the package's repository on npm, so the latest available version is safe, and users should revert to it.\nHowever, if you have upgraded to versions 2.0.83, 2.0.84, or 1.0.110, it is important to perform a full system scan for signs of compromise. Note that downgrading to the legitimate version does not remove the RAT from your system.\nMoreover, consider using forked but still supported and better monitored versions of the 'rand-user-agent' tool.\nBleepingComputer contacted the developer to learn how their package was compromised, but a reply was not immediately available.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMalicious PyPi package hides RAT malware, targets Discord devs since 2022\nPyPI packages caught stealing credit card numbers, Discord tokens\nChinese hackers target Russian govt with upgraded RAT malware\nNew ResolverRAT malware targets pharma and healthcare orgs worldwide\nInfostealer campaign compromises 10 npm packages, targets devs"
    },
    {
        "Title": "Malicious PyPi package hides RAT malware, targets Discord devs since 2022",
        "Link": "https://www.bleepingcomputer.com/news/security/malicious-pypi-package-hides-rat-malware-targets-discord-devs-since-2022/",
        "Summary": "A malicious Python package targeting Discord developers with remote access trojan (RAT) malware was spotted on the Python Package Index (PyPI) after more than three years. [...]",
        "Date": "2025-05-08",
        "Content": "A malicious Python package targeting Discord developers with remote access trojan (RAT) malware was spotted on the Python Package Index (PyPI) after more than three years.\nNamed \"discordpydebug,\" the package was masquerading as an error logger utility for developers working on Discord bots and was downloaded over 11,000 times since it was uploaded on March 21, 2022, even though it has no description or documentation.\nCybersecurity company Socket, which first spotted it, says the malware could be used to backdoor Discord developers' systems and provide attackers with data theft and remote code execution capabilities.\n\"The package targeted developers who build or maintain Discord bots, typically indie developers, automation engineers, or small teams who might install such tools without extensive scrutiny,\" Socket researchers\nsaid\n.\n\"Since PyPI doesn't enforce deep security audits of uploaded packages, attackers often take advantage of this by using misleading descriptions, legitimate-sounding names, or even copying code from popular projects to appear trustworthy.\"\nOnce installed, the malicious package transforms the device into a remote-controlled system that will execute instructions sent from an attacker-controlled command-and-control (C2) server.\nThe attackers could use the malware to gain unauthorized access to credentials and more (e.g., tokens, keys, and config files), steal data and monitor system activity without being detected, remotely execute code for deploying further malware payloads, and obtain information that can help them move laterally within the network.\ndiscordpydebug on PyPI (BleepingComputer)\n​While the malware lacks persistence or privilege escalation mechanisms, it uses outbound HTTP polling instead of inbound connections, making it possible to bypass firewalls and security software, especially in loosely controlled development environments.\nOnce installed, the package silently connects to an attacker-controlled command-and-control (C2) server (backstabprotection.jamesx123.repl[.]co), sending a POST request with a \"name\" value to add the infected host to the attackers' infrastructure.\nThe malware also includes functions to read from and write to files on the host machine using JSON operations when triggered by specific keywords from the C2 server, giving the threat actors visibility into sensitive data.\nTo mitigate the risk of installing backdoored malware from online code repositories, software developers should ensure that the packages they download and install come from the official author before installation, especially for popular ones, to avoid typosquatting.\nAdditionally, when using open-source libraries, they should review the code for suspicious or obfuscated functions and consider using security tools to detect and block malicious packages.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMalicious PyPI packages with over 10,000 downloads taken down\nPyPI packages caught stealing credit card numbers, Discord tokens\nChinese hackers target Russian govt with upgraded RAT malware\nNew ResolverRAT malware targets pharma and healthcare orgs worldwide\nMicrosoft: New RAT malware used for crypto theft, reconnaissance"
    },
    {
        "Title": "Kickidler employee monitoring software abused in ransomware attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/kickidler-employee-monitoring-software-abused-in-ransomware-attacks/",
        "Summary": "Ransomware operations are using legitimate Kickidler employee monitoring software for reconnaissance, tracking their victims' activity, and harvesting credentials after breaching their networks. [...]",
        "Date": "2025-05-08",
        "Content": "Ransomware operations are using legitimate Kickidler employee monitoring software for reconnaissance, tracking their victims' activity, and harvesting credentials after breaching their networks.\nIn attacks observed by cybersecurity companies\nVaronis\nand\nSynacktiv\n, Qilin and Hunters International ransomware affiliates installed Kickidler, an\nemployee monitoring tool\nthat can capture keystrokes, take screenshots, and create videos of the screen.\nKickidler's developer says the tool is used by over 5,000 organizations from 60 countries and provides visual monitoring and data loss prevention features.\nThe attacks started with the threat actors taking out Google Ads displayed when people searched for RVTools, a free Windows utility for managing VMware vSphere deployments. Clicking on the advertisement led to a fake RVTools site (rv-tool[.]net), promoting a trojanized program version.\nThe program is a malware loader that downloads and runs the SMOKEDHAM PowerShell .NET backdoor, which was used to deploy Kickidler on the device.\nAttack flow (Varonis)\nWhile these attacks targeted enterprise administrators, whose accounts would typically provide the threat actors with privileged credentials after compromise, Varonis believes they may have maintained access to the victims' systems for days and even weeks to collect credentials needed to access off-site cloud backups without being detected.\n\"Given the increased targeting of backup solutions by attackers in recent years, defenders are decoupling backup system authentication from Windows domains. This measure prevents attackers from accessing backups even if they gain high-level Windows credentials,\" Varonis told BleepingComputer.\n\"Kickidler addresses this issue by capturing keystrokes and web pages from an administrator's workstation. This enables attackers to identify off-site cloud backups and obtain the necessary passwords to access them. This is done without dumping memory or other high-risk tactics that are more likely to be detected.\"\nIn both cases, after resuming malicious activity on the breached networks, the ransomware operators deployed payloads that targeted the victims' VMware ESXi infrastructure, encrypting VMDK virtual hard disk drives and causing widespread disruption.\nThe deployment script used by Hunters International leveraged VMware PowerCLI and WinSCP Automation to enable the SSH service, deploy the ransomware, and execute it on ESXi servers, Synacktiv said.\nLegitimate RMM software abused in attacks\nWhile employee monitoring software isn't the go-to tool for ransomware gangs, they've abused legitimate remote monitoring and management (RMM) software for years.\nAs CISA, the NSA, and MS-ISAC warned in a\nJanuary 2023 joint advisory\n, attackers part of many ransomware operations are tricking victims into installing portable remote desktop solutions to bypass software controls and take over their systems without requiring admin privileges.\nSince mid-October 2022, CISA has also discovered malicious activity within the networks of multiple\nfederal civilian executive branch\n(FCEB) agencies linked to this type of attack.\nRecently, attackers have been seen\ntargeting vulnerable SimpleHelp RMM clients\nto create administrator accounts, install backdoors, and potentially set the stage for Akira ransomware attacks.\nTo defend against potential security breaches, network defenders are advised to audit installed remote access tools and identify authorized RMM software.\nIt's also recommended to use application controls to prevent the execution of unauthorized RMM software and to enforce the use of only authorized remote desktop tools, along with approved remote access solutions such as VPN or VDI.\nAdditionally, security teams should block inbound and outbound connections on standard RMM ports and protocols if not used.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nHunters International shifts from ransomware to pure data extortion\nPlay ransomware exploited Windows logging flaw in zero-day attacks\nNew \"Bring Your Own Installer\" EDR bypass used in ransomware attack\nUK shares security tips after major retail cyberattacks\nFBI: Ransomware gangs hack casinos via 3rd party gaming vendors"
    },
    {
        "Title": "VC giant Insight Partners confirms investor data stolen in breach",
        "Link": "https://www.bleepingcomputer.com/news/security/vc-giant-insight-partners-confirms-investor-data-stolen-in-breach/",
        "Summary": "Venture capital firm Insight Partners has confirmed that sensitive data for employees and limited partners was stolen in a January 2025 cyberattack. [...]",
        "Date": "2025-05-08",
        "Content": "Venture capital firm Insight Partners has confirmed that sensitive data for employees and limited partners was stolen in a January 2025 cyberattack.\nInsight Partners is a prominent global venture capital and private equity firm specializing in high-growth technology, software, and internet companies, managing over $90 billion in regulatory assets.\nThe company has significant investments in more than 800 companies worldwide, including Twitter, HelloFresh, and Veeam Software.\nOn February 18, 2025, Insight Partners released a statement\ninforming of a cybersecurity incident\nthat occurred on January 16, 2025, where an unauthorized actor accessed certain IT systems after carrying out a \"sophisticated social engineering attack.\"\nInsight Partners assured that the incident was isolated and its duration was contained to a single day, resulting in no disruptions to its business operations. However, an investigation into its full scope was still underway.\nIn\nan update\npublished earlier this week, the company says it has verified a data breach with the help of experts at an eDiscovery vendor and is now working on determining who is impacted.\nThe data that has been exposed varies per individual and investor, and may include:\nFund information\nManagement company information\nPortfolio company information\nBanking information\nTax information\nPersonal information of current and former employees\nInformation related to Limited Partners\nIndividuals confirmed to have had their information exposed will be notified, but Insight Partners says this will occur in waves, starting in the next few days.\nIn the meantime, potentially impacted persons are recommended to change their personal and enterprise passwords and activate two-factor authentication (2FA) on all financial accounts.\nAdditionally, it is recommended to closely monitor financial statements and credit reports, and consider placing a fraud alert or freeze.\nInsight Partners has not yet been listed on any ransomware sites and extortion portals, so the type of attack and the perpetrators responsible for it are still unknown.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nVeriSource now says February data breach impacts 4 million people\nInterlock ransomware claims DaVita attack, leaks stolen data\nYale New Haven Health data breach affects 5.5 million patients\nSK Telecom warns customer USIM data exposed in malware attack\nEntertainment services giant Legends International discloses data breach"
    },
    {
        "Title": "Google links new LostKeys data theft malware to Russian cyberspies",
        "Link": "https://www.bleepingcomputer.com/news/security/google-links-new-lostkeys-data-theft-malware-to-russian-cyberspies/",
        "Summary": "Since the start of the year, the Russian state-backed ColdRiver hacking group has been using new LostKeys malware to steal files in espionage attacks targeting Western governments, journalists, think tanks, and non-governmental organizations. [...]",
        "Date": "2025-05-08",
        "Content": "Since the start of the year, the Russian state-backed ColdRiver hacking group has been using new LostKeys malware to steal files in espionage attacks targeting Western governments, journalists, think tanks, and non-governmental organizations.\nIn December, the United Kingdom and Five Eyes allies\nlinked\nColdRiver to Russia's Federal Security Service (FSB), the country's counterintelligence and internal security service.\nGoogle Threat Intelligence Group (GTIG) first observed LostKeys being \"deployed in highly selective cases\" in January as part of\nClickFix\nsocial engineering attacks, where the threat actors trick targets into running malicious PowerShell scripts.\nRunning these scripts downloads and executes additional PowerShell payloads on the victims' devices, ending with a Visual Basic Script (VBS) data theft malware tracked by Google as LostKeys.\n\"LOSTKEYS is capable of stealing files from a hard-coded list of extensions and directories, along with sending system information and running processes to the attacker,\"\nGTIG said\n.\n\"The typical behavior of COLDRIVER is to steal credentials and then use them to steal emails and contacts from the target, but as we have previously documented they will also deploy malware called SPICA to select targets if they want to access documents on the target system. LOSTKEYS is designed to achieve a similar goal and is only deployed in highly selective cases.'\nColdRiver is not the only state-backed threat group hacking into their targets' devices in ClickFix attacks, with Kimsuky (North Korea), MuddyWater (Iran), APT28, and UNK_RemoteRogue (Russia)\nhaving all used these same tactics\nin espionage campaigns in recent months.\nLostKeys attack flow (Google)\n​Also tracked as Star Blizzard, Callisto Group, and Seaborgium, the ColdRiver hacking group has used\nsocial engineering and open-source intelligence (OSINT) skills\nto research and lure targets since at least 2017.\nFive Eyes cyber agencies also\nwarned\nin December 2023 of ColdRiver's spear-phishing attacks against defense, governmental organizations, NGOs, and politicians, months after Russia invaded Ukraine, and these attacks also expanded to targeting defense-industrial targets and U.S. Department of Energy facilities.\nIn 2022, the Microsoft Threat Intelligence Center (MSTIC)\ndisrupted another ColdRiver social engineering\noperation\nwhere the attackers used Microsoft accounts to harvest emails and monitor the activity of organizations and high-profile individuals in NATO countries.\nThe U.S. State Department\nsanctioned\ntwo ColdRiver operators (one of them an FSB officer) in December 2023, who were also\nindicted\nby the U.S. Justice Department for their involvement in a global hacking campaign coordinated by the Russian government.\nThe State Department now offers\nup to $10 million in rewards\nfor tips that could help law enforcement locate or identify other ColdRiver members.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nChinese hackers target Russian govt with upgraded RAT malware\nClickFix attack delivers infostealers, RATs in fake Booking.com emails\nSupply chain attack hits npm package with 45,000 weekly downloads\nMalicious PyPi package hides RAT malware, targets Discord devs since 2022\nLuna Moth extortion hackers pose as IT help desks to breach US firms"
    },
    {
        "Title": "SonicWall urges admins to patch VPN flaw exploited in attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/sonicwall-urges-admins-to-patch-vpn-flaw-exploited-in-attacks/",
        "Summary": "SonicWall has urged its customers to patch three security vulnerabilities affecting its Secure Mobile Access (SMA) appliances, one of them tagged as exploited in attacks [...]",
        "Date": "2025-05-08",
        "Content": "SonicWall has urged its customers to patch three security vulnerabilities affecting its Secure Mobile Access (SMA) appliances, one of them tagged as exploited in attacks.\nDiscovered and reported by Rapid7 cybersecurity researcher Ryan Emmons, the three security flaws (CVE-2025-32819, CVE-2025-32820, and CVE-2025-32821) can be chained by attackers to gain remote code execution as root and compromise vulnerable instances.\nThe vulnerabilities impact SMA 200, SMA 210, SMA 400, SMA 410, and SMA 500v devices and are patched in firmware version 10.2.1.15-81sv and higher.\n\"SonicWall strongly advises users of the SMA 100 series products (SMA 200, 210, 400, 410, and 500v) to upgrade to the mentioned fixed release version to address these vulnerabilities,\"\nSonicWall said\nin a Wednesday advisory.\nSuccessful exploitation of CVE-2025-32819 allows threat actors to delete the primary SQLite database, reset the password of the default SMA admin user, and log in as admin to the SMA web interface. Next, they can exploit the CVE-2025-32820 path traversal vulnerability to make the /bin folder writable and then gain remote code execution as root by exploiting CVE-2025-32821.\n\"An attacker with access to an SMA SSLVPN user account can chain these vulnerabilities to make a sensitive system directory writable, elevate their privileges to SMA administrator, and write an executable file to a system directory. This chain results in root-level remote code execution,\"\nRapid7 said\n.\n\"Based on known (private) IOCs and Rapid7 incident response investigations, we believe this vulnerability may have been used in the wild.\"\nSonicWall advised admins to check their SMA devices' logs for any signs of unauthorized logins and enable the web application firewall and multifactor authentication (MFA) on their SMA100 appliances as a safety measure.\nLast week, SonicWall warned customers that two other vulnerabilities (\nCVE-2023-44221\nand\nCVE-2024-38475\n) affecting SMA appliances are now actively exploited in attacks to inject commands and execute code remotely.\nThe company\nflagged another high-severity flaw\n(\nCVE-2021-20035\n) as exploited in remote code execution attacks targeting SMA100 VPN appliances in April. One day later, cybersecurity company Arctic Wolf revealed the security bug had been under active exploitation\nsince at least January 2025\n.\nIn January, SonicWall also urged admins to patch a\ncritical flaw in SMA1000 secure access gateways\nexploited in zero-day attacks, and one month later warned of an\nactively exploited authentication bypass flaw\nimpacting Gen 6 and Gen 7 firewalls that lets hackers\nhijack VPN sessions\n.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nSonicWall warns of more VPN flaws exploited in attacks\nSonicWall SMA VPN devices targeted in attacks since January\nSAP fixes suspected NetWeaver zero-day exploited in attacks\nLazarus hackers breach six companies in watering hole attacks\nCISA tags SonicWall VPN flaw as actively exploited in attacks"
    },
    {
        "Title": "LockBit ransomware gang hacked, victim negotiations exposed",
        "Link": "https://www.bleepingcomputer.com/news/security/lockbit-ransomware-gang-hacked-victim-negotiations-exposed/",
        "Summary": "The LockBit ransomware gang has suffered a data breach after its dark web affiliate panels were defaced and replaced with a message linking to a MySQL database dump. [...]",
        "Date": "2025-05-08",
        "Content": "The LockBit ransomware gang has suffered a data breach after its dark web affiliate panels were defaced and replaced with a message linking to a MySQL database dump.\nAll of the ransomware gang's admin panels now state. \"Don't do crime\nCRIME IS BAD\nxoxo from Prague,\" with a link to download a \"paneldb_dump.zip.\"\nLockBit dark web site defaced with link to database\nAs\nfirst spotted\nby the threat actor, Rey, this archive contains a SQL file dumped from the site affiliate panel's MySQL database.\nFrom analysis by BleepingComputer, this database contains twenty tables, with some more interesting than others, including:\nA '\nbtc_addresses\n' table that contains 59,975 unique bitcoin addresses.\nA '\nbuilds\n' table contains the individual builds created by affiliates for attacks. Table rows contain the public keys, but no private keys, unfortunately. The targeted companies' names are also listed for some of the builds.\nA '\nbuilds_configurations\n' table contains the different configurations used for each build, such as which ESXi servers to skip or files to encrypt.\nA '\nchats\n' table is very interesting as it contains 4,442 negotiation messages between the ransomware operation and victims from December 19th to April 29th.\nAffiliate panel 'chats' table\nA '\nusers\n' table lists 75 admins and affiliates who had access to the affiliate panel, with\nMichael Gillespie\nspotting that passwords were stored in plaintext. Examples of some of the plaintext passwords are 'Weekendlover69, 'MovingBricks69420', and 'Lockbitproud231'.\nIn a\nTox conversation with Rey\n, the LockBit operator known as 'LockBitSupp' confirmed the breach, stating that no private keys were leaked or data lost.\nBased on the MySQL dump generation time and the last date record in the negotiation chats table , the database appears to have been dumped at some point on April 29th, 2025.\nIt's unclear who carried out the breach and how it was done, but the defacement message matches the one used in a recent\nbreach of Everest ransomware's dark web site\n, suggesting a possible link.\nIn 2024, a law enforcement operation called Operation Cronos\ntook down LockBit's infrastructure\n, including 34 servers hosting the data leak website and its mirrors, data stolen from the victims, cryptocurrency addresses, 1,000 decryption keys, and the affiliate panel.\nAlthough LockBit managed to rebuild and resume operations after the takedown, this latest breach strikes a further blow to its already damaged reputation.\nIt's too early to tell if this additional reputation hit will be the final nail in the coffin for the ransomware gang.\nOther ransomware groups who have experienced similar leaks include\nConti\n,\nBlack Basta\n, and\nEverest\n.\nUpdate 5/8/25: Updated article to remove potential PHP CVE the server was vulnerable to as that CVE only impacted Windows. Thanks Christopher.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nVC giant Insight Partners confirms investor data stolen in breach\nPowerSchool hacker now extorting individual school districts\nUkrainian extradited to US for Nefilim ransomware attacks\nAscension discloses new data breach after third-party hacking incident\nVeriSource now says February data breach impacts 4 million people"
    },
    {
        "Title": "SonicWall Issues Patch for Exploit Chain in SMA Devices",
        "Link": "https://www.darkreading.com/endpoint-security/sonicwall-patch-exploit-chain-sma-devices",
        "Summary": "Three vulnerabilities in SMA 100 gateways could facilitate root RCE attacks, and one of the vulnerabilities has already been exploited in the wild.",
        "Date": "2025-05-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/endpoint-security/sonicwall-patch-exploit-chain-sma-devices"
    },
    {
        "Title": "Email-Based Attacks Top Cyber-Insurance Claims",
        "Link": "https://www.darkreading.com/cyber-risk/email-based-attacks-cyber-insurance-claims",
        "Summary": "Cyber-insurance carrier Coalition said business email compromise and funds transfer fraud accounted for 60% of claims in 2024.",
        "Date": "2025-05-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/email-based-attacks-cyber-insurance-claims"
    },
    {
        "Title": "Operation PowerOFF Takes Down 9 DDoS-for-Hire Domains",
        "Link": "https://www.darkreading.com/threat-intelligence/operation-poweroff-takes-down-nine-ddos-domains",
        "Summary": "Four different countries, including the United States and Germany, were included in the latest international operation alongside Europol's support.",
        "Date": "2025-05-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/operation-poweroff-takes-down-nine-ddos-domains"
    },
    {
        "Title": "Life Without CVEs? It's Time to Act",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/life-without-cves-time-act",
        "Summary": "Despite all MITRE has done for cybersecurity, it is clear we should not wait 11 months to discuss the future of the CVE database. It's simply too important for that.",
        "Date": "2025-05-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/life-without-cves-time-act"
    },
    {
        "Title": "'Lemon Sandstorm' Underscores Risks to Middle East Infrastructure",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/lemon-sandstorm-risks-middle-east-infrastructure",
        "Summary": "The Iranian state-backed group targeted the operational technology of a critical national infrastructure (CNI) network and persisted in its network for years, but ultimately failed.",
        "Date": "2025-05-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/lemon-sandstorm-risks-middle-east-infrastructure"
    },
    {
        "Title": "'CoGUI' Phishing Kit Helps Chinese Hackers Target Japan",
        "Link": "https://www.darkreading.com/threat-intelligence/cogui-phishing-kit-chinese-hackers-japan",
        "Summary": "Japan is being peppered with an overwhelming volume of spam, thanks to a new platform popular across the East China Sea.",
        "Date": "2025-05-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/cogui-phishing-kit-chinese-hackers-japan"
    },
    {
        "Title": "Valarian Bags $20M Seed Capital for ‘Isolation-First’ Infrastructure Tech",
        "Link": "https://www.securityweek.com/valarian-bags-20m-seed-capital-for-isolation-first-infrastructure-tech/",
        "Summary": "<p>British startup exits stealth with $20 million in seed-stage financing led by US investors Scout Ventures and Artis Ventures.</p>\n<p>The post <a href=\"https://www.securityweek.com/valarian-bags-20m-seed-capital-for-isolation-first-infrastructure-tech/\">Valarian Bags $20M Seed Capital for ‘Isolation-First’ Infrastructure Tech</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/valarian-bags-20m-seed-capital-for-isolation-first-infrastructure-tech/"
    },
    {
        "Title": "Europol Announces More DDoS Service Takedowns, Arrests",
        "Link": "https://www.securityweek.com/europol-announces-more-ddos-service-takedowns-arrests/",
        "Summary": "<p>Four people have been arrested in Poland and several websites associated with DDoS-for-hire services have been shut down.</p>\n<p>The post <a href=\"https://www.securityweek.com/europol-announces-more-ddos-service-takedowns-arrests/\">Europol Announces More DDoS Service Takedowns, Arrests</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/europol-announces-more-ddos-service-takedowns-arrests/"
    },
    {
        "Title": "Possible Zero-Day Patched in SonicWall SMA Appliances",
        "Link": "https://www.securityweek.com/possible-zero-day-patched-in-sonicwall-sma-appliances/",
        "Summary": "<p>SonicWall patches three SMA 100 vulnerabilities, including a potential zero-day, that could be chained to execute arbitrary code remotely.</p>\n<p>The post <a href=\"https://www.securityweek.com/possible-zero-day-patched-in-sonicwall-sma-appliances/\">Possible Zero-Day Patched in SonicWall SMA Appliances</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/possible-zero-day-patched-in-sonicwall-sma-appliances/"
    },
    {
        "Title": "Russia-Linked APT Star Blizzard Uses ClickFix to Deploy New LostKeys Malware, Google Warns",
        "Link": "https://www.securityweek.com/google-finds-data-theft-malware-used-by-russian-apt-in-select-cases/",
        "Summary": "<p>Russia-linked APT Star Blizzard is using the ClickFix technique in recent attacks distributing the LostKeys malware.</p>\n<p>The post <a href=\"https://www.securityweek.com/google-finds-data-theft-malware-used-by-russian-apt-in-select-cases/\">Russia-Linked APT Star Blizzard Uses ClickFix to Deploy New LostKeys Malware, Google Warns</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/google-finds-data-theft-malware-used-by-russian-apt-in-select-cases/"
    },
    {
        "Title": "Improperly Patched Samsung MagicINFO Vulnerability Exploited by Botnet",
        "Link": "https://www.securityweek.com/improperly-patched-samsung-magicinfo-vulnerability-exploited-by-botnet/",
        "Summary": "<p>The patches for an exploited Samsung MagicINFO vulnerability are ineffective and a Mirai botnet has started targeting it.</p>\n<p>The post <a href=\"https://www.securityweek.com/improperly-patched-samsung-magicinfo-vulnerability-exploited-by-botnet/\">Improperly Patched Samsung MagicINFO Vulnerability Exploited by Botnet</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/improperly-patched-samsung-magicinfo-vulnerability-exploited-by-botnet/"
    },
    {
        "Title": "Cisco Patches 35 Vulnerabilities Across Several Products",
        "Link": "https://www.securityweek.com/cisco-patches-35-vulnerabilities-across-several-products/",
        "Summary": "<p>Cisco releases patches for 26 vulnerabilities in IOS and IOS XE software, including 17 critical- and high-severity bugs.</p>\n<p>The post <a href=\"https://www.securityweek.com/cisco-patches-35-vulnerabilities-across-several-products/\">Cisco Patches 35 Vulnerabilities Across Several Products</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cisco-patches-35-vulnerabilities-across-several-products/"
    },
    {
        "Title": "Dozens of SysAid Instances Vulnerable to Remote Hacking",
        "Link": "https://www.securityweek.com/dozens-of-sysaid-instances-vulnerable-to-remote-hacking/",
        "Summary": "<p>SysAid patches IT service management software vulnerabilities that can be chained for unauthenticated remote command execution. </p>\n<p>The post <a href=\"https://www.securityweek.com/dozens-of-sysaid-instances-vulnerable-to-remote-hacking/\">Dozens of SysAid Instances Vulnerable to Remote Hacking</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/dozens-of-sysaid-instances-vulnerable-to-remote-hacking/"
    },
    {
        "Title": "Masimo Manufacturing Facilities Hit by Cyberattack",
        "Link": "https://www.securityweek.com/masimo-manufacturing-facilities-hit-by-cyberattack/",
        "Summary": "<p>Health technology and consumer electronics firm Masimo detected unauthorized activity on its network in late April.</p>\n<p>The post <a href=\"https://www.securityweek.com/masimo-manufacturing-facilities-hit-by-cyberattack/\">Masimo Manufacturing Facilities Hit by Cyberattack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-08",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/masimo-manufacturing-facilities-hit-by-cyberattack/"
    }
]