[
    {
        "Title": "Over 70 Malicious npm and VS Code Packages Found Stealing Data and Crypto",
        "Link": "https://thehackernews.com/2025/05/over-70-malicious-npm-and-vs-code.html",
        "Summary": "As many as 60 malicious npm packages have been discovered in the package registry with malicious functionality to harvest hostnames, IP addresses, DNS servers, and user directories to a Discord-controlled endpoint.\nThe packages, published under three different accounts, come with an install‑time script that's triggered during npm install, Socket security researcher Kirill Boychenko said in a",
        "Date": "2025-05-26",
        "Content": "As many as 60 malicious npm packages have been discovered in the package registry with malicious functionality to harvest hostnames, IP addresses, DNS servers, and user directories to a Discord-controlled endpoint.\nThe packages, published under three different accounts, come with an install‑time script that's triggered during npm install, Socket security researcher Kirill Boychenko said in a report published last week. The libraries have been collectively downloaded over 3,000 times.\n\"The script targets Windows, macOS, or Linux systems, and includes basic sandbox‑evasion checks, making every infected workstation or continuous‑integration node a potential source of valuable reconnaissance,\" the software supply chain security firm\nsaid\n.\nThe names of the three accounts, each of which published 20 packages within an 11-day time period, are listed below. The accounts no longer exist on npm -\nbbbb335656\ncdsfdfafd1232436437, and\nsdsds656565\nThe malicious code, per Socket, is explicitly designed to fingerprint every machine that installs the package, while also aborting the execution if it detects that it's running in a virtualized environment associated with Amazon, Google, and others.\nThe harvested information, which includes host details, system DNS servers, network interface card (NIC) information, and internal and external IP addresses, is then transmitted to a Discord webhook.\n\"By harvesting internal and external IP addresses, DNS servers, usernames, and project paths, it enables a threat actor to chart the network and identify high‑value targets for future campaigns,\" Boychenko said.\nThe disclosure follows another set of eight npm packages that masquerade as helper libraries for widely-used JavaScript frameworks including React, Vue.js, Vite, Node.js, and the open-source Quill Editor, but deploy destructive payloads once installed. They have been downloaded more than 6,200 times and are still available for download from the repository -\nvite-plugin-vue-extend\nquill-image-downloader\njs-hood\njs-bomb\nvue-plugin-bomb\nvite-plugin-bomb\nvite-plugin-bomb-extend, and\nvite-plugin-react-extend\n\"Masquerading as legitimate plugins and utilities while secretly containing destructive payloads designed to corrupt data, delete critical files, and crash systems, these packages remained undetected,\" Socket security researcher Kush Pandya\nsaid\n.\nSome of the identified packages have been found to execute automatically once developers invoke them in their projects, enabling recursive deletion of files related to Vue.js, React, and Vite. Others are designed to either corrupt fundamental JavaScript methods or tamper with browser storage mechanisms like localStorage, sessionStorage, and cookies.\nAnother package of note is js-bomb, which goes beyond deleting Vue.js framework files by also initiating a system shutdown based on the current time of the execution.\nThe activity has been traced to a threat actor named\nxuxingfeng\n, who has also published five legitimate, non-malicious packages that work as intended. Some of the rogue packages were published in 2023. \"This dual approach of releasing both harmful and helpful packages creates a facade of legitimacy that makes malicious packages more likely to be trusted and installed,\" Pandya said.\nThe findings also follow the discovery of a novel attack campaign that combines traditional email phishing with JavaScript code that's part of a malicious npm package disguised as a benign open-source library.\n\"Once communication was established, the package loaded and delivered a second-stage script that customized phishing links using the victim's email address, leading them to a fake Office 365 login page designed to steal their credentials,\" Fortra researcher Israel Cerda\nsaid\n.\nThe starting point of the attack is a phishing email containing a malicious .HTM file, which includes encrypted JavaScript code hosted on\njsDelivr\nand associated with a now-removed npm package named\ncitiycar8\n. Once installed, the JavaScript payload embedded within the package is used to initiate a URL redirection chain that eventually leads the user to a bogus landing page designed to capture their credentials.\n\"This phishing attack demonstrates a high level of sophistication, with threat actors linking technologies such as AES encryption, npm packages delivered through a CDN, and multiple redirections to mask their malicious intentions,\" Cerda said.\n\"The attack not only illustrates the creative ways that attackers attempt to evade detection but also highlights the importance of vigilance in the ever-evolving landscape of cybersecurity threats.\"\nThe abuse of open-source repositories for malware distribution has become a tried-and-tested approach for conducting supply chain attacks at scale. In recent weeks, malicious data-stealing extensions have also been uncovered in Microsoft's Visual Studio Code (VS Code) Marketplace that are engineered to siphon cryptocurrency wallet credentials by targeting Solidity developers on Windows.\nThe activity has been attributed by Datadog Security Research to a threat actor it tracks as MUT-9332. The names of the extensions are as follows -\nsolaibot\namong-eth, and\nblankebesxstnion\n\"The extensions disguise themselves as legitimate, concealing harmful code within genuine features, and use command and control domains that appear relevant to Solidity and that would not typically be flagged as malicious,\" Datadog researchers\nsaid\n.\n\"All three extensions employ complex infection chains that involve multiple stages of obfuscated malware, including one that uses a payload hidden inside an image file hosted on the Internet Archive.\"\nSpecifically, the extensions were advertised as offering syntax scanning and vulnerability detection for Solidity developers. While they offer genuine functionality, the extensions are also designed to deliver malicious payloads that steal cryptocurrency wallet credentials from victim Windows systems. The three extensions have since been taken down.\nThe end goal of the VS Code extension is to slip a malicious Chromium-based browser extension that's capable of plundering Ethereum wallets and leaking them to a command-and-control (C2) endpoint.\nIt's also equipped to install a separate executable that disables Windows Defender scanning, scans application data directories for Discord, Chromium-based browsers, cryptocurrency wallets, and Electron applications, and retrieves and executes an additional payload from a remote server.\nMUT-9332 is also assessed to be behind a\nrecently disclosed campaign\nthat involved the use of 10 malicious VS Code extensions to install an XMRig cryptominer by passing off as coding or artificial intelligence (AI) tools.\n\"This campaign demonstrates the surprising and creative lengths to which MUT-9332 is willing to go when it comes to concealing their malicious intentions,\" Datadog said. \"These payload updates suggest that this campaign will likely continue, and the detection and removal of this first batch of malicious VS Code extensions may prompt MUT-9332 to change tactics in subsequent ones.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "CISO's Guide To Web Privacy Validation And Why It's Important",
        "Link": "https://thehackernews.com/2025/05/cisos-guide-to-web-privacy-validation.html",
        "Summary": "Are your web privacy controls protecting your users, or just a box-ticking exercise? This CISO’s guide provides a practical roadmap for continuous web privacy validation that’s aligned with real-world practices.\n– Download the full guide here.\n\n\nWeb Privacy: From Legal Requirement to Business Essential\nAs regulators ramp up enforcement and users grow more privacy-aware, CISOs face a mounting",
        "Date": "2025-05-26",
        "Content": "Are your web privacy controls protecting your users, or just a box-ticking exercise? This CISO's guide provides a practical roadmap for continuous web privacy validation that's aligned with real-world practices.\n– Download the full guide\nhere\n.\nWeb Privacy: From Legal Requirement to Business Essential\nAs regulators ramp up enforcement and users grow more privacy-aware, CISOs face a mounting challenge: ensuring that what their organization\nsays\nabout privacy matches what their digital assets are\ndoing\n.\n70%\nof top US websites still drop advertising cookies even when users opt out, a clear contradiction of privacy claims. This gap exposes organizations to compliance failures, reputational damage, and user distrust.\nA Practical Approach to Web Privacy Validation\nDrawing from real-world incidents and regulatory trends,\nthis guide\noutlines how CISOs can integrate continuous privacy validation into their security operations and explains why it's becoming a foundational practice.\nReactive vs Proactive Web Privacy Programs\nMost privacy programs rely on static audits and ineffective cookie banners, but these are poorly suited for today's dynamic web. The modern web has made these techniques obsolete and elevated the role of continuous monitoring—it's now essential for maintaining regulatory compliance.\nReliance on the old reactive approach leads to silent privacy drift, which can trigger:\nUnauthorized data collection:\nFor example, a new marketing pixel\nsilently collecting user IDs\n, or a third-party script tracking behavior that strays outside of the stated policy.\nBroken consent mechanisms:\nCookie consent that resets after updates, or embedded content dropping cookies before the user consents.\nNon-compliance:\nA form update unintentionally collecting extra, undisclosed personal data; an AI chatbot processing queries without the required transparency.\nBrand damage:\nUsers noticing an unexpected widget accessing location data without their clear consent.\nThe takeaway: Privacy risks are hiding in plain sight. A proactive approach is more likely to hunt them down before any damage is done.\nReactive vs Proactive Privacy Programs: Scenario Comparison\nAspect/ Scenario\nReactive Privacy Program (Traditional)\nProactive Privacy Program (Continuous Validation)\nApproach\nPeriodic, manual audits and static compliance checks.\nContinuous, automated monitoring and validation in production.\nDetection of New Risks\nNew scripts, vendors, or third-party tools may go unnoticed for months.\nEvery page load and code change is scanned for new trackers/scripts.\nTime to Discovery\nWeeks or months—typically only found after user complaints or a regulator inquiry.\nMinutes or hours—automated alert triggers immediate investigation.\nRegulatory Risk\nHigh: Undetected issues can lead to major fines and investigations.\nLow: Issues are caught early, reducing exposure and demonstrating diligence.\nRemediation Validation\nFixes are assumed to work, but rarely verified in production.\nAutomated validation confirms that remediations are effective.\nResource Efficiency\nHigh manual effort, prone to oversight (issues can be missed) and burnout.\nAutomated workflows free up teams for higher-value tasks.\nAdaptation to New Regulations\nScrambles to keep up; often playing catch-up with new laws and frameworks.\nAgile response; continuous validation meets evolving\nrequirements.\nScenario Walkthrough: The Leaky Script\nStep\nReactive Program\nProactive Program\nScript added to website\nNo immediate detection\nDetected instantly as a new third-party element.\nData leakage begins\nContinues for months, often unnoticed.\nAlert issued; data flow flagged as policy violation.\nDiscovery\nDiscovered only after complaints or regulatory inquiry.\nPrivacy team investigates within hours of the alert.\nResponse\nScramble to contain, investigate, and report; faces regulatory fines.\nIssue remediated quickly, minimizing exposure and risk.\nOutcome\n€4.5M fine, public backlash, loss of trust.\nNo fine, incident averted, trust preserved.\nDownload the full CISO's guide\nhere\n.\nWhat Is Website Privacy Validation?\nWebsite Privacy Validation\ntools shift privacy from reactive to proactive by continuously monitoring your websites, applications, and third-party code\nlive in production.\nThis ensures that your real-world activity aligns with your declared policies.\nKey capabilities: Continuous Data Mapping, Policy Matching, Instant Alerts, Fix Validation, and Dashboard Oversight.\nWhy Continuous Validation Is the New Standard\nOnly\n20%\nof companies feel confident in their privacy compliance, but continuous validation removes doubt. It strengthens compliance, simplifies audits, and integrates into existing security workflows, thanks to agentless deployment of some vendors that minimizes operational overhead.\nCase in Point: The Cost of Inaction\nA global retailer launched a loyalty program, but unknown to them, it included a third-party script that was sending customer emails to an external domain. This went undetected for four months and eventually led to a €4.5 million fine, public backlash, and a loss of executive trust. With privacy validation, the issue could have been resolved in hours, not months, and all that expensive fallout could have been avoided.\nMuch like the global retailer, providers in both the healthcare and financial services industries have opened themselves up to serious repercussions after failing to proactively validate web privacy. For instance, a hospital network neglected to validate the third-party analytics scripts running on its site, which left them free to silently collect patient data without consent. This violated HIPAA regulations, risked fines, and damaged patient trust.\nSimilarly, a bank suffered a data breach when a third-party vendor added a tracking script that accessed sensitive account information without proper authorization. In both cases, web privacy validation could have immediately flagged these issues, preventing unauthorized data collection, avoiding legal repercussions, and preserving customer trust across these highly regulated sectors.\nGet Ready for 2025's Tougher Regulations\nNew frameworks like the EU AI Act and New Hampshire's NHPA are changing how organizations approach privacy. CISOs now face unprecedented validation requirements, including:\nComprehensive AI risk assessments with continuous algorithm transparency\nAdvanced consent mechanisms that dynamically respond to signals like Global Privacy Control\nRigorous safeguards for sensitive data processing across all digital touchpoints\nMandatory documentation and technical validation of privacy controls\nCross-border data transfer mechanisms that withstand increasing scrutiny\nThe regulatory landscape isn't just evolving—it's accelerating, so organizations that implement continuous web privacy validation now will be strategically positioned to navigate these complex requirements while their competitors are scrambling to catch up.\nDon't Wait for a Violation Before You Take Action\nExplore actionable steps and real-world examples in the full CISO's Guide to Web Privacy Validation.\n→\nDownload the full CISO's Guide to Web Privacy Validation here\n.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "⚡ Weekly Recap: APT Campaigns, Browser Hijacks, AI Malware, Cloud Breaches and Critical CVEs",
        "Link": "https://thehackernews.com/2025/05/weekly-recap-apt-campaigns-browser.html",
        "Summary": "Cyber threats don't show up one at a time anymore. They’re layered, planned, and often stay hidden until it’s too late.\nFor cybersecurity teams, the key isn’t just reacting to alerts—it’s spotting early signs of trouble before they become real threats. This update is designed to deliver clear, accurate insights based on real patterns and changes we can verify. With today’s complex systems, we",
        "Date": "2025-05-26",
        "Content": "Cyber threats don't show up one at a time anymore. They're layered, planned, and often stay hidden until it's too late.\nFor cybersecurity teams, the key isn't just reacting to alerts—it's spotting early signs of trouble before they become real threats. This update is designed to deliver clear, accurate insights based on real patterns and changes we can verify. With today's complex systems, we need focused analysis—not noise.\nWhat you'll see here isn't just a list of incidents, but a clear look at where control is being gained, lost, or quietly tested.\n⚡ Threat of the Week\nLumma Stealer, DanaBot Operations Disrupted\n— A coalition of private sector companies and law enforcement agencies have taken down the infrastructure associated with\nLumma Stealer\nand\nDanaBot\n. Charges have also been unsealed against 16 individuals for their alleged involvement in the development and deployment of DanaBot. The malware is equipped to siphon data from victim computers, hijack banking sessions, and steal device information. More uniquely, though, DanaBot has also been used for hacking campaigns that appear to be linked to Russian state-sponsored interests. All of that makes DanaBot a particularly clear example of how commodity malware has been repurposed by Russian state hackers for their own goals. In tandem, about 2,300 domains that acted as the command-and-control (C2) backbone for the Lumma information stealer have been seized, alongside\ntaking down 300 servers and neutralizing 650 domains\nthat were used to launch ransomware attacks. The actions against international cybercrime in the past few days constituted the latest phase of Operation Endgame.\nIt's not you. It's Python\nMore security teams are moving away from custom scripts like Python, PowerShell, and Bash in favor of low-code platforms. Why? This new Tines guide breaks it down. Inside, you'll find a side-by-side comparison of Tines vs Python across HTTP requests, webhooks, data manipulation, and more.\nGet the Guide ➝\n🔔 Top News\nThreat Actors Use TikTok Videos to Distribute Stealers\n— While ClickFix has become a popular social engineering tactic to deliver malware, threat actors have been\nobserved\nusing artificial intelligence (AI)-generated videos uploaded to TikTok to deceive users into running malicious commands on their systems and deploy malware like Vidar and StealC under the guise of activating pirated version of Windows, Microsoft Office, CapCut, and Spotify. \"This campaign highlights how attackers are ready to weaponize whichever social media platforms are currently popular to distribute malware,\" Trend Micro said.\nAPT28 Hackers Target Western Logistics and Tech Firms\n— Several cybersecurity and intelligence agencies from Australia, Europe, and the United States issued a joint alert warning of a state-sponsored campaign orchestrated by the Russian state-sponsored threat actor APT28 targeting Western logistics entities and technology companies since 2022. \"This cyber espionage-oriented campaign targeting logistics entities and technology companies uses a mix of previously disclosed TTPs and is likely connected to these actors' wide scale targeting of IP cameras in Ukraine and bordering NATO nations,\" the agencies\nsaid\n. The attacks are designed to steal sensitive information and maintain long-term persistence on compromised hosts.\nChinese Threat Actors Exploit Ivanti EPMM Flaws\n— The China-nexus cyber espionage group tracked as UNC5221 has been\nattributed\nto the exploitation of a pair of security flaws affecting Ivanti Endpoint Manager Mobile (EPMM) software (CVE-2025-4427 and CVE-2025-4428) to target a wide range of sectors across Europe, North America, and the Asia-Pacific region. The intrusions leverage the vulnerabilities to obtain a reverse shell and drop malicious payloads like KrustyLoader, which is known to deliver the Sliver command-and-control (C2) framework. \"UNC5221 demonstrates a deep understanding of EPMM's internal architecture, repurposing legitimate system components for covert data exfiltration,\" EclecticIQ said. \"Given EPMM's role in managing and pushing configurations to enterprise mobile devices, a successful exploitation could allow threat actors to remotely access, manipulate, or compromise thousands of managed devices across an organization.\"\nOver 100 Google Chrome Extensions Mimic Popular Tools\n— An unknown threat actor has been\nattributed\nto creating several malicious Chrome Browser extensions since February 2024 that masquerade as seemingly benign utilities such as DeepSeek, Manus, DeBank, FortiVPN, and Site Stats but incorporate covert functionality to exfiltrate data, receive commands, and execute arbitrary code. Links to these browser add-ons are hosted on specially crafted sites to which users are likely redirected to via phishing and social media posts. While the extensions appear to offer the advertised features, they also stealthily facilitate credential and cookie theft, session hijacking, ad injection, malicious redirects, traffic manipulation, and phishing via DOM manipulation. Several of these extensions have been taken down by Google.\nCISA Warns of SaaS Providers of Attacks Targeting Cloud Environments\n— The U.S. Cybersecurity and Infrastructure Security Agency (CISA)\nwarned\nthat SaaS companies are under threat from bad actors who are on the prowl for cloud applications with default configurations and elevated permissions. While the agency did not attribute the activity to a specific group, the advisory said enterprise backup platform Commvault is monitoring cyber threat activity targeting applications hosted in their Microsoft Azure cloud environment. \"Threat actors may have accessed client secrets for Commvault's (Metallic) Microsoft 365 (M365) backup software-as-a-service (SaaS) solution, hosted in Azure,\" CISA said. \"This provided the threat actors with unauthorized access to Commvault's customers' M365 environments that have application secrets stored by Commvault.\"\nGitLab AI Coding Assistant Flaws Could Be Used to Inject Malicious Code\n— Cybersecurity researchers have\ndiscovered\nan indirect prompt injection flaw in GitLab's artificial intelligence (AI) assistant Duo that could have allowed attackers to steal source code and inject untrusted HTML into its responses, which could then be used to direct victims to malicious websites. The attack could also leak confidential issue data, such as zero-day vulnerability details. All that's required is for the attacker to instruct the chatbot to interact with a merge request (or commit, issue, or source code) by taking advantage of the fact that GitLab Duo has extensive access to the platform. \"By embedding hidden instructions in seemingly harmless project content, we were able to manipulate Duo's behavior, exfiltrate private source code, and demonstrate how AI responses can be leveraged for unintended and harmful outcomes,\" Legit Security said. One variation of the attack involved hiding a malicious instruction in an otherwise legitimate piece of source code, while another exploited Duo's parsing of markdown responses in real-time asynchronously. An attacker could leverage this behavior – that Duo begins rendering the output line by line rather than waiting until the entire response is generated and sending it all at once – to introduce malicious HTML code that can access sensitive data and exfiltrate the information to a remote server. The issues have been patched by GitLab following responsible disclosure.\n‎️‍🔥 Trending CVEs\nSoftware vulnerabilities remain one of the simplest—and most effective—entry points for attackers. Each week uncovers new flaws, and even small delays in patching can escalate into serious security incidents. Staying ahead means acting fast. Below is this week's list of high-risk vulnerabilities that demand attention. Review them carefully, apply updates without delay, and close the doors before they're forced open.\nThis week's list includes —\nCVE-2025-34025, CVE-2025-34026, CVE-2025-34027\n(Versa Concerto),\nCVE-2025-30911\n(RomethemeKit For Elementor WordPress plugin),\nCVE-2024-57273\n,\nCVE-2024-54780\n, and\nCVE-2024-54779\n(\npfSense\n),\nCVE-2025-41229\n(VMware Cloud Foundation),\nCVE-2025-4322\n(Motors WordPress theme),\nCVE-2025-47934\n(OpenPGP.js),\nCVE-2025-30193\n(PowerDNS),\nCVE-2025-0993\n(GitLab),\nCVE-2025-36535\n(AutomationDirect MB-Gateway),\nCVE-2025-47949\n(Samlify),\nCVE-2025-40775\n(BIND DNS),\nCVE-2025-20152\n(Cisco Identity Services Engine),\nCVE-2025-4123\n(Grafana),\nCVE-2025-5063\n(Google Chrome),\nCVE-2025-37899\n(\nLinux Kernel\n),\nCVE-2025-26817\n(Netwrix Password Secure),\nCVE-2025-47947\n(ModSecurity),\nCVE-2025-3078\n,\nCVE-2025-3079\n(Canon Printers), and\nCVE-2025-4978\n(NETGEAR).\n📰 Around the Cyber World\nSandworm Drops New Wiper in Ukraine\n— The Russia-aligned\nSandworm\ngroup intensified destructive operations against Ukrainian energy companies, deploying a new wiper named ZEROLOT. \"The infamous Sandworm group concentrated heavily on compromising Ukrainian energy infrastructure. In recent cases, it deployed the ZEROLOT wiper in Ukraine. For this, the attackers abused Active Directory Group Policy in the affected organizations,\" ESET Director of Threat Research, Jean-Ian Boutin,\nsaid\n. Another Russian hacking group,\nGamaredon\n, remained the most prolific actor targeting the East European nation, enhancing malware obfuscation and introducing PteroBox, a file stealer leveraging Dropbox.\nSignal Says No to Recall\n— Signal has released a new version of its messaging app for Windows that, by default, blocks the ability of Windows to use Recall to periodically take screenshots of the app. \"Although Microsoft made several adjustments over the past twelve months in response to critical feedback, the revamped version of Recall still places any content that's displayed within privacy-preserving apps like Signal at risk,\" Signal\nsaid\n. \"As a result, we are enabling an extra layer of protection by default on Windows 11 in order to help maintain the security of Signal Desktop on that platform even though it introduces some usability trade-offs. Microsoft has simply given us no other option.\" Microsoft\nbegan\nofficially rolling out Recall last month.\nRussia Introduces New Law to Track Foreigners Using Their Smartphones\n— The Russian government has\nintroduced\na new law that makes installing a tracking app mandatory for all foreign nationals in the Moscow region. This includes gathering their real-time locations, fingerprint, face photograph, and residential information. \"The adopted mechanism will allow, using modern technologies, to strengthen control in the field of migration and will also contribute to reducing the number of violations and crimes in this area,\" Vyacheslav Volodin, chairman of the State Duma, said. \"If migrants change their actual place of residence, they will be required to inform the Ministry of Internal Affairs (MVD) within three working days.\" A proposed four-year trial period begins on September 1, 2025, and runs until September 1, 2029.\nDutch Government Passes Law to Criminalize Cyber Espionage\n— The Dutch government has\napproved\na law criminalizing a wide range of espionage activities, including digital espionage, in an effort to protect national security, critical infrastructure, and high-quality technologies. Under the amended law, leaking sensitive information that is not classified as a state secret or engaging in activities on behalf of a foreign government that harm Dutch interests can also result in criminal charges. \"Foreign governments are also interested in non-state-secret, sensitive information about a particular economic sector or about political decision-making,\" the government said. \"Such information can be used to influence political processes, weaken the Dutch economy or play allies against each other. Espionage can also involve actions other than sharing information.\"\nMicrosoft Announces Availability of Quantum-Resistant Algorithms to SymCrypt\n— Microsoft has revealed that it's making post-quantum cryptography (\nPQC\n) capabilities, including ML-KEM and ML-DSA, available for Windows Insiders, Canary Channel Build 27852 and higher, and Linux, SymCrypt-OpenSSL version 1.9.0. \"This advancement will enable customers to commence their exploration and experimentation of PQC within their operational environments,\" Microsoft\nsaid\n. \"By obtaining early access to PQC capabilities, organizations can proactively assess the compatibility, performance, and integration of these novel algorithms alongside their existing security infrastructure.\"\nNew Malware DOUBLELOADER Uses ALCATRAZ for Obfuscation\n— The open-source obfuscator\nALCATRAZ\nhas been seen within a new generic loader dubbed DOUBLELOADER, which has been deployed alongside Rhadamanthys Stealer infections starting December 2024. The malware collects host information, requests an updated version of itself, and starts beaconing to a hardcoded IP address (185.147.125[.]81) stored within the binary. \"Obfuscators such as ALCATRAZ end up increasing the complexity when triaging malware,\" Elastic Security Labs\nsaid\n. \"Its main goal is to hinder binary analysis tools and increase the time of the reverse engineering process through different techniques; such as hiding the control flow or making decompilation hard to follow.\"\nNew Formjacking Campaign Targets WooCommerce Sites\n— Cybersecurity researchers have detected a sophisticated formjacking campaign targeting WooCommerce sites. The malware, per Wordfence, injects a fake but professional-looking payment form into legitimate checkout processes and exfiltrates sensitive customer data to an external server. Further analysis has revealed that the infection likely originated from a compromised WordPress admin account, which was used to inject malicious JavaScript via a Simple Custom CSS and JS plugin (or something similar) that allows administrators to add custom code. \"Unlike traditional card skimmers that simply overlay existing forms, this variant carefully integrates with the WooCommerce site's design and payment workflow, making it particularly difficult for site owners and users to detect,\" the WordPress security company said. \"The malware author repurposed the browser's localStorage mechanism – typically used by websites to remember user preferences – to silently store stolen data and maintain access even after page reloads or when navigating away from the checkout page.\"\nE.U. Sanctions Stark Industries\n— The European Union (E.U.) has\nannounced\nsanctions against 21 individuals and six entities in Russia over its \"destabilising actions\" in the region. One of the sanctioned entities is Stark Industries, a bulletproof hosting provider that has been accused of acting as \"enablers of various Russian state-sponsored and affiliated actors to conduct destabilising activities including, information manipulation interference and cyber attacks against the Union and third countries.\" The sanctions also target its CEO Iurie Neculiti and owner Ivan Neculiti. Stark Industries was previously\nspotlighted\nby independent cybersecurity journalist Brian Krebs, detailing its\nuse in DDoS attacks\nin Ukraine and across Europe. In August 2024, Team Cymru said it\ndiscovered\n25 Stark-assigned IP addresses used to host domains associated with FIN7 activities and that it had been working with Stark Industries for several months to identify and reduce abuse of their systems. The sanctions have also targeted Kremlin-backed manufacturers of drones and radio communication equipment used by the Russian military, as well as those involved in GPS signal jamming in Baltic states and disrupting civil aviation.\nThe Mask APT Unmasked as Tied to the Spanish Government\n— The mysterious threat actor known as\nThe Mask\n(aka Careto) has been identified as run by the Spanish government, according to a\nreport\npublished by TechCrunch, citing people who worked at Kaspersky at the time and had knowledge of the investigation. The Russian cybersecurity company first exposed the hacking group in 2014, linking it to highly sophisticated attacks since at least 2007 targeting high-profile organizations, such as governments, diplomatic entities, and research institutions. A majority of the group's attacks have targeted Cuba, followed by hundreds of victims in Brazil, Morocco, Spain, and Gibraltar. While Kaspersky has not publicly attributed it to a specific country, the latest revelation makes The Mask one of the few Western government hacking groups that has ever been discussed in public. This includes\nthe Equation Group, the Lamberts\n(the U.S.), and\nAnimal Farm\n(\nFrance\n).\nSocial Engineering Scams Target Coinbase Users\n— Earlier this month, cryptocurrency exchange Coinbase\nrevealed\nthat it was the victim of a malicious attack perpetrated by unknown threat actors to breach its systems by bribing customer support agents in India and siphon funds from nearly 70,000 customers. According to Blockchain security firm SlowMist, Coinbase users have been the target of social engineering scams since the start of the year, bombarding with SMS messages claiming to be fake withdrawal requests and seeking their confirmation as part of a \"sustained and organized scam campaign.\" The goal is to induce a false sense of urgency and trick them into calling a number, eventually convincing them to transfer the funds to a secure wallet with a seed phrase pre-generated by the attackers and ultimately drain the assets. It's assessed that the activities are primarily carried out by two groups: low-level skid attackers from the Com community and organized cybercrime groups based in India. \"Using spoofed PBX phone systems, scammers impersonate Coinbase support and claim there's been 'unauthorized access' or 'suspicious withdrawals' on the user's account,\" SlowMist\nsaid\n. \"They create a sense of urgency, then follow up with phishing emails or texts containing fake ticket numbers or 'recovery links.'\"\nDelta Can Sue CrowdStrike Over July 2024 Mega Outage\n— Delta Air Lines, which had its systems crippled and almost 7,000 flights canceled in the wake of a\nmassive outage\ncaused by a faulty update issued by CrowdStrike in mid-July 2024, has been given the green light to pursue to its lawsuit against the cybersecurity company. A judge in the U.S. state of Georgia stating Delta can try to prove that CrowdStrike was grossly negligent by pushing a defective update to its Falcon software to customers. The update crashed 8.5 million Windows devices across the world. Crowdstrike previously claimed that the airline had rejected technical support offers both from itself and Microsoft. In a\nstatement\nshared with Reuters, lawyers representing CrowdStrike said they were \"confident the judge will find Delta's case has no merit, or will limit damages to the 'single-digit millions of dollars' under Georgia law.\" The development comes months after MGM Resorts International\nagreed\nto pay $45 million to settle multiple class-action lawsuits related to a data breach in 2019 and a ransomware attack the company experienced in 2023.\nStorm-1516 Uses AI-Generated Media to Spread Disinformation\n— The Russian influence operation known as\nStorm-1516\n(aka\nCopyCop\n) sought to spread narratives that undermined the European support for Ukraine by amplifying fabricated stories on X about European leaders using drugs while traveling by train to Kyiv for peace talks. One of the posts was subsequently shared by Russian state media and Maria Zakharova, a senior official in Russia's foreign ministry, as part of what has been described as a coordinated disinformation campaign by EclecticIQ. The activity is also notable for the use of synthetic content depicting French President Emmanuel Macron, U.K. Labour Party leader Keir Starmer, and German chancellor Friedrich Merz of drug possession during their return from Ukraine. \"By attacking the reputation of these leaders, the campaign likely aimed to turn their own voters against them, using influence operations (IO) to reduce public support for Ukraine by discrediting the politicians who back it,\" the Dutch threat intelligence firm\nsaid\n.\nTurkish Users Targeted by DBatLoader\n— AhnLab has disclosed details of a malware campaign that's distributing a malware loader called\nDBatLoader\n(aka ModiLoader) via banking-themed banking emails, which then acts as a conduit to deliver SnakeKeylogger, an information stealer developed in .NET. \"The DBatLoader malware distributed through phishing emails has the cunning behavior of exploiting normal processes (easinvoker.exe, loader.exe) through techniques such as DLL side-loading and injection for most of its behaviors, and it also utilizes normal processes (cmd.exe, powershell.exe, esentutl.exe, extrac32.exe) for behaviors such as file copying and changing policies,\" the company\nsaid\n.\nSEC SIM-Swapper Sentenced to 14 Months for SEC X Account Hack\n— A 26-year-old Alabama man, Eric Council Jr., has been\nsentenced\nto 14 months in prison and three years of supervised release for using SIM swapping attacks to breach the U.S. Securities and Exchange Commission's (SEC) official X account in January 2024 and falsely announced that the SEC approved Bitcoin (BTC) Exchange Traded Funds (ETFs). Council Jr. (aka Ronin, Agiantschnauzer, and @EasyMunny) was arrested in October 2024 and pleaded guilty to the crime earlier this February. He has also been ordered to forfeit $50,000. According to court documents, Council used his personal computer to search incriminating phrases such as \"SECGOV hack,\" \"telegram sim swap,\" \"how can I know for sure if I am being investigated by the FBI,\" \"What are the signs that you are under investigation by law enforcement or the FBI even if you have not been contacted by them,\" \"what are some signs that the FBI is after you,\" \"Verizon store list,\" \"federal identity theft statute,\" and \"how long does it take to delete telegram account.\"\nFBI Warns of Malicious Campaign Impersonating Government Officials\n— The U.S. Federal Bureau of Investigation (FBI) is warning of a new campaign that involves malicious actors impersonating senior U.S. federal or state government officials and their contacts to target individuals since April 2025. \"The malicious actors have sent text messages and AI-generated voice messages — techniques known as smishing and vishing, respectively — that claim to come from a senior US official in an effort to establish rapport before gaining access to personal accounts,\" the FBI\nsaid\n. \"One way the actors gain such access is by sending targeted individuals a malicious link under the guise of transitioning to a separate messaging platform.\" From there, the actor may present malware or introduce hyperlinks that lead intended targets to an actor-controlled site that steals login information.\nDICOM Flaw Enables Attackers to Embed Malicious Code Within Medical Image Files\n— Praetorian has\nreleased\na proof-of-concept (PoC) for a high-severity security flaw in Digital Imaging and Communications in Medicine (DICOM), predominant file format for medical images, that enables attackers to embed malicious code within legitimate medical image files. CVE-2019-11687 (CVSS score: 7.8), originally\ndisclosed\nin 2019 by Markel Picado Ortiz, stems from a design decision that allows arbitrary content at the start of the file, otherwise called the Preamble, which enables the creation of malicious polyglots. Codenamed ELFDICOM, the PoC extends the attack surface to Linux environments, making it a much more potent threat. As mitigations, it's advised to implement a DICOM preamble whitelist. \"DICOM's file structure inherently allows arbitrary bytes at the beginning of the file, where Linux and most operating systems will look for magic bytes,\" Praetorian researcher Ryan Hennessee said. \"[The whitelist] would check a DICOM file's preamble before it is imported into the system. This would allow known good patterns, such as 'TIFF' magic bytes, or '\\x00' null bytes, while files with the ELF magic bytes would be blocked.\"\nCookie-Bite Attack Uses Chrome Extension to Steal Session Tokens\n— Cybersecurity researchers have demonstrated a new attack technique called Cookie-Bite that employs custom-made malicious browser extensions to steal \"ESTAUTH\" and \"ESTSAUTHPERSISTNT\" cookies in Microsoft Azure Entra ID and bypass multi-factor authentication (MFA). The attack has multiple moving parts to it: A custom Chrome extension that monitors authentication events and captures cookies; a PowerShell script that automates the extension deployment and ensures persistence; an exfiltration mechanism to send the cookies to a remote collection point; and a complementary extension to inject the captured cookies into the attacker's browser. \"Threat actors often use infostealers to extract authentication tokens directly from a victim's machine or buy them directly through darkness markets, allowing adversaries to hijack active cloud sessions without triggering MFA,\" Varonis said. \"By injecting these cookies while mimicking the victim's OS, browser, and network, attackers can evade Conditional Access Policies (CAPs) and maintain persistent access.\" Authentication cookies can also be stolen using adversary-in-the-middle (AitM) phishing kits in real-time, or using rogue browser extensions that request excessive permissions to interact with web sessions, modify page content, and extract stored authentication data. Once installed, the extension can access the browser's storage API, intercept network requests, or inject malicious JavaScript into active sessions to harvest real-time session cookies. \"By leveraging stolen session cookies, an adversary can bypass authentication mechanisms, gaining seamless entry into cloud environments without requiring user credentials,\" Varonis said. \"Beyond initial access, session hijacking can facilitate lateral movement across the tenant, allowing attackers to explore additional resources, access sensitive data, and escalate privileges by abusing existing permissions or misconfigured roles.\"\n🎥 Cybersecurity Webinars\nNon-Human Identities: The AI Backdoor You're Not Watching\n→ AI agents rely on Non-Human Identities (like service accounts and API keys) to function—but these are often left untracked and unsecured. As attackers shift focus to this hidden layer, the risk is growing fast. In this session, you'll learn how to find, secure, and monitor these identities before they're exploited. Join the webinar to understand the real risks behind AI adoption—and how to stay ahead.\nInside the LOTS Playbook: How Hackers Stay Undetected\n→ Attackers are using trusted sites to stay hidden. In this webinar, Zscaler experts share how they detect these stealthy LOTS attacks using insights from the world's largest security cloud. Join to learn how to spot hidden threats and improve your defense.\n🔧 Cybersecurity Tools\nScriptSentry\n→ It is a free tool that scans your environment for dangerous logon script misconfigurations—like plaintext credentials, insecure file/share permissions, and references to non-existent servers. These overlooked issues can enable lateral movement, privilege escalation, or even credential theft. ScriptSentry helps you quickly identify and fix them across large Active Directory environments.\nAftermath\n→ It is a Swift-based, open-source tool for macOS incident response. It collects forensic data—like logs, browser activity, and process info—from compromised systems, then analyzes it to build timelines and track infection paths. Deploy via MDM or run manually. Fast, lightweight, and ideal for post-incident investigation.\nAI Red Teaming Playground Labs\n→ It is an open-source training suite with hands-on challenges designed to teach security professionals how to red team AI systems. Originally developed for Black Hat USA 2024, the labs cover prompt injections, safety bypasses, indirect attacks, and Responsible AI failures. Built on Chat Copilot and deployable via Docker, it's a practical resource for testing and understanding real-world AI vulnerabilities.\n🔒 Tip of the Week\nReview and Revoke Old OAuth App Permissions — They're Silent Backdoor →\nYou've likely logged into apps using \"Continue with Google,\" \"Sign in with Microsoft,\" or GitHub/Twitter/Facebook logins. That's OAuth. But did you know many of those apps still have access to your data long after you stop using them?\nWhy it matters:\nEven if you delete the app or forget it existed, it might still have ongoing access to your calendar, email, cloud files, or contact list — no password needed. If that third-party gets breached, your data is at risk.\nWhat to do:\nGo through your connected apps here:\nGoogle: myaccount.google.com/permissions\nMicrosoft: account.live.com/consent/Manage\nGitHub: github.com/settings/applications\nFacebook: facebook.com/settings?tab=applications\nRevoke anything you don't actively use. It's a fast, silent cleanup — and it closes doors you didn't know were open.\nConclusion\nLooking ahead, it's not just about tracking threats—it's about understanding what they reveal. Every tactic used, every system tested, points to deeper issues in how trust, access, and visibility are managed. As attackers adapt quickly, defenders need sharper awareness and faster response loops.\nThe takeaways from this week aren't just technical—they speak to how teams prioritize risk, design safeguards, and make choices under pressure. Use these insights not just to react, but to rethink what \"secure\" really needs to mean in today's environment.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Google claims users find ads in AI search 'helpful'",
        "Link": "https://www.bleepingcomputer.com/news/google/google-claims-users-find-ads-in-ai-search-helpful/",
        "Summary": "Google AI mode and AI Overviews now have ads, which, according to the search engine giant, are \"helpful.\" [...]",
        "Date": "2025-05-26",
        "Content": "Google AI mode and AI Overviews now have ads, which, according to the search engine giant, are \"helpful.\"\nAt the Google Marketing Live event last week, Google\nconfirmed\nit has started rolling out ads to AI mode and AI Overviews in the US, which create new \"opportunities for customers.\"\nWhile I haven't seen ads in AI Overviews, some users\nspotted\nthem last week, and these ads appear below the AI Overviews, followed by the traditional blue links.\nAds in Google AI overviews (Desktop)\nIn a\nsupport document\nspotted by\nSER\n, Google described ads in AI search results as a new way to find information on the web.\nSEO consultant\nGagan Ghotra\npointed out an interesting excerpt in the document that claims users find ads in these AI search results helpful.\n\"Google internal data shows that people have been finding the ads within AI Overviews helpful because they can quickly connect with relevant businesses, products, and services to take the next step at the exact moment they need them,\" the company wrote in the document.\nGoogle won't share the numbers or methodology of its \"internal data,\" but it wants you to believe that ads are helpful, especially in AI search results.\nAds aren't necessarily bad, but they're certainly not helpful when they mislead users or appear above the actual content and disrupt the flow.\nGoogle\nreported\n$72.5 billion in advertising revenue in its last quarterly report, and it's expected to increase as ads expand beyond the blue links.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nGoogle Chrome to use on-device AI to detect tech support scams\nGoogle NotebookLM is now using Gemini 2.5 Flash\nGoogle takes on Cursor with Firebase Studio, its AI builder for vibe coding\nGoogle Gemini AI is getting ChatGPT-like Scheduled Actions feature\nGoogle begins unifying search country domains to Google.com"
    },
    {
        "Title": "OpenAI plans to ship an interesting ChatGPT product by 2026",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-plans-to-ship-an-interesting-chatgpt-product-by-2026/",
        "Summary": "OpenAI is planning to ship a new ChatGPT-powered product by 2026, but we aren't looking at yet another model. [...]",
        "Date": "2025-05-26",
        "Content": "OpenAI is planning to ship a new ChatGPT-powered product by 2026, but we aren't looking at yet another model.\nIn the U.S. v. Google antitrust, a\nslide deck\npointed out that OpenAI has plans to “ship a [redacted] by 2026.\"\nThe redacted line comes from the very first slide of their H1 2025 strategy, dated December 2, 2024.\nAccording to the document, “Today, ChatGPT is in our lives through existing form factors — our website, phone, and desktop apps.”\nOpenAI hopes that ChatGPT will help in your life, no matter where you are, which appears to suggest that ChatGPT could soon expand beyond website and apps.\nChatGPT “should help answer questions, play music, and suggest recipes,” while on the go, it “should help you get to places, find the best restaurants, or catch up with friends.”\nIn the office, it would “help you take meeting notes, or prepare for the big presentation.”\n\"We want ChatGPT to be [REDACTED]… The best AI is the one that’s right there with you. To do this, we will [REDACTED] 3P Confidential [REDACTED] But the best path to delivering this is [REDACTED], which will remain internally confidential for now,\" OpenAI wrote.\n\"We won’t [REDACTED] in 2025. Our aim is to [REDACTED] by 2026, but to get there, we need to start preparing now.\"\nIf you put it all together, it seems to suggest that OpenAI is working on hardware that runs ChatGPT natively and allows you to use AI in your life.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nOpenAI hints at a big upgrade for ChatGPT Operator Agent\nOpenAI plans to combine multiple models into GPT-5\nChatGPT is finally adding Download as PDF for Deep Research\nResearchers claim ChatGPT o3 bypassed shutdown in controlled test\nChatGPT Deep Research can now pull data from Dropbox and Box"
    },
    {
        "Title": "Nova Scotia Power Confirms Ransomware Attack, 280k Notified of Data Breach",
        "Link": "https://www.securityweek.com/nova-scotia-power-confirms-ransomware-attack-280k-notified-of-data-breach/",
        "Summary": "<p>Nova Scotia Power has finally admitted that the recent cyberattack was a ransomware attack, but it hasn’t paid the hackers.</p>\n<p>The post <a href=\"https://www.securityweek.com/nova-scotia-power-confirms-ransomware-attack-280k-notified-of-data-breach/\">Nova Scotia Power Confirms Ransomware Attack, 280k Notified of Data Breach</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-26",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/nova-scotia-power-confirms-ransomware-attack-280k-notified-of-data-breach/"
    },
    {
        "Title": "Alleged 500GB Data Leak Impacts Chinese Industrial Gas Giant Messer Group",
        "Link": "https://dailydarkweb.net/alleged-500gb-data-leak-impacts-chinese-industrial-gas-giant-messer-group/",
        "Summary": "A significant data leak, allegedly totaling 500GB, has reportedly impacted Messer Group China, a major player in the industrial gas sector. The purported breach, which is claimed to have occurred in May 2025, includes a wide array of sensitive data and remote desktop protocol (RDP) permissions. Messer Group is a globally recognized industrial gas company [&#8230;]",
        "Date": "2025-05-26",
        "Content": "A significant data leak, allegedly totaling 500GB, has reportedly impacted Messer Group China, a major player in the industrial gas sector. The purported breach, which is claimed to have occurred in May 2025, includes a wide array of sensitive data and remote desktop protocol (RDP) permissions.\nMesser Group is a globally recognized industrial gas company with a substantial presence in China. As a leading manufacturer and supplier of industrial, medical, and specialty gases, their operations are critical to various industries, including manufacturing, healthcare, and environmental technology. The company’s Chinese arm, mesergroup.cn, is a vital part of its international network, serving a vast client base within the region.\nThe leaked data allegedly comprises diverse file types, including spreadsheets (XLSX, CSV), documents (Word, PDF), multimedia files (MP4, MP3, JPEG), and virtual machine disk images (MDF, VMDK). The inclusion of RDP permissions in the compromised data raises particular concerns, as it could potentially grant unauthorized access to internal systems.\nAs of now, Messer Group has not publicly commented on the alleged incident. Information regarding the breach has reportedly appeared on an online forum, with claims of samples and proof of possession being available. The alleged perpetrators are also reportedly offering escrow services for interested buyers.\nThis developing situation highlights the ongoing cybersecurity challenges faced by large enterprises, particularly those with extensive digital footprints in critical industrial sectors.\nTags:\naccess\nChina\nCyberSecurity\ndata-breach\ndata-leak\nindustrial gas\nMesser\nMesser Group\nRDP"
    },
    {
        "Title": "EsSalud Peruvian Health Insurance Data Allegedly Leaked Online",
        "Link": "https://dailydarkweb.net/essalud-peruvian-health-insurance-data-allegedly-leaked-online/",
        "Summary": "A significant collection of data, allegedly linked to EsSalud, Peru&#8217;s national social health insurance provider responsible for providing healthcare services to millions, has purportedly appeared on the dark web. A sample of the data, which appears to contain personally identifiable information of Peruvian citizens, is now circulating. The exposed sample includes sensitive details such as [&#8230;]",
        "Date": "2025-05-26",
        "Content": "A significant collection of data, allegedly linked to EsSalud, Peru’s national social health insurance provider responsible for providing healthcare services to millions, has purportedly appeared on the dark web. A sample of the data, which appears to contain personally identifiable information of Peruvian citizens, is now circulating.\nThe exposed sample includes sensitive details such as names, dates of birth, gender, various identification numbers or codes, and complete residential addresses. If confirmed, the alleged breach, with claims of nearly 4 million records, represents a substantial compromise of citizen data.\nThis event underscores the persistent threats organizations face in securing vast amounts of confidential personal data from cyberattacks. Investigations into the veracity and full extent of the alleged data leak are anticipated to commence swiftly.\nTags:\nCyberSecurity\ndark web\ndata-breach\nESSALUD\nHealthcare\nInsurance\nleak\nPersonal Data\nPeru"
    }
]