[
    {
        "Title": "Russian Hackers Exploit Email and VPN Vulnerabilities to Spy on Ukraine Aid Logistics",
        "Link": "https://thehackernews.com/2025/05/russian-hackers-exploit-email-and-vpn.html",
        "Summary": "Russian cyber threat actors have been attributed to a state-sponsored campaign targeting Western logistics entities and technology companies since 2022.\nThe activity has been assessed to be orchestrated by APT28 (aka BlueDelta, Fancy Bear, or Forest Blizzard), which is linked to the Russian General Staff Main Intelligence Directorate (GRU) 85th Main Special Service Center, Military Unit 26165.",
        "Date": "2025-05-21",
        "Content": "Russian cyber threat actors have been\nattributed\nto a state-sponsored campaign targeting Western logistics entities and technology companies since 2022.\nThe activity has been assessed to be orchestrated by APT28 (aka BlueDelta, Fancy Bear, or Forest Blizzard), which is linked to the Russian General Staff Main Intelligence Directorate (GRU) 85th Main Special Service Center, Military Unit 26165.\nTargets of the campaign include companies involved in the coordination, transport, and delivery of foreign assistance to Ukraine, according to a joint advisory released by agencies from Australia, Canada, Czechia, Denmark, Estonia, France, Germany, the Netherlands, Poland, the United Kingdom, and the United States.\n\"This cyber espionage-oriented campaign targeting logistics entities and technology companies uses a mix of previously disclosed TTPs and is likely connected to these actors' wide scale targeting of IP cameras in Ukraine and bordering NATO nations,\" the bulletin\nsaid\n.\nThe alert comes weeks after France's foreign ministry\naccused\nAPT28 of mounting cyber attacks on a dozen entities including ministries, defense firms, research entities, and think tanks since 2021 in an attempt to destabilize the nation.\nThen last week, ESET took the wraps off a campaign dubbed\nOperation RoundPress\nthat it said has been ongoing since 2023 by exploiting cross-site scripting (XSS) vulnerabilities in various webmail services like Roundcube, Horde, MDaemon, and Zimbra to single out governmental entities and defense companies in Eastern Europe, as well as governments in Africa, Europe, and South America.\nAccording to the latest advisory, cyber attacks orchestrated by APT28 are said to have involved a combination of password spraying, spear-phishing, and modifying Microsoft Exchange mailbox permissions for espionage purposes.\nThe primary targets of the campaign include organizations within NATO member states and Ukraine spanning defense, transportation, maritime, air traffic management, and IT services verticals. No less than dozens of entities in Bulgaria, Czechia, France, Germany, Greece, Italy, Moldova, the Netherlands, Poland, Romania, Slovakia, Ukraine, and the United States are estimated to have been targeted.\n\"This malicious campaign by Russia's military intelligence service presents a serious risk to targeted organizations, including those involved in the delivery of assistance to Ukraine,\" Paul Chichester, Director of Operations at the National Cyber Security Centre (NCSC)\nsaid\n. \"The U.K. and partners are committed to raising awareness of the tactics being deployed.\"\nInitial access to targeted networks is said to have been facilitated by leveraging seven different methods -\nBrute-force attacks to guess credentials\nSpear-phishing attacks to harvest credentials using fake login pages impersonating government agencies and Western cloud email providers that were hosted on free third-party services or compromised SOHO devices\nSpear-phishing attacks to deliver malware\nExploitation of Outlook NTLM vulnerability (\nCVE-2023-23397\n)\nExploitation of Roundcube vulnerabilities (\nCVE-2020-12641, CVE-2020-35730, CVE-2021-44026\n)\nExploitation of internet-facing infrastructure such as corporate VPNs using public vulnerabilities and SQL injection\nExploitation of WinRAR vulnerability (\nCVE-2023-38831\n)\nOnce the Unit 26165 actors gain foothold using one of the above methods, the attacks proceed to the post-exploitation phase, which involves conducting reconnaissance to identify additional targets in key positions, individuals responsible for coordinating transport, and other companies cooperating with the victim entity.\nThe attackers have also been observed using tools like Impacket, PsExec, and Remote Desktop Protocol (RDP) for lateral movement, as well as Certipy and ADExplorer.exe to exfiltrate information from the Active Directory.\n\"The actors would take steps to locate and exfiltrate lists of Office 365 users and set up sustained email collection,\" the agencies pointed out. \"The actors used\nmanipulation of mailbox permissions\nto establish sustained email collection at compromised logistics entities.\"\nAnother notable trait of the intrusions is the use of malware families like\nHeadLace and MASEPIE\n, to establish persistence on compromised hosts and harvest sensitive information. There is no evidence that malware variants like\nOCEANMAP and STEELHOOK\nhave been used to directly target logistics or IT sectors.\nDuring data exfiltration, the threat actors have relied on different methods based on the victim environment, often utilizing PowerShell commands to create ZIP archives to upload the collected data to their own infrastructure, or employing Exchange Web Services (EWS) and Internet Message Access Protocol (IMAP) to siphon information from email servers.\n\"As Russian military forces failed to meet their military objectives and Western countries provided aid to support Ukraine's territorial defense, Unit 26165 expanded its targeting of logistics entities and technology companies involved in the delivery of aid,\" the agencies said. \"These actors have also targeted internet-connected cameras at Ukrainian border crossings to monitor and track aid shipments.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "PureRAT Malware Spikes 4x in 2025, Deploying PureLogs to Target Russian Firms",
        "Link": "https://thehackernews.com/2025/05/purerat-malware-spikes-4x-in-2025.html",
        "Summary": "Russian organizations have become the target of a phishing campaign that distributes malware called PureRAT, according to new findings from Kaspersky.\n\"The campaign aimed at Russian business began back in March 2023, but in the first third of 2025 the number of attacks quadrupled compared to the same period in 2024,\" the cybersecurity vendor said.\nThe attack chains, which have not been",
        "Date": "2025-05-21",
        "Content": "Russian organizations have become the target of a phishing campaign that distributes malware called PureRAT, according to new findings from Kaspersky.\n\"The campaign aimed at Russian business began back in March 2023, but in the first third of 2025 the number of attacks quadrupled compared to the same period in 2024,\" the cybersecurity vendor\nsaid\n.\nThe attack chains, which have not been attributed to any specific threat actor, commence with a phishing email that contains a RAR file attachment or a link to the archive that masquerades as a Microsoft Word or a PDF document by making use of double extensions (\"doc_054_[redacted].pdf.rar\").\nPresent within the archive file is an executable that, when launched, copies itself to the \"%AppData%\" location of the compromised Windows machine under the name \"task.exe\" and creates a Visual Basic Script called \"Task.vbs\" in the Startup VBS folder.\nThe executable then proceeds to unpack another executable \"ckcfb.exe\", runs the system utility \"InstallUtil.exe,\" and injects into it the decrypted module. \"Ckcfb.exe,\" for its part, extracts and decrypts a DLL file \"Spydgozoi.dll\" that incorporates the main payload of the PureRAT malware.\nPureRAT establishes SSL connections with a command-and-control (C2) server and transmits system information, including details about the antivirus products installed, the computer name, and the time elapsed since the system startup. In response, the C2 server sends auxiliary modules to perform a variety of malicious actions -\nPluginPcOption, which is capable of executing commands for self-deletion, restarting the executable file, and shutting down or rebooting the computer\nPluginWindowNotify, which checks the name of the active window for keywords like password, bank, WhatsApp, and perform appropriate follow-up actions like unauthorized fund transfers\nPluginClipper, which functions as a\nclipper malware\nby substituting cryptocurrency wallet addresses copied to the system's clipboard with an attacker-controlled one\n\"The Trojan includes modules for downloading and running arbitrary files that provide full access to the file system, registry, processes, camera and microphone, implement keylogger functionality, and give attackers the ability to secretly control the computer using the remote desktop principle,\" Kaspersky said.\nThe original executable that launches \"ckcfb.exe\" simultaneously also extracts a second binary referred to as \"StilKrip.exe,\" which is a commercially available downloader dubbed\nPureCrypter\nthat has been used to deliver various payloads in the past. It's active since 2022.\n\"StilKrip.exe\" is designed to download \"Bghwwhmlr.wav,\" which follows the aforementioned attack sequence to run \"InstallUtil.exe\" and ultimately launch \"Ttcxxewxtly.exe,\" an executable that unpacks and runs a DLL payload called PureLogs (\"Bftvbho.dll\").\nPureLogs is an\noff-the-shelf information stealer\nthat can harvest data from web browsers, email clients, VPN services, messaging apps, wallet browser extensions, password managers, cryptocurrency wallet apps, and other programs like FileZilla and WinSCP.\n\"The PureRAT backdoor and PureLogs stealer have broad functionality that allows attackers to gain unlimited access to infected systems and confidential organization data,\" Kaspersky said. \"The main vector of attacks on businesses has been and remains emails with malicious attachments or links.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Fake Kling AI Facebook Ads Deliver RAT Malware to Over 22 Million Potential Victims",
        "Link": "https://thehackernews.com/2025/05/fake-kling-ai-facebook-ads-deliver-rat.html",
        "Summary": "Counterfeit Facebook pages and sponsored ads on the social media platform are being employed to direct users to fake websites masquerading as Kling AI with the goal of tricking victims into downloading malware.\nKling AI is an artificial intelligence (AI)-powered platform to synthesize images and videos from text and image prompts. Launched in June 2024, it's developed by Kuaishou Technology,",
        "Date": "2025-05-21",
        "Content": "Counterfeit Facebook pages and sponsored ads on the social media platform are being employed to direct users to fake websites masquerading as\nKling AI\nwith the goal of tricking victims into downloading malware.\nKling AI is an artificial intelligence (AI)-powered platform to synthesize images and videos from text and image prompts. Launched in June 2024, it's developed by Kuaishou Technology, which is headquartered in Beijing, China. As of April 2025, the service has a user base of more than 22 million, per\ndata\nfrom the company.\n\"The attack used fake Facebook pages and ads to distribute a malicious file which ultimately led to the execution of a remote access Trojan (RAT), granting attackers remote control of the victim's system and the ability to steal sensitive data,\" Check Point\nsaid\n.\nFirst detected in early 2025, the campaign leads unsuspecting users to a spoofed website such as klingaimedia[.]com or klingaistudio[.]com, where they are asked to create AI-generated images or videos directly in the browser.\nHowever, the website does not generate the multimedia count as advertised. Rather, it offers the option to a purported image or video that, in reality, is a malicious Windows executable hidden using double extensions and\nHangul Filler\n(0xE3 0x85 0xA4) characters.\nThe payload is included in a ZIP archive and acts as a loader to launch a remote access trojan and a stealer that then establishes contact with a command-and-control (C2) server and exfiltrates browser-stored credentials, session tokens, and other sensitive data.\nThe loader, besides monitoring for analysis tools such as Wireshark, OllyDbg, Procmon, ProcExp, PeStudio, and Fiddler, makes Windows Registry changes to set up persistence and launches the second-stage by injecting it into a legitimate system process like \"CasPol.exe\" or \"InstallUtil.exe\" to evade detection.\nThe second-stage payload, obfuscated using\n.NET Reactor\n, is the PureHVNC RAT that contacts a remote server (185.149.232[.]197) and comes with capabilities to steal data from several cryptocurrency wallet extensions installed on Chromium-based browsers. PureHVNC also adopts a plugin-based approach to capture screenshots when window titles matching banks and wallets are opened.\nCheck Point said it identified no less than 70 promoted posts from fake social media pages impersonating Kling AI. It's currently not clear who is behind the campaign, but evidence gathered from the fake website's web page and some of the ads show that they could be from Vietnam.\nThe use of Facebook malvertising techniques to distribute stealer malware has been a tried-and-tested tactic of Vietnamese threat actors, who have been\nincreasingly\ncapitalizing\non the popularity of\ngenerative AI tools\nto push malware.\nEarlier this month, Morphisec\nrevealed\nthat a Vietnamese threat actor has been leveraging fake AI-powered tools as a lure to entice users into downloading an information stealer malware dubbed Noodlophile.\n\"This campaign, which impersonated Kling AI through fake ads and deceptive websites, demonstrates how threat actors are combining social engineering with advanced malware to gain access to users' systems and personal data,\" Check Point\nsaid\n.\n\"With tactics ranging from file masquerading to remote access and data theft, and signs pointing to Vietnamese threat groups, this operation fits into a broader trend of increasingly targeted and sophisticated social media-based attacks.\"\nThe development comes as The Wall Street Journal\nreported\nthat Meta is battling an \"epidemic of scams,\" with cyber criminals flooding Facebook and Instagram with various kinds of scams ranging from romance baiting to sketchy bargain ads to fake giveaways. Many of the scam pages are operated from China, Sri Lanka, Vietnam, and the Philippines, the report added.\nAccording to\nRest of World\n, phony job ads on\nTelegram\n, Facebook, and other social media are being increasingly used to lure young Indonesians and get\ntrafficked\nto\nscam compounds\nin Southeast Asia, from where they are coerced into running investment scams and defraud victims across the world.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Securing CI/CD workflows with Wazuh",
        "Link": "https://thehackernews.com/2025/05/securing-cicd-workflows-with-wazuh.html",
        "Summary": "Continuous Integration and Continuous Delivery/Deployment (CI/CD) refers to practices that automate how code is developed and released to different environments. CI/CD pipelines are fundamental in modern software development, ensuring code is consistently tested, built, and deployed quickly and efficiently.\nWhile CI/CD automation accelerates software delivery, it can also introduce security",
        "Date": "2025-05-21",
        "Content": "Continuous Integration and Continuous Delivery/Deployment (CI/CD) refers to practices that automate how code is developed and released to different environments. CI/CD pipelines are fundamental in modern software development, ensuring code is consistently tested, built, and deployed quickly and efficiently.\nWhile CI/CD automation accelerates software delivery, it can also introduce security risks. Without proper security measures, CI/CD workflows can be vulnerable to supply chain attacks, insecure dependencies, and insider threats. To mitigate these risks, organizations must integrate measures for continuous monitoring and enforcing security best practices at every pipeline stage. Securing CI/CD workflows preserves the software delivery process's confidentiality, integrity, and availability.\nSecurity challenges and risks in CI/CD workflows\nWhile CI/CD workflows offer benefits in terms of automation and speed, they also bring unique security challenges that must be addressed to maintain the integrity of the development process. Some common challenges and risks include:\nLack of visibility and inadequate security monitoring:\nCI/CD workflows involve multiple tools and stages, which make it challenging to maintain security visibility into potential threats. Vulnerabilities, especially in third-party libraries or containerized applications, can introduce security risks that go undetected if not correctly managed. Without centralized monitoring, real-time threat detection and response become difficult. Manual, reactive incident response increases the risk of exploitation.\nCompliance requirements:\nMeeting regulatory standards such as GDPR or HIPAA while maintaining fast deployment cycles can be challenging. Organizations must balance enforcing security policies, data protection, and compliance requirements without slowing down their CI/CD workflows.\nCode and dependency vulnerabilities:\nUnpatched or outdated dependencies in the workflow can introduce significant security risks. Third-party libraries or outdated packages can become attack vectors if not regularly updated and monitored for vulnerabilities. These risks are increased by the fast pace of CI/CD, where vulnerabilities may go untreated.\nContainer vulnerabilities and image security:\nWhile containers are mainly used in CI/CD workflows, they are not safe from security risks. Vulnerabilities in container images, such as outdated software versions, misconfigurations, or insecure base images, present a risk in CI/CD workflows and can be exploited by attackers. Without proper scanning and validation, these weaknesses can propagate through the pipeline.\nMisconfiguration of CI/CD tools:\nImproper configuration of CI/CD tools can leave the workflow open to unauthorized access or unintentionally expose sensitive code. Misconfigurations in access control settings can increase the likelihood of privilege escalation or code exposure. Additionally, hardcoded credentials or mismanaged environment variables introduce a risk of being extracted by attackers, which could lead to data breaches.\nSupply chain attacks:\nCompromised third-party dependencies can introduce malicious packages or vulnerabilities into the workflow. These vulnerabilities can spread throughout the entire pipeline and infect production environments, primarily when third-party tools or libraries are not sufficiently validated.\nInsider threats:\nInsider threats in CI/CD workflows involve authorized users such as developers, DevOps engineers, system administrators, or third-party contractors, who may intentionally or unintentionally compromise the pipeline. Weak authentication mechanisms, inadequate access controls, and a lack of monitoring can increase the risk of unauthorized changes, credential theft, or the introduction of malicious code into the workflow.\nEnhancing CI/CD workflow security with Wazuh\nWazuh\nis an open source security platform that offers unified XDR and SIEM capabilities for on-premises, containerized, virtualized, and cloud-based environments. Wazuh provides flexibility in threat detection, compliance, incident handling, and third-party integration. Organizations can implement Wazuh to address the challenges and mitigate the risks associated with CI/CD workflow security. Below are some ways Wazuh helps improve security in CI/CD workflows.\nLog collection and system monitoring\nWazuh provides log collection and analysis capabilities to ensure the components of your CI/CD environment are continuously monitored for security threats. It collects and analyzes logs from various CI/CD pipeline components, including servers, containerization and orchestration tools such as Docker and Kubernetes, and version control systems like GitHub. This allows security teams to monitor for unusual activities, unauthorized access, or security breaches across the CI/CD environment.\nAdditionally, the Wazuh File Integrity Monitoring (FIM) capability can detect unauthorized changes in code or configuration files. By monitoring files in real time or on a schedule, Wazuh generates alerts for security teams about file activities like creation, deletion, or modification.\nFigure 1: Wazuh dashboard showing File Integrity Monitoring (FIM) alerts.\nCustom rules and streamlined security monitoring\nWazuh allows users to create custom rules and alerts that align with a pipeline's security requirements. Organizations can create custom rules matching their specific security needs, such as monitoring code changes, server configurations, or container images. This flexibility allows organizations to enforce granular security controls tailored to their CI/CD workflow.\nFor instance, the Center for Internet Security (CIS) Docker Benchmark provides guidelines for securing Docker environments. Organizations can automate the compliance checks against CIS Docker Benchmark v1.7.0 using the\nWazuh Security Configuration Assessment (SCA) capability\n.\nFigure 2: Wazuh dashboard showing Wazuh Security configuration assessment (SCA) results.\nIntegration with third-party security tools\nWazuh can integrate with various security tools and platforms, including container vulnerability scanners and CI/CD orchestration systems. This is particularly important in CI/CD workflows, where multiple tools may be used to manage the development lifecycle. Wazuh can pull in data from various sources, which helps to provide a centralized view of security across the pipeline.\nFor instance, Wazuh integrates with container vulnerability scanning tools Trivy and Grype, which are commonly used to scan container images for vulnerabilities, insecure base images, or outdated software versions. By scanning container images before they are deployed into production, organizations can ensure that only secure, up-to-date images are used in the deployment processes.\nYou can\nconfigure the Wazuh Command module to run a Trivy scan\non an endpoint hosting container images and display any detected vulnerabilities in the Wazuh dashboard. This helps to ensure that insecure images are identified and prevented from being pushed into production.\nFigure 3: Wazuh dashboard displaying vulnerabilities discovered on container images from a Trivy scan.\nAutomated incident response\nThe speed of CI/CD workflows means that threats must be detected and mitigated quickly to minimize the risk of breaches or downtime. Wazuh provides incident response capabilities that help organizations respond to security incidents as soon as they occur.\nThe Wazuh Active Response module can automatically take action when a security threat is detected. For example, suppose a malicious IP address is detected trying to access a system that runs CI/CD processes. In that case, Wazuh can automatically block the IP address and trigger predefined remediation actions. This automation ensures fast response, reduces manual intervention, and prevents potential threats from escalating.\nConclusion\nSecuring CI/CD workflows is important for maintaining a reliable and safe software development process. By using Wazuh, organizations can detect vulnerabilities early, monitor for anomalies, enforce compliance, and automate security responses while maintaining the speed and efficiency of CI/CD workflows. Integrating Wazuh into your CI/CD workflow ensures that security keeps pace with development speed.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "How to Detect Phishing Attacks Faster: Tycoon2FA Example",
        "Link": "https://thehackernews.com/2025/05/how-to-detect-phishing-attacks-faster.html",
        "Summary": "It takes just one email to compromise an entire system. A single well-crafted message can bypass filters, trick employees, and give attackers the access they need. Left undetected, these threats can lead to credential theft, unauthorized access, and even full-scale breaches. As phishing techniques become more evasive, they can no longer be reliably caught by automated solutions alone.\nLet’s take",
        "Date": "2025-05-21",
        "Content": "It takes just one email to compromise an entire system. A single well-crafted message can bypass filters, trick employees, and give attackers the access they need. Left undetected, these threats can lead to credential theft, unauthorized access, and even full-scale breaches. As phishing techniques become more evasive, they can no longer be reliably caught by automated solutions alone.\nLet's take a closer look at how SOC teams can ensure fast, accurate detection of even the most evasive phishing attacks, using the example of Tycoon2FA, the number one phishing threat in the corporate environment today.\nStep 1: Upload a suspicious file or URL to the sandbox\nLet's consider a typical situation: a suspicious email gets flagged by your detection system, but it's unclear whether it's indeed malicious.\nThe fastest way to check it is to run a quick analysis inside a malware sandbox.\nA sandbox is an isolated virtual machine where you can safely open files, click links, and observe behavior without putting your own system at risk. It's how SOC analysts investigate malware, phishing attempts, and suspicious activity without triggering anything locally.\nGetting started is easy. Upload the file or paste a URL, pick your OS (Windows, Linux, or Android), tweak your settings if needed, and within seconds, you're inside a fully interactive virtual machine ready to investigate.\nAnalysis setup inside ANY.RUN sandbox\nTo show how easy it is to detect phishing, let's walk through a real-world example, a potential phishing email we analyzed using ANY.RUN, is one of the fastest and most intuitive sandboxes available.\nView the phishing sample here\nPhishing email analyzed inside cloud-based ANY.RUN sandbox\nThe suspicious email includes a large green \"Play Audio\" button, a trick used to lure the victim into clicking.\nEquip your SOC team with a fast and in-depth phishing analysis service to respond to and prevent incidents in seconds.\nGet a special offer before May 31\nStep 2: Detonate the Full Attack Chain\nWith the help of sandboxes like ANY.RUN, it's possible to detonate every single stage of an attack, from the first click to the final payload. Even junior SOC members can do it with ease. The interface is intuitive, interactive, and built to make complex analysis feel simple.\nIn our phishing example, we've already seen how the attack begins; a suspicious email with a big green \"Play Audio\" button buried in a thread. But what happens after the click?\nInside the sandbox session, we see it clearly:\nAs soon as the button is pressed, a series of redirects (another evasion tactic) eventually lead us to a page with a CAPTCHA challenge. This is where automated tools typically fail. They can't click buttons, solve CAPTCHAs, or mimic user behavior, so they often miss the real threat.\nBut in ANY.RUN's Interactive Sandbox, isn't a problem. You can either solve the CAPTCHA manually or enable the auto mode to let the sandbox handle it for you. In both cases, the analysis continues smoothly, allowing you to reach the final phishing page and observe the full attack chain.\nCAPTCHA challenge solved inside the interactive sandbox\nOnce the CAPTCHA is solved, we're redirected to a fake Microsoft login page. At first glance, it looks convincing, but a closer look reveals the truth:\nThe URL is clearly unrelated to Microsoft, full of random characters\nThe favicon (browser tab icon) is missing; a small but telling red flag\nPhishing signs detected inside ANY.RUN sandbox\nWithout the Interactive Sandbox, these details would remain hidden. But here, every move is visible, every step traceable, making it easier to detect phishing infrastructure before it tricks someone inside your organization.\nIf left undetected, the victim may unknowingly enter their credentials into the fake login page, handing sensitive access directly to the attacker.\nBy making sandbox analysis part of your security routine, your team can check suspicious links or files in seconds. In most cases, ANY.RUN provides an initial verdict in under 40 seconds.\nStep 3: Analyze and Collect IOCs\nOnce the phishing chain is fully detonated, the next step is what matters most to security teams; gathering indicators of compromise (IOCs) that can be used for detection, response, and future prevention.\nSolutions like ANY.RUN makes this process fast and centralized. Here are some of the key findings from our phishing sample:\nIn the top-right corner, we see the process tree, which helps us trace suspicious behavior. One process stands out; it's labeled \"Phishing\", showing exactly where the malicious activity occurred.\nMalicious process identified by sandbox\nBelow the VM window, in the Network connections tab, we can inspect all HTTP/HTTPS requests. This reveals the external infrastructure used in the attack: domains, IPs, and more.\nIn the Threats section, we see a Suricata alert: PHISHING [ANY.RUN] Suspected Tycoon2FA's Phishing-Kit Domain. This confirms the phishing kit used and adds useful context for threat classification.\nSuricata rule triggered by Tycoon2FA\nIn the top panel, the tags instantly identify it as a Tycoon2FA-related threat, so analysts know what they're dealing with at a glance.\nTycoon detected by ANY.RUN sandbox\nNeed to see all IOCs in one place? Just click the IOC button, and you'll get a full list of domains, hashes, URLs, and more. No need to jump between tools or gather data manually.\nThese IOCs can then be used to:\nBlock malicious domains across your infrastructure\nUpdate email filters and detection rules\nEnrich your threat intelligence database\nSupport incident response and SOC workflows\nIOCs gathered inside ANY.RUN sandbox\nFinally, ANY.RUN generates a well-structured, shareable report that includes all key details, from behavior logs and network traffic to screenshots and IOCs.\nThis report is perfect for documentation, team handoff, or sharing with external stakeholders, saving valuable time during response.\nWell-structured report generated by an interactive sandbox\nWhy Sandboxing Should Be Part of Your Security Workflow\nInteractive sandboxing helps teams cut through the noise, exposing real threats quickly and making incident response more efficient.\nSolutions like ANY.RUN makes this process accessible to both experienced teams and those just starting to build up threat detection capabilities:\nSpeed Up Alert Triage and Incident Response\n: Don't wait for verdict, see threat behavior live for faster decisions.\nIncrease Detection Rate\n: Trace multi-stage attacks from origin to execution in detail.\nImprove Training\n: Analysts work with live threats, gaining practical experience.\nBoost Team Coordination\n: Real-time data sharing and process monitoring across team members.\nReduce Infrastructure Maintenance\n: Cloud-based sandbox requires no setup; analyze anywhere, anytime.\nSpecial Offer\n: From May 19 to May 31, 2025, ANY.RUN is celebrating its 9th birthday with exclusive offers.\nEquip your team with extra sandbox licenses and grab limited-time offers across their Sandbox, TI Lookup, and Security Training Lab.\nLearn more about ANY.RUN's Birthday special offers→\nWrapping Up\nPhishing attacks are getting smarter but detecting them doesn't have to be hard. With interactive sandboxing, you can spot threats early, trace the full attack chain, and collect all the evidence your team needs to respond quickly and confidently.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Researchers Expose PWA JavaScript Attack That Redirects Users to Adult Scam Apps",
        "Link": "https://thehackernews.com/2025/05/researchers-expose-pwa-javascript.html",
        "Summary": "Cybersecurity researchers have discovered a new campaign that employs malicious JavaScript injections to redirect site visitors on mobile devices to a Chinese adult-content Progressive Web App (PWA) scam.\n\"While the payload itself is nothing new (yet another adult gambling scam), the delivery method stands out,\" c/side researcher Himanshu Anand said in a Tuesday analysis.\n\"The malicious landing",
        "Date": "2025-05-21",
        "Content": "Cybersecurity researchers have discovered a new campaign that employs malicious JavaScript injections to redirect site visitors on mobile devices to a Chinese adult-content Progressive Web App (PWA) scam.\n\"While the payload itself is nothing new (yet another adult gambling scam), the delivery method stands out,\" c/side researcher Himanshu Anand\nsaid\nin a Tuesday analysis.\n\"The malicious landing page is a full-blown Progressive Web App (\nPWA\n), likely aiming to retain users longer and bypass basic browser protections.\"\nThe campaign is designed to explicitly filter out desktop users, primarily focusing on mobile users. The activity has been described as a client-side attack that uses third-party JavaScript and only triggers on mobile devices.\nThe use of PWAs, a type of application built using web technologies that provide a user experience similar to that of a native app built for a specific platform like Windows, Linux, macOS, Android, or iOS, is seen as an attempt to sidestep security protections.\nThe attacks involve injecting websites with JavaScript code that acts as a loader to trigger the redirection when the site is visited from devices running on Android, iOS, and iPadOS, among others.\nThe redirections are designed to lead the users to adult content websites or other intermediary redirect pages advertising apps for viewing adult content. The pages subsequently take the victims to a fake app store listing for the supposed Android and iOS apps in question.\n\"The use of PWAs suggests attackers are experimenting with more persistent phishing methods,\" Anand said. \"The mobile-only focus allows them to evade many detection mechanisms.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Google Chrome Can Now Auto-Change Compromised Passwords Using Its Built-In Manager",
        "Link": "https://thehackernews.com/2025/05/google-chrome-can-now-auto-change.html",
        "Summary": "Google has announced a new feature in its Chrome browser that lets its built-in Password Manager automatically change a user's password when it detects the credentials to be compromised.\n\"When Chrome detects a compromised password during sign in, Google Password Manager prompts the user with an option to fix it automatically,\" Google's Ashima Arora, Chirag Desai, and Eiji Kitamura said. \"On",
        "Date": "2025-05-21",
        "Content": "Google has announced a new feature in its Chrome browser that lets its built-in Password Manager automatically change a user's password when it detects the credentials to be compromised.\n\"When Chrome detects a compromised password during sign in, Google Password Manager prompts the user with an option to fix it automatically,\" Google's Ashima Arora, Chirag Desai, and Eiji Kitamura\nsaid\n. \"On supported websites, Chrome can generate a strong replacement and update the password for the user automatically.\"\nThe feature builds upon\nPassword Manager\n's existing capabilities to generate strong passwords during sign-up and flag credentials that have been detected in a data breach.\nWith the automated password change, Google said the idea is to reduce friction and help users keep their accounts secure without having to search for relevant account settings or abandon the process midway.\nWebsite owners can support this feature by\nadopting\nthe following methods -\nUse autocomplete=\"current-password\" and autocomplete=\"new-password\" to trigger autofill and storage\nSet up a\nredirect\nfrom <your-website-domain>/.well-known/change-password to the password change form on their website\n\"It would be much easier if password managers could navigate the user directly to the change-password URL,\" Kitamura\nsaid\n. \"This is where a well-known URL for changing passwords becomes useful.\"\n\"By reserving a well-known URL path that redirects the user to the change password page, the website can easily redirect users to the right place to change their passwords.\"\nThe development comes as companies are increasingly shifting to passkeys as a stronger alternative to protect accounts from potential takeover attacks. Earlier this month, Microsoft\nsaid\nit's making passkeys the default method when signing up for new customer accounts.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Anthropic web config hints at Claude Sonnet 4 and Opus 4",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/anthropic-web-config-hints-at-claude-sonnet-4-and-opus-4/",
        "Summary": "Anthropic is secretly working on two new models called Claude Sonnet 4 and Opus 4, which are believed to be the company's most advanced AI models. [...]",
        "Date": "2025-05-21",
        "Content": "Anthropic is secretly working on new models called Claude Sonnet 4 and Opus 4, which are believed to be the company's most advanced AI models.\nThis is according to Anthropic web configuration files, which were recently\nupdated\nwith references to Claude Sonnet 4 and Opus 4.\nAs you can see in the above image showing the internal configuration file, Anthropic has specifically\nmentioned\n\"Claude 4,\" \"Claude Sonnet 4,\" and \"Claude Opus 4.\"\nThese appear to be part of the Claude 4 series, which we think could be Anthropic’s smartest models yet.\nThe references suggest Claude Sonnet 4 and Opus 4 are being tested or promoted internally, with some warnings like “Not intended for production use” and “strict rate limits,” meaning they’re still under development or early access.\nThere are also references to features like \"show_raw_thinking,\" which point to reasoning capabilities.\nOn May 22, Anthropic is\nhosting\na 'Code with Claude' event, but we don't know if the event is related to the new models.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nClaude copies ChatGPT with $200 Max plan, but users aren't happy\nClaude is testing ChatGPT-like Deep Research feature Compass\nOpenAI hints at a big upgrade for ChatGPT Operator Agent\nOpenAI plans to combine multiple models into GPT-5\nLeak confirms OpenAI's ChatGPT will integrate MCP"
    },
    {
        "Title": "OpenAI hints at a big upgrade for ChatGPT Operator Agent",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-hints-at-a-big-upgrade-for-chatgpt-operator-agent/",
        "Summary": "ChatGPT's Operator, which is still in research preview, will soon become a \"very useful tool,\" according to Jerry Tworek, VP of Research at OpenAI. [...]",
        "Date": "2025-05-21",
        "Content": "ChatGPT's Operator, which is still in research preview, will soon become a \"very useful tool,\" according to Jerry Tworek, VP of Research at OpenAI.\nOpenAI\nannounced\nOperator for $200 Pro subscribers in January, and it allows users to delegate web tasks to the AI agent.\nOperator (GPT)\nThe idea behind Operator, which is an AI agent, is to automate the repetitive browser tasks that do not require any attention from users.\nInstead of using a browser to look for stuff on the internet, you can allow Operator to do it for you. For example, you can ask Operator to fill forms, order food, and groceries.\nHowever, Operator in its current state isn't productive or useful and often fails at basic tasks.\nOpenAI promises a new useful Operator experience\nIn a Reddit ask-me-anything (AMA), OpenAI said that it has plans to release several significant improvements for Operator.\n\"We also already have a product surface that can do things on your computer - it’s called operator, it’s still a research preview, but we’re planning to make some improvements soon and it can become a very useful tool then,\" Jerry Tworek, who is a VP of Research at OpenAI, wrote in a\nReddit post\n.\nJerry Tworek also hinted that OpenAI could bring all of these tools together so it feels like one thing, perhaps a platform of AI.\nWe don't know the approach yet, but OpenAI previously confirmed that it has plans to\nintegrate multiple products or models into GPT-5\n, which is the company's next foundational model.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nOpenAI plans to combine multiple models into GPT-5\nLeak confirms OpenAI's ChatGPT will integrate MCP\nChatGPT is finally adding Download as PDF for Deep Research\nOpenAI document explains when to use each ChatGPT model\nOpenAI tests watermarking for ChatGPT-4o Image Generation model"
    },
    {
        "Title": "Critical Samlify SSO flaw lets attackers log in as admin",
        "Link": "https://www.bleepingcomputer.com/news/security/critical-samlify-sso-flaw-lets-attackers-log-in-as-admin/",
        "Summary": "A critical Samlify authentication bypass vulnerability has been discovered that allows attackers to impersonate admin users by injecting unsigned malicious assertions into legitimately signed SAML responses. [...]",
        "Date": "2025-05-21",
        "Content": "A critical Samlify authentication bypass vulnerability has been discovered that allows attackers to impersonate admin users by injecting unsigned malicious assertions into legitimately signed SAML responses.\nSamlify is a high-level authentication library that helps developers integrate SAML SSO and Single Log-Out (SLO) into Node.js applications. It is a popular tool for building or connecting to identity providers (IdPs) and service providers (SPs) using SAML.\nThe library is used by SaaS platforms, organizations implementing SSO for internal tools, developers integrating with corporate Identity Providers like Azure AD or Okta, and in federated identity management scenarios. It is very popular, measuring over 200,000 weekly downloads on npm.\nThe flaw, tracked as\nCVE-2025-47949\n, is a critical (CVSS v4.0 score: 9.9) Signature Wrapping flaw impacting all versions of Samlify before 2.10.0.\nAs EndorLabs explained in a report, Samlify correctly verifies that the XML document providing a user's identity is signed. Still, it proceeds to read fake assertions from a part of the XML that isn't.\nAttackers holding a valid signed SAML response through interception or via public metadata can modify it to exploit the parsing flaw in the library and authenticate as someone else.\n\"The attacker then takes this legitimately signed XML document and manipulates it. They insert a second, malicious SAML Assertion into the document,\"\nexplains EndorLabs\n.\n\"This malicious assertion contains the identity of a target user (e.g., an administrator's username).\"\n\"The crucial part is that the valid signature from the original document still applies to a benign part of the XML structure, but the SP's vulnerable parsing logic will inadvertently process the unsigned, malicious assertion.\"\nThis is a complete SSO bypass, allowing unauthorized remote attackers to perform privilege escalation and log in as administrators.\nThe attacker needs no user interaction or special privileges, and the only requirement is access to a valid signed XML blob, making the exploitation relatively simple.\nTo mitigate the risk, it is recommended that users upgrade to Samlify version 2.10.0, released earlier this month.\nNote that GitHub\nstill offers 2.9.1\nas the latest version, but\nnpm hosts\nthe safe-to-use 2.10.0 as of writing.\nThere have not been any reports of active exploitation of CVE-2025-47949 in the wild, but impacted users are advised to take immediate action and secure their environments.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nUnpatched critical bugs in Versa Concerto lead to auth bypass, RCE\nIvanti warns of critical Neurons for ITSM auth bypass flaw\nCisco fixes max severity IOS XE flaw letting attackers hijack devices\nHackers exploit OttoKit WordPress plugin flaw to add admin accounts\nSAP fixes suspected NetWeaver zero-day exploited in attacks"
    },
    {
        "Title": "Russian hackers breach orgs to track aid routes to Ukraine",
        "Link": "https://www.bleepingcomputer.com/news/security/russian-hackers-breach-orgs-to-track-aid-routes-to-ukraine/",
        "Summary": "A Russian state-sponsored cyberespionage campaign attributed to APT28 (Fancy Bear/Forest Blizzard) hackers has been targeting and compromising international organizations since 2022 to disrupt aid efforts to Ukraine. [...]",
        "Date": "2025-05-21",
        "Content": "A Russian state-sponsored cyberespionage campaign attributed to APT28 (Fancy Bear/Forest Blizzard) hackers has been targeting and compromising international organizations since 2022 to disrupt aid efforts to Ukraine.\nThe hackers targeted entities in the defense, transportation, IT services, air traffic, and maritime sectors in 12 European countries and the United States.\nAdditionally, the hackers have been tracking the movement of materials into Ukraine by compromising access to private cameras installed in key locations (e.g. border crossings, military installations, rail stations).\nA joint advisory from 21 intelligence and cybersecurity agencies in nearly a dozen countries shares the tactics, techniques, and procedures that APT28 (the Russian GRU 85th GTsSS, military unit 26165) used in attacks.\nMixing TTPs for stealthy intrusions\nThe report notes that since 2022, the Russian APT28 threat actor has employed tactics like password spraying, spear-phishing, and Microsoft Exchange vulnerability exploits to compromise organizations.\nAfter compromising the main target, the hackers attacked other entities in the transportation sector with business ties to the primary victim, “exploiting trust relationships to attempt to gain additional access.”\nAdditionally, APT28 has also compromised internet-connected cameras at Ukrainian border crossings to monitor aid shipments.\nTargeted organizations are located in the United States, Bulgaria, Czechia, France, Germany, Greece, Italy, Moldova, Netherlands, Poland, Romania, Slovakia, and Ukraine.\nAccording to the\nreport\n, the hackers gained initial access using multiple techniques, among them:\nCredential guessing or brute force\nSpear-phishing for credentials\nSpear-phishing to deliver malware\nExploiting the Outlook NTLM vulnerability\nCVE-2023-23397\nLeveraging vulnerabilities (\nCVE-2020-12641\n,\nCVE-2020-35730\n,\nCVE-2021-44026\n) in the Roundcube open-source webmail software\nExploiting internet-facing infrastructure, corporate VPNs included, via public vulnerabilities and SQL injection\nExploiting WinRAR vulnerability\nCVE-2023-38831\nTo hide the origin of the attack, APT28 routed their communication through compromised small office/home office devices that were in proximity to the target.\nOnce on the victim network, the hackers ran reconnaissance of internal contacts (in the cybersecurity, transport coordination, and partner companies) to identify additional targets.\nFor lateral movement and data extraction, native commands and open-source tools were used, like PsExec, Impacket, Remote Desktop Protocol, Certipy and ADExplorer to exfiltrate Active Directory information.\nThey also located and exfiltrated lists of Office 365 users to collect email. After getting access to an email account, APT28 would “enroll compromised accounts in MFA mechanisms to increase the trust-level of compromised accounts and enable sustained access.”\nOne step after gaining initial access was to hack into accounts with access to sensitive information on aid shipments to Ukraine, which included the sender and recipient, cargo content, travel routes, container registration numbers, and destination.\nAmong the malware used during the campaign, investigators observed the Headlace and Masepie backdoors.\nThe hackers used multiple methods to exfiltrate data, the choice of each one depending on the victim environment and including both living-off-the-land (LOtL) binaries and malware.\nIn some cases, they managed to maintain stealth by relying on infrastructure close to the victim, trusted and legitimate protocols, local infrastructure, and taking their time between exfiltration sessions.\nTargeting connected camera\nOne part of the espionage campaign is likely hacking camera feeds (private, traffic, military installations, rail stations, border crossing) to monitor the movement of materials into Ukraine.\nThe report from the government agencies notes that more than 10,000 cameras were targeted, over 80% located in Ukraine, followed by almost a thousand in Romania.\nJohn Hultquist, the Google Threat Intelligence Group chief analyst, told BleepingComputer that apart from the interest in identifying support to the battlefield, the threat actor’s goal is also to disrupt “that support through either physical or cyber means.”\n“These incidents could be precursors to other serious actions,\" Hultquist said, adding a warning that anyone involved in the process of sending material aid to Ukraine “should consider themselves targeted.”\nThe\njoint cybersecurity advisory\nincludes general security mitigations, and detections, as well as a set of indicators of compromise for scripts and utilities used, email providers commonly used by the threat actor, malicious archive filenames, IP addresses, and Outlook exploitation details.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nGovernment webmail hacked via XSS bugs in global spy campaign\nFrance ties Russian APT28 hackers to 12 cyberattacks on French orgs\nState-sponsored hackers embrace ClickFix social engineering tactic\nNorth Korea ramps up cyberspying in Ukraine to assess war risk\nHackers abuse OAuth 2.0 workflows to hijack Microsoft 365 accounts"
    },
    {
        "Title": "Experts Chart Path to Creating Safer Online Spaces for Women",
        "Link": "https://www.darkreading.com/cyber-risk/experts-path-creating-safer-online-spaces",
        "Summary": "Gaps in laws, technology, and corporate accountability continue to put women's safety and privacy online at risk.",
        "Date": "2025-05-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/experts-path-creating-safer-online-spaces"
    },
    {
        "Title": "Lumma Stealer Takedown Reveals Sprawling Operation",
        "Link": "https://www.darkreading.com/cybersecurity-operations/lumma-stealer-takedown-sprawling-operation",
        "Summary": "The FBI and partners have disrupted &quot;the world's most popular malware,&quot; a sleek enterprise with thousands of moving parts, responsible for millions of cyberattacks in every part of the world.",
        "Date": "2025-05-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/lumma-stealer-takedown-sprawling-operation"
    },
    {
        "Title": "Ivanti EPMM Exploitation Tied to Previous Zero-Day Attacks",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/ivanti-epmm-exploitation-previous-zero-day-attacks",
        "Summary": "Wiz researchers found an opportunistic threat actor has been targeting vulnerable edge devices, including Ivanti VPNs and Palo Alto firewalls.",
        "Date": "2025-05-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/ivanti-epmm-exploitation-previous-zero-day-attacks"
    },
    {
        "Title": "Marks &amp; Spencer Projects Cyberattack Cost of $400M",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/marks-spencer-400m-loss-after-cyberattack",
        "Summary": "The company expects it will continue to struggle with online disruptions until at least July, due to the attack.",
        "Date": "2025-05-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/marks-spencer-400m-loss-after-cyberattack"
    },
    {
        "Title": "Pandas Galore: Chinese Hackers Boost Attacks in Latin America",
        "Link": "https://www.darkreading.com/cyber-risk/pandas-galore-chinese-hackers-attacks-latin-america",
        "Summary": "Vixen Panda, Aquatic Panda — both Beijing-sponsored APTs and financially motivated criminal groups continued to pose the biggest threat to organizations in Central and South America last year, says CrowdStrike.",
        "Date": "2025-05-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/pandas-galore-chinese-hackers-attacks-latin-america"
    },
    {
        "Title": "Unimicron, Presto Attacks Mark Industrial Ransomware Surge",
        "Link": "https://www.darkreading.com/ics-ot-security/unimicron-presto-attacks-industrial-ransomware-surge",
        "Summary": "A number of major industrial organizations suffered ransomware attacks last quarter, such as PCB manufacturer Unimicron, appliance maker Presto, and more — a harbinger of a rapidly developing and diversifying threat landscape.",
        "Date": "2025-05-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/ics-ot-security/unimicron-presto-attacks-industrial-ransomware-surge"
    },
    {
        "Title": "Coinbase Breach Compromises Nearly 70K Customers' Information",
        "Link": "https://www.darkreading.com/threat-intelligence/coinbase-breach-compromises-70k-customers",
        "Summary": "Coinbase asserts that this number is only a small fraction of the number of its verified users, though it's still offering a $20 million reward to catch the criminals.",
        "Date": "2025-05-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/coinbase-breach-compromises-70k-customers"
    },
    {
        "Title": "Unpatched Windows Server Flaw Threatens Active Directory Users",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/unpatched-windows-server-flaw-threatens-active-directory-users",
        "Summary": "Attackers can exploit a vulnerability present in the delegated Managed Service Account (dMSA) feature that fumbles permission handling and is present by default.",
        "Date": "2025-05-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/unpatched-windows-server-flaw-threatens-active-directory-users"
    },
    {
        "Title": "NIST's 'LEV' Equation to Determine Likelihood a Bug Was Exploited",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/nist-lev-equation-determine-likelihood-bug-exploited",
        "Summary": "The new 'Likely Exploited Vulnerabilities' metric could be a game-changer for SecOps teams and vulnerability patch prioritization.",
        "Date": "2025-05-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/nist-lev-equation-determine-likelihood-bug-exploited"
    },
    {
        "Title": "The Hidden Cybersecurity Risks of M&amp;A",
        "Link": "https://www.darkreading.com/cyber-risk/hidden-cybersecurity-risks-mergers-acquisitions",
        "Summary": "Merger and acquisition due diligence typically focuses on financials, legal risks, and operational efficiencies. Cybersecurity is often an afterthought — and that's a problem.",
        "Date": "2025-05-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/hidden-cybersecurity-risks-mergers-acquisitions"
    },
    {
        "Title": "Dark Reading Confidential: The Day I Found an APT Group in the Most Unlikely Place",
        "Link": "https://www.darkreading.com/threat-intelligence/the-day-i-found-an-apt-group-in-the-most-unlikely-place",
        "Summary": "Dark Reading Confidential Episode 6: Threat hunters Ismael Valenzuela and Vitor Ventura share stories about the tricks they used to track down advanced persistent threat groups, and the surprises they discovered along the way.",
        "Date": "2025-05-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/the-day-i-found-an-apt-group-in-the-most-unlikely-place"
    },
    {
        "Title": "Asia Produces More APT Actors, as Focus Expands Globally",
        "Link": "https://www.darkreading.com/cyber-risk/asia-apt-actors-focus-expands-globally",
        "Summary": "China- and North Korea-aligned groups account for more than half of global attacks, and an increasing number of countries look to cyber to balance power in the region.",
        "Date": "2025-05-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyber-risk/asia-apt-actors-focus-expands-globally"
    },
    {
        "Title": "ESET takes part in global operation to disrupt Lumma Stealer",
        "Link": "https://www.welivesecurity.com/en/eset-research/eset-takes-part-global-operation-disrupt-lumma-stealer/",
        "Summary": "Our intense monitoring of tens of thousands of malicious samples helped this global disruption operation",
        "Date": "2025-05-21",
        "Content": "\n      Award-winning news, views, and insight from the ESET security community\n    \n\n        Award-winning news, views, and insight from the ESET security community\n      \nESET Research\nOur intense monitoring of tens of thousands of malicious samples helped this global disruption operation\nJakub Tomanek\n\n21 May 2025\n • \n, \n21 min. read\n\nESET has collaborated with Microsoft, BitSight, Lumen, Cloudflare, CleanDNS, and GMO Registry in a global disruption operation against Lumma Stealer, an infamous malware-as-a-service (MaaS) infostealer. The operation targeted Lumma Stealer infrastructure with all known C&C servers in the past year, rendering the exfiltration network, or a large part of it, nonoperational.\nESET automated systems processed tens of thousands of Lumma Stealer samples, dissecting them to extract key elements, such as C&C servers and affiliate identifiers. This allowed us to continuously monitor Lumma Stealer’s activity, track development updates, cluster affiliates, and more.\nInfostealer malware families, like Lumma Stealer, are typically just a foreshadowing of a future, much more devastating attack. Harvested credentials are a valued commodity in the cybercrime underground, sold by initial access brokers to various other cybercriminals, including ransomware affiliates. Lumma Stealer has been one of the most prevalent infostealers over the past two years, and ESET telemetry (see Figure 1) confirms that it has left no part of the world untouched.\nLumma Stealer developers had been actively developing and maintaining their malware. We have regularly noticed code updates ranging from minor bug fixes to complete replacement of string encryption algorithms and changes to the network protocol. The operators also actively maintained the shared exfiltration network infrastructure. Between June 17th, 2024 and May 1st, 2025, we observed a total of 3,353 unique C&C domains, averaging approximately 74 new domains emerging each week including occasional updates to Telegram-based dead-drop resolvers (see Figure 2). We discuss the details of the network infrastructure later in the blogpost.\nThis ongoing evolution underscores the significant threat posed by Lumma Stealer and highlights the importance and complexity of the disruption effort.\nOver the past two years, Lumma Stealer (also known as LummaC or LummaC2) has emerged as one of the most active infostealers in the cybercrime ecosystem, becoming a favored tool among cybercriminals due to its active development of malware features and its infrastructure being sold as a service.\nLumma Stealer adopts the concept of malware as a service (MaaS), where affiliates pay a monthly fee, based on their tier, to receive the latest malware builds and the network infrastructure necessary for data exfiltration. Affiliates have access to a management panel with a user-friendly interface where they can download exfiltrated data and harvested credentials.\nThe tiered subscription model ranges from USD 250 to USD 1,000 per month, each with increasingly sophisticated features. Lower tiers include basic filtering and log download options, while higher tiers offer custom data collection, evasion tools, and early access to new features. The most expensive plan emphasizes stealth and adaptability, offering unique build generation and reduced detection.\nThe operators of Lumma Stealer have also created a Telegram marketplace with a rating system for affiliates to sell stolen data without intermediaries. The marketplace has been well documented in Cybereason research. Moreover, they maintain public documentation of the management panel for affiliates and periodically share updates and fixes on hacking forums, as shown in Figure 3.\nOpen documentation not only helps affiliates with less experience to use the malware service, but also provides valuable insights for security researchers. Developers focus on malware builds, data pipelining, and infrastructure maintenance, while affiliates are responsible for distributing the malware. This information, combined with the service’s popularity, results in a wide variety of compromise vectors.\nCommon distribution methods include phishing, cracked software, and other malware downloaders including SmokeLoader, DarkGate, Amadey, Vidar, and others. Popular phishing schemes involve ClickFix or fake CAPTCHA web pages, fraudulent forums with cracked software, fake GitHub repositories, fraudulent links on Reddit forums, and many more.\nNumerous public analyses have already been written about Lumma Stealer and its compromise vectors. Our focus here, however, is on the aspects relevant to the disruption. In this section, we will briefly introduce the key static and dynamic properties that we have been actively extracting from Lumma Stealer.\nVarious information comes embedded in Lumma Stealer malware samples. This naturally presents an ideal target for automated extraction. Besides the obvious data of interest – C&C server domains – the samples also contain identifier strings that tie the sample to a specific affiliate and a campaign, and an optional identifier leading to a custom dynamic configuration. These identifiers are used in network communication with the C&C server during data exfiltration and requests for dynamic configuration. In the sections below, we look at these properties in depth.\nEach Lumma Stealer sample contains a list of nine encrypted C&C domains. While the encryption methods have evolved over time, the characteristic array structure has remained consistent up to the time of writing.\nBased on Lumma Stealer’s internal sample versioning, which is heavily protected by stack string obfuscation, we know that up until January 2025, the C&C domains in the samples were protected by an XOR function and base64 encoding (see Figure 4). When the base64-encoded string was decoded, it revealed a structure where the first 32 bytes served as an XOR key, and the remaining bytes contained the encrypted C&C domain.\nIn January 2025, Lumma Stealer transitioned the protection of the C&C list to ChaCha20 encryption with a single hardcoded key and nonce (see Figure 5). This protection of the C&C list in the Lumma Stealer binaries has remained the same up until the time of publication.\nSince June 2024, each Lumma Stealer build came with a new feature for obtaining a backup C&C. If no C&C server from the static config responds to Lumma Stealer, then the backup C&C is extracted from a dummy Steam profile web page acting as a dead-drop resolver. The Steam profile URL is heavily protected in the binary, the same way as the version string. The encrypted backup C&C URL is set in the Steam profile name, as shown in Figure 6, and the protection is a simple Caesar cipher (ROT11).\nIn February 2025, Lumma Stealer received an update that included a feature for obtaining a new, primary C&C URL from a Telegram channel dead-drop resolver. The C&C URL is extracted from the Telegram channel’s title field, and it is protected by the same algorithm as in the case of the Steam profile dead-drop resolver. The main difference in the usage of the Telegram and Steam profile dead-drop resolvers is that the Telegram option is tested first, while the Steam profile is used as a last resort if successful communication has not been established with previously obtained C&C servers (Figure 16).\nMoreover, we believe that the Telegram dead-drop resolver is available for higher tier subscriptions. This is because many samples do not have the Telegram URL set, and therefore the malware skips this method.\nEach Lumma Stealer sample contains a unique hardcoded affiliate identifier known as LID. It is embedded in plaintext form and utilized for communication with C&C servers. Up until March 2025, the LID parameter string followed a structured format, delimited by two dashes (Figure 7). A detailed analysis of the LID affiliate string is provided in an upcoming section.\nAlthough the most prevalent LID observed during our tracking begins with the string uz4s1o; the second most common LID, which starts with LPnhqo, provides a better example for visualizing typical LID variability. In the word cloud in Figure 8, we present the top 200 LIDs collected during our tracking, starting with LPnhqo.\nHowever, in early March 2025, Lumma Stealer transitioned to using hexadecimal identifiers, referred to internally as UID (see Figure 9).\nIn addition to the LID parameter, Lumma Stealer samples may also contain an optional parameter referred to internally as J. When present, this parameter is in cleartext and formatted as a 32-byte ASCII hex string (see Figure 10). The J parameter is utilized in the C&C request for dynamic configuration with additional definitions for exfiltration. We talk about dynamic configuration in more detail in a following section.\nIf the J parameter is missing in the Lumma Stealer sample, an empty string is used in the C&C request and a default configuration is retrieved. Unlike LID, the J parameter is rarely present in Lumma Stealer samples. However, it plays a crucial role when present, as it enables retrieving a dynamic configuration that significantly increases the stealer’s capabilities, making it a more versatile exfiltration tool for threat actors.\nIn March 2025, when the LID parameter was renamed to UID and its format changed, the J parameter was renamed to CID but with no change to its format or function.\nFrom our long-term tracking and statistical analysis of LID parameters, we believe that the first segment of the LID identifies the affiliate, while the second segment differentiates between campaigns. Based on this assumption you can see the top 200 affiliate identifiers in Figure 11.\nMoreover, we have been able to create a visualization of the affiliates’ activities over the past year (see Figure 12). This visualization highlights a week in January 2025. These types of visualizations have provided us with valuable insights into the patterns and behaviors of different threat actors. Additionally, the visualizations reveal a shared, domain-based C&C infrastructure among most Lumma Stealer affiliates. At the same time, we were able to identify less frequently used C&C domains, which we suspect have been reserved for higher tier affiliates or more important campaigns.\nLumma Stealer retrieves a dynamic configuration from the C&C server, which contains definitions specifying what to scan for exfiltration (see Table 1). The primary focus is on stealing web browser extension data and databases containing passwords, session cookies, web browsing history, and autofill data. Besides web browsers, it also focuses on stealing data from password managers, VPNs, FTP clients, cloud services, remote desktop applications, email clients, cryptocurrency wallets, and note-taking applications.\nTable 1. Dynamic config’s JSON fields\n\n\n\nKey\nDescription\n\n\n\n\nv\nDynamic config version.\n\n\nse\nOption for taking a screenshot of the victim’s machine for exfiltration.\n\n\nex\nList of Chromium-based browser extensions to target for exfiltration.Each entry consists of: ·  The extension ID, stored as en. ·  The extension name, stored as ez.\n\n\nc\nDefinition of files targeted for exfiltration. The most interesting entries are: ·  The path for file scanning, stored as p. ·  The file extension list filter for exfiltration, stored as m. ·  The maximum folder scanning depth, stored as d. ·  The maximum file size for exfiltration, stored as fs.\n\n\n\nEven though we haven’t seen significant changes in the default configurations, this feature enhances the malware’s ability to perform targeted exfiltration (see Figure 13). A comprehensive overview of the configuration fields has already been well documented in this research by SpyCloud.\nThe configuration is in JSON format, and it is downloaded from the C&C server using an HTTPS POST request that includes the LID identifier, optional J parameter, and a specific hardcoded User-Agent string.\nThe protection of the dynamic configuration has changed a few times recently. Formerly, it was protected in the same way as the static C&C list, by a 32-byte XOR function and base64 encoding. In March 2025 the protection changed to ChaCha20, where the key and nonce were prepended to the encrypted configuration.\nThe User-Agent string is important to follow, as providing it correctly is essential for receiving the dynamic configuration. In April 2025, Lumma Stealer introduced an additional layer of obfuscation by encrypting JSON values using an 8-byte XOR function (see Figure 14).\nThis encrypted variant of the dynamic configuration is delivered when a slightly updated User-Agent string is specified (see Table 2).\nTable 2. User-Agent variants\n\n\n\nUser-Agent\nDescription\n\n\n\n\nMozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/119.0.0.0 Safari/537.36\nOld User-Agent string resulting in a dynamic configuration variant shown in Figure 13.\n\n\nMozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/109.0.0.0 Safari/537.36\nNew User-Agent string resulting in a dynamic configuration variant with encryption of some values (Figure 14).\n\n\n\nBesides this dynamic configuration approach, Lumma Stealer samples still contain hardcoded instructions for exfiltrating files. These include data from applications such as Outlook or Thunderbird, Steam account information, and Discord account tokens (see this SpyCloud blogpost). This combination of dynamic and hardcoded configurations ensures that Lumma Stealer can effectively collect a wide range of valuable data.\nTo summarize all the static and dynamic changes mentioned so far, we have created a timeline (Figure 15) highlighting the most significant developments observed in the Lumma Stealer malware over the past year.\nThroughout our Lumma Stealer tracking period, all extracted C&C domains consistently led to Cloudflare services, which are utilized to conceal Lumma Stealer’s real C&C infrastructure. Cloudflare services are also employed for C&C servers located via dead-drop resolvers.\nFirst, Lumma Stealer needs to obtain an active C&C server. The mechanism of this choice is illustrated in the flow chart shown in Figure 16.\nAlthough the actual handshake request to the C&C server is not present in the latest Lumma Stealer builds, it is worth mentioning because it was a feature of our tracking for a long time. The handshake request was an HTTPS POST request containing act=live and a hardcoded User-Agent. Active servers responded with a cleartext ok message.\nWhen Lumma Stealer identifies an active C&C server, it requests the configuration via an HTTPS POST request (Figure 17), which includes the LID and J parameters as data. If the J parameter is not present in the sample, Lumma Stealer retrieves the default configuration from the C&C server. This configuration specifies what to scan for exfiltration, allowing the malware to adapt to different targets and environments.\nAfter Lumma Stealer successfully exfiltrates sensitive data and harvested credentials, it issues one final HTTPS POST request to the C&C server – this time, with an additional victim hardware ID called hwid. This final request retrieves a configuration of an additional payload to be executed on the victim’s machine. The payload or a URL to download from is part of that configuration. Note that such a payload is not always provided.\nLumma Stealer employs a few, but effective, anti-emulation techniques to make analysis as complicated as possible. These techniques are designed to evade detection and hinder the efforts of security analysts.\nOne of the primary obfuscation techniques used by Lumma Stealer is indirect control flow flattening, shown in Figure 18. This method effectively disrupts the code blocks of the functions, making it nearly impossible to keep track of the function logic. By flattening the control flow, the malware obfuscates its operations, complicating the analysis process. For a detailed exploration of this technique and thorough analysis of these obfuscation patterns, along with an outline of the solution, you can refer to this comprehensive article by Mandiant.\nAnother technique employed by Lumma Stealer is the use of encrypted stack strings, as illustrated in Figure 19. This method effectively hides binary data and many important strings in the Lumma Stealer sample, making static analysis of the binary difficult. Moreover, each encrypted string has its own unique mathematical function for decryption, adding another layer of complexity to the analysis process.\nIn Lumma Stealer, imports are resolved at runtime. Import names are hashed using the FNV-1a algorithm with each build using a custom offset basis. As shown in Figure 20, since August 25th, 2024, Lumma Stealer also obfuscates the FNV hash algorithm parameters by using stack strings.\nThis global disruption operation was made possible by our long-term tracking of Lumma Stealer, which we have provided an overview of in this blogpost. We have described the modus operandi of the Lumma Stealer group and its service. Additionally, we have documented the important static identifiers and C&C communication as well as its evolution over the last year. Finally, we summarized the key obfuscation techniques that make the analysis of Lumma Stealer challenging.\nThe disruption operation, led by Microsoft, aims to seize all known Lumma Stealer C&C domains, rendering Lumma Stealer’s exfiltration infrastructure nonfunctional. ESET will continue to track other infostealers while closely monitoring for Lumma Stealer activity following this disruption operation.\n\n\n\nIP\nDomain\nHosting provider\nFirst seen\nDetails\n\n\n\n\n172.67.134[.]100\ncooperatvassquaidmew[.]xyz\nCloudflare, Inc.\n2024‑06‑27\nLumma Stealer C&C server.\n\n\n172.67.175[.]165\ncrisisrottenyjs[.]xyz\nCloudflare, Inc.\n2024‑06‑27\nLumma Stealer C&C server.\n\n\n188.114.96[.]1\ndeadtrainingactioniw[.]xyztamedgeesy[.]sbsnighetwhisper[.]top\nCloudflare, Inc.\n2024‑06‑27\nLumma Stealer C&C server.\n\n\n172.67.141[.]43\nexuberanttjdkwo[.]xyz\nCloudflare, Inc.\n2024‑06‑27\nLumma Stealer C&C server.\n\n\n188.114.96[.]3\ngrandcommonyktsju[.]xyz\nCloudflare, Inc.\n2024‑06‑27\nLumma Stealer C&C server.\n\n\n104.21.92[.]96\nqualificationjdwko[.]xyz\nCloudflare, Inc.\n2024‑06‑27\nLumma Stealer C&C server.\n\n\n172.67.209[.]200\nsweetcalcutangkdow[.]xyz\nCloudflare, Inc.\n2024‑06‑27\nLumma Stealer C&C server.\n\n\n104.21.49[.]80\nwordingnatturedowo[.]xyz\nCloudflare, Inc.\n2024‑06‑27\nLumma Stealer C&C server.\n\n\n188.114.97[.]0\nbigmouthudiop[.]shopfroytnewqowv[.]shoplocatedblsoqp[.]shopstagedchheiqwo[.]shop\nCloudflare, Inc.\n2024‑07‑16\nLumma Stealer C&C server.\n\n\n104.21.19[.]156\ncallosallsaospz[.]shop\nCloudflare, Inc.\n2024‑07‑18\nLumma Stealer C&C server.\n\n\n172.67.153[.]40\nindexterityszcoxp[.]shop\nCloudflare, Inc.\n2024‑07‑18\nLumma Stealer C&C server.\n\n\n172.67.192[.]52\nlariatedzugspd[.]shop\nCloudflare, Inc.\n2024‑07‑18\nLumma Stealer C&C server.\n\n\n172.67.213[.]85\nliernessfornicsa[.]shop\nCloudflare, Inc.\n2024‑07‑18\nLumma Stealer C&C server.\n\n\n172.67.137[.]78\noutpointsozp[.]shop\nCloudflare, Inc.\n2024‑07‑18\nLumma Stealer C&C server.\n\n\n172.67.221[.]214\nshepherdlyopzc[.]shop\nCloudflare, Inc.\n2024‑07‑18\nLumma Stealer C&C server.\n\n\n172.67.204[.]158\nunseaffarignsk[.]shop\nCloudflare, Inc.\n2024‑07‑18\nLumma Stealer C&C server.\n\n\n172.67.178[.]194\nupknittsoappz[.]shop\nCloudflare, Inc.\n2024‑07‑18\nLumma Stealer C&C server.\n\n\n188.114.97[.]3\nbassizcellskz[.]shopbyteplusx[.]digitalsparkiob[.]digitallongitudde[.]digital\nCloudflare, Inc.\n2024‑08‑07\nLumma Stealer C&C server.\n\n\n104.21.47[.]141\ncelebratioopz[.]shop\nCloudflare, Inc.\n2024‑08‑07\nLumma Stealer C&C server.\n\n\n172.67.158[.]159\ncomplaintsipzzx[.]shop\nCloudflare, Inc.\n2024‑08‑07\nLumma Stealer C&C server.\n\n\n172.67.204[.]20\ndeallerospfosu[.]shop\nCloudflare, Inc.\n2024‑08‑07\nLumma Stealer C&C server.\n\n\n104.21.35[.]48\nlanguagedscie[.]shop\nCloudflare, Inc.\n2024‑08‑07\nLumma Stealer C&C server.\n\n\n104.21.73[.]43\nmennyudosirso[.]shop\nCloudflare, Inc.\n2024‑08‑07\nLumma Stealer C&C server.\n\n\n188.114.97[.]9\nquialitsuzoxm[.]shop\nCloudflare, Inc.\n2024‑08‑07\nLumma Stealer C&C server.\n\n\n172.67.166[.]231\nwriterospzm[.]shop\nCloudflare, Inc.\n2024‑08‑07\nLumma Stealer C&C server.\n\n\n104.21.16[.]180\ncaffegclasiqwp[.]shop\nCloudflare, Inc.\n2024‑08‑24\nLumma Stealer C&C server.\n\n\n172.67.146[.]35\ncondedqpwqm[.]shop\nCloudflare, Inc.\n2024‑08‑24\nLumma Stealer C&C server.\n\n\nN/A\nevoliutwoqm[.]shop\nN/A\n2024‑08‑24\nLumma Stealer C&C server.\n\n\n188.114.96[.]0\nmillyscroqwp[.]shopstamppreewntnq[.]shopadvennture[.]top\nCloudflare, Inc.\n2024‑08‑24\nLumma Stealer C&C server.\n\n\n104.21.67[.]155\ntraineiwnqo[.]shop\nCloudflare, Inc.\n2024‑08‑24\nLumma Stealer C&C server.\n\n\n94.140.14[.]33\nachievenmtynwjq[.]shopcarrtychaintnyw[.]shopchickerkuso[.]shopmetallygaricwo[.]shopmilldymarskwom[.]shopopponnentduei[.]shoppuredoffustow[.]shopquotamkdsdqo[.]shopbemuzzeki[.]sbsexemplarou[.]sbsexilepolsiy[.]sbsfrizzettei[.]sbsinvinjurhey[.]sbsisoplethui[.]sbsladdyirekyi[.]sbswickedneatr[.]sbs\nCloudflare, Inc.\n2024‑09‑21\nLumma Stealer C&C server.\n\n\n188.114.97[.]4\nusseorganizedw[.]shopbellflamre[.]clicktripfflux[.]world\nCloudflare, Inc.\n2024‑09‑24\nLumma Stealer C&C server.\n\n\n104.21.44[.]84\nbeerishint[.]sbs\nCloudflare, Inc.\n2024‑10‑06\nLumma Stealer C&C server.\n\n\n104.21.64[.]84\n1212tank.activitydmy[.]icu\nCloudflare, Inc.\n2024‑11‑12\nLumma Stealer C&C server.\n\n\n104.21.93[.]246\nbrownieyuz[.]sbs\nCloudflare, Inc.\n2024‑11‑08\nLumma Stealer C&C server.\n\n\n172.67.189[.]210\nducksringjk[.]sbs\nCloudflare, Inc.\n2024‑11‑08\nLumma Stealer C&C server.\n\n\n172.67.146[.]64\nexplainvees[.]sbs\nCloudflare, Inc.\n2024‑11‑08\nLumma Stealer C&C server.\n\n\n104.21.90[.]226\nrelalingj[.]sbs\nCloudflare, Inc.\n2024‑11‑08\nLumma Stealer C&C server.\n\n\n104.21.14[.]17\nrepostebhu[.]sbs\nCloudflare, Inc.\n2024‑11‑08\nLumma Stealer C&C server.\n\n\n172.67.192[.]43\nrottieud[.]sbs\nCloudflare, Inc.\n2024‑11‑08\nLumma Stealer C&C server.\n\n\n188.114.97[.]1\nthinkyyokej[.]sbs\nCloudflare, Inc.\n2024‑11‑08\nLumma Stealer C&C server.\n\n\n188.114.97[.]7\nbashfulacid[.]lattentabatte[.]lat\nCloudflare, Inc.\n2024‑12‑23\nLumma Stealer C&C server.\n\n\n104.21.86[.]54\ncurverpluch[.]lat\nCloudflare, Inc.\n2024‑12‑23\nLumma Stealer C&C server.\n\n\n104.21.66[.]86\nlev‑tolstoi[.]com\nCloudflare, Inc.\n2024‑12‑17\nLumma Stealer C&C server.\n\n\n172.64.80[.]1\nmanyrestro[.]lattoppyneedus[.]biz\nCloudflare, Inc.\n2024‑12‑23\nLumma Stealer C&C server.\n\n\n188.114.97[.]2\nshapestickyr[.]lat\nCloudflare, Inc.\n2024‑12‑23\nLumma Stealer C&C server.\n\n\n172.67.192[.]247\nslipperyloo[.]lat\nCloudflare, Inc.\n2024‑12‑23\nLumma Stealer C&C server.\n\n\n104.105.90[.]131\nsteamcommunity[.]comsteamcommunity[.]com\nAkamai Technologies, Inc.\n2024‑06‑27\nSteam profile dead‑drop resolvers.\n\n\n172.67.146[.]68\ntalkynicer[.]lat\nCloudflare, Inc.\n2024‑12‑23\nLumma Stealer C&C server.\n\n\n172.67.184[.]241\nwordyfindy[.]lat\nCloudflare, Inc.\n2024‑12‑23\nLumma Stealer C&C server.\n\n\nN/A\nbeevasyeip[.]bond\nN/A\n2025‑01‑22\nLumma Stealer C&C server.\n\n\nN/A\nbroadecatez[.]bond\nN/A\n2025‑01‑22\nLumma Stealer C&C server.\n\n\nN/A\nencirelk[.]cyou\nN/A\n2025‑01‑28\nLumma Stealer C&C server.\n\n\nN/A\ngranystearr[.]bond\nN/A\n2025‑01‑22\nLumma Stealer C&C server.\n\n\nN/A\nquarrelepek[.]bond\nN/A\n2025‑01‑22\nLumma Stealer C&C server.\n\n\nN/A\nrockemineu[.]bond\nN/A\n2025‑01‑28\nLumma Stealer C&C server.\n\n\n104.21.19[.]91\nsuggestyuoz[.]biz\nCloudflare, Inc.\n2025‑01‑22\nLumma Stealer C&C server.\n\n\nN/A\ntranuqlekper[.]bond\nN/A\n2025‑01‑22\nLumma Stealer C&C server.\n\n\n104.21.69[.]194\ncodxefusion[.]top\nCloudflare, Inc.\n2025‑02‑28\nLumma Stealer C&C server.\n\n\n104.21.80[.]1\nearthsymphzony[.]todayclimatologfy[.]top\nCloudflare, Inc.\n2025‑02‑26\nLumma Stealer C&C server.\n\n\n104.21.88[.]16\nexperimentalideas[.]today\nCloudflare, Inc.\n2025‑03‑01\nLumma Stealer C&C server.\n\n\n172.67.146[.]181\ngadgethgfub[.]icu\nCloudflare, Inc.\n2025‑03‑01\nLumma Stealer C&C server.\n\n\n104.21.48[.]238\nhardrwarehaven[.]run\nCloudflare, Inc.\n2025‑02‑28\nLumma Stealer C&C server.\n\n\n104.21.16[.]1\nhardswarehub[.]todaypixtreev[.]run\nCloudflare, Inc.\n2025‑02‑28\nLumma Stealer C&C server.\n\n\n104.21.39[.]95\nquietswtreams[.]life\nCloudflare, Inc.\n2025‑02‑26\nLumma Stealer C&C server.\n\n\n172.67.222[.]46\nsocialsscesforum[.]icu\nCloudflare, Inc.\n2025‑03‑03\nLumma Stealer C&C server.\n\n\n172.67.191[.]187\ntechmindzs[.]live\nCloudflare, Inc.\n2025‑03‑01\nLumma Stealer C&C server.\n\n\n172.67.214[.]226\ntechspherxe[.]top\nCloudflare, Inc.\n2025‑03‑01\nLumma Stealer C&C server.\n\n\n104.21.26[.]124\nappgridn[.]live\nCloudflare, Inc.\n2025‑03‑24\nLumma Stealer C&C server.\n\n\n172.67.178[.]7\nlunoxorn[.]top\nCloudflare, Inc.\n2025‑03‑31\nLumma Stealer C&C server.\n\n\n104.21.47[.]117\nskynetxc[.]live\nCloudflare, Inc.\n2025‑03‑24\nLumma Stealer C&C server.\n\n\n104.21.72[.]121\ntargett[.]top\nCloudflare, Inc.\n2025‑03‑20\nLumma Stealer C&C server.\n\n\n188.114.96[.]2\ntravewlio[.]shop\nCloudflare, Inc.\n2025‑03‑20\nLumma Stealer C&C server.\n\n\n104.21.42[.]7\nchangeaie[.]top\nCloudflare, Inc.\n2025‑04‑08\nLumma Stealer C&C server.\n\n\n104.21.85[.]126\nclarmodq[.]top\nCloudflare, Inc.\n2025‑04‑08\nLumma Stealer C&C server.\n\n\n172.67.161[.]40\nliftally[.]top\nCloudflare, Inc.\n2025‑04‑08\nLumma Stealer C&C server.\n\n\n172.67.176[.]107\npiratetwrath[.]run\nCloudflare, Inc.\n2025‑04‑17\nLumma Stealer C&C server.\n\n\n172.67.215[.]114\nquilltayle[.]live\nCloudflare, Inc.\n2025‑04‑17\nLumma Stealer C&C server.\n\n\n172.67.143[.]12\nsalaccgfa[.]top\nCloudflare, Inc.\n2025‑04‑08\nLumma Stealer C&C server.\n\n\n104.21.5[.]146\nstarofliught[.]top\nCloudflare, Inc.\n2025‑04‑17\nLumma Stealer C&C server.\n\n\n104.21.32[.]1\nzestmodp[.]top\nCloudflare, Inc.\n2025‑04‑08\nLumma Stealer C&C server.\n\n\n172.67.147[.]123\nequatorf[.]run\nCloudflare, Inc.\n2025‑04‑21\nLumma Stealer C&C server.\n\n\n104.21.112[.]1\nhemispherexz[.]top\nCloudflare, Inc.\n2025‑04‑21\nLumma Stealer C&C server.\n\n\n104.21.20[.]106\nlatitudert[.]live\nCloudflare, Inc.\n2025‑04‑21\nLumma Stealer C&C server.\n\n\n172.67.216[.]12\nsectorecoo[.]live\nCloudflare, Inc.\n2025‑04‑19\nLumma Stealer C&C server.\n\n\n\nThis table was built using version 17 of the MITRE ATT&CK framework.\n\n\n\nTactic\nID\nName\nDescription\n\n\n\n\nResource Development\nT1587.001\nDevelop Capabilities: Malware\nLumma Stealer operators actively developed their malware as a product for their service.\n\n\nT1583.001\nAcquire Infrastructure: Domains\nLumma Stealer operators registered domains for their exfiltration infrastructure.\n\n\nT1583.006\nAcquire Infrastructure: Web Services\nLumma Stealer operators used Cloudflare services to hide their infrastructure. Lumma Stealer also hid its C&C URLs in public services like dummy Steam profiles or empty Telegram channels.\n\n\nExecution\nT1059.003\nCommand-Line Interface: Windows Command Shell\nLumma Stealer executes cmd.exe to delete temporary files.\n\n\nT1106\nNative API\nLumma Stealer executes a variety of Windows APIs, including VirtualAlloc, LoadLibraryA, and GetProcAddress.\n\n\nT1204.001\nUser Execution: Malicious Link\nLumma Stealer operators offer a simple LNK packing feature for their malware builds.\n\n\nT1047\nWindows Management Instrumentation\nLumma Stealer uses WMI queries to gather system information.\n\n\nDefense Evasion\nT1622\nDebugger Evasion\nLumma Stealer checks for debugger presence.\n\n\nT1140\nDeobfuscate/Decode Files or Information\nLumma Stealer uses ChaCha20 for C&C list and dynamic config encryption.\n\n\nT1027.007\nObfuscated Files or Information: Dynamic API Resolution\nLumma Stealer resolves API names at runtime using the FNV-1a hash algorithm.\n\n\nT1027.013\nObfuscated Files or Information: Encrypted/Encoded File\nLumma Stealer encrypts strings and important binary data using stack strings or ChaCha20.\n\n\nCredential Access\nT1555.003\nCredentials from Password Stores: Credentials from Web Browsers\nLumma Stealer gathers credentials from multiple browsers.\n\n\nT1539\nSteal Web Session Cookie\nLumma Stealer gathers cookies from multiple browsers.\n\n\nDiscovery\nT1217\nBrowser Bookmark Discovery\nLumma Stealer checks and collects various information about installed browsers on victims’ machines.\n\n\nT1012\nQuery Registry\nLumma Stealer queries registry keys to list installed software on victims’ machines.\n\n\nT1057\nProcess Discovery\nLumma Stealer sends the process list to its C&C server.\n\n\nT1518\nSoftware Discovery\nLumma Stealer sends a list of installed software to its C&C server.\n\n\nT1082\nSystem Information Discovery\nLumma Stealer sends system information to its C&C server.\n\n\nT1124\nSystem Time Discovery\nLumma Stealer sends the current system time and time zone to its C&C server.\n\n\nCollection\nT1560\nArchive Collected Data\nLumma Stealer compresses gathered data before exfiltration to its C&C server.\n\n\nT1119\nAutomated Collection\nLumma Stealer's exfiltration capabilities are fully automated and based on a configuration file.\n\n\nT1113\nScreen Capture\nLumma Stealer takes screenshots of victims’ machines based on dynamic configuration.\n\n\nT1005\nData from Local System\nLumma Stealer collects local system data from victims’ machines.\n\n\nCommand and Control\nT1071.001\nApplication Layer Protocol: Web Protocols\nLumma Stealer uses HTTPS communication with its C&C servers.\n\n\nT1132.001\nData Encoding: Standard Encoding\nLumma Stealer used base64 encoding for obtaining its configuration from the C&C server.\n\n\nT1573.001\nEncrypted Channel: Symmetric Cryptography\nLumma Stealer uses additional ChaCha20 encryption under the HTTPS network protocol.\n\n\nT1008\nFallback Channels\nLumma Stealer employs backup dead-drop resolvers in Steam profiles and Telegram channels.\n\n\nT1102.001\nWeb Service: Dead Drop Resolver\nLumma Stealer employs backup dead-drop resolvers in Steam profiles and Telegram channels.\n\n\nExfiltration\nT1020\nAutomated Exfiltration\nLumma Stealer exfiltrates stolen credentials and data over the C&C channel.\n\n\nT1041\nExfiltration Over C2 Channel\nLumma Stealer exfiltrates stolen credentials and data over the C&C channel.\n\n\n\n\n\n      Sign up for our newsletters\n    \nESET Research\nThreat Reports\nESET APT Activity Report Q4 2024–Q1 2025\nESET Research\nThreat Reports\nESET APT Activity Report Q4 2024–Q1 2025\n\nESET Research\nOperation RoundPress\nESET Research\nOperation RoundPress\n\nESET Research\nTheWizards APT group uses SLAAC spoofing to perform adversary-in-the-middle attacks\nESET Research\nTheWizards APT group uses SLAAC spoofing to perform adversary-in-the-middle attacks\n\nESET research\nESET takes part in global operation to disrupt Trickbot\nESET research\nESET takes part in global operation to disrupt Zloader botnets\nESET research\nESET takes part in global operation to disrupt the Grandoreiro banking trojan\n\n            Award-winning news, views, and insight from the ESET security community\n          "
    },
    {
        "Title": "CISA Says Russian Hackers Targeting Western Supply-Lines to Ukraine",
        "Link": "https://www.securityweek.com/cisa-says-russian-hackers-targeting-western-supply-lines-to-ukraine/",
        "Summary": "<p>Russian military intelligence hackers intensify targeting of Western logistics and technology companies moving supplies into Ukraine. </p>\n<p>The post <a href=\"https://www.securityweek.com/cisa-says-russian-hackers-targeting-western-supply-lines-to-ukraine/\">CISA Says Russian Hackers Targeting Western Supply-Lines to Ukraine</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/cisa-says-russian-hackers-targeting-western-supply-lines-to-ukraine/"
    },
    {
        "Title": "Microsoft Sinkholes Domains, Disrupts Notorious ‘Lumma Stealer’ Malware Operation",
        "Link": "https://www.securityweek.com/microsoft-sinkholes-domains-disrupts-notorious-lumma-stealer-malware-operation/",
        "Summary": "<p>Redmond’s threat hunters found 394,000 Windows systems talking to Lumma controllers, a victim pool that included global manufacturers. </p>\n<p>The post <a href=\"https://www.securityweek.com/microsoft-sinkholes-domains-disrupts-notorious-lumma-stealer-malware-operation/\">Microsoft Sinkholes Domains, Disrupts Notorious ‘Lumma Stealer’ Malware Operation</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/microsoft-sinkholes-domains-disrupts-notorious-lumma-stealer-malware-operation/"
    },
    {
        "Title": "Critical Flaw Allows Remote Hacking of AutomationDirect Industrial Gateway",
        "Link": "https://www.securityweek.com/critical-flaw-allows-remote-hacking-of-automationdirect-industrial-gateway/",
        "Summary": "<p>More than 100 AutomationDirect MB-Gateway devices may be vulnerable to attacks from the internet due to CVE-2025-36535.</p>\n<p>The post <a href=\"https://www.securityweek.com/critical-flaw-allows-remote-hacking-of-automationdirect-industrial-gateway/\">Critical Flaw Allows Remote Hacking of AutomationDirect Industrial Gateway</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-21",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/critical-flaw-allows-remote-hacking-of-automationdirect-industrial-gateway/"
    },
    {
        "Title": "Alleged Data Breach Exposes 1.02 TB of Sensitive Property Information",
        "Link": "https://dailydarkweb.net/alleged-data-breach-exposes-1-02-tb-of-sensitive-property-information/",
        "Summary": "<p>A massive 1.02 terabyte collection of sensitive property data, allegedly sourced from the cloud infrastructure of Bradley R Tyer &#38; Associates, a prominent title search firm, is reportedly being offered for sale online. The data, spanning from 1990 to 2025, is said to include a wide array of property, legal, and financial documents from key [&#8230;]</p>\n<p>The post <a href=\"https://dailydarkweb.net/alleged-data-breach-exposes-1-02-tb-of-sensitive-property-information/\">Alleged Data Breach Exposes 1.02 TB of Sensitive Property Information</a> appeared first on <a href=\"https://dailydarkweb.net\">Daily Dark Web</a>.</p>",
        "Date": "2025-05-21",
        "Content": "A massive 1.02 terabyte collection of sensitive property data, allegedly sourced from the cloud infrastructure of Bradley R Tyer & Associates, a prominent title search firm, is reportedly being offered for sale online. The data, spanning from 1990 to 2025, is said to include a wide array of property, legal, and financial documents from key U.S. states, including Illinois, Indiana, Wisconsin, Minnesota, Iowa, Colorado, and Kansas.\nThe leaked archive allegedly contains critical information such as title search reports, ownership chains, tax data, legal claims, deeds, mortgages, lien records, court filings, and survey maps. This comprehensive dataset, if legitimate, could have significant implications for real estate market analysis, investment strategies, and competitive research. The sellers claim the data was extracted from a firm with partnerships including ServiceLink and reputable banks, adding to the alleged credibility of the information.\nThe data is reportedly organized by state, county, and document type, compressed in ZIP/RAR files, and offered via a password-protected download link. Payment for the alleged data is requested in Bitcoin (BTC) or Monero (XMR) through a secure escrow service, with delivery promised within 24 hours of payment confirmation.\nTags:\nCyberSecurity\ndark web\ndata-breach\ndata-leak\nfinancial data\nproperty data\nreal estate\nsensitive-data"
    },
    {
        "Title": "Marks & Spencer Faces £300 Million Profit Hit Following Ransomware Attack",
        "Link": "https://dailydarkweb.net/marks-spencer-faces-300-million-profit-hit-following-ransomware-attack/",
        "Summary": "<p>British retail giant Marks &#38; Spencer (M&#38;S) is grappling with the aftermath of a significant cyberattack that has resulted in an estimated £300 million ($402 million) reduction in operating profits for the fiscal year ending March 2026. The attack, which began over the Easter weekend, has severely disrupted M&#38;S&#8217;s online operations, particularly affecting sales in [&#8230;]</p>\n<p>The post <a href=\"https://dailydarkweb.net/marks-spencer-faces-300-million-profit-hit-following-ransomware-attack/\">Marks &#038; Spencer Faces £300 Million Profit Hit Following Ransomware Attack</a> appeared first on <a href=\"https://dailydarkweb.net\">Daily Dark Web</a>.</p>",
        "Date": "2025-05-21",
        "Content": "British retail giant Marks & Spencer (M&S) is grappling with the aftermath of a significant cyberattack that has resulted in an estimated £300 million ($402 million) reduction in operating profits for the fiscal year ending March 2026. The attack, which began over the Easter weekend, has severely disrupted M&S’s online operations, particularly affecting sales in clothing, home, and beauty products. The company anticipates that these disruptions will persist into July as efforts to restore systems continue.\nThe breach has been linked to the ransomware group Scattered Spider, known for targeting major corporations through sophisticated social engineering tactics. Investigations by the UK’s National Crime Agency and the FBI are ongoing. M&S has confirmed that personal customer data, including names, email addresses, and birth dates, were compromised via a third-party contractor.\nIn response to the attack, M&S has implemented manual processes in stores, leading to increased operational costs and reduced product availability. The company has not disclosed whether a ransom was paid and is focusing on system recovery and strengthening cybersecurity measures. Despite the setback, M&S reported a 22% rise in pre-tax adjusted profits to £875.5 million and a 6.1% increase in sales to nearly £14 billion for the previous year.\nThe incident has also impacted M&S’s market value, with shares dropping 11% since the breach, erasing over £1 billion in market capitalization. The company aims to mitigate some financial losses through insurance and cost controls but acknowledges the potential long-term effects on growth plans and executive compensation. M&S is accelerating its technology transformation strategy, with plans to complete system upgrades within six months.\nThis cyberattack underscores the growing threat of ransomware to the retail sector and highlights the importance of robust cybersecurity measures and third-party risk management.\nTags:\ncyberattack\nCyberSecurity\ndata-breach\nM&S\nMarks & Spencer\nonline retail disruption\nprofit loss\nransomware\nretail sector\nscattered-spider\nUK business"
    }
]