[
    {
        "Title": "OpenAI document explains when to use each ChatGPT model",
        "Link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-document-explains-when-to-use-each-chatgpt-model/",
        "Summary": "OpenAI admitted that it can be confusing for users to choose between all the different models, but the company has quietly published a document that makes it easier to understand ChatGPT. [...]",
        "Date": "2025-05-04",
        "Content": "OpenAI admitted that it can be confusing for users to choose between all the different models, but the company has quietly published a document that makes it easier to understand ChatGPT.\nOpenAI\nposted\nan article titled \"ChatGPT Enterprise - Models & Limits\" on May 3.\nWhile it provides an overview of all the available models and when to use one over another for enterprises, these advices are also applicable to regular users.\nRight now, ChatGPT offers five models - GPT-4o, o3, o4-mini, o4-mini-high, and GPT-4.5.\nWhat to choose between GPT 4o and 4.5?\nAccording to the document, GPT 4o is the \"omni model\" with real-time information, and it should be used for summarizing content, brainstorming ideas or emails.\nSince it's a full-fledged multimodal, you can use nearly all the features, ranging from custom GPTs to image generation, canvas, advanced audio, and data analysis.\nOn the other hand, GPT-4.5 is your \"creative\" powerhouse, and it offers better emotional intelligence, communication and a creative approach to brainstorming.\nIt's a lot like the GPT-4o, but if you prefer more creativity, GPT-4.5 should be your first choice.\nWhat to choose between o4-mini, o4-mini-high and o3?\nChatGPT offers three reasoning models to regular users, but which one should you be using?\nAs per the document, o4-mini is fast for technical tasks, such as quick STEM-related queries, programming, visual reasoning.\nOn the other hand, o4-mini-high is best at detailed technical tasks, such as advanced coding, math, scientific explanations and higher accuracy.\nUnlike these two models, o3 stands out in complex or multi step tasks, such as strategic planning, detailed analyses, extensive coding, advanced math, science, coding, and visual reasoning.\nYou'll be able to choose between these models only when you pay $20 for ChatGPT Plus.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nOpenAI's $20 ChatGPT Plus is now free for students until the end of May\nChatGPT is down worldwide with something went wrong error\nOpenAI says Deep Research is coming to ChatGPT free \"very soon\"\nGoogle takes on Cursor with Firebase Studio, its AI builder for vibe coding\nOpenAI tests watermarking for ChatGPT-4o Image Generation model"
    },
    {
        "Title": "StealC malware enhanced with stealth upgrades and data theft tools",
        "Link": "https://www.bleepingcomputer.com/news/security/stealc-malware-enhanced-with-stealth-upgrades-and-data-theft-tools/",
        "Summary": "The creators of StealC, a widely-used information stealer and malware downloader, have released its second major version, bringing multiple stealth and data theft enhancements. [...]",
        "Date": "2025-05-04",
        "Content": "The creators of StealC, a widely-used information stealer and malware downloader, have released its second major version, bringing multiple stealth and data theft enhancements.\nThe latest version of StealC was actually made available to cybercriminals in March 2025, but\nZscaler researchers\nwho analyzed it just published a detailed write-up.\nIn the weeks that followed its release, several minor bug fixes and point releases added new features, with the latest being version 2.2.4.\nStealC is a lightweight info-stealer malware that gained traction on the dark web in\nearly 2023\n, selling access for\n$200/month\n.\nIn 2024, it was spotted in large-scale\nmalvertising campaigns\nand attacks locking systems into\ninescapable kiosk modes\n.\nIn late 2024, it was confirmed that StealC development remained very active, with its developers\nadding a bypassing mechanism\nfor Chrome's 'App-Bound Encryption' cookie-theft defenses, allowing the \"regeneration\" of expired cookies for hijacking Google accounts.\nNew in latest version\nVersion 2 (and later) was announced in March 2025. According to Zscaler's analysis, it brings the following major improvements:\nPayload delivery enhancements with support for EXE files, MSI packages, and PowerShell scripts, and configurable payload triggering.\nRC4 encryption was added for code strings and command-and-control (C2) communications, with random parameters in C2 responses for better evasion.\nArchitecture and execution improvements with new payloads compiled for 64-bit systems, resolving API functions dynamically at runtime, and introducing a self-deletion routine.\nNew embedded builder that allows operators to generate new StealC builds using templates and custom data theft rules.\nAdded Telegram bot support for real-time alerts to operators.\nAdded capability to screenshot the victim's desktop with multi-monitor support.\nStealC v2 new admin panel\nSource: Zscaler\nHowever, apart from the feature additions, there have also been some notable removals, like the anti-VM checks and DLL downloading/execution.\nThese might indicate an effort to make the malware leaner, but they may also be collateral damage from major code rework and could be re-introduced in better form in future versions.\nStealC's C2 communication flow\nSource: Zscaler\nIn the most recent attacks seen by Zscaler, StealC was deployed by Amadey, a separate malware loader, though different operators could differentiate the delivery methods or attack chains.\nTo protect your data from info-stealer malware, avoid storing sensitive information on your browser for convenience, use multi-factor authentication to protect your accounts, and never download pirated or other software from obscure sources.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft says malvertising campaign impacted 1 million PCs\nSteam pulls game demo infecting Windows with info-stealing malware\nNew Arcane infostealer infects YouTube, Discord users via game cheats\nClickFix attack delivers infostealers, RATs in fake Booking.com emails\nHackers abuse IPv6 networking feature to hijack software updates"
    }
]