[
    {
        "Title": "Europol Shuts Down Six DDoS-for-Hire Services Used in Global Attacks",
        "Link": "https://thehackernews.com/2025/05/europol-shuts-down-six-ddos-for-hire.html",
        "Summary": "Europol has announced the takedown of distributed denial of service (DDoS)-for-hire services that were used to launch thousands of cyber-attacks across the world.\nIn connection with the operation, Polish authorities have arrested four individuals and the United States has seized nine domains that are associated with the now-defunct platforms.\n\"The suspects are believed to be behind six separate",
        "Date": "2025-05-07",
        "Content": "Europol has announced the takedown of distributed denial of service (DDoS)-for-hire services that were used to launch thousands of cyber-attacks across the world.\nIn connection with the operation, Polish authorities have arrested four individuals and the United States has seized nine domains that are associated with the now-defunct platforms.\n\"The suspects are believed to be behind six separate stresser/booter services that enabled paying customers to flood websites and servers with malicious traffic — knocking them offline for as little as EUR 10,\" Europol\nsaid\nin a statement.\nThe services, named cfxapi, cfxsecurity, neostress, jetstress, quickdown and zapcut, are said to have been instrumental in launching widespread attacks on schools, government services, businesses, and gaming platforms between 2022 and 2025.\nEuropol said the platforms offered \"slick user interfaces,\" enabling malicious actors with little to no technical expertise to orchestrate DDoS attacks by simply entering a target IP address, choosing the type of attack, and paying a fee.\nStresser services, typically advertised on underground forums, are often disguised as legitimate stress-testing tools but are designed to disrupt access to web resources by letting their customers unleash a flood of fake traffic against a target site, making them inaccessible to real users.\n\"Unlike traditional botnets, which require the control of large numbers of infected devices, stresser/booter services industrialise DDoS attacks through centralised, rented infrastructure,\" Europol noted.\nQuickDown Pricing Plans as of July 15, 2024\nAccording to snapshots captured on the Internet Archive,\ncfxsecurity\n, hosted on the domains cfxsecurity[.]bet and \"cfxsecurity.cc,\" marketed itself as the \"#1 stress testing service\" and that it provided \"comprehensive stress test, ensuring your website and services are ready to weather any storm.\"\nThe service offered three plans, Starter for $20/month, Premium for $50/month, and Enterprise for $130/month.\nQuickDown\n(\"quickdown[.]pro\"), likewise,\npriced\nits kit for anywhere between $20/month to $379/month.\nCloud security company Radware, in a\nreport\npublished in August 2024, revealed that QuickDown is among a new crop of stresser services that have adopted a hybrid architecture combining both botnets and dedicated servers. QuickDown is said to have introduced a \"Botnet addon and new plans related to the Botnet network\" in September 2023.\nThe latest action, conducted in collaboration with Dutch and German authorities, is part of an ongoing effort called Operation PowerOFF that aims to dismantle infrastructure facilitating DDoS-for-hire activity.\nIn December 2024, a set of 27 stresser services were\ntaken offline\n, alongside announcing charges against six different individuals in the Netherlands and the U.S.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "OttoKit WordPress Plugin with 100K+ Installs Hit by Exploits Targeting Multiple Flaws",
        "Link": "https://thehackernews.com/2025/05/ottokit-wordpress-plugin-with-100k.html",
        "Summary": "A second security flaw impacting the OttoKit (formerly SureTriggers) WordPress plugin has come under active exploitation in the wild.\nThe vulnerability, tracked as CVE-2025-27007 (CVSS score: 9.8), is a privilege escalation bug impacting all versions of the plugin prior to and including version 1.0.82.&nbsp;\n\"This is due to the create_wp_connection() function missing a capability check and",
        "Date": "2025-05-07",
        "Content": "A second security flaw impacting the\nOttoKit\n(formerly\nSureTriggers\n) WordPress plugin has come under active exploitation in the wild.\nThe vulnerability, tracked as CVE-2025-27007 (CVSS score: 9.8), is a privilege escalation bug impacting all versions of the plugin prior to and including version 1.0.82.\n\"This is due to the create_wp_connection() function missing a capability check and insufficiently verifying a user's authentication credentials,\" Wordfence\nsaid\n. \"This makes it possible for unauthenticated attackers to establish a connection, which ultimately can make privilege escalation possible.\"\nThat said, the vulnerability is exploitable only in two possible scenarios -\nWhen a site has never enabled or used an application password, and OttoKit has never been connected to the website using an application password before\nWhen an attacker has authenticated access to a site and can generate a valid application password\nWordfence revealed that it observed the threat actors attempting to exploit the initial connection vulnerability to establish a connection with the site, followed by using it to create an administrative user account via the automation/action endpoint.\nFurthermore, the attack attempts simultaneously aim for\nCVE-2025-3102\n(CVSS score: 8.1), another flaw in the same plugin that has also been exploited in the wild since last month.\nThis has raised the possibility that the threat actors are opportunistically scanning WordPress installations to see if they are susceptible to either of the two flaws. The IP addresses that have been observed targeting the vulnerabilities are listed below -\n2a0b:4141:820:1f4::2\n41.216.188.205\n144.91.119.115\n194.87.29.57\n196.251.69.118\n107.189.29.12\n205.185.123.102\n198.98.51.24\n198.98.52.226\n199.195.248.147\nGiven that the plugin has over 100,000 active installations, it's essential that users move quickly to apply the latest patches (version 1.0.83).\n\"Attackers may have started actively targeting this vulnerability as early as May 2, 2025 with mass exploitation starting on May 4, 2025,\" Wordfence said.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "SysAid Patches 4 Critical Flaws Enabling Pre-Auth RCE in On-Premise Version",
        "Link": "https://thehackernews.com/2025/05/sysaid-patches-4-critical-flaws.html",
        "Summary": "Cybersecurity researchers have disclosed multiple security flaw in the on-premise version of SysAid IT support software that could be exploited to achieve pre-authenticated remote code execution with elevated privileges.\nThe vulnerabilities, tracked as CVE-2025-2775, CVE-2025-2776, and CVE-2025-2777, have all been described as XML External Entity (XXE) injections, which occur when an attacker is",
        "Date": "2025-05-07",
        "Content": "Cybersecurity researchers have disclosed multiple security flaw in the on-premise version of SysAid IT support software that could be exploited to achieve pre-authenticated remote code execution with elevated privileges.\nThe vulnerabilities, tracked as CVE-2025-2775, CVE-2025-2776, and CVE-2025-2777, have all been described as XML External Entity (\nXXE\n) injections, which occur when an attacker is able to successfully interfere with an application's parsing of XML input.\nThis, in turn, could permit attackers to inject unsafe XML entities into the web application, allowing them to carry out a Server-Side Request Forgery (\nSSRF\n) attack and in worst cases, remote code execution.\nA description of the three vulnerabilities,\naccording\nto watchTowr Labs researchers Sina Kheirkhah and Jake Knott, is as follows -\nCVE-2025-2775 and CVE-2025-2776 - A pre-authenticated XXE within the /mdm/checkin endpoint\nCVE-2025-2777 - A pre-authenticated XXE within the /lshw endpoint\nwatchTowr Labs described the vulnerabilities as trivial to exploit by means of a specially crafted HTTP POST request to the endpoints in question.\nSuccessful exploitation of the flaws could enable an attacker to retrieve local files containing sensitive information, including SysAid's own \"InitAccount.cmd\" file, which contains information about the administrator account username and plaintext password created during installation.\nArmed with this information, the attacker could then gain full administrative access to SysAid as an administrator-privileged user.\nTo make matters worse, the XXE flaws could be chained with another operating system command injection vulnerability – discovered by a third-party – to achieve remote code execution. The command injection issue has been assigned the CVE identifier CVE-2025-2778.\nAll four vulnerabilities have been\nrectified\nby SysAid with the release of on-premise version 24.4.60 b16 in early March 2025. A proof-of-concept (PoC) exploit combining the four vulnerabilities has been\nmade available\n.\nWith security flaws in SysAid (CVE-2023-47246) previously\nexploited\nby ransomware actors like Cl0p in zero-day attacks, it's imperative that users update their instances to the latest version.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Reevaluating SSEs: A Technical Gap Analysis of Last-Mile Protection",
        "Link": "https://thehackernews.com/2025/05/reevaluating-sses-technical-gap.html",
        "Summary": "Security Service Edge (SSE) platforms have become the go-to architecture for securing hybrid work and SaaS access. They promise centralized enforcement, simplified connectivity, and consistent policy control across users and devices.\nBut there's a problem: they stop short of where the most sensitive user activity actually happens—the browser.\nThis isn’t a small omission. It’s a structural",
        "Date": "2025-05-07",
        "Content": "Security Service Edge (SSE) platforms have become the go-to architecture for securing hybrid work and SaaS access. They promise centralized enforcement, simplified connectivity, and consistent policy control across users and devices.\nBut there's a problem: they stop short of where the most sensitive user activity actually happens—the browser.\nThis isn't a small omission. It's a structural limitation. And it's leaving organizations exposed in the one place they can't afford to be: the last mile of user interaction.\nA new report\nReevaluating SSEs: A Technical Gap Analysis of Last-Mile Protection\nanalyzing gaps in SSE implementations reveals where current architectures fall short—and why many organizations are reevaluating how they protect user interactions inside the browser. The findings point to a fundamental visibility challenge at the point of user action.\nSSEs deliver value for what they're designed to do—enforce network-level policies and route traffic securely between endpoints and cloud services. But they were never built to observe or control what happens inside the browser tab, where the real risk resides today.\nAnd that's exactly where attackers, insiders, and data leaks thrive.\nArchitecturally Blind to User Behavior\nSSE solutions rely on upstream enforcement points—cloud-based proxies or Points of Presence (PoPs)—to inspect and route traffic. That works for coarse-grained access control and web filtering. But once a user is granted access to an application, SSEs lose visibility.\nThey can't see:\nWhich identity the user is signed in with (personal or corporate)\nWhat's being typed into a GenAI prompt\nWhether a file upload is a sensitive IP or a harmless PDF\nIf a browser extension is silently exfiltrating credentials\nWhether data is moving between two open tabs in the same session\nIn short: once the session is allowed, the enforcement ends.\nThat's a major gap in a world where work happens in SaaS tabs, GenAI tools, and unmanaged endpoints.\nUse Cases SSE Can't Handle Alone\nGenAI Data Leakage:\nSSEs can block domains like chat.openai.com, but most organizations don't want to block GenAI outright. Once a user gets access, SSE has no way of seeing whether they paste proprietary source code into ChatGPT—or even if they're logged in with a corporate vs. personal account. That's a recipe for undetected data leakage.\nShadow SaaS and Identity Misuse:\nUsers routinely log into SaaS tools like Notion, Slack, or Google Drive with personal identities—especially on BYOD or hybrid devices. SSEs can't differentiate based on identity, so personal logins using sensitive data go unmonitored and uncontrolled.\nBrowser Extension Risks:\nExtensions often request full-page access, clipboard control, or credential storage. SSEs are blind to all of it. If a malicious extension is active, it can bypass all upstream controls and silently capture sensitive data.\nFile Movement and Uploads\n: Whether it's dragging a file into Dropbox or downloading from a corporate app onto an unmanaged device, SSE solutions can't enforce controls once the content hits the browser. Browser tab context—who's logged in, what account is active, whether the device is managed—is outside their scope.\nFilling the Gap: Browser-Native Security\nTo secure the last mile, organizations are turning to browser-native security platforms—solutions that operate inside the browser itself, not around it.\nThis includes Enterprise Browsers and Enterprise Browser Extensions, which deliver:\nVisibility into copy/paste, uploads, downloads, and text inputs\nAccount-based policy enforcement (e.g., allow corporate Gmail, block personal)\nMonitoring and control of browser extensions\nReal-time risk scoring of user activity\nCritically, these controls can operate even when the device is unmanaged or the user is remote—making them ideal for hybrid, BYOD, and distributed environments.\nAugment, Don't Replace\nThis isn't a call to rip and replace SSE. SSE remains a critical part of the modern security stack. But it needs help—specifically at the user interaction layer.\nBrowser-native security doesn't compete with SSE; it complements it. Together, they provide full-spectrum visibility and control—from network-level policy to user-level enforcement.\nConclusion: Rethink the Edge Before It Breaks\nThe browser is now the real endpoint. It's where GenAI tools are used, where sensitive data is handled, and where tomorrow's threats will emerge.\nHere's why organizations need to rethink where their security stack begins—and ends.\nDownload the full report\nto explore the gaps in today's SSE architectures and how browser-native security can close them.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Play Ransomware Exploited Windows CVE-2025-29824 as Zero-Day to Breach U.S. Organization",
        "Link": "https://thehackernews.com/2025/05/play-ransomware-exploited-windows-cve.html",
        "Summary": "Threat actors with links to the Play ransomware family exploited a recently patched security flaw in Microsoft Windows as a zero-day as part of an attack targeting an unnamed organization in the United States.\nThe attack, per the Symantec Threat Hunter Team, part of Broadcom, leveraged CVE-2025-29824, a privilege escalation flaw in the Common Log File System (CLFS) driver. It was patched by",
        "Date": "2025-05-07",
        "Content": "Threat actors with links to the Play ransomware family exploited a recently patched security flaw in Microsoft Windows as a zero-day as part of an attack targeting an unnamed organization in the United States.\nThe attack, per the Symantec Threat Hunter Team, part of Broadcom,\nleveraged\nCVE-2025-29824\n, a privilege escalation flaw in the Common Log File System (CLFS) driver. It was patched by Microsoft last month.\nPlay\n, also called Balloonfly and PlayCrypt, is known for its double extortion tactics, wherein sensitive data is exfiltrated prior to encryption in exchange for a ransom. It's active since at least mid-2022.\nIn the activity observed by Symantec, the threat actors are said to have likely leveraged a public-facing Cisco Adaptive Security Appliance (ASA) as an entry point, taking advantage of an as-yet-undetermined method to move to another Windows machine on the target network.\nThe attack is notable for the use of\nGrixba\n, a bespoke information stealer previously attributed to Play and an exploit for CVE-2025-29824 that's dropped in the Music folder, giving it names that masquerade as Palo Alto Networks software (e.g., \"paloaltoconfig.exe\" and \"paloaltoconfig.dll\").\nThe threat actors have also been observed running commands to gather information about all the available machines in the victims' Active Directory and save the results to a CSV file.\n\"During the execution of the exploit, two files are created in the path C:\\ProgramData\\SkyPDF,\" Symantec explained. \"The first file, PDUDrv.blf, is a Common Log File System base log file and is an artifact created during exploitation.\"\n\"The second file, clssrv.inf, is a DLL that is injected into the winlogon.exe process. This DLL has the ability to drop two additional batch files.\"\nOne of the batch files, called \"servtask.bat,\" is used to escalate privileges, dump the SAM, SYSTEM, and SECURITY Registry hives, create a new user named \"LocalSvc,\" and it to the Administrator group. The other batch file, \"cmdpostfix.bat,\" is used to clean up traces of exploitation.\nSymantec said that no ransomware payload was deployed in the intrusion. The findings show that exploits for CVE-2025-29824 may have been available to multiple threat actors before it was fixed by Microsoft.\nIt's worth noting that the nature of exploitation detailed by the cybersecurity company does not overlap with another activity cluster dubbed\nStorm-2460\nthat Microsoft disclosed as having weaponized the flaw in a limited set of attacks to deliver a trojan dubbed PipeMagic.\nThe exploitation of CVE-2025-29824 also points to the trend of ransomware actors using zero-days to infiltrate targets. Last year, Symantec\ndivulged\nthat the Black Basta group may have taken advantage of CVE-2024-26169, a privilege escalation in the Windows Error Reporting Service, as a zero-day.\nNew \"Bring Your Own Installer\" EDR Bypass Used in Babuk Ransomware Attack\nThe disclosure comes as Aon's Stroz Friedberg Incident Response Services detailed a local bypass technique called Bring Your Own Installer that's being exploited by threat actors to disable endpoint security software and deploy the\nBabuk\nransomware.\nThe attack, per the company, targeted SentinelOne's Endpoint Detection and Response (EDR) system by exploiting a flaw within the upgrade/downgrade process of the SentinelOne agent after having gained local administrative access on a publicly-accessible server.\n\"Bring Your Own Installer is a technique which can be used by threat actors to bypass EDR protection on a host through timed termination of the agent update process when inadequately configured,\" Aon researchers John Ailes and Tim Mashni\nsaid\n.\nThe approach is noteworthy because it does not rely on vulnerable drivers or other tools to disarm security software. Rather it exploits a time window in the agent upgrade process to terminate running EDR agents, leaving devices unprotected.\nSpecifically, it abuses the fact that installing a different version of the software using an MSI file causes it to terminate already running Windows processes before the update is performed.\nThe Bring Your Own Installer attack essentially involves running a legitimate installer and forcefully terminating the install process by issuing a \"taskkill\" command after it shuts down the running services.\n\"Because the old version of SentinelOne processes were terminated during the upgrade, and the new processes were interrupted before spawning, the final result was a system without SentinelOne protection,\" Aon researchers said.\nSentinelOne, which said the technique could be applied against other endpoint protection products, has since\nrolled out updates\nto its\nLocal Upgrade Authorization\nfeature in order to mitigate such bypasses from happening again. This includes enabling it by default for all new customers.\nThe disclosure comes as Cisco\nrevealed\nthat a ransomware family known as Crytox has employed HRSword as part of their attack chain to turn off endpoint security protections.\nHRSword has been previously observed in attacks delivering\nBabyLockerKZ\nand\nPhobos\nransomware strains, as well as those\ndesigned\nto terminate AhnLab's security solutions in South Korea.\nNew Ransomware Trends\nRansomware attacks have also increasingly trained their sights on domain controllers to breach organizations, allowing threat actors to obtain access to privileged accounts and weaponize the centralized network access to encrypt hundreds or thousands of systems within minutes.\n\"More than 78% of human-operated cyberattacks, threat actors successfully breach a domain controller,\" Microsoft\nrevealed\nlast month.\n\"Additionally, in more than 35% of cases, the primary spreader device -- the system responsible for distributing ransomware at scale -- is a domain controller, highlighting its crucial role in enabling widespread encryption and operational disruption.\"\nOther ransomware attacks detected in recent months have leveraged a new Ransomware-as-a-Service (RaaS) known as PlayBoy Locker, which provides relatively unskilled cybercriminals with a comprehensive toolkit comprising ransomware payloads, management dashboards, and support services.\n\"The PlayBoy Locker RaaS platform offers affiliates numerous options for building ransomware binaries that target Windows, NAS, and ESXi systems, enabling tailored configurations to suit different operational requirements,\" Cybereason\nsaid\n. \"PlayBoy Locker RaaS operators advertise regular updates, anti-detection features, and even customer support for affiliates.\"\nThe developments have also coincided with the launch of a ransomware cartel by\nDragonForce\n, an e-crime group that has claimed control of RansomHub, a RaaS scheme that abruptly ceased operations at the end of March 2025.\nThe white-label branding service is designed to allow affiliates to disguise the DragonForce ransomware as a different strain for an additional fee. The threat actor claims to take a 20% share of successful ransomware payouts, allowing the affiliates to keep the remaining 80%.\nDragonForce\nemerged\nin August 2023, positioning itself as a pro-Palestine hacktivist operation before evolving into a full-fledged ransomware operation. In recent weeks, the RaaS syndicate has attracted attention for its targeting of U.K. retailers like Harrods, Marks and Spencer, and the Co-Op.\n\"This move, along with DragonForce's push to brand itself as a 'ransomware cartel,' illustrates the group's desire to raise its profile in the crimeware landscape by enabling an ecosystem,\" SentinelOne\nsaid\n. \"Under this model, DragonForce provides the infrastructure, malware, and ongoing support services while affiliates run campaigns under their own branding.\"\nAccording to a\nreport\nfrom BBC News, the attacks aimed at the U.K. retail sector are believed to have been orchestrated by a notorious threat group and a RansomHub affiliate known as\nScattered Spider\n(aka\nOcto Tempest\nor\nUNC3944\n).\n\"It is plausible that threat actors including UNC3944 view retail organizations as attractive targets, given that they typically possess large quantities of personally identifiable information (PII) and financial data,\" Google-owned Mandiant\nsaid\n.\n\"Further, these companies may be more likely to pay a ransom demand if a ransomware attack impacts their ability to process financial transactions.\"\nRansomware attacks have witnessed an increase of 25% in 2024, with the number of ransomware group leak sites rising by 53%. The fragmentation, per Bitsight, is the arrival of smaller, more agile gangs that are striking mid-sized organizations that may not always have the resources to tackle such threats.\n\"The proliferation of ransomware groups means that they are increasing faster than law enforcement can shut them down, and their focus on smaller organizations means that anyone may be a target,\" security researcher Dov Lerner\nsaid\n.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Researchers Uncover Malware in Fake Discord PyPI Package Downloaded 11,500+ Times",
        "Link": "https://thehackernews.com/2025/05/researchers-uncover-malware-in-fake.html",
        "Summary": "Cybersecurity researchers have discovered a malicious package on the Python Package Index (PyPI) repository that masquerades as a seemingly harmless Discord-related utility but incorporates a remote access trojan.\nThe package in question is discordpydebug, which was uploaded to PyPI on March 21, 2022. It has been downloaded 11,574 times and continues to be available on the open-source registry.",
        "Date": "2025-05-07",
        "Content": "Cybersecurity researchers have discovered a malicious package on the Python Package Index (PyPI) repository that masquerades as a seemingly harmless Discord-related utility but incorporates a remote access trojan.\nThe package in question is\ndiscordpydebug\n, which was uploaded to PyPI on March 21, 2022. It has been downloaded 11,574 times and continues to be\navailable\non the open-source registry. Interestingly, the package has not received any update since then.\n\"At first glance, it appeared to be a simple utility aimed at developers working on Discord bots using the Discord.py library,\" the Socket Research Team\nsaid\n. \"However, the package concealed a fully functional remote access trojan (RAT).\"\nThe package, once installed, contacts an external server (\"backstabprotection.jamesx123.repl[.]co\"), and includes features to read and write arbitrary files based on commands, readfile or writefile, received from the server. The RAT also supports the ability to run shell commands.\nIn a nutshell, discordpydebug could be used to read sensitive data, such as configuration files, tokens, and credentials, tamper with existing files, download additional payloads, and run commands to exfiltrate data.\n\"While the code does not include mechanisms for persistence or privilege escalation, its simplicity makes it particularly effective,\" Socket said. \"The use of outbound HTTP polling rather than inbound connections allows it to bypass most firewalls and security monitoring tools, especially in less tightly controlled development environments.\"\nThe development comes as the software supply chain security company also uncovered over 45 npm packages posing as legitimate libraries available on other ecosystems as a way to trick developers into installing them. Some of the notable ones are listed below -\nbeautifulsoup4 (a typosquat of the BeautifulSoup4 Python library)\napache-httpclient (a typosquat of the Apache HttpClient Java library)\nopentk (a typosquat of the OpenTK .NET library)\nseaborn (a typosquat of the Seaborn Python library)\nAll the identified packages have been found to share the same infrastructure, use similar obfuscated payloads, and point to the same IP address, despite listing different maintainers, indicating the work of a single threat actor.\n\"Packages identified as part of this campaign contain obfuscated code designed to bypass security measures, execute malicious scripts, exfiltrate sensitive data, and maintain persistence on affected systems,\" Socket\nsaid\n.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "NSO Group Fined $168M for Targeting 1,400 WhatsApp Users With Pegasus Spyware",
        "Link": "https://thehackernews.com/2025/05/nso-group-fined-168m-for-targeting-1400.html",
        "Summary": "A federal jury on Tuesday decided that NSO Group must pay Meta-owned WhatsApp WhatsApp approximately $168 million in monetary damages, more than four months after a federal judge ruled that the Israeli company violated U.S. laws by exploiting WhatsApp servers to deploy Pegasus spyware, targeting over 1,400 individuals globally.\nWhatsApp originally filed the lawsuit against NSO Group in 2019,",
        "Date": "2025-05-07",
        "Content": "A federal jury on Tuesday decided that NSO Group must pay Meta-owned WhatsApp WhatsApp\napproximately $168 million\nin monetary damages, more than four months after a federal judge ruled that the Israeli company violated U.S. laws by exploiting WhatsApp servers to deploy Pegasus spyware, targeting over 1,400 individuals globally.\nWhatsApp originally filed the\nlawsuit\nagainst NSO Group in 2019, accusing the latter of using Pegasus to target journalists, human rights activists, and political dissidents.\nCourt documents released as part of the trial have\nrevealed\nthat 456 Mexicans were targeted during the campaign, followed by 100 victims in India, 82 in Bahrain, 69 in Morocco, and 58 in Pakistan. In total, individuals across 51 different countries were targeted.\nThe attacks leveraged a then zero-day vulnerability in WhatsApp's voice calling feature (\nCVE-2019-3568\n, CVSS score: 9.8) to trigger the deployment of the spyware.\nIn a ruling issued in December 2024, United States District Judge Phyllis J. Hamilton\nnoted\nthat Pegasus was sent through WhatsApp's California-based servers 43 times during the relevant time period in May 2019.\n\"Our case against spyware developer NSO made history when the court found that they broke both federal and state laws in the United States in December,\" Will Cathcart, head of WhatsApp at Meta,\nsaid\nin a statement on X.\n\"And the jury's verdict today to punish NSO is a critical deterrent to the spyware industry against their illegal acts aimed at American companies and our users worldwide.\"\nCathcart added the company's next step is to secure a court order to prevent NSO from ever targeting WhatsApp again, adding it will be making a donation to digital rights organizations that are working to defend people against such attacks across the world.\nIn addition to the $167,254,000 in punitive damages, the jury determined that NSO Group must pay WhatsApp $444,719 in compensatory damages for the significant efforts WhatsApp engineers made to block the attack vectors.\nThe development is a major victory for privacy advocates and human rights organizations, who have repeatedly called out NSO Group for licensing its potent surveillance software to customers for keeping tabs on members of civil society.\nWhile NSO Group tried to evade liability by claiming that it does not have visibility into what its clients do with Pegasus, Judge Hamilton pointed out it cannot claim that \"its intent is to help its clients fight terrorism and child exploitation, and on the other hand say that it has nothing to do with what its client does with the technology, other than advice and support.\"\n\"NSO was forced to admit that it spends tens of millions of dollars annually to develop malware installation methods including through instant messaging, browsers, and operating systems and that its spyware is capable of compromising iOS or Android devices to this day,\" Meta\nsaid\n.\nIn a statement shared with\nCourthouse News\nand\nPOLITICO\n, NSO Group said its technology plays a crucial role in preventing serious crime and terrorism, and that it intends to pursue appropriate legal remedies. The company was\nsanctioned\nby the U.S. government in 2021 for engaging in \"malicious cyber activities.\"\nApple, which filed a similar lawsuit against NSO Group,\ndropped\nit in September 2024, saying that continuing it could reveal sensitive details of its security program.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "PowerSchool hacker now extorting individual school districts",
        "Link": "https://www.bleepingcomputer.com/news/security/powerschool-hacker-now-extorting-individual-school-districts/",
        "Summary": "PowerSchool is warning that the hacker behind its December cyberattack is now individually extorting schools, threatening to release the previously stolen student and teacher data if a ransom is not paid. [...]",
        "Date": "2025-05-07",
        "Content": "PowerSchool is warning that the hacker behind its December cyberattack is now individually extorting schools, threatening to release the previously stolen student and teacher data if a ransom is not paid.\n\"PowerSchool is aware that a threat actor has reached out to multiple school district customers in an attempt to extort them using data from the previously reported December 2024 incident,\" PowerSchool shared in a statement to BleepingComputer.\n\"We do not believe this is a new incident, as samples of data match the data previously stolen in December. We have reported this matter to law enforcement both in the United States and in Canada and are working closely with our customers to support them. We sincerely regret these developments – it pains us that our customers are being threatened and re-victimized by bad actors.\"\nPowerSchool apologized for the ongoing threats caused by the breach and says they will continue to work with customers and law enforcement to respond to the extortion attempts.\nThe company also recommends that students and faculty take advantage of the free two years of credit monitoring and identity protection to protect against fraud and identity theft. More details about this can be found in the company's\nsecurity incident FAQ\n.\nPowerSchool also reflected on their choice to pay the ransom demand, stating that it was a difficult decision but hoping it would protect its customers.\n\"Any organization facing a ransomware or data extortion attack has a very difficult and considered decision to make during a cyber incident of this nature. In the days following our discovery of the December 2024 incident, we made the decision to pay a ransom because we believed it to be in the best interest of our customers and the students and communities we serve,\" continued the PowerSchool statement.\n\"It was a difficult decision, and one which our leadership team did not make lightly. But we thought it was the best option for preventing the data from being made public, and we felt it was our duty to take that action. As is always the case with these situations, there was a risk that the bad actors would not delete the data they stole, despite assurances and evidence that were provided to us.\"\nOne of the school districts being individually extorted by the threat actor is the Toronto District School Board (TDSB), which is the largest school board in Canada.\n\"Earlier this week, TDSB was made aware that the data was not destroyed. TDSB, along with other North American school boards, received a communication from a threat actor demanding a ransom using data from the previously reported December 2024 incident,\" reads a\nletter to parents\n.\nThe PowerSchool data breach\nIn January,\nPowerSchool disclosed that it suffered a breach\nof its PowerSource customer support portal through compromised credentials. Using this access, the threat actors utilized a PowerSource remote maintenance tool to connect to and download the school district's PowerSchool databases.\nThese databases contained different information depending on the district, including students' and faculty's full names, physical addresses, phone numbers, passwords, parent information, contact details, Social Security numbers, medical data, and grades.\nThe breach was initially detected on December 28, 2024, but the company later\nrevealed that it was breached months earlier\n, in August and September 2024, using the same compromised credentials.\nAs\nfirst reported by BleepingComputer\n, the hacker claimed to have stolen the data of 62.4 million students and 9.5 million teachers for 6,505 school districts across the U.S., Canada, and other countries.\nIn response to the breach, PowerSchool paid a ransom to prevent the public release of the stolen data and received a video from the threat actor claiming the data had been deleted. However, it appears now that the threat actor did not keep their promise.\nSecurity experts and ransomware negotiators have long advised against companies\npaying a ransom to prevent the leaking of data\n, as threat actors are increasingly failing to keep their promise to delete stolen data.\nUnlike a decryption key, which companies can confirm works, there is no way to adequately verify that data is deleted as promised.\nThis was recently seen in\nUnitedHealth's Change Healthcare ransomware attack\n, in which they paid a ransom to the BlackCat ransomware gang to receive a decryptor and not leak data.\nHowever, after\nBlackCat pulled an exit scam\n, the affiliate behind the attack said they still had the data and\nextorted UnitedHealth once again\n.\nIt is believed that UnitedHealth paid a second ransom to once again prevent the leaking of the data.\nUpdate 5/7/25: Added TDSB as one of the districts individually extorted.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nBaltimore City Public Schools data breach affects over 31,000 people\nPowerSchool previously hacked in August, months before data breach\nAscension discloses new data breach after third-party hacking incident\nVeriSource now says February data breach impacts 4 million people\nMobile provider MTN says cyberattack compromised customer data"
    },
    {
        "Title": "CoGUI phishing platform sent 580 million emails to steal credentials",
        "Link": "https://www.bleepingcomputer.com/news/security/cogui-phishing-platform-sent-580-million-emails-to-steal-credentials/",
        "Summary": "A new phishing kit named 'CoGUI' sent over 580 million emails to targets between January and April 2025, aiming to steal account credentials and payment data. [...]",
        "Date": "2025-05-07",
        "Content": "A new phishing kit named 'CoGUI' sent over 580 million emails to targets between January and April 2025, aiming to steal account credentials and payment data.\nThe messages impersonate major brands like Amazon, Rakuten, PayPal, Apple, tax agencies, and banks.\nThe activity culminated in January 2025, where 170 campaigns sent 172,000,000 phishing messages to targets, but the following months maintained equally impressive volumes.\nProofpoint researchers who discovered the CoGUI campaigns noted that it's the highest volume phishing campaign they currently track. The attacks mainly target Japan, though smaller-scale campaigns were also directed at the United States, Canada, Australia, and New Zealand.\nCoGUI has been active since at least October 2024, but\nProofpoint started tracking\nit in December and onward.\nPhishing email volumes generated by CoGUI\nSource: Proofpoint\nThe analysts found several similarities to the Darcula phishing kit, which has been\nlinked to China-based operatives\n, and initially believed that the origin of the CoGUI attacks is the same.\nHowever, upon deeper examination, Proofpoint concluded that the two phishing kits are unrelated even though they are both utilized by Chinese threat actors.\nCoGUI attack chain\nThe attack starts with a phishing email impersonating a trusted brand, often having urgent subject lines requiring the recipient's action.\nThe messages include a URL that redirects to a phishing website hosted on the CoGUI phishing platform, but the link only resolves if the target meets specific criteria pre-defined by the attackers.\nThese criteria include their IP address (location), browser language, operating system, screen resolution, and device type (mobile or desktop).\nIf the criteria aren't met, victims are redirected to the brand's legitimate site that was impersonated to reduce suspicion.\nValid targets are redirected to a phishing page featuring a fake login form that mimics the design of the real brand, tricking victims into entering their sensitive information.\nFake Amazon login page\nSource: Proofpoint\nProofpoint has also found that CoGUI was behind smishing campaigns targeting the United States with\n'outstanding toll payment' lures\n. However, it noted that most of that activity has now migrated to Darcula.\nThe researchers believe CoGUI facilitates the operations of multiple threat actors, primarily from China, who predominantly target Japanese users.\nHowever, the kit could be adopted by other cybercriminals with a different targeting scope at any moment, resulting in massive attack waves hitting other countries.\nThe best way to mitigate phishing risks is never to act with haste when receiving emails requesting urgent action, and always log in to the claimed platform independently instead of following embedded links.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nDarcula PhaaS steals 884,000 credit cards via phishing texts\nFBI shares massive list of 42,000 LabHost phishing domains\nPhishing platform 'Lucid' behind wave of iOS, Android SMS attacks\nNew Darcula phishing service targets iPhone users via iMessage\nTycoon2FA phishing kit targets Microsoft 365 with new tricks"
    },
    {
        "Title": "Hackers exploit OttoKit WordPress plugin flaw to add admin accounts",
        "Link": "https://www.bleepingcomputer.com/news/security/hackers-exploit-ottokit-wordpress-plugin-flaw-to-add-admin-accounts/",
        "Summary": "Hackers are exploiting a critical unauthenticated privilege escalation vulnerability in the OttoKit WordPress plugin to create rogue admin accounts on targeted sites. [...]",
        "Date": "2025-05-07",
        "Content": "Hackers are exploiting a critical unauthenticated privilege escalation vulnerability in the OttoKit WordPress plugin to create rogue admin accounts on targeted sites.\nOttoKit (formerly SureTriggers) is a WordPress automation and integration plugin used in over 100,000 sites, allowing users to connect their websites to third-party services and automate workflows.\nPatchstack received a report about a critical vulnerability in OttoKit on April 11, 2025, from researcher Denver Jackson.\nThe flaw, tracked under the identifier CVE-2025-27007, allows attackers to gain administrator access via the plugin's API by exploiting a logic error in the 'create_wp_connection' function, bypassing authentication checks when application passwords aren't set.\nThe vendor was informed the next day, and a patch was released on April 21, 2025, with OttiKit version 1.0.83, adding a validation check for the access key used in the request.\nBy April 24, 2025, most plugin users had been force-updated to the patched version.\nNow exploited in attacks\nPatchstack published\nits report\non May 5, 2025, but a new update warns that exploitation activity started roughly 90 minutes after public disclosure.\nAttackers attempted exploitation by targeting REST API endpoints, sending requests mimicking legitimate integration attempts, using 'create_wp_connection' with guessed or brute-forced administrator usernames, random passwords, and fake access keys and email addresses.\nOnce the initial exploit was successful, attackers issued follow-up API calls to '/wp-json/sure-triggers/v1/automation/action' and '?rest_route=/wp-json/sure-triggers/v1/automation/action,' including the payload value: \"type_event\": \"create_user_if_not_exists.\"\nOn vulnerable installations, this silently creates new administrator accounts.\n\"It is strongly recommended to update your site as soon as possible if you are using the OttoKit plugin, and to review your logs and site settings for these indicators of attack and compromise,\" suggests Patchstack.\nThis is the second critical severity flaw in OttoKit that hackers have exploited since April 2025, with the previous being another authentication bypass bug tracked as\nCVE-2025-3102\n.\nExploitation of that flaw started on the same day of disclosure, with threat actors attempting to create rogue administrator accounts with randomized usernames, passwords, and email addresses, indicating automated attempts.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nHackers exploit WordPress plugin auth bypass hours after disclosure\nSAP fixes suspected NetWeaver zero-day exploited in attacks\nWooCommerce admins targeted by fake security patches that hijack sites\nNew Mirai botnet behind surge in TVT DVR exploitation\nNewest Ivanti SSRF zero-day now under mass exploitation"
    },
    {
        "Title": "Play ransomware exploited Windows logging flaw in zero-day attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/play-ransomware-exploited-windows-logging-flaw-in-zero-day-attacks/",
        "Summary": "The Play ransomware gang has exploited a high-severity Windows Common Log File System flaw in zero-day attacks to gain SYSTEM privileges and deploy malware on compromised systems. [...]",
        "Date": "2025-05-07",
        "Content": "The Play ransomware gang has exploited a high-severity Windows Common Log File System flaw in zero-day attacks to gain SYSTEM privileges and deploy malware on compromised systems.\nThe vulnerability, tracked as\nCVE-2025-29824\n, was tagged by Microsoft as exploited in a limited number of attacks and patched during\nlast month's Patch Tuesday\n.\n\"The targets include organizations in the information technology (IT) and real estate sectors of the United States, the financial sector in Venezuela, a Spanish software company, and the retail sector in Saudi Arabia,\"\nMicrosoft said in April\n.\nMicrosoft linked these attacks to the RansomEXX ransomware gang, saying the attackers installed the PipeMagic backdoor malware, which was used to drop the CVE-2025-29824 exploit, deploy ransomware payloads, and ransom notes after encrypting files.\nSince then, Symantec's Threat Hunter Team has also found evidence linking them to the Play ransomware-as-a-service operation, saying the attackers deployed a CVE-2025-29824 zero-day privilege escalation exploit after breaching a U.S. organization's network.\n\"Although no ransomware payload was deployed in the intrusion, the attackers deployed the Grixba infostealer, which is a custom tool associated with Balloonfly, the attackers behind the Play ransomware operation,\"\nSymantec said\n.\n\"Balloonfly is a cybercrime group that has been active since at least June 2022 and uses the Play ransomware (also known as PlayCrypt) in attacks.\"\nThe Grixba custom network-scanning and information-stealing tool\nwas first spotted two years ago\n, and Play ransomware operators typically use it to enumerate users and computers in compromised networks.\nThe Play cybercrime gang surfaced in June 2022 and is also known for double-extortion attacks, in which its affiliates pressure victims into paying ransoms to avoid having their stolen data leaked online.\nIn December 2023, the FBI\nissued a joint advisory\nwith CISA and the Australian Cyber Security Centre (ACSC), warning that the Play ransomware gang had breached the networks of around 300 organizations worldwide as of October 2023.\nPrevious notable Play ransomware victims include cloud computing company\nRackspace\n, car retailer giant\nArnold Clark\n, the\nCity of Oakland\nin California,\nDallas County\n, the\nBelgian city of Antwerp\n, and, more recently, American semiconductor supplier\nMicrochip Technology\nand\ndoughnut chain Krispy Kreme\n.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft: Windows CLFS zero-day exploited by ransomware gang\nMicrosoft: Windows 'inetpub' folder created by security fix, don’t delete\nNew Windows zero-day exploited by 11 state hacking groups since 2017\nMicrosoft March 2025 Patch Tuesday fixes 7 zero-days, 57 flaws\nCommvault says recent breach didn't impact customer backup data"
    },
    {
        "Title": "NSO Group fined $167M for spyware attacks on 1,400 WhatsApp users",
        "Link": "https://www.bleepingcomputer.com/news/legal/nso-group-fined-167m-for-spyware-attacks-on-1-400-whatsapp-users/",
        "Summary": "A U.S. federal jury has ordered Israeli spyware vendor NSO Group to pay WhatsApp $167,254,000 in punitive damages and $444,719 in compensatory damages for a 2019 campaign that targeted 1,400 users of the communication app. [...]",
        "Date": "2025-05-07",
        "Content": "A U.S. federal jury has ordered Israeli spyware vendor NSO Group to pay WhatsApp $167,254,000 in punitive damages and $444,719 in compensatory damages for a 2019 campaign that targeted 1,400 users of the communication app.\nThe verdict is considered a landmark case for being the first time a spyware vendor is held accountable in court, and could send ripples across the commercial spyware industry.\n\"Today's verdict in WhatsApp's case is an important step forward for privacy and security as the first victory against the development and use of illegal spyware that threatens the safety and privacy of everyone,\" commented Meta, WhatsApp's owner, in\nan announcement\n.\n\"Today, the jury's decision to force NSO, a notorious foreign spyware merchant, to pay damages is a critical deterrent to this malicious industry against their illegal acts aimed at American companies and the privacy and security of the people we serve.\"\nThe fines stem from a May 2019 campaign when NSO attempted to infect 1,400 WhatsApp users with its Pegasus spyware using a WhatsApp zero-day vulnerability.\nIt was later revealed that the vulnerability NSO leveraged during this operation was\nCVE-2019-3568\n, a buffer overflow in the WhatsApp VOIP stack, allowing attackers to send specially crafted RTCP packets to a target phone number to achieve\nremote code execution\n.\nWhen recipients received these calls, even if they did not answer, the vulnerability was automatically exploited, allowing Pegasus to be installed on devices.\nMeta filed the lawsuit against NSO Group on October 29, 2019, in the U.S. District Court for the Northern District of California, alleging that NSO had exploited a vulnerability in WhatsApp's calling feature to deliver its Pegasus spyware to approximately 1,400 users.\nAlthough NSO Group claims that its products are used by law enforcement tackling serious crime, Meta confirmed that the targets included human rights activists, journalists, and diplomats.\nThe trial that included NSO executives' testimonies revealed that the spyware vendor is directly involved in infection operations, so they have direct liability. Also, they were forced to admit they spent tens of millions in USD to develop multiple infection channels besides WhatsApp.\nCourt documents\nalso revealed\nthat the NSO Group used at least one more zero-day vulnerability in WhatsApp software to target users with spyware even after Meta's lawsuit had been submitted.\nOn December 23, 2024, Judge Phyllis J. Hamilton\nruled\nthat NSO Group is liable for violating U.S. hacking laws and WhatsApp's Terms of Service, granting partial summary judgment in WhatsApp's favor and moving the case to a jury trial to determine damages.\nFinally, WhatsApp was awarded punitive damage compensation of $167,254,000, plus an extra $444,719 compensation for the incident investigation, vulnerability patching, and user notification.\nCitizenLab researcher John Scott-Railton welcomed the court's decision and\nwarned spyware firms\nthey could be next.\nFor those interested in diving deeper into the details, Meta has published transcribed NSO Group depositions (\n1\n,\n2\n,\n3\n,\n4\n).\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nWhatsApp patched zero-click flaw exploited in Paragon spyware attacks\nWhatsApp unveils 'Private Processing' for cloud-based AI features\nWhatsApp's new Advanced Chat Privacy protects sensitive messages\nWhatsApp flaw can let attackers run malicious code on Windows PCs\nWhatsApp's Meta AI is now rolling out in Europe, and it can't be turned off"
    },
    {
        "Title": "Doubling down: How Universal 2nd Factor (U2F) boosts online security",
        "Link": "https://www.bleepingcomputer.com/news/security/doubling-down-how-universal-2nd-factor-u2f-boosts-online-security/",
        "Summary": "Passwords alone aren't cutting it—31% of breaches involve stolen credentials. Learn from Specops Software about how Universal 2nd Factor (U2F) and strong password policies can work together to keep your organization secure. [...]",
        "Date": "2025-05-07",
        "Content": "Passwords have long been the bedrock of online security, but the vulnerabilities are obvious, ranging from human error to phishing attacks. Universal 2nd Factor (U2F) could significantly enhance online authentication, complementing tried-and-trusted methods to bolster user safety.\nIt’s increasingly clear that passwords alone simply aren’t enough. If a password is stolen or otherwise breached, the consequences can be serious.\nAccording to the Verizon 2024 Data Breach Investigations Report (DBIR)\n, stolen credentials appeared in almost a third (31%) of breaches over the past decade.\nEven if your password is strong, it doesn’t mean you’re safe. While poor choices like ‘password’ or ‘123456’ featured among the\ntop five stolen passwords identified in the Specops Breached Password Report 2025\n, we also found that almost a quarter of the stolen passwords analysed (230 million) had actually met standard complexity requirements.\nThere’s also the common error of reusing passwords across multiple accounts. Indeed, a survey from LastPass\nfound that 59% of respondents used passwords across multiple accounts\n, even though the vast majority (91%) understood the risks involved. Beyond that, even the best passwords can be vulnerable to phishing attacks and malware, from\nRedline to Vidar to Raccoon Stealer\n.\nU2F advantages\nSo how can U2F help? As the name suggests, the concept relies on two factors to bolster security – typically a password and a physical device, similar to a key fob.\nThe user plugs in their credentials as usual. However, to gain access they must then pass through a second security step,\ntypically through a U2F device\nwhich has been registered online to create a new ‘key pair’.\nThe device is inserted into a USB port and the system then cryptographically ‘challenges’ its key, ensuring they correspond before granting access.  The concept is backed by some of the biggest names in global tech: it’s overseen by the FIDO Alliance,\nan open industry association\nwhose members include Google, Microsoft, Amazon, and many other industry giants.\nU2F offers clear security advantages to users – and more.\nLet’s look at a few of the benefits:\nStronger security:\nMost importantly, the use of a hardware token and cryptography provides a robust secondary form of authentication. It makes it far more difficult for an attacker to gain unauthorized access.\nUser convenience:\nThe approach is highly user-friendly, particularly when compared to other potential secondary factors, such as SMS-based codes. It’s easy to use once you have it all set up: you simply insert your device into the USB drive.\nWide availability:\nBecause U2F is a universal authentication method, it’s found across a range of systems. It’s already built into popular browsers like Firefox and Chrome.\nSecure your Active Directory passwords with Specops Password Policy\nVerizon’s Data Breach Investigation Report found stolen credentials are involved in 44.7% of breaches.\nEffortlessly secure Active Directory with compliant password policies, blocking 4+ billion compromised passwords, boosting security, and slashing support hassles!\nTry it for free\nOvercoming the obstacles\nAs with any emerging technology, U2F presents challenges. While it is indeed relatively inexpensive, it’s not completely free, unlike many apps that can be used in authentication. Still, it isn’t overly costly to buy the keys, with a range of options available from providers like\nYubico\n. More importantly, the small investment could well pay dividends, particularly when contrasted with the financial risks of losing access to your online accounts.\nIt's also a new technology, so may require a degree of user education before it’s used effectively (to register and operate the device, for instance). However, the process is relatively simple, while organizations could implement training programmes to educate their employees.\nPerhaps most seriously, there are always risks when you rely on a physical item like a hardware token. Quite simply, you could lose the key: it might fall off your key chain, for instance, or become lost if it’s still left in your USB drive and you misplace your laptop or other device. But the same could be said for any number of items we use in our daily lives, from car keys to credit cards.\nThe enduring value of passwords\nOf course, even if you do lose the key, that doesn’t mean someone can use it to gain access to your accounts. The data inside the keys can’t be accessed by criminals. What’s more, they’d lack access to your first line of defence: your username and password.\nBecause despite the (welcome) evolution of online security, these traditional defenses aren’t going anywhere. Passwords provide significant enduring benefits. They’re simple to use, flexible, and even with the dangers of breaches and hacks, they’re still effective: a password is right or wrong.\nFor as long as people use passwords, companies will need to protect their active directories, ensuring they are clear of compromised or weak passwords. With\nSpecops Password Policy\n, users are prevented from creating weak passwords, while the technology also scans your Active Directory for breached or compromised instances, currently blocking a growing database of over 4 billion unique breached passwords.\nIt’s clear that two-factor and\nmulti-factor authentication (MFA)\nwill be central to complementing password security in the coming years, with the long-term impact of technologies like U2F enhancing online safety well into the future.\nBut that security is built on two stages. It will always be vital to ensure your passwords are up to scratch – no matter how other technology evolves. Interested in shoring up your organization’s password security?\nSpeak to an expert today\n.\nSponsored and written by\nSpecops Software\n."
    },
    {
        "Title": "Medical device maker Masimo warns of cyberattack, manufacturing delays",
        "Link": "https://www.bleepingcomputer.com/news/security/medical-device-maker-masimo-warns-of-cyberattack-manufacturing-delays/",
        "Summary": "Medical device company Masimo Corporation warns that a cyberattack is impacting production operations and causing delays in fulfilling customers' orders. [...]",
        "Date": "2025-05-07",
        "Content": "Medical device company Masimo Corporation warns that a cyberattack is impacting production operations and causing delays in fulfilling customers' orders.\nMasimo Corporation is a California-based medical technology and consumer electronics maker. It's best known for its noninvasive patient monitoring products like pulse oximeters, brain function monitors, hemodynamic monitoring systems, capnography and gas monitoring solutions, and remote patient monitoring platforms.\nThe company has a reported annual revenue of $2.1 billion (2024) and approximately 3,600 employees worldwide, while it is publicly traded on the NASDAQ (MASI).\nThe firm disclosed the attack in a Form 8-K filing submitted to the U.S. Securities and Exchange Commission (SEC) last night, stating the incident occurred on April 27, 2025.\nWhile the company did not share details about the type of attack, they stated that the threat actors breached their on-premise network, causing the company to isolate impacted systems.\nThe disclosed cybersecurity incident has significantly impacted the company's manufacturing and business operations.\n\"As a result of the incident, certain of the Company's manufacturing facilities have been operating at less than normal levels, and the Company's ability to process, fulfill, and ship customer orders timely has been temporarily impacted,\"\nreads the 8-K filing\n.\n\"The Company has been working diligently to bring the affected portions of its network back online, restore normal business operations and mitigate the impact of the incident.\"\nThe firm believes that the network breach was isolated to on-premise systems, not affecting its cloud-based infrastructure.\nMasimo clarified that the investigation into the exact nature, scope, and actual impact of the incident is still underway, so it's unclear if it has affected customer data and whether it will have any impact on the company's financial figures for the running quarter.\nMasimo says they are working with external cybersecurity experts and have notified law enforcement.\nAt the time of writing, no ransomware groups have assumed responsibility for the attack at Masimo.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nUK Legal Aid Agency investigates cybersecurity incident\nUK NCSC: Cyberattacks impacting UK retailers are a wake-up call\nHarrods the next UK retailer targeted in a cyberattack\nAscension discloses new data breach after third-party hacking incident\nUK retailer Co-op shuts down some IT systems after hack attempt"
    },
    {
        "Title": "CISA warns of hackers targeting critical oil infrastructure",
        "Link": "https://www.bleepingcomputer.com/news/security/cisa-warns-of-hackers-targeting-critical-oil-infrastructure/",
        "Summary": "CISA warned critical infrastructure organizations of \"unsophisticated\" threat actors actively targeting the U.S. oil and natural gas sectors. [...]",
        "Date": "2025-05-07",
        "Content": "CISA warned critical infrastructure organizations of \"unsophisticated\" threat actors actively targeting the U.S. oil and natural gas sectors.\nWhile these attacks use very basic tactics to compromise their targets' industrial control systems (ICS) and operational technology (OT) equipment, CISA also cautioned that they could still lead to significant impact, including physical damage and disruptions.\n\"CISA is increasingly aware of unsophisticated cyber actor(s) targeting ICS/SCADA systems within U.S. critical Infrastructure sectors (Oil and Natural Gas), specifically in Energy and Transportation Systems,\" the cybersecurity agency\nnoted\n.\n\"Although these activities often include basic and elementary intrusion techniques, the presence of poor cyber hygiene and exposed assets can escalate these threats, leading to significant consequences such as defacement, configuration changes, operational disruptions and, in severe cases, physical damage.\"\nIn a\njoint advisory\nissued with the FBI, the Environmental Protection Agency (EPA), and the Department of Energy (DOE), CISA also shared detailed guidance to help network defenders reduce the risk of potential breaches.\nThe agency advised security teams to ensure that their organizations' attack surface is as small as possible by removing public-facing OT devices from the internet, because threat actors can easily find and compromise them because they lack modern authorization and authentication methods that could protect against hacking attempts.\nCISA also recommended changing default passwords to unique and strong ones and securing remote access to OT assets by using a virtual private network (VPN) featuring phishing-resistant multifactor authentication (MFA).\nThe joint advisory also advises segmenting IT and OT networks using demilitarized zones to separate local area networks from untrusted networks, and practicing reverting to manual controls to quickly restore operations in the event of an incident.\n\"Business continuity and disaster recovery plans, fail-safe mechanisms, islanding capabilities, software backups, and standby systems should all be routinely tested to ensure safe manual operations in the event of an incident,\" the agencies said.\n\"The authoring organizations recommend that critical infrastructure organizations regularly communicate with their third-party managed service providers, system integrators, and system manufacturers who may be able to provide system-specific configuration guidance as they work to secure their OT.\"\nThis advisory comes after CISA and the EPA\nwarned water facilities\nto secure their Internet-exposed Human Machine Interfaces (HMIs) from cyberattacks in December.\nThree months earlier, the U.S. cybersecurity agency\nalso said\nthreat actors were trying to breach critical infrastructure networks (including water and wastewater systems) by targeting Internet-exposed industrial devices using default credentials and \"unsophisticated\" methods like brute force attacks.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nCISA emergency directive: Mitigate Ivanti zero-days immediately\nCISA: Medusa ransomware hit over 300 critical infrastructure orgs\nCritical Langflow RCE flaw exploited to hack AI app servers\nUnofficial Signal app used by Trump officials investigates hack\nCISA tags Broadcom Fabric OS, CommVault flaws as exploited in attacks"
    },
    {
        "Title": "Police takes down six DDoS-for-hire services, arrests admins",
        "Link": "https://www.bleepingcomputer.com/news/security/police-takes-down-six-ddos-for-hire-services-arrests-admins/",
        "Summary": "​Polish authorities have detained four suspects linked to six DDoS-for-hire platforms, believed to have facilitated thousands of attacks targeting schools, government services, businesses, and gaming platforms worldwide since 2022. [...]",
        "Date": "2025-05-07",
        "Content": "​Polish authorities have detained four suspects linked to six DDoS-for-hire platforms, believed to have facilitated thousands of attacks targeting schools, government services, businesses, and gaming platforms worldwide since 2022.\nSuch platforms are often marketed as legitimate testing tools on the dark web and hacking forums, but are mainly used to disrupt online services, servers, and websites by flooding them with traffic in distributed denial-of-service (DDoS) attacks and causing outages for real users.\nThe six DDoS services, named Cfxapi, Cfxsecurity, neostress, jetstress, quickdown, and zapcut, have been taken down in a coordinated law enforcement action involving authorities from Germany, the Netherlands, Poland, and the United States.\n\"In the latest blow to the criminal market for distributed denial of service (DDoS)-for-hire services, Polish authorities have arrested four individuals who allegedly ran a network of platforms used to launch thousands of cyberattacks worldwide,\" Europol\nsaid\non Wednesday.\n\"The suspects are believed to be behind six separate stresser/booter services that enabled paying customers to flood websites and servers with malicious traffic — knocking them offline for as little as EUR 10.\"\nAs Europol explained, these DDoS-for-hire services (also known as stressers or booters) provided customers easy-to-use interfaces that required no technical skills besides paying for a subscription or a one-time fee, entering the target's IP address, and choosing the type and duration of the DDOS attack.\nQuickdown user interface (BleepinComputer)\n​Data seized by the Netherlands police from these booter websites was shared with international partners and led to the arrest of four administrators associated with the DDoS platforms in Poland.\nThe United States\nseized nine domains\nas part of this coordinated crackdown on DDoS services, while German law enforcement assisted the investigation by identifying a suspect and sharing intelligence on others involved.\nDutch investigators have also created their own fake booter sites to warn those seeking DDoS-for-hire services that what they're doing is illegal and highlight that such activities are monitored and may lead to prosecution.\nThese takedowns and arrests are part of an ongoing and long-running joint operation known as\nOperation PowerOFF\nthat started in December 2018 with the seizure of\n15 websites linked to DDoS-as-a-service platforms\n.\nPreviously, this operation led to the seizure of the\nDstat.cc DDoS review platform\n, the takedown of the\nDigitalStress\nDDoS-for-hire service in the UK, and the arrest of two\nbooter service operators\nin Poland.\nOther joint actions include\nseizing 13 domains\nand another\n48 domains\nhosting booter platforms in two separate enforcement waves.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nDDoS site Dstat.cc seized and two suspects arrested in Germany\nPro-Russia hacktivists bombard Dutch public orgs with DDoS attacks\nCloudflare mitigates record number of DDoS attacks in 2025\nX hit by 'massive cyberattack' amid Dark Storm's DDoS claims\nPolice detains Smokeloader malware customers, seizes servers"
    },
    {
        "Title": "Microsoft: April updates cause Windows Server auth issues",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-april-updates-cause-windows-server-auth-issues/",
        "Summary": "Microsoft says the April 2025 security updates are causing authentication issues on some Windows Server 2025 domain controllers. [...]",
        "Date": "2025-05-07",
        "Content": "Microsoft says the April 2025 security updates are causing authentication issues on some Windows Server 2025 domain controllers.\nThe list of impacted platforms includes Windows Server 2016, Windows Server 2019, Windows Server 2022, and the latest version, Windows Server 2025.\nHowever, as the company further explained, home users are unlikely to be affected by this known issue since domain controllers are typically used for business and enterprise authentication.\n\"After installing the April Windows monthly security update released April 8, 2025 (KB5055523) or later, Active Directory Domain Controllers (DC) might experience issues when processing Kerberos logons or delegations using certificate-based credentials that rely on key trust via the Active Directory msds-KeyCredentialLink field,\" Microsoft said in a Windows release health update.\n\"This can result in authentication issues in Windows Hello for Business (WHfB) Key Trust environments or environments that have deployed Device Public Key Authentication (also known as Machine PKINIT).\"\nThese problems could also impact software relying on these two features for authentication, including but not limited to third-party single sign-on (SSO) solutions, identity management systems, and smart card authentication products.\nAffected auth protocols include Kerberos Public Key Cryptography for Initial Authentication (Kerberos PKINIT) and Certificate-based Service-for-User Delegation (S4U) via Kerberos Resource-Based Constrained Delegation (RBKCD or A2DF Delegation) or Kerberos Constrained Delegation (KCD or A2D2 Delegation).\nAuth issues linked to CVE-2025-26647 security patches\nAccording to Microsoft, these issues are\nlinked to security measures\ndesigned to mitigate a high-severity vulnerability tracked as\nCVE-2025-26647\nthat can let authenticated attackers escalate privileges remotely by exploiting an improper input validation weakness in Windows Kerberos, which\nsuperseded NTLM\nas the new default auth protocol for domain-connected devices on all Windows versions released since Windows 2000.\n\"An attacker who successfully exploited this vulnerability could be assigned much greater rights by the Key Distribution Center to the certificate than intended,\" Redmond explains.\n\"An authenticated attacker could exploit this vulnerability by obtaining a certificate containing the target Subject Key Identifier (SKI) value from a Certificate Authority (CA). The attacker could then use this certificate to get a Ticket Granting Ticket (TGT) for the target user from the Key Distribution Center (KDC).\"\nAs a workaround, affected customers are advised to switch the AllowNtAuthPolicyBypass registry value in HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\Kdc from \"2\" to \"1\" as detailed in\nthis support document\n.\nLast month, Microsoft\nmitigated another known issue\ncausing authentication problems on Windows 11 and Windows Server 2025 devices using the Kerberos PKINIT security protocol when Credential Guard is enabled.\nRedmond also released emergency out-of-band (OOB) updates in November 2022 to\nfix a bug causing Kerberos sign-in failures\nand other auth problems on domain controllers.\nOne year earlier, it\naddressed authentication failures\nrelated to Kerberos delegation scenarios on Windows Server and\nsimilar Kerberos auth problems\nimpacting domain-connected devices running Windows 2000 and later.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft fixes auth issues on Windows Server, Windows 11 24H2\nMicrosoft: Windows Server 2025 restarts break connectivity on some DCs\nMicrosoft: Windows Server hotpatching to require subscription\nMicrosoft: April 2025 updates break Windows Hello on some PCs\nMicrosoft fixes Windows Server 2025 blue screen, install issues"
    },
    {
        "Title": "TikTok Fined €530 Million Over Chinese Access to EU Data",
        "Link": "https://www.darkreading.com/cybersecurity-operations/tiktok-fined-530-million-eu-data-servers-china",
        "Summary": "European regulators sent an unmistakable message about messing around with GDPR-protected data. How can organizations avoid similar compliance hassles?",
        "Date": "2025-05-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/tiktok-fined-530-million-eu-data-servers-china"
    },
    {
        "Title": "Meta Wins Lawsuit Against Spyware Vendor NSO Group",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/meta-wins-lawsuit-spyware-vendor-nso",
        "Summary": "The spyware company must pay the tech giant $168 million in punitive and compensatory damages after a 2019 attack targeting 1,400 devices.",
        "Date": "2025-05-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/meta-wins-lawsuit-spyware-vendor-nso"
    },
    {
        "Title": "Play Ransomware Group Used Windows Zero-Day",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/play-ransomware-group-windows-zero-day",
        "Summary": "Previously, Microsoft reported that Storm-2460 had also used the privilege escalation bug to deploy ransomware on organizations in several countries.",
        "Date": "2025-05-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/play-ransomware-group-windows-zero-day"
    },
    {
        "Title": "'Bring Your Own Installer' Attack Targets SentinelOne EDR",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/bring-your-own-installer-attack-sentinelone-edr",
        "Summary": "Researchers from Aon's Stroz Friedberg incident response firm discovered a new attack type, known as &quot;Bring Your Own Installer,&quot; targeting misconfigured SentinelOne EDR installs.",
        "Date": "2025-05-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/bring-your-own-installer-attack-sentinelone-edr"
    },
    {
        "Title": "Infrastructure as Code: An IaC Guide to Cloud Security",
        "Link": "https://www.darkreading.com/cloud-security/infrastructure-code-iac-guide-cloud-security",
        "Summary": "IaC is powerful. It brings speed, scale, and structure to cloud infrastructure. But none of that matters if your security can't keep up.",
        "Date": "2025-05-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cloud-security/infrastructure-code-iac-guide-cloud-security"
    },
    {
        "Title": "Pakistani Firm Shipped Fentanyl Analogs, Scams to US",
        "Link": "https://krebsonsecurity.com/2025/05/pakistani-firm-shipped-fentanyl-analogs-scams-to-us/",
        "Summary": "A Texas firm recently charged with conspiring to distribute synthetic opioids in the United States is at the center of a vast network of companies in the U.S. and Pakistan whose employees are accused of using online ads to scam westerners seeking help with trademarks, book writing, mobile app development and logo designs, a new investigation reveals.",
        "Date": "2025-05-07",
        "Content": "A Texas firm recently charged with conspiring to distribute synthetic opioids in the United States is at the center of a vast network of companies in the U.S. and Pakistan whose employees are accused of using online ads to scam westerners seeking help with trademarks, book writing, mobile app development and logo designs, a new investigation reveals.\nIn an indictment (PDF) unsealed last month, the U.S. Department of Justice said Dallas-based eWorldTrade “operated an online business-to-business marketplace that facilitated the distribution of synthetic opioids such as isotonitazene and carfentanyl, both significantly more potent than fentanyl.”\nLaunched in 2017, eWorldTrade[.]com now features a seizure notice from the DOJ. eWorldTrade operated as a wholesale seller of consumer goods, including clothes, machinery, chemicals, automobiles and appliances. The DOJ’s indictment includes no additional details about eWorldTrade’s business, origins or other activity, and at first glance the website might appear to be a legitimate e-commerce platform that also just happened to sell some restricted chemicals\nA screenshot of the eWorldTrade homepage on March 25, 2025. Image: archive.org.\nHowever, an investigation into the company’s founders reveals they are connected to a sprawling network of websites that have a history of extortionate scams involving trademark registration, book publishing, exam preparation, and the design of logos, mobile applications and websites.\nRecords from the U.S. Patent and Trademark Office (USPTO) show the eWorldTrade mark is owned by an Azneem Bilwani in Karachi (this name also is in the registration records for the now-seized eWorldTrade domain). Mr. Bilwani is perhaps better known as the director of the Pakistan-based IT provider Abtach Ltd., which has been singled out by the USPTO and Google for operating trademark registration scams (the main offices for eWorldtrade and Abtach share the same address in Pakistan).\nIn November 2021, the USPTO accused Abtach of perpetrating “an egregious scheme to deceive and defraud applicants for federal trademark registrations by improperly altering official USPTO correspondence, overcharging application filing fees, misappropriating the USPTO’s trademarks, and impersonating the USPTO.”\nAbtach offered trademark registration at suspiciously low prices compared to legitimate costs of over USD $1,500, and claimed they could register a trademark in 24 hours. Abtach reportedly rebranded to Intersys Limited after the USPTO banned Abtach from filing any more trademark applications.\nIn a note published to its LinkedIn profile, Intersys Ltd. asserted last year that certain scam firms in Karachi were impersonating the company.\nMany of Abtach’s employees are former associates of a similar company in Pakistan called Axact that was targeted by Pakistani authorities in a 2015 fraud investigation. Axact came under law enforcement scrutiny after The New York Times ran a front-page story about the company’s most lucrative scam business: Hundreds of sites peddling fake college degrees and diplomas.\nPeople who purchased fake certifications were subsequently blackmailed by Axact employees posing as government officials, who would demand additional payments under threats of prosecution or imprisonment for having bought fraudulent “unauthorized” academic degrees. This practice created a continuous cycle of extortion, internally referred to as “upselling.” \n“Axact took money from at least 215,000 people in 197 countries — one-third of them from the United States,” The Times reported. “Sales agents wielded threats and false promises and impersonated government officials, earning the company at least $89 million in its final year of operation.”\nDozens of top Axact employees were arrested, jailed, held for months, tried and sentenced to seven years for various fraud violations. But a 2019 research brief on Axact’s diploma mills found none of those convicted had started their prison sentence, and that several had fled Pakistan and never returned.\n“In October 2016, a Pakistan district judge acquitted 24 Axact officials at trial due to ‘not enough evidence’ and then later admitted he had accepted a bribe (of $35,209) from Axact,” reads a history (PDF) published by the American Association of Collegiate Registrars and Admissions Officers.\nIn 2021, Pakistan’s Federal Investigation Agency (FIA) charged Bilwani and nearly four dozen others — many of them Abtach employees — with running an elaborate trademark scam. The authorities called it “the biggest money laundering case in the history of Pakistan,” and named a number of businesses based in Texas that allegedly helped move the proceeds of cybercrime.\nA page from the March 2021 FIA report alleging that Digitonics Labs and Abtach employees conspired to extort and defraud consumers.\nThe FIA said the defendants operated a large number of websites offering low-cost trademark services to customers, before then “ignoring them after getting the funds and later demanding more funds from clients/victims in the name of up-sale (extortion).” The Pakistani law enforcement agency said that about 75 percent of customers received fake or fabricated trademarks as a result of the scams.\nThe FIA found Abtach operates in conjunction with a Karachi firm called Digitonics Labs, which earned a monthly revenue of around $2.5 million through the “extortion of international clients in the name of up-selling, the sale of fake/fabricated USPTO certificates, and the maintaining of phishing websites.”\nAccording the Pakistani authorities, the accused also ran countless scams involving ebook publication and logo creation, wherein customers are subjected to advance-fee fraud and extortion — with the scammers demanding more money for supposed “copyright release” and threatening to release the trademark.\nAlso charged by the FIA was Junaid Mansoor, the owner of Digitonics Labs in Karachi. Mansoor’s U.K.-registered company Maple Solutions Direct Limited has run at least 700 ads for logo design websites since 2015, the Google Ads Transparency page reports. The company has approximately 88 ads running on Google as of today. \nJunaid Mansoor. Source: youtube/@Olevels․com School.\nMr. Mansoor is actively involved with and promoting a Quran study business called quranmasteronline[.]com, which was founded by Junaid’s brother Qasim Mansoor (Qasim is also named in the FIA criminal investigation). The Google ads promoting quranmasteronline[.]com were paid for by the same account advertising a number of scam websites selling logo and web design services. \nJunaid Mansoor did not respond to requests for comment. An address in Teaneck, New Jersey where Mr. Mansoor previously lived is listed as an official address of exporthub[.]com, a Pakistan-based e-commerce website that appears remarkably similar to eWorldTrade (Exporthub says its offices are in Texas). Interestingly, a search in Google for this domain shows ExportHub currently features multiple listings for fentanyl citrate from suppliers in China and elsewhere.\nThe CEO of Digitonics Labs is Muhammad Burhan Mirza, a former Axact official who was arrested by the FIA as part of its money laundering and trademark fraud investigation in 2021. In 2023, prosecutors in Pakistan charged Mirza, Mansoor and 14 other Digitonics employees with fraud, impersonating government officials, phishing, cheating and extortion. Mirza’s LinkedIn profile says he currently runs an educational technology/life coach enterprise called TheCoach360, which purports to help young kids “achieve financial independence.”\nReached via LinkedIn, Mr. Mirza denied having anything to do with eWorldTrade or any of its sister companies in Texas.\n“Moreover, I have no knowledge as to the companies you have mentioned,” said Mr. Mirza, who did not respond to follow-up questions.\nThe current disposition of the FIA’s fraud case against the defendants is unclear. The investigation was marred early on by allegations of corruption and bribery. In 2021, Pakistani authorities alleged Bilwani paid a six-figure bribe to FIA investigators. Meanwhile, attorneys for Mr. Bilwani have argued that although their client did pay a bribe, the payment was solicited by government officials. Mr. Bilwani did not respond to requests for comment.\nKrebsOnSecurity has learned that the people and entities at the center of the FIA investigations have built a significant presence in the United States, with a strong concentration in Texas. The Texas businesses promote websites that sell logo and web design, ghostwriting, and academic cheating services. Many of these entities have recently been sued for fraud and breach of contract by angry former customers, who claimed the companies relentlessly upsold them while failing to produce the work as promised.\nFor example, the FIA complaints named Retrocube LLC and 360 Digital Marketing LLC, two entities that share a street address with eWorldTrade: 1910 Pacific Avenue, Suite 8025, Dallas, Texas. Also incorporated at that Pacific Avenue address is abtach[.]ae, a web design and marketing firm based in Dubai; and intersyslimited[.]com, the new name of Abtach after they were banned by the USPTO. Other businesses registered at this address market services for logo design, mobile app development, and ghostwriting.\nA list published in 2021 by Pakistan’s FIA of different front companies allegedly involved in scamming people who are looking for help with trademarks, ghostwriting, logos and web design.\n360 Digital Marketing’s website 360digimarketing[.]com is owned by an Abtach front company called Abtech LTD. Meanwhile, business records show 360 Digi Marketing LTD is a U.K. company whose officers include former Abtach director Bilwani; Muhammad Saad Iqbal, formerly Abtach, now CEO of Intersys Ltd; Niaz Ahmed, a former Abtach associate; and Muhammad Salman Yousuf, formerly a vice president at Axact, Abtach, and Digitonics Labs.\nGoogle’s Ads Transparency Center finds 360 Digital Marketing LLC ran at least 500 ads promoting various websites selling ghostwriting services . Another entity tied to Junaid Mansoor — a company called Octa Group Technologies AU — has run approximately 300 Google ads for book publishing services, promoting confusingly named websites like amazonlistinghub[.]com and barnesnoblepublishing[.]co.\n360 Digital Marketing LLC ran approximately 500 ads for scam ghostwriting sites.\nRameez Moiz is a Texas resident and former Abtach product manager who has represented 360 Digital Marketing LLC and RetroCube. Moiz told KrebsOnSecurity he stopped working for 360 Digital Marketing in the summer of 2023. Mr. Moiz did not respond to follow-up questions, but an Upwork profile for him states that as of April 2025 he is employed by Dallas-based Vertical Minds LLC.\nIn April 2025, California resident Melinda Will sued the Texas firm Majestic Ghostwriting — which is doing business as ghostwritingsquad[.]com —  alleging they scammed her out of $100,000 after she hired them to help write her book. Google’s ad transparency page shows Moiz’s employer Vertical Minds LLC paid to run approximately 55 ads for ghostwritingsquad[.]com and related sites.\nGoogle’s ad transparency listing for ghostwriting ads paid for by Vertical Minds LLC.\n\nMs. Will’s lawsuit is just one of more than two-dozen complaints over the past four years wherein plaintiffs sued one of this group’s web design, wiki editing or ghostwriting services. In 2021, a New Jersey man sued Octagroup Technologies, alleging they ripped him off when he paid a total of more than $26,000 for the design and marketing of a web-based mapping service.\nThe plaintiff in that case did not respond to requests for comment, but his complaint alleges Octagroup and a myriad other companies it contracted with produced minimal work product despite subjecting him to relentless upselling. That case was decided in favor of the plaintiff because the defendants never contested the matter in court.\nIn 2023, 360 Digital Marketing LLC and Retrocube LLC were sued by a woman who said they scammed her out of $40,000 over a book she wanted help writing. That lawsuit helpfully showed an image of the office front door at 1910 Pacific Ave Suite 8025, which featured the logos of 360 Digital Marketing, Retrocube, and eWorldTrade.\nThe front door at 1910 Pacific Avenue, Suite 8025, Dallas, Texas.\nThe lawsuit was filed pro se by Leigh Riley, a 64-year-old career IT professional who paid 360 Digital Marketing to have a company called Talented Ghostwriter co-author and promote a series of books she’d outlined on spirituality and healing.\n“The main reason I hired them was because I didn’t understand what I call the formula for writing a book, and I know there’s a lot of marketing that goes into publishing,” Riley explained in an interview. “I know nothing about that stuff, and these guys were convincing that they could handle all aspects of it. Until I discovered they couldn’t write a damn sentence in English properly.”\nRiley’s well-documented lawsuit (not linked here because it features a great deal of personal information) includes screenshots of conversations with the ghostwriting team, which was constantly assigning her to new writers and editors, and ghosting her on scheduled conference calls about progress on the project. Riley said she ended up writing most of the book herself because the work they produced was unusable.\n“Finally after months of promising the books were printed and on their way, they show up at my doorstep with the wrong title on the book,” Riley said. When she demanded her money back, she said the people helping her with the website to promote the book locked her out of the site.\nA conversation snippet from Leigh Riley’s lawsuit against Talented Ghostwriter, aka 360 Digital Marketing LLC. “Other companies once they have you money they don’t even respond or do anything,” the ghostwriting team manager explained.\nRiley decided to sue, naming 360 Digital Marketing LLC and Retrocube LLC, among others.  The companies offered to settle the matter for $20,000, which she accepted. “I didn’t have money to hire a lawyer, and I figured it was time to cut my losses,” she said.\nRiley said she could have saved herself a great deal of headache by doing some basic research on Talented Ghostwriter, whose website claims the company is based in Los Angeles. According to the California Secretary of State, however, there is no registered entity by that name. Rather, the address claimed by talentedghostwriter[.]com is a vacant office building with a “space available” sign in the window.\nCalifornia resident Walter Horsting discovered something similar when he sued 360 Digital Marketing in small claims court last year, after hiring a company called Vox Ghostwriting to help write, edit and promote a spy novel he’d been working on. Horsting said he paid Vox $3,300 to ghostwrite a 280-page book, and was upsold an Amazon marketing and publishing package for $7,500.\nIn an interview, Horsting said the prose that Vox Ghostwriting produced was “juvenile at best,” forcing him to rewrite and edit the work himself, and to partner with a graphical artist to produce illustrations. Horsting said that when it came time to begin marketing the novel, Vox Ghostwriting tried to further upsell him on marketing packages, while dodging scheduled meetings with no follow-up.\n“They have a money back guarantee, and when they wouldn’t refund my money I said I’m taking you to court,” Horsting recounted. “I tried to serve them in Los Angeles but found no such office exists. I talked to a salon next door and they said someone else had recently shown up desperately looking for where the ghostwriting company went, and it appears there are a trail of corpses on this. I finally tracked down where they are in Texas.”\nIt was the same office that Ms. Riley served her lawsuit against. Horsting said he has a court hearing scheduled later this month, but he’s under no illusions that winning the case means he’ll be able to collect.\n“At this point, I’m doing it out of pride more than actually expecting anything to come to good fortune for me,” he said.\nThe following mind map was helpful in piecing together key events, individuals and connections mentioned above. It’s important to note that this graphic only scratches the surface of the operations tied to this group. For example, in Case 2 we can see mention of academic cheating services, wherein people can be hired to take online proctored exams on one’s behalf. Those who hire these services soon find themselves subject to impersonation and blackmail attempts for larger and larger sums of money, with the threat of publicly exposing their unethical academic cheating activity.\nA “mind map” illustrating the connections between and among entities referenced in this story. Click to enlarge.\nKrebsOnSecurity reviewed the Google Ad Transparency links for nearly 500 different websites tied to this network of ghostwriting, logo, app and web development businesses. Those website names were then fed into spyfu.com, a competitive intelligence company that tracks the reach and performance of advertising keywords. Spyfu estimates that between April 2023 and April 2025, those websites spent more than $10 million on Google ads.\nReached for comment, Google said in a written statement that it is constantly policing its ad network for bad actors, pointing to an ads safety report (PDF) showing Google blocked or removed 5.1 billion bad ads last year — including more than 500 million ads related to trademarks.\n“Our policy against Enabling Dishonest Behavior prohibits products or services that help users mislead others, including ads for paper-writing or exam-taking services,” the statement reads. “When we identify ads or advertisers that violate our policies, we take action, including by suspending advertiser accounts, disapproving ads, and restricting ads to specific domains when appropriate.”\n\nGoogle did not respond to specific questions about the advertising entities mentioned in this story, saying only that “we are actively investigating this matter and addressing any policy violations, including suspending advertiser accounts when appropriate.”\nFrom reviewing the ad accounts that have been promoting these scam websites, it appears Google has very recently acted to remove a large number of the offending ads. Prior to my notifying Google about the extent of this ad network on April 28, the Google Ad Transparency network listed over 500 ads for 360 Digital Marketing; as of this publication, that number had dwindled to 10.\nOn April 30, Google announced that starting this month its ads transparency page will display the payment profile name as the payer name for verified advertisers, if that name differs from their verified advertiser name. Searchengineland.com writes the changes are aimed at increasing accountability in digital advertising.\nThis spreadsheet lists the domain names, advertiser names, and Google Ad Transparency links for more than 350 entities offering ghostwriting, publishing, web design and academic cheating services.\nKrebsOnSecurity would like to thank the anonymous security researcher NatInfoSec for their assistance in this investigation.\nFor further reading on Abtach and its myriad companies in all of the above-mentioned verticals (ghostwriting, logo design, etc.), see this Wikiwand entry.\n\r\n         This entry was posted on Wednesday 7th of May 2025 06:22 PM \r\n         \nHere! Here!  Fantastic, thanks so much.\nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "Cisco’s Quantum Bet: Linking Small Machines Into One Giant Quantum Computer",
        "Link": "https://www.securityweek.com/ciscos-quantum-bet-linking-small-machines-into-one-giant-quantum-computer/",
        "Summary": "<p>Cisco unveils its Quantum Network Entanglement Chip and new Quantum Labs, laying the groundwork for a scalable quantum internet that connects distributed quantum computers into a unified, powerful system.</p>\n<p>The post <a href=\"https://www.securityweek.com/ciscos-quantum-bet-linking-small-machines-into-one-giant-quantum-computer/\">Cisco’s Quantum Bet: Linking Small Machines Into One Giant Quantum Computer</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/ciscos-quantum-bet-linking-small-machines-into-one-giant-quantum-computer/"
    },
    {
        "Title": "CodeAnt AI Raises $2 Million for Code Quality and Application Security Platform",
        "Link": "https://www.securityweek.com/codeant-ai-raises-2-million-for-code-quality-and-application-security-platform/",
        "Summary": "<p>Code quality and security firm CodeAnt has secured $2 million in seed funding and it has been valued at $20 million.</p>\n<p>The post <a href=\"https://www.securityweek.com/codeant-ai-raises-2-million-for-code-quality-and-application-security-platform/\">CodeAnt AI Raises $2 Million for Code Quality and Application Security Platform </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/codeant-ai-raises-2-million-for-code-quality-and-application-security-platform/"
    },
    {
        "Title": "CrowdStrike Plans Layoffs to Pursue $10B ARR Target",
        "Link": "https://www.securityweek.com/crowdstrike-plans-layoffs-to-pursue-10b-arr-target/",
        "Summary": "<p>CrowdStrike said the planned cuts will affect approximately 500 employees and will span the first half of fiscal 2026.</p>\n<p>The post <a href=\"https://www.securityweek.com/crowdstrike-plans-layoffs-to-pursue-10b-arr-target/\">CrowdStrike Plans Layoffs to Pursue $10B ARR Target</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/crowdstrike-plans-layoffs-to-pursue-10b-arr-target/"
    },
    {
        "Title": "Ox Security Bags $60M Series B to Tackle Appsec Alert Fatigue",
        "Link": "https://www.securityweek.com/ox-security-bags-60m-series-b-to-tackle-appsec-alert-fatigue/",
        "Summary": "<p>Ox Security has raised a total $94 million since its launch in 2021 with ambitious plans to cash in on two fast-moving trends.</p>\n<p>The post <a href=\"https://www.securityweek.com/ox-security-bags-60m-series-b-to-tackle-appsec-alert-fatigue/\">Ox Security Bags $60M Series B to Tackle Appsec Alert Fatigue </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/ox-security-bags-60m-series-b-to-tackle-appsec-alert-fatigue/"
    },
    {
        "Title": "New UK Framework Pressures Vendors on SBOMs, Patching and Default MFA",
        "Link": "https://www.securityweek.com/new-uk-framework-pressures-vendors-on-sboms-patching-and-default-mfa/",
        "Summary": "<p>By baking minimum expectations into procurement conversations, the plan is to steer software vendors to “secure-by-design and default” basics.</p>\n<p>The post <a href=\"https://www.securityweek.com/new-uk-framework-pressures-vendors-on-sboms-patching-and-default-mfa/\">New UK Framework Pressures Vendors on SBOMs, Patching and Default MFA</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/new-uk-framework-pressures-vendors-on-sboms-patching-and-default-mfa/"
    },
    {
        "Title": "US Sanctions Myanmar Militia Involved in Cyber Scams",
        "Link": "https://www.securityweek.com/us-sanctions-myanmar-militia-involved-in-cyber-scams/",
        "Summary": "<p>The US has sanctioned Myanmar warlord Saw Chit Thu and his militia for their roles in cyber scams causing billions in losses to American victims.</p>\n<p>The post <a href=\"https://www.securityweek.com/us-sanctions-myanmar-militia-involved-in-cyber-scams/\">US Sanctions Myanmar Militia Involved in Cyber Scams </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/us-sanctions-myanmar-militia-involved-in-cyber-scams/"
    },
    {
        "Title": "Spyware Maker NSO Ordered to Pay $167 Million Over WhatsApp Hack",
        "Link": "https://www.securityweek.com/spyware-maker-nso-ordered-to-pay-167-million-over-whatsapp-hack/",
        "Summary": "<p>Meta has won its WhatsApp hacking lawsuit against Israeli spyware company NSO Group in an “important step forward for privacy and security”.</p>\n<p>The post <a href=\"https://www.securityweek.com/spyware-maker-nso-ordered-to-pay-167-million-over-whatsapp-hack/\">Spyware Maker NSO Ordered to Pay $167 Million Over WhatsApp Hack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/spyware-maker-nso-ordered-to-pay-167-million-over-whatsapp-hack/"
    },
    {
        "Title": "AppSignal Raises $22 Million for Application Monitoring Solution",
        "Link": "https://www.securityweek.com/appsignal-raises-22-million-for-application-monitoring-solution/",
        "Summary": "<p>Application performance monitoring provider AppSignal has raised $22 million in a Series A funding round led by Elsewhere Partners.</p>\n<p>The post <a href=\"https://www.securityweek.com/appsignal-raises-22-million-for-application-monitoring-solution/\">AppSignal Raises $22 Million for Application Monitoring Solution</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/appsignal-raises-22-million-for-application-monitoring-solution/"
    },
    {
        "Title": "Second Ransomware Group Caught Exploiting Windows Flaw as Zero-Day",
        "Link": "https://www.securityweek.com/second-ransomware-group-caught-exploiting-windows-flaw-as-zero-day/",
        "Summary": "<p>At least two ransomware groups exploited the Windows zero-day CVE-2025-29824 before it was patched by Microsoft.</p>\n<p>The post <a href=\"https://www.securityweek.com/second-ransomware-group-caught-exploiting-windows-flaw-as-zero-day/\">Second Ransomware Group Caught Exploiting Windows Flaw as Zero-Day</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/second-ransomware-group-caught-exploiting-windows-flaw-as-zero-day/"
    },
    {
        "Title": "Second OttoKit Vulnerability Exploited to Hack WordPress Sites",
        "Link": "https://www.securityweek.com/second-ottokit-vulnerability-exploited-to-hack-wordpress-sites/",
        "Summary": "<p>Threat actors are targeting a critical-severity vulnerability in the OttoKit WordPress plugin to gain administrative privileges.</p>\n<p>The post <a href=\"https://www.securityweek.com/second-ottokit-vulnerability-exploited-to-hack-wordpress-sites/\">Second OttoKit Vulnerability Exploited to Hack WordPress Sites</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-07",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/second-ottokit-vulnerability-exploited-to-hack-wordpress-sites/"
    }
]