[
    {
        "Title": "TikTok Slammed With €530 Million GDPR Fine for Sending E.U. Data to China",
        "Link": "https://thehackernews.com/2025/05/tiktok-slammed-with-530-million-gdpr.html",
        "Summary": "Ireland's Data Protection Commission (DPC) on Friday fined popular video-sharing platform TikTok €530 million ($601 million) for infringing data protection regulations in the region by transferring European users' data to China.\n\"TikTok infringed the GDPR regarding its transfers of EEA [European Economic Area] User Data to China and its transparency requirements,\" the DPC said in a statement. \"",
        "Date": "2025-05-02",
        "Content": "Ireland's Data Protection Commission (DPC) on Friday fined popular video-sharing platform TikTok €530 million ($601 million) for infringing data protection regulations in the region by transferring European users' data to China.\n\"TikTok infringed the GDPR regarding its transfers of EEA [European Economic Area] User Data to China and its transparency requirements,\" the DPC\nsaid\nin a statement. \"The decision includes administrative fines totaling €530 million and an order requiring TikTok to bring its processing into compliance within 6 months.\"\nThe order, in addition, requires the company to suspend data transfers to China within the time period.\nThe penalty is the result of an investigation that was\nlaunched\nin September 2021 that probed the company's transfer of personal data to China and its compliance with stringent data protection laws regarding data transfers to third countries.\nCommenting on the decision, DPC Deputy Commissioner Graham Doyle said TikTok's personal data transfers to China went against Article 46(1) of the General Data Protection Regulation (GDPR) because it failed to verify and guarantee that the personal data of EEA users was given equivalent privacy protections to that afforded within the bloc.\nDoyle further added that TikTok did not address concerns arising from potential access by Chinese authorities under anti-terrorism and counter-espionage laws in the country and which \"materially\" diverged from European Union standards.\nThe DPC also faulted TikTok for providing erroneous information during the inquiry to the effect that it did not store EEA users' data in Chinese servers, only to disclose to the watchdog last month that it identified an issue in its systems in February 2025, as a result of which limited EEA data had indeed been stored on servers in China.\n\"Whilst TikTok has informed the DPC that the data has now been deleted, we are considering what further regulatory action may be warranted, in consultation with our peer EU Data Protection Authorities,\" Doyle said.\nChristine Grahn, TikTok's head of public policy and government relations for Europe, said the decision failed to take into account\nProject Clover\n, a data security initiative aimed at protecting European user data, and that the ruling does not reflect the current safeguards put in place.\n\"The DPC itself recorded in its report what TikTok has consistently said: it has never received a request for European user data from the Chinese authorities, and has never provided European user data to them,\" Grahn\nsaid\n.\nThis is the second fine levied by the DPC against the ByteDance-owned company. In September 2023, TikTok was\nhanded\na €345 million (then about $368 million) fine for violating GDPR laws in relation to its handling of children's data.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "How to Automate CVE and Vulnerability Advisory Response with Tines",
        "Link": "https://thehackernews.com/2025/05/how-to-automate-cve-and-vulnerability.html",
        "Summary": "Run by the team at workflow orchestration and AI platform Tines, the Tines library features pre-built workflows shared by security practitioners from across the community - all free to import and deploy through the platform’s Community Edition.\nA recent standout is a workflow that automates monitoring for security advisories from CISA and other vendors, enriches advisories with CrowdStrike",
        "Date": "2025-05-02",
        "Content": "Run by the team at workflow orchestration and AI platform Tines, the Tines library features pre-built workflows shared by security practitioners from across the community - all free to import and deploy through the platform's\nCommunity Edition\n.\nA recent standout is a workflow that automates monitoring for security advisories from CISA and other vendors, enriches advisories with CrowdStrike threat intelligence, and streamlines ticket creation and notification. Developed by Josh McLaughlin, a security engineer at LivePerson, the workflow drastically reduces manual work while keeping analysts in control of final decisions, helping teams stay on top of new vulnerabilities.\n\"Before automation, creating tickets for 45 vulnerabilities took about 150 minutes of work,\" Josh explains. \"After automation, the time needed for the same number of tickets dropped to around 60 minutes, saving significant time and freeing analysts from manual tasks like copy-pasting and web browsing.\" LivePerson's security team reduced the time this process takes by 60% through automation and orchestration, creating a major boost to both efficiency and analyst morale.\nIn this guide, we'll share an overview of the workflow, plus step-by-step instructions for getting it up and running.\nThe problem - manual tracking of critical advisories\nFor security teams, timely awareness of newly disclosed vulnerabilities is essential - but monitoring multiple sources, enriching advisories with threat intelligence, and creating tickets for remediation are time-consuming and error-prone tasks.\nTeams often have to:\nManually check CISA and other sources for advisories\nResearch related CVEs\nDecide whether action is needed\nManually create tickets and notify stakeholders\nThese repetitive steps not only consume valuable analyst time but also risk inconsistent responses if an important vulnerability is missed or delayed.\nThe solution – automated monitoring, enrichment, and ticketing\nJosh's pre-built workflow automates the process end-to-end - but crucially, it keeps analysts in control at key decision points:\nIt pulls new advisories from CISA (or a chosen open-source feed)\nIt enriches findings using CrowdStrike's threat intelligence\nIt notifies the security team in Slack, and prompts them to provide input quickly via approve and deny buttons\nUpon approval, it automatically creates a ServiceNow ticket with the vulnerability's details\nThe result is a streamlined, efficient process that ensures vulnerabilities are tracked and actioned quickly, without sacrificing the critical thinking and prioritization that only analysts can provide.\nKey benefits of this workflow:\nReduces manual effort and speeds up response time\nLeverages threat intelligence for smarter prioritization\nEnsures consistent handling of new vulnerabilities\nStrengthens collaboration across security and IT teams\nBoosts morale by eliminating tedious tasks\nKeeps analysts in control with easy, fast approvals\nWorkflow overview\nTools used:\nTines – workflow orchestration and AI platform (Community Edition available)\nCrowdStrike – threat intelligence and EDR platform\nServiceNow – ticketing and ITSM platform\nSlack – team collaboration platform\nHow it works:\nRSS feed collection: fetches the latest advisories from CISA's RSS feed\nDeduplication: filters out duplicate advisories\nVendor filtering: focuses on advisories from key vendors and services (e.g., Microsoft, Citrix, Google, Atlassian).\nCVE extraction: identifies CVEs from advisory descriptions\nEnrichment: cross-references CVEs with CrowdStrike threat intelligence for added context\nSlack notification: sends an enriched vulnerability with action buttons to a dedicated Slack channel\nApproval flow:\nIf approved, the workflow creates a ServiceNow ticket\nIf denied, the workflow logs the decision without creating a ticket\nConfiguring the workflow - step-by-step guide\nThe Tines Community Edition sign-up form\n1. Log into Tines\nor create a new account.\n2. Navigate to\nthe pre-built workflow in the library\n. Select import. This should take you straight to your new pre-built workflow.\nThe workflow on Tines' drag-and-drop canvas\nAdding a new credential in Tines\n3. Set up your credentials\nYou'll need three credentials added to your Tines tenant:\nCrowdStrike\nServiceNow\nSlack\nNote that similar services to the ones listed above can also be used, with some adjustments to the workflow.\nFrom the credentials page, select New credential, scroll down to the relevant credential and complete the required fields. Follow the CrowdStrike, ServiceNow, and Slack credential guides at explained.tines.com if you need help.\n4. Configure your actions.\nSet the Slack channel for advisory notifications (slack_channel_vuln_advisory resource).\nSet your ServiceNow ticket details in the Create ticket in ServiceNow action (e.g., priority, assignment group).\nAdjust vendor filtering rules if needed to match your organization's priorities.\n5. Test the workflow.\nTrigger a test by pulling recent advisories from CISA, and verify that:\nSlack notifications are sent with correct formatting\nApproval buttons function as expected\nServiceNow tickets are created correctly upon approval\n6. Publish and operationalize\nOnce tested, publish the workflow. Share the Slack channel with your team to start reviewing and approving advisories efficiently.\nIf you'd like to test this workflow, you can sign up for a\nfree Tines account\n.\nFound this article interesting?\nThis article is a contributed piece from one of our valued partners.\nFollow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "MintsLoader Drops GhostWeaver via Phishing, ClickFix — Uses DGA, TLS for Stealth Attacks",
        "Link": "https://thehackernews.com/2025/05/mintsloader-drops-ghostweaver-via.html",
        "Summary": "The malware loader known as MintsLoader has been used to deliver a PowerShell-based remote access trojan called GhostWeaver.\n\"MintsLoader operates through a multi-stage infection chain involving obfuscated JavaScript and PowerShell scripts,\" Recorded Future's Insikt Group said in a report shared with The Hacker News.\n\"The malware employs sandbox and virtual machine evasion techniques, a domain",
        "Date": "2025-05-02",
        "Content": "The malware loader known as\nMintsLoader\nhas been used to deliver a PowerShell-based remote access trojan called GhostWeaver.\n\"MintsLoader operates through a multi-stage infection chain involving obfuscated JavaScript and PowerShell scripts,\" Recorded Future's Insikt Group\nsaid\nin a report shared with The Hacker News.\n\"The malware employs sandbox and virtual machine evasion techniques, a domain generation algorithm (DGA), and HTTP-based command-and-control (C2) communications.\"\nPhishing and drive-by download campaigns distributing\nMintsLoader\nhave been detected in the wild since early 2023, per\nOrange Cyberdefense\n. The loader has been observed delivering various follow-on payloads like StealC and a modified version of the Berkeley Open Infrastructure for Network Computing (BOINC) client.\nThe malware has also been put to use by threat actors operating e-crime services like\nSocGholish\n(aka FakeUpdates) and\nLandUpdate808\n(aka TAG-124), distributing via phishing emails targeting the industrial, legal, and energy sectors and fake browser update prompts.\nIn a notable twist, recent attack waves have employed the increasingly prevalent social engineering tactic called ClickFix to trick site visitors into copying and executing malicious JavaScript and PowerShell code. The links to ClickFix pages are distributed via spam emails.\n\"Although MintsLoader functions solely as a loader without supplementary capabilities, its primary strengths lie in its sandbox and virtual machine evasion techniques and a DGA implementation that derives the C2 domain based on the day it is run,\" Recorded Future said.\nThese features, coupled with obfuscation techniques, enable threat actors to hinder analysis and complicate detection efforts. The primary responsibility of the malware is to download the next-stage payload from a DGA domain over HTTP by means of a PowerShell script.\nGhostWeaver, according to a\nreport\nfrom TRAC Labs earlier this February, is designed to maintain persistent communication with its C2 server, generate DGA domains based on a fixed-seed algorithm based on the week number and year, and deliver additional payloads in the form of plugins that can steal browser data and manipulate HTML content.\n\"Notably, GhostWeaver can deploy MintsLoader as an additional payload via its sendPlugin command. Communication between GhostWeaver and its command-and-control (C2) server is secured through TLS encryption using an obfuscated, self-signed X.509 certificate embedded directly within the PowerShell script, which is leveraged for client-side authentication to the C2 infrastructure,\" Recorded Future said.\nThe disclosure comes as Kroll\nrevealed\nattempts made by threat actors to secure initial access through an ongoing campaign codenamed\nCLEARFAKE\nthat leverages ClickFix to lure victims into running MSHTA commands that ultimately deploy the Lumma Stealer malware.\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Microsoft Sets Passkeys Default for New Accounts; 15 Billion Users Gain Passwordless Support",
        "Link": "https://thehackernews.com/2025/05/microsoft-sets-passkeys-default-for-new.html",
        "Summary": "A year after Microsoft announced passkeys support for consumer accounts, the tech giant has announced a big change that pushes individuals signing up for new accounts to use the phishing-resistant authentication method by default.\n\"Brand new Microsoft accounts will now be 'passwordless by default,'\" Microsoft's Joy Chik and Vasu Jakkal said. \"New users will have several passwordless options for",
        "Date": "2025-05-02",
        "Content": "A year after Microsoft\nannounced\npasskeys support for consumer accounts, the tech giant has announced a big change that pushes individuals signing up for new accounts to use the phishing-resistant authentication method by default.\n\"Brand new Microsoft accounts will now be 'passwordless by default,'\" Microsoft's Joy Chik and Vasu Jakkal\nsaid\n. \"New users will have several passwordless options for signing into their account and they'll never need to enroll a password. Existing users can visit their account settings to delete their password.\"\nThe Windows maker said it has also simplified the sign-in and sign-up user experience by prioritizing passwordless methods. Furthermore, the sign-in process now automatically detects the best available method on a user's account and sets that as the default.\nFor example, if an account has the option to sign in via a password and a \"one time code,\" the user will be prompted to login via one time code instead of the password. Once signed in, they will then be instructed to set up a passkey for optimal protection.\nThe latest move by Microsoft, along with its peers Apple, Google, Amazon, and others in recent years, represents a steady march toward a passwordless future. With password-based cyber-attacks continuing to be a lucrative initial access vector for bad actors, the adoption of passkeys heralds an important step for account security.\nIn September 2023, Microsoft\nrolled out\nsupport for passkeys in Windows 11, around the same time when Google made\npasskeys its default login method\nfor all users globally. Then last year, it\nupdated\nWindows Hello to support the technology.\nPasskeys\noffer a more secure way of logging in to websites and applications by eliminating the need for passwords. Backed by the Fast Identity Online (FIDO) Alliance, passkeys rely on public/private key cryptography techniques to authenticate users.\nThus when a user registers with an online service, their client device (i.e., phone or PC) generates a new key pair. The private key is stored securely on the user's device, while the public key is registered with the service.\nDuring sign in, the client device uses the private key to sign a challenge after the device owner authenticates it using their biometric information (e.g., facial recognition or fingerprint).\nIn October 2024, the FIDO Alliance\nsaid\nit's working with stakeholders to make passkeys and other credentials more easier to export across different providers and improve credential provider interoperability. More than\n15 billion user accounts\ncan sign in using passkeys instead of passwords as of December last year.\nThe open industry association, last month, also\nlaunched\na Payments Working Group (PWG) to define and drive FIDO solutions for payment use cases.\nThe PWG is expected to \"identify and evaluate existing and emerging solutions to address payment authentication requirements\" and establish \"guidelines for use of passkeys and/or proposed FIDO solutions along with existing payment technologies.\"\nFound this article interesting?  Follow us on\nTwitter\n\nand\nLinkedIn\nto read more exclusive content we post."
    },
    {
        "Title": "Co-op confirms data theft after DragonForce ransomware claims attack",
        "Link": "https://www.bleepingcomputer.com/news/security/co-op-confirms-data-theft-after-dragonforce-ransomware-claims-attack/",
        "Summary": "The Co-op cyberattack is far worse than initially reported, with the company now confirming that data was stolen for a significant number of current and past customers. [...]",
        "Date": "2025-05-02",
        "Content": "The Co-op cyberattack is far worse than initially reported, with the company now confirming that data was stolen for a significant number of current and past customers.\n\"As a result of ongoing forensic investigations, we now know that the hackers were able to access and extract data from one of our systems,\" Co-op told BleepingComputer.\n\"The accessed data included information relating to a significant number of our current and past members.\"\n\"This data includes Co-op Group members' personal data such as names and contact details, and did not include members' passwords, bank or credit card details, transactions or information relating to any members' or customers' products or services with the Co-op Group.\"\nOn Wednesday, UK retail giant\nCo-op downplayed the cyberattack\n, stating that it had shut down portions of its IT systems after detecting an attempted intrusion into its network.\nHowever, soon after the news broke, BleepingComputer learned that the company did indeed suffer a breach utilizing tactics associated with Scattered Spider/Octo Temptest, but their defenses prevented the threat actors from performing significant damage to the network.\nSources told BleepingComputer that it is believed the attack occurred on April 22, with the threat actors utilizing tactics similar to the attack on Marks and Spencer. The threat actors reportedly conducted a social engineering attack that allowed them to reset an employee's password, which was then used to breach the network.\nOnce they gained access to the network, they stole the Windows NTDS.dit file, a database for Windows Active Directory Services that contains password hashes for Windows accounts.\nCo-op is now in the process of rebuilding all of its Windows domain controllers and hardening Entra ID with the help of Microsoft DART. KPMG is assisting with AWS support.\nWhen sharing these details with Co-op yesterday, the company said it had nothing further to share and sent us its original statement.\nDo you have information about this or another cyberattack? If you want to share the information, you can contact us securely and confidentially on Signal at LawrenceA.11, via email at lawrence.abrams@bleepingcomputer.com, or by using our\ntips form\n.\nDragonForce ransomware behind attack\nToday, the\nBBC first reported\nthat affiliates for the DragonForce ransomware operation, the same\nhackers who breached M&S\n, are also behind the attack on Co-op.\nBBC correspondent Joe Tidy spoke to the DragonForce operator, who confirmed they were behind the attack and shared samples of corporate and customer data stolen during the attack. The threat actors claim to have data from 20 million people who registered for Co-op's membership reward program.\nThe threat actors stated they contacted Co-op's head of cyber security and other executives using Microsoft Teams messages, sharing screenshots of the extortion messages with the BBC.\nAfter the attack, Co-op sent an internal email to employees warning them to be vigilant when using Microsoft Teams and not to share any sensitive data, likely out of concern that the hackers still had access to the platform.\nThe threat actors also claimed to the BBC that they were behind the attempted\ncyberattack on Harrods\n.\nDragonForce is a ransomware-as-a-service operation where other cyber criminals can join as affiliates to use their ransomware encryptors and negotiation sites. In exchange, the DragonForce operators receive 20-30% of any ransoms paid by extorted victims.\nIn attacks, the affiliates will breach a network, steal data, and ultimately deploy malware that encrypts the files on all of the servers and workstations. The threat actors then demand a ransom payment to retrieve a decryptor and promise that stolen data will be deleted.\nIf a ransom is not paid, the ransomware operation typically publishes the stolen data on their dark web data leak site.\nDragonForce is a relatively new operation but is\ngearing up to be one of the more prominent ones\nin the ransomware space.\nThey are believed to be working with English-speaking threat actors that fit a\nspecific set of tactics\nassociated with the name \"Scattered Spider\" or \"\nOcto Tempest\n.\"\nThese threat actors are experts at using social engineering attacks, SIM Swapping,\nand MFA fatigue attacks\nto breach networks and then steal data or deploy ransomware. The threat actors are known to aggressively extort their victims.\nTo be clear, Scatted Spider is not a gang or group with specific members. Instead, they are an amorphous community of financially motivated threat actors who congregate on the same Telegram channels, Discord servers, and hacking forums.\nAs they are \"scattered\" throughout the cybercrime landscape, it is more difficult for law enforcement to track individual people who are associated with an attack.\nThe original threat actors associated with the Scattered Spider classification were behind a string of attacks, including those on\nMGM\nand\nReddit\n.\nSome, if not all, of these original hackers have now been arrested by the\nUS\n,\nUnited Kingdom\n, and\nSpain\n.\nHowever, previously unknown hackers or copycats are now utilizing the same methods to escalate attacks.\nCybersecurity researcher Will Thomas has put together a\nrecommended guide\non defending against Scattered Spider attacks.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMarks & Spencer breach linked to Scattered Spider ransomware attack\nUK retailer Co-op shuts down some IT systems after hack attempt\nMicrosoft: Octo Tempest is one of the most dangerous financial hacking groups\nMarks & Spencer pauses online orders after cyberattack\nUK NCSC: Cyberattacks impacting UK retailers are a wake-up call"
    },
    {
        "Title": "Magento supply chain attack compromises hundreds of e-stores",
        "Link": "https://www.bleepingcomputer.com/news/security/magento-supply-chain-attack-compromises-hundreds-of-e-stores/",
        "Summary": "A supply chain attack involving 21 backdoored Magento extensions has compromised between 500 and 1,000 e-commerce stores, including one belonging to a $40 billion multinational. [...]",
        "Date": "2025-05-02",
        "Content": "A supply chain attack involving 21 backdoored Magento extensions has compromised between 500 and 1,000 e-commerce stores, including one belonging to a $40 billion multinational.\nSansec researchers who discovered the attack report that some extensions were backdoored as far back as 2019, but the malicious code was only activated in April 2025.\n\"Multiple vendors were hacked in a coordinated supply chain attack, Sansec found 21 applications with the same backdoor,\"\nexplains Sansec\n.\n\"Curiously, the malware was injected 6 years ago, but came to life this week as attackers took full control of ecommerce servers.\"\nSansec says the compromised extensions are from vendors Tigren, Meetanshi, and MGS:\nTigren Ajaxsuite\nTigren Ajaxcart\nTigren Ajaxlogin\nTigren Ajaxcompare\nTigren Ajaxwishlist\nTigren MultiCOD\nMeetanshi ImageClean\nMeetanshi CookieNotice\nMeetanshi Flatshipping\nMeetanshi FacebookChat\nMeetanshi CurrencySwitcher\nMeetanshi DeferJS\nMGS Lookbook\nMGS StoreLocator\nMGS Brand\nMGS GDPR\nMGS Portfolio\nMGS Popup\nMGS DeliveryTime\nMGS ProductTabs\nMGS Blog\nSansec has also found a compromised version of the Weltpixel GoogleTagManager extension but couldn't confirm if the point of compromise was at the vendor or the website.\nIn all observed cases, the extensions include a PHP backdoor added to a license check file (License.php or LicenseApi.php) used by the extension.\nThis malicious code checks for HTTP requests containing special parameters named \"requestKey\" and \"dataSign,\" which are used to perform a check against hardcoded keys within the PHP files.\nChecking HTTP request for valid authentication against hardcoded keys\nSource: BleepingComputer\nIf the check is successful, the backdoor gives access to other admin functions in the file, including one that allows a remote user to upload a new license and save it as a file.\nRunning an admin function specified in the HTTP request\nSource: BleepingComputer\nThis file is then included using the \"include_once()\" PHP function, which loads the file and automatically executes any code within the uploaded license file.\nFunction that executes code in the uploaded file\nSource: BleepingComputer\nPast versions of the backdoor didn't require authentication, but newer ones use a hardcoded key.\nSansec told BleepingComputer that this backdoor was used to upload a webshell to one of their customer's sites.\nGiven the ability to upload and run any PHP code, the potential repercussions of the attack include data theft, skimmer injection, arbitrary admin account creation, and more.\nSansec contacted the three vendors, warning them of the discovered backdoor. The cybersecurity firm says MGS didn't respond, Tigren denied a breach and continues to distribute backdoored extensions, and Meetanshi admitted to a server breach but not an extension compromise.\nBleepingComputer independently confirmed that this backdoor is present in the MGS StoreLocator extension, which is free to download from their site. We did not confirm if the backdoor is present in the other extensions reported by Sansec.\nUsers of the mentioned extensions are recommended to perform complete server scans for the indicators of compromise Sansec shared in its report and, if possible, restore the site from a known-clean backup.\nSansec commented on the peculiarity of the backdoor laying dormant for six years and activating only now and promised to provide additional insight from their ongoing investigation.\nBleepingComputer contacted the three vendors, but has not received a response at this time.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nPyPI packages caught stealing credit card numbers, Discord tokens\nAI-hallucinated code dependencies become new supply chain risk\nRecent GitHub supply chain attack traced to leaked SpotBugs token\nInfostealer campaign compromises 10 npm packages, targets devs\nNew npm attack poisons local packages with backdoors"
    },
    {
        "Title": "US indicts Black Kingdom ransomware admin for Microsoft Exchange attacks",
        "Link": "https://www.bleepingcomputer.com/news/security/us-indicts-black-kingdom-ransomware-admin-for-microsoft-exchange-attacks/",
        "Summary": "A 36-year-old Yemeni national, who is believed to be the developer and primary operator of 'Black Kingdom' ransomware, has been indicted by the United States for conducting 1,500 attacks on Microsoft Exchange servers. [...]",
        "Date": "2025-05-02",
        "Content": "A 36-year-old Yemeni national, who is believed to be the developer and primary operator of 'Black Kingdom' ransomware, has been indicted by the United States for conducting 1,500 attacks on Microsoft Exchange servers.\nThe suspect, Rami Khaled Ahmed, is accused of deploying the Black Kingdom malware on roughly 1,500 computers in the United States and abroad, demanding ransom payments of $10,000 in Bitcoin.\n\"According to the indictment, from March 2021 to June 2023, Ahmed and others infected computer networks of several U.S.-based victims, including a medical billing services company in Encino, a ski resort in Oregon, a school district in Pennsylvania, and a health clinic in Wisconsin,\"\nexplains a U.S. Department of Justice announcement\n.\n\"When the malware was successful, the ransomware then created a ransom note on the victim's system that directed the victim to send $10,000 worth of Bitcoin to a cryptocurrency address controlled by a co-conspirator and to send proof of this payment to a Black Kingdom email address,\" reads another part of the announcement.\nThe U.S. DoJ highlights that Ahmed designed Black Kingdom ransomware to exploit a vulnerability in Microsoft Exchange for initial access to targeted computers.\nThis was first reported in March 2021 by researcher\nMarcus Hutchins\n, who discovered web shells deployed by Black Kingdom ransomware operators on Exchange servers vulnerable to ProxyLogon attacks.\nThe\nProxyLogon\nflaw refers to a set of critical vulnerabilities in Microsoft Exchange Server that were first disclosed and exploited in early 2021.\nThe flaws are CVE-2021-26855 (Server-Side Request Forgery used for initial access), CVE-2021-26857 (insecure deserialization used for privilege escalation to SYSTEM), and CVE-2021-26858 and CVE-2021-27065 (arbitrary file write used for writing web shells to servers).\nSoon, Microsoft confirmed that Black Kingdom had\ncompromised 1,500 Exchange servers\nby leveraging ProxyLogon flaws.\nIn June 2020, it was revealed that Black Kingdom\ntargeted CVE-2019-11510\n, a critical vulnerability affecting Pulse Secure VPN, to breach corporate networks and deploy their file lockers.\nFor his Black Kingdom attacks, Ahmed now faces charges of conspiracy, intentional damage to a protected computer, and threatening damage to a protected computer.\nIf convicted, Ahmed faces a statutory maximum sentence of five years in federal prison for each count, totaling up to 15 years.\nThe U.S. DoJ states that Ahmed is believed to be residing in Yemen.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft: Exchange 2016 and 2019 reach end of support in six months\nMicrosoft: Outdated Exchange servers fail to auto-mitigate security bugs\nTexas State Bar warns of data breach after INC ransomware claims attack\nUK fines software provider £3.07 million for 2022 ransomware breach\nSuspected LockBit ransomware dev extradited to United States"
    },
    {
        "Title": "UK NCSC: Cyberattacks impacting UK retailers are a wake-up call",
        "Link": "https://www.bleepingcomputer.com/news/security/uk-ncsc-cyberattacks-impacting-uk-retailers-are-a-wake-up-call/",
        "Summary": "The United Kingdom's National Cyber Security Centre warned that ongoing cyberattacks impacting multiple UK retail chains should be taken as a \"wake-up call.\" [...]",
        "Date": "2025-05-02",
        "Content": "The United Kingdom's National Cyber Security Centre warned that ongoing cyberattacks impacting multiple UK retail chains should be taken as a \"wake-up call.\"\nPart of the GCHQ British intelligence agency, the NCSC provides support and guidance to private and public sector entities following major cybersecurity incidents to protect the UK's critical services.\nIn a statement issued this week, the NCSC also confirmed that it's working with affected organizations in the retail sector to assess the attacks' nature and impact.\n\"The disruption caused by the recent incidents impacting the retail sector are naturally a cause for concern to those businesses affected, their customers and the public,\"\nsaid NCSC CEO Dr Richard Horne\n.\n\"These incidents should act as a wake-up call to all organisations. I urge leaders to follow the advice on the NCSC website to ensure they have appropriate measures in place to help prevent attacks and respond and recover effectively.\"\nSince the attacks surfaced, the UK House of Commons' Business and Trade Committee\nhas also asked\nthe CEOs of\nMarks & Spencer\nand\nCo-op\nto share whether relevant government agencies (including the National Crime Agency and the National Cyber Security Centre) provided support.\nCyberattacks targeting UK retailers\nHarrods\nconfirmed it was targeted in a cyberattack on May 1st, becoming the third major UK retailer to report cyberattacks over the last two weeks following incidents at the Co-operative Group (Co-op) supermarket chain and British retailer giant\nMarks & Spencer (M&S)\n.\nHarrods told BleepingComputer that threat actors recently attempted to hack into its network, which prompted the luxury department store to restrict internet access to sites. While Harrods didn't share whether its systems were breached, limiting access to some platforms hints at an active response to the attack.\nOn Wednesday, Co-op\ndisclosed another cyber incident\nafter what they described as attempts to hack into their systems. However, Co-op Chief Digital and Information Officer Rob Elsey said in an internal memo urging employees to be vigilant when using email and Microsoft Teams that VPN access has been disabled, indicating potential containment measures following a security breach.\nLast week, Marks & Spencer was also\nhit by a cyberattack\nthat caused\ndisruptions across online ordering systems\nand impacted its contactless payments and Click & Collect services.\nBleepingComputer later confirmed that the\nMarks & Spencer breach was a ransomware attack\nwith threat actors using tactics associated with\nScattered Spider\n, where they deployed the DragonForce ransomware on the company's network.\nOther high-profile attacks linked to Scattered Spider include those on\nMGM Resorts\n,\nCaesars\n,\nMailChimp\n,\nTwilio\n,\nDoorDash\n,\nCoinbase\n,\nRiot Games\n, and\nReddit\n.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nHarrods the next UK retailer targeted in a cyberattack\nMarks & Spencer pauses online orders after cyberattack\nMarks & Spencer confirms a cyberattack as customers face delayed orders\nCo-op confirms data theft after DragonForce ransomware claims attack\nMarks & Spencer breach linked to Scattered Spider ransomware attack"
    },
    {
        "Title": "TikTok fined €530 million for sending European user data to China",
        "Link": "https://www.bleepingcomputer.com/news/security/tiktok-fined-530-million-for-sending-european-user-data-to-china/",
        "Summary": "The Irish Data Protection Commission (DPC) has fined TikTok €530 million (over $601 million) for illegally transferring the personal data of users in the European Economic Area (EEA) to China, violating the European Union's GDPR data protection regulations. [...]",
        "Date": "2025-05-02",
        "Content": "The Irish Data Protection Commission (DPC) has fined TikTok €530 million (over $601 million) for illegally transferring the personal data of users in the European Economic Area (EEA) to China, violating the European Union's GDPR data protection regulations.\nThe administrative fines imposed by the Irish watchdog consist of a fine of €485 million for its infringement of Article 46(1) GDPR regarding the lawfulness of the data transfers to China and a fine of €45 million for its infringement of Article 13(1)(f) regarding the lack of transparency.\nTikTok was also ordered to bring its data processing into compliance within six months, with the DPC planning to suspend all data transfers to China if the company fails to update its policies in time.\nDPC officials pointed out that the issue goes beyond the location of the servers and is also about the risk that Chinese authorities could access the data of European users under domestic laws concerning terrorism and espionage, which contravene EU standards.\n\"TikTok's personal data transfers to China infringed the GDPR because TikTok failed to verify, guarantee and demonstrate that the personal data of EEA users, remotely accessed by staff in China, was afforded a level of protection essentially equivalent to that guaranteed within the EU,\"\nsaid\nDPC Deputy Commissioner Graham Doyle.\n\"As a result of TikTok's failure to undertake the necessary assessments, TikTok did not address potential access by Chinese authorities to EEA personal data under Chinese anti-terrorism, counter-espionage and other laws identified by TikTok as materially diverging from EU standards.\"\nThe DPC added that TikTok claimed during the investigation that it did not store users' data from the European Economic Area (EEA) on servers located in China.\nHowever, in April 2025, TikTok revealed that it had discovered in February 2025 that some EEA user data had been stored on servers in China, contradicting the company's earlier statements.\n\"The DPC is taking these recent developments regarding the storage of EEA User Data on servers in China very seriously,\" Doyle said in a Friday statement. \"Whilst TikTok has informed the DPC that the data has now been deleted, we are considering what further regulatory action may be warranted, in consultation with our peer EU Data Protection Authorities.\"\nTikTok to appeal DPC's decision\nHowever, Christine Grahn, TikTok's Head of Public Policy & Government Relations for Europe,\nsaid\nthe company disagrees with the DPC's decision and that it's planning to appeal it because it fails to consider TikTok's new Project Clover data security initiative.\n\"Under Project Clover, TikTok has implemented advanced privacy-enhancing technologies (PETs), such as encryption-on-access and differential privacy, to ensure that non-restricted data is de-identified before it can be accessed by employees in China,\" Grahn said. \"Crucially, independent cybersecurity experts at NCC Group have verified that these safeguards are working as intended.\"\nThis is the third-largest fine imposed by the Irish data protection authority so far, after sanctioning Amazon with\n746 million euros\nfor its targeted behavioral advertising practices and Facebook with\n1.2 billion euros\nfor transferring data of EU-based users to the United States.\nPreviously, TikTok was slapped\nwith a €345 million ($368 million) fine\nby the DPC for violating the privacy of children while processing their data and employing \"dark patterns\" during the registration process and while posting videos, nudging users toward selecting options that compromised their privacy.\nIn January 2023, TikTok was also\nfined €5 million ($5.4 million)\nby France's data protection authority (CNIL) for failing to adequately inform users about its cookie usage and making it challenging to opt-out.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nApple fined €150 million over App Tracking Transparency issues\nUK watchdog probes TikTok and Reddit over child privacy concerns\nHackers abuse IPv6 networking feature to hijack software updates\nWhatsApp unveils 'Private Processing' for cloud-based AI features\nBrave's Cookiecrumbler tool taps community to help block cookie notices"
    },
    {
        "Title": "Microsoft fixes Exchange Online bug flagging Gmail emails as spam",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-exchange-online-bug-flagging-gmail-emails-as-spam/",
        "Summary": "​Microsoft has resolved an issue with a machine learning model that mistakenly flagged emails from Gmail accounts as spam in Exchange Online. [...]",
        "Date": "2025-05-02",
        "Content": "​Microsoft has resolved an issue with a machine learning model that mistakenly flagged emails from Gmail accounts as spam in Exchange Online.\nTracked as\nEX1064599\nin the Microsoft 365 admin center, the issue started impacting users on April 25 at 09:24 UTC, automatically moving emails erroneously tagged as malicious to the junk folder.\n\"We've identified that our machine learning (ML) model, which safeguards Exchange Online against risky email messages, is incorrectly identifying legitimate email messages as spam due to their similarity to email messages used in spam attacks, which is resulting in impact,\" the company explained when it acknowledged the ML model bug.\nIn a final update to the incident report added on May 1 at 16:31 UTC, Microsoft said it successfully reverted the buggy ML model to the previous working version, mitigating the false positive issue. It also added that admins and users may have also been able to create custom allow rules to ensure that Gmail messages weren't sent to the junk folder while the service was impacted.\n\"After a period of monitoring, we've confirmed through our service health telemetry that the completion of reverting to the previous ML model has successfully remediated impact,\" Microsoft added. \"We're continuing to investigate opportunities to improve our ML detection process to reduce false positive detections and prevent similar future impact.\"\nWhile Redmond has yet to share what regions or how many customers were affected, this service issue was tagged as an incident, which typically involves noticeable user impact.\nMicrosoft has handled similar issues since the start of the year, leading to emails being incorrectly tagged as spam or quarantined. For instance, last week, the company mitigated another machine-learning issue that\nmistakenly flagged Adobe emails\nin Exchange Online as spam.\nIn March, it addressed\nanother Exchange Online false positive\n, causing anti-spam systems to quarantine some users' emails incorrectly.\nIn October 2023, it also had to\ndisable a bad anti-spam rule\nflooding Microsoft 365 admins' inboxes with blind carbon copies (BCC) of outbound emails mistakenly flagged as spam, while in August 2024, it\nmitigated an Exchange Online bug\ntagging emails containing images as malicious and automatically quarantining them.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft fixes machine learning bug flagging Adobe emails as spam\nMicrosoft: Exchange Online bug mistakenly quarantines user emails\nWeek-long Exchange Online outage causes email failures, delays\nGoogle rolls out easy end-to-end encryption for Gmail business users\nMicrosoft Exchange Online outage affects Outlook web users"
    },
    {
        "Title": "Microsoft makes all new accounts passwordless by default",
        "Link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-makes-all-new-accounts-passwordless-by-default/",
        "Summary": "Microsoft has announced that all new Microsoft accounts will be \"passwordless by default\" to secure them against password attacks such as phishing, brute force, and credential stuffing. [...]",
        "Date": "2025-05-02",
        "Content": "Microsoft has announced that all new Microsoft accounts will be \"passwordless by default\" to secure them against password attacks such as phishing, brute force, and credential stuffing.\nThe announcement comes after the company started rolling out\nupdated sign-in and sign-up user experience (UX) flows\nfor web and mobile apps in March, optimized for passwordless and passkey-first authentication.\n\"As part of this simplified UX, we're changing the default behavior for new accounts. Brand new Microsoft accounts will now be 'passwordless by default',\"\nsaid\nJoy Chik, Microsoft's President for Identity & Network Access, and Vasu Jakkal, Corporate Vice President for Microsoft Security.\n\"New users will have several passwordless options for signing into their account and they'll never need to enroll a password. Existing users can visit their account settings to delete their password.\"\nRedmond says the best passwordless method will be enabled for each account and set as the default. The company also wants more customers to switch to passkeys, a more secure alternative to passwords that uses biometric authentication, such as fingerprints and facial recognition.\nOnce they're signed in, users will be prompted to enroll a passkey, and the next time they log into their accounts, they'll be asked to sign in with their passkey.\nMicrosoft passwordless sign-in (Microsoft)\n​\"This simplified experience gets you signed in faster and in our experiments has reduced password use by over 20%,\" Chik and Jakkal added.\n\"As more people enroll passkeys, the number of password authentications will continue to decline until we can eventually remove password support altogether.\"\nMicrosoft is a board member of the FIDO Alliance, an open industry association launched over a decade ago that promotes passkeys as a\nstandard passwordless sign-in method\nused by 15 billion user accounts for authentication.\nIt also rolled out support for\npasskey authentication for personal Microsoft accounts\na year ago after adding a\nbuilt-in passkey manager for Windows Hello\nwith the Windows 11 22H2 feature update.\nMore recently, ​it started testing WebAuthn API updates\nto add support for using third-party passkey providers\nfor Windows 11 passwordless authentication.\nTop 10 MITRE ATT&CK\n©\nTechniques Behind 93% of Attacks\nBased on an analysis of 14M malicious actions, discover the top 10 MITRE ATT&CK techniques behind 93% of attacks and how to defend against them.\nRead the Red Report 2025\nRelated Articles:\nMicrosoft testing Windows 11 support for third-party passkeys\nMicrosoft fixes Exchange Online bug flagging Gmail emails as spam\nCommvault says recent breach didn't impact customer backup data\nMicrosoft: Windows Server hotpatching to require subscription\nWindows 11 KB5055627 update released with 30 new changes, fixes"
    },
    {
        "Title": "UK Retailers Reeling From Likely Ransomware Attacks",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/uk-retailers-reeling-ransomware-attacks",
        "Summary": "A series of cyberattacks have struck multiple major British retailers in recent weeks, and a ransomware gang has reportedly claimed responsibility.",
        "Date": "2025-05-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/uk-retailers-reeling-ransomware-attacks"
    },
    {
        "Title": "What NY's New Security Rules Mean for Finance Firms",
        "Link": "https://www.darkreading.com/cybersecurity-operations/nydfs-rules-businesses-ny",
        "Summary": "According to the New York Department of Financial Services, finance companies operating in New York — even if not based there — must implement a variety of protections against unauthorized access to IT systems.",
        "Date": "2025-05-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cybersecurity-operations/nydfs-rules-businesses-ny"
    },
    {
        "Title": "Attackers Ramp Up Efforts Targeting Developer Secrets",
        "Link": "https://www.darkreading.com/threat-intelligence/attackers-targeting-developer-secrets",
        "Summary": "Software teams need to follow security best practices to eliminate the leak of secrets, as threat actors increase their scanning for configuration and repository files.",
        "Date": "2025-05-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/threat-intelligence/attackers-targeting-developer-secrets"
    },
    {
        "Title": "Despite Arrests, Scattered Spider Continues High-Profile Hacking",
        "Link": "https://www.darkreading.com/cyberattacks-data-breaches/despite-arrests-scattered-spider-continues-hacking",
        "Summary": "While law enforcement has identified and arrested several alleged members, the notorious threat group continues to wreak havoc.",
        "Date": "2025-05-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/cyberattacks-data-breaches/despite-arrests-scattered-spider-continues-hacking"
    },
    {
        "Title": "Cut CISA and Everyone Pays for It",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/cut-cisa-everyone-pays",
        "Summary": "Gutting CISA won't just lose us a partner. It will lose us momentum. And in this game, that's when things break.",
        "Date": "2025-05-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.darkreading.com/vulnerabilities-threats/cut-cisa-everyone-pays"
    },
    {
        "Title": "xAI Dev Leaks API Key for Private SpaceX, Tesla LLMs",
        "Link": "https://krebsonsecurity.com/2025/05/xai-dev-leaks-api-key-for-private-spacex-tesla-llms/",
        "Summary": "A employee at Elon Musk's artificial intelligence company xAI leaked a private key on GitHub that for the past two months could have allowed anyone to query private xAI large language models (LLMs) which appear to have been custom made for working with internal data from Musk's companies, including SpaceX, Tesla and Twitter/X, KrebsOnSecurity has learned.",
        "Date": "2025-05-02",
        "Content": "An employee at Elon Musk’s artificial intelligence company xAI leaked a private key on GitHub that for the past two months could have allowed anyone to query private xAI large language models (LLMs) which appear to have been custom made for working with internal data from Musk’s companies, including SpaceX, Tesla and Twitter/X, KrebsOnSecurity has learned.\nImage: Shutterstock, @sdx15.\nPhilippe Caturegli, “chief hacking officer” at the security consultancy Seralys, was the first to publicize the leak of credentials for an x.ai application programming interface (API) exposed in the GitHub code repository of a technical staff member at xAI.\nCaturegli’s post on LinkedIn caught the attention of researchers at GitGuardian, a company that specializes in detecting and remediating exposed secrets in public and proprietary environments. GitGuardian’s systems constantly scan GitHub and other code repositories for exposed API keys, and fire off automated alerts to affected users.\nGitGuardian’s Eric Fourrier told KrebsOnSecurity the exposed API key had access to several unreleased models of Grok, the AI chatbot developed by xAI. In total, GitGuardian found the key had access to at least 60 fine-tuned and private LLMs.\n“The credentials can be used to access the X.ai API with the identity of the user,” GitGuardian wrote in an email explaining their findings to xAI. “The associated account not only has access to public Grok models (grok-2-1212, etc) but also to what appears to be unreleased (grok-2.5V), development (research-grok-2p5v-1018), and private models (tweet-rejector, grok-spacex-2024-11-04).”\nFourrier found GitGuardian had alerted the xAI employee about the exposed API key nearly two months ago — on March 2. But as of April 30, when GitGuardian directly alerted xAI’s security team to the exposure, the key was still valid and usable. xAI told GitGuardian to report the matter through its bug bounty program at HackerOne, but just a few hours later the repository containing the API key was removed from GitHub.\n“It looks like some of these internal LLMs were fine-tuned on SpaceX data, and some were fine-tuned with Tesla data,” Fourrier said. “I definitely don’t think a Grok model that’s fine-tuned on SpaceX data is intended to be exposed publicly.”\nxAI did not respond to a request for comment. Nor did the 28-year-old xAI technical staff member whose key was exposed.\nCarole Winqwist, chief marketing officer at GitGuardian, said giving potentially hostile users free access to private LLMs is a recipe for disaster.\n“If you’re an attacker and you have direct access to the model and the back end interface for things like Grok, it’s definitely something you can use for further attacking,” she said. “An attacker could it use for prompt injection, to tweak the (LLM) model to serve their purposes, or try to implant code into the supply chain.”\nThe inadvertent exposure of internal LLMs for xAI comes as Musk’s so-called Department of Government Efficiency (DOGE) has been feeding sensitive government records into artificial intelligence tools. In February, The Washington Post reported DOGE officials were feeding data from across the Education Department into AI tools to probe the agency’s programs and spending.\nThe Post said DOGE plans to replicate this process across many departments and agencies, accessing the back-end software at different parts of the government and then using AI technology to extract and sift through information about spending on employees and programs.\n“Feeding sensitive data into AI software puts it into the possession of a system’s operator, increasing the chances it will be leaked or swept up in cyberattacks,” Post reporters wrote.\nWired reported in March that DOGE has deployed a proprietary chatbot called GSAi to 1,500 federal workers at the General Services Administration, part of an effort to automate tasks previously done by humans as DOGE continues its purge of the federal workforce.\nA Reuters report last month said Trump administration officials told some U.S. government employees that DOGE is using AI to surveil at least one federal agency’s communications for hostility to President Trump and his agenda. Reuters wrote that the DOGE team has heavily deployed Musk’s Grok AI chatbot as part of their work slashing the federal government, although Reuters said it could not establish exactly how Grok was being used.\nCaturegli said while there is no indication that federal government or user data could be accessed through the exposed x.ai API key, these private models are likely trained on proprietary data and may unintentionally expose details related to internal development efforts at xAI, Twitter, or SpaceX.\n“The fact that this key was publicly exposed for two months and granted access to internal models is concerning,” Caturegli said. “This kind of long-lived credential exposure highlights weak key management and insufficient internal monitoring, raising questions about safeguards around developer access and broader operational security.”\n\r\n         This entry was posted on Thursday 1st of May 2025 08:52 PM \r\n         \nCould someone explain to me how something like this would occur? What was the possible cause for someone on the team to publish a private API key? In this case is an API key needed to push to GitHub, I’m wondering how would that end up in the files apart from on purpose? I don’t know much about these subjects so maybe someone with more insight could offer an explanation. Thanks for any help.\nTypically this has occurred through an error on the users behalf where an API key file is copied into a repository while writing scripts or code that makes calls to the api. This was very likely not deliberate but speaks to either a lack of experience or knowledge around how to handle sensitive information. In other words a rookie mistake\nThis is very common. Developers write tests inside the repos and run the git add command without checking anything. They neither add anything to the ignore file, so many keys are constantly being pushed to GitHub and all other Source Controls. Supposedly, GitHub has key detection to prevent this from happening, but it mainly detects AWS keys, GCP keys, etc. Your key may pass the evaluation process if it has a high entropy. In our company, we ask the developers to run a SAST tool to find secrets in the commits before they get pushed to the repos. There are plenty of Google Dorks examples to look for those keys around, and you will be surprised how many are out there. Too many.\nI’m not a developer, but I wonder why developers are publishing this regardless to a public repository instead of a private one. Especially since SpaceX is a government contractor. Maybe a simple case of Musk not wishing to pay for something as ‘inefficient’ as an internal repo license and infrastructure?\nOh no. But that would be akin to government waste. We couldn’t possibly deny C-Suite and our investors of their hard earned bonuses.\nThe developer made some sort of program that uses the API key, and the API key was stored in a settings file (.env).\nWhen publishing the program, the dev accidentally pushed the settings (with the api key inside) to a public repository.\nA good practice is to never publish these environment variables / settings to github, even not into private repos.\nBut it’s a very common mistake, hence entire companies focusing on detecting these mistakes as their core business.\nGiven that code parameters require deliberate efforts to use an indirect reference to secrets, millions of keys are uploaded to GitHub. They charge for the feature that can detect and prevent it, and it’s also imperfect in what patterns it detects, so even catching poor practices already in play requires a 4th layer for high confidence that oversights are mitigated (peer review + scan when code is committed + regular scans + 3rd party scan). GitHub supports the first 3 for Enterprise licenses. The 4th can run on the Dev workspace, in the build pipeline, out of band – and a 5th can also be scanning the live application.\nWhat makes this worse is that AI coding is trained on examples that follow poor practices, so it encourages devs to fall for it.\nhttps://www.techmonitor.ai/technology/cybersecurity/10-million-exposed-credentials-open-source-code-repositories?cf-view\nThis is why lazy vibe coding is so dangerous. Once the secret sprawl sets in, you’re compromised forever.\nWhat’s the big deal here? This is freedom of speech, in general. 🙂\nYour email address will not be published. Required fields are marked *\nComment * \nName * \nEmail * \nWebsite \n \n\n\n\nΔ\nMailing List\nSearch KrebsOnSecurity\nRecent Posts\nStory Categories\nWhy So Many Top Hackers Hail from Russia"
    },
    {
        "Title": "Raytheon, Nightwing to Pay $8.4 Million in Settlement Over Cybersecurity Failures",
        "Link": "https://www.securityweek.com/raytheon-to-pay-8-4-million-in-settlement-over-cybersecurity-failures/",
        "Summary": "<p>The US government says defense contractor Raytheon and Nightwing agreed to pay $8.4 million to settle False Claims Act allegations.</p>\n<p>The post <a href=\"https://www.securityweek.com/raytheon-to-pay-8-4-million-in-settlement-over-cybersecurity-failures/\">Raytheon, Nightwing to Pay $8.4 Million in Settlement Over Cybersecurity Failures</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/raytheon-to-pay-8-4-million-in-settlement-over-cybersecurity-failures/"
    },
    {
        "Title": "In Other News: NullPoint Source Code Leak, $17,500 for iPhone Flaw, BreachForums Down",
        "Link": "https://www.securityweek.com/in-other-news-nullpoint-source-code-leak-17500-for-iphone-flaw-breachforums-down/",
        "Summary": "<p>Noteworthy stories that might have slipped under the radar: NullPoint Stealer source code leaked, researcher earns $17,500 from Apple for vulnerability, BreachForums down after zero-day exploitation by police.</p>\n<p>The post <a href=\"https://www.securityweek.com/in-other-news-nullpoint-source-code-leak-17500-for-iphone-flaw-breachforums-down/\">In Other News: NullPoint Source Code Leak, $17,500 for iPhone Flaw, BreachForums Down</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/in-other-news-nullpoint-source-code-leak-17500-for-iphone-flaw-breachforums-down/"
    },
    {
        "Title": "UK Retailers Co-op, Harrods and M&S Struggle With Cyberattacks",
        "Link": "https://www.securityweek.com/uk-retailers-co-op-harrods-and-ms-struggle-with-cyberattacks/",
        "Summary": "<p>Major UK retailers Co-op, Harrods, and M&#038;S are scrambling to restore services that were affected by cyberattacks.</p>\n<p>The post <a href=\"https://www.securityweek.com/uk-retailers-co-op-harrods-and-ms-struggle-with-cyberattacks/\">UK Retailers Co-op, Harrods and M&#038;S Struggle With Cyberattacks</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/uk-retailers-co-op-harrods-and-ms-struggle-with-cyberattacks/"
    },
    {
        "Title": "Nova Scotia Power Says Hackers Stole Customer Information",
        "Link": "https://www.securityweek.com/nova-scotia-power-says-hackers-stole-customer-information/",
        "Summary": "<p>Nova Scotia Power’s investigation has shown that the recent cyberattack resulted in the theft of some customer information.</p>\n<p>The post <a href=\"https://www.securityweek.com/nova-scotia-power-says-hackers-stole-customer-information/\">Nova Scotia Power Says Hackers Stole Customer Information</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/nova-scotia-power-says-hackers-stole-customer-information/"
    },
    {
        "Title": "RSA Conference 2025 Announcement Summary (Day 3)",
        "Link": "https://www.securityweek.com/rsa-conference-2025-announcements-summary-part-3/",
        "Summary": "<p>Hundreds of companies showcased their products and services this week at the 2025 edition of the RSA Conference in San Francisco.</p>\n<p>The post <a href=\"https://www.securityweek.com/rsa-conference-2025-announcements-summary-part-3/\">RSA Conference 2025 Announcement Summary (Day 3) </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/rsa-conference-2025-announcements-summary-part-3/"
    },
    {
        "Title": "Microsoft Accounts Go Passwordless by Default",
        "Link": "https://www.securityweek.com/microsoft-accounts-go-passwordless-by-default/",
        "Summary": "<p>Microsoft is prioritizing passwordless sign-in and sign-up methods, and is making new accounts passwordless by default.</p>\n<p>The post <a href=\"https://www.securityweek.com/microsoft-accounts-go-passwordless-by-default/\">Microsoft Accounts Go Passwordless by Default</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/microsoft-accounts-go-passwordless-by-default/"
    },
    {
        "Title": "Ukrainian Nefilim Ransomware Affiliate Extradited to US",
        "Link": "https://www.securityweek.com/ukrainian-nefilim-ransomware-affiliate-extradited-to-us/",
        "Summary": "<p>Ukrainian national Artem Stryzhak was extradited to the US and charged with using Nefilim ransomware in attacks on large businesses.</p>\n<p>The post <a href=\"https://www.securityweek.com/ukrainian-nefilim-ransomware-affiliate-extradited-to-us/\">Ukrainian Nefilim Ransomware Affiliate Extradited to US</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>",
        "Date": "2025-05-02",
        "Content": "Error fetching article: 403 Client Error: Forbidden for url: https://www.securityweek.com/ukrainian-nefilim-ransomware-affiliate-extradited-to-us/"
    }
]